{
    "url": "https://stratcommand.blog.gov.uk/2024/04/24/aca-womens-cricket-gib/",
    "title": "Army women's cricket development tour in Gibraltar",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "International",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-24T15:27:19+01:00",
    "content": [
        {
            "text": "Under the captaincy of Officer Cadet Milly Till, the 16-member squad from the Army Women’s Cricket Team arrived in Gibraltar, eager to make the most of the week-long training sessions."
        },
        {
            "text": "As the team prepare to take on civilian cricket teams, as well as going head to head with a UK Police Force, training sessions were used to fine-tune their strategies and combinations in preparation for the upcoming English Cricket Season."
        },
        {
            "text": "During their training programme, the team, which consists of soldiers, officer cadets, reservists, and regulars, conducted several training sessions both indoor and outdoor and were given the chance to watch the Estonia vs Gibraltar Women’s cricket match at Europa Point."
        },
        {
            "text": "The squad were given a last minute opportunity to play two games against the Estonian cricket team where the Army Women’s Development Team came away with two wins."
        },
        {
            "text": "Speaking about the game, Team Captain, Officer Cadet Milly Till said: “The game against the Estonian Team was of great value for both teams and we all really enjoyed it.”"
        },
        {
            "text": "It was not all about the training, and the players took some time off where they enjoyed walks along the glorious Gibraltar beaches, learned about the wonderful history on a tunnel tour and took part in several team bonding sessions."
        },
        {
            "text": "Supervisory care lead and assistant tour manager, Lieutenant Colonel Sarah Streete said: “The key thing about the development team is that we want to develop from grassroots up, so it is not just people who have come into the Army, who already play cricket."
        },
        {
            "text": "Most of these players have never played cricket before so this development tournament is to teach them how to play and understand the game, in the hope they will take what they have learnt back and then play in the senior team."
        },
        {
            "text": "They have come out on this development tour where they are getting quality coaching in a quality location.”"
        }
    ]
}