{
    "url": "https://dluhcmedia.blog.gov.uk/2024/04/24/coverage-of-the-renters-reform-bill/",
    "title": "Coverage of the Renters (Reform) Bill",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-04-24T19:13:25+01:00",
    "content": [
        {
            "text": "There has been widespread coverage of the Renters (Reform) Bill after it returned to the House of Commons today (Wednesday, April 24), including BBC Online, Today programme, the Sun, Guardian, Playbook and the Telegraph."
        },
        {
            "text": "Many outlets have included the Secretary of State’s comments that it is his “determination is to ensure that we get this Bill on the statute book”. Minister Young is also quoted across the coverage saying that the Bill will deliver the manifesto commitment to abolish Section 21 no-fault evictions, and that it strikes the “right balances”, ensuring “fairness for landlords” and protection for tenants."
        },
        {
            "text": "Some coverage today has inaccurately suggested we are watering down our commitments on abolishing section 21 notices – or no-fault evictions. Abolishing section 21 notices is a manifesto commitment and we have been very clear that we will end these no-fault evictions as soon as possible."
        },
        {
            "text": "We have always said that we will give six months’ notice before ending section 21 tenancies to give the sector some time to implement these changes. And we have now today committed to making sure the county court system time had to adjust to the new possession processes, with an assessment of the county courts to ensure they are ready for these changes."
        },
        {
            "text": "The bill delivers the biggest changes to the rental sector in 30 years and will:\n• stop landlords having blanket bans on renting to those with children or who are on benefits;\n• apply and enforce the Decent Homes Standard to the private rented sector for the first time, so that everyone has a safe and decent home;\n• for the first time give tenants a legal right to ask to have their much-loved pets in their home;\n• give landlords strengthened grounds for possession if a tenant is in rent arrears or they want to sell their property – we are investing in the county courts so that landlords can benefit from a modern, efficient possession system;\n• mean landlords are able to act more quickly to evict tenants who make others’ lives miserable through anti-social behaviour; and\n• help resolve disputes between landlords and tenants more quickly, with a new Private Rented Sector Landlord Ombudsman."
        },
        {
            "text": "A DLUHC spokesperson said:"
        },
        {
            "text": "\"Our commitment to scrap section 21 no-fault evictions as soon as possible is unchanged."
        },
        {
            "text": "“We have always said we will give six months notice before ending section 21 for all new tenancies. In addition, we have committed to ensuring improvements in the courts service are rapidly implemented before extending this abolition to all existing tenancies.”"
        }
    ]
}