{
    "url": "https://moderncivilservice.blog.gov.uk/2024/04/24/delivery-mission-book-club-great-reads-to-boost-your-productivity/",
    "title": "Delivery mission book club: great reads to boost your productivity",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Innovation",
        "Interoperability",
        "Modernisation and Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-04-24T12:04:23+01:00",
    "content": [
        {
            "text": "Over the last month we have been focusing on the topic of what it means to be an ambitious civil servant, and how programmes across departments are helping us deliver outstanding service to the public. "
        },
        {
            "text": "In our recent newsletter, we asked our readers to share their reading/ podcast/ video recommendations on delivery, project management and productivity, and created our new Book Club list — this time focused on the Delivery mission. Here’s what you recommended to us, and if you're looking for more great reads, check out our Innovation book list too!"
        },
        {
            "text": "Chloe from Cabinet Office:"
        },
        {
            "text": "Atomic Habits by James Clear"
        },
        {
            "text": "Reveals the science of tiny habits to get 1% better everyday to stay productive, motivated and happy, and how these small changes will have a transformative effect on your career, relationships and your life."
        },
        {
            "text": "Zosia from HMRC:"
        },
        {
            "text": "Slow Productivity by  Cal Newport"
        },
        {
            "text": "I recommend the book Slow Productivity, by American Computer Science professor Cal Newport. His book Deep Work is also a classic, and World Without Email takes a more organisation centred approach to productivity. "
        },
        {
            "text": "This book can help finding the right balance between productivity and meaningful life, and explores how taking things “slow” can mean better based on three principles: Do fewer things, work at a natural pace, and obsess over quality."
        },
        {
            "text": "Jack from Cabinet Office:"
        },
        {
            "text": "Now Big Things Get Done by Bent Flyvbjerg and Dan Gardner "
        },
        {
            "text": "Why do big projects go wrong so often, and are there any lessons you can use when renovating your kitchen? Bent Flyvbjerg is the ‘megaproject’ expert, and Dan Gardner brings the storytelling skills to How Big Things Get Done, with examples ranging from a Jimi Hendrix studio to the Sydney Opera House."
        },
        {
            "text": "Jon from HMRC:"
        },
        {
            "text": "Inside the Mind of a Master Procrastinator TED Talk by Tim Urban"
        },
        {
            "text": "I love this talk on procrastination from Tim Urban — it is even showcased on our learning and development page!"
        },
        {
            "text": "In this very entertaining TED talk, Tim talks about what it’s like being the ultimate procrastinator who waits until the last second to get things done — we’ve all been there! — and how to really get to the bottom of why we’re procrastinating. Great inspiration and reassurance to anyone who works best under pressure."
        },
        {
            "text": "Dean from Home Office:"
        },
        {
            "text": "Be Useful: Seven tools for life by Arnold  Schwarzenegger"
        },
        {
            "text": "This book offers practical strategies for personal development, fostering empowerment, clarity, and inspiration. Readers gain valuable insights into overcoming challenges, making informed decisions, and pursuing goals with purpose. "
        },
        {
            "text": "Through introspective exercises, the book promotes self-awareness and resilience, equipping readers to navigate life's complexities with confidence. It instils a mindset of continuous learning and growth, encouraging lifelong development and adaptation to change."
        },
        {
            "text": "Olga from Cabinet Office:"
        },
        {
            "text": "The Jordan Harbinger Show podcast"
        },
        {
            "text": "Episodes vary between topics depending on guests but many are focused around productivity."
        },
        {
            "text": "Getting things done by David Allen"
        },
        {
            "text": "A good old classic! David Allen created a whole system of managing incoming information to avoid overload and inspire clear, focused thinking. It is definitely worth trying!"
        },
        {
            "text": " "
        }
    ]
}