{
    "url": "https://dfedigital.blog.gov.uk/2024/04/24/forming-good-habits-early-in-figma/",
    "title": "Forming good habits early in Figma ",
    "authors": [
        "Rick Garnett"
    ],
    "categories": [
        "Content design",
        "design",
        "multidisciplinary teams",
        "Service design",
        "User-centred design"
    ],
    "pub_date": "2024-04-24T09:39:15+01:00",
    "content": [
        {
            "text": "No matter which software you use for your role, there is every likelihood that you might not be using it in the most efficient way. This is not a criticism. We are all human and generally when we find a path of least resistance, we stick with it. This is often never truer than when using design software. Particularly when the task is complex and the best way to achieve it is repeating the same steps – even if those steps are the ‘long way round’."
        },
        {
            "text": "Collaborating with colleagues who use the same software as you can be a fantastic way to learn new techniques. It can also be a great way to reveal that there's a smarter way to complete a task. Yet, in these days of remote working, the opportunities to sit together and share ‘over the shoulder' moments are decreasing."
        },
        {
            "text": "In the design community at the DfE (Department for Education), we use Figma as part of a collection of tools that help us to"
        },
        {
            "text": " "
        },
        {
            "text": "Even though, Figma is still a new tool for many, it is established enough for its userbase to begin habit forming. Our design community is no different to many others in this respect."
        },
        {
            "text": "We have put together some tips on ‘working with Figma in DfE’ that might help designers. ."
        },
        {
            "text": "The top tips cover:"
        },
        {
            "text": "Often these tips are not covered in standard tutorials. Software owners may assume that they are inherent design skills or ones that you will pick up over time."
        },
        {
            "text": "Some of these techniques you might be using already. But you may find you have indeed been taking the long way round yourself."
        },
        {
            "text": "\n"
        }
    ]
}