{
    "url": "https://valuationoffice.blog.gov.uk/2024/04/24/how-we-value-hotels-2/",
    "title": "How we value: hotels",
    "authors": [
        "Chris Bridges - National Valuation Lead",
        "Anthony Robinson - National Valuation Lead"
    ],
    "categories": [
        "Business Rates",
        "How We Value"
    ],
    "pub_date": "2024-04-24T10:21:19+01:00",
    "content": [
        {
            "text": "Hotels are an essential part of the hospitality sector and play an important role in the economy. In England and Wales alone, there are around 8,000 operating at any given time, ranging from budget chains to luxury establishments. "
        },
        {
            "text": "The Valuation Office Agency (VOA) is responsible for calculating the rateable values of all commercial properties in England and Wales, including hotels.  "
        },
        {
            "text": "Rateable values are estimates of the annual rent a property could reasonably be expected to generate at a certain date (this is known as the Antecedent Value Date, or AVD). "
        },
        {
            "text": "They are used by local councils to calculate a property’s business rates bill. "
        },
        {
            "text": "Given the wide variety of hotels and the significant differences between each end of the market, we don’t value them all in the same way. Instead, we divide them into two categories, each with its own valuation method.  "
        },
        {
            "text": "These are: "
        },
        {
            "text": "Valuing small independent hotels "
        },
        {
            "text": "Small independent hotels will normally have 20 or fewer bedrooms (50 in central London) and don’t typically have other facilities. They are usually run as an individual business or as part of a small group. "
        },
        {
            "text": "When calculating the rateable value of any hotel, the best evidence we look for is rents which were agreed around the AVD. Many small hotels are rented on the open market, so there is good rental evidence available to base our valuations on. We ask ratepayers to share this rental information with us.  "
        },
        {
            "text": "This method is called the rental comparison basis.  "
        },
        {
            "text": "However, not every small hotel will be rented, so we can’t use this information alone. We need a measure to be able to compare and value all properties. The measure we use for small hotels is double bed units. A double room (including twin or king beds) is one double bed unit.  "
        },
        {
            "text": "Although we don’t have evidence for every property, we collect a large amount of rental information from across the sector. We take this evidence and calculate a set price per double bed unit for every type of small hotel. "
        },
        {
            "text": "For example, if the rent of a hotel was £10,000 and it had 10 double bed units, the price per unit would be £1000. We can apply this set price per unit to any similar hotel in a similar location to estimate its rent.  "
        },
        {
            "text": "Hotels in cities tend to have higher prices per unit than rural locations. Properties with more facilities such as lounges also have higher prices per unit. This is because they can charge more for accommodation. "
        },
        {
            "text": "The rateable values of all small hotels are therefore calculated by multiplying the number of double bed units by a set price per bedspace.  "
        },
        {
            "text": "Valuing large independent and chain hotels "
        },
        {
            "text": "Large chain operated hotels are not typically rented on the open market in the same way. We instead look at trade and costs of a range of hotels to work out what a reasonable rental would be.  "
        },
        {
            "text": "To estimate a reasonable rent, we calculate the gross profit of each hotel by deducting costs of purchases and working expenses from the gross receipts. This profit is then split into a fair income for the individual who operates the hotel and a remainder. The remainder is considered to be a reasonable rent.  "
        },
        {
            "text": "It wouldn’t be possible to analyse the full accounts of every large hotel in England and Wales, so we take a representative sample of hotels to analyse in full. After calculating a reasonable rent, we compare this figure to the gross receipts of the hotel, which gives us a percentage.  "
        },
        {
            "text": "For example, if the gross receipts of a hotel were £1m, and the remainder was £100,000, we can predict that the rent of a similar hotel would be 10% of its total receipts. "
        },
        {
            "text": "Doing this analysis gives us a range of percentages that we can apply to the gross receipts of any hotel to work out a fair open market rental value.  "
        },
        {
            "text": "Examples of how we categorise hotels and the percentages we apply can be found in the sector’s practice note. The practice note explains the valuation method in full, but categories of hotels include: "
        },
        {
            "text": "This is called the shortened receipts method. The rateable value is calculated by applying a set percentage to the Fair Maintainable Trade (FMT) of the hotel. "
        },
        {
            "text": "FMT means the trading potential of the property. Most of the time, FMT reflects the actual gross receipts of a hotel. However, sometimes a hotel may be over or under-trading compared to physically similar properties. We take over and under-trading into account to make sure we value the property - not the business model. "
        },
        {
            "text": "Working with the industry "
        },
        {
            "text": "We have worked with UK Hospitality, the largest representative body for hotels in the country, to understand the key factors that must be considered when calculating each hotel's rateable value. "
        },
        {
            "text": "Like any sector, hotels are subject to change over time in the way they are used, and this affects their values. This is why our method considers all aspects and can adapt to whatever the future holds. "
        }
    ]
}