{
    "url": "https://digitaltrade.blog.gov.uk/2024/04/24/how-we-found-inspiration-at-the-women-in-leadership-conference/",
    "title": "How we found inspiration at the Women in Leadership conference",
    "authors": [
        "Jennie Rich - Digital Engagement Manager",
        "Katie Pether, Deputy Service Owner",
        "Imogen Barker, Senior Engagement and Strategic Adoption Officer",
        "Pat Ryser-Welch - Senior Data Architect"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2024-04-24T10:34:42+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Jennie Rich"
        },
        {
            "text": "I am a Digital Engagement Manager in the Digital, Data and Technology (DDaT) directorate in the Department for Business and Trade (DBT). "
        },
        {
            "text": "I was very excited to join 29 of my female DDaT colleagues at the Women in Leadership conference in early February. It took place at Cardiff City Stadium and gave us a chance to learn how to develop our leadership skills and discover some new ones! It also gave some of us a chance to visit DBT’s Cardiff office for the first time. "
        },
        {
            "text": " I enjoyed the opportunity to network with women from across the Civil Service. It was also great to meet face to face with my DDaT colleagues who are based in various offices across the UK. "
        },
        {
            "text": "There were many inspiring sessions throughout the day. I am relatively new to leadership roles, so it was very useful to learn about personal leadership styles during Emily Miles’s talk. She is the Chief Executive Officer (CEO) of the Food Standards Agency and gave some good guidance on how to deal with people who disagree with you. Emily recommended making sure they can see you are hearing them and finding a way to move things forward. I will try this when I get the opportunity. "
        },
        {
            "text": "Katie Pether"
        },
        {
            "text": "Hi! I’m Katie - the Deputy Service Owner for our Investment Portfolio."
        },
        {
            "text": "I recently joined DBT after reading some of the blogs celebrating women’s work within DDaT.  "
        },
        {
            "text": "One of my favourite moments of the conference, was during the session with Tricia Hayes, Former Second Permanent Secretary for the Home Office. She was asked how she knew it was time to apply for her next challenge. Her response was that she followed her instinct, her gut and that spoke to me a lot. As a leader, I place a lot of value in following my intuition. I actively listen to how my teams and colleagues are feeling and what they are experiencing. This allows my next steps to be informed by more than just external demands. I hope every woman continues to channel that self-belief and push themselves to achieve great things. "
        },
        {
            "text": " As I reflect on the conference, I truly appreciate how we need teams filled with a rich diversity of experiences and thoughts. This enables us to create effective services for our society.  "
        },
        {
            "text": " P.S. My mother was previously the only woman in a completely male tech company. She was very jealous that 30 of us got quality time together meeting other women in digital teams! "
        },
        {
            "text": "Imogen Barker"
        },
        {
            "text": "Hello, I’m Imogen and I work as a Senior Engagement and Strategic Adoption Manager in DDaT."
        },
        {
            "text": "I found it a privilege to attend the Women into Leadership conference. It was so inspiring to be in a room surrounded by such supportive, strong and powerful female leaders. They all shared their experiences from starting out in their career right through to navigating their next steps post the Civil Service.  "
        },
        {
            "text": "For me the conference highlight was hearing from a wide variety of speakers, listening to them being so open and vulnerable about their experiences. In particular, one speaker shared their journey dealing with their leadership style being questioned. This led to them realising self-doubt can be a huge positive when it comes to seeing the bigger picture. Participating in the breakout sessions also encouraged me to interact with lots of individuals from a range of different departments. This helped me build strong networks across the Civil Service.  "
        },
        {
            "text": " I will definitely encourage my colleagues to attend future events!  "
        },
        {
            "text": "Pat Ryser-Welch"
        },
        {
            "text": "It was great to join my female colleagues at the Women in Leadership conference.  The session with Cath Baxter, one of the UK’s leading vocal coaches, was a very positive experience.  She taught us how to use our hands and voice to effectively communicate in online meetings as well as face-to-face. Warming up our vocal cords before meetings had some appeal, but I decided perhaps best completed in privacy. Hearing about negotiating skills based on listening, mirroring, and compromising was most useful."
        },
        {
            "text": "We also learnt to become our own brand in a session led by Carol Stuart who is an Executive Career and Leadership Coach. She encouraged us to never fear taking opportunities that appeal most to each of our individual interests, and working culture. Carol advised us to remain authentic to ourselves in our own leadership styles and prioritise with confidence.    "
        },
        {
            "text": "Senior female civil servants shared their amazing career stories and provided good tips to empower each delegate. The author and journalist Yasmin Alibhai-Brown closed the day. She shared her inspirational journey from poverty to studying at Oxford University and developing an outstanding career in journalism, while raising a family.  "
        },
        {
            "text": "The networking opportunities brought together DBT colleagues, developing closer working relationships and creating new ones during the day. All participants would like to thank DBT for continuing investing time and resources in our own development. "
        },
        {
            "text": "Summary from Jennie "
        },
        {
            "text": "It was wonderful to take this opportunity to spend time face to face with women both from DBT and other government departments. Those of us in DDaT who attended the conference now keep in touch through a dedicated channel on Microsoft Teams. We will certainly attend future Women in Leadership conferences and encourage our female colleagues to join us. "
        }
    ]
}