{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/04/24/marham-rfc-in-gibraltar/",
    "title": "Marham Bulls Rugby Football club visit Gibraltar",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-24T15:23:41+01:00",
    "content": [
        {
            "text": "RAF Marham’s Rugby Club, known as Marham Bulls RFC, participated in an intensive week-long training camp in Gibraltar in preparation for the RAF Cup Final in May against either RAF Coningsby or RAF Akrotiri."
        },
        {
            "text": "The Bulls, formed under Group Captain Butcher, are a mixture of Royal Navy (RN) and Royal Air Force (RAF) personnel who maintain, support, and fly the F-35B Lightning Aircraft that operate from HMS Queen Elizabeth and HMS Prince of Wales."
        },
        {
            "text": " "
        },
        {
            "text": "By forming this joint venture, it has given the Bulls access to play in both the RN and RAF Domestic Cup competitions resulting in the team being the RAF Plate Champions in 2021 and currently top of the RAF Cup Merit Table."
        },
        {
            "text": "For the last two seasons, RAF Marham have toured Cyprus and played the RAF Akrotiri Flamingos but this year they decided to do something different, hence the tour to Gibraltar."
        },
        {
            "text": "Thirty-two players and support staff arrived in Gibraltar last Tuesday, where they immediately commenced their tour with a training session before they took to the pitches in Europa Point to participate in a touch competition where they won all their games as well as lending players to other teams to complete teams to ensure a successful tournament."
        },
        {
            "text": "The team played two matches against local teams Ibex Buccaneers RFC and Gibraltar RFU Barbarians, winning 33 – 26 against the Buccaneers and 70 – 15 against the Barbarians."
        },
        {
            "text": "During their visit, they conducted the arduous Rock Run, visited the World War II Tunnels and Trafalgar Cemetery, before taking to the water and conducting sailing in Gun Wharf, HMNB."
        },
        {
            "text": "The Bulls manager, Chief Petty Officer Wright, said: “We would like to thank everybody from British Forces Gibraltar and the Gibraltar Rugby Football Union for hosting our personnel from RAF Marham this week."
        },
        {
            "text": "We have enjoyed our time both on and off the field and gained a couple of good results which puts us in a great place for the RAF Cup Final at Stafford Rugby Club on the 15 May.”"
        }
    ]
}