{
    "url": "https://prisonjobs.blog.gov.uk/2024/01/17/a-business-administrators-journey-eleanors-story/",
    "title": "A Business Administrator's journey: Eleanor's story",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Business administrator",
        "Personal stories"
    ],
    "pub_date": "2024-01-17T16:47:31+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When thinking about roles in the Prison Service, a Business Administrator is probably not the first that comes to mind. Meet Eleanor, a Business Admin who started the role when she was 18 years old. Currently at HMP/YOI Isis, she works in the Business Hub. The role of a Business Administrator has always fascinated her as her parents worked in the Prison Service."
        },
        {
            "heading": 3,
            "text": "Read on to hear more about Eleanor’s journey to becoming a Business Administrator."
        },
        {
            "text": "Eleanor’s expectation vs reality"
        },
        {
            "text": "When asked if she had any misconceptions of the role before starting, Eleanor said that she doesn’t think she did “because I had family members talk me through it, but I definitely didn't know what to expect when I joined because they worked in a different prison and obviously every prison is different.” Eleanor works in HMP/YOI Isis which is a Category C men’s prison in South East London and young offender institution for young offenders who are aged 18-30. Before starting, Eleanor also didn’t know what department she would be going into. She says, “it was interesting to find out that I’d be in the finance department…I didn’t realise how much finance was involved in the prison service until joining.”"
        },
        {
            "text": "Benefits and challenges of the role"
        },
        {
            "text": "As a Business Administrator, you’ll get a great range of Civil Service and Prison Service benefits, including generous annual leave and pension contributions and flexible working. Eleanor notes that “flexible working hours is a great benefit to everyone that works here. It always benefits people who have other things in their life.” There are also great on-the-job training and progression opportunities."
        },
        {
            "text": "As for challenges, Eleanor explains that “you take each day at a time so there are problems that pop up, but you’ve got your team around you. You can get past most challenges, and if not, someone’s always there to help you.”"
        },
        {
            "text": "Skills and qualities for success in the role"
        },
        {
            "text": "Eleanor shared some insights into what makes a good Business Admin. She explains that “you definitely have to be organised in your role in the sense of making sure that you’ve got set tasks to do during the day and that they get done, as well as multitasking.” She also thinks that “customer service and communication are good skills to have in this role. We don't talk to customers but use this skill when speaking to other staff members and making sure that communication gets across to other departments.” Before becoming a Business Admin, Eleanor was in various customer-facing roles which was useful experience to have. She says, “you have to be patient especially when explaining something to someone that is frustrated”."
        },
        {
            "text": "Day-to-day responsibilities"
        },
        {
            "text": "Eleanor went on to talk us through her day-to-day responsibilities shedding light on her routine tasks: “As a Business Admin, it's a lot of answering requests from prisoners, doing phone calls and emails and spreadsheets. In my prison, we’ve got an app called the biometrics, where prisoners can make requests on an electronic system, and we can answer them.” The role involves a mix of administrative tasks, but this can vary depending on which department you are placed in, for example Eleanor is currently in the business hub and so deals “with a lot of finance, such as ordering. We also deal with PIN credit, which is something that prisoners get when they have money. It allows them to request money to go on their phone that’s in their cell and that manually has to be done every day.”"
        },
        {
            "text": "Training and development"
        },
        {
            "text": "As a Business Admin you won’t complete any fitness training because it’s a non-operational role and direct encounters with prisoners are unlikely. Prior to starting, Eleanor completed Nomis training which is “essentially an online system that can be used for everything from charging offenders to looking up offenders”. The Nomis online courses cover a wide variety of training needed to do the job effectively."
        },
        {
            "text": "As a Business Admin, you’ll play a vital role in keeping our prisons running. From organising, producing, and maintaining accurate records, to acting as a point of communication for their teams, our Business Admins get involved in an incredible variety of work."
        },
        {
            "text": "If you’ve got the ambition to grow and develop, and the patience and attention to detail to thrive in a team environment, we want to hear from you."
        }
    ]
}