{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/01/17/calling-all-graduates-grad-scheme-opportunity-at-the-cma/",
    "title": "Calling all graduates: Grad scheme opportunity at the CMA",
    "authors": [
        "Louis Phillips"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2024-01-17T15:42:17+00:00",
    "content": [
        {
            "text": "Applications for our Delivery Graduate Scheme are open for September 2024! If you’ve recently graduated or will be graduating soon and are looking to start up your career, this could be the perfect opportunity for you."
        },
        {
            "heading": 1,
            "text": "The Scheme"
        },
        {
            "text": "As a graduate at the CMA, you will form an integral part of our multi-disciplinary teams as a delivery case officer. You will gain hands-on experience in CMA casework which can involve mergers, markets, antitrust investigations, subsidy advice and much more."
        },
        {
            "text": "This is an exciting springboard opportunity to gain valuable experience working alongside legal, economic, financial and other experts across our delivery teams."
        },
        {
            "text": "As a Case Officer on the Graduate Scheme, you will do three 12-month placements in various delivery teams and contribute to the delivery of high-quality outputs, assisting major investigations and studies. This could involve writing draft proposals for investigations, planning and executing dawn raids, analysing documents, developing strategy, and assisting with project management."
        },
        {
            "heading": 1,
            "text": "Our training programme"
        },
        {
            "text": "During your time at the CMA, you’ll also get to advance your skills and knowledge through a structured training programme. The programme will be spread over the 3 years of the scheme and is designed to:"
        },
        {
            "text": "You will also be sponsored to study part-time for an external academic qualification related to your work at the CMA."
        },
        {
            "heading": 1,
            "text": "Application details"
        },
        {
            "text": "If you’re interested in the Scheme, we’d love to hear from you!"
        },
        {
            "text": "Please register for our online ‘Q&A’ event on Wednesday 24 January to find out more."
        },
        {
            "text": "Applicants must be based and eligible to work in the UK."
        },
        {
            "text": "Upon applying, you will have three tests to complete comprising verbal reasoning, numerical reasoning and management judgement. After these, you will be presented with an application form to fill in."
        },
        {
            "text": "If you’re successful, you’ll be invited to attend an assessment centre and interview."
        },
        {
            "text": "Find out more and apply by 6 February 2024."
        }
    ]
}