{
    "url": "https://civilservice.blog.gov.uk/2024/01/17/holocaust-memorial-day-2024-why-it-matters-to-civil-servants/",
    "title": "Holocaust Memorial Day 2024 – Why it matters to civil servants",
    "authors": [
        "Michael Livingston"
    ],
    "categories": [
        "A Brilliant Civil Service",
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2024-01-17T15:48:51+00:00",
    "content": [
        {
            "text": "Michael Livingston reflects on how the UK Government saved his grandfather from persecution, and why marking Holocaust Memorial Day is more important than ever, especially for those serving the public."
        },
        {
            "text": "On 31 January 1939, Friedrich (Fred) Weiss landed at Harwich in Essex to start his new life in the UK. Already 17, he was too old to be an official Kindertransport refugee, but travelled here with many of them from his home in Austria, fleeing Nazi persecution. Originally granted temporary leave to enter, he latterly became a British citizen, setting up a successful furniture business in Glasgow, marrying and raising his family there."
        },
        {
            "text": "In 2019, one day short of 80 years after his arrival, 10 Downing Street held a Holocaust Memorial Day commemoration, hosted by his grandson – me. Colleagues at the very centre of Government heard the testimony of a Holocaust survivor, Steven Frank, alongside one from Eric Eugene Murangwa, a survivor of the Rwandan genocide (and, incidentally, a former international footballer)."
        },
        {
            "text": "The UK’s annual Holocaust Memorial Day was established by the Government in 2001 and takes place on 27 January - this year, marking the 79th anniversary of the liberation of the Auschwitz-Birkenau death camp. It remembers the millions of people killed in the Holocaust, Nazi Persecution and in subsequent genocides in Cambodia, Rwanda, Bosnia, and Darfur. In 2024, this coincides with the thirtieth anniversary of the Rwandan Genocide."
        },
        {
            "text": "Remembering is more important than ever. People often invoke the platitude ‘never again’, but the point is that it has happened again in those more contemporary genocides. Hate continues to destroy and divide communities – right now, we are seeing massively increased levels of antisemitism and anti-Muslim hatred on the streets of the UK. It damages the most vulnerable, and it undermines the fabric of society. "
        },
        {
            "text": "And, yet, little more than ten years ago, the day was hardly marked at all in most Government departments. Spurred by this realisation, I worked with a group of inspirational colleagues across the Civil Service to build an HMD Champions network. And, in 2024, we now have almost thirty events taking place across every major Government department, as well as many of our agencies and arms’ length bodies."
        },
        {
            "text": "Over the years, tens of thousands of civil servants – and countless Ministers – have joined our events, in person and virtually, to hear from a broad range of speakers. Most importantly, this includes survivors of the Holocaust. With each passing year, the opportunities to hear a survivor grow ever fewer. Those of us who have had that privilege bear an almost sacred responsibility to take up that mantle. "
        },
        {
            "text": "Because acts like these can’t simply be perpetrated by individuals - they rely on an organised, state-sponsored regime. So it is crucial for those of us in government to hear these testimonies, and to learn the lessons. Those lessons are uniquely powerful, can shape our world view, and continue to be key to so many of the things for which we are responsible. "
        },
        {
            "text": "Whether that is colleagues in FCDO and MOD seeking to bring and maintain peace around the world, the Home Office granting leave to those fleeing persecution, DLUHC building bridges between communities, or DfE ensuring that the next generation understand the mistakes of the past – wherever you are in Government, the impact of hearing a survivor’s story will add value to what you do. "
        },
        {
            "text": "This year’s HMD theme is the Fragility of Freedom and there is a varied programme of events already underway across departments. There are more details here, where you can also sign up for the whole-of-Government event being broadcast at 1pm on Friday 26 January to hear the testimony of Holocaust survivor Janine Webber BEM."
        },
        {
            "text": "As we mark Holocaust Memorial Day 2024, I leave all Civil Service colleagues with a call to action: "
        },
        {
            "text": "Light a candle in your window at 8pm on Saturday 27 January as part of a national moment of commemoration."
        }
    ]
}