{
    "url": "https://insolvencyservice.blog.gov.uk/2024/01/17/insolvency-scams-what-to-look-out-for/",
    "title": "Insolvency ‘scams’ – what to look out for",
    "authors": [
        "martinbaker"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-01-17T12:35:21+00:00",
    "content": [
        {
            "text": "Insolvency and debt problems can be worrying experiences for people and unfortunately there are a few unscrupulous individuals who seek to exploit that for their own personal gain."
        },
        {
            "text": "Here we provide information about some of the ways we have seen those individuals try to take advantage of people in debt, the things you should be looking out for, and what to do if you are ever unsure about an advertisement, call or offer."
        },
        {
            "heading": 2,
            "text": "Individual Voluntary Arrangements"
        },
        {
            "text": "Individual Voluntary Arrangements (IVA) can be an effective way for someone who is in financial difficulty to come to an agreement to pay their creditors. Unfortunately, scammers are targeting people with IVAs, and trying to extract money by offering to help them get compensation or get out of paying their debts altogether."
        },
        {
            "text": "However:"
        },
        {
            "text": "Things to look out for can include:"
        },
        {
            "heading": 2,
            "text": "If you are worried about your IVA"
        },
        {
            "text": "The first step to take if you can no longer make the agreed payments into your IVA is to talk to the Insolvency Practitioner who is supervising your IVA."
        },
        {
            "text": "Their contact details will be on the paperwork you received, and you should contact them as soon as possible."
        },
        {
            "text": "Your Insolvency Practitioner can discuss the options open to you, which might include:"
        },
        {
            "text": "Your Insolvency Practitioner will explain whether your creditors need to agree to these changes, and you can talk through further options with your Insolvency Practitioner if your creditors don’t agree."
        },
        {
            "text": "If you do not feel comfortable contacting your Insolvency Practitioner yourself, you should seek free assistance from a trusted organisation. You do not have to pay someone to speak to your Insolvency Practitioner on your behalf."
        },
        {
            "text": "You should continue to make your payments while you are discussing alternative options, otherwise you may be in breach of the terms of your IVA which means it could be ended, but you would still owe money to your creditors. This could also further affect your credit history."
        },
        {
            "text": "If you believe that your IVA has been ‘mis-sold’ to you, you should first contact your IVA supervisor to discuss the matter with them."
        },
        {
            "text": "If this doesn’t resolve the issue, you can make complaint to the supervisor’s authorising body via the Insolvency Service (How to complain about an insolvency practitioner - GOV.UK (www.gov.uk))."
        },
        {
            "heading": 2,
            "text": "Internet search engines and social media advertising"
        },
        {
            "text": "Social media platforms and internet search engines are increasingly used to advertise and promote insolvency and debt advice."
        },
        {
            "text": "They are also being used to advertise and promote debt management firms who claim to offer IVAs, or Protected Trust Deeds (PTDs) in Scotland."
        },
        {
            "text": "Unfortunately, some disreputable people are targeting people in debt and are active on social media. They’re advertising and promoting IVAs and PTDs and get paid for making referrals to another business."
        },
        {
            "text": "It can be difficult to work out who you are dealing with, and whether they’re properly qualified and authorised to provide the service they are advertising or promoting."
        },
        {
            "text": "It also means any advice you get could be wrong, misleading, or not in your best interests."
        },
        {
            "text": "Firms who give debt advice must be authorised by the Financial Conduct Authority (FCA) for ‘debt counselling’ and they have to follow the FCA’s rules. Similarly, Insolvency Practitioners have to be licenced to practice, and they are subject regulation by their professional body."
        },
        {
            "text": "You can check whether the business or person you are dealing with is authorised by the FCA by checking the FCA register Home (fca.org.uk)."
        },
        {
            "text": "If you’re not sure whether the adverts you’re seeing are from a regulated and authorised firm, warning signs to look out for can include:"
        },
        {
            "text": "If you are struggling with money, it is important to speak to a trusted debt adviser about your options.  If you’re unsure whether a communication is genuine, and you need help with your debts, approach a trusted, regulated debt adviser for their help. You should not have to pay for help or advice from an advisor on this list."
        },
        {
            "text": "If the firm is authorised by the FCA, but the warning signs above apply, you can make a complaint to FCA. The FCA also maintains a warning list of unauthorised firms and individuals they are aware of who are carrying out regulated activity without the correct authorisation."
        },
        {
            "text": "If the business is not authorised by the FCA and you think they are placing misleading adverts  you can make a complaint– even if it’s on social media – to the Advertising Standards Authority: https://www.asa.org.uk/make-a-complaint.html."
        },
        {
            "heading": 2,
            "text": "Impersonation of Insolvency Practitioner firms"
        },
        {
            "text": "There have also been reports of various websites which impersonate the services of licenced Insolvency Practitioners or their firms."
        },
        {
            "text": "Again, these websites may be offering to provide debt advice even though they are not authorised by the FCA to do so, they may falsely rely on the name of a regulated Insolvency Practitioner, or they may use wording that implies that they are a firm with licenced Insolvency Practitioners when they are not."
        },
        {
            "text": "A legitimate website claiming to offer debt advice services, or the services of an Insolvency Practitioner, must display the following on its homepage:"
        },
        {
            "text": "As above, if you are concerned or unsure you can check whether a business or individual is authorised by the FCA on its register at: Home (fca.org.uk)."
        },
        {
            "text": "The Insolvency Service maintains a database of licenced Insolvency Practitioners at: Find an insolvency practitioner - GOV.UK (www.gov.uk) where you can check details as well as contact details to speak to them directly if needed."
        },
        {
            "heading": 2,
            "text": "Fake Insolvency Service communications"
        },
        {
            "text": "The Insolvency Service has recently issued a warning regarding an increase in fraudulent activity which includes impersonation of Insolvency Service staff. Further details on the form this activity can take, and what to look out for, can be found at: Warning issued by the Insolvency Service on scams - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 2,
            "text": "More information"
        },
        {
            "text": "More information here about protecting yourself against financial scams Protect yourself from scams | FCA"
        },
        {
            "text": "A beginner's guide to scams | MoneyHelper"
        }
    ]
}