{
    "url": "https://socialcare.blog.gov.uk/2024/01/17/real-world-expertise-shapes-the-very-best-care/",
    "title": "Real world expertise shapes the very best care",
    "authors": [
        "Raf Hamaizia"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Diversity",
        "Workforce"
    ],
    "pub_date": "2024-01-17T15:25:41+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Who are the Experts by Experience?"
        },
        {
            "text": "Experts by Experience are people with lived experience of using, or caring for someone who has used, health and or social care services."
        },
        {
            "text": "The Cygnet Experts by Experience (EBE) programme is a testament to the paradigm shift taking place in a sector embracing co-production and the value of people with lived experience."
        },
        {
            "text": "This is about giving service users a voice at every level of the organisation, providing hope and inspiring others. We help shape discussions and act as a reminder to consider and incorporate the fundamental lived experience perspective. The role is about creating change and representing views, with elements of peer support and advocacy being part of our day to day."
        },
        {
            "text": "When I first took the role of EBE Lead in 2018, there were around 23 services at Cygnet. Today, we have over 160, creating many opportunities for the growing Expert by Experience team to harness lived experience."
        },
        {
            "text": "From a modest beginning with three EBEs, Cygnet now boasts a team of over 30, supported by hundreds more, whose insights can be tapped into through the extensive networks of our support organisations."
        },
        {
            "heading": 2,
            "text": "Driving change"
        },
        {
            "text": "This growth hasn’t been all about numbers though; we now have the ability to make a bigger impact through fostering positive and inclusive cultures on a national level."
        },
        {
            "text": "Externally, our team has been involved in everything from the Independent Review of the Mental Health Act, the Rapid Review into in-patient mental health services and numerous pieces of national guidance and legislation."
        },
        {
            "text": "Each and every EBE has their own unique journey and challenges to overcome. Having the courage and passion to support others is something we must all take time to appreciate."
        },
        {
            "text": "Cygnet has actively embraced and integrated lived experience into its working fabric, with a positive and accepting culture being a key driving force behind the programme’s success."
        },
        {
            "heading": 2,
            "text": "Positive culture"
        },
        {
            "text": "Cygnet's positive culture has been instrumental in shaping an environment where the voices of EBEs are heard, valued and actioned. There is recognition that diverse perspectives contribute to a more comprehensive and effective approach to health and social care services."
        },
        {
            "text": "In addition to the significant growth in services, the influence of EB’s has brought about transformative organisational changes. They have played a pivotal role in implementing People’s Council meetings, now a regular feature at every service, giving people a voice at every level of the organisation."
        },
        {
            "text": "Beyond the service level, their impact extends to the incorporation of individuals with lived experience in board meetings both regionally and nationally, and everything from co-producing training, initiatives and policy to recruitment processes, guidance and quality improvement projects."
        },
        {
            "heading": 2,
            "text": "Wider impact"
        },
        {
            "text": "Our collaborative efforts have contributed to the creation of gaming rooms and social hubs, fostering spaces that go beyond traditional care settings and contribute to the holistic wellbeing of people accessing services."
        },
        {
            "text": "Through partnerships with Experts by Experience, the People’s Council and the Procurement department, catering staff, and suppliers, we worked together to enhance the quality of food in our service. Initiatives such as Chef Development Days, co-producing menus, and a national group food chat, means food quality satisfaction has nearly doubled in under a year."
        },
        {
            "text": "We have also been involved in many fun initiatives over the years, including the Music 2 Empower project, launched in October 2019. This project aims to share the positive effects of music therapy across our services and showcase talented service users."
        },
        {
            "text": "More recently we have had the pleasure of supporting the Co-sustain project which promotes recycling and sustainability amongst service users."
        },
        {
            "heading": 2,
            "text": "Future"
        },
        {
            "text": "I am eagerly anticipating a future where Experts by Experience play an increasingly pivotal role in shaping national policy, fostering positive cultural change and making sure services continue going above and beyond with lived experience perspectives at their core."
        },
        {
            "text": "This year, we will launch Cygnet’s Co-production Strategy, reflecting our commitment to enhancing and developing existing structures, with power-sharing and working together as equal partners being the primary aim."
        }
    ]
}