{
    "url": "https://traderemedies.blog.gov.uk/2024/01/17/talking-shop-international-engagement-and-the-tra/",
    "title": "Talking shop: international engagement and the TRA",
    "authors": [
        "Sophia Ostler, International Relations Advisor"
    ],
    "categories": [
        "Engagement"
    ],
    "pub_date": "2024-01-17T11:00:04+00:00",
    "content": [
        {
            "text": "An essential part of building our capability and achieving our mission to become an internationally respected trade remedies authority is developing fruitful relationships with our global counterparts. This work on international relations is focused on two specific goals."
        },
        {
            "heading": 2,
            "text": "Improving ways of working"
        },
        {
            "text": "The first is to engage with counterparts to improve our ways of working. This means sharing best practice, fostering continuous learning and building technical expertise."
        },
        {
            "text": "For example, the USA model is helping us to review when best to introduce hearings in our investigations, and how best to present our work on subsidies to make it more accessible to potential applicants. Thanks to the in-person technical exchanges we have held with colleagues from the US Department of Commerce Enforcement & Compliance and the US International Trade Commission, our relationships have been strengthened and we have identified areas where we can potentially refine our policies."
        },
        {
            "text": "We have had similar productive exchanges with the Anti-Dumping and Countervailing Directorate of the Canada Border Services Agency (CBSA), the Canadian International Trade Tribunal (CITT), and with New Zealand counterparts (MBIE). We have also had informative conversations with the Australian Dumping Commission (ADC) around WTO disputes."
        },
        {
            "text": "Sharing best practice works two ways. Just as we learn from our global counterparts on what has worked for them and what hasn’t, we also seek to pass on our experience in specific aspects of our work. For example, we have been sharing our experience of creating a digital platform for our public file with the New Zealand trade remedies team who are hoping to create something similar and we have shared our experience in case specific issues and with challenges around industry engagement during cases."
        },
        {
            "text": "We have also collaborated with our counterparts in the Brazilian Ministry of Economy (Subsecretaria de Defesa Comercial e Interesse Público, Secretaria Especial de Comércio Exterior e Assuntos Internacionais) in the publication of a book on the Economic Interest Test."
        },
        {
            "text": "Looking to the future, we would like to enter into dialogue with smaller, emerging authorities. For example, we have had early discussions with Pakistan around digitising their work."
        },
        {
            "heading": 2,
            "text": "Becoming internationally recognised"
        },
        {
            "text": "The second goal is to be recognised as a leading player in international trade policy developments and align them where possible to our domestic priorities. In practice this means that, in collaboration with DBT, we are horizon scanning the latest international trade remedy developments and discussions, keeping abreast of what other countries are doing in this area. This helps us to assess the prospective effect of any developments on the UK’s domestic industry and potential applications which may arise in a similar vein."
        },
        {
            "text": "Part of how we do this is by participating in the notification committees at the WTO in Geneva and attending international conferences including the OECD Steel Committee in Paris, the Seoul International Forum on Trade Remedies, and the Trade Defence Yearly conference at the Vrije University in Brussels.  We’re using attendance at these events to build relationships and to tackle issues of shared interest, for instance when it comes to agreeing positions in cases taken to dispute at the WTO."
        },
        {
            "text": "In summary, international engagement is crucial to achieving our strategic goals, and we will keep talking to our global counterparts as we continue to defend the UK’s economic interests against unfair international trade practices."
        }
    ]
}