{
    "url": "https://space.blog.gov.uk/2024/01/17/uk-space-pioneers-recognised-in-2024-new-year-honours/",
    "title": "UK space pioneers recognised in 2024 New Year Honours",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Astronomy",
        "Championing Space",
        "Education",
        "Events",
        "Space science"
    ],
    "pub_date": "2024-01-17T14:20:33+00:00",
    "content": [
        {
            "text": "This year’s New Year Honours saw many distinguished people, from the founder of Glastonbury Festival to leaders in tackling UK homelessness, being recognised for excellent work leaving a positive impact in their fields. Among them were 4 pioneers in the UK space sector. Each have been recognised for very different contributions, which showcases the vibrance and diversity of the UK’s thriving space sector. "
        },
        {
            "text": "A huge achievement by all of those recognised, and a massive congratulations from us all at the UK Space Agency. "
        },
        {
            "heading": 2,
            "text": "Dame Maggie Aderin-Pocock DBE"
        },
        {
            "text": "Chancellor, University of Leicester. For services to science education and diversity."
        },
        {
            "text": "Image credit: University of Leicester"
        },
        {
            "text": "A space scientist, science communicator, author and BAFTA-nominated broadcaster, Maggie is a well-known and loved figure in the UK space sector. As well as being known in the astronomy community for her significant contributions to instrumentation, such as the optical subsystem for the James Webb Space Telescope launched in 2021, her public engagement work has also brought her into the public eye. Audiences have enjoyed her co-hosting The Sky at Night, and she has reached many others through shows like Later with Jools Holland, 8 out of 10 Cats and The Clangers, as well as regular appearances on The One Show, Newsnight and Woman’s Hour. In 2023, Mattel created her Barbie doll, celebrating STEM and International Women's Day, and she became Chancellor of the University of Leicester. "
        },
        {
            "text": "Since being awarded her MBE she has continued to spread her message of encouragement to young people to not be afraid to dream big in their goals and aspirations. She has shown commitment to inspiring new generations of astronauts, engineers, and scientists through her public engagement company Science Innovation Ltd with the aim of increasing diversity in science, especially in terms of gender, neurodiversity and ethnic balance. "
        },
        {
            "text": "In 2023, Maggie co-hosted the UK Space Agency’s Space for Everyone online tour with ESA UK Astronaut Meganne Christian."
        },
        {
            "heading": 2,
            "text": "Professor Emma Bunce OBE"
        },
        {
            "text": "Professor of Planetary Plasma Physics, University of Leicester. For services to astronomy and science education."
        },
        {
            "text": "Image credit: University of Leicester"
        },
        {
            "text": "Emma is one of the foremost scientists in her field of planetary plasma physics, cited by EarthSky 2021 as one of the world’s most influential women in astronomy. Her research has been recognised with a series of awards, she has held several leading roles in space missions and in 2020 she became the 4th female President of the Royal Astronomical Society (RAS) and was also appointed Head of School, Physics and Astronomy at the University of Leicester. She has used these positions promote issues of equality, diversity and inclusion and to make positive changes in local, national and international science communities."
        },
        {
            "text": "She is keen to promote science to a wider audience and act as a role model for young women considering a career in sciences. She gives regular public talks on the solar system, contributes to TV programmes such as The Sky at Night and sat on a panel as part of Parliamentary Links Day 2019, designed to link parliamentarians with researchers to discuss the future of UK science."
        },
        {
            "heading": 2,
            "text": "Professor Phil Diamond CBE"
        },
        {
            "text": "Director General, Square Kilometre Array Organisation. For services to Global Radio Astronomy."
        },
        {
            "text": "Image credit: SKAO"
        },
        {
            "text": "Phil has led the Square Kilometre Array Organisation (SKAO) for over 2 decades. The SKA is a next-generation radio astronomy observatory which will operate across 3 continents, with radio telescopes in South Africa, Australia and its global headquarters in the UK. In that time it has developed from a small team to an intergovernmental organisation involving 16 countries in 2021. When completed it will be the largest scientific facility on the planet and will provide transformational science capabilities which will positively benefit the global astronomy community for decades to come."
        },
        {
            "text": "He continues to be engaged in research and holds a professorship in astrophysics at the University of Manchester, where he pursues interests in star-formation and stellar evolution, starburst galaxies, supernovae and the environments of super-massive black-holes, for which he predominately uses radio interferometry facilities."
        },
        {
            "heading": 2,
            "text": "Professor Mike Cruise OBE"
        },
        {
            "text": "Professor Emeritus of Astrophysics and Space Research at the University of Birmingham. For Services to space."
        },
        {
            "text": "Image credit: Professor Mike Cruise"
        },
        {
            "text": "Mike has played a significant role in making the UK an international leader in space science research, particularly in gravitational wave physics. At the University of Birmingham, where he is currently Professor Emeritus of Astrophysics and Space Research, he established gravitational wave research and made contributions to the first confirmed detection of gravitational waves in 2015."
        },
        {
            "text": "Throughout his career Mike has also been involved in the UK Space Agency’s work, contributing to policy making and chairing a number of our committees and project management boards."
        }
    ]
}