{
    "url": "https://digitaltrade.blog.gov.uk/2024/01/17/what-it-is-like-to-become-a-business-analyst-in-dbt/",
    "title": "What it is like to become a Business Analyst in DBT",
    "authors": [
        "Adebisi Iwediebo, Business Analyst",
        "Funmi Endeley, Business Analyst",
        "Kaye Boon, Head of Business Analysis"
    ],
    "categories": [
        "People",
        "Professions"
    ],
    "pub_date": "2024-01-17T10:00:29+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Adebisi Iwediebo - Business Analyst"
        },
        {
            "text": "I remember receiving a call from the recruitment team with the good news that I had been successful in my application for SEO Business Analyst in the Department for Business and Trade (DBT). I had just pulled into the car park of a local store 2 days after attending the interview, when the call came through. To say I was over the moon is to put it mildly. After the call, I sat in the car to take it all in and BREATHE!! Within the hour, I had received a provisional offer by email. You see, before I applied for the role, I had stumbled on a blog highlighting DBT as a department that supported women to grow and flourish in tech. I wanted to be here, be a part of this dream civil service department. I had been in the private sector, but I genuinely wanted the benefits the Civil Service, especially DBT, offered.  "
        },
        {
            "text": "Getting a provisional offer and starting the job was a different matter. The security clearance process took around 8 weeks to conclude. After an anxious wait, it was another ecstatic moment to finally receive the email informing me I was security cleared. The recruitment team was fantastic and extremely helpful through the entire process.  "
        },
        {
            "text": "All clad up, I travelled nice and early from Hertfordshire into London on my first day, Wednesday 17 October 2022. I was impressed and felt slightly intimidated at the ginormous size of Old Admiralty Building which is the London office for DBT. Fortunately, my line manager was on hand to meet me at the reception and help with getting a pass.   "
        },
        {
            "text": "As expected, my first few weeks were a little hazy and overwhelming. I juggled Civil Service induction and mandatory training along with the demands of the new project I joined. I remember going through the capability framework assessment which helps Civil Servants identify how they can develop their skills. I also volunteered to run a session along with colleagues from other professions at the DDaT away day. It was a super busy last quarter of the year 2022. Through it all, I received amazing support from my line manager and the thriving Business Analyst community here in the department.  "
        },
        {
            "text": "Since then, I have rolled onto other projects where I have continued to harness my skills. I supported a project that in-housed a service delivery team where I focused on systems and software critical to their first day in DBT. The next project looked to enhance the internal CRM to make it more seamless and intuitive to its users. I am currently working on a project looking at continuous improvements on a service that supports investors wishing to expand into the UK.   "
        },
        {
            "text": "The Civil Service is an employer that is big on development. Since joining, I have worked towards obtaining the BCS Business Analysis International diploma. I have passed 4 required modules and aim to complete the final oral examination within early 2024. I also feel enabled to gain experience in new areas on various learning platforms provided within the Civil Service. Civil servants are responsible for their development and line managers are always incredibly supportive.   "
        },
        {
            "text": "I attended the Business Analysis Europe Conference 2023 in September along with Funmi Endeley, a colleague with whom I started about the same time. We also attended the Women in Tech Hackathon organised by PA Consulting in September. We have collaborated on several occasions where we constantly promote the Business Analysis profession to the rest of the department.   "
        },
        {
            "text": "I marked my one-year anniversary on 17 October 2023 and in retrospect, I am so thankful I made that application. The versatility my job offers, though sometimes challenging, is a stimulus for growth and development. The Civil Service offer’s flexibility is incredible, making it possible to juggle a thriving career as well as managing the home front. It has indeed been an incredibly interesting and eventful journey.  "
        },
        {
            "heading": 3,
            "text": "Funmi Endeley - Business Analyst"
        },
        {
            "text": "‘You got the Job!’ I could not believe it. In fact, I thought the call was for another job I had interviewed for. I did not think I did very well at my interview for the Business Analyst role, and I had already convinced myself that I had been unsuccessful. It wasn’t until I received the pre-employment check documents did I truly I believe I had got the job. That started my journey as a Business Analyst in the Department for Business and Trade and what a journey it’s been. My first day was on Halloween 2022 and I hoped that was not an omen to what my experience would be! I have been proved so wrong. "
        },
        {
            "text": "In my first week, my manager told me to take it easy and complete my mandatory training. I would be put on a project and the Product Manager would be in contact next week. He contacted me on day two! That enthusiasm is something that I have seen in the Business Analysis Team and DDaT as a whole. "
        },
        {
            "text": "As a Business Analyst, my role is to help teams find improvements in their processes, understand business requirements and help the team ensure that business objectives are met. "
        },
        {
            "text": "Within the first couple of weeks, we had an event which involved all the Digital, Data and Technology (DDaT) directorate. My line manager encouraged me to actively take part in one of the sessions. I was worried about being the new girl in the group, but it was a lovely experience. I got to work with the most amazing colleagues with various knowledge sets. Since then, I have seized the opportunity to take part in various departmental and external events. "
        },
        {
            "text": "Most memorable has been the opportunity to take part in the Woman in Tech Hackathon. It was a wonderful time spent with other IT professionals, identifying areas of improvement for marginalised customers, and building a solution. That was when it hit me…I am a woman in tech, working in the Civil Service!  "
        },
        {
            "text": "I also had the opportunity to attend the Business Analysis Conference Europe held in London in September 2023 with Adebisi. We spent 3 days attending different sessions such as Building Brave BAs and The Future of Business Analysis in an era of Artificial Intelligence. It was an amazing event and a marvellous opportunity to learn and network.  "
        },
        {
            "text": "I have been involved in the most amazing projects. They have varied from a very technical infrastructure replacement project, to working with the Live Services Content Design Team. We improved their processes for publishing on DBT’s websites, GOV.UK and Great.gov. Now I’m working with the Tariff team who manage the UK tariff systems for the whole of the UK and the Channel Islands. The varied experience has helped me build my experience and confidence as a Business Analyst. "
        },
        {
            "text": "The Business Analysis Team is a great one to work in. Our line manager encourages us to step out of our comfort zones and take up learning opportunities. Teammates are always on hand to assist, share ideas and knowledge. The team lunches are pretty good too!  "
        },
        {
            "text": "DBT is great with providing learning opportunities and I am currently on the way to obtaining my Diploma in Business Analysis.  "
        },
        {
            "text": "It has been a very positive experience working within the DDaT part of DBT. Although I have had to step out of my comfort zone many times, I can see the growth and progress I have made. I look forward to embracing new opportunities in the next year.  "
        },
        {
            "heading": 3,
            "text": "Kaye Boon - Head of Business Analysis"
        },
        {
            "text": "It has been fantastic to be part of Adebisi and Funmi’s Civil Service career journey so far and to see their growth over the past year. They have made the most of both on the job and learning and development opportunities. Both are active members of our supportive BA community. I look forward to seeing what comes next in 2024!  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}