{
    "url": "https://valuationoffice.blog.gov.uk/2024/01/17/why-we-request-your-businesss-trade-information/",
    "title": "Why we request your business’s trade information",
    "authors": [
        "Meurig Morgan - Rent and lease details Product Owner"
    ],
    "categories": [
        "Business Rates"
    ],
    "pub_date": "2024-01-17T15:55:56+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Have you received a request for information from the Valuation Office Agency (VOA)?  "
        },
        {
            "text": "We are responsible for valuing all non-domestic properties in England and Wales. These are properties that are not solely used as private homes.  "
        },
        {
            "text": "To accurately value some non-domestic properties, we need information about the business’s trade. These properties include: "
        },
        {
            "text": "Why we need this information   "
        },
        {
            "text": "We regularly update rateable values to reflect changes in the property market. This is called a ‘revaluation’.  "
        },
        {
            "text": "Rateable values represent the rent the property could have been let for on a certain date set in law. However, for some types of property, it is hard to assess the value of the property from the rent alone. Sometimes rental evidence is limited or may not provide a true reflection of the value of a property. "
        },
        {
            "text": "For example, a tenancy agreement on a pub might include a condition that the tenant purchases their beer from a certain brewery. The landlord financially profits from this and may reflect this in the rent they charge. The rent may also include living accommodation for the tenant.  "
        },
        {
            "text": "We therefore ask for trade information and analyse income and expenditure to see what a reasonable rent might be. "
        },
        {
            "text": "This is a recognised valuation method approved by the Royal Institution of Chartered Surveyors (RICS) and used for many purposes, not just taxation.  "
        },
        {
            "text": "How we use your information "
        },
        {
            "text": "Providing your property information helps us to make sure that rateable values are accurate and everyone pays the right amount of business rates.  "
        },
        {
            "text": "It also means that your council gets the correct amount of money from taxpayers to fund local services. "
        },
        {
            "text": "How to share your information   "
        },
        {
            "text": "You only need to share your details with us if we have asked you to. "
        },
        {
            "text": "You can complete the request for information by post using the form we have sent to you. You can also complete our interactive form online and email it to specialist.rating@voa.gov.uk "
        },
        {
            "text": "If you do not send the information within 56 days of getting the form, you may have to pay a penalty.  "
        },
        {
            "text": "Top tips"
        },
        {
            "text": "We have put together some ‘top tips’ to help you complete your form.  "
        },
        {
            "text": "Tip one: Write in block capitals. This helps us to accurately understand the data you provide. "
        },
        {
            "text": "Tip two: Make sure you sign the form. We cannot accept unsigned forms and we will have to return it to you by post or contact you by email to request a signed version.  "
        },
        {
            "text": "Tip three: Provide an email address or phone number that we can contact you on. If something is wrong with your form, having your contact details helps us to resolve issues quickly and easily. If we do not have your contact information, we will have to send out another form by post for you to fill in again.  "
        },
        {
            "text": "We will never share your contact information with anyone else unless it is lawful to do so.   "
        },
        {
            "text": "Tip four: Check you have provided all the information we have asked for before you return the form. If you return the form and it is partially incomplete, you may still have to pay a penalty.  "
        },
        {
            "text": "If you need any support "
        },
        {
            "text": "If you need any support completing the form, our Market Information Team is on hand to help. You can email specialist.rating@voa.gov.uk.  "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A ydych wedi cael cais am wybodaeth oddi wrth Asiantaeth y Swyddfa Brisio (y VOA)?"
        },
        {
            "text": "Rydym yn gyfrifol am brisio pob eiddo annomestig yng Nghymru a Lloegr. Mae eiddo annomestig yn eiddo nad ydynt yn cael eu defnyddio fel cartrefi preifat yn unig."
        },
        {
            "text": "Er mwyn prisio rhai eiddo annomestig yn gywir, mae angen arnom wybodaeth am fasnach y busnes. Mae’r eiddo hyn yn cynnwys y canlynol:\n• tafarndai, bariau a bwytai sy’n gwerthu alcohol a bwyd\n• llety gwyliau\n• gwestai, tai gwesteion a fflatiau â gwasanaeth\n• meysydd carafannau a meysydd gwersylla\n• meysydd chwaraeon a chyrsiau golff\n• canolfannau garddio\n• gorsafoedd petrol\n• hosteli\n• generaduron pŵer adnewyddadwy\n• marchnadoedd da byw."
        },
        {
            "text": "Pam mae angen yr wybodaeth hon arnom"
        },
        {
            "text": "Rydym yn diweddaru gwerthoedd ardrethol yn rheolaidd i adlewyrchu newidiadau yn y farchnad eiddo. Gelwir hyn yn ‘ailbrisiad’."
        },
        {
            "text": "Mae gwerthoedd ardrethol yn cynrychioli’r rhent y gallai’r eiddo fod wedi’i ennill pe bai ar osod ar ddyddiad a bennir o dan y gyfraith. Fodd bynnag, ar gyfer rhai mathau o eiddo, mae’n anodd asesu gwerth yr eiddo ar sail y rhent yn unig. Weithiau mae tystiolaeth am rent yn brin neu efallai nad yw’n rhoi adlewyrchiad cywir o werth yr eiddo."
        },
        {
            "text": "Er enghraifft, efallai y bydd cytundeb tenantiaeth ar dafarn yn cynnwys amod bod y tenant yn prynu ei gwrw o fragdy penodol. Mae’r landlord yn elwa’n ariannol o hyn a gall adlewyrchu hyn yn y rhent y mae’n ei godi. Gall y rhent hefyd gynnwys llety byw i’r tenant."
        },
        {
            "text": "Gofynnir i chi, felly, am wybodaeth fasnachu a byddwn yn dadansoddi incwm a gwariant i weld beth fyddai’n rhent rhesymol."
        },
        {
            "text": "Mae hwn yn ddull prisio cydnabyddedig sydd wedi’i gymeradwyo gan Sefydliad Brenhinol y Syrfewyr Siartredig (RICS) ac sy’n cael ei ddefnyddio at sawl diben, nid trethiant yn unig."
        },
        {
            "text": "Sut yr ydym yn defnyddio’ch gwybodaeth"
        },
        {
            "text": "Mae darparu gwybodaeth am eich eiddo yn ein helpu i sicrhau bod gwerthoedd ardrethol yn gywir a bod pawb yn talu’r swm cywir o ardrethi busnes.\nMae hefyd yn golygu bod eich cyngor yn cael y swm cywir o arian gan drethdalwyr i ariannu gwasanaethau lleol."
        },
        {
            "text": "Sut i rannu eich gwybodaeth\nDim ond os ydym wedi gofyn i chi rannu’ch manylion gyda ni y bydd angen i chi wneud hynny."
        },
        {
            "text": "Gallwch gwblhau’r cais am wybodaeth drwy’r post gan ddefnyddio’r ffurflen yr ydym wedi’i hanfon atoch. Gallwch hefyd gwblhau ein ffurflen ryngweithiol ar-lein a’i hanfon drwy e-bost i specialist.rating@voa.gov.uk"
        },
        {
            "text": "Os na fyddwch yn anfon yr wybodaeth cyn pen 56 diwrnod ar ôl cael y ffurflen, mae’n bosibl y bydd yn rhaid i chi dalu cosb."
        },
        {
            "text": "Tips defnyddiol\nRydym wedi casglu “tips defnyddiol” i’ch helpu i lenwi’ch ffurflen."
        },
        {
            "text": "Tip un: Defnyddiwch briflythrennau. Mae hyn yn ein helpu i ddeall yn gywir y data rydych chi’n eu darparu."
        },
        {
            "text": "Tip dau: Gwnewch yn siŵr eich bod yn llofnodi’r ffurflen. Ni allwn dderbyn ffurflenni sydd heb eu llofnodi a bydd rhaid i ni eu dychwelyd atoch drwy’r post neu gysylltu â chi drwy e-bost i ofyn am fersiwn sydd wedi’i llofnodi."
        },
        {
            "text": "Tip tri: Rhowch gyfeiriad e-bost neu rif ffôn y gallwn ei ddefnyddio i gysylltu â chi. Os oes problem gyda’ch ffurflen, mae cael eich manylion cyswllt yn ein helpu i ddatrys problemau yn gyflym ac yn hawdd. Os nad oes gennym eich gwybodaeth gyswllt, bydd rhaid i ni anfon ffurflen arall drwy’r post i chi ei llenwi eto."
        },
        {
            "text": "Ni fyddwn byth yn rhannu eich gwybodaeth gyswllt gyda neb arall, oni bai ei bod yn gyfreithlon gwneud hynny."
        },
        {
            "text": "Tip pedwar: Gwiriwch eich bod wedi darparu’r holl wybodaeth rydym wedi gofyn amdani cyn i chi ddychwelyd y ffurflen. Os dychwelwch y ffurflen a’i bod yn rhannol anghyflawn, efallai y bydd rhaid i chi dalu cosb o hyd."
        },
        {
            "text": "Os oes angen unrhyw gymorth arnoch\nOs oes angen unrhyw gymorth arnoch i lenwi’r ffurflen, mae ein Tîm Gwybodaeth am y Farchnad wrth law i helpu. Gallwch anfon e-bost i specialist.rating@voa.gov.uk."
        }
    ]
}