{
    "url": "https://environmentagency.blog.gov.uk/2024/01/17/working-together-to-shut-down-waste-criminals/",
    "title": "Working together to shut down waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2024-01-17T10:49:16+00:00",
    "content": [
        {
            "text": "At Hampshire & Isle of Wight Constabulary, our dedicated Rural and Wildlife Crime Team, Country Watch, have been working closely with partner agencies and other local policing teams to tackle the scourge of waste crime."
        },
        {
            "text": "Operation Wolf"
        },
        {
            "text": "Our officers have teamed up with key local council partners, including Hampshire County Council’s waste management team, the Environment Agency and other police forces to conduct joint operations locally and on our county borders under Operation Wolf."
        },
        {
            "text": "Operation Wolf is set up to target vehicles which travel cross-border to commit rural crime; it also provides teams with proactive opportunities to deter and disrupt fly-tippers."
        },
        {
            "text": "Vehicles transporting waste must have a waste carrier’s licence, and motorists who are stopped by police without the relevant licence can expect to face further action from the Environment Agency."
        },
        {
            "text": "Operation Wolf ran bi-monthly operations across the whole force area through 2023 with support from other forces such as Wiltshire Police in the north of the county, and our Sussex and Surrey counterparts in the East."
        },
        {
            "text": "In October last year, we carried out a proactive operation in the Denmead area which saw police stop 67 vehicles. Of these, eight motorists were given advice or received follow-up contact from Environmental Health. A further 20 were dealt with for a raft of offences including driving without insurance or a licence, disqualified driving, driving with vehicle defects, or driving without a seatbelt. Three vehicles were seized by police."
        },
        {
            "text": "This was a collaborative piece of work involving the local council, HMRC, the Environment Agency and local police teams including the Commercial Vehicle Unit (CVU)."
        },
        {
            "text": "For those who are unfamiliar, CVU are experts in dealing with offences associated with HGVs and LGVs as well as tachograph offences. Specialist vehicle defect officers assist us in uncovering more offences and have the power to seize defected vehicles until the identified issues are corrected."
        },
        {
            "text": "The success of Operation Wolf so far has led to this now being a permanent partnership operation that will continue to target and stop those suspected of committing waste crimes."
        },
        {
            "text": "One thing that is important to recognise about Op Wolf is that this not only enables police to target illegal waste carriers, transient and organised criminals involved in rural crime, it opens the door to identify other offences on the road network as is evidenced by the job in Denmead."
        },
        {
            "text": "We may even identify drug offences. For example, an Op Wolf carried out in the New Forest led police to discover cannabis in a vehicle, in addition to a multitude of other vehicles being stopped for offences including lack of a waste carrier’s licence, driving without insurance, and transporting dangerous goods unsafely."
        },
        {
            "text": "Stop checking vehicles, proactive partnership operations and local police patrols all assist with deterring criminality, disrupting offenders, and gathering intelligence that assists with our future operational work."
        },
        {
            "text": " "
        },
        {
            "text": "You can help"
        },
        {
            "text": "If you find fly tipped waste, you can report this to your local council, and large scale illegal waste dumping can be reported anonymously to Crimestoppers: Report fly-tipping or illegal waste dumping - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Alternatively, you can report the incident on the go through apps and websites such as ClearWaste, FixMyStreet and LoveWhereYouLive."
        },
        {
            "text": "Remember: If you come across a crime in progress, call the police on 999. Do not confront fly-tippers, as they are engaged in a criminal activity and may respond unpredictably."
        }
    ]
}