{
    "url": "https://defrafarming.blog.gov.uk/2022/02/08/an-update-on-the-lump-sum-exit-scheme-and-delinked-payments/",
    "title": "An update on the Lump Sum Exit Scheme and delinked payments ",
    "authors": [
        "Alastair Walton"
    ],
    "categories": [
        "Farmers",
        "Things we're doing",
        "Things we've learned",
        "Ways to get involved"
    ],
    "pub_date": "2022-02-08T13:09:54+00:00",
    "content": [
        {
            "text": "It can be difficult for farmers who wish to retire or leave the industry to do so. A lack of capital can prevent them.  "
        },
        {
            "text": "We think that our Lump Sum Exit Scheme could help them. Last year, we ran a consultation with farmers and other experts, and the findings supported this view. In this post, I'll share a summary and our response. I'll also cover delinked payments and an opportunity for you to shape our work."
        },
        {
            "heading": 2,
            "text": "Supporting those who wish to leave farming"
        },
        {
            "text": "We plan to offer farmers in England who wish to exit the industry the option of applying in 2022 for a lump sum payment.  "
        },
        {
            "text": "We expect farmers will be able to apply from April 2022 until the end of September 2022. "
        },
        {
            "text": "The payment will be made once the farmer has met the scheme rules, including transferring out their agricultural land (with some exceptions). "
        },
        {
            "text": "Today we published guidance on lump sum payments for farmers who leave or retire from farming, and delinked payments."
        },
        {
            "text": " The guidance includes details of how these payments will be taxed. Once the full scheme rules are finalised, we'll publish an update on the blog. "
        },
        {
            "text": "We expect payments to begin to be made for some farmers from November 2022, but farmers will have a longer period if they need it to arrange their exit. "
        },
        {
            "text": "Once the farmer has received the lump sum, they won’t be able to claim further Basic Payment Scheme (BPS) payments or delinked payments in England. "
        },
        {
            "text": "We're designing the Lump Sum Exit Scheme to enable those who wish to retire or leave the industry to do so in a planned way. By freeing up land, the scheme will also open up opportunities for new entrants and farmers wishing to expand their businesses. "
        },
        {
            "text": "The Rural Payments Agency will send information to BPS applicants this month to explain how they can request a forecast statement showing the lump sum amount they could receive. "
        },
        {
            "heading": 2,
            "text": "Delinked payments "
        },
        {
            "text": "We intend to replace the Basic Payment Scheme with delinked payments in 2024. "
        },
        {
            "text": "When payments are delinked, recipients won’t have to farm the land to receive the payments. Delinked payments will be phased out by the end of 2027. Delinking will make things simpler for farmers and the Rural Payments Agency (RPA). "
        },
        {
            "text": "It will free up farmers to focus on running their business and delivering the public goods that can be rewarded under our new schemes, including the environmental land management schemes. "
        },
        {
            "text": "A farmer may get delinked payments even if they choose to stop farming altogether. "
        },
        {
            "text": "Those who continue farming will still have to comply with regulations that protect the environment, plant health, and animal welfare. The requirement to comply with these will not be related to the delinked payments they receive. "
        },
        {
            "text": "In the run up to delinking, we will keep working with farmers to ensure they continue to understand and meet regulations. "
        },
        {
            "heading": 2,
            "text": "Consultation summary"
        },
        {
            "text": "As I mentioned earlier, last year, we ran a consultation on a Lump Sum Exit Scheme for farmers and our proposed approach to delinked payments. We received 654 responses."
        },
        {
            "text": "After going through the responses, we decided: "
        },
        {
            "heading": 2,
            "text": "Improving our guidance "
        },
        {
            "text": "We'd like some volunteers to help us test scheme guidance and communications. If you’re interested, please leave your details in a comment so we can contact you. Your details will not be published publicly."
        },
        {
            "text": "If you have any questions, do leave comment below. For updates, please subscribe to the Future Farming blog.  "
        }
    ]
}