{
    "url": "https://apprenticeships.blog.gov.uk/2022/02/08/being-part-of-developing-apprenticeships/",
    "title": "Being part of developing apprenticeships",
    "authors": [
        "Lesley-Anne Alexander CBE"
    ],
    "categories": [
        "Employers",
        "Route Panel"
    ],
    "pub_date": "2022-02-08T13:21:05+00:00",
    "content": [
        {
            "text": "Lesley-Anne Alexander is Vice Chair of the Institute’s care services route panel and former CEO of the Royal National Institute of Blind People (RNIB). While at RNIB, Lesley-Anne was instrumental in uniting the fragmented sight loss sector through the development of the UK Vision Strategy. She also created the RNIB Group of charities. "
        },
        {
            "text": "Read on to find out more about Lesley’s career and how apprenticeships benefit her as an employer.  "
        },
        {
            "heading": 2,
            "text": "There is no such thing as a typical day in my world  "
        },
        {
            "text": "I allegedly retired in 2016 but have never been so busy! "
        },
        {
            "text": "I’ve worked in many different large organisations, social services, and charity worlds too. I’ve had brilliant and rewarding roles, including CEO of RNIB and Director of Operations at the Peabody Trust. I then moved into a ‘portfolio’ of roles which included being a non-executive director on a number of company boards and being an advisor to organisations and charities.  "
        },
        {
            "text": "I’m currently on the board of a bank, helping start-up companies to commercially raise funds for charities. I also run a social enterprise, baking cakes to raise money to support women in sub-Saharan Africa. "
        },
        {
            "text": "There is no such thing as a typical day in my world. I move between different organisations bringing my experience, amassed over 35 years, to help guide them to make great decisions that put service users/customers/beneficiaries at the heart of their thinking. "
        },
        {
            "heading": 2,
            "text": "Highlights of my career  "
        },
        {
            "text": "I was awarded a CBE from the Queen in 2012. It was totally unexpected and a proud moment in my career. It was amazing and a testament to the volunteers and staff at the organisations with which I have worked.  "
        },
        {
            "text": "I’ve had so many other amazing moments, including winning a High Court battle to ensure that those at risk of losing their sight received appropriate treatment, and increasing the welfare benefits that blind people received each week – that was pretty spectacular. Making sure that people had access to affordable housing was great too – healthy homes mean healthy lives and create security for adults and their families. Raising money to help women in sub-Saharan Africa support their families is an amazing motivator too. "
        },
        {
            "heading": 2,
            "text": "Identifying a need to upskill people  "
        },
        {
            "text": "I was, of course, flattered to be asked to join the Institute’s route panel to help review and advise on apprenticeship standards.  "
        },
        {
            "text": "My late Mum spent three years in a care home living with incredibly severe dementia. Uninformed people made comments about “never putting their relatives in a home” but it was completely impossible to help Mum stay at home - she became a danger to herself and those around her! She only slept for 15 minutes at a time and constantly woke my 85-year-old Dad up.  "
        },
        {
            "text": "I visited every day but could not do any more to support my parents. Mum was lucky to be admitted to a great care home. The staff were dedicated and caring, and the manager was brilliant. However, the staff were not well trained or supported by the company. It became clear to me that a well-structured programme of development would have been a valuable asset, and of course apprenticeships would have been the ideal solution. "
        },
        {
            "heading": 2,
            "text": "Apprenticeships benefit employers, learners and people looking to upskill alike  "
        },
        {
            "text": "Apprenticeships provide the perfect platform for “on-the-job” learning. They empower people to properly experience the workplace while receiving support and encouragement from those around them. Apprenticeships allow people to use their lived experience to enhance the quality of the services they deliver…in my parents’ case the carers made every day better for both Mum and Dad! "
        },
        {
            "text": "Apprenticeships are an ideal way to up-skill the workforce of “UK PLC” at all levels. They provide a pathway from entry level roles to senior management. Importantly, they impart high levels of skills which, in turn, make the customer better satisfied and therefore make the company more successful. A “win-win” on every level. "
        },
        {
            "text": "My early career was a bit chaotic. Unstructured and opportunistic would be a good description – plus with a bit of luck thrown in too! I didn’t go to university after school (much to my Mum’s disappointment!) but did eventually manage to get a master’s degree because of the great advice of a training officer at my then employers. I also managed to survive the drama of being a single mother; the flexibility that an apprenticeship would have brought would have been invaluable. "
        },
        {
            "text": "My advice for anyone would be “go for it” – follow your dreams and lean on your life experience to make you the best person you can be!"
        }
    ]
}