{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/02/08/develop-your-career-national-apprenticeship-week-7th-to-11th-february-2022/",
    "title": "Develop your career - National Apprenticeship Week 7th to 11th February 2022",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "Capability & Skills",
        "GSE Opportunities",
        "Talent & Leadership"
    ],
    "pub_date": "2022-02-08T16:25:07+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There are many routes to developing in the Civil Service and an apprenticeship is one of the most rewarding experiences to complete – they can, quite literally, turn someone’s life around.  Apprentices themselves gain new skills while working, a qualification and a new network of friends. Managers benefit from engaged employees who they see developing through their work and employers benefit from all this and more, helping to attract and retain skilled employees."
        },
        {
            "text": "An apprenticeship in science and engineering can help propel your career . For existing civil servants, the GSE profession encourages everyone to consider an apprenticeship at any point of their career, whether in science, engineering or other profession.  Check your departmental learning and development pages for details and read the Civil Service careers page on Apprenticeships."
        },
        {
            "text": "Level 7 systems thinking apprenticeship"
        },
        {
            "text": "For those who are not yet in the Civil Service, consider a career as an apprenticeship within one of the many government departments."
        },
        {
            "text": "Part of the Ministry of Defence, Dstl are recruiting apprentices through the following vacancies;"
        },
        {
            "text": "Level 3 Engineering Apprenticeship"
        },
        {
            "text": "Level 6 Electronics Degree Apprenticeship"
        },
        {
            "text": "Level 6 Ordinance Munition and Explosives degree Apprenticeship"
        },
        {
            "text": "Level 6 Software Engineer Degree Apprenticeship"
        },
        {
            "text": "More vacancies for apprenticeships in science or engineering are available on Civil Service Jobs."
        },
        {
            "text": " "
        }
    ]
}