{
    "url": "https://food.blog.gov.uk/2022/02/08/from-beehive-to-jar-the-complexities-of-honey-authenticity/",
    "title": "From beehive to jar, the complexities of honey authenticity",
    "authors": [
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2022-02-08T12:32:16+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Rick Mumford, Head of the Science, Evidence and Research directorate comments on the recent publication of the FSA commissioned review into the methods used to test honey authenticity."
        },
        {
            "text": " "
        },
        {
            "text": "Last year, we talked about the complex nature of honey authenticity and whether or not this ‘golden nectar’ is what it says it is."
        },
        {
            "text": "The sticking point has been that there is no single test that can give us this information and that’s why we’ve been working with Defra and our partners across industry and academia to come up with some answers."
        },
        {
            "text": "Back in November 2020, there was press coverage of a sampling survey, which questioned the authenticity of honey, based on an analysis of 13 own-brand honey samples from major UK retailers. This resulted in the FSA asking the Government Chemist, to provide an independent, expert opinion on the tests used and the results obtained."
        },
        {
            "text": "This review, authored by Dr Michael Walker, has now been published in the peer-reviewed Nature Portfolio Journal Science of Food, and this continues to show just how complex honey authenticity is."
        },
        {
            "text": "The Government Chemist’s report - which is a two-part publication - shows that you cannot determine the authenticity of honey from the data used in that particular survey and without other supporting evidence, a claim of adulteration, therefore, should not be made."
        },
        {
            "text": "The report also looks at how a valid authenticity claim might be made possible by using what is called statistical evaluative reporting - a method based on accepted forensic principles which evaluate the merits of the data available, to draw a conclusion on how likely it is that a sample is authentic."
        },
        {
            "text": "Using this method may enable us in the future to evaluate scientific findings and assess their strength, allowing us to put in place measures to identify and prevent fraudulent honey."
        },
        {
            "heading": 2,
            "text": "Is honey safe for consumers?"
        },
        {
            "text": "While there is no evidence that any honey on sale in the UK is unsafe, it is a product that is frequently described as being at risk of fraud through mislabelling or adulteration with sugar syrups. Issues can be introduced at various points along the global supply chain."
        },
        {
            "text": "The volume of blended product required for the honey market and the availability of plausible adulterants (such as sugar syrup), in addition to the price premium associated with higher value honey products, mean that it is a realistic possibility that adulterated or misrepresented honey is present within world honey supplies."
        },
        {
            "text": "However, detailed knowledge and understanding of the processes involved at each stage of the supply chain, and responding to it with assurance activity, can help businesses eliminate risk."
        },
        {
            "heading": 2,
            "text": "What will the FSA do next?"
        },
        {
            "text": "The FSA is working jointly with Defra, Food Standards Scotland and the Government Chemist to identify areas where government can help progress work on some of the scientific issues that have emerged."
        },
        {
            "text": "One way is to standardise the approach to testing, so that the data being produced is fit for purpose and that the ‘honey-chain’ is transparent and information can be passed on at every stage."
        },
        {
            "text": "We also want to put in place the most effective tools, and guidance for detecting honey fraud to ensure adequate enforcement that ultimately protects consumers and legitimate businesses."
        },
        {
            "text": "The recommendations from the Government Chemist papers are being reviewed by Defra and the FSA, drawing on scientific expertise from the Authenticity Methods Working Group and other experts to inform our approach."
        },
        {
            "text": "As always, consumers are at the heart of everything we do. Our aim is to maintain consumer confidence, reassure businesses involved in honey supply chains and reduce any risk of food fraud."
        },
        {
            "text": "We are continuing to work together with the honey industry to ensure that the honey you enjoy is safe, authentic and what it says it is."
        },
        {
            "heading": 1,
            "text": "\nO’r cwch gwenyn i’r potyn, cymhlethdodau dilysrwydd mêl "
        },
        {
            "text": "Mae Rick Mumford, Pennaeth y Gyfarwyddiaeth Ymchwil, Gwyddoniaeth a Thystiolaeth yn rhoi sylwadau ar yr adolygiad diweddar a gomisiynwyd gan yr Asiantaeth Safonau Bwyd (ASB) i’r dulliau a ddefnyddir i brofi dilysrwydd mêl. "
        },
        {
            "text": "Ar ddechrau’r flwyddyn hon, buom yn siarad am natur gymhleth dilysrwydd mêl a ph’un a yw’r ‘neithdar euraidd’ hwn yn cyd-fynd â’r hyn sydd ar y label."
        },
        {
            "text": "Yr hyn sydd wedi achosi anghytuno yw’r ffaith nad oes un prawf a all roi’r wybodaeth hon i ni. Dyna pam rydym ni wedi bod yn gweithio gydag Adran yr Amgylchedd, Bwyd a Materion Gwledig (Defra) a’n partneriaid ar draws y diwydiant a’r byd academaidd i gynnig rhai atebion."
        },
        {
            "text": "Yn ôl ym mis Tachwedd 2020, cafwodd arolwg samplu sylw yn y wasg a oedd yn cwestiynu dilysrwydd mêl, yn seiliedig ar ddadansoddi 13 sampl o fêl brand y siop gan brif fanwerthwyr y Deyrnas Unedig (DU). Arweiniodd hyn at yr ASB yn gofyn i Gemegydd y Llywodraeth roi barn annibynnol, arbenigol ar y profion a ddefnyddiwyd a’r canlyniadau a gafwyd."
        },
        {
            "text": "Mae’r adolygiad hwn, a ysgrifennwyd gan Dr Michael Walker, bellach wedi’i gyhoeddi yn y Nature Portfolio Journal Science of Food sy’n cael ei adolygu gan gymheiriaid, ac mae hyn yn parhau i ddangos pa mor gymhleth yw dilysrwydd mêl."
        },
        {
            "text": "Mae adroddiad Cemegydd y Llywodraeth – sydd wedi’i gyhoeddi fel dwy ran – yn dangos na allwch chi bennu dilysrwydd mêl o’r data a ddefnyddiwyd yn yr arolwg penodol hwnnw, a heb dystiolaeth ategol arall, ni ddylid gwneud honiad o ddifwyno (adulteration)."
        },
        {
            "text": "Mae’r adroddiad hefyd yn edrych ar sut y gellid gwneud honiad dilysrwydd dilys trwy ddefnyddio’r hyn a elwir yn ‘adrodd gwerthusol ystadegol’. Dyma ddull sy’n seiliedig ar egwyddorion fforensig derbyniol sy’n gwerthuso rhinweddau’r data sydd ar gael er mwyn pennu pa mor debygol yw hi bod sampl yn ddilys."
        },
        {
            "text": "Efallai y bydd defnyddio hyn yn ein galluogi i werthuso canfyddiadau gwyddonol ac asesu eu cryfder yn y dyfodol, gan ganiatáu i ni roi mesurau ar waith i nodi ac atal mêl twyllodrus."
        },
        {
            "heading": 2,
            "text": "A yw mêl yn ddiogel i ddefnyddwyr?"
        },
        {
            "text": "Er nad oes tystiolaeth bod unrhyw fêl sy’n cael ei werthu yn y DU yn anniogel, dyma gynnyrch sy’n cael ei ddisgrifio’n aml fel un sydd mewn perygl o dwyll trwy gam-labelu neu ddifwyno â suropau siwgr. Gall problemau godi ar wahanol bwyntiau yn y gadwyn gyflenwi fyd-eang."
        },
        {
            "text": "Mae cyfaint y cynnyrch cyfunol sy’n ofynnol ar gyfer y farchnad fêl ac argaeledd cynhyrchion y gellir eu defnyddio’n hawdd er mwyn difwyno (fel surop siwgr), yn ychwanegol at y pris premiwm sy’n gysylltiedig â rhagor o gynhyrchion mêl gwerth uchel, yn golygu ei bod yn bosibilrwydd realistig bod mêl wedi’i ddifwyno neu wedi’i gam--gyfleu yn bresennol o fewn cyflenwadau mêl y byd."
        },
        {
            "text": "Fodd bynnag, gall gwybodaeth a dealltwriaeth fanwl o’r prosesau dan sylw ar bob cam o’r gadwyn gyflenwi, ac ymateb iddi gyda gweithgaredd sicrwydd, helpu busnesau i gael gwared ar risgiau."
        },
        {
            "heading": 2,
            "text": "Beth fydd yr ASB yn ei wneud nesaf?"
        },
        {
            "text": "Mae’r ASB yn gweithio ar y cyd â Defra, Safonau Bwyd yr Alban a Chemegydd y Llywodraeth i nodi meysydd lle gall y llywodraeth helpu i symud gwaith ar rai o’r materion gwyddonol sydd wedi dod i’r amlwg yn ei flaen."
        },
        {
            "text": "Un ffordd yw safoni’r dull o brofi, fel bod y data sy’n cael ei gynhyrchu yn addas at y diben a bod y ‘gadwyn fêl’ yn dryloyw, a bod modd rhannu gwybodaeth ar bob cam."
        },
        {
            "text": "Rydym ni hefyd am roi’r offer a’r canllawiau mwyaf effeithiol ar waith i allu canfod twyll mêl er mwyn sicrhau gorfodaeth ddigonol a fydd, yn y pen draw, yn diogelu defnyddwyr a busnesau cyfreithlon."
        },
        {
            "text": "Mae’r argymhellion o bapurau Cemegydd y Llywodraeth yn cael eu hadolygu gan Defra a’r ASB, gan dynnu ar arbenigedd gwyddonol y Gweithgor Dulliau Dilysrwydd ac arbenigwyr eraill i lywio ein dull."
        },
        {
            "text": "Fel gyda phopeth arall, defnyddwyr sydd wrth wraidd popeth a wnawn. Ein nod yw cynnal hyder defnyddwyr, rhoi sicrwydd i fusnesau sy’n ymwneud â chadwyni cyflenwi mêl a lleihau unrhyw risg o dwyll bwyd."
        },
        {
            "text": "Rydym ni’n parhau i weithio gyda’r diwydiant mêl i sicrhau bod y mêl rydych chi’n ei fwynhau yn ddiogel, yn ddilys ac yn cyd-fynd â’r hyn sydd ar y label."
        }
    ]
}