{
    "url": "https://ofqual.blog.gov.uk/2022/02/08/helping-you-to-revise-and-build-your-confidence-ahead-of-exams-and-assessments/",
    "title": "Helping you to revise, and build your confidence ahead of exams and assessments",
    "authors": [
        "Dr Jo Saxton"
    ],
    "categories": [
        "Exams"
    ],
    "pub_date": "2022-02-08T11:59:26+00:00",
    "content": [
        {
            "text": "Students have been truly impressive in recent months. You continue to blow me away with your dedication to carry on learning, despite whatever curve balls the pandemic throws your way, and the resulting disruption to your education."
        },
        {
            "text": "I know that many of you might never have sat a formal exam before, and it’s understandable that you may be feeling nervous. Which is why Ofqual has published some advice which I hope you will find helpful. Written by Professor David Putwain, who is a psychologist from Liverpool John Moores University, it contains some tips and techniques on how to cope with exams and assessments and how to plan your revision."
        },
        {
            "text": "Over the past couple of months, I’ve been visiting schools across the country – in person where I have been able to, as well as virtually when that hasn’t been possible due to the pandemic. The most important thing to me has been to listen to students – to hear what you have to say about exams and how you feel about them."
        },
        {
            "text": "Quite a few of you have told me that, although you are nervous, you want the chance to show what you have learned and can achieve by sitting exams and formal assessments. Many of you pointed out that exams are a ‘rite of passage’."
        },
        {
            "text": "But some of you have also made clear that you are worried. And it is because of these conversations that I wanted to make sure we were doing our bit to provide help and advice – so please do take a moment to take a look at Professor Putwain’s practical advice if you are feeling like this."
        },
        {
            "text": "As the regulator of exams and assessments, we have to weigh up different things when we make decisions. But your interests, as students and apprentices, are the most important thing to me."
        },
        {
            "text": "Over the next couple of months, we hope to publish more advice, tips and techniques. And we’re also signposting you to things we find from other organisations that might be useful."
        },
        {
            "text": "You can find more information at the following official sources:"
        },
        {
            "text": "The Student Room"
        },
        {
            "text": "Childline"
        },
        {
            "text": "NHS advice for parents"
        },
        {
            "text": "Dr Jo Saxton\nChief Regulator"
        }
    ]
}