{
    "url": "https://civilservicelocal.blog.gov.uk/2022/02/08/new-south-west-apprentice-network/",
    "title": "New South West Apprentice Network",
    "authors": [
        "Angela Fisher"
    ],
    "categories": [
        "South West England"
    ],
    "pub_date": "2022-02-08T11:23:45+00:00",
    "content": [
        {
            "text": "This National Apprenticeship Week and we are excited to announce the launch of a new South West Apprentice Network (SWAN) and let you know how you can get involved."
        },
        {
            "heading": 4,
            "text": "Apprentice Connections"
        },
        {
            "text": "During 2021 some of you may have got involved in, or heard about, a project called Apprentice Connections, which aimed to link apprentices across the South West. This included events, newsletters and coffee mornings, which were shared between Civil Service departments in the South West. The project reached multiple departments, started conversations, and demonstrated the appetite among apprentices to network, swap hints, and to discover more about different government roles and departments."
        },
        {
            "text": "Following really positive feedback from this project, we are excited to announce that a South West Apprentice Network is going to be launched on an ongoing basis."
        },
        {
            "text": "The network will be led by apprentices across departments, to provide connections and links, build capabilities and give new opportunities. This is a new adventure to strengthen our Brilliant Civil Service culture, where we work and live, and to link with similar networks around the country."
        },
        {
            "heading": 4,
            "text": "Mike Greatwich, Head of Place for Civil Service South West"
        },
        {
            "text": "We are also really happy to have the ringing endorsement of Mike Greatwich, Head of Place for Civil Service South West, and to be working with Scott Murray, the Civil Service South West Talent Champion."
        },
        {
            "text": "\"Hi everyone, I’m Mike Greatwich, the Civil Service Head of Place for the South West – my other job is as a Commercial Function Director in the Ministry of Defence. A big part of the Head of Place role is to build a collaborative and connected Civil Service community and to improve career and talent development to ensure the Civil Service better reflects the community that it serves. Unsurprisingly I am completely supportive of the South West Apprentice Network and really pleased to see it take off. With your involvement and drive I’m confident it’s going to make a real difference for all apprentices across the region."
        },
        {
            "text": "More personally, I’ll share with you that one of the first things I did when I joined the Civil Service, way back in the 80s, was to do a workshops apprentice course – literally making things out of blocks of metal but making mistakes (lots!), learning, listening, and improving. I am still in contact with friends I made way back then as I trained to be an engineer. The network of people, advice and support apprenticeship gave me was just a brilliant way to help me choose the career that I wanted and understand what I was good at and enjoyed. As great as that was it was just in one Department so now image the extra breadth, buzz and opportunities that will come to you from being part of the SWAN and the diversity of people, ideas and interests it will help you find. This is one of life’s opportunities. Grab hold with both hands!\""
        },
        {
            "heading": 4,
            "text": "The new South West Apprentice Network"
        },
        {
            "text": "The work to create the new South West Apprentice network, and to really build up connections, is just getting started – and that is where you come in! Read on below about how get involved in the network – whether you are a current or past apprentice, a manager or coach, or just want to support apprentices in your area. To get involved, the main thing you need is enthusiasm! You should have a desire to collaborate, communicate and build strong relationships, and to see the bigger picture of how the network will fit into wider Civil Service objectives. If you can’t get involved now, there will be information to come about what the network is doing, and about any additional ways to get involved."
        },
        {
            "text": "Are you a current or past Civil Service apprentice? We need YOU to get involved in building up this network and taking it forward."
        },
        {
            "text": "This is a great opportunity to get insight into different departments, to build up your experience, and to take up new opportunities. We’re looking for people to join a network steering group to:"
        },
        {
            "text": "We envisage you spending between 1-2 days per month on this work, and hope to hold our first proper meeting of the steering group in March."
        },
        {
            "text": "Outside of the steering group there will be scope to get involved on a more ad-hoc basis, to share your own experiences, to tell people about your department, or something else."
        }
    ]
}