{
    "url": "https://civilservice.blog.gov.uk/2022/02/08/uks-quest-to-be-a-global-science-superpower/",
    "title": "UK's quest to be a global science superpower",
    "authors": [
        "Sir Patrick Vallance"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-02-08T08:59:27+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Science and technology are, perhaps more than ever, transforming people’s lives writes Sir Patrick Vallance. "
        },
        {
            "text": "In order to thrive in an increasingly competitive world, countries must apply science and technology strategically and embed it in their policy- and decision-making. "
        },
        {
            "text": "The rapid pace of change and scope of impact are clear. Take the latest expeditions into space, which have opened new markets and areas of potential, including greater connectivity in hard-to-reach places through a space-enabled internet. Or the development of synthetic organisms, which creates the potential for innovative manufacturing solutions for green fuel or novel medicines. "
        },
        {
            "heading": 4,
            "text": "Net zero targets"
        },
        {
            "text": "Bigger wind turbines and more sophisticated energy storage facilities are already helping countries realise their Net Zero targets, and new vaccine technologies have revolutionised the potential for prevention and treatment of diseases."
        },
        {
            "text": "The future success and wellbeing of the UK will be directly linked to how well we leverage science and technology over the next 50 years. We must continue to develop our science capability and invest in critical and emerging technologies to become a global science superpower. We have the foundations to achieve this and use it for good. "
        },
        {
            "text": "We have already made headway. Science and technology was an important component of the National AI Strategy and the Integrated Review, and there were record levels of investment for Research & Development in the recent spending review. "
        },
        {
            "heading": 4,
            "text": "Supporting the PM"
        },
        {
            "text": "But there is more to be done - which is why, over the last six months, I have been supporting the Prime Minister to stand up two new government science structures, building on the strong systems we have for providing independent science advice. "
        },
        {
            "heading": 4,
            "text": "Delivering the UK’s ambitions"
        },
        {
            "text": "First is the National Science and Technology Council (NSTC), a new Cabinet Committee to make the strategic decisions needed to deliver the UK’s ambitions, and propel science and technology to the heart of government business. It’s designed to make decisions on the end-to-end steps needed to gain strategic advantages from science and technology - to look at everything from funding of research though to the procurement, deployment and uptake of science and technology for wealth, health and social benefits. "
        },
        {
            "text": "The second is the Office for Science and Technology Strategy (OSTS), which will support the National Science and Technology Council. I head this up in my new role as National Technology Adviser (NTA) and Andrew McCosh is the lead Director General and Deputy NTA, alongside his role as Deputy National Security Adviser for Science & Technology. OSTS informs and delivers theNSTC’s vision. It performs its secretariat function, develops strategic options, and tracks the impact of NSTC decisions."
        },
        {
            "text": "OSTS cannot work in a silo. Most of the areas of science and technology are owned by departments and will be led by departments. OSTS should help to create join-up both across departments and over time. It will also work collaboratively with civil society, academia, industry and international partners, as well as engage with the general public to understand key issues surrounding the application of science and technology."
        },
        {
            "text": "Critical independent science"
        },
        {
            "text": "OSTS will also work closely with the Government Office for Science (GOS), which I lead as Government Chief Scientific Adviser, and which continues to provide critical, independent science advice to the PM and Cabinet. To support the new NSTC, GOS’s Technology and Science Insights team will provide independent objective assessments of the UK’s science power, and the potential of emerging technologies, to identify strategic opportunities and risks. "
        },
        {
            "text": "These two new structures, NSTC and OSTS, are intrinsically connected by one very clear purpose: to develop, foster and leverage the UK’s science and technology capability for strategic advantage and benefit for society.  "
        },
        {
            "text": "Shared vision"
        },
        {
            "text": "More importantly, they share a vision which can only be achieved in collaboration with the rest of government: to direct science and technology to boost the UK’s prosperity, wellbeing and security in an increasingly connected, complicated and competitive world."
        },
        {
            "text": "Find out more about these structures and the work they do here: https://www.gov.uk/government/groups/office-for-science-and-technology-strategy "
        }
    ]
}