{
    "url": "https://educationhub.blog.gov.uk/2022/02/what-we-are-doing-to-improve-the-mental-health-of-children-and-young-people/",
    "title": "What we are doing to improve the mental health of children and young people",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Mental Health",
        "Students"
    ],
    "pub_date": "2022-02-08T13:46:25+00:00",
    "content": [
        {
            "text": "The ongoing impact of the pandemic has emphasised the importance of supporting our children and young people’s wellbeing."
        },
        {
            "text": "That’s why, during Children’s Mental Health Week, we have released the findings our State of the Nation report, which focuses on trends in mental health and wellbeing recovery over the course of academic year 20/21, as well as children and young people’s views about society and the future."
        },
        {
            "text": "Here’s everything you need to know about the important research and what we are doing to help improve the mental health of children and young people."
        },
        {
            "heading": 3,
            "text": "What does the report say about children’s mental health?"
        },
        {
            "text": "There are some early signs of recovery in wellbeing following a reduction in 2020."
        },
        {
            "text": "It showed ups and downs throughout the year that largely coincided with the introduction of and removal of restrictions."
        },
        {
            "text": "Encouragingly, the report also found that following an increase in rates of probable mental health disorders in 2020, levels remained stable in 2021."
        },
        {
            "text": "There have been ongoing impacts in a range of areas, including reduced participation in physical activity and less access to extra-curricular activities, and an increase in obesity rates."
        },
        {
            "heading": 3,
            "text": "How are the findings from this report being used? "
        },
        {
            "text": "The information has already been used to inform the support measures we have put in place."
        },
        {
            "text": "This includes our £15 million Wellbeing for Education Recovery and Return programmes, which provided free expert training, support and resources for schools and college staff dealing with children and young people who were experiencing additional pressures from Covid-19 – including anxiety and stress."
        },
        {
            "text": "Through our Mental Health in Education Action Group, we have also produced a range of new resources to support mental health and wellbeing recovery."
        },
        {
            "text": "These include, Signposting for school and college staff to enable them to assist children and young people to get the advice and help they need, Lesson packs to support schools to deliver the new Relationships, Sex and Health Education curriculum and Wellbeing support videos, co-created with our Youth Mental Health Ambassador, Dr Alex George, PHE and First News which offer tips and tricks to improve children’s mood in a positive, energetic way."
        },
        {
            "heading": 3,
            "text": "What else are you doing to help improve the mental health of children post pandemic? "
        },
        {
            "text": "We recognise that the impact of the pandemic is likely to be long lasting, and we are continuing to monitor the data so we can make sure our response to the pandemic is informed by the latest evidence."
        },
        {
            "text": "We remain committed to promoting and supporting mental health and wellbeing support in schools and colleges, including through the following initiatives:"
        },
        {
            "heading": 3,
            "text": "What about older students? Is there any additional support available for them too? "
        },
        {
            "text": "Yes. The mental health platform ‘Student Space’ will be receiving more funding to run until the end of the academic year."
        },
        {
            "text": "Launched in August 2020, Student Space is an online mental health platform available to all higher education students across England and Wales."
        },
        {
            "text": "Led by student mental health charity Student Minds, the platform was developed collaboratively with services, higher education professionals, researchers and students to complement the existing mental health and wellbeing services available to students."
        },
        {
            "text": "Student Space offers higher education students a range of mental health and wellbeing services, such one-to-one support through a mix of counselling, email and phone helpline support in addition to key information and advice."
        },
        {
            "text": " "
        }
    ]
}