{
    "url": "https://naturalengland.blog.gov.uk/2022/01/27/an-important-step-for-englands-landscapes-welcoming-the-new-natural-england-landscape-advisory-panel/",
    "title": "An important step for England’s landscapes: welcoming the new Natural England Landscape Advisory Panel",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Landscapes and access",
        "Natural Capital",
        "Natural England",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2022-01-27T12:56:13+00:00",
    "content": [
        {
            "text": "I am delighted to announce that the new Natural England Landscape Advisory Panel meets for the first time today, which is an important step in our work to deliver more for and from England’s landscapes."
        },
        {
            "text": "Landscape is one of Natural England’s core purposes and is at the heart of what we do.  England’s landscapes reflect our diverse and spectacular geology and natural systems, shaped by generations of activity on the land and later development. They are rightly renowned the world over: for the places they create, the history they reflect, their variety, beauty, inspiration; as spaces to relax, have fun or explore; and for the many natural, social and economic benefits they provide. Today we know that they are also rich in natural capital, for example huge stores of carbon held in peat, and landscapes that help to ensure that rivers run pure and steady, reducing flood risk in the process."
        },
        {
            "text": "The ground-breaking 1949 National Parks and Access to the Countryside Act was part of the post-war settlement heralding a brighter future for all parts of society.  It recognised the importance of everyone being able to access and enjoy naturally beautiful places, establishing our system of National Parks and Areas of Outstanding Natural Beauty (AONB), alongside our system of nature conservation through SSSIs and NNRs.  Many of Natural England’s roles date back to this Act and the systems and bodies that it established."
        },
        {
            "text": "Subsequent legislation recognised the importance of conserving and enhancing all England’s landscapes and, with the experiences of pandemic lockdowns still fresh in our minds, it is vital that we improve urban landscapes, as well as rural."
        },
        {
            "text": "The world has changed a lot since 1949, and the roles of England’s landscapes are constantly changing too, in response to environmental conditions and society's needs. Today our landscapes can help to provide additional benefits alongside those for which they were originally identified, such as nature restoration, climate change resilience and greater recreation and access for all parts of society."
        },
        {
            "text": "Working in close collaboration with local communities and with a wide range of partners, we see the possibility of locally distinct, wildlife rich landscapes where sustainable food, fibre and energy production run hand in hand with natural beauty; where people are welcomed from all walks of life for the spiritual refreshment that nature brings, places rich in history, and steeped in culture; places to see and hear nature in abundance; alongside a new breed of urban landscapes, bringing nature and beauty into the heart of our towns and cities for everyone to enjoy and benefit from."
        },
        {
            "text": "Our landscapes can help provide answers to the dual challenges we face on climate change and biodiversity loss and improve people’s health and wellbeing in the wake of the Covid-19 Pandemic.  They are the foundation of the natural systems on which everything depends. That’s why landscape is such an important part of Natural England’s remit. It brings together our ambitions to restore nature and to ensure that people from all walks of life can enjoy and benefit from the natural world."
        },
        {
            "text": "In June of last year, Natural England announced an ambitious landscapes programme to take forward Government’s policy priorities. Our announcement included a landmark programme for designated landscapes including proposals for two new and two extended protected areas; work on national urban landscapes; and innovative ways to bring nature and people closer together.  It included plans to create a visionary map for England’s landscapes in the 21st Century, including any remaining places suitable for future National Park or AONB designation or where alternative forms of action will be more appropriate. It marked a step change in delivery and we are driving this work forward at pace with our partners."
        },
        {
            "text": "At the same time, we have set out a Joint Agreement with National Parks England and the National Association for AONBs to deliver more for people, nature and climate through England’s National Parks and AONBs. An example of this commitment is our joint priority for nature recovery; with Natural England providing resources, for co-ordinators to work with National Parks and AONBs, to produce nature recovery plans and prospectuses, setting out the delivery of new wildlife rich habitat to support the Nature Recovery Network that lies at the heart of Natural England’s work and behind Government’s wider ambitions for the natural environment."
        },
        {
            "text": "As Chair of Natural England, I welcomed the Government’s response to Julian Glover’s independent Landscapes Review on 15 January and was particularly encouraged by proposals to reinvigorate Natural England’s role as Government’s statutory advisor on England’s landscapes.  We will drive forward this work with energy and ambition."
        },
        {
            "text": "So it feels a particularly opportune and exciting time to launch the new Natural England Landscape Advisory Panel (NELAP) to help us deliver strong landscape leadership and rise to these challenges.  The Panel will provide independent and expert advice and assistance to Natural England’s Board on the discharge of its landscape functions. It will support Natural England’s drive for innovation and ambition in its role as government’s statutory landscape advisor and work to strengthen Natural England’s relationships with the wider landscape community and across Government."
        },
        {
            "text": "The Panel will provide Natural England’s Board with a standing expert group to support, challenge and advise on ambitious and innovative ways to deliver our role, shaping the future of all English landscapes, for everyone."
        },
        {
            "text": "We were pleased to receive a large number of extremely high-calibre applications to become Members of the Panel, recognising the value that each could bring to discussions, and it was very difficult to narrow down."
        },
        {
            "text": "This will by no means be the only way in which we will engage stakeholders on our landscapes role but will, I believe, provide real challenge, insight and advice as we take this important work forward."
        },
        {
            "text": "I am delighted to welcome our new Panel members today.  Collectively, they bring a wealth of expertise and experience from landscape academia; designated, non-designated and urban landscapes; biodiversity; the landowning community; historic environment; social science; outreach and engagement; and communications. Terms of reference for the panel have been published and the biographies of each of the Panel Members are listed below:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Biographies"
        },
        {
            "text": "Rosamund Blomfield-Smith – Natural England Board Member and co-Chair"
        },
        {
            "text": "Rosamund Blomfield-Smith is a Natural England Board Member. She spent 30 years in the City, latterly as a director of both Rothschilds and ING Barings, but since 2003 has been non-executive."
        },
        {
            "text": "She has served on many boards, including Thames Water and Hartpury Agricultural College and is currently chairman of Museum of London Archaeology, a member of Ofgem’s Challenge Group, Trustee of the Jo Cox Foundation and director of OSBIT, an engineering company focusing on renewables."
        },
        {
            "text": "She and her husband rear traditional breeds on their 386-acre farm in Herefordshire."
        },
        {
            "text": "Sarah Mukherjee MBE – Independent co-Chair"
        },
        {
            "text": "Sarah Mukherjee is the CEO of IEMA.  She was the BBC's Environment Correspondent for many years, presenting on national and international BBC radio and television news, working – and winning awards – across the world. Since leaving the Corporation, she has had leadership roles in utilities and agriculture. She was a panel member for the Glover Review and sits on the National Food Strategy Advisory Panel.  She is a Non-Executive Director on the Board of the Environment Agency and is a governor of Harper Adams University. Sarah was awarded an MBE for her services to agriculture and farmer well-being in 2021."
        },
        {
            "text": "Sarah has been a Campaign for Real Ale beer judge and a rugby reporter in the past - two activities she still enjoys - and is a runner and yoga addict. "
        },
        {
            "text": "Professor Michael Winter OBE"
        },
        {
            "text": "Professor Winter OBE is a rural policy specialist and social scientist with expertise covering a wide range of environmental issues and particular interests in applying inter-disciplinary approaches to policy-relevant research. He is currently Professor of Land Economy and Society at the Centre for Rural Policy Research at the University of Exeter."
        },
        {
            "text": "Past positions held by Professor Winter include membership of the Defra’s Review Group on Bovine TB, Expert Panel for the National Ecosystem Assessment, Defra’s Science Advisory Council, commissioner and board member of the Commission for Rural Communities and member of the Committee of Inquiry on Hunting."
        },
        {
            "text": "Professor Winter has been appointed to the Natural England board until 31 August 2022."
        },
        {
            "text": "Sarah Bryan"
        },
        {
            "text": "Sarah is Chief Executive of the Exmoor National Park Authority. She has worked on Exmoor for more than 25 years, since joining the organisation as a Conservation Officer (Landscape) in 1992. She has used her roles to engage with landowners and land managers, forging strong partnerships with external agencies and partners, and leading key conservation and landscape projects."
        },
        {
            "text": "She has a degree in Environmental Science from the University of East Anglia, a second degree in Landscape Design, from Manchester University and is a Chartered Member of the Landscape Institute."
        },
        {
            "text": "Sally Marsh"
        },
        {
            "text": "Sally is Director of the High Weald AONB Partnership and a Fellow of the Landscape Institute. She has spent 30 years in the protected landscape sector as a landscape ecologist, previously working in habitat management and restoration ecology for London Ecology Unit, British Trust for Conservation Volunteers and Operation Groundwork."
        },
        {
            "text": "She is currently completing a PhD with the University of Kent; is director of a community land trust and lives on a horticultural small-holding run on regenerative and permaculture principles."
        },
        {
            "text": "Julian Gray"
        },
        {
            "text": "Julian is Vice-Chair of the World Trails Network promoting sustainability of trails globally. He is also Chair of National Trails UK, the new charity advocating for National Trails and Director of South West Coast Path Association, championing England’s longest National Trail."
        },
        {
            "text": "Previously, Julian was CEO of Rainforest Rescue, protecting and reforesting threatened rainforest internationally. He set up Smart WaterMark, a global water conservation and certification programme. Julian worked on EU PRIMAVERA and Lifescapes projects, developing tools to manage and brand European protected landscapes. He was part of the management team of the first AONB Conservation Board and was involved in establishing UK’s first Community Forest. Julian has a degree in Environmental Science and a masters in International Communication. He is a highly effective environmental communicator and a passionate advocate of protected landscapes."
        },
        {
            "text": "Dr Jo Smith"
        },
        {
            "text": "Jo has over 25 years’ experience in the environment sector, working for Norfolk County Council as well as a number of NGOs including the Field Studies Council and Sustrans."
        },
        {
            "text": "Jo took on the role of CEO for Derbyshire Wildlife Trust in 2014, overseeing substantial growth and establishing several large partnerships and landscape scale programmes.   Recent highlights have included the reintroduction of beavers into the Trent, establishing the UK’s largest urban rewilding initiative in Derby, and jointly leading a DEFRA green social prescribing pilot."
        },
        {
            "text": "Jo holds a number of external roles including the Heritage Fund Committee in the East and Midlands."
        },
        {
            "text": "Professor Alastair Driver BSc (Hons) FCIEEM"
        },
        {
            "text": "Prof Alastair Driver is one of the UK’s best-known conservationists and is cited in “Who’s Who” for influence and distinction in the field of environmental conservation. He is an expert naturalist and ecologist with 43 years’ professional experience and hundreds of conservation projects under his belt."
        },
        {
            "text": "He became the first Conservation Officer for the Thames catchment in 1984 and went on to become the National Head of Conservation for the Environment Agency for England and Wales from 2002 – 2016."
        },
        {
            "text": "Since Jan 2017, he has been the Director of Rewilding Britain and plays a key role in influencing government environmental policy at the highest level and establishing rewilding projects in England and Wales."
        },
        {
            "text": "Alastair also holds several pro bono roles, including Hon Prof at Univ of Exeter and Specialist Advisor for the National Trust."
        },
        {
            "text": "Mary-Ann Ochota"
        },
        {
            "text": "Mary-Ann is a broadcaster and anthropologist, with a special interest in Britain’s people and landscapes."
        },
        {
            "text": "She’s written three acclaimed books on British archaeology, and regularly writes and presents TV and radio programmes on archaeology, social history and the outdoors. She’s been involved in public campaigns to improve access to, and understanding of, England’s rural landscapes. Her network of contacts extends from grassroots community groups to business leaders and ENGOs."
        },
        {
            "text": "Mary-Ann is a Fellow of the Royal Geographical Society, a hillwalking ambassador for the British Mountaineering Council and she holds an MA from Cambridge University in Archaeology and Anthropology."
        },
        {
            "text": "Iesha Small"
        },
        {
            "text": "Iesha Small is a writer and charity strategist passionate about creating a fairer society, particularly for young people, she also has a passion for nature and the outdoors."
        },
        {
            "text": "Iesha is Head of Change for Education and Families at The Youth Endowment Fund. She was previously Head of Strategy and Policy at, the outdoor charity, YHA. She has 15 years’ experience in the education sector as an assistant headteacher, governor and think tank researcher. Iesha has written and spoken about education, society and nature for various publications and national media and believes storytelling can powerfully complement research to create positive change."
        },
        {
            "text": "Prof. Carys Swanwick BA, MSc, HFLI, Emeritus Professor"
        },
        {
            "text": "Carys was a Principal and then a Director of Land Use Consultants, then Professor of Landscape and Head of the Department of Landscape at the University of Sheffield, and then a part time Technical Director with SLR Consulting and Independent Advisor to National Grid’s Visual Impact Provision project. She wrote the Landscape Character Assessment Guidance for England and Scotland and the latest Guidelines for Landscape and Visual Impact Assessment."
        },
        {
            "text": "She is actively involved with the National Trust, having served six years as a Trustee on the Board of Trustees and been appointed to other voluntary governance positions."
        },
        {
            "text": "Duncan Peake"
        },
        {
            "text": "Duncan is an experienced chartered surveyor, land manager and rural business leader. He joined Raby Estates as CEO in 2017 after a successful track record managing and developing some of the UK’s foremost landed estate businesses. He is responsible for business operations across Raby’s landholdings located in some of the most highly designated landscape character areas in Co Durham and Shropshire. He is also a Director of Visit Co Durham. Duncan is a passionate advocate for England’s historic and natural environment and the role that those who live and work on the land can contribute towards safeguarding that heritage."
        },
        {
            "text": "Dr Rose O’Neill"
        },
        {
            "text": "Dr Rose O’Neill is Chief Executive of the Campaign for National Parks, the independent voice for National Parks in England and Wales. It is the only national charity dedicated to campaigning to protect and enable thriving National Parks, brimming with nature, resilient to climate change and that everyone, no matter their background, can enjoy."
        },
        {
            "text": "Campaign for National Parks’ membership includes individuals, National Park Societies and national NGOs. It stands for principles of public voice in decision making and champions the power of partnerships."
        },
        {
            "text": "Rose was principal social scientist at Natural England and has a research background including engagement with nature, public participation and behaviour change, having worked with farmers, businesses and community groups. Rose is a passionate advocate of environmental justice and our responsibility to leave a landscape legacy for future generations. She is a trustee of Wessex Rivers Trust and a Non-Executive Director of Waterwise."
        },
        {
            "text": "Professor Kathryn Moore"
        },
        {
            "text": "Kathryn is the creator of the West Midlands National Park and Director of the international think tank, the WMNP Lab. She is leading the development of this new approach to transform regions and cities, organizations, policy, modes of governance and finance, addressing global challenges in the context of the accelerating climate emergency."
        },
        {
            "text": "Overlooking the Visual: Demystifying the Art of Design (Moore 2010) sets a new way of looking at landscape, putting it at the heart of the built and natural environment. She was celebrated by the LI in August 2019 as one of the most inspiring women landscape architects this century."
        },
        {
            "text": "Matt Bristow BA, MA, MCIfA"
        },
        {
            "text": "Matt Bristow is a landscape and buildings archaeologist. He splits his time between the Institute of Historical Research where he is a Lecturer in Landscape Studies and the Architectural Editor of the Victoria County History, and Historic England where he is a Senior Archaeological Investigator in their Policy and Evidence Group."
        },
        {
            "text": "A former Editor of the journal of Vernacular Architecture, Matt has a wide range of research interests including manorial and monastic landscapes, church architecture, industrial archaeology, settlement morphology and phase I New Towns.  He was also a member of the project teams which delivered the England’s Past for Everyone and Layers of London public engagement projects funded by the National Lottery Heritage Fund."
        },
        {
            "text": "Caroline Cotterell, Natural England"
        },
        {
            "text": "Caroline is Natural England’s Director for the Resilient Landscape and Seas Programme. This determines Natural England’s work to create thriving and resilient places that are rich in plants, wildlife and character and provide wide ranging benefits for nature, climate and people."
        },
        {
            "text": "Caroline has over 30 years’ experience of environmental policy and delivery, working nationally and locally in the private, charitable and public sectors.  She led the development of Natural England’s conservation strategy, and ran the Government’s Rural Advocate programme, bringing the diverse voices and experiences of rural communities into the heart of policy and decision making."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}