{
    "url": "https://civilservice.blog.gov.uk/2022/01/27/civil-service-awards-2021-winds-of-change/",
    "title": "Civil Service Awards 2021: Winds of change",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-27T09:07:45+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The 2021 Awards saw six individuals win a Lifetime Achievement category. From the seventies, eighties, nineties, noughties, teenies and twenties, our winners share their memories of how the workplace has changed over time."
        },
        {
            "text": "Thirty years ago, the Civil Service was a dramatically different place. Many people joined straight from school, got paid weekly in a brown paypacket,  junior grades had their own office, no employee had a computer (everyone relied upon a typing pool), and many enjoyed a full day off for Christmas shopping. Below, our Lifetime Achievement Award winners round up some of the biggest changes across the Civil Service since joining."
        },
        {
            "heading": 3,
            "text": "‘I waited four years for a computer!’"
        },
        {
            "text": "David Gott, Head of Ministerial Correspondence (Rail), Department for Transport"
        },
        {
            "text": "I joined the Civil Service in 1985, when you only had to be an HEO to qualify for a personal office. My first desk didn’t have a computer (I’d wait another four years for that), and I didn’t get an email account until 1999. We had masses of paper filing, of course. Whole rooms were devoted to files - some well-organised, some not."
        },
        {
            "text": "We had someone whose only job was to do the photocopying for us.  She was an AA, but she had a personal room, and we had to justify to her why we needed a copy of something.  It wasn’t a particularly busy role and she finished a lot of novels and magazines during working hours."
        },
        {
            "text": "Any important corporate information used to be published in a weekly bulletin, and one copy was circulated around a team of 20; if it got left on someone’s desk, it might be weeks before you saw it. And, if you wanted a new pen from stationery, you had to demonstrate the old one had run out of ink.◼︎"
        },
        {
            "heading": 3,
            "text": "‘I’d join the Civil Service all over again - no question’"
        },
        {
            "text": "Dr Jo Gillespie, Deputy Director of Policy, Strategy & Recovery (Resilience Emergencies Division), Department for Levelling Up, Housing and Communities"
        },
        {
            "text": "When I joined in 1987, Mrs Thatcher was PM, there were no mobile phones, no computers and everything was paper-based. The biggest change is how technology has changed the delivery of our core functions. Back then, computers were limited to the labs and guarded as something for the world of ‘the scientist’."
        },
        {
            "text": "We had typing pools and carbon paper, and you needed to plan days in advance for getting stuff typed and know correction markings. In those days, the idea that we could deliver citizen services in any other way than ‘in person’ was unimagined; I am sure people remember the joys of queuing in the post office to renew car tax."
        },
        {
            "text": "In my first job in 1987, the teaspoon (note the singular) in the laboratory kitchen was chained to the sink. All paper (and I mean everything, including toilet paper) was stamped HMSO and people could smoke in offices, although not in the lab - things weren’t quite that unsafe. The Civil Service has certainly moved on a fair bit since then."
        },
        {
            "text": "It is different today, the breadth of opportunity is greater now in terms of career, location and flexibility but that does come with less certainty than when I first joined. That said - I’d join the Civil Service again, no question.◼︎"
        },
        {
            "heading": 3,
            "text": "‘I’m not quite finished yet!’"
        },
        {
            "text": "Robert Buckley is an EO serving with Border Force based in the south east"
        },
        {
            "text": "The Lifetime Achievement Award is a tremendous accolade, and in my view, reflects the quality of the officers I’ve worked alongside over the years. I’ve had many career highlights and this is certainly up there with them. In terms of ‘lifetime achievement’ I would add ‘thus far’ -  I’m not quite finished yet!"
        },
        {
            "text": "I started my anti-smuggling career in 1982. One of the major changes that I’ve witnessed first-hand is the disparate, evolving nature of organised crime groups and their constantly changing smuggling methods."
        },
        {
            "text": "When I joined, there were annual departmental and national Civil Service sports days, held at locations throughout the country, bringing together colleagues in a social and sporty environment. Always a great day, attended by all grades across the disciplines. Would I trade places with a new joiner today? 100% - I’d do the whole lot again without a second’s hesitation.◼︎"
        }
    ]
}