{
    "url": "https://civilservice.blog.gov.uk/2022/01/27/civil-service-awards-helping-welsh-businesses-survive-the-pandemic/",
    "title": "Civil Service Awards: Helping Welsh businesses survive the pandemic",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-01-27T17:20:56+00:00",
    "content": [
        {
            "heading": 3,
            "text": "During  the pandemic, one team in the Welsh Government freed up £2bn plus to help support businesses, communities and families."
        },
        {
            "text": "To help revitalise the Welsh economy, a cross Welsh Government team of civil servants formed the Economic Resilience Fund (ERF) to scope out opportunities and work in collaboration with local authorities, the Development Bank and Business Wales, to create support packages for companies and their employees."
        },
        {
            "text": "Asked what they reckon caught the eye of the judges when choosing a worthy winner for the Project Delivery Award, Duncan Hamer, Chief Operating Officer for Business and Regions, Welsh Government. credits their efforts to “sustain thousands of businesses and hundreds of thousands of people’s jobs and livelihoods, using innovative and lean processes.” And they’re not wrong , working alongside the UK wide Job Support schemes more than £2.1 billion has been used to support 250,000 recipients."
        },
        {
            "text": "To make this huge project a success, the team drew on experience across Welsh Government and delved into the digital world to develop a new interface, enabling businesses to apply easily via the Business Wales platform. This received incredible responses from businesses: over 10.5 million views and around 50,000 separate enquiries."
        },
        {
            "text": "Changed lives"
        },
        {
            "text": "Businesses are now more resilient, and more than 160,000 jobs to date have been protected from COVID-19. Undoubtedly, the efforts of the ERF changed the lives of Welsh citizens for the better. "
        },
        {
            "text": "“Being able to make a difference to the outcomes for citizens and work with such talented people across WG” they have found, is one of the best things about being a civil servant, said Duncan."
        },
        {
            "text": "Exceptional performance"
        },
        {
            "text": "This award has come as a “welcome recognition of the outstanding efforts” of both the ERF team and those who lost staff to delivery but continue to deliver exceptional performance. All in it “provided a real boost and recognition” for the team. And whilst the climate to date has not allowed for a communal celebration, “there are a lot of people across Wales owed a beer or a coffee which will follow post pandemic!” "
        },
        {
            "text": "But the quest to serve the communities of Wales is not over. “Beyond COVID-19, [we will be] getting back to a proactive approach to actions that improve outcomes for the people and businesses of Wales and the UK.”"
        }
    ]
}