{
    "url": "https://deframedia.blog.gov.uk/2022/01/27/coverage-of-natural-englands-three-new-life-projects/",
    "title": "Coverage of Natural England’s three new LIFE projects",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-01-27T11:47:43+00:00",
    "content": [
        {
            "text": "There has been widespread coverage of our announcement launching three vital nature recovery projects aimed at tackling the climate and biodiversity crisis. The Independent, Evening Standard, ITV News Online, Express and Star & others covered the news positively."
        },
        {
            "text": "The projects –  receiving a funding boost totalling £11.7 million and spanning North East & Scottish Borders, Cumbria and South Yorkshire – will focus on internationally important species and habitats of Special Areas of Conservation (SAC) and Special Protection Areas (SPA) and will be radically rejuvenated over the next five years by partnerships led by Natural England and funded by LIFE."
        },
        {
            "text": "The Independent highlights each of the projects and carries a supportive quote from Natural England Chair Tony Juniper, highlighting how the innovative partnerships give tangible examples of efforts to protect and restore critically endangered species and habitats, and that he is hopeful the nature recovery projects will inspire more action throughout the country."
        },
        {
            "text": "The Yorkshire Post reports on a project to restore 400 hectares of degraded raised bogs, one of Europe’s rarest habitats, on the South Yorkshire and Lincolnshire border. Elsewhere, the Northumberland Gazette focusses on the project to restore marine habitats on the Northumberland coast and River Tweed catchment, noting how the projects aims to reduce river pollution, improve water quality, restore wildlife rich habitat and combat climate change through nature recovery."
        },
        {
            "text": "Natural England Chair, Tony Juniper said:"
        },
        {
            "text": "Environment Agency Chair Emma Howard Boyd said:"
        },
        {
            "text": "LIFE is the EU’s financial instrument supporting environmental, nature conservation and climate action projects throughout the EU. Since 1992, LIFE has co-financed more than 4500 projects. The projects’ sites have seen an increase in visitors during the pandemic, and are popular for those appreciating wildlife, seeking solace in nature, or enjoying outdoor recreation."
        },
        {
            "text": "Read more about EU LIFE and the partnerships here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}