{
    "url": "https://dragonsden.blog.gov.uk/2022/01/27/dragons-den-episode-4-series-19/",
    "title": "Dragons' Den, Episode 4, Series 19",
    "authors": [
        "Oliver Downey"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-01-27T21:05:05+00:00",
    "content": [
        {
            "text": "This week’s Dragons' Den featured things that seem only too relevant for the times we found ourselves in. Non-alcoholic beer for those undertaking Dry January, eco-friendly disinfectant for those keen to rid their homes and workplaces of a particular virus and a potential remedy to the fast-fashion crisis. Read on as I delve into the intellectual property (IP) issues raised in the Den."
        },
        {
            "heading": 3,
            "text": "Dutch courage"
        },
        {
            "text": "First in the Den was 24-year-old, Mark Wong, who moved to the UK to study at a young age and confesses that alcohol helped boost his confidence when he struggled to fit in. This all changed when he was diagnosed with liver problems and decided to give up alcohol, leading him to set up his non-alcoholic beer business, Impossibrew."
        },
        {
            "text": "It seemed that it could be happy hour in the Den, with Touker declaring Wong ‘the most credible twenty-four-year-old’ that’s ever walked into the Den, but it seemed his pitch had gone flat. Due to the infancy of the business, Touker felt there wasn’t enough traction to make such a high valuation."
        },
        {
            "text": "So how do you add value to your business? Developing an IP strategy can be vital to adding value and increasing investment. Check out our blog on the Top 10 IP Tips for helping small and medium-sized enterprises identify and make the most of IP assets here."
        },
        {
            "heading": 3,
            "text": "Unfortunate events"
        },
        {
            "text": "Next in the Den was fellow Liverpudlian, Louis Claeys, who was seeking £85,000 in return for a 20% equity stake in his eco-friendly disinfectant business, Opal Eco."
        },
        {
            "text": "Previously an engineer, Louis decided to develop a side project selling products online. Due to its growing success and his imminent paternal duties, Louis decided to leave his engineering job to become a self-sufficient entrepreneur."
        },
        {
            "text": "Louis’s pitch was off to a shiny start, but things quickly turned murky when pressed on the exclusivity of the product. After being questioned by Sara Davies on the exclusivity of the product, Louis explained that due to issues around Brexit, he lost the exclusive rights to sell the product just hours before his crucial pitch in the Den, leaving the Dragons feeling sympathy towards the young entrepreneur."
        },
        {
            "text": "Deborah Meaden sought clarification and Louis confirmed that he does own the branding (including the trade mark) of the product. This seemed to alleviate some concerns that the Dragons had, but without the exclusive distributorship, the valuation had become too optimistic for their liking."
        },
        {
            "text": "So what is trade mark protection? Trade marks are important as they distinguish your goods or services from others. Having trade mark protection has likely protected Louis in his predicament to the extent that if his brand is already established and well known, he would be able to continue selling the product successfully."
        },
        {
            "text": "Louis could add further value to his eco business by protecting the design of his bottles. Well-known clothing companies can often attract copycats who attempt to replicate their designs. However, registering your design can help to stop others from copying or stealing it. There are different types of unregistered design. How long you’re protected for depends on the type of design. Find out more about here."
        },
        {
            "heading": 3,
            "text": "Re-inventing the broken wheel"
        },
        {
            "text": "Last in the Den was mum of two, Charlotte Morley who owns a business that’s a world away from her previous career in the intelligence services. She entered the Den asking for a £70,000 cash injection in return for a 7.5% equity stake."
        },
        {
            "text": "Charlotte’s company, thelittleloop, allows for a wardrobe swap of children’s clothes when they’ve grown out of them or the seasons change."
        },
        {
            "text": "Aside from protecting her logo and branding with a trade mark, could Charlotte's business model be protected by a patent? It is very rare to obtain patent protection for a business method (it's more likely to be protected in the U.S.) however it's always advisable to speak with a patent attorney if you're unsure as to whether you could claim protection for your invention. You can find a patent attorney via the Chartered Institute of Patent Attorneys website here."
        },
        {
            "text": "In the end, Charlotte's pitch was successful and she left the Den with an interesting offer. Instead of giving away 15% of her company in return for £70,000, Steven and Deborah offered to give her £140,000 for 25% in total."
        },
        {
            "text": "Well that's it for tonight. I hope you enjoyed reading this our IP blog and we'll see you next week!"
        }
    ]
}