{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/01/27/get-involved-with-the-policy-design-community-in-2022/",
    "title": "Get involved with the Policy Design Community in 2022",
    "authors": [
        "Editorial team"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-01-27T18:27:09+00:00",
    "content": [
        {
            "text": "We are a community for people in the UK government, both local and central, who are interested in policy design. We currently have 38 different public organisations that we work with. "
        },
        {
            "text": "You can join us too. You just need a GOV.UK email address. We love welcoming new people, whatever your background. If you would like to join the community, email policy.design@policyprofession.gov.uk"
        },
        {
            "heading": 2,
            "text": "Community of practice sessions"
        },
        {
            "text": "Building on the success of our last session, we're back for our third community session, and first of 2022. It’s an online event taking place on 17th February 1pm to 4pm. You can register for the event on Eventbrite here."
        },
        {
            "text": "We have two amazing speakers lined up:"
        },
        {
            "text": "Alongside this you’ll also have a chance to network with colleagues across local and central government and hear updates from those behind the policymaking reform strategy. "
        },
        {
            "text": "We also have a number of exciting opportunities, which you can read about below."
        },
        {
            "heading": 2,
            "text": "Monthly strategy meet-up"
        },
        {
            "text": "This meeting is a great opportunity to hear about what’s going on in each organisation, to get updates on each of the community’s workstreams, plus get support from others on things that are important to you. It’s primarily aimed at those who lead policy design work in government organisations – and others are welcome to join too."
        },
        {
            "heading": 2,
            "text": "Co-design - working group"
        },
        {
            "text": "New for 2022 – we are launching a working group on citizen co-design to define what it means for government, say why it’s important and how best to do it. There’s a lot of interest in this topic across government and we want to lead the way."
        },
        {
            "heading": 2,
            "text": "Future workforce – working group"
        },
        {
            "text": "We want to make it easier for great policy design people to work in government. So we are setting out roles and standards for policy design. In 2022, we want to build relationships with the top universities to explain what skills government needs and we are looking to offer work experience for policy design students."
        },
        {
            "heading": 2,
            "text": "Policy-to-delivery course – working group"
        },
        {
            "text": "We are leading the development of a cross-government course for people who make public policy and services. It will teach them the fundamentals of design and how to deliver public value. We have partnered with 10 other government professions, functions and expert networks to make this course, and we’ll be piloting it 2022."
        },
        {
            "heading": 2,
            "text": "Editorial and events - working groups"
        },
        {
            "text": "We couldn’t run our brilliant events or share ideas without people who are passionate about community. So if you are interested in helping to curate our events or blog posts, then do volunteer! It’s a great way to meet other people in the community and to make connections with experts outside of government too."
        }
    ]
}