{
    "url": "https://educationhub.blog.gov.uk/2022/01/27/how-the-period-products-scheme-is-removing-barriers-in-education/",
    "title": "How the Period Products Scheme is removing barriers in education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Period Products Scheme",
        "Schools"
    ],
    "pub_date": "2022-01-27T09:50:34+00:00",
    "content": [
        {
            "text": "No-one should be held back from accessing education due to their period, which is why we launched the Period Products Scheme to provide learners with period products when they need them."
        },
        {
            "text": "Since its launch in January 2020, 94% of secondary schools and 90% post-16 organisations in England now provide free period products to pupils. There has been a surge in environmentally friendly products being ordered, with figures up from under a third of schools and colleges in 2020 to almost half in 2021. We’re also encouraging more primary schools to order products – 61% have ordered so far."
        },
        {
            "text": "Here we provide information on the scheme and how your schools and colleges can get involved."
        },
        {
            "text": "What is the Period Products Scheme?"
        },
        {
            "text": "The Period Products Scheme provides learners with period products when they need them. It provides anyone who has periods access to tampons, pads and more through their school or college if, for example, they can’t afford period products, have forgotten to bring them to school or college or have come on their period unexpectedly."
        },
        {
            "text": "Who is eligible for the scheme?"
        },
        {
            "text": "All learners in schools and colleges in England should be able to access period products if they need them. Girls, non-binary and transgender learners who have periods may all need to access this scheme."
        },
        {
            "text": "How does the scheme work?"
        },
        {
            "text": "To make sure organisations have access to a wide range of period products in the most cost-effective and efficient way, we have a national contract with Personnel Hygiene Services Limited (phs). This allows organisations to order period products and have them delivered when they need them."
        },
        {
            "text": "Schools and colleges then choose how the products are made available to pupils. Some have them in the welfare room, others in toilets. Some organise drop-in sessions where learners can go to collect products."
        },
        {
            "text": "I don’t think my school/college offers this – what should I do?"
        },
        {
            "text": "Speak to your school or college and make sure they are aware of the scheme – if they are not, explain that they should look online at how to get involved."
        },
        {
            "text": "How long does the scheme run for?"
        },
        {
            "text": "The scheme has been extended until at least 2024 as part of the Government’s drive to end period poverty and support disadvantaged pupils."
        },
        {
            "text": "More information on the Period Product scheme can be found here."
        }
    ]
}