{
    "url": "https://defrafarming.blog.gov.uk/2022/01/27/introducing-the-uk-agriculture-partnership/",
    "title": "Introducing the UK Agriculture Partnership ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2022-01-27T17:01:46+00:00",
    "content": [
        {
            "text": "When the UK left the European Union, agriculture became a devolved policy area. England Northern Ireland, Scotland and Wales became responsible for their own agriculture policy. "
        },
        {
            "text": "This change continues to present a huge number of opportunities for each country in the union. They can develop plans that work for their distinct and diverse geographies, environments and farmers. "
        },
        {
            "text": "The devolved administrations  already work closely to ensure their policies are aligned.  "
        },
        {
            "text": "However, to share scientific ideas, solutions and innovations, Defra set up the UK Agriculture Partnership. It launched today.  We'd like to share a little more about it in this post and we'll follow up with a summary of the first event very soon. "
        },
        {
            "heading": 2,
            "text": "Our purpose "
        },
        {
            "text": "The UK Agricultural Partnership creates a forum for farmers, academics, researchers, businesses and policymakers across the UK to address common challenges. "
        },
        {
            "text": "Together we hope to improve collaborative working and find innovative solutions to tackle biodiversity decline, meet net zero targets and grow high-quality food."
        },
        {
            "text": "We see this as an opportunity to share our knowledge and world-leading research so that we can develop sustainable approaches to agriculture, reduce carbon emissions, and further increase farm productivity  "
        },
        {
            "text": "It’s a bold ambition, but we believe it can and it must be done if we are to tackle the most complex problems of our time.  "
        },
        {
            "heading": 2,
            "text": "Our first meeting "
        },
        {
            "text": "The first meeting took place today at the Royal Agricultural University, Cirencester. Attendees included universities and research institutions, agri-businesses, charities and campaign groups, farmers and farming groups as well as ministers and civil servants. "
        },
        {
            "text": "The first event focussed on addressing the impact of agriculture on water quality. We'll blog about this in the next week or so. "
        },
        {
            "text": "The UK Agriculture Partnership is an ongoing collaborative forum with meetings taking place on a quarterly basis across to UK focussing on issues of common concern such as soil health, decarbonising agriculture etc.  "
        },
        {
            "text": "We want to hear many different perspectives, spark conversations and ensure we stay connected on farming issues across the nations, where its right to do so. "
        },
        {
            "heading": 2,
            "text": "What we hope to learn "
        },
        {
            "text": "We’re in a unique position at a unique time. We’re excited to learn more about how each country is approaching the transition, what their plans are and the results of their tests and pilots. "
        },
        {
            "text": "We know that excellent research and training centres are leading the way in finding innovative solutions to many of the pressing issues facing agriculture today. In particular, the James Hutton Institute in Scotland, the Agrisearch in Northern Ireland, Aberystwyth University in Wales or the John Innes Centre in East Anglia. Their insights will be invaluable for farmers and policymakers across the UK. "
        },
        {
            "heading": 2,
            "text": "The next event "
        },
        {
            "text": "We’ll publish more information on this soon. "
        },
        {
            "text": "If you have ideas for future events, or any other questions or comments about the UK Agriculture Partnership, please email us: UK-Agriculture-Partnership@defra.gov.uk, and look out for us on Twitter using the hashtag #UKAgriculture. "
        }
    ]
}