{
    "url": "https://medregs.blog.gov.uk/2022/01/27/lead-the-way-towards-a-combined-ct-ci-assessment-by-joining-our-pilot/",
    "title": "Lead the way towards a combined CT/CI assessment by joining our pilot",
    "authors": [
        "Beatrice Panico"
    ],
    "categories": [
        "Innovation"
    ],
    "pub_date": "2022-01-27T09:27:51+00:00",
    "content": [
        {
            "text": "The Medicines and Healthcare products Regulatory Agency is playing a fundamental role helping to ensure that the UK remains one of the best places in the world to deliver safe, cutting-edge research. Part of this work is the recently-launched combined review service for all new Clinical Trials of Investigational Medicinal Products (CTIMPs), which provides a more streamlined and efficient service for research applicants."
        },
        {
            "text": "For those who haven’t heard the news, since the first of January the combined review offers a single application submission route and a co-ordinated review for all new CTIMPs, resulting in a combined regulatory and ethics decision on a clinical trial. Applicants just need to do a single application, thus facilitating rapid start up and potentially benefitting patients sooner."
        },
        {
            "text": "Building on this, we are testing a new process as part of our vision to improve the speed and efficiency of clinical research approvals. We are calling on sponsors, research organisations and investigators running studies involving both a medicine (a clinical trial, CT) and a medical device (a clinical investigation, CI) to join our CT/CI coordinated assessment pilot and contribute to develop a new streamlined route within the combined review journey."
        },
        {
            "text": "The call for expressions of interest is open. Join the pilot today and contribute to potentially changing the application process of clinical research involving both a medicine and a medical device.  By doing so, you will be supporting the UK-wide ambitious vision of The Future of UK Clinical Research Delivery."
        },
        {
            "text": " "
        },
        {
            "text": "The benefits of joining the CT/CI PiIot Programme"
        },
        {
            "text": "Benefits for sponsors, research organisations and investigators include:"
        },
        {
            "text": " "
        },
        {
            "text": "Eligibility "
        },
        {
            "text": "To join the pilot, you must have a trial involving both an investigational medicinal product (a clinical trial, CT) and a medical device (a clinical investigation, CI)."
        },
        {
            "text": "The pilot excludes applications for any Advanced Therapy Investigational Medicinal Products (ATIMP) or First Time in Human studies with novel compounds that requires Expert Advisory Group (EAG) review."
        },
        {
            "text": " "
        },
        {
            "text": "Applications"
        },
        {
            "text": "If your study meets the criteria and you would like to express your interest in joining the pilot programme to benefit from the joint CT/CI assessment procedure, please email clintrialhelpline@mhra.gov.uk with the subject line CT/CI pilot."
        }
    ]
}