{
    "url": "https://deframedia.blog.gov.uk/2022/01/27/put-down-roots-with-woodland-creation/",
    "title": "Put Down Roots with woodland creation",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-01-27T10:13:09+00:00",
    "content": [
        {
            "text": "This week we launched a new drive to encourage farmers and landowners across England to plant and manage more trees."
        },
        {
            "text": "The Forestry Commission and Defra are drawing attention to the attractive grant schemes and free specialist advice available through their new Put Down Roots campaign. Woodland creation offers opportunities to diversify, generate extra income, increase farm productivity, and enhance land – without taking the best agricultural land out of use. Grants and support can help with the cost of designing, planting and managing trees. For example, with the England Woodland Creation Offer, farmers and landowners could receive over £10,000 for every hectare of new woodland in England."
        },
        {
            "text": "This announcement was covered as a national exclusive in iNews. One of the first places to benefit from the England Woodland Creation Offer is Blenheim Estate in Oxfordshire, which has received funding to grow 270,000 trees and is expected to absorb 20,000 tonnes of Co2 over the next 25 years. The site will also benefit from 15km of new wooded footpaths for the public in and around the area. The announcement has since been covered by BBC News Online."
        },
        {
            "text": "Extensive trade coverage appeared in outlets including Farming UK, Farming Online, Forestry Journal, Horticulture Week, Agriland, ENDS Report and EDIE. Richard Stanford, Chief Executive of the Forestry Commission was interviewed on BBC Radio 4 Farming Today and by Farmers Weekly and Farmers Guardian."
        },
        {
            "text": "Regionally, the announcement was covered by the Yorkshire Post, Western Morning News, Derbyshire Live, Oxford Mail, Whitney Gazette, Telegraph and Argus and South West Farmer. Speaking from Blenheim Estate, Forestry Commission area director for the South East Jane Hull was featured on ITV Meridian alongside the Estates Director, Roy Cox."
        },
        {
            "text": "Farming Minister Victoria Prentis said:"
        },
        {
            "text": "Forestry Commission Chief Executive, Richard Stanford, said:"
        },
        {
            "text": "By taking up grants such as the England Woodland Creation Offer now, farmers and landowners will be able to transfer into a future environmental scheme at agreed points without having to repay their current funding, meaning there’s no need to delay planting trees now. The England Woodland Creation Offer is also compatible with the Basic Payment Scheme, which means you can continue to claim on eligible land. Farmers and landowners may also be able to transfer land in an existing Environmental Stewardship grant agreement into the England Woodland Creation Offer without penalty, subject to conditions."
        },
        {
            "text": "The Put Down Roots campaign compliments the Government’s wider drive to treble planting rates in England by the end of this Parliament, as part of the commitment to increase planting rates to 30,000 hectares per year across the whole UK by the end of this Parliament."
        },
        {
            "text": "To hear more about the campaign, please contact putdownroots@defra.gov.uk and view the campaign site here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}