{
    "url": "https://socialcareinspection.blog.gov.uk/2022/01/27/report-care-leavers-experiences-preparing-to-leave-care/",
    "title": "Our new report on care leavers’ experiences of preparing to leave care",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care experienced",
        "care leavers",
        "children looked after"
    ],
    "pub_date": "2022-01-27T09:30:56+00:00",
    "content": [
        {
            "text": "Yvette Stanley discusses our new research, published last week."
        },
        {
            "text": "Last week, we were pleased to launch our report, ‘Ready or not’, on the views and experiences of children in care aged 16 and 17 and care leavers on their preparation and plans for leaving care."
        },
        {
            "text": "We are immensely grateful to all those care leavers who either gave their time to co-design the research or to share their experiences and views through the surveys or interviews. I don’t underestimate how difficult and painful it can be to revisit the past. I know, too, that some of these findings will be especially demoralising and upsetting for some older care leavers when they read that the experiences of many younger people appear to be no better than their own."
        },
        {
            "heading": 2,
            "text": "Powerful insights from children and care leavers"
        },
        {
            "text": "The report is full of powerful and affecting insight borne of lived experience but, sadly, it does not make for reassuring or comfortable reading. It tells a common story of young people leaving care before they were ready, ill-equipped for so-called ‘independence’, often left feeling isolated and disempowered, and without easy access to the support and safety nets that most teenagers would take for granted. These are life-shaping experiences, as the reflections of the older care leavers bear witness."
        },
        {
            "text": "We did hear some positives. We are not surprised to see that many young people particularly valued the strong relationships they had with their personal advisers (PAs). This echoes the evidence we heard during the most severe restrictions of the pandemic, when the effort that many PAs made to ensure that they kept in touch and supported young people was invaluable in the most uncertain and difficult of times. Those young people who had received good support found it made a real, lasting difference. They also especially valued help from their foster carers or from residential staff with learning practical skills, such as cooking and budgeting, and having access to effective advocacy."
        },
        {
            "text": "Overall, however, the report makes for dispiriting reading. When we hear that young people are still moving with their possessions in bin bags (see also last week’s report from the National Youth Advocacy Service), we know we have a long way to go before we can say that children in care and care leavers are being treated with the kind of care and respect that they deserve."
        },
        {
            "heading": 2,
            "text": "Lessons for Ofsted"
        },
        {
            "text": "I am particularly mindful that this report holds important and urgent lessons for Ofsted. We need to make sure that we are paying proper and serious attention to the needs, experiences and concerns of care leavers. Our work needs to focus on the things that make the most difference to their lives, including, for example, how the local offer for care leavers is translated into meaningful action and improvement."
        },
        {
            "text": "As we emerge from the pandemic, we expect to carry out more focused visits to local authorities that will look at the experiences of care leavers. We’ll take careful account of the research findings during these visits and in our other inspections. We’ll publish a summary report of the focused visits during 2022–23."
        },
        {
            "text": "In the meantime, in the light of this research and other feedback we have received, we are also considering carefully (but with necessary urgency) how we can improve how we look at the experiences and progress of care leavers in standard and short inspections of local authority children’s services. We are speaking to people with care experience, and other stakeholders, about how best to do that."
        },
        {
            "heading": 2,
            "text": "A significant shift in priorities is needed"
        },
        {
            "text": "We hope that all local authorities and their partner agencies will take the time to consider and absorb the important messages that care leavers have given us through this research. I am sure that they will want to reassure themselves that they are doing all they can to make sure that young people as well prepared as possible to make the most of the opportunities that adulthood should provide."
        },
        {
            "text": "We know, however, that improvement is not just down to a matter of will or commitment on the part of the local authority and its partners. Of course, there are improvements to be made at a local level, and our inspections show that, too often, the quality of support that care leavers receive is far too variable."
        },
        {
            "text": "But we have made it clear in our submissions to the Care Review that sustainable, meaningful improvement requires a significant shift in priorities at a national level towards children and young people. Specifically, the way we treat the children and young people whose care has been entrusted to the state must be one of the most accurate and important measures of our commitment to improving the lives of vulnerable children. This report suggests that, collectively, we continue to fall short in meeting that commitment."
        }
    ]
}