{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/27/should-your-genes-push-up-the-price-of-your-car-insurance/",
    "title": "Should your genes push up the price of your car insurance?",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Guest Blog",
        "Latest Stories"
    ],
    "pub_date": "2022-01-27T13:00:47+00:00",
    "content": [
        {
            "text": "How would you feel if your genomic information made your car insurance more expensive? Would you want to find out whether your child was likely to excel at school or at sport? Should criminal sentencing account for a person’s genomic predispositions?"
        },
        {
            "text": "These are just some of the questions posed by a new report, published today by the Government Office for Science, that we might face in the not-too-distant future."
        },
        {
            "text": "Genomics Beyond Health looks at how genomics, which is a study of all of a person’s genes, could play a part in our lives in the future, and the ethical considerations it presents."
        },
        {
            "text": " "
        },
        {
            "text": "Until now genomics has mostly been used within healthcare and medical research where it can help provide more precise diagnosis, target better treatments, and help predict the risks of developing certain disease. The UK’s use of genomics in healthcare is world-leading and viral genomics has been critical for monitoring COVID-19 and detecting emerging variants."
        },
        {
            "text": "We are now beginning to understand how the genome can influence people’s traits and behaviours beyond health."
        },
        {
            "text": "In the job market, employers could potentially use genomics to select workers of optimal health or personality for a role, or to prevent workplace injury."
        },
        {
            "text": "In the sporting arena, certain genes have been associated with elite athletic performance and improved endurance – potentially meaning children could be identified as future Olympic stars. In the future, gene editing techniques could be used to potentially enhance the performance of athletes whose genome does not include advantageous gene variants ."
        },
        {
            "text": "Genomic testing companies are already marketing tests that claim to predict a pupil’s academic performance, however it is still unclear how accurate results would be and what parents and teachers would do with the information. Genomic data could also be used to enable earlier interventions in students with learning difficulties or those who may require additional support."
        },
        {
            "text": "And in the insurance market companies might want information about a customers genes to see if they have characteristics of risk-taking behaviour or are susceptible to injury."
        },
        {
            "text": " "
        },
        {
            "text": "Sequencing the whole human genome once took years and cost billions of pounds – it now takes less than a day and costs about £800. The report advises that as the technology continues to mature and its usage widens,  there must be greater focus on how policy and regulation might adapt to developments in genomic science."
        },
        {
            "text": "For example while the UK has no explicit legislation barring the use of genomic analysis by employers, the US has already implemented laws that prevent the use of this type of information in job hiring, redundancy, placement, or promotion decisions."
        },
        {
            "text": "Proactive policy on genomics across sectors may be needed to protect the privacy and anonymity of UK citizens’ as well as the security of their genomic information. It is important that policy is informed by the ethical and legal challenges that may arise, and that the legal framework is able to respond to these developments."
        },
        {
            "text": "The report recommends these rapid technological and scientific advances should be considered when defining policy and regulation that will help shape and ensure the privacy, anonymity, and security of the genomic sequence of UK citizens."
        },
        {
            "text": " "
        },
        {
            "text": "Sir Patrick Vallance, Government Chief Scientific Adviser, said:"
        },
        {
            "text": "“We are still in the infancy of understanding the complexity of genomic data but this is changing very rapidly. Now is the time to consider what might be possible, and what actions government and the public could take to ensure the widespread application of genomics can occur in a way that protects and benefits us all.”"
        },
        {
            "text": "For any more questions please contact the Go Science team at foresight@go-science.gov.uk"
        }
    ]
}