{
    "url": "https://minimumwage.blog.gov.uk/2022/01/27/sleep-in-shifts-in-social-care/",
    "title": "Sleep-in shifts in social care",
    "authors": [
        "josephwilkinson"
    ],
    "categories": [
        "Compliance and enforcement",
        "Evidence and Consultation"
    ],
    "pub_date": "2022-01-27T10:16:31+00:00",
    "content": [
        {
            "text": "In March 2021, the Supreme Court issued the final judgement on a case of great significance for care providers and low-paid care workers. The case in question, Royal Mencap Society v Tomlinson-Blake, was first brought to an Employment Tribunal in 2016. It turned on whether care workers on ‘sleep-in shifts’ were entitled to the NMW for the full duration of their shift, including time spent asleep.  ‘Sleep-in shifts’ are those where workers are required to sleep at a residence overnight with the possibility of waking to provide care."
        },
        {
            "text": "The Supreme Court found that those on sleep-in shifts in social care are not entitled to the NMW while asleep. Central to the Supreme Court’s ruling were recommendations made in the LPC’s First Report, published in 1998. Commissioners at the time made the following recommendation: ‘For hours when workers are paid to sleep on the work premises, workers and employers should agree their allowance, as they do now. But workers should be entitled to the National Minimum Wage for all times when they are awake and required to be available for work.’ This was used as a guide to the intent behind the NMW regulations."
        },
        {
            "text": "Sleep-ins were not part of our remit in 2021, but we nevertheless heard evidence on the matter from care employers and unions representing affected workers. The introduction to our 2021 Report set out our view on this evidence and the aftermath of the Supreme Court’s ruling."
        },
        {
            "heading": 2,
            "text": "What we said in our 2021 Report"
        },
        {
            "text": "In setting the framework for the first minimum wage, Commissioners made pragmatic recommendations based on what they (then) saw as common practice. These were not infallible, nor were they intended to be unchangeable. Rather, they reflected the pragmatic view of practice at the time. The LPC and the Government in subsequent early reports and responses recognised that sleep-in shifts were a difficult area and a source of uncertainty. We received submissions which suggested workers were being treated unfairly; noted that tribunal rulings were clouding the application of the policy; and asked the Government to clarify the guidance."
        },
        {
            "text": "The care sector has changed significantly since 1998. The funding situation has tightened and the importance of the minimum wage for the sector has increased. In our reports, we have repeatedly flagged the effects this has had for the care workforce, who have experienced deteriorating working conditions and employment practices which often tip over into non-compliance."
        },
        {
            "text": "There is now no ‘standard practice’ on sleep-ins across the UK. We have heard that different commissioning bodies take different approaches, and this is likely to further fragment as local authorities alter their practices in response to the Supreme Court ruling. This makes life hard for providers, especially those who operate across several local authorities. For workers, this will represent a further deterioration in working conditions; some will find their payments reduced. Clients – and the quality of care – will also be affected. The overall trend is likely to be that workers on sleep-ins are not paid the NMW, and that it is harder to attract workers to these shifts. This will be to the detriment of people who need overnight care and could mean a move towards unstaffed systems, reliant on alarms or cameras."
        },
        {
            "text": "All parts of the sector agree there is a need for clarity and consistency. As things stand, sleep-in payments are unregulated, determined by negotiation between commissioning bodies, providers and the workforce. Some providers may pay the NLW for a shift, while others will pay a flat fee. This creates space for confusion and exploitation. And while all sides agree on the need for clarity, we suspect there may be less agreement on what the actual solution should be. Furthermore, we suspect that employers’ views on the right option for paying for sleep-ins would be heavily influenced by the funding available to them from local authorities and, ultimately, central Government."
        },
        {
            "text": "Several groups have called for us to respond to the Supreme Court’s judgement; to clarify or amend the recommendations made in 1998; or to consult and make new recommendations on the treatment of workers on sleep-ins. We have carefully considered this, conscious that the Supreme Court’s ruling was on the interpretation of regulations made in 1998 and that a statement in 2021 would not affect the Court’s judgement. The LPC’s value is in using a social partnership model to find consensus among different parties. There is currently no consensus. Any further development in the approach to sleep-ins would need to be inextricably linked to wider plans for social care’s funding arrangements, its provider base and its workforce. This suggests that the Government is better placed than the LPC to resolve the treatment of sleep-ins.  Though of course, if Government does decide to act on sleep-ins, the LPC would be willing to assist where it can."
        },
        {
            "text": "Changes to the treatment of sleep-ins would require funding reform and a wider programme for the care workforce. It would not be productive to recommend extending the NMW to sleep-ins if this was unfunded and created additional stresses for an already overburdened sector. The detriment would fall – as it does now – on the workforce. An entitlement to the NMW for sleep-ins would not change the underlying issues faced by most care workers or address the fundamental problems the sector faces. The consistent picture we hear from workers and providers is of skills shortages, high turnover, low esteem and workers lost to other low-paying sectors. All parties seem to agree that in an ideal world, care would not be a minimum wage profession but at this time there is no apparent path to realise this."
        },
        {
            "text": "We note plans for a green paper for reform of the sector and that a three-year Spending Review has been completed. The next steps on sleep-ins need to be aligned with this and supported by a sustainable funding settlement. from staff turnover and skills shortages to concerns around compliance, travel time and sleep-in shifts stem from its inadequate funding settlement."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Our remit and consultation timetable for 2022 has yet to be confirmed. In any case, we always want to hear evidence from those in the care sector, whether employers, workers or other parties. If you are interested in giving evidence to Commissioners please contact us via lpc@lowpay.gov.uk."
        }
    ]
}