{
    "url": "https://forestrycommission.blog.gov.uk/2022/01/27/tree-mendous-news-local-authority-treescapes-fund-and-urban-tree-challenge-fund-to-launch-again/",
    "title": "Tree-mendous news - Local Authority Treescapes Fund and Urban Tree Challenge Fund to launch again!",
    "authors": [
        "Rhiannon Leyden-Preece"
    ],
    "categories": [
        "Urban trees",
        "Woodland creation"
    ],
    "pub_date": "2022-01-27T08:00:37+00:00",
    "content": [
        {
            "text": "I am Rhiannon Leyden-Preece, Policy Delivery Officer for Defra, working in the team behind the Local Authority Treescapes Fund."
        },
        {
            "heading": 2,
            "text": "Why we need more trees outside of woodlands"
        },
        {
            "text": "Last year saw the world’s nations taking part in the COP26 climate summit, with a landmark promise from over 100 world leaders to end and reverse deforestation by 2030. However, our nations’ trees are still under threat. Pests and diseases are depleting tree populations across the country. Ash dieback alone is predicted to cost Great Britain £15bn over the next 100 years, with half of that value expected in the next decade."
        },
        {
            "text": "Replacing these lost trees is vital for several reasons. By replacing trees lost to stresses we will be protecting the delicate balance of native biodiversity within our treescapes, mitigating flood risks, protecting our rivers’ fish stocks from heat and agricultural run-off, reducing noise and air pollution from busy roads, capturing carbon and locking it away, and maintaining the role of nature at the heart of communities."
        },
        {
            "text": "Yet tree replacement doesn’t go far enough. We need to be planting more trees if we’re going to meet the UK targets for net zero by 2050. Furthermore, a staggering 12% of the UK’s children spend little or no time amongst nature; missing out on the health and wellbeing benefits that nature has to offer. This is concentrated amongst children from minority ethnic backgrounds and lower income homes in the most deprived areas of the country, and often in urban communities."
        },
        {
            "text": "The Forestry Commission and Defra are helping to combat these issues and meet tree planting targets through the reopening of two major grant funds this year – the second round of the Local Authority Treescapes Fund (LATF), and the Urban Tree Challenge Fund (UTCF), now in its fourth year."
        },
        {
            "heading": 2,
            "text": "What is the Local Authority Treescapes Fund (LATF)?"
        },
        {
            "text": "The LATF is a grant scheme for local authorities (LAs), to drive an increase in non-woodland tree planting across our landscapes. The fund is focused on replanting trees outside of woodlands including trees in hedgerows, parklands, riparian zones, urban areas, beside roads and footpaths as well as small linear woodlands, copses, and shelterbelts. They are particularly valuable trees to society as they can provide the greatest levels of ecosystem services, including cultural benefits and support for biodiversity. The fund will also contribute greatly to landscape recovery from tree diseases such as ash dieback."
        },
        {
            "text": "The LATF first launched in 2021 with 260,000 trees to be planted outside of woodlands as part of the fund with 139 local authorities awarded a share of a £4.4 million pot across 42 projects. Projects will support a variety of ways to get trees in the ground, using both natural regeneration and traditional planting and with a strong focus on community engagement."
        },
        {
            "heading": 2,
            "text": "What is the Urban Tree Challenge Fund (UTCF)?"
        },
        {
            "text": "The UTCF is a key government offer to level up access to nature across the country, planting trees in socially deprived urban areas with low canopy cover, in proximity to healthcare and educational facilities. By requiring match funding from communities and local authorities, the UTCF drives value for money while also engaging local communities in efforts to fund-raise for, plant and maintain trees. The UTCF supports planting of large ‘standard’ trees and street trees – making an immediate impact to communities and ensuring other organisations who provide planting for smaller trees can continue to do so."
        },
        {
            "text": "The UTCF first launched in 2019. In the most recent round of applications, 46 projects in England were successful in securing funding to plant almost 25,000 trees, building upon the 134,000 trees already planted through this fund in previous years."
        },
        {
            "heading": 2,
            "text": "How are they different, and which one shall I apply for?"
        },
        {
            "text": "Whilst the LATF and UTCF both allow local authorities and community groups to access funds for new large-scale tree planting projects, the funds have some unique differences outlined below."
        },
        {
            "heading": 2,
            "text": "How do I apply?"
        },
        {
            "text": "Application forms are available on the Urban Tree Challenge Fund page and the Local Authority Treescapes Fund page on GOV.UK. LATF and UTCF applications now require you to register with Rural Payments to obtain a Single Business Identifier (SBI) and Customer Reference Number (CRN). This must be provided on the application form. You can register with Rural Payments now."
        },
        {
            "heading": 2,
            "text": "I am a local authority, which scheme should I apply for?"
        },
        {
            "text": "You can apply for both! Apply to UTCF if you wish to plant new large trees (standards) in urban areas, or LATF if you wish to plant other non-woodland trees (including replacement urban standards that have been recently lost)"
        }
    ]
}