{
    "url": "https://hmlandregistry.blog.gov.uk/2022/01/27/trialling-telephone-requisitions/",
    "title": "Trialling telephone requisitions",
    "authors": [
        "Darren Standring, Customer Policy Executive"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-01-27T17:01:01+00:00",
    "content": [
        {
            "text": "Feedback tells us that customers like a quick phone call to resolve a simple issue with an application. We are introducing a trial to show how effective they are in resolving simple request for information (requisition) points."
        },
        {
            "text": "We don’t currently have comprehensive information on how often they were used and how much time they saved for customers and for our caseworkers. The aim of the trial is to help us make evidence-driven decisions about the future of telephone requisitions."
        },
        {
            "heading": 2,
            "text": "How this will work"
        },
        {
            "text": "Customers may receive a call from an HM Land Registry caseworker when a call can resolve minor or straightforward issues that are blocking the completion of an application. We will be starting with some of our older cases, rather than the newest cases."
        },
        {
            "text": "If we have scheduled a call with you, please do not phone us in the meantime."
        },
        {
            "text": "Where the point cannot be resolved on a call, we will put our request in writing in the usual way; most requisitions are sent using email where one has been supplied. The best way to reply to a written requisition is to use ‘reply to requisition’ within the portal as this is automatically added to your application."
        },
        {
            "text": "This is a trial being undertaken by a limited number of staff and will not cover all applications that are submitted during the month, so you may receive a call on one application but not on another submitted around the same time. The purpose of the call is to facilitate completion of the application that that member of staff is actioning at that time and caseworkers will not be able to discuss any other applications."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The trial is scheduled to last for at least one month to give enough data, starting on 27 January 2022. We will then take stock of what the trial has told us and make a decision on how to proceed. At this stage we are not necessarily committing to the reintroduction of telephone requisitions as we want to be sure that any long-term solution provides real support for our customers as well as bringing greater efficiency – and therefore speed – to our services."
        },
        {
            "text": "We will share details of any future decision when more information is available."
        }
    ]
}