{
    "url": "https://earlyyears.blog.gov.uk/2024/05/16/celebrating-childminders-and-welcoming-change/",
    "title": "Celebrating childminders and welcoming change",
    "authors": [
        "Yvette Stanley, National Director Regulation and Social Care",
        "Lee Owston, National Director Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2024-05-16T10:10:31+01:00",
    "content": [
        {
            "text": "It’s Childminding Week, and we want to recognise the excellent work of childminders like you. Thank you for all that you do to give families much-needed flexibility, and children the best start in life."
        },
        {
            "text": "Almost all of you do this incredibly well. 97% of Ofsted-registered childminders were rated good or outstanding at their last inspection. That’s the highest of any type of provision we inspect."
        },
        {
            "text": "Here's a message from the Chief Inspector:"
        },
        {
            "text": "Doing our part"
        },
        {
            "text": "We want to make sure you can continue to do this great work."
        },
        {
            "text": "Of course, what is best for children remains at the heart of any decision-making. But we are committed to doing everything we can to improve the sector for childminders."
        },
        {
            "text": "We’ve already been looking at ways to make registering with us quicker and reduce delays."
        },
        {
            "text": "We have started calling all early years applicants to help them through the next steps. This has already reduced the number of times you have to contact us."
        },
        {
            "text": "We also appreciate that inspection can be daunting. But we want you to have the confidence to do what you do every day and not to do anything different because we’re there. If you are doing what is right for your children, you are doing what is right for us."
        },
        {
            "text": "We also have lots of resources available for you, including videos, guides and blogs."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Childminding week also gives us the chance to look ahead to some of the important changes coming this year. From autumn, the government is trying to make things more flexible for childminders."
        },
        {
            "text": "These changes aim to help you to:"
        },
        {
            "text": "We are looking forward to working with the Department for Education to bring in their new changes. They will:"
        },
        {
            "text": "The changes will allow for existing ‘childcare on domestic premises’ providers to continue operating with a minimum of 4 people. But if you are submitting a new registration for ‘childcare on domestic premises’ you will need to have a minimum of 5 people, otherwise you will need to register as a childminder."
        },
        {
            "text": "We know change can be disruptive. So, over the next few months, we will be updating our systems and guidance to make sure you have everything you need. We’re working to make our guidance clear, simple and more accessible for everyone."
        },
        {
            "text": "We’ll also be communicating regularly about these changes. Please subscribe to our early years blog to keep hearing about these plans."
        },
        {
            "text": "Current options"
        },
        {
            "text": "In the meantime, there are a few different ways of working you can already take advantage of:"
        },
        {
            "text": "Thank you"
        },
        {
            "text": "This is an exciting time to get into childminding."
        },
        {
            "text": "We’re excited about the upcoming changes and wanted to celebrate the good work of all of you, especially during Childminding Week."
        },
        {
            "text": "Thank you for all that you do for children and parents."
        },
        {
            "text": "And please take part in our Big Listen, which is open until 31 May 2024. We encourage everyone, including childminders, parents and children, to take part. We are committed to listening to you and working together to build a better system for you, for parents and, most importantly, for children."
        }
    ]
}