{
    "url": "https://accessibility.blog.gov.uk/2024/05/16/celebrating-global-accessibility-awareness-day/",
    "title": "Celebrating Global Accessibility Awareness Day",
    "authors": [
        "Richard Morton, Head of Accessibility at the Central Digital and Data Office, Cabinet Office"
    ],
    "categories": [
        "Accessibility",
        "Accessibility Regulations",
        "Events"
    ],
    "pub_date": "2024-05-16T11:04:47+01:00",
    "content": [
        {
            "text": "When you hear the word “accessibility” what do you think of? It depends on how it is used, and there are a number of different meanings. Thursday 16 May is Global Accessibility Awareness Day, and the focus is on digital accessibility and inclusion, rather than other crucial elements of accessibility such as building access or inclusive recruitment interviews. "
        },
        {
            "text": "Accessibility matters every day. Awareness days serve as tools to foster improvement and increase engagement, and their significance has grown substantially. There are lots of events happening across the public sector you can get involved with, please see our Central Digital and Data Office events here."
        },
        {
            "text": "Here are a few simple things you could do, to understand the importance of digital accessibility or to demonstrate this to others who need to know (which is everyone):"
        },
        {
            "text": "Above is an example of a web page zoomed in, where the Chat live button is obscuring most of the content, and remains at the top and middle of the page when the page is scrolled. Some people rely on the zoom function to be able to read web pages but if they are not designed to accommodate this, it can be an incredibly frustrating experience."
        },
        {
            "text": "For a better example, let's look at the Mind charity website. They have a \"Get help now\" button at the top, which is obviously crucial. When you zoom in on your browser, the button stays visible as you scroll down, but if you zoom in too much, it moves out of the way so it doesn't cover too much of the content."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "If you want to find out more about common web accessibility problems that create barriers, visit the Accessible University. It is a fictional inaccessible university home page, together with an accessible version of the page with the issues fixed. It also has examples of accessible and inaccessible document formats.  "
        },
        {
            "text": "As we celebrate Global Accessibility Awareness Day on 16 May, many events and activities are happening around that date to promote inclusivity and accessibility for everyone. Look out for events in your own organisation and beyond and join in the fun! "
        },
        {
            "text": "We also advise you to check out our Government Resources for Accessibility document which may be useful. "
        },
        {
            "text": " "
        }
    ]
}