{
    "url": "https://geospatialcommission.blog.gov.uk/2024/05/16/geospatial-shadowing-programme-working-and-learning-together/",
    "title": "Geospatial Shadowing Programme: working and learning together",
    "authors": [
        "Paula Dorman, NUAR Onboarding Specialist, Geospatial Commission"
    ],
    "categories": [
        "Data",
        "Learning"
    ],
    "pub_date": "2024-05-16T12:20:06+01:00",
    "content": [
        {
            "text": "At the Geospatial Commission, we firmly believe in a hands-on experience and in creating connections. We recognise the importance of joining people and ideas to make big things happen. That is precisely why we introduced our Geospatial Shadowing Programme.  "
        },
        {
            "text": "As we conclude the successful second year of this initiative, Paula Dorman, NUAR Onboarding Specialist, shares how the programme came about and colleagues’ experiences. "
        },
        {
            "text": "The Geospatial Commission has a formal partnership with HM Land Registry, Coal Authority, Valuation Office Agency, British Geological Survey (BGS), Ordnance Survey and UK Hydrographic Office, that gives us access to a wealth of geospatial data and expertise. Our organisations are at the forefront of their fields, leading with some of the largest public sector geospatial data transformations, including the Local Land Charges Programme, exploring opportunities for mine water heat and the National Underground Asset Register (NUAR). "
        },
        {
            "text": "That meant it was natural for us to come together to create a unique learning experience. A small group of dedicated individuals worked together to create a programme that would give colleagues from across our seven organisations the opportunity to shadow experts and see first-hand how each other's work in geospatial is changing the UK. "
        },
        {
            "text": "Each participating organisation offered different shadowing opportunities. The programme gave participants the chance to learn about real-life challenges and the innovative solutions that our organisations are designing and delivering. The exposure to different geospatial data and teams broadened their understanding of the industry whilst building new relationships with colleagues. "
        },
        {
            "text": "This year we had over 90 roles on offer. Our small group matched over 115 colleagues to the different opportunities. The roles on offer were varied and provided a diverse range of experiences, such as: "
        },
        {
            "heading": 2,
            "text": "Perspective from the field "
        },
        {
            "heading": 4,
            "text": "Rashida Denbow, National Underground Asset Register Commercial Manager, Geospatial Commission "
        },
        {
            "text": " My shadowing day was spent with the Competitive Intelligence team at Ordnance Survey in Southampton. This was a chance to understand how competitor insight is used to understand what the customer and market requirements are and how these are being met, using these insights to enhance innovation research to create new concepts and products. "
        },
        {
            "text": "The best part of this experience was getting a detailed insight into the approach Ordnance Survey takes to managing macro risks, gathering intelligence and preparing for the geospatial world in 5-10 years and more. This perspective has helped me to think bigger.  "
        },
        {
            "text": "I would recommend the shadowing opportunity as I got to contextualise my role in the wider geospatial industry, identifying the tools and knowledge that could help me in my current role."
        },
        {
            "heading": 4,
            "text": "Anna Harrison BSc MSc, Applied Quaternary Scientist, British Geological Survey "
        },
        {
            "text": "As an Applied Quaternary Scientist my main focus is analysing climate change data and geohazards to develop geohazard susceptibility datasets to meet stakeholder needs, such as GeoClimate.  "
        },
        {
            "text": " We held a Town Planning workshop for our attendees. We worked in cooperative groups drawing on the team's different expertise and skills to design an ideal town. We made the best use of the geology and resources available, whilst being convenient for humans, preserving the environment and maintaining a quality of life for all. "
        },
        {
            "text": "Attendees were able to familiarise themselves with a range of BGS key-data products and learn how to use and interrogate them in a ‘planning’ scenario. Other datasets were also consulted, such as the Environment Agency flood data, land use and protected areas. "
        },
        {
            "text": "We considered factors, such as building space, ground properties, hazards, access, drainage and utility provision; interrogating BGS datasets and other relevant available geospatial datasets to make informed decisions about where the best sites were for homes, local amenities, infrastructure, green spaces, etc.  "
        },
        {
            "text": "The day was hugely successful in providing us with an opportunity to network. It was incredibly valuable to be able to build an understanding of which datasets they knew about (and which they were not so aware of), which they found the most useful and how they accessed them. Working in teams naturally led to some healthy competition between us, and it was a great team-building exercise which led to some strong connections being made. It is easy to make assumptions about how users will access our datasets and what information they require, but this exercise opened my eyes to the large range of data and outputs that organisations need when using BGS data and how they interpret our data. "
        },
        {
            "text": "I would wholeheartedly recommend this type of workshop. It is important to ensure our research and outputs are tailored towards user needs. A key benefit from the day was highlighting improvements which can be made to how BGS communicates the use cases of its data products. We usually write up supporting documentation in isolation per product. An exercise like this highlighted that when using multiple BGS datasets in tandem, it is useful to have more guidance on how these data products can be used in conjunction with one another. "
        },
        {
            "text": "The day was a great example of why collaboration is key, for example, my team had a minerals geologist in it and so we considered mining hazards in our town plan, whilst others did not. Similarly, the team with a groundwater expert was able to explain the nuances of the groundwater data. This demonstrated the importance of consulting with all experts and working together to get a fuller picture. "
        },
        {
            "heading": 2,
            "text": "Always learning "
        },
        {
            "text": "Just as you seek the latest technology and tools in your everyday life, our government must think big and stay ahead in technology. Our ideas have the power to improve lives and change the world. We achieve this by continuously learning, staying updated with technology and cultivating curiosity about how we can use location data to help us develop and adapt to an ever-changing landscape. This approach is essential for addressing community needs and advancing the UK. "
        },
        {
            "text": "The Geospatial Shadowing Programme is not just about a day away from the desk; it is an investment in professional growth. Whether you are a seasoned geospatial professional or just starting your journey, this programme offers valuable insights, tools and connections. I am looking forward to us providing another successful year of exploration and learning. "
        },
        {
            "text": "Are you a public sector organisation that uses geospatial data and skills? If you would like to know more about our Shadowing Programme, get in touch with us at the geospatialcommission@dsit.gov.uk.  "
        }
    ]
}