{
    "url": "https://defradigital.blog.gov.uk/2024/05/16/how-defra-are-finding-accessibility-participants-for-user-research/",
    "title": "How Defra are finding accessibility participants for user research",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Accessibility",
        "User centred design",
        "User research"
    ],
    "pub_date": "2024-05-16T15:45:15+01:00",
    "content": [
        {
            "text": "User researcher Jason Stockwell explains how, as a Participant Lead, his job is to make sure user researchers have the right processes in place to get access to participants for research rounds."
        },
        {
            "text": "When making services, it’s vital that we meet accessibility standards and are not excluding people from being able to use them because they lack digital skills. This is an important part of the service standard."
        },
        {
            "text": "To do this, we need to make sure we carry out research with participants who represent the potential audience for the service, including people with access needs. This is a shared problem across user research and participant recruitment, particularly for programmes that are business facing: finding people to get involved with research who have an access need."
        },
        {
            "text": "The research operations team support programmes by finding participants to get involved in research sessions. We do not have a panel dedicated to finding accessibility participants, but we’re working on finding ways to find participants to get involved in future research opportunities."
        },
        {
            "heading": 2,
            "text": "1. Tactics to find accessibility participants"
        },
        {
            "text": "There are lots of ways to find participants to get involved in research. But some services are hard to recruit for, and finding people with any type of access need can be incredibly difficult. We’ve found it can help to meet people where they already spend their time, such as at events and in-person environments."
        },
        {
            "text": "We have an internal list of organisations, charities and community groups that we use to find for research. A proxy user acts as a substitute for another user to take part in user research. They wouldn’t necessarily use the service we’re building, but they might represent the ‘real’ user in some way, which helps us get a sense of what they might need. We are building relationships with trusted organisations and charities to support us with this."
        },
        {
            "text": "Recruitment agencies have panels dedicated to accessibility testing, which can be a great resource for finding participants. However, they can be quite costly."
        },
        {
            "text": "These are particularly useful when recruiting for people to help us test services we’re designing for internal users at Defra. Partnering with the neurodiversity network can help us find willing proxy users, for example."
        },
        {
            "text": "To help us find low- and no-digital participants, we’re planning to start putting posters in places like garden centres, libraries and other non-digital platforms. We’re hoping to start this in the next year."
        },
        {
            "heading": 2,
            "text": "2. Questions to ask to find the right people"
        },
        {
            "text": "For a lot of, we’re using ‘to try to get as many participants signed up for future research sessions as possible. Screeners allow us to get all the information we need from a participant, to avoid back and forth if they aren’t right for the research. We can capture farming experiences, packaging tonnages, import commodities or just about anything we will use to segment on. We then use these screeners to match the right participants to the right research projects."
        },
        {
            "text": "When we write these screeners, it’s important we are consistent with our terminology around access requirements and assistive technology used."
        },
        {
            "text": "First and foremost, accessibility information is health data, which is a protected characteristic and sensitive data to process. For health data we need to ask users if they want to answer questions that capture this information, and also ask them for separate consent to process the data . This can sometimes put participants off, so we make sure explain the purpose for capturing this information:"
        },
        {
            "text": "Following on from this, we tend to ask about accessibility requirements, and tools and software that they might use to help them online. This is important because we can support people through research sessions and tailor research questions to participants if they use specific software or assistive technology."
        },
        {
            "heading": 3,
            "text": "Accessibility Requirements"
        },
        {
            "heading": 3,
            "text": "Tools or software used to help online"
        },
        {
            "heading": 2,
            "text": "3. Researching the audience and representation"
        },
        {
            "text": "Before you embark on the journey to find accessibility users, it's essential to conduct some research about the audience trying to reach. Do they work in an industry where you are likely to find participants that use screen readers, or are you better going through an accessibility audit? Are you working with participants that might not self-identify as having dyslexia, and how do you deal with that situation?"
        },
        {
            "text": "I recently worked with a team where 13 organisations in the country were involved with a particular service. They wanted to conduct accessibility testing, but faced a challenge: finding enough participants within their target demographic. Despite sourcing and compensating participants, along with providing contextual information about the research, they realised that accessibility testing might not yield as much insight as an accessibility audit. So they opted to go through the internal accessibility team at Defra to review their service initially, before taking out an audit through an external supplier."
        },
        {
            "heading": 2,
            "text": "Accessibility testing and audits: choose the right approach for you"
        },
        {
            "text": "Accessibility testing is something we must do to build inclusive services, but we can fall into a trap of thinking it is the only way to build an inclusive service."
        },
        {
            "text": "Whether you conduct accessibility testing with proxy users or conduct an accessibility audit, or both, it’s crucial to think carefully about the limitations and benefits of your approach."
        },
        {
            "text": "As the saying goes, ‘when you meet one person with Autism, you’ve met one person with Autism’. The same can be said for any disability. If you test with one participant, you are only designing for one requirement."
        },
        {
            "text": "Ultimately we must strive to find and use the approach that will give us the best insights to design for our diverse users."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}