{
    "url": "https://dwpdigital.blog.gov.uk/2024/05/16/learning-at-work-week-2024/",
    "title": "Learning at Work Week 2024",
    "authors": [
        "Scott Brown, Digital Practice Support and Capability Manager apprentice"
    ],
    "categories": [
        "Apprenticeships",
        "Digital With Purpose",
        "Learning at Work"
    ],
    "pub_date": "2024-05-16T14:24:59+01:00",
    "content": [
        {
            "text": "This week (13th – 19th May) marks Learning at Work Week. Learning at Work Week promotes the benefits of continuous learning and development in the workplace – something that fits really well with DWP Digital’s culture. This year’s theme is ‘Learning Power’, and it explores how lifelong and continual learning gives us the power to change, grow and achieve our goals. "
        },
        {
            "text": "I’ve been involved in organising DWP Digital’s weeklong programme of activity as part of over 150 sessions led by colleagues across DWP. All our events have a focus on connection, engagement and growth, from technical skill building to sessions on accessibility and diversity. "
        },
        {
            "text": "Sessions throughout the week include: "
        },
        {
            "text": "I’m a keen videographer in my spare time, so one of my favourite sessions is a video production session led by a colleague in the creative team. "
        },
        {
            "heading": 2,
            "text": "Growing our own "
        },
        {
            "text": "DWP Digital is committed to the learning and development of its people, providing tools and training to empower them in making a real-world impact to the customer every single day. "
        },
        {
            "text": "Last year, DWP Digital launched a dedicated Digital Academy. It brings together career development and learning opportunities and helps colleagues and new starters identify gaps in their knowledge and develop skills to progress their career.  "
        },
        {
            "text": "Early talent and career changer programmes are part of the Digital Academy, giving people hands-on experience of delivering digital products and services, as part of a diverse team.  "
        },
        {
            "text": "It includes: "
        },
        {
            "text": "Whether you join through those or another career pathway, you’ll get a combination of hands-on experience and regular learning with plenty of support and encouragement from your line manager and team.  "
        },
        {
            "heading": 2,
            "text": "My learning experience "
        },
        {
            "text": "I’ve had first-hand experience of this in my apprenticeship here. I’m working towards a level 4 Project management qualification. Helping organise and host our Learning at Work Week events has given me better insight into leading projects.  "
        },
        {
            "text": "I’ve developed skills like stakeholder management, and used tools like Gant charts, RACI charts and Power and Interest grids.  "
        },
        {
            "text": "Using these skills in my work has greatly improved my confidence in leading a project, and I’m looking forward to seeing what other opportunities my apprenticeship will bring. "
        },
        {
            "text": "Working on the project has been fun, and it’s given me evidence to use towards completing my apprenticeship. "
        },
        {
            "heading": 2,
            "text": "Making a real impact "
        },
        {
            "text": "From being in the organisation for 5 months, I’d say to anyone looking for a move into a digital role or looking to start a career journey within DWP Digital, I would really recommend it.  You get a lot of help and support from your colleagues, there’s a vast range of projects and teams to work with, and everyone is so friendly.  "
        },
        {
            "text": "Ultimately, the organisation is there to make things work better for people who need help, so the work you do here is extremely fulfilling. You’re encouraged to grow and develop, and there are lots of opportunities to develop your career here, while knowing you’re making a real difference to customers’ lives. "
        }
    ]
}