{
    "url": "https://mojdigital.blog.gov.uk/2024/05/16/my-path-to-product-management/",
    "title": "My Path to Product Management",
    "authors": [
        "Sannah Maqsood"
    ],
    "categories": [
        "a great place to work",
        "Learning and development",
        "Learning at Work Week",
        "Our People",
        "Product management"
    ],
    "pub_date": "2024-05-16T11:52:13+01:00",
    "content": [
        {
            "text": "Nearly five years ago, I joined LAA Digital as a Junior Business Analyst.With much to learn, I found myself surrounded by a supportive team eager to lend their expertise. Their willingness to guide and offer help enabled me to connect the dots and navigate my new role effectively."
        },
        {
            "text": "After about a year, I had a strong interest in transitioning over to Product Management. I knew I had some of the skills and experience needed, but definitely not all. I approached the Senior Product Manager in my team for guidance. Encouraged by his support, I set my sights on pursuing this career path."
        },
        {
            "text": "My Product Management Journey"
        },
        {
            "text": "When an opportunity came up for an Associate Product Manager role within my team, I felt confident and applied. However, the interview proved to be a challenging experience. Despite my best efforts, I stumbled through some questions, accidentally exited the Google Meet, and found myself lost in rambling responses. Unsurprisingly, I was not selected for the role. "
        },
        {
            "text": "While initially disheartened by the setback, I now realise it was a blessing in disguise. The interview shed light on areas where I needed to improve. I was encouraged to seek out shadowing opportunities and mentorship to increase my understanding and skills. This approach allowed me to focus my learning efforts and work towards my goal of transitioning into Product Management.  "
        },
        {
            "text": "Eventually, an Expression of Interest opportunity came up for an Associate Product Manager and I was successful. Fast forward to now and I have been a Product Manager for three years and I’m still learning as I go! "
        },
        {
            "text": "Learning and Development Culture"
        },
        {
            "text": "I’ve found Justice Digital, such a great place to work. I have learnt so much from my peers and am constantly encouraged and empowered to develop my career in the direction that works for me."
        },
        {
            "text": "All civil servants in Justice Digital are supported with 10% time each week to focus on L&D. Knowing I have that time has really enabled me to invest in my development."
        },
        {
            "text": "I encourage you during ‘Learning at Work Week’ to explore what is out there. Whether through formal training, mentorship, or self-study… it’s never too late to invest in your career growth. "
        }
    ]
}