{
    "url": "https://educationhub.blog.gov.uk/2024/05/16/new-rshe-guidance-what-it-means-for-sex-education-lessons-in-schools/",
    "title": "New RSHE guidance: What it means for sex education lessons in schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools",
        "Relationships and Sex Education",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2024-05-16T09:02:52+01:00",
    "content": [
        {
            "text": "Relationships, Sex and Health Education (RSHE) is a subject taught at both primary and secondary school.  "
        },
        {
            "text": "In 2020, Relationships and Sex Education was made compulsory for all secondary school pupils in England and Health Education compulsory for all pupils in state-funded schools. "
        },
        {
            "text": "Last year, the Prime Minister and Education Secretary brought forward the first review of the curriculum following reports of pupils being taught inappropriate content in RSHE in some schools. "
        },
        {
            "text": "The review was informed by the advice of an independent panel of experts. The results of the review and updated guidance for consultation has now been published.  "
        },
        {
            "text": "We are now asking for views from parents, schools and others before the guidance is finalised. You can find the consultation here.  "
        },
        {
            "heading": 3,
            "text": "What is new in the updated curriculum? "
        },
        {
            "text": "Following the panel’s advice, we’re introducing age limits, to ensure children aren’t being taught about sensitive and complex subjects before they are ready to fully understand them.   "
        },
        {
            "text": "We are also making clear that the concept of gender identity – the sense a person may have of their own gender, whether male, female or a number of other categories  – is highly contested and should not be taught. This is in line with the cautious approach taken in our guidance on gender questioning children. "
        },
        {
            "text": "Along with other factors, teaching this theory in the classroom could prompt some children to start to question their gender when they may not have done so otherwise, and is a complex theory for children to understand.  "
        },
        {
            "text": "The facts about biological sex and gender reassignment will still be taught. "
        },
        {
            "text": "The guidance for schools also contains a new section on transparency with parents, making it absolutely clear that parents have a legal right to know what their children are being taught in RSHE and can request to see teaching materials.  "
        },
        {
            "text": "In addition, we’re seeking views on adding several new subjects to the curriculum, and more detail on others. These include:  "
        },
        {
            "heading": 3,
            "text": "What are the age limits?  "
        },
        {
            "text": "In primary school, we’ve set out that subjects such as the risks about online gaming, social media and scams should not be taught before year 3.  "
        },
        {
            "text": "Puberty shouldn’t be taught before year 4, whilst sex education shouldn’t be taught before year 5, in line with what pupils learn about conception and birth as part of the national curriculum for science. "
        },
        {
            "text": "In secondary school, issues regarding sexual harassment shouldn’t be taught before year 7, direct references to suicide before year 8 and any explicit discussion of sexual activity before year 9. "
        },
        {
            "heading": 3,
            "text": "Do schools have to follow the guidance? "
        },
        {
            "text": "Following the consultation, the guidance will be statutory, which means schools must follow it unless there are exceptional circumstances.  "
        },
        {
            "text": "There is some flexibility within the age ratings, as schools will sometimes need to respond to questions from pupils about age-restricted content, if they come up earlier within their school community.  "
        },
        {
            "text": "In these circumstances, schools are instructed to make sure that teaching is limited to the essential facts without going into unnecessary details, and parents should be informed. "
        },
        {
            "heading": 3,
            "text": "When will schools start teaching this? "
        },
        {
            "text": "Schools will be able to use the guidance as soon as we publish the final version later this year.  "
        },
        {
            "text": "However, schools will need time to make changes to their curriculum, so we will allow an implementation period before the guidance comes into force.   "
        },
        {
            "heading": 3,
            "text": "What can parents do with these resources once they have been shared?"
        },
        {
            "text": "This guidance has openness with parents at its heart. Parents are not able to veto curriculum content, but they should be able to see what their children are being taught, which gives them the opportunity to raise issues or concerns through the school’s own processes, if they want to."
        },
        {
            "text": "Parents can also share copyrighted materials they have received from their school more widely under certain circumstances."
        },
        {
            "text": "If they are not able to understand materials without assistance, parents can share the materials with translators to help them understand the content, on the basis that the material is not shared further."
        },
        {
            "text": "Copyrighted material can also be shared under the law for so-called ‘fair dealing’ - for the purposes of quotation, criticism or review, which could include sharing for the purpose of making a complaint about the material."
        },
        {
            "text": "This could consist of sharing with friends, families, faith leaders, lawyers, school organisations, governing bodies and trustees, local authorities, Ofsted and the media.  In each case, the sharing of the material must be proportionate and accompanied by an acknowledgment of the author and its ownership."
        },
        {
            "text": "Under the same principle, parents can also share relevant extracts of materials with the general public, but except in cases where the material is very small, it is unlikely that it would be lawful to share the entirety of the material."
        },
        {
            "text": "These principles would apply to any material which is being made available for teaching in schools, even if that material was provided subject to confidentiality restrictions."
        },
        {
            "heading": 3,
            "text": "Do all children have to learn RSHE? "
        },
        {
            "text": "Parents still have the right to withdraw their child from sex education, but not from the essential content covered in relationships education. "
        }
    ]
}