{
    "url": "https://defraenvironment.blog.gov.uk/2024/05/16/securing-off-site-biodiversity-net-gain-insights-from-local-planning-authorities/",
    "title": "Securing off-site biodiversity net gain: insights from local planning authorities",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Biodiversity net gain",
        "Green finance",
        "Land use"
    ],
    "pub_date": "2024-05-16T09:47:12+01:00",
    "content": [
        {
            "text": "The biodiversity net gain market is developing rapidly since its launch. This represents a huge opportunity for local planning authorities (LPAs)."
        },
        {
            "text": "Through biodiversity net gain, LPAs can secure local areas in which nature can thrive. In turn, this provides green space for their communities, with all the mental and physical benefits that brings. Plus, these new habitats can also help to improve things like flood resilience and air quality."
        },
        {
            "text": "In this post, we share insights from 3 LPA professionals on how they are securing off-site biodiversity net gain habitats."
        },
        {
            "text": "We spoke to:"
        },
        {
            "text": "What follows are the views of these guests, and what has worked for their particular LPA. It is not intended as official advice, but we hope it might inspire other LPAs to consider what might work well for them."
        },
        {
            "text": "Edward Church, South Oxfordshire & Vale of White Horse District Councils"
        },
        {
            "text": "The off-site market is essential for the success of biodiversity net gain. Even when applying the Biodiversity Gain Hierarchy properly, many developments will rely on off-site measures to meet their obligations."
        },
        {
            "text": "LPAs should take an active role in facilitating a resilient and diverse off-site biodiversity net gain market."
        },
        {
            "text": "Being passive risks hindering local nature recovery and could make the planning system less cost-effective for developers. If the solutions don’t exist locally, then developers will rely on options further afield and at a greater cost."
        },
        {
            "text": "Our councils are actively promote the establishment of ‘habitat banks’ for biodiversity net gain. These are areas of land where the creation or enhancement of habitat is secured by legal agreement. The uplift in biodiversity units can be sold and allocated to developers once the habitat bank is recorded on the Biodiversity Gain Site Register."
        },
        {
            "text": "In the Vale of White Horse, a 45 hectare site at Duxford has become the first habitat bank in Oxfordshire secured through a section 106 legal agreement, with more to come in the pipeline."
        },
        {
            "text": "Without willing landowners coming forward, there is no off-site market for BNG. We aim to provide accurate information on habitat banks and disseminate it widely, including through local biodiversity net gain brokers and land agents. Additionally, our recent Local Plan ‘call for sites’ process included environmental uses (such as habitat banks), not just land for development."
        },
        {
            "text": "To simplify the process for all involved the councils have produced guidance documents outlining expectations, standardised legal agreement templates, and agreed internal processes for the assessment of habitat bank proposals. Given time, as these types of agreements become more commonplace, landowner trepidation should reduce."
        },
        {
            "text": "LPAs should look to foster relationships with local nature conservation organisations, farming clusters, and other related projects. They provide a wealth of information, expertise, and opportunities. The councils continue to build on existing partnerships, supporting innovation, and developing new relationships where appropriate."
        },
        {
            "text": "Biodiversity net gain is a (relatively) new concept and many landowners may be unaware of the opportunities that it brings for them. An important part of habitat bank promotion is being clear about requirements, costs, and benefits of establishing habitat banks."
        },
        {
            "text": "Tim Slaney, South Downs National Park Authority"
        },
        {
            "text": "We want to tackle biodiversity loss head-on and our ambitious goals are dovetailing with a land-based sector that’s keen to diversify and find supplementary income streams."
        },
        {
            "text": "Delivering off-site biodiversity net gain is one of our key focuses among a much bigger package of green financing options for the private sector."
        },
        {
            "text": "There’s a tremendous amount of work, collaboration and forward-thinking happening around biodiversity net gain. Here is just a snapshot of it."
        },
        {
            "text": "We’re working with major landowners and farmers, using our statutory powers to secure land for nature via section 106 legal agreements. The first, at Iford Estate near Lewes, was recently signed. This secured 31 hectares of land for biodiversity net gain."
        },
        {
            "text": "Aside from our LPA role, our consultancy team provides tailored advice on nature restoration design, management and maintenance. This will ensure high-quality nature recovery is achieved across the region."
        },
        {
            "text": "Acknowledging that LPAs across England are all at very different points in their journey to becoming ready for biodiversity net gain, we’re working in partnership with Rural Solutions Ltd to accelerate LPAs to become ready."
        },
        {
            "text": "We’re looking to work with local government partners to co-ordinate approaches to biodiversity net gain and synergise strategies to maximise the potential. It’s our hope that in time we can build an understanding and agreement with all the 15 councils that share the South Downs National Park boundary to demonstrate how a joined-up approach to nature recovery can also support thriving prosperous communities."
        },
        {
            "text": "To help developers, landowners and planning agents, we’ve produced a technical advice note to provide guidance on how biodiversity net gain can be achieved in the South Downs National Park."
        },
        {
            "text": "We have also organised a summit to bring together key policy makers, practitioners, landowners and those seeking to invest in green finance or offsetting."
        },
        {
            "text": "David Sutherland, Buckinghamshire Council"
        },
        {
            "text": "There are only two routes for putting an off-site biodiversity net gain site onto the national register, either a section 106 or a conservation covenant. Recognising this, Buckinghamshire Council quickly came to the view that we needed to be proactive in helping enable and facilitate the timely development of our local market."
        },
        {
            "text": "This was done with a view to ensure that off-site biodiversity sites are:"
        },
        {
            "text": "We have put in place a clear framework, including:"
        },
        {
            "text": "So far, we have successfully entered into two standalone habitat bank section 106 agreements with different offsite providers. These sites have two very different delivery models and we have had to tailor the legal agreements to reflect the different approaches."
        },
        {
            "text": "The first is on a site that is owned and managed by our local wildlife trust: the Berks, Bucks & Oxon Wildlife Trust. They will be solely responsible for operating and maintaining the site in accordance with the agreed Habitat Management and Monitoring Plan. They will be selling biodiversity net gain units direct to developers, with Buckinghamshire Council acting as regulator."
        },
        {
            "text": "The second site is a more complex delivery model. It is a collaboration with a local farmer at Lopmede, plus two local environmental organisations. The first have drafted the Habitat Management and Monitoring Plan and will act as broker of the biodiversity net gain units. The second will undertake habitat creation works and required monitoring on site. We will act as regulator."
        },
        {
            "text": "There is one key lesson from a governance perspective. Local authorities will need to separate the regulatory role (both stat and non-statutory) with respect to biodiversity net gain, and any commercial decision to offer biodiversity net gain units on their own land."
        },
        {
            "text": "We are hugely grateful to Edward, Tim and David for sharing their approaches."
        },
        {
            "text": "If you have any tips for LPAs (or anyone else involved in biodiversity net gain) that you would like us to share on this blog, please leave us a comment below or email the team."
        },
        {
            "text": "For more information and resources on securing off-sites and local biodiversity units, please see our guidance page and the Planning Advisory Service."
        }
    ]
}