{
    "url": "https://environmentagency.blog.gov.uk/2024/05/16/task-force-fukushima-building-trust-to-protect-people-and-the-environment/",
    "title": "Task force Fukushima – building trust to protect people and the environment.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2024-05-16T10:18:50+00:00",
    "content": [
        {
            "heading": 4,
            "text": "By Jo Nettleton, Chief Regulator for the Environment Agency."
        },
        {
            "text": "‘Recently I was delighted to be appointed in the newly created role of Chief Regulator at the Environment Agency. My role is to make sure that the EA is a future-focussed, effective regulator, supporting innovation but protecting and improving our environment. I’ve also just returned from a trip to Japan, which has brought home to me how important trust around regulation really is."
        },
        {
            "text": "Since 2021 I have been part of the International Atomic Energy Agency (IAEA) task force overseeing remediation at the Fukushima Daichii Nuclear Power Plant.  The devastating impacts of both the Fukushima tsunami and the ensuing catastrophic nuclear explosions at the plant led to the release of large amounts of radioactive material from the reactors."
        },
        {
            "text": "More than 160,000 people from a 20km radius of surrounding land were evacuated. Significant progress has been made on recovery from the disaster, including work to make safe the reactors and surrounding plant, plans for dismantling and decommissioning, remediation of large parts of the surrounding areas and  the beginnings of communities returning to live in some of the previously evacuated areas. However, the site is still a complex and hazardous challenge that will take decades to fully recover."
        },
        {
            "text": "One of the impacts of the disaster has been the generation of vast quantities of radioactively contaminated water from various sources resulting in around 1.3 million cubic metres of it stored across the site."
        },
        {
            "text": "A major water treatment facility (ALPS) has been constructed on site, to remove most of the radioactivity – so that the only radionuclide left above regulatory standard release levels is a radioactive form of hydrogen – called tritium. In 2021, the Japanese government decided that the best method of disposing of the ALPS treated water would be to massively dilute it with seawater and dispose at a slow rate into the sea over a period of around thirty years."
        },
        {
            "text": "The local communities (in particular the fishing industry) and neighbouring countries voiced major concerns about this approach. The IAEA committed to undertake a rigorous, independent and science-based review of the plan and its implementation, conducted by a task force of international experts, including those concerned countries, and I was honoured to be chosen as the UK expert."
        },
        {
            "text": "Our work has been challenging for several reasons including the complexity of the problem, significant domestic and international scrutiny, the different views of individual task force members, and of course the fact that all our discussions are carried out through (very brilliant) interpreters. That said, we have confirmed that the proposals for disposal are in line with the international IAEA standards and the first batch of ALPS treated water was released last summer."
        },
        {
            "text": "This most recent visit was to review progress now that discharges have started and to discuss further improvements that could be made over the next few years. It was an intense week and, as always with a range of expertise and views, a lively affair!  I was really impressed by how we all recognised the importance of this task and was struck by how trust is vital to the success of the endeavour; trust amongst task force members, with Japanese colleagues and most importantly – ensuring that the approach we take builds and maintains the trust of  people affected  by the disaster, and the work now underway to protect and improve their environment now and in the future."
        },
        {
            "text": "As I begin my role as our first ever Chief Regulator, I think there are many lessons from the task force I will draw on as I work with regulators across the Environment Agency to continuously improve our regulatory work. Crucially we need to ensure that we have the trust of those we regulate and the communities we serve, supporting business to innovate and provide the goods and services we need, whilst protecting our environment now and for future generations."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}