{
    "url": "https://space.blog.gov.uk/2024/06/24/esteemed-uk-space-sector-colleagues-recognised-in-kings-birthday-honours-2024/",
    "title": "Esteemed UK space sector colleagues recognised in King’s Birthday Honours 2024",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Astronomy",
        "Business",
        "Championing Space",
        "Delivering Missions and Capabilities",
        "Space science"
    ],
    "pub_date": "2024-06-24T09:28:41+01:00",
    "content": [
        {
            "text": "We were delighted to see four pioneers recognised for their contributions to the UK’s thriving £17.5 billion space sector, through this year’s King’s Birthday Honours. From global satellite navigation systems, to astronomy, defence and space communications, each has made an outstanding difference to their field throughout their careers, and each represents the scope and diversity of the UK space sector, which employs 125,000 people. "
        },
        {
            "text": "A huge congratulations from all of us at the UK Space Agency.  "
        },
        {
            "heading": 2,
            "text": "Washington Yotto Ochieng – CBE "
        },
        {
            "text": "Head, Department of Civil and Environmental Engineering and Chair Professor in Positioning and Navigation Systems, Imperial College London. For services to Global Positioning and Navigation Systems. "
        },
        {
            "text": "Professor Washington Yotto Ochieng, FREng, is the Head of the Department of Civil and Environmental Engineering, and Chair in Positioning and Navigation Systems. He is also the Senior Security Science Fellow at the Institute for Security Science and Technology (ISST) at Imperial College London. Formerly, he was the Head of the Centre for Transport Studies and Co-Director of the ISST at Imperial. He is the current Vice President of the Royal Institute of Navigation (RIN) and is regarded as one of the foremost authorities in Europe on applications of navigational science. \n \nHe has been involved with several international projects including European Geostationary Navigation Overlay Service (EGNOS), Galileo, global navigation satellite system (GNSS) and the Single European Sky ATM Research (SESAR) joint undertaking. Washington’s particular interest is in the resilience and security of space-based navigation systems. "
        },
        {
            "text": "Professor Ochieng has also provided invaluable advice to the UK government and is Scientific Advisor, Member of the Scientific Advisory Group at the Foreign Commonwealth and Development Office (since 2020). In July 2023, he became a member of the Science Advisory Council (SAC) at the Department for Transport. In 2021, Prof Ochieng was invited to be an expert witness at the Parliamentary Select Committee on Science and Technology’s inquiry on UK space strategy and UK satellite infrastructure. "
        },
        {
            "heading": 2,
            "text": "Ian Jones OBE"
        },
        {
            "text": "Founder, Goonhilly Earth Station Ltd. For services to Space Communications."
        },
        {
            "text": "Ian Jones has been instrumental in establishing and growing a highly innovative company in Cornwall (Goonhilly Earth Station Ltd), which provides a range of communication services via space and offers communication services with distant spacecraft (missions to Mars, Moon or Deep Space). Ian promotes the commercial and educational opportunities from space in the region which led to ambitious plans to put Cornwall at the heart of fast-growing UK space sector and create 1,000 new space tech jobs (the Space Action Plan). "
        },
        {
            "text": "Goonhilly has grown from three to 50 people under Ian’s direction and has become the world’s only Deep Space commercial communications facility, developing plans to become a centre of space-focused high-tech businesses, supporting 400 jobs. Customers for the company’s services include Space X, NASA, ESA and the Australian Space Agency.\n \nIan strongly promotes STEM (Science, Technology, Engineering, Maths) at the grass-roots level and at a strategic national and international level. He designed the award-winning space themed education outreach centre at Keighley College and was instrumental in establishing the network of ESERO (European Space Agency Education Resource Offices) in the UK. He has contributed to the UK’s National Space Strategy in relation to Space Education."
        },
        {
            "heading": 2,
            "text": "Simon Dunn MBE"
        },
        {
            "text": "System Design Authority, Military Satellite Communications, Airbus Defence and Space (UK). For services to Defence."
        },
        {
            "text": "Simon was nominated for his outstanding contribution to defence-related industry over 20 years, serving as an exemplar of UK MOD DE&S’s collaboration. "
        },
        {
            "text": "Simon has provided in-theatre support to the UK’s Armed Forces and this nomination recognises his willingness and commitment to go beyond contractual expectations in adverse environments to ensure access to mission-critical Military Satellite Communications global networks whenever, and wherever required.  "
        },
        {
            "text": "He is responsible for the support, maintenance and repair all Beyond-Line-Of-Sight (BLOS) satellite communications services for UK Armed Forces."
        },
        {
            "heading": 2,
            "text": "Hazel Collett BEM"
        },
        {
            "text": "Meetings Secretary, British Astronomical Association. For services to Astronomy."
        },
        {
            "text": "Hazel Collett is honoured for services to Astronomy in her role as meetings secretary with the British Astronomical Association (BAA), a voluntary role which she has performed for over 18 years. "
        },
        {
            "text": "The BAA, in line with its status as an educational and scientific charity, and its remit to promote astronomy and science widely, organises ‘Back to Basics’ events each year to encourage and instruct beginners and those with no previous experience of astronomy.  "
        },
        {
            "text": "This work has been managed over the years by Hazel, who has delivered a multitude of events both in London and around the UK, inspiring many budding astronomers. "
        }
    ]
}