{
    "url": "https://insidehmcts.blog.gov.uk/2021/08/06/collaborating-is-key-to-enhancing-probate-users-experience-of-using-myhmcts/",
    "title": "Collaborating is key to enhancing probate users’ experience of using MyHMCTS",
    "authors": [
        "Adam Lennon"
    ],
    "categories": [
        "Court and tribunal reform",
        "Customer experience and research",
        "Digital services",
        "Family"
    ],
    "pub_date": "2021-08-06T16:45:46+01:00",
    "content": [
        {
            "text": "When someone close to us dies, applying for probate can be a daunting prospect at a difficult time and we know that a bad experience can add to an already stressful and sensitive situation."
        },
        {
            "text": "Since October 2019 over 60,000 applications for grant of representation have been issued to probate practitioners using the digital service, MyHMCTS. Online applications allowed us to maintain our service during the pandemic."
        },
        {
            "text": "But we know that our service could be improved, and that some applicants have experienced difficulties and delays. I want to outline our plans for these improvements and explain how we’ve used valuable feedback to make things better for our users."
        },
        {
            "text": "Listening to feedback"
        },
        {
            "text": "We work closely with service users to understand what’s working well, what we could do better and be challenged on our performance. We’re part of the Probate Service User Group which gives us feedback from a range of charities and solicitors’ and accountants’ professional groups."
        },
        {
            "text": "These professionals draw on real life experience to give us valuable feedback, so if you’re a member of one of these organisations, please keep sharing your feedback."
        },
        {
            "text": "I asked Ian Bond, Head of Wills & Estates at Thursfields and member of the Professional Services User Group what working together meant for him and he told me:"
        },
        {
            "text": "Improving the service for users"
        },
        {
            "text": "In the year leading up to May 2021 we granted almost 300,000 applications from personal applicants and practitioners. Most applications proceed smoothly, but we know it’s frustrating if we have to stop a case and that it can lead to delays in applications being granted. It’s not something we do lightly, but we must follow the Non-Contentious Probate Rules when we process applications."
        },
        {
            "text": "Cases are stopped for a variety of reasons, but the most common reasons include unexplained damage to wills or missing inheritance tax forms. We understand that delays cause anxiety at a difficult time for applicants, so we’ve allocated more staff to progress stopped cases and reduce the time they take to be resolved."
        },
        {
            "text": "Speeding up applications"
        },
        {
            "text": "To reduce delays, we’ve updated MyHMCTS to make it clear that users should wait for 20 working days from submitting inheritance tax documents before applying for a grant. This gap ensures inheritance tax processes can be completed and we have all the information we need to grant applications without unnecessary delays."
        },
        {
            "text": "Applying for probate and managing inheritance tax obligations can be intrinsically linked, so we’re working closely with HMRC to improve how we share information."
        },
        {
            "text": "We’ve also released an improved application coversheet to provide practitioners with clear information on the documents that we need and also automated some processes to speed things up."
        },
        {
            "text": "We know that some MyHMCTS users have experienced delays with the multi-factor authentication process that provides additional security for accounts. This is often because corporate firewalls block emails from hm.courts.and.tribunals.registrations@notifications.service.gov.uk. If you are experiencing any delays, please contact MyHMCTSsupport@justice.gov.uk for help on adding our email address to your safe senders list."
        },
        {
            "text": "What we are doing next"
        },
        {
            "text": "In coming weeks we’re going to be making some more changes to MyHMCTS, including allowing Trust Corporations to apply for a grant online for the first time, following requests from users. Other changes we’ll be making include providing new prompts so that practitioners can clearly identify the title of the executor, including partners, members, shareholders and directors in a firm or successor firm."
        },
        {
            "text": "To reduce potential delays, we will be providing prompts that provide clearer options to account for executors that are not applying for probate. Practitioners can also amend any part of an application before submitting, making the service easier and more convenient to use"
        },
        {
            "text": "We have improved title and clearing wording on the legal statement and practitioners can now sign them (including digitally) on behalf of clients and applying executors. Legal statements will also automatically contain the names of the applying executors and practitioners."
        },
        {
            "text": "Finally, it will no longer be a requirement to send a death certificate of any pre-deceased executors."
        },
        {
            "text": "To receive further information you can sign up to our weekly operations summary to be kept up to date on the improvements to the service."
        }
    ]
}