{
    "url": "https://educationhub.blog.gov.uk/2021/08/06/i-didnt-get-the-grades-i-need-what-do-i-do-now/",
    "title": "I didn’t get the grades I need – what do I do now?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "A Level",
        "Apprenticeships",
        "Exams and qualifications",
        "Further education",
        "GCSE",
        "GCSE results",
        "T Levels",
        "Universities"
    ],
    "pub_date": "2021-08-06T14:29:36+01:00",
    "content": [
        {
            "text": "For some students, results day confirms the next stage of their education; whether that be a full-time job, a degree at university or a further education qualification like an apprenticeship."
        },
        {
            "text": "But others may have fallen short of what they hoped to get, and this can mean they have to change their plans."
        },
        {
            "text": "In the first instance, you should talk to your school or college to discuss your options. You should also discuss your options with your preferred university, who may be able to offer some flexibility. You can also seek advice from the Exam Results Helpline run by the National Careers Service."
        },
        {
            "text": "If your grades weren’t what you expected, and you didn’t get a place on your chosen university course, you can apply for other courses through Clearing, and there will also be the option of sitting exams this autumn."
        },
        {
            "text": "Here are some of the options for students who haven’t got the grades they wanted."
        },
        {
            "heading": 3,
            "text": "Autumn exams"
        },
        {
            "text": "Students can enter for autumn exams in all GCSE and A level subjects and maths and science AS level subjects. These exams will run over October, November and December. Students should speak to their school or college about entering these exams."
        },
        {
            "heading": 3,
            "text": "Higher Education"
        },
        {
            "text": "Even if you don't get the grades you needed, your preferred university may still offer you a place. In the first instance, you should talk to your preferred university to discuss your options, who may be able to offer some flexibility."
        },
        {
            "text": "Just as they do in any normal year, UCAS will help thousands of students to find places through Clearing if you need or choose to explore other options once you’ve received your grades. Last year 83,000 students secured places through Clearing and it is an excellent pathway for exploring your options."
        },
        {
            "text": "Clearing opened on 5 July and will operate as normal this year. Clearing is available to you if you are unsuccessful, are applying after 30 June deadline, or wish to change your firm choice."
        },
        {
            "heading": 3,
            "text": "Apprenticeships"
        },
        {
            "text": "Apprenticeships are an exciting option - you get hands-on training, the chance to put your skills into practice and are paid for what you do."
        },
        {
            "text": "Apprenticeships are available at multiple levels. From school leavers, people upskilling in their careers and complete career changes. There are hundreds to choose from and some include a qualification, like a degree."
        },
        {
            "text": "What you earn will depend on the industry, location and type of apprenticeship you choose e.g., a social work degree apprenticeship."
        },
        {
            "text": "If you're aged 16 to 18 or in the first year of your apprenticeship, you’re entitled to the apprentice rate."
        },
        {
            "text": "If you're 19 or over and have completed the first year of your apprenticeship, you’re entitled to the National Minimum Wage."
        },
        {
            "text": "This is the minimum you’ll earn - many employers pay a lot more and offer their apprentices a competitive salary."
        },
        {
            "text": "For support on deciding whether an apprenticeship is right for you, including real stories, please visit: Become an apprentice (apprenticeships.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Traineeships"
        },
        {
            "text": "Traineeships are a great option for young people aged between 16 and 24 (or 25 for individuals with an education and health care plan), who don’t have the skills or experience to take on a job or apprenticeship."
        },
        {
            "text": "Traineeships act as a skills development programme, where you complete an unpaid work placement alongside a training course."
        },
        {
            "text": "They can last from 6 weeks up to 1 year (although most last up to 6 months) and are designed to help prepare you for work or an apprenticeship."
        },
        {
            "text": "Traineeships have been proven to bridge the gap between education and employment for many young people."
        },
        {
            "text": "Further information on traineeships can be found here: Alternatives to apprenticeships."
        },
        {
            "heading": 3,
            "text": "T Levels"
        },
        {
            "text": "T Levels are the next level qualification. They’ve have been created for 16-18 year olds as an A level alternative. They are two year courses which offer classroom based learning alongside an industry placement and are the equivalent of 3 A levels."
        },
        {
            "text": "T Levels have been created in collaboration with leading employers and businesses so that their content meets industry needs and prepares the student for work, further training or study."
        },
        {
            "text": "Everything you need to know about T Levels can be found here: T Levels for students | T Levels."
        },
        {
            "heading": 3,
            "text": "Full time employment"
        },
        {
            "text": "For those ready to take the next step and wanting to go straight into work or find a job, there is a wealth of information and guidance available for you on the Youth Employment website: Help Getting a Job - Tips and Advice for Young People - Youth Employment UK."
        },
        {
            "text": "Information includes how to find a job, interview tips, CV advice and much more."
        }
    ]
}