{
    "url": "https://ruralpayments.blog.gov.uk/2021/08/06/mp-roundtable-with-the-rpa-kevin-hollinrake-mp-thirsk-and-malton/",
    "title": "MP Roundtable with the RPA - Kevin Hollinrake MP (Thirsk and Malton)",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition",
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Rural Development Programme for England"
    ],
    "pub_date": "2021-08-06T16:58:20+01:00",
    "content": [
        {
            "text": "We held the first of our ‘MP Roundtable with the RPA’ events on 30 July with Kevin Hollinrake, MP for Thirsk and Malton. Held at the Galtres Centre in Easingwold, Paul Caldwell, our CEO, Rozanne Kidd, an RPA Director, members of the senior RPA team and colleagues from the Future Farming Countryside Programme (FFCP) met with a wide variety of farmers and land agents from the local area."
        },
        {
            "text": "An early barley harvest due to the exceptional weather in Yorkshire recently didn’t stop the roundtable event from being well attended, and it was great to meet and engage with so many people face to face again."
        },
        {
            "text": "The session started with a warm welcome and introduction from Kevin Hollinrake who has been the MP for the Thirsk and Malton area since May 2015."
        },
        {
            "text": "Paul Caldwell outlined the purpose of the sessions – to provide an update on the RPA, to give more details about the Agricultural Transition Plan, and an opportunity to ask questions."
        },
        {
            "text": "As well as outlining the RPA 5 year strategy, published in February, Paul was keen to stress the RPA’s ambition to build a different relationship with farmers."
        },
        {
            "text": "The RPA team showed the breadth of services the RPA provides to rural communities, highlighting the strong payment performance it achieved across 2020, and the specific impacts and outcomes on the Thirsk and Malton constituency."
        },
        {
            "text": "The RPA team also provided an update on the Sustainable Farming Initiative (SFI) Pilot with the application window opening at the start of July."
        },
        {
            "text": "It was then over to John Hustler and Giles Hall from Future Farming Countryside Programme (FFCP) to talk us through the work Defra are doing on the Agricultural Transition."
        },
        {
            "text": "The Q&A session sparked some good debate and some interesting questions from farmers – were the RPA prepared to deliver the new schemes; concern on impacts of the forthcoming BPS reductions; clarity on SFI pilot queries; the need for further detail on the future schemes; some suggestions to minimise the impact of future policy changes; a request to provide specific support to farmers affected by adverse weather conditions. There was recognition of the work RPA had done to get payments out in a timely fashion and its response to those affected by the flooding."
        },
        {
            "text": "Kevin Hollinrake MP said,"
        },
        {
            "text": "Paul Caldwell said,"
        },
        {
            "text": "Christine Thompson, a farmer from the local area, attended the session and was pleased with the face to face interaction. She said,"
        },
        {
            "text": "We are organising more roundtable events over the coming months with MP’s across the country, so keep an eye on our blog for more information. To receive further updates to your inbox, you can subscribe to the blog."
        }
    ]
}