{
    "url": "https://phescreening.blog.gov.uk/2021/08/06/short-film-helps-reassure-people-about-covid-safety-of-nhs-diabetic-eye-screening-clinics/",
    "title": "Short film helps reassure people about Covid safety of NHS diabetic eye screening clinics",
    "authors": [
        "Clare Connor"
    ],
    "categories": [
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2021-08-06T14:25:46+01:00",
    "content": [
        {
            "text": "Since the outbreak of the COVID-19 pandemic, many people have felt too anxious to attend routine health appointments, including NHS screening clinics. The South East London NHS diabetic eye screening (DES) service, hosted by Guy’s and St Thomas’ NHS Foundation Trust, made the above short film to help reassure people about what to expect at their appointment and tell them about measures in place to keep them safe."
        },
        {
            "text": "In this blog article, Clare Connor, service development manager for the South East London service, explains how the film was developed."
        },
        {
            "text": "Like most diabetic eye screening services, our routine screening clinics in South East London were paused during most of the first wave of COVID-19 last year. When we started to plan how to restore the service, we were very conscious that our patients, particularly as they were all in the vulnerable or extremely vulnerable category, might feel too anxious to attend their appointments."
        },
        {
            "text": "So, in parallel with planning to make our service ‘Covid secure’ by ordering stocks of PPE and counting and moving chairs in the waiting area to work out how many patients we could safely book in, we set about making a film to show patients what to expect when they come to their screening appointment."
        },
        {
            "text": "We were fortunate enough to receive funding from our trust and we worked with Eleanor Stanley of health communication consultants Stories for Health."
        },
        {
            "heading": 2,
            "text": "Peter’s story natural and authentic"
        },
        {
            "text": "Initially we had wanted to make a film that would both reassure patients and explain the risk stratification guidelines we were following which meant some low-risk patients might have up to 24 months between their routine screening appointments during restoration."
        },
        {
            "text": "That would have made the film too long and difficult to understand, so Eleanor quickly focused on our primary objective and how best to achieve it. This was by telling a first-hand account of a patient about why screening was important to them and how the measures we had put in place reassured them."
        },
        {
            "text": "We found a patient, Peter, who was happy to take part, and Eleanor talked to him on the phone before finalising a loose script ahead of filming day. This made sure the film became Peter’s story and was natural and authentic."
        },
        {
            "text": "We filmed on a Saturday and the cast and crew was kept to an absolute minimum to comply with Covid-19 rules in place at the time and our own risk assessment. I brought in some props to turn the staff kitchen into a scene from Peter’s ‘home’ while he made a cup of tea and introduced himself."
        },
        {
            "text": "Screening team leader Steven O’Grady Walsh was our ‘on-screen screener’ and I sat in as the receptionist. Peter was a natural and filming went really well."
        },
        {
            "text": "This was an amazing opportunity to make a film and reach out to people using a new format. We therefore decided to film some scenes that we could use for a second version of the film suitable for use in post-Covid times. We still have some time to go before we can use this version but it’s definitely something we can look forward to doing."
        },
        {
            "text": "Editing took a few weeks and our communication team uploaded the video to YouTube.  We then sent out the video link with a short introduction along with all our screening invitations. Initially we used a 2-way text messaging service for this and asked people to tell us if they found it useful or not. An overwhelming majority said they did and we are still sending out this message now."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE Screening helpdesk."
        }
    ]
}