{
    "url": "https://ofqual.blog.gov.uk/2021/08/06/the-regulations-for-vtqs-and-other-generals-in-2021-22-what-they-mean-for-you/",
    "title": "The regulations for VTQs and other generals in 2021 to 22: what they mean for you",
    "authors": [
        "Claire Gill"
    ],
    "categories": [
        "Exams",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2021-08-06T14:00:33+01:00",
    "content": [
        {
            "text": "Exams and assessments are the fairest way for students to evidence what they know and can do. Whilst it wasn’t possible for all exams and assessments to go ahead during 2020-21, due to the pandemic, it is the government’s intention that they should go ahead this year. As the qualifications’ regulator we expect all results this year to be awarded based on evidence from those exams and assessments. Having considered how we might best do this, we and the Department for Education (DfE) carried out a public consultation to consider what the impact of our proposals might be. That’s now completed and policy and regulatory arrangements are now in place.  We can now set out what these arrangements mean for colleges, training providers, schools and other centres."
        },
        {
            "heading": 3,
            "text": "This year is different to the last one"
        },
        {
            "text": "We know that those who will be taking exams and assessments in the year ahead have experienced significant disruption– whether they are part way through a qualification, or starting a new qualification, having had their learning or work over the last year interrupted by the pandemic. Your concern about the impact of this disruption was evident in the responses to this consultation. And should there be further disruption, if the public health situation gets worse, then these students may also need further support over the next year."
        },
        {
            "text": "Ofqual’s job is to make sure that the arrangements for exams and assessment are such that they are valid and reliable. They need to be fit for purpose. Right now, that means they need to accommodate and mitigate the ongoing impact of the pandemic. That’s why we are continuing to allow awarding organisations to adapt their exams and assessments for vocational and technical qualifications (VTQs)."
        },
        {
            "heading": 3,
            "text": "Qualifications can be adapted"
        },
        {
            "text": "The pandemic has had implications for learning, teaching and assessment. We are requiring awarding organisations to consider if they need to make adaptations to assessment, so that time can be freed up for teaching and learning. Adaptations may also free up time for other aspects of education recovery or for building up resilience in case there is further disruption to students’ employment or education."
        },
        {
            "text": "We may see streamlined assessment (for example, reducing duplication of testing of a particular skill), remote invigilation or remote assessment, or a reduction in the number of internal assessments."
        },
        {
            "text": "Whilst assessments may be streamlined, that does not mean that it is appropriate to reduce qualification content. DfE’s expectation is that all the content for VTQs included in performance tables and used alongside or instead of GCSEs, AS and A levels, should be taught to support student progression to further study or employment. Likewise, we expect that all the content for professional, occupational, proficiency or licence to practise qualifications will be taught. We expect awarding organisations to seek the support of sector and professional bodies for any adaptations to the assessment of these qualifications. This is important to assure employers that students of these qualifications have the knowledge and skills they expect."
        },
        {
            "text": "Adaptations have been in place for many qualifications this year and have enabled hundreds of thousands of assessments to be taken. Many of those adaptations will continue this year too, bringing some stability for teacher and learners."
        },
        {
            "text": "Some respondents to the consultation were concerned that some of the adaptations put in place this year were insufficient and, in some cases, inconsistent. We know from the colleges, training providers and schools we have spoken to over the last 6 months, that you find assessments more manageable to implement when you get clear information in a timely manner. We are expecting awarding organisations to address this: to collaborate so that inconsistencies are minimised; to communicate with you, clearly and accurately, and in co-ordination with one another where possible. Of course, that does not mean that all qualifications will have the same adaptations. The adaptations must suit the existing assessment design and how the qualifications are delivered."
        },
        {
            "heading": 3,
            "text": "Why no TAGs in 2021 to 22?"
        },
        {
            "text": "Teacher Assessed Grades (TAGs) were implemented only where assessments and exams could not take place. And as the intention is that exams and assessments will take place, they are not required. However, should it not be possible for exams and assessments to go ahead in the future due to a worsening of the pandemic, then our regulatory arrangements are on stand-by. So, we can respond swiftly and allow awarding organisations to award results based on alternative evidence, including TAGs, if necessary. And if that were necessary, it will most likely be drawn from the assessments and evidence that learners normally undertake and produce throughout their programme. That means you can focus on working with students to undertake their adapted assessments and exams, rather than preparing additional assessment or extra evidence ‘just in case’."
        },
        {
            "text": "We know that many fear further disruption to teaching and learning. That’s understandable. We’ve seen different regions be impacted to varying extents, and for different periods of time. And it may be that some learners might yet have their learning more disrupted than others, perhaps due to the impacts on a particular trade or sector. We’re working through with awarding organisations how adaptations can accommodate these circumstances."
        },
        {
            "heading": 3,
            "text": "What does this mean for continuing learners?"
        },
        {
            "text": "Not all learners are starting new qualifications right now. For those who have completed some parts of a qualification in 2020 to 21, and will complete their qualification in next year or later, what they have done so far will count. They can carry forward any results whatever the means that the result was determined – a teacher assessed grade, centre assessment grade, or live assessment. Only if they wish to attempt to improve their grade do they need to sit or re-sit the assessment, which they are allowed to do."
        },
        {
            "text": "And the same principle will apply for those who are starting a two-year programme of study now. They will do adapted assessments in 2021 to 22 and these will carry forward into their second year."
        },
        {
            "heading": 3,
            "text": "What happens now?"
        },
        {
            "text": "The arrangements that have now been confirmed for the 2021 to 22 academic year, come into effect on 1 September. Colleges, training providers, schools and all other centres will hear from their awarding organisations very shortly about what the adaptations will be. This means that any assessments planned for the autumn, for these VTQs can take place, and will be covered by these regulatory arrangements."
        },
        {
            "text": "This has been another difficult year for everyone in the education system, from learners and teachers to employers and universities. We know the hard work isn’t over just yet. We are going to keep listening to you and doing what we can to smooth the path of 2021 to 22 so that learners can continue to be proud of their results and can take them into the next stage of their lives with confidence."
        },
        {
            "text": " "
        },
        {
            "text": "Claire Gill\nDirector - Strategic Relationships VTQ, Ofqual"
        }
    ]
}