{
    "url": "https://educationinspection.blog.gov.uk/2026/01/08/further-education-and-skills-inspections-frequently-asked-questions/",
    "title": "Further education and skills inspections: frequently asked questions",
    "authors": [
        "Lee Owston, National Director, Education"
    ],
    "categories": [
        "education inspection framework",
        "further education and skills"
    ],
    "pub_date": "2026-01-08T13:58:59+00:00",
    "content": [
        {
            "text": "Since we published the renewed inspection framework on 9 September 2025, we’ve put on lots of online and face-to-face engagement with further education and skills (FE) providers to answer your questions. We’re publishing the most frequently asked questions below, so you can see all the answers in one place."
        },
        {
            "text": "We’ll regularly update this as we continue to inspect with our renewed approach, so do bookmark it and check back in future."
        },
        {
            "text": "If you want to watch any of our webinars, you can find them on our YouTube playlist."
        },
        {
            "heading": 2,
            "text": "1. When will my FE and skills provision be inspected?"
        },
        {
            "text": "When your provision is due to be inspected is based on a number of factors, including its previous inspection outcome."
        },
        {
            "text": "We’ve published a video on inspection timings for FE and skills providers to explain when your provision will be inspected."
        },
        {
            "heading": 2,
            "text": "2. Who can take on the role of nominee and what do they do? "
        },
        {
            "text": "We continue to have a nominee and shadow nominee on FE and skills inspections. We’ve explained how the nominee role works for FE and skills in our inspection information for FE and skills providers."
        },
        {
            "text": "If your provision receives an enhanced inspection (this applies to general FE colleges, sixth-form colleges and designated institutions), there will no longer be a skills nominee."
        },
        {
            "text": "When you’ve decided who your nominee is, you can watch our nominee training video."
        },
        {
            "heading": 2,
            "text": "3. What happens on the planning call?"
        },
        {
            "text": "The planning call is important to help the lead inspector understand the structure, organisation and context of your provision, as well as its strengths, successes and priorities."
        },
        {
            "text": "It’s helpful if you have key leaders and the nominee present for the planning call. To ensure we build professional working relationships from the very start of an inspection, we always offer to do the planning call as a video call."
        },
        {
            "text": "Our FE and skills inspection operating guide for inspectors sets out what inspectors need to do when it comes to the planning call."
        },
        {
            "heading": 2,
            "text": "4. How much notice will we get before the inspection?"
        },
        {
            "text": "For a full inspection, you will normally get 5 to 6 working days’ notice. This enables leaders and inspectors to plan for the complexity of different inspections."
        },
        {
            "text": "For more information, see: ‘What happens when a provider is notified of an inspection’."
        },
        {
            "heading": 2,
            "text": "5. What data will we need?"
        },
        {
            "text": "The inspection information for FE and skills providers sets out what information the lead inspector may ask for during the notification call. Inspectors will also gather data from the Further Education and Skills Inspection Tool (FESIT)."
        },
        {
            "text": "For the ‘achievement’ evaluation area, inspectors will not review your internal data. However, they may talk to you about how you use internal assessment data, what it tells you about learners’ or apprentices’ achievement, and the decisions that your leaders make as a result."
        },
        {
            "text": "The FE and skills inspection operating guide for inspectors and FE and skills inspection toolkit explain how we use data on inspection."
        },
        {
            "heading": 2,
            "text": "6. What do you mean by ‘barriers to learning and/or wellbeing’ and how do you define 'disadvantaged'?"
        },
        {
            "text": "Inspectors want to understand your provision’s context, including the demographics of the learners or apprentices and their needs."
        },
        {
            "text": "Barriers can be caused by a learner’s individual circumstances, such as their health, development or emotional needs, or by external factors, including their family, community or wider social conditions. They can include protected characteristics. There may also be barriers that learners face that are specific to the provider’s context. These may require tailored approaches to reduce their impact on learning and/or wellbeing."
        },
        {
            "text": "Our inspections focus on the most vulnerable learners, such as those who are socio-economically disadvantaged (as defined in our glossary of education inspection terminology), those with special educational needs and/or disabilities (SEND) or high needs, those known (or previously known) to social care and those without level 2 English and/or mathematics. Inspectors focus on these learners through various inspection activities and also use case sampling to gather first-hand evidence of their experiences. We want to find out how your provision is helping learners overcome barriers they may face to their learning and/or wellbeing."
        },
        {
            "text": "When we talk about barriers to learning and/or wellbeing, this means any factors that may make it difficult for a learner or apprentice to achieve as well as they should, and develop positive wellbeing."
        },
        {
            "text": "Providers have a responsibility, through statutory duties or government guidance, to address barriers for certain groups of learners. This includes learners who are disadvantaged, those with SEND or high needs, those known (or previously known) to children’s social care and those without level 2 English and/or mathematics."
        },
        {
            "text": "We outline the 4 categories for inclusion in our FE and skills inspection toolkit."
        },
        {
            "heading": 2,
            "text": "7. How will evening and weekend provision be assessed?"
        },
        {
            "text": "Inspectors normally leave your premises by 5.45pm, other than in exceptional circumstances and always as agreed with your nominee. If you have twilight or evening provision, we may stay later but will agree that with you."
        },
        {
            "heading": 2,
            "text": "8. How do you inspect apprenticeship providers?"
        },
        {
            "text": "We recently ran a webinar to explain how we inspect apprenticeship providers, which we’ve published on our YouTube channel."
        },
        {
            "heading": 2,
            "text": "9. What is the difference between the old ‘best fit’ model and new ‘secure fit’ model that inspectors use to grade FE and skills provision?"
        },
        {
            "text": "Our inspectors use a ‘secure fit’ model of evaluation to award grades. This means that each standard within each grade must be met before it can be awarded."
        },
        {
            "text": "We designed this model to keep grading as consistent as possible."
        },
        {
            "heading": 2,
            "text": "10. Is ‘expected standard’ a high standard?"
        },
        {
            "text": "The ‘expected standard’ is what we would typically expect to see on inspection. It covers the statutory, professional and non-statutory guidance that you are already expected to follow. It is a high bar, particularly as we use a secure fit model (as explained in question 8) to determine whether all of the standards have been met. Inspectors will report on the ‘expected standard’ positively, though there will be some areas identified that prevent the ‘strong standard’ from being met."
        },
        {
            "text": "It is important to remember that inspectors will start the process of evaluating your provision by automatically considering it to be at the ‘expected standard’ (see question 8). In order to get a ‘strong standard’, then all expected standards would need to be met first."
        },
        {
            "heading": 2,
            "text": "11. Is ‘exceptional’ the new ‘outstanding’?"
        },
        {
            "text": "There is no read-across from the previous grading system, so ‘exceptional’ is not the new ‘outstanding’. It is also important to say that the ‘expected standard’ or ‘strong standard’ do not equate to the old ‘good’ grade."
        },
        {
            "text": "For your provision to achieve ‘exceptional’ for an area, it needs to show a transformational impact on the outcomes and experiences of disadvantaged learners, those with high needs, those known (or previously known) to social care and those without level 2 English and/or mathematics, and there can be no significant areas of improvement identified that leaders have not already prioritised. Practice and/or outcomes (depending on the evaluation area) will also have been sustained over the last 3 years or more."
        },
        {
            "text": "Inspectors will consider awarding ‘exceptional’ when they see an area of practice that is of such high quality that it should be shared to support improvement internally, regionally and nationally."
        },
        {
            "heading": 2,
            "text": "12. Is ‘needs attention’ the new ‘requires improvement’?"
        },
        {
            "text": "As with question 10, the ‘needs attention’ grade is not equivalent to ‘requires improvement’."
        },
        {
            "text": "Inspectors will grade an evaluation area as ‘needs attention’ when the ‘expected standard’ of the particular evaluation area is not met because inconsistencies in practice have a negative impact on learners or apprentices in general, or on a particular group. The ‘needs attention’ grade is not a ‘fail’. As we explain in our video for parents, ‘needs attention’ is an indication that there is work to be done to reach the ‘expected standard’ and it highlights where issues can be addressed before they become bigger problems that need ‘urgent improvement’."
        },
        {
            "text": "Where an area is less than ‘expected standard', we will describe what needs to improve and will return to your provision through our monitoring programme, which means we can regrade if we identify improvement (see question 1).  "
        }
    ]
}