{
    "url": "https://technology.blog.gov.uk/2026/01/08/gds-parish-council-domains-helper-service-wins-digital-transformation-award/",
    "title": "GDS Parish Council Domains Helper Service wins Digital Transformation award",
    "authors": [
        "Khidr Suleman, GDS Service Owner, GDS"
    ],
    "categories": [
        "Domain",
        "Security",
        "Services"
    ],
    "pub_date": "2026-01-08T10:00:00+00:00",
    "content": [
        {
            "text": "The Government Cyber Unit Cyber Services team is pleased to share that the Parish Council Domains Helper Service won the Digital Transformation Project of the Year 2025 at the BCS UK IT Industry Awards.The team took on the responsibility for helping to improve the digital health of parish councils, which are the foundational tier of UK democracy. Historically, many councils have poor cyber security and low digital adoption."
        },
        {
            "text": "Before we launched our service in 2024, 80% of the 10,000 English parish councils were still using non-government domains instead of .gov.uk. Coupled with this, 66% of councils were also using free, personal email addresses for official council business. Our aim was to not only onboard councils to .gov.uk but to increase security practices and professionalism across the sector."
        },
        {
            "text": "Winning this industry award caps off an exciting 18 months of hard work, which has seen the service go from an idea on a spreadsheet to a live service. "
        },
        {
            "heading": 2,
            "text": "Getting to the heart of the problem during our discovery "
        },
        {
            "text": "The idea sprung to life in 2023, under the direction of Simon Foster, Head of the Cyber Services team. Grace Hernandez, Portfolio Lead put out a tender on the Digital Marketplace to recruit a team to work on the project."
        },
        {
            "text": "As with every discovery, we started small by focusing on 10 parish councils, carrying out online surveys, workshops and one-to-one interviews to uncover barriers to adopting .gov.uk domains. We discovered 4 main pain points that were preventing .gov.uk adoption across the sector. "
        },
        {
            "text": "Moving onto the Alpha phase, we were able to:"
        },
        {
            "heading": 2,
            "text": "How we onboarded 1,000 parish councils during the Beta phase"
        },
        {
            "text": "Over the course of 2024, Tim, Will and Steph worked on iterating the service based on feedback from workshops, surveys, presentations and incoming stats. During the 2024 calendar year, the team:"
        },
        {
            "text": "Sandra and Karen built valuable relationships with the Society of Local Council Clerks (SLCC) and the National Association of Local Councils (NALC). This culminated in achieving a major milestone where they strengthened wording in NALC’s Practitioners’ Guide 2025. This helped to increase .gov.uk adoption in the live phase by clarifying its importance to councils."
        },
        {
            "text": "One of the more challenging aspects of the service delivery was the requirement to process and receipt all of the invoices for the funding. Grace engaged with internal senior finance business partners to agree an approach and worked on processing and receipting over 1000 invoices. This required weekly cross-checks with the delivery team to ensure the domain registrations were live, before handing out the funding.  "
        },
        {
            "text": "As you can imagine there was a lot of back and forth, having to chase invoices and financial teams required a lot of effort to make sure that everything was paid on time"
        },
        {
            "text": "Adding to the complexity of the Beta phase, I was also running the .gov.uk Registry migration project and building a brand new Get Approval to use .gov.uk domain name service."
        },
        {
            "text": "The Parish Council Domains Helper Service was dependent on these 2 services being launched on time in July 2024, so parish council domains could benefit from the renegotiated £10 wholesale cost and get their domains registered and working. Both of those projects ran to time and budget - launching on the 26 June 2024."
        },
        {
            "heading": 2,
            "text": "Year one stats of the Parish Council Domains Helper Service"
        },
        {
            "text": "The judging panel was particularly impressed with the impact of the service. The headline figures included:"
        },
        {
            "heading": 2,
            "text": "Sustaining our momentum for the live service"
        },
        {
            "text": "Once our fixed-term contract with our supplier ended in March 2025, the team working on the Parish Council Domains Helper Service reduced from 8 full-time staff down to 1.5 full-time people. "
        },
        {
            "text": "There was uncertainty as to how well the service would perform when resourcing was cut by 80%. Added to this, we no longer had the carrot of giving out £100 funding, as budgets were diverted to other high priority projects. Even with these restrictions, we were set with an ambitious target of onboarding 750 parish councils during 2025."
        },
        {
            "text": "I handed over the day-to-day Service Owner reins to Emma Dwan who has done an excellent job of building on momentum from the launch year. This has resulted in us smashing through our targets thanks to the strong foundation of the service. Together we’ve:"
        },
        {
            "text": "At its current rate - the Parish Domains Helper Service can theoretically complete the on-boarding of all 10,000 parish councils within 5 years. That’s 15 years faster than if we would have done nothing. However, we do expect new challenges as some councils have zero budget, so we will have to get creative with ways to help as we creep closer to our target."
        },
        {
            "text": "As more parish councils join the .gov.uk ecosystem, our attention is increasingly turning to help them increase their overall cyber security. "
        },
        {
            "text": "If you’d like to learn more you can email us at parish.helper@domains.gov.uk."
        }
    ]
}