{
    "url": "https://nationalscreening.blog.gov.uk/2026/01/08/minutes-published-of-uk-nsc-november-2025-meeting/",
    "title": "Minutes published of UK NSC November 2025 meeting",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2026-01-08T09:22:23+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has published the minutes of its November 2025 meeting."
        },
        {
            "text": "During the meeting, the committee agreed to go out to public consultation on a draft prostate cancer screening recommendation:"
        },
        {
            "text": "Following public consultations, the UK NSC also updated its recommendations on newborn screening for metachromatic leukodystrophy (MLD) and on adult screening for dementia."
        },
        {
            "text": "Committee members recognised the devastating impact of MLD and thanked the many individuals and organisations who had responded to the consultation. Members found that more research and evaluation are needed to explore the case for screening further and therefore reiterated their recommendation not to screen for MLD."
        },
        {
            "text": "To address the challenges associated with evidence generation for rare diseases in newborn screening, the UK NSC is working with partners to develop plans for a multi-condition in-service evaluation (ISE), termed EquipoISE, within the UK newborn blood spot screening programme. MLD has been identified as a good candidate for inclusion in this type of evaluation, which could provide valuable information on the performance of MLD screening in UK newborns."
        },
        {
            "text": "The committee also restated its recommendation not to offer adult population screening for dementia because of the lack of an accurate and reliable test and limited treatments. Members again thanked all those who had responded to the consultation."
        },
        {
            "text": "Other topics discussed at the meeting included:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}