{
    "url": "https://defrafarming.blog.gov.uk/2026/01/08/ofc-2026-clarity-partnership-and-growth/",
    "title": "OFC 2026: clarity, partnership and growth",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2026-01-08T11:04:56+00:00",
    "content": [
        {
            "text": "Today at the Oxford Farming Conference, the Environment Secretary made a series of announcements to support farmers in England, with a focus on clarity, partnership and growth."
        },
        {
            "text": "This post summarises those announcements. It includes updates on the Sustainable Farming Incentive, the Farming Roadmap, Farming in Protected Landscapes, new investment in advice, and support for the uplands."
        },
        {
            "text": "Today’s announcements follow December’s update that the inheritance tax threshold for Agricultural and Business Property Relief will increase from £1 million to £2.5 million."
        },
        {
            "text": "This means couples will be able to pass on up to £5 million without paying inheritance tax on their assets. This is in addition to existing allowances, such as the nil-rate band."
        },
        {
            "text": "Around 85% of farming estates are expected to pay no inheritance tax on their farms and estates in 2026/27. The reforms will still ensure that the wealthiest estates do not receive unlimited relief."
        },
        {
            "heading": 2,
            "text": "Clarity"
        },
        {
            "heading": 3,
            "text": "The new Sustainable Farming Incentive offer for 2026"
        },
        {
            "text": "The Sustainable Farming Incentive (SFI) supports farmers to run productive, resilient businesses while caring for the environment."
        },
        {
            "text": "When the new offer opens later this year, it will be simpler. We are streamlining the actions available to reduce complexity. There will still be plenty of choice, with a stronger focus on actions that support sustainable food production."
        },
        {
            "text": "We are also considering an agreement value cap to help share funding more fairly while delivering benefits for nature and climate."
        },
        {
            "text": "We will publish full details before the first application window opens in June, giving farmers time to understand the offer."
        },
        {
            "text": "Read our post on the SFI offer in 2026."
        },
        {
            "heading": 3,
            "text": "Publishing the Farming Roadmap"
        },
        {
            "text": "The 25-year Farming Roadmap will set out the long-term direction for farming, including how the sector will adapt to changing markets, new technologies and environmental pressures, and how government will support that change."
        },
        {
            "text": "Last year, we worked with farmers through sector-specific and regional workshops to help shape the roadmap. "
        },
        {
            "text": "We will continue to engage with the sector as it develops and will publish the Farming Roadmap later this year."
        },
        {
            "heading": 2,
            "text": "Partnership"
        },
        {
            "heading": 3,
            "text": "Creating a Farming and Food Partnership Board"
        },
        {
            "text": "The new Farming and Food Partnership Board will bring together representatives from farming, food, retail, finance and government."
        },
        {
            "text": "The Environment Secretary highlighted the importance of giving farmers and food businesses a seat at the table as policy is developed."
        },
        {
            "text": "Chaired by the Secretary of State, the board will champion profitable and sustainable production and food security. It will help ensure growth aligns with health and environmental goals, and that market demand is matched by domestic and export supply. The Farming Minister, Angela Eagle, will be deputy chair."
        },
        {
            "text": "The board will work to improve how the whole food supply chain functions, identifying solutions that deliver real benefits. It will take a strategic ‘farm to fork’ approach by establishing shared, collectively owned goals. Sector plans will initially focus on horticulture, followed by poultry."
        },
        {
            "text": "Board membership will be developed in partnership with the sector, with further details to be shared in due course."
        },
        {
            "heading": 3,
            "text": "Investing £30 million in advice"
        },
        {
            "text": "Access to trusted advice and shared experience helps farmers make informed decisions for their businesses and land."
        },
        {
            "text": "To support this, £30 million will be invested over the next three years in a new approach to farm collaboration. This funding will support both existing and new farmer groups and networks, helping farmers share experience with each other and access expert advice."
        },
        {
            "text": "The funding will also support activities such as farm visits, talks from expert speakers, and stronger links with innovators and leaders at local and sector level."
        },
        {
            "text": "From 2026, different approaches will be trialled in different areas, giving farmers greater flexibility to develop their own plans and focus on delivery rather than unnecessary bureaucracy."
        },
        {
            "text": "This investment will support practical, farmer-led approaches and help ensure advice is available where it can make the greatest difference."
        },
        {
            "heading": 3,
            "text": "Extending the Farming in Protected Landscapes Programme (FiPL)"
        },
        {
            "text": "The Farming in Protected Landscapes Programme will be extended for a further 3 years, with £30 million in funding confirmed for next year."
        },
        {
            "text": "Partnership lies at the heart of the programme, bringing farmers, protected landscape organisations and local communities together to deliver change at a scale that no single holding could achieve alone."
        },
        {
            "text": "This extension will enable more farmers to deliver meaningful benefits for nature, the climate and local communities across England’s National Parks and National Landscapes."
        },
        {
            "text": "Over the past four years, this programme has supported over 11,000 farmers across 44 protected landscapes – funding more than 5,500 projects and creating around 100 farm cluster groups."
        },
        {
            "text": "We recently blogged about FiPL’s impact four years on and shared case studies showcasing this collaboration in action."
        },
        {
            "text": "The FiPL programme forms part of the government’s wider work to improve the natural environment, including the revised Environmental Improvement Plan (EIP) published on 1 December."
        },
        {
            "heading": 3,
            "text": "Transforming the uplands"
        },
        {
            "text": "England’s uplands are among the country’s most valued landscapes, shaped by generations of farming and community life. From Dartmoor to the Lake District, they supply around 70% of the UK’s drinking water. Upland farming plays a vital role in maintaining these landscapes and habitats."
        },
        {
            "text": "Upland farms also face distinct challenges. Short growing seasons, poor soils, steep terrain and remoteness increase costs, limit yields and make everyday operations more difficult. These pressures affect local communities too, where services are often distant, affordable housing is limited and opportunities for young people are fewer."
        },
        {
            "text": "To explore new ways of addressing these challenges, we have partnered with Dr Hilary Cottam OBE, a social entrepreneur known for innovative, relationship-based approaches to social change."
        },
        {
            "text": "Working with Dr Cottam, the next step will be to develop a place-based approach shaped by the needs of upland communities, with solutions co-designed around local challenges."
        },
        {
            "text": "This will include building a shared understanding of how land can support food production alongside wider public benefits, underpinned by strong local governance that reflects the realities facing upland farms and communities."
        },
        {
            "text": "The work will also explore how public, private and third-sector funding can be better aligned to create new income opportunities and build the skills and networks communities need to shape their own future. At its core, the aim is to support change that is led locally, by communities themselves."
        },
        {
            "text": "This marks the beginning of a long-term partnership. We will start by working with communities in Dartmoor, followed by Cumbria."
        },
        {
            "heading": 2,
            "text": "Growth"
        },
        {
            "text": "Profitable farming and a thriving environment both depend on sustainable growth. That growth will be supported by securing trade deals that open new markets, reforming the planning system and investing in technology."
        },
        {
            "text": "As mentioned, at the end of 2025, more farms and businesses were made exempt from inheritance tax, halving the number of farms affected while maintaining the core principle that the wealthiest estates should not receive unlimited relief."
        },
        {
            "text": "Last month, a consultation launched on proposed planning changes. With input from farmers and land managers, the aim is to make it easier to diversify  and develop farm infrastructure, including reservoirs, greenhouses, polytunnels and farm shops."
        },
        {
            "heading": 2,
            "text": "Subscribe"
        },
        {
            "text": "The Farming blog shares updates and information about  policies, schemes and programmes affecting farmers, growers and land managers in England."
        },
        {
            "text": "Subscribe to the Farming blog for a notification whenever we publish a new post."
        }
    ]
}