{
    "url": "https://ipo.blog.gov.uk/2026/01/08/the-red-triangle-that-made-history-celebrating-150-years-of-uk-trade-mark-no-1/",
    "title": "The red triangle that made  history: celebrating 150 years of UK Trade Mark no. 1 ",
    "authors": [
        "Gavin Blackmore"
    ],
    "categories": [
        "Business",
        "Trade marks"
    ],
    "pub_date": "2026-01-08T10:00:00+00:00",
    "content": [
        {
            "text": "London, 31 December, 1875. Midnight approaches. Outside a modest office, a queue forms – not for concert tickets or Boxing Day bargains, but for something far more valuable: a place in history. "
        },
        {
            "text": "As the clock edges towards midnight, the Trade Marks Registration Act 1875 is about to come into force, allowing businesses to officially register and protect their brands for the very first time. "
        },
        {
            "text": "Bass & Co. is determined to be first. Legend has it their representative camped outside through the freezing winter night, wrapped in blankets and clutching the company’s application papers, waiting for the doors of the new registration office to open. "
        },
        {
            "text": "The clock strikes twelve. The doors swing open. Bass steps forward. "
        },
        {
            "text": "Despite a scuffle in the hall with other eager company representatives, Bass secures trade marks 1, 2 and 3. Their iconic beer label, featuring a red triangle - becomes UK trade mark No. 1, securing its place at the very top of the register forever. "
        },
        {
            "heading": 3,
            "text": "A revolutionary moment for brand protection "
        },
        {
            "text": "That New Year’s Day in 1876 wasn’t just important for Bass – it transformed how we protect innovation and creativity. It laid the foundation for the work we still do today at the IPO. "
        },
        {
            "text": "Other countries had experimented with trade mark systems before. France introduced a deposit system in 1857, and the US tried something similar in 1870 (though it was declared unconstitutional and didn’t return until 1881). But the UK’s 1875 Trade Marks Registration Act created something different: a systematic, nationally centralised register that would stand the test of time. "
        },
        {
            "text": "Why did businesses care so much about being first through those doors? Because a strong trade mark is more than just a logo – it’s a badge of identity. As the Chartered Institute of Trade Mark Attorneys (CITMA) puts it: "
        },
        {
            "text": "Being number 1 on that register meant something then, just as it does now. It signalled that you were a serious business, forward-thinking enough to protect your brand from the very first moment it became possible. "
        },
        {
            "heading": 3,
            "text": "The story behind the triangle "
        },
        {
            "text": "Bass & Co. had been brewing beer in Burton upon Trent since 1777, nearly a century before that famous queue formed. The town’s water quality was legendary – brewers believed it made superior beer, and Bass built its reputation on it. "
        },
        {
            "text": "By the 1850s, they were already using the red triangle to identify their bottles. Simple, bold, and instantly recognisable – distinctive in exactly the way a good trade mark should be. When the opportunity came to make that protection official, Bass wasn’t taking any chances. "
        },
        {
            "text": "Their strategy paid off spectacularly. They didn’t just secure the number 1 spot – they also grabbed marks 1, 2 and 3. The first two remain live on the register to this day, a remarkable achievement in itself. "
        },
        {
            "text": "Did you know? You can view UK Trade Mark No. 1 on our own register right now. There it is – the iconic red triangle, exactly as it appeared 150 years ago. "
        },
        {
            "heading": 3,
            "text": "From Burton to the Bar at the Folies-Bergère "
        },
        {
            "text": "Within six years of registration, Bass was already so iconic that it appeared in one of the era’s most famous paintings. In 1882, Édouard Manet painted \"A Bar at the Folies-Bergère\" – and there, visible in both corners of the canvas, are bottles bearing that distinctive red triangle. "
        },
        {
            "text": "The brand became synonymous with quality and modernity. Its cultural influence didn’t stop there. In the early 20th century, it caught the eye of the Cubist movement, inspiring works by Georges Braque and Pablo Picasso. Even James Joyce mentioned it in Ulysses, describing the Bass label as “certainly calculated to attract anyone’s remark on account of its scarlet appearance.” "
        },
        {
            "text": "It’s remarkable to think that a UK trade mark became part of global art and literature – a testament to the power of IP. "
        },
        {
            "heading": 3,
            "text": "Still on the register after 150 Years "
        },
        {
            "text": "The Bass trade marks are now owned by Anheuser-Busch InBev (AB InBev). The original Bass Brewery in Burton upon Trent closed in 2005, but the trade mark lives on. It is a reminder of where our work began – and how the IP we register today might still be protecting businesses 150 years from now. "
        },
        {
            "text": "Think about what that red triangle has survived: more than 30 changes to trade mark law, two world wars, the decline of traditional British brewing, multiple changes of ownership, and the complete transformation of how we consume media and advertising. Yet there it sits on the register, as valid today as it was in 1876. "
        },
        {
            "heading": 3,
            "text": "A Legacy That Continues "
        },
        {
            "text": "The Bass red triangle demonstrates everything a successful trade mark should be: highly distinctive, instantly recognisable, and built to last. It proved that protecting your brand isn’t just about legal rights – it’s about creating something that becomes woven into the cultural fabric. "
        },
        {
            "text": "As we celebrate 150 years of UK Trade Mark No. 1 in 2026, let’s reflect on the journey from that freezing New Year’s Eve queue to the sophisticated IP system we operate today. Every trade mark we register carries the potential to be the next Bass triangle – a brand that not only stands the test of time but becomes part of our shared history. "
        },
        {
            "text": "Here’s to the innovations that endure – and to the next 150 years of protecting British creativity and enterprise. "
        }
    ]
}