{
    "url": "https://defrafarming.blog.gov.uk/2026/01/08/the-new-sfi-offer-for-2026/",
    "title": "The new SFI offer for 2026",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2026-01-08T11:05:32+00:00",
    "content": [
        {
            "text": "The new Sustainable Farming Incentive (SFI) offer will launch this year. It will continue to support sustainable farming in England and help encourage growth."
        },
        {
            "text": "In response to feedback, we are improving the new SFI offer to:"
        },
        {
            "text": "These changes will deliver an SFI that is simpler and fairer, so farmers can plan with confidence."
        },
        {
            "text": "We will work with stakeholders now to get these changes right before the new SFI offer launches, and we will publish full scheme details before the first application window opens."
        },
        {
            "heading": 2,
            "text": "Simplicity and focus"
        },
        {
            "text": "To make the new SFI offer simpler and more focused, we are streamlining it by reducing the number of actions."
        },
        {
            "text": "There will still be a broad offer to suit different types of farms and plenty of choice, with greater emphasis on actions that support sustainable food production."
        },
        {
            "text": "This will include: "
        },
        {
            "heading": 2,
            "text": "Fairness and accessibility"
        },
        {
            "text": "We want as many farmers as possible to benefit from SFI. This will help us achieve the government’s target of doubling the number of farms providing sufficient year-round resources for farm wildlife by December 2030, compared with 2025."
        },
        {
            "text": "We are considering ways to do this and will publish further details before we launch the new SFI offer."
        },
        {
            "heading": 2,
            "text": "Certainty and transparency"
        },
        {
            "text": "We know you need certainty to plan ahead, so we can confirm there will be two SFI application windows this year."
        },
        {
            "text": "We will publish clear definitions of these two groups before the first window opens."
        },
        {
            "text": "We will set clear budgets for each window and provide regular updates so you can see when a window is close to being fully subscribed."
        },
        {
            "text": "We will not close application windows without warning."
        },
        {
            "heading": 2,
            "text": "Stay informed"
        },
        {
            "text": "This morning, we published a blog post summarising the Secretary of State's OFC2026 speech. It includes a number of announcements to support farmers in England."
        },
        {
            "text": "Subscribe to the Farming blog to receive updates on the SFI offer and information from the Farming and Countryside Programme."
        }
    ]
}