{
    "url": "https://naturalengland.blog.gov.uk/2018/06/29/friends-in-high-places-ringing-peregrine-falcon-chicks-at-york-minster/",
    "title": "Friends in high places: Ringing peregrine falcon chicks at York Minster",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2018-06-29T10:31:16+01:00",
    "content": [
        {
            "text": "Natural England’s Lower Derwent Valley National Nature Reserves Team recently climbed York Minster to colour-ring this year’s brood of four healthy peregrine falcon chicks."
        },
        {
            "text": "The team were invited along with volunteer Jean Thorpe MBE, the tireless wildlife rescuer and volunteer who has been involved with Natural England and English Nature in the Lower Derwent Valley since 1993, to head to the roof of York Minster for rather impressive (peregrine eye) views of York."
        },
        {
            "text": "The four chicks were colour-ringed with orange rings with three black letters – allowing them to be individually recognised so we can track them as they disperse, hopefully to be picked up breeding at other sites in the area in future years."
        },
        {
            "text": "It was also a great exercise in engaging the Minster staff and offers more opportunities to engage the passing public in our local peregrines and our joint work. Now local residents and visitors alike can help record the life histories of these individual birds, linking into the local NNR’s work on being a hub for local action in the natural environment in the wider landscape."
        },
        {
            "text": "It also highlights the fact that not only does York offer world class built heritage, but also the natural environment equivalent in the internationally important Lower Derwent Valley National Nature Reserves within the city boundaries and work in developing stronger links, for all sorts of benefits, between the two."
        },
        {
            "text": "The chicks should be starting to fledge in a couple of weeks – and further info and photos will be put up on the Lower Derwent Valley blog and the Lower Derwent Valley Facebook page."
        }
    ]
}