{
    "url": "https://educationhub.blog.gov.uk/2021/11/can-christmas-plays-nativities-and-other-festive-events-in-schools-and-nurseries-go-ahead-this-year/",
    "title": "Can Christmas plays, nativities and other festive events in schools and nurseries go ahead this year?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2021-11-26T10:25:25+00:00",
    "content": [
        {
            "text": "Christmas and nativity plays are one of our most cherished school traditions. Sadly last year many had to be cancelled but this year, as we are at a different stage of the pandemic and so many people are benefitting from the protections the vaccines offer, we hope many more will be able to go ahead."
        },
        {
            "heading": 3,
            "text": "Can nativities and school plays go ahead this year?"
        },
        {
            "text": "Nativities, plays, concerts and other festive events can go ahead but it is a matter for schools and early years to decide if they want to host them."
        },
        {
            "text": "Our guidance has not changed and says schools, nurseries and other settings can continue to hold events where visitors such as parents are on-site."
        },
        {
            "text": "If a play or concert is being held on-site, schools should take steps to improve fresh air flow in the areas where gatherings are taking place."
        },
        {
            "text": "Air flows can be improved by ventilation systems or naturally by opening doors and windows, although schools should obviously make sure they maintain a comfortable temperature and don’t compromise fire safety."
        },
        {
            "text": "We are also providing CO2 monitors to all state-funded schools so staff can quickly identify where ventilation needs to be improved."
        },
        {
            "heading": 3,
            "text": "What precautions can parents take if they are attending a play or event?"
        },
        {
            "text": "You should take a rapid lateral flow test if you’re going to be coming into contact people you don’t normally meet. You can order tests online or visit a pharmacy. If your test is positive you should isolate immediately and get a PCR test."
        },
        {
            "text": "You should also wear a face covering in crowded or enclosed areas."
        },
        {
            "heading": 3,
            "text": "What if there are lots of cases in the school community?"
        },
        {
            "text": "If schools or early years settings have particularly high levels of COVID-19, local Directors of Public Health may suggest that they don’t hold gatherings, to reduce transmission."
        }
    ]
}