{
    "url": "https://planninginspectorate.blog.gov.uk/2021/11/26/exploring-how-technology-can-support-us-in-applying-our-professional-judgement/",
    "title": "Exploring how technology can support us in applying our professional judgement",
    "authors": [
        "Claire Hamar"
    ],
    "categories": [
        "Innovation"
    ],
    "pub_date": "2021-11-26T15:43:01+00:00",
    "content": [
        {
            "text": "Could artificial intelligence bring efficiency savings, freeing up valuable time to focus on what matters most – quality decision-making? Claire Hamar, Head of Innovation and Improvement at the Inspectorate, explains a new project exploring the potential of artificial intelligence (AI)."
        },
        {
            "text": "Technology continues to evolve at an astonishing rate. It can help reduce or remove mundane tasks, enhance convenience, and free up our time. Technology has become a part of our lives, and we have become so accustomed to technological advances we barely notice them."
        },
        {
            "text": "At the Planning Inspectorate we are keen to make best use of technology to deliver our public services. We make decisions or recommendations on a range of land use issues. We consider high volumes of information in our decision-making."
        },
        {
            "text": "In a previous blog we talked about how we are transforming our services. In addition to making it easier for customers to do business with us, we want to establish a focus on the future and enable creativity in our problem solving. Through innovation we want to become more efficient in what we deliver so we can focus on what matters most – quality decision-making."
        },
        {
            "text": "We want our people to be able to focus on high-value activity, making best use of their skills and professional judgement. One of our approaches to enable this is through innovation."
        },
        {
            "heading": 3,
            "text": "How Artificial Intelligence could aid the planning process"
        },
        {
            "text": "We have started a project to investigate whether artificial intelligence (AI) has the potential to provide a consistent and systematic approach to categorise and organise representations. Representations form the high quantity of written evidence we receive from parties who wish to make a comment about a case. This would support our decision-makers by reducing the time it takes to identify and assess the issues."
        },
        {
            "text": "The field of AI is wide-ranging. We have completed early market engagement with several AI technology experts. This has provided sufficient confidence that AI offers a potential solution to our challenge."
        },
        {
            "text": "We have recently engaged Oxford Global Projects as our delivery partner and technical expert to explore this through a discovery. Through this we will look to understand:"
        },
        {
            "text": "This will ultimately enable us to assess whether AI is the right technology to address user needs and the challenge."
        },
        {
            "text": "We are engaging with stakeholders across the Department for Levelling Up, Housing and Communities, the Planning Advisory Service, and with local authorities to collaborate, share learning and maximise value across the planning system."
        },
        {
            "heading": 3,
            "text": "Examples of AI in everyday life"
        }
    ]
}