{
    "url": "https://educationhub.blog.gov.uk/2021/11/how-can-students-access-free-period-products-in-school-or-college/",
    "title": "How can students access free period products in school or college?",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Colleges",
        "Period Products Scheme",
        "Secondary schools"
    ],
    "pub_date": "2021-11-26T09:48:31+00:00",
    "content": [
        {
            "text": "No-one should be held back from accessing education due to their period."
        },
        {
            "text": "In January 2020, we launched the Period Products Scheme to provide learners with period products when they need them."
        },
        {
            "text": "Today we have announced that we have extended the fully funded period product scheme until the end of the academic year. The scheme provides schools and colleges in England with free tampons, pads, menstrual cups and similar items to make available to their students."
        },
        {
            "text": "But how does the scheme work? Why is it so necessary and how can you make sure your school or college is involved?"
        },
        {
            "heading": 3,
            "text": "Why have you introduced this programme?"
        },
        {
            "text": "A recent study by PHS Group suggests 35% of girls aged 13-18 have taken time off school or college because of their period, with 11% of those claiming they missed school or college due to lack of affordability."
        },
        {
            "text": "It is important that learners can attend lessons and engage in learning without worrying about their period."
        },
        {
            "heading": 3,
            "text": "So what is the Period Products Scheme?"
        },
        {
            "text": "Having periods should not be a barrier to education for any young person."
        },
        {
            "text": "The Period Products Scheme provides anyone who has periods access to period products like tampons, towels and more through their school or college if, for example, they can’t afford period products, have forgotten to bring them to school or college or have come on their period unexpectedly."
        },
        {
            "text": "Through the scheme, all state maintained secondary schools, post 16 organisations and primary schools with pupils aged 10 and above in England are provided with a budget for period products."
        },
        {
            "text": "Organisations can log into their online account, place an order and have the products delivered free of charge."
        },
        {
            "text": "The scheme works alongside the Health Education curriculum in schools to help tackle any stigma around menstruation."
        },
        {
            "heading": 3,
            "text": "Who is eligible for the scheme?"
        },
        {
            "text": "All learners in schools and colleges should be able to access period products if they need them."
        },
        {
            "heading": 3,
            "text": "How does the scheme actually work?"
        },
        {
            "text": "To make sure organisations have access to a wide range of period products in the most cost-effective and efficient way, we have a national contract with Personnel Hygiene Services Limited (phs). This allows organisations to order period products and have them delivered when they need them."
        },
        {
            "text": "Schools and colleges then choose how the products are made available to pupils. Some have them in the welfare room, others in toilets. Some organise drop-in sessions where learners can go to collect products."
        },
        {
            "heading": 3,
            "text": "How many organisations are currently taking part in the scheme?"
        },
        {
            "text": "In 2020, 76% of secondary schools, 79% of post 16 organisations and 41% of primary schools had ordered products."
        },
        {
            "text": "In total, during the first year of the scheme 16,698 orders had been placed, an encouraging figure illustrating that we are taking a huge step towards providing learners with free period products when they need them."
        },
        {
            "heading": 3,
            "text": "I don’t think my school/college offers this – what should I do?"
        },
        {
            "text": "Speak to your school or college and make sure they are aware of the scheme – if they are not, explain that they should look online at how to get involved."
        },
        {
            "heading": 3,
            "text": "How can I find out more information about the scheme?"
        },
        {
            "text": "More information on the Period Product scheme can be found here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}