{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/26/is-a-sigh-just-a-sigh/",
    "title": "Is a Sigh Just a Sigh?",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-11-26T13:34:35+00:00",
    "content": [
        {
            "text": "Stress is the body’s natural reaction to real or perceived harmful situations. Whether it’s an interview, an upcoming deadline, a difficult conversation, or you’ve fallen into the lion enclosure at the zoo, we all feel stress physiologically in an almost identical way. In my pursuit for tools to relieve stress I stumbled across a podcast by Dr Andrew Huberman, a professor of Neurobiology and Ophthalmology at Stanford University and he talks about a way to hack into the stress response through the understated art of sighing."
        },
        {
            "heading": 3,
            "text": "The Simplified Science of Breathing"
        },
        {
            "text": "When we inhale the diaphragm moves down creating more space in the heart cavity and increasing the heart volume. Blood moves slower through a larger space, and this is detected by a receptor called the sinoatrial node (SAN). SAN sends signal to the brain to say that blood pressure is lower in the heart which in turn sends signals back causing the heart rate to speed up. The opposite is true when we exhale- the diaphragm moves up, leading to less volume, pressure increases, and the brain sends signals to slow the heart rate down. When we are stressed some of the 500 million balloon like air sacs in the lungs become collapsed due to increased breathing rate and shallow inhales. This limits gas exchange and increases the CO2 levels in the blood. This contributes to that agitated feeling. "
        },
        {
            "heading": 3,
            "text": "The Physiological Sigh"
        },
        {
            "text": "There are dozens of breathing techniques and patterns that help reduce stress and anxiety. For example, a technique discovered in the 1930s called ‘The Physiological Sigh’ can help us regain control quickly from feelings of stress and anxiety."
        },
        {
            "text": "A sigh is a particular breathing pattern when two inhales take place followed by a long exhale. It’s something we do all the time involuntarily- around every 5 minutes including the moments before we are about to fall asleep, during sleep, and when we cry. Sighing is essential for lung function and without it our lungs would fail. – highlighted by the trouble people had in early iron lungs because they were not designed to sigh."
        },
        {
            "text": "When we inhale twice the collapsed alveoli reinflate with air. This increases the surface area of the lungs and removes CO2 from the body much more efficiently. This makes the body feel more relaxed. When we take long exhales, the receptors in the heart sense the increase in pressure, this sends signals to the brain to slow down the heart rate. This creates a relaxed feeling. Dr Huberman describes the method as two inhales, a long exhale 1-3 times."
        },
        {
            "text": "By mindfully sighing a few times, you can manually reduce two key symptoms of stress within a few seconds."
        },
        {
            "text": "The best thing about this method is that it uses the body to control the mind, rather than trying to use the mind to control the mind. The latter is significantly harder to do and takes training and practice. Mindfulness, Yoga and exercise are popular examples of this. But life happens and we can’t always perform a downward facing dog or run a 5k just before a presentation or an interview. This is a useful tool you can use in real time and is effective in reducing unwanted symptoms of stress. If you want to learn more about this technique, check out the link below."
        },
        {
            "heading": 3,
            "text": "Podcast link"
        },
        {
            "text": "Huberman Lab Podcast -Tools for Managing Stress & Anxiety"
        },
        {
            "text": "Sign up to the GSE Blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}