{
    "url": "https://socialcare.blog.gov.uk/2021/11/26/social-care-reform-making-mental-health-a-priority/",
    "title": "Social care reform: making mental health a priority",
    "authors": [
        "Kathy Roberts"
    ],
    "categories": [
        "Care and support",
        "Mental health"
    ],
    "pub_date": "2021-11-26T12:19:15+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Essential services"
        },
        {
            "text": "The Prime Minister made a commitment to “fix social care, once and for all”."
        },
        {
            "text": "Since then, the pandemic has seen social care brought to the forefront of public attention like never before and whilst reform of the sector has been long-awaited, the vital role of mental health provision still needs to be stated."
        },
        {
            "text": "Local authorities, through their duties for adult social care under the Care Act 2014 and Mental Health Act, are currently the major commissioners of our members, all of whom are voluntary and community mental health providers. They offer a range of essential services, from prevention and crisis intervention, to community support, all for people who experience poor mental health and/or severe mental illness."
        },
        {
            "text": "In order to truly reform social care, we need to dispel the longstanding belief it is just about older people and care homes. The sector provides for all our citizens, including working age adults and families receiving a range of care and support services."
        },
        {
            "text": "For example, our members provide vital community social care services including counselling and advice, advocacy, supported living and housing, forensic and crisis services, carers support and personal assistants, employment support, and much more."
        },
        {
            "text": "This point is critical: social care and support allows people with mental health needs to build resilience and autonomy in their lives."
        },
        {
            "text": "Our members not only promote and support recovery, they enable people to lead fulfilling lives. So, we need to build a greater understanding of the value of social care and its role in healthier communities, whilst also acknowledging the essential role of the workforce in achieving this."
        },
        {
            "heading": 2,
            "text": "Involving providers and people with lived experience"
        },
        {
            "text": "Over the last 21 months, The Association of Mental Health Providers has been working closely with the Minister for Care and Mental Health, Department of Health and Social Care colleagues and other government departments to consider the impact of the pandemic on people with mental health conditions. We have collectively explored how services have been affected, and how both providers and people can be supported through the crisis and beyond."
        },
        {
            "text": "When I was invited by Sir David Pearson to support the work of the Social Care Covid-19 Support Taskforce as co-chair of the Mental Health and Wellbeing Advisory Group, this was uppermost in my mind and highlighted through our report recommendations."
        },
        {
            "text": "We have continued to support the Department’s work through The Association’s Mental Health and Wellbeing Policy and Oversight Group, which informed both last year’s and this year’s Adult Social Care Winter Plans, as well as the Review of the 2020/21 Plan. We also continue to work together, taking forward these recommendations to address the care and support needs for those people experiencing poor mental health."
        },
        {
            "text": "Our Mental Health and Wellbeing Policy and Oversight Group has representation from the VCSE mental health service provider sector, people with lived experience and their carers, as well as other key stakeholders. It has become a key vehicle for informing our government policy colleagues on the priorities for social care in mental health."
        },
        {
            "text": "In addition to working with the Group and our members, we’ve also been able to work collaboratively with our partners in the VCSE Health and Wellbeing Alliance to engage on the system reform white paper."
        },
        {
            "text": "We have worked collaboratively with our membership, the wider sector and most importantly people with lived experience and their carers. We know this takes time and resource to really listen, understand and construct systems appropriate for the individuals using them, their families and the wider community."
        },
        {
            "text": "The Government must continue to make sure the views and voices of providers delivering services and the people being supported are informing the social care reform process, as well as other key policy developments impacting the sector and the support delivered."
        },
        {
            "text": "My resolve remains steadfast.  Only by working together can we truly transform and improve the health and wellbeing of our nation."
        }
    ]
}