{
    "url": "https://cspl.blog.gov.uk/2021/11/26/the-committee-on-standards-in-public-life-the-house-of-commons-committee-on-standards-and-the-parliamentary-commissioner-for-standards-who-they-are-and-what-they-do/",
    "title": "Standards bodies: Who's who?",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "MPs",
        "MPs' outside interests"
    ],
    "pub_date": "2021-11-26T10:20:27+00:00",
    "content": [
        {
            "text": "In the first of a series of explainer blogs over the next few months, Lord Evans talks about the various standards bodies in and around Parliament and government:"
        },
        {
            "text": "In our recent ‘Upholding Standards in Public Life’ report we commented on the plethora of standards bodies that now exist in Parliament and government. From the evidence we heard, it’s clear that they each have a necessary role and function in their own particular contexts, but that more can be done to explain and inform people about who they are and what they do."
        },
        {
            "text": "Who are these bodies and what do they do?"
        },
        {
            "text": "The Committee on Standards in Public Life (CSPL)"
        },
        {
            "text": "Let’s start with ourselves. The Committee on Standards in Public Life (CSPL) is an independent, advisory body sponsored by the Cabinet Office. Set up by the then Prime Minister, Sir John Major in 1994, it promotes the Nolan Principles and advises the Prime Minister on ethical standards across the whole of public life."
        },
        {
            "text": "We consist of four independent members, three political members and an independent chair. The independent members of the Committee are appointed by the Prime Minister, after open competition under the government’s  Governance Code for Public Appointments. Three members are nominated by the Conservative, Labour and Liberal Democrat political parties."
        },
        {
            "text": "Our role is to review and report on standards structures, processes and culture in Parliament, government, local government and the public sector more widely. We choose our own subjects for review and collect evidence from a wide range of stakeholders to support the recommendations we make."
        },
        {
            "text": "We are not a regulator so we do not look at individual complaints or investigate cases."
        },
        {
            "text": "The Committee’s 2018 report on MPs’ Outside Interests looked at the rules on MPs’ second jobs and financial interests. It contained a number of recommendations, including two that have recently been proposed by the Prime Minister as the basis for reforming the rules for MPs."
        },
        {
            "text": "The Commons Committee on Standards"
        },
        {
            "text": "The House of Commons Committee on Standards is a select committee in the House of Commons. Its role is twofold. First, it reviews the MPs’ Code of Conduct (which is owned by the House), making any recommendations for change to the House of Commons. Second, it decides on cases of misconduct referred to it by the Parliamentary Commissioner for Standards and reports on these to the House, normally including recommendations for sanctions when it finds the Code has been breached."
        },
        {
            "text": "The Committee consists of 7 MPs and 7 lay members and is chaired by an opposition MP, currently Chris Bryant MP (Labour). Lay members were first appointed to the Committee in 2012, following a recommendation by the independent Committee on Standards in Public Life (CSPL) in its 2009 report on the expenses and allowances of MPs.  They received full voting rights on the Committee in January 2019."
        },
        {
            "text": "The Commons Committee on Standards was already conducting a review of the Code of Conduct before the recent concerns arose."
        },
        {
            "text": "Because of its role in overseeing the Code of Conduct, the Committee is responsible for consulting on and drawing up the detail of any rules regarding outside interests."
        },
        {
            "text": "Parliamentary Commissioner for Standards"
        },
        {
            "text": "The Commissioner is an independent officer of the House of Commons and the current post holder is Kathryn Stone OBE.  This post was set up following a recommendation in CSPL’s first report in 1995."
        },
        {
            "text": "Her job is to oversee the Register of Members’ financial interests and the Code of Conduct for MPs which is agreed by the House of Commons."
        },
        {
            "text": "Where there is a complaint that an MP has breached the rules on standards and financial interests (found in paragraphs 11-18 of the House of Commons’ Code of Conduct for Members) this may be investigated by the Parliamentary Commissioner for Standards. The Commissioner can also start investigations on her own initiative. When the Commissioner finds that an MP has breached the rules, and it cannot be “rectified” under her own powers (used for minor breaches on registration or declaration of interests or use of facilities where the MP agrees with her decision), she sends a memorandum to the Committee on Standards who consider the case and, if necessary, recommend an appropriate sanction."
        },
        {
            "text": "The Commissioner also plays a role in the Independent Complaints and Grievance Scheme (ICGS) which covers bullying, harassment and sexual harassment. The Commissioner oversees and makes findings on investigations conducted under the scheme where the respondent is an MP, but appeals are conducted, and in serious cases sanctions are decided, by the Independent Expert Panel (IEP) which does not have any MP involvement."
        },
        {
            "text": "The Commissioner keeps the Register of Members' Financial Interests and ensures investigations are independent, impartial, thorough and fair."
        },
        {
            "text": " "
        },
        {
            "text": "Watch a short film about the work of CSPL"
        },
        {
            "text": "Find out more about Standards in the House of Commons"
        },
        {
            "text": "Find out more about the Parliamentary Commissioner for Standards"
        },
        {
            "text": "Follow CSPL on Twitter"
        }
    ]
}