{
    "url": "https://ukhsa.blog.gov.uk/2021/11/26/what-is-avian-flu/",
    "title": "What is avian flu?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Avian Flu"
    ],
    "pub_date": "2021-11-26T17:16:44+01:00",
    "content": [
        {
            "heading": 5,
            "text": "Updated on 6/01/22"
        },
        {
            "text": "A record number of cases of avian influenza, or ‘bird flu’ as it’s commonly known, have been confirmed across England, Scotland, and Wales in wild and captive birds this winter (2021/22)."
        },
        {
            "text": "Bird flu is an infectious type of influenza that spreads among birds and there are many different types. Some strains of bird flu can pass to humans but this is extremely rare. It usually requires very close contact with an infected bird so the risk to humans is considered very low."
        },
        {
            "text": "The Food Standards Agency has also said that on the basis of the current scientific evidence, avian influenza also poses a very low food safety risk for UK consumers. Properly cooked poultry and poultry products, including eggs, are safe to eat. Everyone should follow FSA’s food safety and hygiene advice."
        },
        {
            "text": "An avian influenza outbreak can occur at any point in the year. However, the UK typically faces a seasonal increase in the risk of an avian influenza associated with the winter migration patterns of wild birds. Infected wild waterfowl can then infect local and sedentary wild bird species, poultry or other captive birds resulting in local transmission either directly between birds or indirectly by birds coming into contact with environmental contamination, including faeces and feathers from infected birds."
        },
        {
            "text": "Department of Environment, Food and Rural Affairs (Defra) together with its delivery agency the Animal and Plant Health Agency (APHA) is responsible for responding to and managing of avian influenza in poultry and other captive birds."
        },
        {
            "text": "APHA also carries out year-round avian influenza surveillance of dead wild birds submitted via public reports and warden patrols. That surveillance, together with regular risk assessments help government, industry and the general public understand the level of risk avian influenza wild birds pose to poultry and other captive birds at different points in the year."
        },
        {
            "text": "The UKHSA has put measures in place to monitor all individuals who have had contact with confirmed cases of avian influenza in birds to monitor their health and give prophylactic anti-virals to reduce the chances of them becoming unwell."
        },
        {
            "heading": 2,
            "text": "What are the different types of avian flu?"
        },
        {
            "text": "Viruses consist of proteins and avian influenza viruses are classified using the H and N proteins. There are 16 different H proteins and 9 N proteins in birds and any combination of these is possible. The H5 and H7s are considered to be the most important from an animal health perspective."
        },
        {
            "text": "There are 5 strains that have caused public health concern in in recent years: H7N9, H9N2, H5N6, H5N8 and a type of H5N1 strain more common in Asia. Although none of these strains easily infect people and aren't usually spread from human to human, several people have been infected around the world, leading to a number of deaths."
        },
        {
            "text": "In February 2021, H5N8 was found to have infected a small number of people at a single site for the first time in Russia and in China recently, there have been increased numbers of human cases of H5N6, as well as the first detection in Laos. The situation is being closely monitored by international agencies."
        },
        {
            "text": "Currently in the UK there have been both findings in wild birds and confirmed cases in poultry and captive birds of the ‘Eurasian’ H5N1 strain of avian influenza. This ‘Eurasian’ H5N1 strain of avian influenza is highly pathogenic to poultry and other birds, but the risk to human health is considered very low."
        },
        {
            "text": "This strain can be clearly distinguished from the previous ‘Asian’ H5N1 strains because they belong to a different subgroup. Only one case of H5 has been confirmed in a person in the UK, in early 2022. The person acquired the infection from very close, regular contact with a large number of infected birds, which they kept in and around their home over a prolonged period of time. Currently there is no evidence that this strain detected in the UK can spread from person to person."
        },
        {
            "heading": 2,
            "text": "What is the risk of humans contracting avian influenza?"
        },
        {
            "text": "Transmission from an infected bird to a human is very rare with fewer than 5 cases recorded in the UK. While previous cases were confirmed as the H7 strain, January 2022 was the first time H5 has been detected in a human in the UK. The risk to the wider public from avian flu continues to be very low. However, people should not touch sick or dead birds."
        },
        {
            "heading": 2,
            "text": "What role does UKHSA play?"
        },
        {
            "text": "While the current evidence suggests that these strains don’t spread easily to or between people, viruses constantly evolve and that is why UKHSA has monitoring in place to ensure we pick up any early evidence that the virus has jumped from birds to humans."
        },
        {
            "text": "UKHSA follows up all individuals who have been in contact with a confirmed case of avian influenza without the appropriate protective equipment. We contact them daily to see if they have developed symptoms so that we can take appropriate action if so."
        },
        {
            "text": "People will also be offered anti-viral treatment after recent exposure to the virus. This is to stop the virus replicating in their body if they have picked it up and should prevent them from becoming unwell. It also works to stop them passing it on. We also swab people even if they don’t have symptoms, to help surveillance programmes and our understanding of the virus if they were to develop it."
        },
        {
            "heading": 2,
            "text": "What action should the public take?"
        },
        {
            "text": "It is really important that people do not touch dead or sick birds. Infected wild birds can appear in the countryside and in towns and cities so if you see a dead bird in your area, do not touch it. Instead report it to the Defra helpline on 03459 33 55 77."
        },
        {
            "text": "APHA on behalf of Defra will then collect some of these birds and test them to help government understand how the disease is distributed geographically and in different types of bird, not all birds will be collected. Wild birds are susceptible to a range of diseases/injuries and not all dead birds will have been infected with avian influenza. If avian influenza is confirmed in wild birds, UKHSA put in place measures to reduce the risk to people who have come in contact with the dead birds."
        },
        {
            "text": "If you are a bird keeper you must keep a close watch on your birds for signs of disease and maintain good biosecurity at all times. If you suspect any type of avian influenza in poultry or captive birds you must report it immediately by calling in England the Defra Rural Services Helpline on 03000 200 301. In Wales, contact 0300 303 8268. In Scotland, contact your local Field Services Office."
        },
        {
            "text": "If you experience any symptoms of bird flu and have been in close contact (within 1 metre) of a confirmed case of avian influenza in domestic or wild birds in the past 10 days, it is important that you seek medical advice from a GP or by calling NHS 111. Your symptoms can be checked over the phone. It is also important to report any recent international travel, as bird flu is a disease that occurs globally and some countries present an increased risk."
        },
        {
            "heading": 2,
            "text": "What happens when the disease is confirmed in poultry or captive birds?"
        },
        {
            "text": "UK has robust biosecurity measures and monitoring in place to prevent the disease spreading. When avian influenza is confirmed or suspected in poultry or other captive birds, disease control zones are put in place around the infected premises to prevent onward spread. Within these zones, a range of restrictions can apply."
        },
        {
            "text": "For more information on the current situation in the UK including areas where cases have been confirmed, Defra provides live updates here."
        },
        {
            "text": "UKHSA is meeting regularly with animal and public health experts from across the UK to monitor the situation and ensure all appropriate public health actions are taken."
        },
        {
            "text": " "
        }
    ]
}