{
    "url": "https://forestrycommission.blog.gov.uk/2025/06/27/a-year-of-growth-tree-planting-rates-hit-their-highest-level-in-over-20-years/",
    "title": "A year of growth: tree planting rates hit their highest level in over 20 years",
    "authors": [
        "Richard Chapman"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2025-06-27T11:01:38+01:00",
    "content": [
        {
            "text": "Yesterday, the Forestry Commission published their latest set of Provisional Woodland Statistics and Key Performance Indicators, covering 2024-25. Tree planting in England is now at its highest recorded rate in over 20 years."
        },
        {
            "text": "The figures show that over the past year, 5,765 hectares of new woodland were established in England. This means that woodland creation rates over the past year were 27% higher than in 2023/24, and 156% higher than in 2021/22 (when the Tree Planting Programme was in its infancy). In addition, 888,000 trees were planted outside woodland. This is the equivalent to 1,399 hectares, bringing the total area of tree canopy established and numbers of trees planted to 7,164 hectares, or 10.4 million trees. An equivalent to 10,000 football pitches."
        },
        {
            "text": "These planting figures are a very real testament to the dedication of all our partners, communities and the many individuals who have rolled up their sleeves to get trees in the ground."
        },
        {
            "text": "This significant milestone provides an excellent opportunity to reflect on all the hard work right across the sector over the past year, and to look ahead at what is to come."
        },
        {
            "text": "I joined the Tree Planting Programme in August 2024 and right from the outset, I've been incredibly impressed by the passion and expertise, and how we all work together to drive tree planting projects of all shapes and sizes right across the country. We’re making a meaningful difference: reconnecting people with nature, restoring our landscapes, and putting down the roots for a greener, more resilient future. Trees are at the heart of our mission to support biodiversity, combat climate change and create thousands of green jobs across the country."
        },
        {
            "text": "This year, we’ve continued to make significant strides. In March 2025, we announced the creation of the first new national forest in over 30 years. The Western Forest will see 20 million trees planted across the West of England, bringing nature closer to where people live and work. It’s a landmark moment and one that signals this government’s long-term commitment to transforming our environment."
        },
        {
            "heading": 2,
            "text": "The Spending Review settlement"
        },
        {
            "text": "Earlier this month, the Chancellor announced the outcome of the 2025 Spending Review, with a clear focus on investment and growth. The settlement included the largest investment in nature in our history: over £7 billion committed to nature’s recovery. That includes £816 million for tree planting and £85 million for peatland restoration over the Spending Review period."
        },
        {
            "text": "This funding isn’t just numbers on a page, it’s a catalyst for continued real, lasting change. It means that millions more trees can be planted across the country to help cool our cities, restore biodiversity, improve water quality and quantity, and capture carbon. Not only that, but this funding will also help to support our mental and physical health, as trees improve the air that we breathe, encourage exercise, and improve our mental wellbeing. The presence of trees leads to healthier, happier communities."
        },
        {
            "heading": 2,
            "text": "Looking ahead to continue momentum"
        },
        {
            "text": "Public support for our work is overwhelming. Over 90% of people in the UK believe forests and woodlands are essential for wildlife, and 84% support planting more trees to tackle climate change. This is why we are excited to continue in our work, to listen and deliver."
        },
        {
            "text": "To support this momentum, we’re investing in people by funding apprenticeships to build the skills we need to plant and care for our woodlands, now and into the future. The Government has supported the publication of a sector skills plan and will be investing alongside the sector in its implementation to support the growth of the sector and improve standards."
        },
        {
            "text": "Looking ahead, we're enabling community-led planting projects across England, having recently funded £1 million to The Tree Council to establish the new Trees Outside Woodland Fund, bringing trees to parks, schools, towns, cities and rural areas. Because everyone deserves access to nature, no matter where they live."
        },
        {
            "text": "We’re also determined to do our bit to ensure that the nation’s forest contribute a low carbon alternative to building the housing we need in the future. Using timber in buildings not only locks away carbon for the long term, but also replaces more carbon-intensive materials like concrete and steel, helping to reduce overall emissions. The UK is currently the second-largest importer of timber globally, but through our Timber in Construction Roadmap, we’re strengthening the domestic timber industry and supporting sustainable construction with British-grown wood."
        },
        {
            "text": "Beyond environmental gains, trees are also a powerful economic asset, supporting GDP growth, creating jobs in forestry, and boosting the leisure and tourism sectors that thrive in well-wooded landscapes."
        },
        {
            "text": "As the statistics show, this has been a year of real progress. But of course, the cliché remains that we know there’s much more to do. Our goal to increase woodland cover to 16.5% of England’s land area by 2050 is ambitious, but with continued investment, innovation, and collaboration to draw on all our collective passion and expertise, we can make it a reality."
        },
        {
            "text": "Thank you to everyone who has been part of this journey so far. Together, we’re planting the seeds of a greener, healthier future."
        }
    ]
}