{
    "url": "https://environmentagency.blog.gov.uk/2025/06/27/how-we-are-supporting-the-farming-community-to-manage-the-impacts-of-dry-weather/",
    "title": "How we are supporting the farming community to manage the impacts of dry weather",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Climate change",
        "Drought"
    ],
    "pub_date": "2025-06-27T14:44:01+00:00",
    "content": [
        {
            "text": "Current situation"
        },
        {
            "text": "Spring 2025 across England was the driest since 1893 with all areas receiving well below average rainfall."
        },
        {
            "text": "The dry spring has seen exceptionally low river flows experienced across northern and central England. Recent rainfall at the start of June had helped increase river flows briefly but these have quickly receded, and soils are much drier than expected across most of England. Further information can be found in our Water situation reports for England."
        },
        {
            "text": "In light of the dry spring, there has been a greater demand on farm irrigation reservoirs especially where there have been restrictions on abstraction licences, impacting on surface water abstractions, due to low river flows. The early start of the irrigation season and increased demand on reservoirs has caused a depletion in storage capacities over the spring. Should the dry weather continue over the summer, this may cause resilience issues for irrigators where storage reservoirs are currently low."
        },
        {
            "text": "Dry weather impacts are being observed across the sector such as reduced growth on crops that do not have access to irrigation and less well-established spring crops. Impacts have also been reported on the livestock sector, particularly where there are issues with reduced grass growth which could impact on winter feed supplies later in the year."
        },
        {
            "text": "Our updated spray irrigation report for the summer has been published which confirms a further deterioration in the forecast since the Spring. More information on the current position and support available for farmers to help with water supplies and resilience can be found here."
        },
        {
            "text": "What support is available from the Environment Agency to support irrigators this year?"
        },
        {
            "text": "The Environment Agency is working closely with farmers and growers to help secure water this summer. If irrigators believe that they may not be able to comply with their abstraction licence or have issues accessing water supplies, please contact the Environment Agency as soon as possible. There are several short and long-term options available to improve farmers and growers access to water and increase resilience for the summer and beyond. Some of these options include:"
        },
        {
            "text": "Short term"
        },
        {
            "text": "Long term"
        },
        {
            "text": "Additionally, our water transfer schemes that help maintain river flows and groundwater are in operation this summer to help support wildlife and facilitate abstraction. We are also carrying out irrigation patrols and other compliance checks to ensure all abstractors are complying with their licence conditions to help protect water availability."
        },
        {
            "text": "Top tips to for irrigators during prolonged dry weather"
        },
        {
            "text": "Further information on water abstraction during prolonged dry weather and drought can be found on our guidance pages."
        }
    ]
}