{
    "url": "https://nationalscreening.blog.gov.uk/2025/06/27/norwegian-lung-cancer-screening-delegation-visit/",
    "title": "Norwegian lung cancer screening delegation visit",
    "authors": [
        "Professor Anne Mackie",
        "Katie Lee"
    ],
    "categories": [
        "Lung cancer screening"
    ],
    "pub_date": "2025-06-27T08:20:33+01:00",
    "content": [
        {
            "text": "We recently had the pleasure of welcoming a fantastic team from Norway who came over for a whirlwind 2-day visit to see how we’re rolling out lung cancer screening in England. "
        },
        {
            "text": "The group included clinicians and experts from Norway’s Directorate of Health, its Ministry of Health and Care Services."
        },
        {
            "text": "The Norwegians are currently investigating whether to introduce lung cancer screening and the trip was all about finding out what we’ve learned, the challenges we’ve faced, and the successes we’ve had along the way."
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "Back in June 2023, the Government gave the green light to roll out a national targeted lung cancer screening programme — something the UK National Screening Committee (UK NSC) had recommended after high quality research indicated that finding and treating screen-detected lung cancers would do more good than harm. It’s now called the NHS Lung Cancer Screening Programme, and the aim is simple: catch lung cancer early, ideally before symptoms appear, and when treatment stands a better chance of working. "
        },
        {
            "text": "Using electronic patient records, the programme finds people aged 55 to 74 who currently smoke or have smoked in the past. It offers them a risk assessment based on their smoking history and some other factors. Those in the higher-risk group get invited for a specialist scan. If there is a suspicious finding, they will be offered an urgent clinic visit. If there are findings that might be early cancer, then scans are done after 3 and 12 months. Other participants have their next scan after 2 years.  "
        },
        {
            "heading": 2,
            "text": "On the ground in Nottinghamshire "
        },
        {
            "text": "On the first day of the visit, the screening team from Nottingham and Nottinghamshire NHS, working closely with partner organisation InHealth, gave our Norwegian guests a warm welcome and a detailed look at how the programme works. "
        },
        {
            "text": "At the Integrated Care Board (ICB) office, the Nottinghamshire team gave them a thorough overview of the screening pathway — from GP referrals through to specialist care — strategies to tackle health inequalities, communications and engagement work, and support for people trying to quit smoking. "
        },
        {
            "text": "Afterwards, they visited one of InHealth’s mobile scanning units in a supermarket car park. It was a great example of taking lung screening to the people, rather than the other way round. "
        },
        {
            "text": "Many thanks to the rest of the Nottingham and Nottinghamshire ICB for organising the visit so brilliantly. "
        },
        {
            "heading": 2,
            "text": "National perspective "
        },
        {
            "text": "The following day, our visitors travelled down to London where we welcomed them to the Department of Health and Social Care offices. "
        },
        {
            "text": "We gave a series of presentations covering how the programme is structured to reach the people who need it most, how we maintain quality standards, IT systems, governance, stop smoking services, and some of the exciting research coming up. "
        },
        {
            "text": "It was a great chance for both sides to ask questions, reflect, and exchange ideas. "
        },
        {
            "heading": 2,
            "text": "Working together across borders "
        },
        {
            "text": "We’re always excited about opportunities to collaborate internationally, and this visit was a brilliant example of that. It’s clear the Norwegians have a real appetite to learn and we’re proud to have been able to share what we’ve built here. "
        },
        {
            "text": "Professor David Baldwin, NHS England Lead Clinician for Lung Cancer and Chair of the UK Clinical Expert Group for Lung Cancer, said:  "
        },
        {
            "text": "We’ve already heard back from the team in Norway — they were hugely appreciative of everything we shared and have promised to follow up with more questions once they’ve had a chance to reflect on it all. "
        },
        {
            "text": "We’re really looking forward to continuing this relationship and helping our colleagues in Norway develop a programme that could save many lives. "
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email  uknsc@dhsc.gov.uk."
        }
    ]
}