{
    "url": "https://insidedio.blog.gov.uk/2025/06/27/supporting-cadets-how-dio-provides-infrastructure-for-tomorrows-leaders/",
    "title": "Supporting Cadets: How DIO provides infrastructure for tomorrow's leaders ",
    "authors": [
        "Colonel Rob Guest"
    ],
    "categories": [
        "Armed Forces",
        "Defence Training Estate (DTE)"
    ],
    "pub_date": "2025-06-27T11:13:22+00:00",
    "content": [
        {
            "text": "As Colonel Cadets, I serve as the Army Cadet advisor to the Commander South West. The Commander commands the Army Cadets, while I provide the crucial interface between the Chain of Command of the Army Cadet Forces (ACF) Counties, the Combined Cadet Forces (CCF) in schools, and the Commander South West. "
        },
        {
            "text": "In the South West region, we oversee seven counties with community-based ACF units and 59 schools with CCF programmes. This represents approximately 11,000 Army Cadets and 1,700 Adult Instructors across our region. This is a significant presence requiring substantial infrastructure support. "
        },
        {
            "text": "The strategic importance of Cadets "
        },
        {
            "text": "The importance of cadets to both Defence and the wider community has recently been reinforced through their inclusion in an expansion programme outlined in the Strategic Defence Review. "
        },
        {
            "text": "Army Cadets play a vital role in reconnecting Defence with Society. In several areas of the country, the only people in uniform that members of the public might see are Army Cadets. Although the Army Cadets aren't primarily a recruiting tool for the armed forces, many cadets do express interest in military careers. Those who join the armed forces often progress to become officers and senior non-commissioned officers. The Army Cadets support young people in pursuing any career path they choose, whether military or civilian. "
        },
        {
            "text": "DIO's role in supporting the Ten Tors Challenge "
        },
        {
            "text": "The Ten Tors Challenge exemplifies how DIO infrastructure enables cadet activities. This prestigious event attracts 2,400 teenagers who navigate routes of 35, 45 and 55 miles across Dartmoor in under two days, carrying all they need to complete their journey and camp overnight. Additionally, 400 young people with physical, neurological or educational challenges participate in the Jubilee Challenge, a one-day event. The significance of Ten Tors was highlighted this year when General Walker, Chief of the General Staff, attended as Guest of Honour. "
        },
        {
            "text": "Army Cadets field several teams in the Ten Tors Challenge each year. Their preparation requires extensive training on Dartmoor, led by qualified Cadet Force Adult Instructors who dedicate considerable time to developing these young people. DIO plays a crucial supporting role by providing expert advice on optimal use of the training estate, offering accommodation and feeding facilities before teams venture onto the moor, sharing subject matter expertise on Dartmoor's terrain and conditions, creating safe training environments for participants and the public, and delivering regular updates on ground conditions across the moor. "
        },
        {
            "text": "During Ten Tors, I visit teams at Okehampton Camp, discussing conditions and preparation with cadets who are always eager to engage. I also participate in the HQ South West team's engagement event for approximately 60 employers and influential stakeholders, including local dignitaries. This event receives additional support from Wessex Reserve Forces and Cadet Association, which highlights the collaborative approach to cadet development. "
        },
        {
            "text": "The transformative impact of Army Cadets "
        },
        {
            "text": "I took on this role because I wanted to support the Army Cadets in the South West as they develop young people into better citizens prepared for lifelong success. The transformation is remarkable: I've seen young cadets who initially struggled with wearing their uniform develop into confident instructors capable of delivering impressive lessons to any audience. They show ultimate respect for everyone, particularly for the adults who support their Army Cadet journey. "
        },
        {
            "text": "Being an Army Cadet offers multiple benefits: fun, friendship, belonging and improved wellbeing. Cadets experience enhanced educational outcomes, improved social mobility, and better mental and physical health. They grow more confident and resilient, with stronger communication and problem-solving skills. They can also gain free vocational qualifications. "
        },
        {
            "text": "These benefits aren't just what we think we see. They've been substantiated through academic research by Professor Simon Denny of the University of Northampton, whose reports in 2021, 2023 and 2024 validate the positive impact of cadet participation. "
        },
        {
            "text": "DIO's ongoing commitment "
        },
        {
            "text": "The Defence Infrastructure Organisation remains committed to providing the essential facilities, training areas and expertise that enable cadet forces to thrive. By maintaining and developing appropriate infrastructure, DIO helps create environments where young people can develop crucial skills, build character, and prepare for their futures. "
        },
        {
            "text": "Through this partnership between DIO and cadet organisations, we continue to invest in both our infrastructure and in the potential of thousands of young people across the South West and beyond. "
        }
    ]
}