{
    "url": "https://ukhsa.blog.gov.uk/2025/06/27/what-you-need-to-know-about-uv-ultraviolet-radiation/",
    "title": "What you need to know about UV (ultraviolet) radiation",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health and Wellbeing"
    ],
    "pub_date": "2025-06-27T16:47:45+01:00",
    "content": [
        {
            "text": "Ultraviolet, or UV, radiation, comes to earth from the sun. The ozone layer protects those of us on the ground from most of it, but some does reach the surface. Here’s a quick briefing on UV."
        },
        {
            "heading": 2,
            "text": "How to protect yourself"
        },
        {
            "text": "When sunny weather is expected, regularly apply sunscreen with a sun protection factor (SPF) of at least 30 and at least a 4-star UVA (ultraviolet A radiation) protection. Take extra care with children and don’t rely on sunscreen alone to protect yourself from the sun. Wear suitable clothing and spend time in the shade when the sun's at its hottest between 11am to3pm. UV can damage the eyes too, so wearing wraparound sunglasses with UV protection - not all sunglasses have this - and a wide brimmed hat can help minimise your eyes’ exposure to UV."
        },
        {
            "heading": 2,
            "text": "A tan may look good, but it’s a sign of skin damage"
        },
        {
            "text": "Sunburn and even a tan is a sign of over-exposure to UV - that’s physical damage to your skin caused by UV. Premature skin ageing is another sign of damage."
        },
        {
            "heading": 2,
            "text": "Over-exposure to UV can lead to skin cancer"
        },
        {
            "text": "Not everyone who is over-exposed to UV will develop skin cancer, but thousands of people in the UK do every single year. There are questions as to whether you are more likely to develop cancer due to your individual genetics, but it’s generally considered that those who repeatedly over-expose themselves to high levels of UV, from the sun, sunbeds or lamps, run the highest risk of developing skin cancer. Some countries have banned sunbeds and others, such as the UK, have passed laws to restrict who can use them. Over exposure to UV, from the sun or sunbeds, can also lead to cataracts."
        },
        {
            "heading": 2,
            "text": "Skin type matters"
        },
        {
            "text": "Although we can all burn from over-exposure to UV, how quickly we’re affected depends on our skin type. People with darker skin can tolerate more than those with lighter skin types. When it comes to estimating how much UV exposure you can take, probably the best advice is to know your own skin."
        },
        {
            "heading": 2,
            "text": "You can still burn on a cloudy day"
        },
        {
            "text": "Although clouds can absorb some incoming UV, they don’t protect you from getting burnt and damaging your skin."
        },
        {
            "heading": 2,
            "text": "We can acclimatise to UV"
        },
        {
            "text": "It takes a while for the body to acclimatise to UV exposures. Most of us get most of our UV exposure during the late spring and summer. But occasionally we get higher UV levels early in the year in the UK. We burn more easily as the seasons start to change because from autumn until spring we spend more time indoors and the UV from the sun is generally weaker. A burst of UV early in the season, or perhaps in the winter, will cause us to burn more easily."
        },
        {
            "heading": 2,
            "text": "It’s possible to measure UV"
        },
        {
            "text": "The World Health Organization UV index measures levels of UV radiation and indicates when you might need to use sun protection. The UV Index indicates the degree of risk of sunburn and runs from 1 to 20. The highest level recorded in the UK is usually 8, but only in Southern England. In sunnier climates, the UV Index may be much higher than experienced in the UK, even if the temperature is relatively low."
        },
        {
            "heading": 2,
            "text": "Check UV levels and take action"
        },
        {
            "text": "Real time UV measurements across the UK are available on the UK Air website. The data is provided by UKHSA and the University of Manchester."
        },
        {
            "heading": 2,
            "text": "Some UV is healthy"
        },
        {
            "text": "Some UV exposure is healthy because it helps our bodies make Vitamin D – necessary for strong and healthy bones and teeth. The amount of time you need in the sun to make enough Vitamin D is different for everyone, but most people will make enough vitamin D if they have a short daily period of sun exposure around midday without sunscreen during the summer months."
        }
    ]
}