{
    "url": "https://socialcareinspection.blog.gov.uk/2025/06/27/why-your-registration-application-may-be-taking-longer-than-usual/",
    "title": "Why your registration application may be taking longer than usual",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes",
        "supported accommodation"
    ],
    "pub_date": "2025-06-27T09:29:54+01:00",
    "content": [
        {
            "text": "We want to address some concerns in the sector about registrations for children’s homes and supported accommodation taking longer than normal."
        },
        {
            "text": "First, I want to thank you for applying to register (whether you already have or are intending to) and reassure you that delays in the registration process aren’t necessarily down to any issues with your application."
        },
        {
            "heading": 2,
            "text": "Number of applications"
        },
        {
            "text": "We’re experiencing the highest ever level of applications to register a children’s home at the moment. The rate of applications has been growing steadily – the number of applications we received in the past year is nearly double the number for the previous year. So although we’re registering more homes, we’re not keeping pace with the increase in applications."
        },
        {
            "text": "For supported accommodation, which we began regulating in 2023, the number of applications has now topped 1,600 – far more than expected. We’ve been continuing to receive new applications at the rate of approximately 30 each month, and sometimes even more than this. We have now registered over 1,000 supported accommodation providers, but approximately 500 are still waiting for a decision on their application."
        },
        {
            "text": "We’re doing our best to get through all applications as quickly as possible while maintaining the standards of scrutiny you would expect us to meet."
        },
        {
            "heading": 2,
            "text": "The right provision in the right places"
        },
        {
            "text": "One consequence of this volume of applications is the concern that the ‘market’ is becoming even more saturated in some regions: that there is more provision becoming available than is needed. Crucially, proposed provision is not always of the right type or in the right location to meet local need. This results in too many children living far from home and in situations that don’t necessarily provide the type of care they need."
        },
        {
            "text": "In our experience, the best applications are firmly based on strong liaison with commissioning local authorities, and a detailed understanding of local need and how the potential provision is going to meet that need."
        },
        {
            "text": "Similarly, we’ve seen how the best commissioners continue to work with local providers to make sure that children are getting the quality care and support that they deserve and that the services can adapt to changing needs. That’s been very impressive but those types of relationships between commissioners and providers have not always been evident."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We continue to discuss with the Department for Education how we can better prioritise registration applications. We want to focus on those where there is a clear need for provision and the application shows that they will be able to meet that need. This will ensure that we use our resources wisely in the best interests of children."
        },
        {
            "text": "In the meantime, we will keep processing applications as quickly as possible. Unfortunately, the exceptionally high volume of new registration applications, particularly in children’s homes and supported accommodation (residential family centres are also increasing significantly), means that it is likely to take several months to reach a decision on new applications, far beyond our usual timescales."
        },
        {
            "text": "We’re making the situation clear to new applicants in our guidance. In order to make sure your application can go through as quickly as possible, we urge you to make sure you get the application right first time, to reduce the chance of further delays. You might find it useful to read ‘applying to register a children’s home: top tips’."
        }
    ]
}