{
    "url": "https://hmlandregistry.blog.gov.uk/2025/03/26/asking-for-guidance-part-4-a-case-of-distribution-in-kind/",
    "title": "Asking for guidance part 4: A case of distribution in kind",
    "authors": [
        "Mike Harrison, Senior Caseworker, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2025-03-26T13:05:02+00:00",
    "content": [
        {
            "text": "Approximately 65% of complex applications receive requisitions. This is because some points are hard to anticipate in advance and we are keen to work directly with customers to ensure everything is in place before we receive the application.  "
        },
        {
            "text": "Our Ask for Guidance service provides expert assistance with complex applications, help to navigate through the registry processes, and support in avoiding unnecessary errors before lodging an application. Handling issues before submission saves a lot of back-and-forth later.  "
        },
        {
            "text": "But customers often ask: what constitutes a ‘complex application’? In this series, we look at real examples of thorny issues that our experts have resolved. Previously, we explored unique restrictions, historic charges and a caution relating to tithes. "
        },
        {
            "text": "In this case, we’ll explore distribution in specie.   "
        },
        {
            "heading": 2,
            "text": "The question"
        },
        {
            "text": "A Professional Support Lawyer (PSL) got in touch with us asking for guidance.  "
        },
        {
            "text": "Their client, a company, was entering into a distribution in specie at market value; which box should they check in the consideration panel of the TR1?  "
        },
        {
            "text": "A distribution in specie refers to allocation of non-cash assets in their existing form - for example property, shares or equipment, as opposed to selling the assets and apportioning the cash proceeds of sale.  "
        },
        {
            "text": "Generally, in specie distributions are made when cash isn’t available or because allocating the physical asset would be more advantageous than distributing the cash. "
        },
        {
            "text": "This specific point is something we’d want to help with via the Ask for Guidance service. It isn't covered in our practice guides, although section 4.2 of practice guide 35 deals with distributions in specie resulting from a company’s liquidation. In this case, however, the company had sufficient reserves.  "
        },
        {
            "text": "So, how should panel 8 of the TR1 be completed? "
        },
        {
            "heading": 2,
            "text": "Our answer"
        },
        {
            "text": "In these circumstances, panel 8 of the TR1 is usually completed with: “This Transfer gives effect to the payment of a dividend in specie”. "
        },
        {
            "text": "It is also important to lodge evidence of the company’s power to make the transfer. This is likely to be within its articles of association, or by way of a special resolution, or by minutes of a board meeting, a copy of which should be uploaded with the application. "
        },
        {
            "heading": 2,
            "text": "What about the fee?"
        },
        {
            "text": "When it comes to transfers that occur by way of dividends or distributions in specie, the fee payable depends on the circumstances. "
        },
        {
            "text": "A Scale 1 fee applies if the transfer satisfies a debt in respect of a dividend due to the shareholder. To assess the correct fee, the applicant should check the minutes of the Board Meeting to confirm the exact circumstance of the distribution in specie. "
        },
        {
            "text": "In other cases, such as a transfer not on sale and based on the certified value of the estate, a Scale 2 fee applies. "
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "For more information about corporate insolvency, see our practice guide 35. "
        },
        {
            "text": "To access our specialist support services, including Ask for Guidance, Application Management, Developing Estates, large-scale applications and large-scale voluntary first registrations, head to our Specialist Support Services hub on GOV.UK."
        },
        {
            "heading": 2,
            "text": "If in doubt..."
        },
        {
            "text": "This blog series is intended to show you how these kinds of applications can be handled, as well as the types of application that could be referred to our Ask for Guidance team.   "
        },
        {
            "text": "If you have a tricky question about a complex application that you’re about to submit, and you can’t find the answer in our practice guides, we would encourage you to use our Ask for Guidance service. If we’re able to point you to existing guidance then we will, otherwise we will walk you through your particular issue and ensure your application is ready to submit. "
        },
        {
            "text": "For less complex and unusual queries, visit our training hub on GOV.UK for a wealth of guidance and resources, including our practice guides. "
        }
    ]
}