{
    "url": "https://mojdigital.blog.gov.uk/2025/03/26/from-inspiration-to-action-driving-gender-diversity-in-engineering/",
    "title": "From Inspiration to Action: Driving Gender Diversity in Engineering",
    "authors": [
        "Natalie Wood"
    ],
    "categories": [
        "a great place to work",
        "Diversity and Inclusion",
        "engineering",
        "gender equality",
        "Our People",
        "representation matters",
        "software development",
        "Women in Tech"
    ],
    "pub_date": "2025-03-26T10:43:30+01:00",
    "content": [
        {
            "text": "Before joining the Civil Service, I did science outreach, demonstrating different robots to school children and explaining how we program them. We showed that they too could grow up to do programming and themselves as a career. There were so many girls who had clearly never considered doing anything technical before, and it was so exciting to show them a new path and help them realise the possibilities before them."
        },
        {
            "text": "As a woman in software development, inspiring the next generation of female engineers has always meant a lot to me. Throughout my career, it has been rare to work in a team with another female engineer, and it’s clear that women remain significantly underrepresented in this field."
        },
        {
            "text": "This month we celebrated International Women’s Day, and it made me reflect on the representation of women across engineering roles in Justice Digital. "
        },
        {
            "text": "Women are underrepresented in software development. According to a Diversity in Tech report in 2024, only 20% of software developers in the UK were women or non-binary.  At Justice Digital in 2023 our representation stood below this average at 17%."
        },
        {
            "text": "This lack of representation is particularly surprising given the strong history of women in computing. Back in the 19th century, Ada Lovelace theorised how a computer could be programmed to solve complex calculations, essentially making her the first-ever computer programmer. The original “computers” were, in fact, women: human mathematicians who analysed data using mechanical calculators."
        },
        {
            "text": "The theme for this year's International Women’s Day was ‘Accelerate Action’. "
        },
        {
            "text": "An action that I have taken recently with our Head of Engineering and Rosie, another lead developer, is to create a working group within Justice Digital with the ambitious goal of doubling the number of women in our engineering roles (which includes software developers, DevOps, technical architects, and Quality Assurance testers) over the next three years."
        },
        {
            "text": "This working group includes some wonderful people in a variety of roles across all teams in Justice Digital. We will work to come up with ways to improve the representation of women in engineering by looking at how we can improve recruitment and retention, how to better support our women, and see how we can contribute to the wider community of women in tech."
        },
        {
            "text": "At Justice Digital we have committed to driving diversity, equity, and inclusion as a key part of our long term Talent Plan. Our dedicated working group plays an essential role in bringing these ambitions to life, and it has the full support of our entire organisation."
        },
        {
            "text": "There is no question about how valuable diversity and inclusion are in a modern organisation. We succeed when we bring together different voices and ideas, and we create a fairer workplace."
        },
        {
            "text": "My hope is that the young girls who were inspired to consider programming and computing as a career will find Justice Digital to be an attractive and fulfilling workplace for the women they become. Have you worked to improve diversity in engineering? I would love to hear your ideas and suggestions on how we can make this a reality. I can be contacted at natalie.wood@digital.justice.gov.uk"
        }
    ]
}