{
    "url": "https://naturalengland.blog.gov.uk/2025/03/26/using-species-conservation-translocations-as-a-tool-for-nature-recovery/",
    "title": "Using species conservation translocations as a tool for nature recovery",
    "authors": [
        "Delphine Pouget",
        "Jeremy Sabel"
    ],
    "categories": [
        "Biodiversity",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Species re-introductions",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-03-26T09:52:14+00:00",
    "content": [
        {
            "text": "By Delphine Pouget and Jeremy Sabel, Natural England’s Species Recovery & Reintroductions Team"
        },
        {
            "text": "Natural England recognises that species translocations can be an important tool in nature recovery."
        },
        {
            "text": "Natural England’s ambition is to promote and enable high quality conservation translocation projects to support restoration of natural processes and nature recovery. This blog is part of a series providing advice on this topic:"
        },
        {
            "text": "Conservation translocations are the deliberate movement and release of organisms where the primary objective is a measurable conservation benefit."
        },
        {
            "text": "Interest in conservation translocations as a tool for nature recovery has grown in recent years:"
        },
        {
            "text": "Species translocation can revive ecosystems and inspire the public imagination and hope for the future. However, not all translocations are universally supported by all sectors of society.  "
        },
        {
            "text": "Natural England’s roles"
        },
        {
            "text": "Natural England has distinct roles with respect to conservation translocations:"
        },
        {
            "text": "As a regulator we aim to be fair and objective, providing clear guidance on the information needed, and judging the proposal based on the evidence provided. This applies to all projects, including those led by Natural England. The level of evidence required will vary depending on the nature of the proposal. Proposals that seek to restore ecosystem function at a landscape scale or that involve species where the potential impact of their release is not fully understood, are likely to require significant evidence gathering (biological, social and economic) before proceeding. However, we strive to balance the need for sufficient evidence and the risk of inaction."
        },
        {
            "text": "Priorities"
        },
        {
            "text": "When considering a species recovery project, stakeholders should consider whether the species is a local priority (e.g. by engaging with their Local Nature Recovery Strategy) and whether a conservation translocation is a necessary component."
        },
        {
            "text": "Natural England may prioritise a conservation translocation where:"
        },
        {
            "heading": 2,
            "text": "The legality of translocating species"
        },
        {
            "text": "Controls on releasing animals do not distinguish between native and non-native species. Section 14 of the Wildlife and Countryside Act 1981 prohibits the release of any animal ‘of a kind’ that is not either ‘ordinarily resident’ or a ‘regular visitor’. It is also an offence to release into the wild any animal or plant listed on Schedule 9. The schedule lists certain species that are ordinarily resident or regular visitors but whose release needs to be controlled, including certain native species (e.g. barn owls).  The release of a former native species is therefore controlled because it involves a kind of animal that is no longer ordinarily resident. Guidance to help interpret these terms can be found on GOV.UK."
        },
        {
            "text": "To ensure unique sub-species and any other distinctive, locally adapted populations are safeguarded, Natural England considers that organisms of a species sourced from populations outside Britain are of a different ‘kind’ to those belonging to British populations, unless there is evidence that they are indistinguishable (e.g. from perspectives of genetics, disease risk and behaviour). Releases of such animals will therefore require a licence unless it is agreed by Natural England that a licence is unnecessary."
        },
        {
            "text": "Native species"
        },
        {
            "text": "The term native species is often used to describe species which naturally occur or have naturally occurred in the past, in England. Due to the increasing number of projects seeking to translocate species, we have provided a definition to explain what is and is not native."
        },
        {
            "text": "Natural England considers that a native species to Great Britain is a species that has:"
        },
        {
            "text": "For further advice relating to conservation translocations see more on GOV.UK."
        },
        {
            "text": "Conservation Translocations"
        },
        {
            "text": "There are four types of conservation translocation: reintroduction, reinforcement, assisted colonisation and ecological replacement which are explained in our guidance on GOV.UK. In this blog, we share our latest thinking on assisted colonisation and ecological replacement."
        },
        {
            "heading": 2,
            "text": "Assisted colonisation"
        },
        {
            "text": "Habitat and climate change are the two most important factors driving changes in the broad distribution and abundance of many species. Some species will be able to track the pace of change through shifts in their distribution but many others, due to poor mobility, the fragmented nature of their habitat, or other barriers to dispersal, will not.  "
        },
        {
            "text": "Assisted colonisation provides one possible option to support species unable to track the pace of change, by moving them to new locations within, or outside their current natural range, where the climatic or ecological conditions are predicted to become increasingly favourable over time."
        },
        {
            "text": "Assisted colonisation represents the more interventionist end of the conservation translocation spectrum and should only be considered if other interventions have been tried or considered and discounted. Decision support tools have been developed to help inform the choice of responses, including where assisted colonisation would be appropriate."
        },
        {
            "heading": 2,
            "text": "Ecological replacement "
        },
        {
            "text": "Natural England has not developed criteria for identifying when an ecological replacement may be a suitable option, other than using domesticated pigs, cattle or horses to replicate naturalistic grazing by wild native species. As with any translocation project restoring a lost population, it is important to understand why the species was lost in the past and whether conditions are suitable for the replacement. When you apply for a licence for any ecological replacement project you will need to show that you have considered the following:"
        },
        {
            "text": "Natural England’s role in promoting and enabling responsible conservation translocation projects"
        },
        {
            "text": "The English Code helps planning and implementation of responsible projects. Projects should not rush to decide to translocate a species because a conservation translocation is not suitable for the conservation needs of every species. There may be more effective (e.g. lower cost and risk) alternatives, and it is important build support for a translocation among stakeholders and local communities."
        },
        {
            "text": "Engagement is a key requirement of the Code, and Natural England welcomes and encourages individuals and organisations with prospective conservation translocation proposals to engage with us and with other stakeholders as early as possible."
        },
        {
            "text": "Further information"
        },
        {
            "text": "If you would like to discuss a conservation translocation, please contact Natural England at SpeciesRecoveryReintroduction@naturalengland.org.uk"
        },
        {
            "text": "The English code is supplemented by practical guidance on licensing and on planning projects as well as case studies to help projects learn from past experience. "
        },
        {
            "text": "Natural England recognises the importance of monitoring, the need to be adaptive by learning from past successes and failures and sharing results and outcomes."
        },
        {
            "text": "The England Species Reintroductions Taskforce intends to develop an online hub and database for practitioners to access information about past and existing conservation translocations."
        },
        {
            "text": "Natural England will publish a second volume of case studies in due course. If you have any case studies that you wish to contribute, please get in touch."
        }
    ]
}