{
    "url": "https://defrafarming.blog.gov.uk/2025/03/26/using-integrated-pest-management-to-grow-healthy-crops-and-support-nature/",
    "title": "Using integrated pest management to grow healthy crops and support nature ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2025-03-26T13:00:18+00:00",
    "content": [
        {
            "text": "The recently published UK National Action Plan for Pesticides outlines how government will support farmers to manage pests, weeds and diseases sustainably, minimising the risks and impacts on human health and the environment from pesticides, whilst supporting food security.  "
        },
        {
            "text": "At the heart of this plan is integrated pest management (IPM) and sustainable crop protection. "
        },
        {
            "text": "IPM is a sustainable approach to preventing and managing pests, weeds and diseases on your land. It can help strengthen both food production and farm resilience. "
        },
        {
            "text": "IPM guidance is available on GOV.UK. It outlines the aims and principles and includes a plan template with crop-specific guidance to help you consider different control measures and assess and evaluate your IPM approach.  "
        },
        {
            "text": "The guidance also includes a decision support tool to help you make informed on-farm decisions. "
        },
        {
            "text": "Soon you will be able to apply for grants to access equipment, technology and take part in innovative farm-led trials which can help you to reduce pesticide use.  "
        },
        {
            "text": "You can also join the free ADAS IPM knowledge-sharing network (IPM Net) which can help you review your IPM strategy and identify opportunities to improve the efficiency, sustainability and profitability of your farm. "
        },
        {
            "text": "Many farmers are already using IPM techniques. We spoke to a few of them, as well as an agronomist, about how they use IPM to grow healthy crops, support their businesses and help nature thrive. "
        },
        {
            "heading": 2,
            "text": "Striking the balance to farm with nature  "
        },
        {
            "text": "Establishing flower-rich grass margins, blocks, or in-field strips close to cropped areas can provide habitat for natural crop pest predators. They can support wild pollinators including bumblebees, butterflies, hoverflies and farmland birds.   "
        },
        {
            "text": "Jonathan Boaz, an award-winning farmer for soil management from Worcestershire, shares how he has been using IPM for several years and what inspired him to start."
        },
        {
            "heading": 2,
            "text": "Small gains, big wins  "
        },
        {
            "text": "David Bell, a farmer and Voluntary Initiative (VI) Champion and new UK Chair of the VI, from Upper Magus Farm in East Fife, shares his approach to IPM.  "
        },
        {
            "heading": 2,
            "text": "An agronomist's view "
        },
        {
            "text": "Sean Sparling, a multi-award-winning independent agronomist shares his views on what makes IPM successful.  "
        },
        {
            "heading": 2,
            "text": "Using IPM to improve soil health   "
        },
        {
            "text": "David Blacker from Shipton, North Yorkshire shares how he uses IPM approaches to farm combinable crops.  "
        },
        {
            "text": "If you'd like to share your tips and experiences with integrated pest management, please do leave a comment below. "
        },
        {
            "text": "To receive an email notification whenever we publish a new post, subscribe to the Farming blog."
        }
    ]
}