{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/08/coverage-on-the-governments-planning-reforms/",
    "title": "Coverage on the government’s planning reforms",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Planning"
    ],
    "pub_date": "2025-07-08T11:06:14+01:00",
    "content": [
        {
            "text": "Reporting in a national paper today criticises the government’s Planning and Infrastructure Bill, alleging double standards from Ministers in relation to previous decisions on development in their constituencies."
        },
        {
            "text": "This is not the case. The landmark Planning and Infrastructure Bill is one of the ways the government is working to deliver 1.5 million homes this Parliament and it will help streamline planning decisions to build more homes, but not at the expense of local say."
        },
        {
            "text": "Residents will not lose the opportunity to make representations on a planning application and people will still be able to object to individual applications in the way they can now – this will not change. The reforms being brought forward are designed to help speed up local planning decision making, maximise the use of professional skills and judgement of trained planners, and focus the time of elected councillors on the most significant or controversial applications."
        },
        {
            "text": "Crucially, the Bill will also ensure that vital protections for the environment remain in place and through a more strategic approach we can deliver more for nature and not less."
        },
        {
            "text": "Current rules in the National Planning Policy Framework are clear that development resulting in the loss or deterioration or irreplaceable habitats, including ancient woodland and ancient or veteran trees, should be refused. This will not change through the Planning and Infrastructure Bill."
        },
        {
            "text": "It’s also important to recognise that local authorities are ultimately responsible for determining the scale and location of new development in their area, ensuring that new homes are built where they are most needed."
        },
        {
            "text": "The government’s planning overhaul so far has reversed anti-supply measures which will drive UK housebuilding to its highest level in over 40 years."
        },
        {
            "text": "A Ministry of Housing, Communities and Local Government spokesperson said:"
        },
        {
            "text": "“We have inherited the worst housing crisis in living memory and all areas must play their part as we deliver 1.5 million homes as part of our Plan for Change. “We will work in partnership with councils so we can deliver 1.5 million homes, while ensuring that we also create the vital infrastructure that people need in their communities.”"
        }
    ]
}