{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/08/coverage-of-the-employment-rights-bill/",
    "title": "Coverage of the Employment Rights Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2025-07-08T14:23:56+01:00",
    "content": [
        {
            "text": "Following new amendments to the Employment Rights Bill, there has been ongoing positive coverage highlighting the package of workers’ rights reforms, spearheaded by the Deputy Prime Minister Angela Rayner with the Department for Business and Trade."
        },
        {
            "text": "Today’s newspapers prominently report that the Bill will ban non-disclosure agreements used by employers to stop employees from talking about their experiences of harassment and abuse at work. The story is on the front page of today’s Guardian with an editorial hailing the change. Elsewhere it is reported by BBC online, Mirror (p2), Financial Times (p2), Telegraph (p2), Daily Mail (p4), Sky News, Times (p37, James Hurley), LBC with copy running in the Independent and regional media including the Evening Standard. The i Paper also runs an exclusive interview with the Employment Rights Minister Justin Madders."
        },
        {
            "text": "Zelda Perkins, founder of the campaign group Can’t Buy My Silence and former PA to Harvey Weinstein, is quoted across coverage and in an interview with BBC Radio 4’s Today Programme describing the ban as “a huge milestone” after years of victims being silenced and praised the government for showing it has “listened and understood the abuse of power taking place”."
        },
        {
            "text": "There is also widespread positive coverage of bereavement leave being extended to those who experience pregnancy loss before 24 weeks - a compassionate change acknowledging that pregnancy loss grief can be just as profound at any stage. This story ran widely across print, online and national broadcast all day yesterday, with BBC News featuring interviews with campaigners such as Myleene Klass who has an MBE for her services to miscarriage awareness. She told the BBC the change was a “marker for all of the families who have been ignored” as a topic often “swept under the carpet”."
        },
        {
            "text": "Positive comments by the Miscarriage Association’s Chief Executive Vicki Robinson also run widely in reports, calling the change “a hugely important step that acknowledges the often very significant impact of pre-24-week loss” - and for partners as well. Other outlets which positively report the news, include Women’s Health, Glamour and Stylist who said the government has now taken a major step towards making its Every Loss Counts campaign a reality. Elsewhere, positive coverage featured in the Guardian (p6), Times (p4 & p37), The i Paper (p6), ITV News, Metro (p6), LBC and trade and regional media picked up from PA copy."
        },
        {
            "text": "Elsewhere, the Daily Mirror (p6)reports the government’s action to strengthen new laws banning fire, rehire and replace tactics, by closing a loophole ensuring agency staff can’t be used again to replace sacked employees after they refused worse terms and conditions. The Deputy PM also exclusively spoke to the paper (p6) about her mission to Make Work Pay and tackle exploitative employer practices like these, which largely affect the lowest paid workers."
        },
        {
            "text": "See announcements here:"
        }
    ]
}