{
    "url": "https://defrafarming.blog.gov.uk/2025/07/08/one-year-on-highlights-and-milestones-of-the-agricultural-supply-chain-adjudicator/",
    "title": "One year on: highlights and milestones of the Agricultural Supply Chain Adjudicator",
    "authors": [
        "Richard Thompson"
    ],
    "categories": [
        "Guest post",
        "Supply chain",
        "Things we're doing"
    ],
    "pub_date": "2025-07-08T12:18:44+01:00",
    "content": [
        {
            "text": "It’s been one year since I took on the role of Agricultural Supply Chain Adjudicator and looking back, we’ve already come a long way. "
        },
        {
            "text": "Over the past year, my team and I have been engaging with producers, processors, retailers and trade bodies across the UK to build visibility, trust and collaboration in the dairy supply chain. "
        },
        {
            "text": "These conversations have been essential to shaping how we implement the Fair Dealing Obligations (Milk) Regulations, which came into force earlier this year. "
        },
        {
            "text": "The regulations give dairy farmers new legal rights, including the right to clear contracts, the right to negotiate, and protection from unilateral changes and retrospective penalties. "
        },
        {
            "text": "My role is to make sure those rights are upheld. As Adjudicator, I provide independent oversight and can act on complaints where there are concerns about non-compliance. "
        },
        {
            "text": "Listening to people across the sector has helped me understand the very real challenges they face, and the opportunities that greater fairness and transparency can unlock. "
        },
        {
            "text": "This first year has laid strong foundations, and I remain committed to working with the sector to ensure the new rules are understood, embedded and deliver the impact they were designed for. "
        },
        {
            "text": "In this, my second Farming blog post, I’ll share a summary of our milestones from the past 12 months.  "
        },
        {
            "heading": 2,
            "text": "Building understanding and support"
        },
        {
            "text": "As well as building new relationships across the sector, we’ve developed a range of resources to help people better understand my role as ASCA, how my office operates, and how to raise concerns under the new regulations. "
        },
        {
            "text": "This includes clear guidance on what types of complaints I can investigate, how to submit one, what to expect from the process, and how we handle confidentiality and whistleblowing.  "
        },
        {
            "heading": 2,
            "text": "The end of the transitional period"
        },
        {
            "text": "The second milestone is just around the corner. From tomorrow, 9 July 2025, the 12-month transitional period in the Fair Dealing Obligations (Milk) Regulations 2024 (FDOM24) will come to an end. "
        },
        {
            "text": "This marks an important moment for both the industry and my office. From that date, the new rules will apply not only to contracts signed after 9 July 2024, but also to all existing milk purchase agreements made before the regulations came into force. "
        },
        {
            "text": "In other words, the regulations will now cover the entire UK cow’s milk sector. "
        },
        {
            "text": "Over the past year, much of our work has focused on helping the industry prepare and supporting the implementation of the new rules. From this July, those rules are fully in effect. "
        },
        {
            "text": "Everyone involved in buying or selling milk should now be confident about their rights and responsibilities under the law and know where to go if they have concerns. "
        },
        {
            "heading": 2,
            "text": "Extending fair dealing to the pig sector"
        },
        {
            "text": "The third important milestone is that the Fair Dealing Regulations for the pig sector have now been granted Parliamentary approval. This is a significant step, as it shows the government’s commitment to broader reform beyond the dairy industry."
        },
        {
            "text": "The pig sector, which has faced considerable challenges including price pressures and supply chain uncertainty, will now benefit from clear rules designed to bring greater fairness and protection for producers. "
        },
        {
            "text": "I’ll share more about this in an upcoming post, so watch this space. You can subscribe to the Farming blog for a notification whenever a post is published.  "
        },
        {
            "heading": 2,
            "text": "Sector survey"
        },
        {
            "text": "To understand how familiar people are with the Fair Dealing Obligations (Milk) Regulations 2024, and with my role as ASCA, we recently ran a sector-wide survey. "
        },
        {
            "text": "It was encouraging to see that awareness is growing. That said, I know that trust, confidence and understanding in a new role take time to build. "
        },
        {
            "text": "We’ll keep looking for new ways to share information about how our office works and how we can support the industry. If you have ideas on how we could do this better, I’d be very glad to hear them. "
        },
        {
            "text": "Another finding from the survey, one that reflects what I’ve been hearing directly from producers and their representatives, is that some people are still worried about the consequences of raising a complaint."
        },
        {
            "text": "There’s a concern that speaking up could affect their relationships or their business. It’s disappointing, and concerning, that some producers may not yet feel safe or supported enough to raise issues about how they’re being treated. "
        },
        {
            "text": "To help address this, we held our first ever Milk Roundtable in May. This brought together our office and a range of stakeholders from across the supply chain. "
        },
        {
            "text": "We discussed how the regulations are bedding in and how compliance is progressing, but we also focused on how we can improve producer–purchaser relationships. A major part of that conversation was about removing the fear from raising concerns when things aren’t working as they should. "
        },
        {
            "text": "We left the session with a shared commitment to develop a sector-led set of Principles of Conduct. I fully support this and look forward to seeing how that work develops. "
        },
        {
            "heading": 2,
            "text": "Get in touch  "
        },
        {
            "text": "In the meantime, we have created a new mailbox through which anyone can raise a concern with ASCA that will be treated in confidence. "
        },
        {
            "text": "While I may not be able to pursue a formal investigation without a formal complaint, hearing about the issues faced by producers is critical. This feedback will help me shape how my office works in the future. "
        },
        {
            "text": "To raise a concern which will be treated in confidence, please do so by using the dedicated mailbox: asca-in-confidence@defra.gov.uk "
        },
        {
            "text": "I hope you have found this post useful. I look forward to working with you and hearing your perspectives on milk purchase contracts.   "
        },
        {
            "text": "If you have any questions after reading this post or the guidance available on GOV.UK please do leave a comment below.  "
        },
        {
            "text": "Or, if you would like to get in touch, please email the ASCA mailbox: asca@defra.gov.uk . "
        }
    ]
}