{
    "url": "https://insidehmcts.blog.gov.uk/2025/07/08/opening-the-door-to-our-legal-futures/",
    "title": "Opening the door to our legal futures ",
    "authors": [
        "Josie Stoneman, Senior Communications and Engagement Manager"
    ],
    "categories": [
        "General",
        "Training and support",
        "User experience and research"
    ],
    "pub_date": "2025-07-08T13:23:07+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Over the last few months, more than 3,000 students from 195 schools have taken part in the Magistrates’ Mock Trial Competition, giving them a first-hand insight into the justice system and helping them to understand how the law touches every aspect of their lives.  "
        },
        {
            "text": "Established in 1991 by the national education charity Young Citizens, the Magistrates’ Mock Trial Competition introduces young people aged 12-14 to the legal system as they take on the roles of those involved in a magistrates' court trial - including lawyers, witnesses, legal advisers and magistrates. The competition helps students to develop key skills like critical thinking, teamwork and public speaking as they use specially written criminal cases to prepare legal arguments to prosecute or defend in a real courtroom setting. "
        },
        {
            "text": "Ruvimbo Gore is a Law (LLM,LLB) student at the University of Law who judged the students’ participation in the regional finals. She explained the importance of this: “I think participating in this programme can open up the students' perspectives of the law in practice. Academia is always quite rigorous whereas when we’re doing practical work, we’re able to put what we’ve learnt into practice, so it makes more sense. Sometimes you don’t fully understand what you’re learning until you do it.” "
        },
        {
            "text": "Gina Galloway, Delivery Manager for the Court Clerks at Croydon Crown Court, who has been involved with the competition for many years, added: \"I think coming into the courtroom straight away puts a reality into it for the pupils as it's different to a schoolroom.” "
        },
        {
            "heading": 2,
            "text": "Building skills and confidence "
        },
        {
            "text": "Benjamin, a student who acted as a defendant during the competition, described the experience: \"It's probably the most stressful thing I've ever done, but it's really boosted my confidence quite a lot. My impression of working in the justice system from this event is that every role is so different. Being a lawyer is very different from being a magistrate but it's all very professional.\" "
        },
        {
            "text": "Dawn Gibbons, a Justice of the Peace Magistrate for south-west London who served as lead magistrate at the event, spoke about the importance of representation: \"The bridge between academia and the justice system isn't as wide as it was when I was at school. You can now see people that look like you – whether male, female, disabled, black or brown, all the protected characteristics. That's open justice, anybody should be able to apply and fit in. We are a judiciary for the 21st century.”  "
        },
        {
            "heading": 2,
            "text": "Inspiring the next generation "
        },
        {
            "text": "This year’s competition saw pupils from Bishopston Comprehensive School in Wales win the top prize at the London regional final, held at Croydon Crown Court on 14 June.  "
        },
        {
            "text": "Polly, a student from Bishopston who acted as lead prosecution lawyer, said: \"It's really great because we have never done this before as Bishopton School, so to get to the final and win it is just great. I think this experience will definitely help inspire some people to think about different careers in law as aside from a lawyer, there's roles such as magistrate and legal adviser.\" "
        },
        {
            "text": "Lord Ponsonby of Shulbrede, Parliamentary Under-Secretary of State, who volunteered as a lead magistrate on the day, highlighted his own experience in entering the justice system: “My background wasn’t in law at all. I was an engineer during my professional career, but I decided to volunteer as a magistrate and did this once every two weeks over 20 years. I’ve learnt that there are many different parts to criminal justice that are accessible and many different ways of moving through those career opportunities. It goes way beyond being a lawyer, barrister or judge and certainly my perception is that people really enjoy those careers and find them really satisfying.\" "
        },
        {
            "text": "The partnership between HMCTS and Young Citizens has seen thousands of students participate in mock trials competitions over the years. HMCTS provides funding and venues, while staff volunteer their time to help organise the events. This forms part of HMCTS' wider outreach programme to raise awareness of different roles and career opportunities across the justice system, making legal careers more accessible and appealing to young people from all backgrounds. "
        },
        {
            "text": "Ashley Hodges, Chief Executive of Young Citizens said: “All citizens should understand how our institutions work and the role they play in their everyday lives. Unfortunately, these powerful systems are often shrouded in mystery, and youth trust in our leaders is at an all-time low. That's why we need to inform and involve young people through immersive programmes like the Mock Trial Competitions. They are a chance for students to acquire knowledge and flex their skills in an inspiring and welcoming environment, hopefully sparking the next generation of legal professionals.” "
        },
        {
            "text": "The Magistrates’ Court and Bar Mock Trial Competitions 2025/26 will take place from November 2025 to June 2026. You can read more about how you can volunteer and support here."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Agor y drws i’n dyfodol ym maes y gyfraith"
        },
        {
            "text": "Dros yr ychydig fisoedd diwethaf, mae mwy na 3,000 o fyfyrwyr o 195 o ysgolion wedi cymryd rhan yng Nghystadleuaeth Ffug Dreial y Llys Ynadon, gan roi cipolwg uniongyrchol iddynt ar y system gyfiawnder a’u helpu i ddeall sut mae’r gyfraith yn cyffwrdd â phob agwedd ar eu bywydau."
        },
        {
            "text": "Wedi’i sefydlu yn 1991 gan yr elusen addysg genedlaethol Young Citizens, mae Cystadleuaeth Ffug Dreial y Llys Ynadon yn cyflwyno pobl ifanc 12-14 oed i’r system gyfreithiol wrth iddynt ymgymryd â rolau’r rhai sy’n cymryd rhan mewn treial llys ynadon – gan gynnwys cyfreithwyr, tystion, cynghorwyr cyfreithiol ac ynadon. Mae’r gystadleuaeth yn helpu myfyrwyr i ddatblygu sgiliau allweddol fel meddwl yn feirniadol, gwaith tîm a siarad yn gyhoeddus wrth iddynt ddefnyddio achosion troseddol wedi’u hysgrifennu’n arbennig i baratoi dadleuon cyfreithiol i erlyn neu amddiffyn mewn lleoliad llys go iawn."
        },
        {
            "text": "Mae Ruvimbo Gore yn fyfyriwr y Gyfraith (LLM,LLB) ym Mhrifysgol y Gyfraith a feirniadodd gyfranogiad y myfyrwyr yn y rowndiau terfynol rhanbarthol. Esboniodd bwysigrwydd hyn: “Rwy’n credu y gall cymryd rhan yn y rhaglen hon ehangu safbwyntiau’r myfyrwyr o’r gyfraith ar waith. Mae’r byd academaidd bob amser yn eithaf trylwyr, ond pan fyddwn ni’n gwneud gwaith ymarferol, rydym ni’n gallu rhoi’r hyn rydyn ni wedi’i ddysgu ar waith, felly mae’n gwneud mwy o synnwyr. Weithiau dydych chi ddim yn deall yn llawn yr hyn rydych chi’n ei ddysgu nes i chi ei wneud.”"
        },
        {
            "text": "Ychwanegodd Gina Galloway, Rheolwr Cyflawni ar gyfer Clercod y Llys yn Llys y Goron Croydon, sydd wedi bod yn rhan o’r gystadleuaeth ers blynyddoedd lawer: “Rwy’n credu bod dod i mewn i’r llys yn rhoi ymdeimlad o realiti i’r disgyblion yn syth, gan ei fod yn wahanol i ystafell ddosbarth.”"
        },
        {
            "heading": 2,
            "text": "Meithrin sgiliau a hyder"
        },
        {
            "text": "Disgrifiodd Benjamin, myfyriwr a oedd yn gweithredu fel diffynnydd yn ystod y gystadleuaeth, y profiad: “Mae’n debyg mai dyma’r peth mwyaf llawn straen rydw i erioed wedi’i wneud, ond mae wedi rhoi hwb mawr i’m hyder. Fy argraff o weithio yn y system gyfiawnder o’r digwyddiad hwn yw bod pob rôl mor wahanol. Mae bod yn gyfreithiwr yn wahanol iawn i fod yn ynad ond mae’r cyfan yn broffesiynol iawn.”"
        },
        {
            "text": "Siaradodd Dawn Gibbons, Ynad Heddwch ar gyfer De-orllewin Llundain a wasanaethodd fel ynad arweiniol yn y digwyddiad, am bwysigrwydd cynrychiolaeth: “Nid yw’r bont rhwng y byd academaidd a’r system gyfiawnder mor eang ag yr oedd pan oeddwn i yn yr ysgol. Gallwch chi nawr weld pobl sy’n edrych fel chi – boed yn ddynion, yn fenywod, yn anabl, yn ddu neu’n frown, yr holl nodweddion gwarchodedig. Dyna gyfiawnder agored, dylai unrhyw un allu gwneud cais a ffitio i mewn. Rydym yn farnwriaeth ar gyfer yr 21ain ganrif.”"
        },
        {
            "heading": 2,
            "text": "Ysbrydoli'r genhedlaeth nesaf"
        },
        {
            "text": "Yng nghystadleuaeth eleni, enillodd disgyblion o Ysgol Gyfun Bishopston yng Nghymru y brif wobr yn rownd derfynol ranbarthol Llundain, a gynhaliwyd yn Llys y Goron Croydon ar 14 Mehefin."
        },
        {
            "text": "Dywedodd Polly, myfyrwraig o Bishopston a oedd yn brif gyfreithiwr yr erlyniad: “Mae’n wych iawn oherwydd nid ydym erioed wedi gwneud hyn o’r blaen fel Ysgol Bishopton, felly mae cyrraedd y rownd derfynol ac ennill yn wych. Rwy’n credu y bydd y profiad hwn yn bendant yn helpu i ysbrydoli rhai pobl i feddwl am wahanol yrfaoedd yn y gyfraith ar wahân i fod yn gyfreithiwr, mae rolau fel ynad heddwch a chynghorydd cyfreithiol ar gael.”"
        },
        {
            "text": "Tynnodd yr Arglwydd Ponsonby o Shulbrede, Is-ysgrifennydd Gwladol Seneddol, a wirfoddolodd fel prif ynad ar y diwrnod, sylw at ei brofiad ei hun o ymuno â’r system gyfiawnder: “Nid oedd fy nghefndir yn y gyfraith o gwbl. Roeddwn i’n beiriannydd yn ystod fy ngyrfa broffesiynol, ond penderfynais wirfoddoli fel ynad a gwneud hyn unwaith bob pythefnos dros 20 mlynedd. Rwyf wedi dysgu bod llawer o wahanol rannau i gyfiawnder troseddol sy’n hygyrch ac mae llawer o wahanol ffyrdd o symud trwy’r cyfleoedd gyrfa hynny. Mae’n mynd ymhell y tu hwnt i fod yn gyfreithiwr, bargyfreithiwr neu farnwr, ac yn sicr fy nghanfyddiad yw bod pobl yn mwynhau’r gyrfaoedd hynny’n fawr ac yn cael boddhad gwirioneddol ohonynt.”"
        },
        {
            "text": "Mae’r bartneriaeth rhwng GLlTEF a Young Citizens wedi gweld miloedd o fyfyrwyr yn cymryd rhan mewn cystadlaethau ffug dreialon dros y blynyddoedd. Mae GLlTEF yn darparu cyllid a lleoliadau, tra bod staff yn rhoi o’u hamser i helpu i drefnu’r digwyddiadau. Mae hyn yn rhan o raglen allgymorth ehangach GLlTEF i godi ymwybyddiaeth o wahanol rolau a chyfleoedd gyrfa ar draws y system gyfiawnder, gan wneud gyrfaoedd cyfreithiol yn fwy hygyrch ac apelgar i bobl ifanc o bob cefndir."
        },
        {
            "text": "Dywedodd Ashley Hodges, Prif Weithredwr Young Citizens: “Dylai pob dinesydd ddeall sut mae ein sefydliadau’n gweithio a’r rôl maen nhw’n ei chwarae yn eu bywydau bob dydd. Yn anffodus, mae’r systemau pwerus hyn yn aml yn ymddangos yn llawn dirgelwch, ac mae ymddiriedaeth pobl ifanc yn ein harweinwyr ar ei lefel isaf erioed. Dyna pam mae angen i ni hysbysu a chynnwys pobl ifanc trwy raglenni trochi fel y Cystadlaethau Ffug Dreial. Maent yn gyfle i fyfyrwyr gaffael gwybodaeth a defnyddio eu sgiliau mewn amgylchedd ysbrydoledig a chroesawgar, gan obeithio sbarduno’r genhedlaeth nesaf o weithwyr proffesiynol ym maes y gyfraith.”"
        },
        {
            "text": "Bydd Cystadlaethau Ffug Dreialon Llysoedd Ynadon a’r Bar 2025/26 yn digwydd rhwng Tachwedd 2025 a Mehefin 2026. Mae rhagor o wybodaeth ynghylch sut y gallwch wirfoddoli a chefnogi yma."
        }
    ]
}