{
    "url": "https://civilservice.blog.gov.uk/2025/07/24/from-promise-to-reality-our-school-nursery-journey/",
    "title": "From Promise to Reality: Our School Nursery Journey",
    "authors": [
        "Jasmine Hussain",
        "Jessica Crawley"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2025-07-24T16:29:57+00:00",
    "content": [
        {
            "text": "Jessica Crawley and Jasmine Hussain joined the DfE because they believed in its power to change lives — and now they’re seeing that in action, helping to build and expand 3,000 nurseries across England's schools. Let them tell you how they're making it happen."
        },
        {
            "text": "Jessica Crawley – Senior Delivery Officer"
        },
        {
            "text": "Twelve months ago, we sat in a meeting room faced with our mammoth challenge. Our task was to turn a government promise into reality by creating thousands of new school-based nurseries. The government's Plan for Change identified our mission: breaking down barriers by giving children the best start in life. With one in three children starting school not ready to learn, we relished the opportunity to help bring about change."
        },
        {
            "text": "From Zero to 300 – what a beginning!"
        },
        {
            "text": "We began by creating our school-based nurseries team from scratch. Within weeks, we'd designed and launched a Capital Grant scheme offering schools up to £150,000 to create nursery spaces."
        },
        {
            "text": "The response was overwhelming. In the first phase of the programme, we were bowled over. More schools applied than anticipated, with over 600 applications and 300 grants awarded!"
        },
        {
            "text": "Our success demonstrates what's possible when teams unite across department boundaries. This achievement wasn't just the result of our programme team's dedication. It flourished through genuine collaboration with our colleagues in finance, commercial, digital, and Regions Group. We also worked alongside Strategic Communications, Central Capital Unit and Early Years Policies. This cross-functional approach created a foundation for meaningful progress that would have been impossible in isolation."
        },
        {
            "text": "Head teacher Alex Armstrong [pictured above] said: \"This funding will help us turn unused space into a vibrant, welcoming baby room offering year-round childcare from birth to five.\"Jasmine Hussain – Senior Delivery OfficerFrom the beginning I could already imagine the children having a great time in the newly created spaces. As well as building through bricks and mortar, we’re also breaking down the barriers that hold children back."
        },
        {
            "text": "Road AheadSince March 2023 we have been working with the sector to expand childcare availability. From September 2025, children of eligible working parents will be entitled to 30 hours of government funded childcare. This will apply from 9 months until they start school. Our work to grow the number of school-based nurseries is a valuable part of achieving this. It especially supports parents to find that childcare where they need it and helping children be school-ready.When a child walks confidently into their first day of school, ready to learn and eager to explore, that's everyone’s success, including theirs."
        },
        {
            "text": "Momentum is rolling on - we’re now working with the sector to shape the next exciting phase, which will bring even more school-based nurseries to life."
        },
        {
            "text": "Want to learn more about our journey? Contact Jessica.Crawley@education.gov.uk and Jasmine.Hussain@education.gov.uk."
        },
        {
            "text": "This is the final instalment of our four-part series marking 1 Year of Government showcasing the extraordinary work of civil servants delivering the Missions."
        }
    ]
}