{
    "url": "https://insidehmcts.blog.gov.uk/2025/07/24/media-notification-rules-clarified-for-criminal-courts/",
    "title": "Media notification rules clarified for criminal courts ",
    "authors": [
        "Georgia Jerram, Chair of HMCTS Media Working Group"
    ],
    "categories": [
        "Crime",
        "General"
    ],
    "pub_date": "2025-07-24T11:01:33+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A successful partnership between HMCTS and media representatives has resulted in important rule changes that will strengthen open justice. The Criminal Procedure Rules will soon explicitly require proper notification of journalists when discretionary reporting restrictions (as opposed to automatic restrictions for youth cases and certain offences) are proposed, addressing a long-standing concern about transparency in criminal courts. "
        },
        {
            "text": "This important clarification has come about through the shared endeavour of colleagues, the HMCTS Media Working Group and the Criminal Procedure Rule Committee. It is their work that has brought us this far. "
        },
        {
            "heading": 2,
            "text": "Why this matters "
        },
        {
            "text": "As a society, we often rely on the media to be our eyes and ears in courtrooms. When reporters aren't provided with clear information about what they can and cannot report, open justice can be undermined. "
        },
        {
            "text": "Our Media Working Group brings together journalists, news agencies, media lawyers and court officials to improve media access to court information and enhance open justice. We review operational processes and collaborate on solutions to court reporting challenges. "
        },
        {
            "text": "One consistent concern has been the lack of proper notification when applications for reporting restrictions are submitted. Without advance notification, media organisations cannot make informed decisions or challenge restrictions they believe do not meet the threshold for limiting open reporting. "
        },
        {
            "text": "Reporting restrictions limit what information can be published about a case. They protect vulnerable witnesses, ensure fair trials and appropriately safeguard privacy.  "
        },
        {
            "text": "The responsibility for notifying media of reporting restriction applications lies with the party making the application, not court staff. "
        },
        {
            "heading": 2,
            "text": "The need for clarity "
        },
        {
            "text": "While the Criminal Procedure Rules technically already recognised media organisations as interested parties, this wasn't consistently applied in practice. "
        },
        {
            "text": "The impact was evident recently at a magistrates’ court, when the media were not notified about a  reporting restriction to anonymise several witnesses. Several months after the start of the case, the restriction was lifted on all but one witness, following the media’s application – but not being made aware initially meant that meaningful press reporting on the case had been prevented for several months. "
        },
        {
            "text": "In another case, a journalist unknowingly breached a reporting restriction that hadn't been communicated to their newspaper, leading to contempt proceedings that the publication knew nothing about. "
        },
        {
            "text": "These situations demonstrate how lack of notification prevents journalists from fulfilling their essential role in ensuring justice is seen to be done. "
        },
        {
            "text": "The Media Lawyers Association and News Media Association, both active members of the Media Working Group, presented a compelling case that the rules needed to explicitly name the media as an interested party.  "
        },
        {
            "heading": 2,
            "text": "Wider impacts for open justice  "
        },
        {
            "text": "The Criminal Procedure Rule Committee were open to engagement, creating the time and space to consider the case before approving the amended rules which come into force on 6 October 2025. This small change represents a significant improvement for open justice, creating clarity for courts, legal professionals and journalists alike. "
        },
        {
            "text": "Pia Sarma, Chair of the Media Lawyers Association, welcomed the amendments:"
        },
        {
            "heading": 2,
            "text": "Practical implications "
        },
        {
            "text": "These amendments clarify existing obligations rather than creating new ones, supporting consistent implementation across all courts.  "
        },
        {
            "text": "For legal professionals, they reinforce that considering media interest when submitting a reporting restriction application isn’t optional but essential to open justice. For journalists, the rules provide clearer guidance about what they can expect.  "
        },
        {
            "text": "According to the News Media Association Director of Legal, Sayra Tekin, these changes will make a real difference: "
        },
        {
            "text": "For the public, it supports greater transparency in our justice system. Journalists with full knowledge of any restrictions can report accurately on hearings, building public trust and confidence. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "We're preparing our court staff ahead of the implementation of the amendments in October, using updated guidance. All criminal courts will have media lists available to assist applicants with notifying journalists.  "
        },
        {
            "text": "We'll continue to work closely with media representatives through the HMCTS Media Working Group, monitoring the impact of these changes, listening to their feedback and identifying any additional needs. "
        },
        {
            "text": "This collaboration demonstrates how working together strengthens the foundations of open justice that serve us all. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Egluro rheolau hysbysu’r cyfryngau ar gyfer llysoedd troseddol"
        },
        {
            "text": "Mae partneriaeth lwyddiannus rhwng GLlTEF a chynrychiolwyr y cyfryngau wedi arwain at newidiadau pwysig i reolau fydd yn cryfhau cyfiawnder agored. Bydd y Rheolau Trefniadaeth Droseddol angen hysbysu newyddiadurwyr yn briodol yn fuan pan fwriedir cyfyngiadau adrodd yn ôl disgresiwn (yn hytrach na chyfyngiadau awtomatig ar gyfer achosion ieuenctid a throseddau penodol) gan fynd i’r afael â phryder hirsefydlog am dryloywder mewn llysoedd troseddol. "
        },
        {
            "text": "Daeth yr eglurhad pwysig hwn drwy ymdrech a rennir gan gydweithwyr, y Gweithgor Cyfryngau GLlTEF a’r Pwyllgor Rheolau Trefniadaeth Droseddol. Eu gwaith nhw sydd wedi dod â ni i’r pwynt hwn."
        },
        {
            "heading": 2,
            "text": "Pam bod hyn o bwys"
        },
        {
            "text": "Fel cymdeithas, rydym yn aml yn dibynnu ar y cyfryngau i fod yn lygaid ac yn glustiau i ni yn y llysoedd. Pan nad yw newyddiadurwyr yn derbyn gwybodaeth glir am yr hyn y gallant ac na allant adrodd arno, gall cyfiawnder agored gael ei danseilio."
        },
        {
            "text": "Mae ein Gweithgor Cyfryngau yn cynnwys newyddiadurwyr, asiantaethau newyddion, cyfreithwyr cyfryngau a swyddogion llys i wella mynediad y cyfryngau i wybodaeth llys a gwella cyfiawnder agored. Rydym yn  adolygu prosesau gweithredol ac yn cydweithio ar ddatrysiadau i heriau adrodd yn y llys."
        },
        {
            "text": "Un pryder cyson yw’r diffyg hysbysu priodol pan gaiff ceisiadau ar gyfer cyfyngiadau adrodd eu cyflwyno. Heb gael eu hysbysu ymlaen llaw, ni all sefydliadau’r cyfryngau wneud penderfyniadau hysbys na herio cyfyngiadau y credir ganddyn nhw nad ydynt yn cwrdd â’r trothwy ar gyfer cyfyngu ar adrodd yn agored."
        },
        {
            "text": "Mae cyfyngiadau adrodd yn cyfyngu pa wybodaeth y gellir ei chyhoeddi am achos. Maent yn amddiffyn tystion sy’n agored i niwed, sicrhau treialon teg a diogelu preifatrwydd yn briodol.  "
        },
        {
            "text": "Cyfrifoldeb y parti sy’n gwneud y cais yw hysbysu’r cyfryngau am geisiadau cyfyngu adrodd, nid staff y llys. "
        },
        {
            "heading": 2,
            "text": "Yr angen am eglurder"
        },
        {
            "text": "Er bod y Rheolau Trefniadaeth Droseddol eisoes yn cydnabod sefydliadau’r cyfryngau fel partïon cysylltiedig, nid oedd hyn yn cael ei gymhwyso’n gyson yn ymarferol."
        },
        {
            "text": "Roedd yr effaith yn amlwg yn ddiweddar mewn llys ynadon, ble nad oedd y cyfryngau wedi eu hysbysu am gyfyngiad adrodd i gadw sawl tyst yn ddienw. Sawl mis ar ôl i’r achos ddechrau, cafodd y cyfyngiad ei godi ar bob tyst heblaw un, yn dilyn cais y cyfryngau - ond gan nad oeddent yn ymwybodol ar y dechrau roedd yn golygu bod adrodd ystyrlon yn y wasg ar yr achos wedi’i atal am sawl mis."
        },
        {
            "text": "Mewn achos arall, roedd newyddiadurwr heb yn wybod wedi torri cyfyngiad adrodd na hysbyswyd eu papur newydd amdano, gan arwain at  ddirmyg llys nad oedd y cyhoeddiad yn gwybod unrhyw beth amdano."
        },
        {
            "text": "Mae’r sefyllfaoedd hyn yn dangos sut mae diffyg hysbysu yn atal newyddiadurwyr rhag cyflawni eu rôl hanfodol i sicrhau y gwelir bod cyfiawnder yn cael ei gyflawni."
        },
        {
            "text": "Cyflwynodd y Gymdeithas Cyfreithwyr Cyfryngau a’r Gymdeithas Cyfryngau Newyddion, y ddau’n aelodau gweithredol o Weithgor y Cyfryngau achos cryf bod y rheolau angen enwi’r cyfryngau’n glir fel parti â budd."
        },
        {
            "heading": 2,
            "text": "Effeithiau ehangach cyfiawnder agored"
        },
        {
            "text": "Roedd y Pwyllgor Rheolau Trefniadaeth Droseddol yn agored i ymgysylltu, gan greu’r amser a’r lle i ystyried yr achos cyn cymeradwyo’r rheolau diwygiedig a ddaw i rym ar 6 Hydref 2025. Mae’r newid bach hwn yn cynrychioli gwelliant sylweddol ar gyfer cyfiawnder agored, gan greu eglurder i lysoedd, gweithwyr proffesiynol ym maes y gyfraith a newyddiadurwyr. Croesawodd Pai Sarma, Cadeirydd y Gymdeithas Cyfreithwyr Cyfryngau’r newidiadau:"
        },
        {
            "heading": 2,
            "text": "Goblygiadau ymarferol"
        },
        {
            "text": "Mae’r newidiadau hyn yn egluro’r rhwymedigaethau presennol yn hytrach na chreu rhai newydd, gan gefnogi gweithrediad cyson ar draws pob llys. "
        },
        {
            "text": "Ar gyfer gweithwyr proffesiynol ym maes y gyfraith, maent yn ail gadarnhau nad yw ystyried budd y cyfryngau wrth gyflwyno cais cyfyngu adrodd yn ddewisol ond yn hanfodol ar gyfer cyfiawnder agored.  Ar gyfer newyddiadurwyr, mae’r rheolau’n darparu canllawiau cliriach o ran yr hyn y gallant ei ddisgwyl.   Yn ôl Sayra Tekin o’r Gymdeithas Cyfryngau Newyddion, bydd y newidiadau hyn yn gwneud gwahaniaeth gwirioneddol:"
        },
        {
            "text": "I’r cyhoedd, mae’n cefnogi mwy o dryloywder yn ein system gyfiawnder. Gall newyddiadurwyr gyda gwybodaeth lawn am unrhyw gyfyngiadau adrodd yn gywir ar wrandawiadau, datblygu ymddiriedaeth a hyder y cyhoedd. "
        },
        {
            "heading": 2,
            "text": "Camau nesaf"
        },
        {
            "text": "Rydym yn paratoi staff y llysoedd cyn gweithredu’r newidiadau ym mis Hydref, gan ddefnyddio canllawiau a ddiweddarwyd. Bydd gan bob llys troseddol restrau cyfryngau ar gael i gynorthwyo ceiswyr i hysbysu newyddiadurwyr. "
        },
        {
            "text": "Byddwn yn parhau i weithio’n agos gyda chynrychiolwyr y cyfryngau drwy Weithgor Cyfryngau GLlTEF, monitro effaith y newidiadau hyn, gwrando ar eu hadborth a nodi unrhyw anghenion ychwanegol. "
        },
        {
            "text": "Mae’r cydweithio hwn yn dangos sut mae gweithio gyda’n gilydd yn cryfhau sylfeini cyfiawnder agored sy’n ein gwasanaethu ni i gyd."
        }
    ]
}