{
    "url": "https://ipo.blog.gov.uk/2025/07/24/new-curls-on-the-block/",
    "title": "New curls on the block: how IP continues to shape hair innovation",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Design",
        "Innovation",
        "Patents",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2025-07-24T10:00:00+01:00",
    "content": [
        {
            "text": "After joining the IPO, I stumbled across a blog called ‘The girl with a curl’, written by our Regional Policy Advisor to Devolved Nations, Emma Richards. As a fellow curly girl, the content really resonated with me and I found myself reflecting on the remarkable evolution of curly hair products since 2016, when the blog was published. While some classic inventions like the diffuser are still a must for hair washing days, the innovators of today have certainly made the curly hair experience easier!"
        },
        {
            "heading": 3,
            "text": "Protection that holds"
        },
        {
            "text": "A defining curl cream is the foundation of my curly hair routine. The way it can take unruly, frizzy locks and create defined curls makes it an everyday essential, and these formulations are rich with IP. Many feature patented ingredient combinations, such as a formula for a cream that provides strong hold and moisture resistance, which is protected under GB2581572A. One of my personal favourites, Bumble and Bumble®, offers strong hold for curls, and their branding helps them to stand out on busy shelves. Bumble and Bumble® have wisely protected their branding with trade marks such as UK00801262830 and UK00003335285."
        },
        {
            "heading": 3,
            "text": "Scrunch and crunch"
        },
        {
            "text": "For me, after definition comes hold, where I secure freshly styled curls into place with a gel. My go-to product is Umberto Giannini's® Curl Jelly, a classic in what has become an extensive range of curl-specific products. This brand, named after its founder, has graced dressing tables for over two decades, and for me the products continue to represent quality curl care.Along with the rest of their products, Curl Jelly is well protected with trade marks. Umberto Giannini® not only have trade mark protection covering their brand name (UK00002176284), but also the specific product title 'Umberto Giannini Curl Jelly®' (UK00004155214), and a recently applied for figurative mark of their distinctive bottle lettering (UK00004173954). Their approach demonstrates that creating a product with staying power – both in curls and in the market – can be helped along when you have thorough trade mark protection."
        },
        {
            "heading": 3,
            "text": "A tangle of IP"
        },
        {
            "text": "Curly hair routines are as diverse as the curls themselves, but one game-changing discovery in my personal journey was the Tangle Teezer®. Growing up with long, thick curls meant detangling was always a challenge. That was until this innovative brush (with its 400 specially designed teeth) came onto my radar, making removing the tangles from my hair a breeze."
        },
        {
            "text": "Despite famously being unable to secure investment on BBC Dragons' Den®, the Tangle Teezer® has achieved remarkable global success. The company exemplifies IP-rich innovation, with protection spanning multiple categories: patents for their unique brush technology (GB2549765A) registered designs protecting the way that they look (AR700000000080389-0001), and trade mark protection for their name (UK00003074014)."
        },
        {
            "heading": 3,
            "text": "Only curls allowed"
        },
        {
            "text": "Perhaps the most significant shift in recent years has been the surge in sulphate-free formulations. The science supporting this change is compelling – sulphates strip natural oils from hair, particularly devastating for naturally moisture-deprived curly textures. Forward-thinking companies like Only Curls® have built their entire brand identity around this principle, developing formulations that cleanse effectively without drying."
        },
        {
            "text": "Their branding is protected with trade marks such as UK00003257279, and the business has moved beyond selling individual products to marketing complete systems. Their multi-step routines promise optimal results when used together – a brilliant strategy that encourages consumers to invest in entire product ranges rather than buying individual items. "
        },
        {
            "text": "But how do these companies protect their innovative formulations? Trade secrets can provide a valuable form of protection. For trade secret protection to apply, formulations must be carefully guarded and derive commercial value specifically from their confidentiality. Companies employing this strategy should ensure all parties involved – from suppliers and manufacturers to employees – sign comprehensive non-disclosure agreements (NDAs). For practical guidance on implementing NDAs effectively, visit our dedicated NDA guidance page."
        },
        {
            "heading": 3,
            "text": "IP worth its volume in gold"
        },
        {
            "text": "The evolution of curly hair products since 2016 represents more than just better options for taming rebellious locks – it showcases the critical role that IP plays in the beauty industry. From patents protecting formulations to trade marks safeguarding recognisable brands, IP has helped transform what was once a niche market into a thriving sector catering to diverse hair needs."
        },
        {
            "text": "The next time you reach for your favourite hair product take a moment to appreciate not just the immediate benefits to your hair, but also the invisible framework of IP that helped bring that product to your bathroom shelf. "
        },
        {
            "text": "Emma Richards said at the end of her blog that \"with the help of our future innovators hopefully, the experience will be easier\" - and she was certainly right! These products have helped the little girl with wild hair at the beginning of this blog to not only take care of her curls, but also to love them, and to take them into adulthood leaving the straighteners behind. "
        }
    ]
}