{
    "url": "https://healthmedia.blog.gov.uk/2025/07/24/resident-doctor-strikes-everything-you-need-to-know/",
    "title": "Resident doctor strikes: everything you need to know ",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2025-07-24T14:13:47+01:00",
    "content": [
        {
            "text": "The British Medical Association (BMA), has announced that resident doctors – formerly known as junior doctors – will be striking from July 25 to July 30.  "
        },
        {
            "text": "Here, we tell you everything you need to know about resident doctor strikes, including what patients need to know about their care during strikes. "
        },
        {
            "heading": 3,
            "text": "When are resident doctors going on strike? "
        },
        {
            "text": "Resident doctors will strike for 5 days in July. "
        },
        {
            "text": "The strike will start at 7am on Friday 25 July and continue until 7am on Wednesday 30 July. "
        },
        {
            "heading": 3,
            "text": "Is my appointment being cancelled? "
        },
        {
            "text": "Patients with appointments booked on strike days will be contacted if their appointment needs to be rescheduled due to industrial action.  "
        },
        {
            "text": "If they have not been contacted, they should attend their appointment as planned.   "
        },
        {
            "text": "Any appointments that need to be rescheduled will be done so as a priority. "
        },
        {
            "heading": 3,
            "text": "What if I need urgent medical attention? "
        },
        {
            "text": "It’s important that you do not put off seeking urgent care, and you should turn up for planned appointments unless you have been told otherwise.  "
        },
        {
            "text": "Anyone who needs urgent care should use NHS 111 online or use the NHS App to be assessed and directed to the right care for them.  "
        },
        {
            "text": "As usual, patients should only use 999 if it is a serious or life-threatening emergency. "
        },
        {
            "text": "For more information on when to call 999 and when to go to A&E, you can visit the NHS UK website. "
        },
        {
            "heading": 3,
            "text": "How are you keeping patients safe during strikes? "
        },
        {
            "text": "Our priority is to keep patients safe, and we will do everything we can to mitigate the impact of the strikes on patients and the disruption that will follow.  "
        },
        {
            "text": "NHS leaders have been clear that previous rounds of strike action caused much wider levels of harm than previously realised and there is no reason why planned care for cancer for example should be treated as less important than other NHS services. We know that cancelling non-urgent work comes at a risk to patients too and must not ignore this. "
        },
        {
            "text": "That’s why we are taking a different approach this year, and the NHS is planning for as many patients as possible to be cared for. "
        },
        {
            "heading": 3,
            "text": "Should I be worried about falling ill during strikes? "
        },
        {
            "text": "The NHS has tried and tested ways to keep patients safe during strikes. "
        },
        {
            "text": "This includes derogations which are exemptions or special arrangements that allow certain essential services to continue operating during industrial action, even when healthcare workers are on strike. "
        },
        {
            "text": "When NHS staff take strike action, they work with hospital management to identify critical services that must be maintained to ensure patient safety and prevent serious harm.  "
        },
        {
            "text": "This ensures that whilst industrial action can proceed to highlight disputes over pay, working conditions, or other issues, patient safety remains the primary concern. "
        },
        {
            "heading": 3,
            "text": "How much do resident doctors earn? "
        },
        {
            "text": "We expect the average full-time basic pay of a resident doctor will reach about £54,300 in 2025-26. That doesn’t include overtime, and many will earn much more than this, with the top of the basic pay scale being £73,992 "
        },
        {
            "text": "The average starting salary for a full-time Resident Doctor is now around £38,800, up from around £29,380 in 2022/2023 – an increase of nearly £9,500. "
        },
        {
            "heading": 3,
            "text": "What pay rises have they had in recent years? "
        },
        {
            "text": "Resident doctors pay has increased by 28.9% across the last three years. "
        },
        {
            "text": "For the second year in a row, resident doctors received the highest pay increase across the public sector – 5.4% this year. This means they’ve had two years in a row of above inflation pay increases.  "
        },
        {
            "heading": 3,
            "text": "Is it true that most resident doctors didn’t vote to strike? "
        },
        {
            "text": "Yes. "
        },
        {
            "text": "Because of the turnout (55.3%), under half of resident doctors in the BMA have actually voted in favour of strike action (49.78%).  "
        },
        {
            "text": "Of the 77,000 resident doctors working in our NHS hospital and community health services, only around a third actually voted for strike action.    "
        },
        {
            "heading": 3,
            "text": "Will there be more strikes? "
        },
        {
            "text": "The BMA has a 6-month mandate – this means that they have a legal right to announce more strikes until 6 January 2026. "
        },
        {
            "text": "The Secretary of State has been clear that he wants to work with the BMA to improve resident doctors working lives and put an end to strikes. "
        },
        {
            "heading": 3,
            "text": "What are you doing to stop strikes? "
        },
        {
            "text": "After delivering two years in a row of the highest pay increases across the public sector, the Secretary of State has been clear that he couldn’t move on pay for resident doctors. "
        },
        {
            "text": "The Secretary of State and the BMA had constructive talks over the last week, with the opportunity for the BMA to work with the Department of Health on a range of options that would have made a real difference to resident doctors’ working conditions. "
        },
        {
            "text": "This includes creating extra roles to deal with the bottlenecks that hold back doctors’ career progression, tackling costs of mandatory exams and equipment, and work to reduce the additional burden of rotations. "
        },
        {
            "text": "Unfortunately, the BMA decided to walk away from the offer of further talks and proceed with strike action. Our focus now is on protecting patient safety as strikes take place.  "
        },
        {
            "heading": 3,
            "text": "What happens next? "
        },
        {
            "text": "With waiting lists the lowest they have been in two years, satisfaction with GPs on the up and 4.6 million appointments delivered in our first year, we are turning the NHS around. "
        },
        {
            "text": "There is finally light at the end of the tunnel for the NHS, but the BMA is putting that progress at risk. "
        },
        {
            "text": "This government wants to work constructively with the BMA to improve working conditions for resident doctors. By refusing to do so, the BMA will cause unnecessary disruption to patients, put additional pressure on their NHS colleagues and not take the opportunity to improve their own working conditions. "
        },
        {
            "text": "Our attention will be now on averting harm to patients and supporting NHS staff at work. "
        }
    ]
}