{
    "url": "https://nda.blog.gov.uk/ticking-all-the-boxes-how-were-maximising-opportunities-from-our-manufacturing-mission/",
    "title": "Ticking all the boxes: How we’re maximising opportunities from our manufacturing mission",
    "authors": [
        "Gareth Frazer"
    ],
    "categories": [
        "Mission delivery",
        "Procurement",
        "Supply Chain"
    ],
    "pub_date": "2025-07-24T10:37:01+01:00",
    "content": [
        {
            "text": "Sellafield needs tens of thousands of drums, cans, and boxes to safely store and dispose of nuclear waste."
        },
        {
            "text": "Ensuring we have those products ready at the right time and to the right specification is a mission-critical task."
        },
        {
            "text": "It’s also a huge opportunity for both the UK manufacturing sector and for our community in Cumbria."
        },
        {
            "text": "To meet this challenge, we created Sellafield’s Manufactured Products Organisation (MPO), which I’m proud to lead."
        },
        {
            "text": "Our job is to rewire our approach to product design and manufacture."
        },
        {
            "text": "This means shifting from a ‘build to spec’ mentality to a truly collaborative delivery model."
        },
        {
            "text": "But we can’t do this alone. We need our supply chain to join us in this journey."
        },
        {
            "text": "In this blog, I’ll share my thoughts on how we can do this together."
        },
        {
            "text": "So, if you’re a manufacturer, and you’re excited by this genuinely transformational opportunity, read on."
        },
        {
            "text": "And if you want know more, please get in touch via the contact details at the end of this blog."
        },
        {
            "heading": 3,
            "text": "Scaling up to meet demand"
        },
        {
            "text": "Sellafield’s manufacturing demand has transformed over the years."
        },
        {
            "text": "In the past, we needed fewer products. Designs were one-off and bespoke."
        },
        {
            "text": "But as we ramp up our retrievals and decommissioning work, our demand profile is shifting dramatically."
        },
        {
            "text": "We need much higher volumes now. And that’s what’s really driving the shift in our thinking."
        },
        {
            "text": "Building on our strong local skills base, we need to work with our supply chain to scale up to volume manufacturing."
        },
        {
            "text": "It’s a fantastic opportunity for companies to think about how they can support the next generation of manufacturing workers."
        },
        {
            "text": "It could be a massive shot in the arm for a sector that’s been on the decline for decades in the UK."
        },
        {
            "heading": 3,
            "text": "Resetting relationships"
        },
        {
            "text": "To support that scale-up to volume manufacturing we must change the way we engage with our suppliers."
        },
        {
            "text": "We used to present suppliers with a fully developed design and expect them to manufacture the product to specification."
        },
        {
            "text": "This resulted in manufacturing challenges which led to delays, increased costs, and inefficiencies."
        },
        {
            "text": "But if we engage our supply chain from the start, we can smooth out that process."
        },
        {
            "text": "That means developing the products and the manufacturing processes collectively."
        },
        {
            "text": "The benefits of doing this are huge. We can reduce risks, lower costs, and ensure production processes are optimised for efficiency."
        },
        {
            "text": "For suppliers, it means long-term, stable contracts allowing them to invest in their facilities and workforces with confidence."
        },
        {
            "heading": 3,
            "text": "Embracing best practice"
        },
        {
            "text": "Another priority for MPO is looking outside our industry to learn from others who do this well."
        },
        {
            "text": "The automotive and aerospace sectors are particularly successful at high volume manufacturing."
        },
        {
            "text": "We’ve adopted 2 tools which are standard in those sectors: New Product Introduction (NPI) and Advanced Product Quality Planning (APQP)."
        },
        {
            "text": "These methods ensure products are designed for manufacture from the outset."
        },
        {
            "text": "APQP is fundamental. It’s just common sense: working together to establish the most effective and efficient ways to manufacture products."
        },
        {
            "text": "It drives early supplier collaboration and offers a structured approach for the planning, defining, and execution of production process to best meet our needs."
        },
        {
            "heading": 3,
            "text": "Amplifying the supplier voice"
        },
        {
            "text": "Being a good customer means listening as well as talking."
        },
        {
            "text": "By bringing manufacturing expertise into the process earlier, we’re gaining valuable insight from suppliers meaning we’re learning continuously."
        },
        {
            "text": "We’re turning that feedback into actions designed to improve how we do business, helping us to become a more agile, receptive customer."
        },
        {
            "heading": 3,
            "text": "Priming the pipeline"
        },
        {
            "text": "Our future order book for manufacturing represents a potentially transformative opportunity for local and UK manufacturers."
        },
        {
            "text": "We’re committed to leveraging this work to help support the sector, create jobs, unlock investment in our community, and grow the economy."
        },
        {
            "text": "To do that, we need to connect businesses to our future procurement pipeline."
        },
        {
            "text": "That’s a key area of focus for MPO. Working alongside our colleagues in Sellafield’s supply chain directorate, we want to help manufacturers get themselves in the best position possible to win work when it becomes available."
        },
        {
            "heading": 3,
            "text": "Achieving value for our customers"
        },
        {
            "text": "As a wholly-owned subsidiary of government, we don’t have shareholders at Sellafield."
        },
        {
            "text": "Our customers are our owner the Nuclear Decommissioning Authority (NDA), our sponsoring department is the Department for Energy Security and Net Zero (DESNZ), our local community, and ultimately UK taxpayers, who fund our work."
        },
        {
            "text": "Creating value for those customers is at the forefront of our minds throughout our work."
        },
        {
            "text": "Ensuring the consistent and repeatable supply of containers for the long-term safe storage of nuclear material, spent fuels, and waste is critical to our mission."
        },
        {
            "text": "Finding ways to create additional value by reducing complexity, ensuring deliverability and controlling costs is what we’re here to do."
        },
        {
            "text": "Our expertise helps to unlock that value creating a return on investment through development and growth of the UK manufacturing supply chain."
        },
        {
            "text": "We’re passionate about maximising the opportunity from our manufacturing mission. And we’re keen for like-minded suppliers to join us on the journey."
        },
        {
            "text": "If you’re a supplier who wants to know more, email us on: mpo@sellafieldsites.com"
        },
        {
            "text": "Or visit our 'How to do business' area on GOV.UK. "
        }
    ]
}