{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/07/24/transforming-our-approach-to-market-interventions/",
    "title": "Transforming our approach to market interventions",
    "authors": [
        "Sarah Cardell"
    ],
    "categories": [
        "Markets"
    ],
    "pub_date": "2025-07-24T11:31:51+01:00",
    "content": [
        {
            "text": "At the CMA, our mission is clear: to promote competition and protect consumers. One of the most powerful ways we do this is through our markets tools, which allow us to examine entire markets and identify opportunities to make them work better for consumers, businesses, and the wider economy."
        },
        {
            "text": "Over the past decade, we’ve used our market tools to:"
        },
        {
            "text": "More recently, we’ve made recommendations to government on streamlining the planning system, strengthening consumer protections in housebuilding, and improving outcomes for parents in the infant formula market."
        },
        {
            "heading": 2,
            "text": "Why we’re changing our approach "
        },
        {
            "text": "As we move beyond our first decade of markets work, now is the right time to reflect on how we use these tools and how we can do so even more effectively. We’ve been making fundamental changes across the CMA to ensure our work supports economic growth, reduces uncertainty for businesses and investors, and delivers better outcomes for everyone."
        },
        {
            "text": "Central to this is our new framework, shaped by feedback from stakeholders, built around the ‘4Ps’:"
        },
        {
            "text": "We’ve already started embedding this approach across the rest of the CMA’s work, including mergers, consumer protection and competition enforcement. In setting out how it will apply to our markets work, we are today completing the implementation of the 4Ps framework across the CMA’s major tools."
        },
        {
            "text": "This shift is timely. The UK government’s Regulation Action Plan and the strategic steer to the CMA, both published in May 2025, emphasise the role of regulators in supporting economic growth. Our work should build consumer trust, deter poor corporate practices, and prioritise interventions that boost productivity and growth."
        },
        {
            "text": "Our markets tools are uniquely positioned to help us deliver on this; they are discretionary, so we can focus on markets with the greatest potential to support growth – such as civil engineering for road and rail, into which we have just launched a market study. By improving how competition functions in these markets, we encourage firms to innovate, invest, and raise productivity – often without the need for direct legislative or regulatory intervention."
        },
        {
            "text": "However, we’re also mindful that our work can create uncertainty or impose burdens on businesses – especially if processes are lengthy or unclear, and so we’re committing to minimise these impacts. For example, while the legislation that sits behind our markets work provides statutory time limits, this still means a market study could last up to 12 months, followed by a market investigation of up to 18 or 24 months. We are clear that an end-to-end process lasting, in some cases, up to 3 years is not consistent with minimising unnecessary burdens and uncertainty on businesses in the vast majority of cases. We must seek to complete our work as quickly as possible while securing benefits for consumers, businesses and the wider economy."
        },
        {
            "heading": 2,
            "text": "What's changing"
        },
        {
            "text": "Our updated approach sets out how we’ll apply the 4Ps from the start of a project through to the full project life cycle and beyond."
        },
        {
            "text": "Before launching new work, we’ll provide greater clarity on our priorities, consider burdens to business of complying with any remedies as well as any impact on potential investment, and design our work to choose the lightest, fastest approach that still addresses the issues effectively."
        },
        {
            "text": "During a project, we’ll bring in sector expertise early, engage more directly with businesses, and hold ‘state of play’ meetings to reassess the costs and benefits of continuing our lines of inquiry."
        },
        {
            "text": "At the conclusion of a project, we’ll assess the costs of remedies more comprehensively, minimise compliance burdens, and put sunset clauses on remedies, removing them when they’re no longer needed."
        },
        {
            "text": "We’re already incorporating these principles into our live projects and will apply them in full to future work. Our goal is a markets regime that delivers real, lasting impact – supporting growth, building trust, and ensuring markets work better for everyone."
        }
    ]
}