{
    "url": "https://defrafarming.blog.gov.uk/2026/02/05/adopt-round-6-opens-today-hear-how-farmers-are-using-funding/",
    "title": "ADOPT round 6 opens today: hear how farmers are using funding",
    "authors": [
        "Graham Higgins",
        "The Team"
    ],
    "categories": [
        "Future Farming Podcast",
        "Payments for research and innovation"
    ],
    "pub_date": "2026-02-05T10:21:32+00:00",
    "content": [
        {
            "text": "The Accelerating Development of Practices and Technologies (ADOPT) Fund offers grants to farmers and farm businesses to trial new technology and practices on farm."
        },
        {
            "text": "It aims to speed up the development and adoption of new ideas, so more farmers can put them into practice sooner."
        },
        {
            "text": "As Round 6 of the full ADOPT grant opens today, we hear from two farmers who have received ADOPT funding. Thomas Slattery from the Support Hub, which helps applicants prepare, speaks to Bryony Graham in Essex and Peter Southwell in East Yorkshire."
        },
        {
            "text": "They share why they applied, what they’re testing, and how the funding is helping them."
        },
        {
            "text": "Tom explains that problem-solving is already part of everyday farming:"
        },
        {
            "text": "Bryony describes how she is trialling willow as a high-carbon crop and testing compost mixes as a peat-free growing medium that could be used more widely on arable farms:"
        },
        {
            "text": "Peter shares how ADOPT has supported the Yorkshire Nutrition Club to bring farmers together to share data, compare crop nutrition strategies and test new approaches side by side:"
        },
        {
            "text": "Read the transcript. "
        },
        {
            "heading": 2,
            "text": "Apply for ADOPT funding"
        },
        {
            "text": "Up to £5 million is available in Round 6."
        },
        {
            "text": "Two types of grants are available:"
        },
        {
            "text": "Opens: Thursday 5 February 2026"
        },
        {
            "text": "Closes: Wednesday 8 April 2026 11:00am"
        },
        {
            "text": "Opened: Thursday 15 January 2026"
        },
        {
            "text": "Closes: Wednesday 25 February 2026 11:00am"
        },
        {
            "heading": 2,
            "text": "Help with your application"
        },
        {
            "heading": 3,
            "text": "ADOPT Support Hub"
        },
        {
            "text": "If you have any questions about the fund, the ADOPT Support Hub can help."
        },
        {
            "text": "Run by ADAS and commissioned to support ADOPT, it:"
        },
        {
            "heading": 3,
            "text": "Watch the webinar"
        },
        {
            "text": "A webinar delivered by Innovate UK was held last year for anyone interested in ADOPT. It covers the application process and what you need to know before submitting."
        },
        {
            "text": "Watch the ADOPT funding opportunity information webinar."
        },
        {
            "text": "ADOPT is part of the Farming Innovation Programme, delivered in partnership with Innovate UK."
        },
        {
            "text": "For updates from the Farming and Countryside team, subscribe to the blog. You'll receive a notification whenever we publish a new post. "
        }
    ]
}