{
    "url": "https://defencedigital.blog.gov.uk/2026/02/05/building-on-the-progress-of-the-past-year-and-moving-forward/",
    "title": "Building on the progress of the past year and moving forward",
    "authors": [
        "Mivy James"
    ],
    "categories": [
        "Digital Foundry",
        "Digital Innovation"
    ],
    "pub_date": "2026-02-05T20:43:08+00:00",
    "content": [
        {
            "text": "Looking back over the previous year, what strikes me is the huge amount of steady work that’s happened alongside significant change. Defence Reform and the Strategic Defence Review have rightly taken focus, but delivery hasn’t stopped."
        },
        {
            "text": "Across the CTO, progress has continued in practical, visible ways,  often while adapting to new demands and shifting priorities. Much of this work doesn’t grab headlines, but it matter and will continue to shape Defence. "
        },
        {
            "text": "Digital Backbone"
        },
        {
            "text": "If there’s a common theme running through the year, it’s the continued focus on the Digital Backbone."
        },
        {
            "text": "That has meant continuing to develop architecture and design standards, progressing work on data, and making more consistent use of the Technology Reference Model (TRM). The emphasis has been practical: helping teams make better decisions, understand dependencies, and design in ways that work across Defence rather than in isolation."
        },
        {
            "text": "The TRM is increasingly being used as a common reference point across programmes and aligning it to the Defence Capability Hierarchy has helped make the link between technology choices and Defence outcomes clearer. This has supported "
        },
        {
            "text": "more informed conversations about trade-offs, reuse and long-term sustainability."
        },
        {
            "text": "We’ve also spent time improving how the Backbone is supported day to day. digital.mod.uk is now live as a single place to find standards, patterns and artefacts, making it easier for teams and partners to access guidance and work in a more consistent way."
        },
        {
            "text": "Programmes like Digital Targeting Web highlight why this matters. DTW is building from existing systems and capabilities, relying on shared services, data and networks rather than creating something entirely new. The stronger and clearer those Backbone foundations are, the easier it becomes to integrate, adapt and evolve at pace."
        },
        {
            "text": "Alongside this, we’ve continued quieter but important work which has included aligning designs, reviewing architectures and supporting delivery teams as they navigate a complex, brownfield estate. This isn’t about perfection or end states; it’s about steadily improving the foundations Defence depends on. "
        },
        {
            "text": "Innovation in Practice"
        },
        {
            "text": "Innovation this year has been testing ideas properly."
        },
        {
            "text": "Different teams have been exploring different challenges in different ways, from engaging with new suppliers, to trialling technology in live environments, to building and testing prototypes. These activities aren’t always connected, and they don’t need to be. What matters is that learning feeds back into how we design and deliver capability."
        },
        {
            "text": "Examples from across the year include:"
        },
        {
            "text": "Individually, these are small steps. Collectively, they help build evidence, confidence and shared understanding. "
        },
        {
            "text": "Working With Others"
        },
        {
            "text": "Progress in Defence digital depends on how well we work with others, across industry, government and with allies, and this year reinforced that strongly."
        },
        {
            "text": "Time spent with partners, whether at events like DSEI, DigiGov and MilSatCom, through supplier discussions, or during NATO activities such as CWIX and DiBaX, wasn’t about showcasing solutions. It was about understanding constraints, sharing perspectives and building confidence in how we work together."
        },
        {
            "text": "At DSEI, the Digital Architectural Workshop brought suppliers together for open, practical discussion about standards, principles and interoperability. What stood out was a shared appetite for clarity and consistency, and in how we collaborate and evolve expectations over time."
        },
        {
            "text": "These conversations helped sharpen where architectural alignment genuinely adds value, where flexibility is needed, and where we should focus effort rather than spread it thinly. They also reinforced that progress comes from trust and continuity, not one-off engagements."
        },
        {
            "text": "Taken together, this engagement has helped create a more informed, more realistic basis for partnership. It is one that supports delivery today while shaping how we build and integrate capability in the future. "
        },
        {
            "text": "Looking Ahead"
        },
        {
            "text": "Work is underway to define a clearer north star for the Digital Backbone, setting out direction while recognising the realities of a large, brownfield estate. That work will mature as priorities, funding and business cases become clearer."
        },
        {
            "text": "digital.mod.uk will continue to play a central role in making standards, guidance and learning easier to find and use, for both MOD teams and partners. "
        },
        {
            "text": "I’m proud of the work that’s been delivered and the way teams have gone about it. There’s more to do, but the progress made this year gives me confidence in the direction we’re heading. Thank you to everyone across Defence, industry and government who has contributed along the way."
        }
    ]
}