{
    "url": "https://mhclgmedia.blog.gov.uk/2026/02/05/decent-homes-standard/",
    "title": "Decent Homes Standard",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-02-05T11:36:57+00:00",
    "content": [
        {
            "text": "There has been coverage and discussion on social media about the Decent Homes Standard and what that means for private renters. "
        },
        {
            "text": "Read more here about the changes we’re making and why, as well as the new rights and tough rules that will be in place to protect renters."
        },
        {
            "text": "🚀 Firstly, big improvements are coming "
        },
        {
            "text": "We're making big changes that aim to make rented homes safer, warmer, and healthier for tenants. For example, last week we announced the updated Decent Homes Standard that will apply to the PRS from 2035."
        },
        {
            "text": "📅 Why 2035? "
        },
        {
            "text": "Well, there’s a lot happening and landlords have a lot to take in. That’s why there’s an implementation period, giving landlords time to get their properties up to scratch and meet the new rules, including those in the Renters’ Rights Act. Social landlords had similar time to prepare when the Decent Homes Standard first came in, so this is fair."
        },
        {
            "text": "🏡 But this is just one part of lots we’re doing to make homes safer for tenants, and some changes will happen sooner "
        },
        {
            "text": "We’re introducing a Private Landlord Ombudsman, to sort out complaints quickly, including where landlords haven’t met requirements on standards. The plan is for this to go live from 2028."
        },
        {
            "text": "And from 2030 the new energy efficiency standards mean tenants will get cheaper energy bills and homes that are less likely to have damp and mould as a result. Landlords should start working on these improvements now."
        },
        {
            "text": "We’re also working to extend Awaab’s Law – which give specific time limits for landlords to act to fix serious problems - to private rentals. We’ll provide more details on this when we consult on it soon."
        },
        {
            "text": "🔧 The rules for landlords are already clear: fix serious problems now"
        },
        {
            "text": "If you’re a landlord, you must already make sure your property is free of Category 1 hazards – these are the most serious risks, as defined by the Housing Health and Safety Rating System."
        },
        {
            "text": "And councils already have the power to issue big fines to landlords who don’t sort out these major problems."
        },
        {
            "text": "💸 Bigger fines are coming"
        },
        {
            "text": " Under the Renters’ Rights Act, the maximum fine for failing to address serious hazards following a request from the council will rise from £30,000 to £40,000 starting 1st May. Plus, there’s a brand new fine of up to £7,000 that can be given straight away if a landlord hasn’t taken practical steps to fix a Category 1 hazard. This new fine is coming this summer."
        }
    ]
}