{
    "url": "https://dragonsden.blog.gov.uk/2026/02/05/dragons-den-ip-blog-series-23-episode-2/",
    "title": "Dragons Den IP Blog - Series 23 Episode 2",
    "authors": [
        "Kelsey Jones"
    ],
    "categories": [
        "Business",
        "Enforcing your IP",
        "IP",
        "Licensing",
        "Patents"
    ],
    "pub_date": "2026-02-05T21:00:00+00:00",
    "content": [
        {
            "text": "It's been a while since I last wrote a Dragons’ Den blog, and what an episode to return to! I could almost believe tonight’s products were designed just for me:"
        },
        {
            "text": "I may not be a golfer, (the fourth pitch) but that didn’t stop me from being thoroughly impressed by every entrepreneur who entered the Den this evening."
        },
        {
            "heading": 3,
            "text": "The Beauty of Waste"
        },
        {
            "text": "Like many of my peers, I’m passionate about the environment and mindful of the products I buy. The first entrepreneur, Dani, founder of My Skin Feels (link), seemed to speak directly to me. Her business focuses on how skin feels as well as how it looks, offering products made from food waste that are 99% vegan and suitable for sensitive skin. "
        },
        {
            "text": "Dani shared her extensive beauty industry experience, having worked as a social media and marketing manager at Charlotte Tilbury in its early days. It’s fair to say Charlotte Tilbury’s marketing has been a resounding success, given its status as a leading beauty brand. "
        },
        {
            "text": "I work for the IPO’s Enforcement team, so I have a keen interest in infringement. Charlotte Tilbury has faced some significant copycat cases over the years, expertly leveraging her IP rights to protect her designs. This is a reminder that IP isn’t just for lawyers or large companies; it’s a practical tool for any brand to safeguard what makes them unique. Understanding and utilising your rights early can make all the difference in protecting your reputation and customers from counterfeits. "
        },
        {
            "text": "To learn more about enforcing your IP, visit our business guidance (link)."
        },
        {
            "text": "I was delighted to see the Dragons share my enthusiasm for Dani’s clean-beauty venture. After considering offers from Deborah Meaden, Gary Neville, and Peter Jones, Dani happily accepted a £50,000 split between Deborah and Gary, each taking 10% of the business."
        },
        {
            "heading": 3,
            "text": "From Basket to Bank "
        },
        {
            "text": "It’s a challenging time to save money, but one entrepreneur was determined to help us put our savings towards our future rather than interest payments. Jinesh entered the Den to pitch Sprive (link)- a free app that collects cashback from everyday purchases and automatically channels it into mortgage payments. As someone always on the lookout for smarter ways to manage my money, this caught my attention straight away. "
        },
        {
            "text": "After some probing from the Dragons, Jinesh explained that Sprive supports 14 of the UK’s largest lenders and more than 85 well-loved British brands. The app works alongside other offers, such as ‘two for one’ deals and sales, helping users put up to £25 a month towards their mortgage, potentially saving thousands in interest. "
        },
        {
            "text": "Although he’s already raised approximately £4 million from investors, Jinesh was candid about seeking the Dragons’ household names and expertise to help market Sprive. Touker Suleyman, Deborah and Peter were all impressed by Jinesh’s background and the app’s potential, resulting in all three investing £50,000 for 5% equity each. "
        },
        {
            "heading": 3,
            "text": "Made with Love"
        },
        {
            "text": "The final pitch of the night came from the adorable married couple Tina and Olly, founders of Flavour Bombs (link). As I mentioned earlier, I’m a busy working mother who loves quick, easy meals but also has high standards when it comes to food. Tina described their product brilliantly: “imagine a bath bomb, but for your saucepan” - I was instantly hooked."
        },
        {
            "text": "Beyond impressing the Dragons with the taste of their Flavour Bomb, Tina and Olly also stood out for their savvy business approach. Investing only £300 of their own money, they’ve relied on profits alone for growth, coupled with smart TikTok marketing utilising Olly’s filmmaking skills."
        },
        {
            "text": "They received three offers from Peter, Gary, and Touker, ultimately accepting Peter’s £50,000 for a 25% stake (with the condition that future investments wouldn’t dilute his share). I’m eager to see how this partnership develops and can’t wait to try a Flavour Bomb myself!"
        },
        {
            "text": "Before I sign off, congratulations are also in order for Ben and Natalia Reeves, co-founders of 'Swish', a compact golf ball cleaner, who accepted a joint offer from Peter, Gary, and Touker. Each Dragon will take 10% of the business for a £30,000 investment."
        },
        {
            "text": "So, there we have it: four successful pitches and four delighted entrepreneurs. For more advice on using IP to strengthen your brand and protect your business, explore our IP for Business toolkit (link)."
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}