{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2026/02/05/national-apprenticeship-week-2026-my-apprenticeship-journey/",
    "title": "National Apprenticeship Week 2026: My apprenticeship journey ",
    "authors": [
        "gseprofession",
        "Esther Rowland"
    ],
    "categories": [
        "Guest Blog",
        "Learning & Development"
    ],
    "pub_date": "2026-02-05T15:15:38+00:00",
    "content": [
        {
            "text": "Esther Faith Rowland, Assistant Engineer – NPL "
        },
        {
            "text": "For National Apprenticeship Week 2026, Esther Faith Rowland, Assistant Engineer, shares her journey as an engineering apprentice at the National Physical Laboratory, reflecting on her personal growth throughout the apprenticeship. "
        },
        {
            "text": "Early inspiration and choosing the path"
        },
        {
            "text": "When I began my GCSEs, I had started to think about the career path I wanted to pursue. Through many conversations with my grandad about women in engineering during World War II, I decided I wanted to take the apprenticeship path towards becoming an engineer. I chose to study Maths and Physics at A Level, during which I spoke with my tutor about apprenticeships and they recommended the National Physical Laboratory (NPL) for me to apply to become an engineering apprentice."
        },
        {
            "text": "Getting started: college and hands-on learning"
        },
        {
            "text": "I began my apprenticeship in 2021, with my first year being at college four days a week, getting hands-on practice through a Level 2 course in Advanced Manufacturing Engineering. This taught me the essential practical skills and knowledge for working in the manufacturing workshop at NPL, where I spent the remaining three years of my apprenticeship, with one day a week at college for the Level 3 and 4 qualifications."
        },
        {
            "text": "Developing Skills: workshops, design, and computer numerical control machines"
        },
        {
            "text": "During my second year, I got to meet my colleagues and work within a team. They have been encouraging throughout my apprenticeship as I have balanced studying my qualifications and training on the machines, ensuring I have the flexibility to achieve in both areas. At first, I started on the manual mills and lathes, machining components for the scientists within NPL. Then, I completed six weeks in the Design Office, where I learnt how to use SolidWorks, a Computer Aided Design (CAD) software used for creating solid models, technical drawings and assemblies. This was essential in strengthening my skill of interpreting engineering drawings and allows me to communicate with design engineers and customers about the specifications for components."
        },
        {
            "text": "In my third year, I moved to working on Computer Numerical Control (CNC) milling machines, learning how to program more complex components. Initially, I programmed on the machine using Siemens control, the programming language used by the XYZ 560 machine. As I progressed, I began using Fusion360, a Computer Aided Manufacture (CAM) software. This software could be for any machine in the workshop so I am able to continue producing components without much disruption. During my studies, NPL have given me the opportunity to work within different teams, ensuring I can develop a broad skillset in many facets of engineering, allowing me to become a well-rounded individual."
        },
        {
            "text": "Growth, confidence, and looking ahead "
        },
        {
            "text": "Throughout my apprenticeship I have learnt from colleagues, worked with customers, and showcased my teams’ work to the public during our Open Days. When I first joined, working within a male-dominated industry was daunting however, as I have had these interactions it has built my confidence and skillset. My workplace is also diverse in age and experience and this has been a great way to learn and develop. In four years, I have learnt so much more than I thought I could and it was down to persevering, connecting with people and not being afraid to ask questions. "
        },
        {
            "text": "Find out more about the Government Science and Engineering (GSE) profession!  "
        },
        {
            "text": "Visit the Government Science and Engineering careers website to explore the diverse expertise shaping government.  "
        }
    ]
}