{
    "url": "https://technology.blog.gov.uk/2026/02/05/understanding-technical-architecture-across-local-government/",
    "title": "Understanding technical architecture across local government ",
    "authors": [
        "Bisi Olowu, GDS Business Analyst"
    ],
    "categories": [
        "Architecture",
        "Technology",
        "Transformation"
    ],
    "pub_date": "2026-02-05T10:38:24+00:00",
    "content": [
        {
            "text": "Over the past few months at the Government Digital Service, we’ve been looking closely at how councils describe their technology. Not just the systems they use, but the wider structures that sit behind them: the architecture, strategies, standards and principles that shape how digital services are delivered day-to-day. "
        },
        {
            "text": "This work has involved reviewing a broad set of technical and digital documents from councils across the country, where there are publicly shared artefacts of their technical documents, from ICT strategies and enterprise architecture papers to application landscapes, and digital roadmaps. Together, these artefacts form the basis of how services are designed, integrated and supported. "
        },
        {
            "text": "As outlined in our earlier ‘Sourcing the stack’ blog, councils often face the same technology challenges but solve them separately. This analysis of technical architecture shows just how much potential there is to address these challenges together and highlights the need for a shared approach to council technology. "
        },
        {
            "heading": 2,
            "text": "An inconsistent landscape "
        },
        {
            "text": "We found that councils tend to use many of the same architectural components: case and document management systems, data platforms, integration layers and cloud services. But the way these components are documented varies greatly. "
        },
        {
            "text": "Some councils publish detailed architecture diagrams that cover applications, infrastructure, data flows and governance. Others provide high-level ICT strategies with little technical depth. In many cases, information about integration, data standards, and governance are not fully documented or are missing entirely. "
        },
        {
            "text": "This inconsistency shows up in several areas including: "
        },
        {
            "text": "These differences make it harder to compare approaches, learn from one another, or identify opportunities for reuse and alignment.  "
        },
        {
            "heading": 2,
            "text": "The challenge "
        },
        {
            "text": "When every council documents technology differently, it becomes challenging to: "
        },
        {
            "text": "Yet the opportunity is clear. There is a huge amount of tacit knowledge in councils about what good looks like. Many have already developed strong architecture principles or domain-specific models. What’s missing is a  shared foundation that brings these elements together. "
        },
        {
            "heading": 2,
            "text": "The opportunity: a shared technical architecture model "
        },
        {
            "text": "These gaps in documentation create the space to define a common technical architecture model that councils can use to describe their technology consistently. A model that: "
        },
        {
            "text": "This wouldn’t replace local autonomy or force councils into a single stack. Instead, it provides a shared language: a way to map existing technology into a common frame so councils can see where they align, where they differ, and where collaboration makes sense. "
        },
        {
            "heading": 2,
            "text": "What comes next "
        },
        {
            "text": "Our findings provide a platform to propose a change to a common vision for local government technology.  "
        },
        {
            "text": "On 12 December we hosted a webinar attended by over 200 people from across local government and on 13 January we ran a workshop for vendors with techUK, to discuss how shared products and data integration can drive better outcomes for councils and communities. "
        },
        {
            "text": "We’ll also be talking with individual digital practitioners, and groups of local and regional authorities. "
        },
        {
            "text": "We’re inviting colleagues from local and central government to join our next Sourcing the Stack webinar in February. You can register now to hear more about our evolving vision for a shared local government technology stack – and how you can help shape it."
        },
        {
            "text": "These webinars and workshops will help us co-create a common vision for the technology used to deliver services, a shared understanding of where councils are already aligned, and where they want to be in the future. "
        },
        {
            "text": "This vision will inform the foundations of a shared technical architecture model and help shape the principles and components that councils can use to describe their technology consistently. It will also guide our work to identify opportunities for reuse, reduce duplication and support better digital services. "
        },
        {
            "text": "As the workshops progress, we’ll continue analysing the patterns emerging from councils’ current architectures and refine the model with real input from the people designing and delivering services every day. Our aim is to build something practical and collaborative, a model created with councils, not for them. "
        }
    ]
}