{
    "url": "https://ukhsa.blog.gov.uk/2026/02/05/what-is-burkholderia-stabilis-and-why-should-i-check-my-first-aid-kit/",
    "title": "What is Burkholderia stabilis, and why should I check my first aid kit?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2026-02-05T15:36:57+01:00",
    "content": [
        {
            "text": "Burkholderia are a type of bacteria found naturally in the environment, including in soil and water. Burkholderia stabilis is one species within this group. While many people never encounter problems with this type of bacteria, it can cause serious infections in certain circumstances, particularly among vulnerable individuals."
        },
        {
            "text": "Certain non-sterile alcohol-free wipes have been linked to a recent outbreak of Burkholderia stabilis in the UK. Affected products have been withdrawn from sale, but some may still be found in first aid kits or in people's homes. These products are wipes that are not labelled as “sterile”. UKHSA advise people to check for these wipes in their home, including in first aid kits:"
        },
        {
            "text": "If you have any of these products, stop using them immediately and dispose of them in standard household waste.  It is important to only use wipes marked as ‘sterile’ on broken skin such as wounds, scratches, or where you can see blood - this reduces the chances of germs getting into the body and causing infections."
        },
        {
            "heading": 2,
            "text": "Who is most at risk?"
        },
        {
            "text": "Some people are more at risk of serious illness following exposure to Burkholderia stabilis than others – including:  "
        },
        {
            "heading": 2,
            "text": "How might someone become infected?"
        },
        {
            "text": "The risk of acquiring infection is generally very low. Infections can occur through contact with contaminated products on broken or damaged skin, or through introduction of bacteria through medical devices such as intravenous lines"
        },
        {
            "heading": 2,
            "text": "What are the symptoms if you are infected?"
        },
        {
            "text": "Symptoms of Burkholderia stabilis infection can vary depending on the site and severity of infection:"
        },
        {
            "text": "If you have concerns about a wound that isn't healing properly or you develop a fever following an injury, contact NHS 111 immediately. If you have an intravenous line and have any concerns you should contact your care team.  "
        },
        {
            "heading": 2,
            "text": "What can I do to avoid the risk of infection?"
        },
        {
            "text": "To reduce your risk of infection:"
        },
        {
            "heading": 2,
            "text": "What is UKHSA’s role in this area?"
        },
        {
            "text": "Our responsibilities include investigating outbreaks – we monitor patterns of infection across the UK and investigate potential outbreaks to identify their sources. This can involve testing products or materials that may be linked to infections."
        },
        {
            "text": "When risks are identified, we issue safety alerts to healthcare professionals to ensure they have the information needed to protect patients. We also develop and share guidance on preventing and controlling infections in healthcare settings and the wider community."
        },
        {
            "text": "An important part of our remit is to keep the public informed about health risks and the steps they can take to stay safe."
        }
    ]
}