{
    "url": "https://defrafarming.blog.gov.uk/2022/12/08/an-update-on-the-first-round-of-landscape-recovery-projects/",
    "title": "An update on the first round of Landscape Recovery projects",
    "authors": [
        "Sam Burford"
    ],
    "categories": [
        "A view from the farm",
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2022-12-08T12:35:26+00:00",
    "content": [
        {
            "text": "In summer, we announced the 22 projects chosen for the first round of Landscape Recovery."
        },
        {
            "text": "Landscape Recovery supports landowners and managers to take a large-scale, long-term approach to producing environmental and climate goods on their land.  "
        },
        {
            "text": "We initially said we would recruit up to 15 projects, but we were so impressed with the quality of applications that we ended up extending this to 22. "
        },
        {
            "text": "The 22 projects represent hundreds of farmers and landowner working together. "
        },
        {
            "text": "They will be awarded a share of around £12 million in development grants over the next 2 years to help them finalise their delivery plans to restore rivers, boost biodiversity and much more.  "
        },
        {
            "text": "In this post, I’ll share more about how the projects were assessed and selected and the road ahead. "
        },
        {
            "heading": 2,
            "text": "Improving landscapes and reversing decline "
        },
        {
            "text": "In the first round, projects were selected through a competitive application process.  "
        },
        {
            "text": "Applicants were assessed against selection criteria which considered their feasibility, costs and environmental and social benefits by a panel of subject matter experts. Through a series of moderation meetings, the panel reached consensus on the scores."
        },
        {
            "text": "We were very pleased with range of projects that we were able to attract. "
        },
        {
            "text": "From creating wetland habitats on the climate-vulnerable Somerset Levels and Moors, to fostering highly productive farming and biodiversity through the Breckland Farmers Wildlife Network, to joining upland habitats through a wildlife rich nature network corridor in the South Pennines. "
        },
        {
            "text": "The successful initiatives demonstrated pioneering ideas that will improve the rural landscape and reverse the decline in nature. "
        },
        {
            "text": "The successful projects in the first-round of Landscape Recovery are: "
        },
        {
            "text": "The majority of projects involve groups of land managers and farmers, including tenants, working together to deliver a range of environmental benefits across farmland and rural landscapes.  "
        },
        {
            "text": "Collectively, the projects cover over 40,000 hectares. They aim to restore nearly 700km of rivers and protect and provide habitat for at least 263 species.  "
        },
        {
            "text": "We’ve almost finished enrolling projects. This has been led by colleagues in the Environment Agency and Natural England.  "
        },
        {
            "text": "Projects will then move into the project development phase, in which they will have up to 2 years to complete the agreed project development activities. These activities will include developing detailed land management plans, quantifying environmental and social outcomes and assessing the impact on food production. "
        },
        {
            "text": "We expect some projects to complete this phase more quickly than others. Subject to reaching agreement on suitable funding, projects will then move into implementation. "
        },
        {
            "text": "This is all progressing as planned, and we’ve had great feedback. "
        },
        {
            "heading": 2,
            "text": "Project spotlight "
        },
        {
            "text": "In Kent, the Darent Valley Farmer Cluster plan to join forces with Kent Wildlife Trust and more local organisations to carry out upper/middle catchment chalk river restoration in Kent Downs Area of Natural Beauty (AONB). The project plans to improve hydrology and aquatic biodiversity by removing weirs and other blockers, improving existing riparian habitat, and creating a habitat mosaic. "
        },
        {
            "text": "Meanwhile, over 200km away, is the nationally significant Eelscapes project, set in one of the UK’s most important river systems: the Severn Vale. The vision is to restore naturally functioning floodplain wetlands that support the recovery of the iconic and threatened species which depend upon them, including European Eel and True Fox-sedge. "
        },
        {
            "text": "Our Landscape Recovery projects support a wide range of habitats, facilitating natural regeneration and habitat recovery."
        },
        {
            "text": "In Yorkshire, a consortium of ten farmers, landowners and conservation organisations led by the Yorkshire Wildlife Trust will develop The Three Dales project. This innovative scheme aims to bring into restoration a large area of the western Yorkshire Dales uplands, creating habitats for a range of species including black grouse, curlew and ring ouzels."
        },
        {
            "text": "Our view is that food production, farm businesses and environment can, and must, go hand in hand."
        },
        {
            "text": "The North East Cotswolds Farmer Cluster project seeks to restore a catchment-wide habitat mosaic along the River Evenlode. It involves 43 farmers and land within their farm holdings across the designated National Landscape. Not only will this project enhance the biodiversity of this unique landscape to enable ecosystem recovery, but it will also reconnect the river and tributaries to their floodplains, helping to improve water quality and adapt to climate change."
        },
        {
            "text": "We want to give even more inspiring and innovative projects this great opportunity, so we are keen to launch another round of Landscape Recovery as soon as possible. We are currently working on this and will share more details in the new year. "
        }
    ]
}