{
    "url": "https://ofqual.blog.gov.uk/2022/12/08/better-information-about-qualifications-what-would-help-you/",
    "title": "Better information about qualifications – what would help you?",
    "authors": [
        "Tom Barcham"
    ],
    "categories": [
        "Other"
    ],
    "pub_date": "2022-12-08T16:12:04+00:00",
    "content": [
        {
            "text": "Ofqual has published a survey to find out what information is most useful for people searching for qualifications, how Ofqual’s Register contributes to this, and what enhancements could make it a more valuable service for you. You can share your views to help shape the future of the Register."
        },
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "text": "In addition to maintaining quality and standards in regulated qualifications, one of Ofqual's responsibilities is to make sure that students, teachers, training providers, and other users have information on the full range of qualifications that we regulate. We provide this information through the Register of Regulated Qualifications, often just called the ‘Register'."
        },
        {
            "text": "The Register contains details about the qualifications we regulate and the awarding organisations that offer them, and it is visited tens of thousands of times each month. There is a wide range of qualifications available, taking between days and years to complete, covering dozens of different subject areas, and spanning across the full breadth of levels. While the Register already helps users to navigate this, one of our priorities for 2022 to 2025, as stated in our corporate plan, is to improve clarity, effectiveness and efficiency in the qualifications market. To support this, we're redeveloping the Register to give clear and relevant information that better supports your decision making when choosing a regulated qualification."
        },
        {
            "heading": 2,
            "text": "Understanding your needs"
        },
        {
            "text": "While this may mean changes for the Register in the future, the work is just beginning as we engage with users about their needs and experiences. There are many current and potential users we want to include in our early research, ranging from students and apprentices to teachers, from employers to schools and colleges, and from careers advisers to sector stakeholders. We want to understand the needs of these (and other) users to inform the changes we make."
        },
        {
            "text": "As part of our research we've published a survey to help understand what information you use when finding out about qualifications and how the Register can support this. You can complete a short survey (3 to 5 minutes) or, if you have more time, a longer version. We welcome your views, whether you are a current user of the Register, or are someone who would like to make more use of it. By doing so, you’ll be helping to inform and shape the future of qualifications information available through the service."
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "You can help us enhance the Register service by:"
        },
        {
            "text": "Tom Barcham\nAssociate Director, Digital Regulation"
        }
    ]
}