{
    "url": "https://deframedia.blog.gov.uk/2022/12/08/coverage-of-the-chief-medical-officers-air-pollution-annual-report/",
    "title": "Coverage of the Chief Medical Officer’s air pollution annual report",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-12-08T16:59:14+00:00",
    "content": [
        {
            "text": "There has been coverage today in the Guardian, Financial Times, Independent, Telegraph, Evening Standard and Daily Mail of England’s Chief Medical Officer, Chris Whitty, who has called for further action to reduce air pollution in his annual report."
        },
        {
            "text": "The Government is committed to cutting air pollution from all forms of transport. Air pollution has reduced significantly since 2010. Emissions of nitrogen oxides have fallen by 44% and are at their lowest level since records began, and fine particulate matter, the air pollutant that has the most significant impact on health, has reduced by 18%."
        },
        {
            "text": "Professor Chris Whitty, Chief Medical Officer said: "
        },
        {
            "text": "A Government spokesperson said: "
        },
        {
            "text": "Our Environment Act will drive forward long-lasting improvements to air quality through two new stretching air quality targets that will drive reductions in concentrations of fine particulate matter across the country and in locations where levels are highest, benefitting public health through decreased cases of diseases such as heart disease and cancer."
        },
        {
            "text": "We have also legislated the phasing out the sale of the most polluting solid fuels in domestic combustion. This area is critical as domestic burning is a major source of our national emissions of fine particulate matter. We are committed to driving down emissions across all modes of transport, and we recognise that making greener travel options the natural choice is a crucial way of achieving this."
        },
        {
            "text": "Read the Chief Medical Officer’s report in full here."
        }
    ]
}