{
    "url": "https://videosurveillance.blog.gov.uk/2022/12/08/digital-asbestos/",
    "title": "#DIGITAL ASBESTOS",
    "authors": [
        "ocullen"
    ],
    "categories": [
        "Biometrics and Surveillance Camera Commissioner",
        "CCTV",
        "Policing",
        "Privacy",
        "Surveillance cameras"
    ],
    "pub_date": "2022-12-08T11:03:53+00:00",
    "content": [
        {
            "text": "How surveillance sensitive are you? When it comes to public space surveillance it’s an important question if you happen to live in what is possibly the world’s most watched democracy."
        },
        {
            "text": "And it’s even more important now that the government has said that some leading providers of the surveillance cameras and systems watching our public spaces aren’t to be trusted.  The announcement on 25 November is the first public acknowledgement by the government of what security professionals have known for some time: that these companies can’t be trusted with sensitive surveillance functions.  They have also been directly linked with human rights atrocities perpetrated by the police human rights atrocities perpetrated by the police.  Both of these aspects raise significant trust issues.  Some local authorities and even government departments government departments stepped up to the ethical leadership plate - now the UK government has directed the removal of their surveillance systems initially from ‘sensitive’ government sites."
        },
        {
            "text": "So what’s next? I have likened the situation to digital asbestos because:"
        },
        {
            "text": "Local authorities and police forces in England and Wales have already been in contact with my office asking what constitutes a ‘sensitive’ site in their context.  The government hasn’t defined ‘sensitive’ and of course surveillance extends far beyond fixed geographical locations, so we must decide that for ourselves.  Here are some questions that might assist in framing the issues."
        },
        {
            "text": "To be clear, this isn’t a ‘police’ problem and it’s not a ‘local authority’ problem; it’s not just a procurement or an ethical one: it’s a democratic one.  And it’s international.  As such it extends far beyond my limited statutory functions for the government’s Surveillance Camera Code of Practice. Which is why I met the Security Minister to discuss whether the further risks and requirements from surveillance sensitivities might be taken forward by his recently announced Task Force.  My letter can be found here.  The meeting was brisk and business like and I left believing that things will begin to happen."
        },
        {
            "text": "Following almost two years of meetings with politicians, Peers, partners; with chief police officers, chief executive officers, experts in surveillance, cyber risks and ethics; with journalists, lawyers, academics and human rights practitioners all under the auspices of the National Surveillance Camera Strategy, I’m pleased to say that the issue has now moved on.  Since the Written Ministerial Statement we’re no longer talking about whether certain surveillance companies can be trusted any more.  We’re now asking ourselves what can be done to ensure that only those companies who have demonstrated their trustworthiness are working across any of our sensitive democratic infrastructure."
        },
        {
            "text": "There’s a Chinese proverb which says “even a journey of a thousand miles begins with one small step”.  This is that small step - and there’s a long way to go."
        }
    ]
}