{
    "url": "https://traderemedies.blog.gov.uk/2022/12/08/obr-forecasts-and-trade-remedies-whats-the-link/",
    "title": "OBR forecasts and trade remedies: what’s the link?",
    "authors": [
        "Marta Lopes, Economic Adviser"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-12-08T09:26:33+00:00",
    "content": [
        {
            "text": "On 17 November the Office for Budget Responsibility (OBR) economic forecasts were released alongside the government’s Autumn Statement. The OBR – an executive and non-departmental public body – conducts independent analysis to assess whether the government is likely to meet its spending plans. Their forecasts are important for policymakers to inform economic and fiscal policy, and for businesses to help them to plan their investments."
        },
        {
            "text": "Consequently, the OBR’s forecasts are also important for us at the TRA: how will the economic and fiscal outlook impact international trade and the world of trade remedies?"
        },
        {
            "heading": 2,
            "text": "What did the OBR say?"
        },
        {
            "text": "Let’s start with the OBR’s forecast itself."
        },
        {
            "text": "The OBR predicts that Consumer Price Inflation (CPI) will peak at 11.1% in the fourth quarter of 2022, followed by a decline before finally stabilising around the 2% target in 2027. As per Figure 1 below, the Government’s response to high energy prices (Energy Bill Relief Scheme for businesses and Energy Price Guarantee for consumers) is expected to reduce the peak of inflation in the coming year by around 2.5 percentage points."
        },
        {
            "text": "Figure 1: CPI inflation: contribution and trends"
        },
        {
            "text": "Higher inflation results in a decline in real wages which, alongside higher interest rates, lower house prices, and higher unemployment, will result in lower consumption and investment. As a result, the OBR expects Gross Domestic Product (GDP) to fall by 1.4% in 2023 (Figure 2). "
        },
        {
            "text": "Even though GDP growth in 2022 was 4.2%, the UK has already entered a recession with a GDP decline of 0.2% in the third quarter of 2022 and an expected further fall in the fourth quarter. This 4.2% growth in 2022 is due to the strong growth in the second half of 2021 as the economy recovered from the effects of the pandemic. Predicted GDP growth in 2024, albeit weak, is due to inflation being dragged below zero (see Figure 1), which results in the recovery of real incomes, consumption, and investment."
        },
        {
            "text": "Figure 2: Real GDP growth"
        },
        {
            "text": "In terms of the fiscal outlook, recent Government policy has been aimed at supporting households and businesses with energy bills specifically and those that are more economically disadvantaged in general. Government has also made plans to raise revenue by, for example, freezing income tax and employee National Insurance thresholds and reducing the 45% income tax threshold from £150,000 to £125,140."
        },
        {
            "text": "The net effect of the policies in the Autumn Statement will lead to an increase in borrowing in the next few years, but this will be reversed from 2024-25 onwards, aligned with the recovery of the UK economy. In addition to its legislative fiscal targets, the Government included two extra targets that aim to bring the underlying debt down as a share of GDP in 2017-28 while ensuring that Public Sector Net Borrowing does not exceed 3% of GDP. The OBR expects the Government to achieve both of these targets."
        },
        {
            "heading": 2,
            "text": "What about international trade?"
        },
        {
            "text": "As per Figure 3 below, the UK is running a trade deficit, meaning that the value of its imports exceeds the value of exports. This deficit negatively impacts GDP in any year, everything else being equal. The OBR forecasts the deficit to be much wider in 2022, with improvements afterwards."
        },
        {
            "text": "The widening of the trade deficit could be explained, among other factors, by lower global demand - as other major economies also face economic difficulties and therefore import less from the UK - and by a weaker sterling."
        },
        {
            "text": "Since March, the pound’s value relative to other major currencies – including the US dollar – has fallen, making imports much more expensive. The UK is heavily dependent on imports of key products that have now seen their prices rise significantly."
        },
        {
            "text": "For instance, the UK imports around half of its gas and food from international markets. In the first eight months of 2022, gas imports reached £31 billion, more than four times higher than in the same period in 2021. The OBR expects the trade deficit to narrow due to lower gas prices and the fall in the value of the pound (i.e. making foreign goods more expensive to buy) (Figure 3)."
        },
        {
            "text": "Figure 3: Current Account Balance"
        },
        {
            "heading": 2,
            "text": "What might this mean for trade remedies?"
        },
        {
            "text": "Lower domestic demand and higher energy costs will put pressure on UK businesses. However, a weaker pound will make imports less attractive and domestic exports more attractive so some businesses may benefit from improved international competitiveness."
        },
        {
            "text": "The net effect of these competing forces will differ across industries. Those more negatively impacted may choose to apply for trade remedies to reduce pressures on them, as long as they have evidence to demonstrate that they are being injured by dumped or subsidised imports."
        },
        {
            "text": "Energy intensive industries, such as steel, glass, ceramics, and cement, may be more negatively impacted. Some of these industries are already facing challenges. The majority of the TRA’s investigations are on steel related products and we also have cases relating to ceramic tiles and glass fibres."
        },
        {
            "text": "To help with energy costs, the UK Government created the Energy Bill Relief Scheme, which will be in place from 1 October 2022 to 31 March 2023. Several governments around the world have put similar measures in place. Depending on exactly how such support is provided, it is possible that it could be deemed to be countervailable under World Trade Organisation (WTO) rules, resulting in more trade remedy investigations."
        },
        {
            "text": "Households have also been heavily impacted with decreases in real wages (1.8% in 2022 and 2.2% in 2023). Therefore, trade remedy cases involving consumer goods will have to carefully consider the impact that a trade remedy measure might have on the price paid by the consumers. Any burden on consumers might be magnified in the context of the current cost of living crisis. The economic interest test, which is a key component of the UK’s trade remedy framework, considers the impact on affected industries and consumers in order to determine whether trade remedy measures would be in the overall economic interest. Some other countries also have similar tests within their trade remedy frameworks."
        },
        {
            "heading": 2,
            "text": "The economy and trade remedies: making the link"
        },
        {
            "text": "The OBR’s forecasts are heavily dependent on several global and domestic factors, with developments in the war in Ukraine playing a central role. A swift end to the war might precipitate recovery as food and energy prices and exports normalize, while a drawn-out conflict could delay it and further compound the current inflationary trajectory."
        },
        {
            "text": "Energy prices continue to be one of the key uncertainties. Gas prices will play a key role in determining the government’s fiscal cost of freezing prices and cost of further extending support to businesses, with the latter not having been accounted for in the OBR’s forecasts."
        },
        {
            "text": "It is certain that the coming years will be challenging for businesses and households. The extent to which the economic recession will impact the number of requests for investigations and the type of sectors applying is yet unknown. However, high energy costs are likely to create additional burden for industries that are already users of or subject to trade remedies."
        },
        {
            "text": "With such high levels of economic uncertainty, it is crucial that UK businesses know what tools are at their disposal if they feel they are affected by unfair trade practices – have a look at our brief introduction to how we can help UK businesses on this below."
        }
    ]
}