{
    "url": "https://ipo.blog.gov.uk/2022/12/08/one-ipo-transformation-first-glimpse-of-our-simplified-search-service/",
    "title": "One IPO Transformation: first glimpse of our simplified search service",
    "authors": [
        "Lucy Mills"
    ],
    "categories": [
        "Design",
        "Digital",
        "Innovation",
        "IPO",
        "Patents",
        "Trade marks",
        "Transformation",
        "User research"
    ],
    "pub_date": "2022-12-08T11:35:45+00:00",
    "content": [
        {
            "text": "There’s now less than one year to go until we start piloting the new ‘One IPO’ service for patents customers. In the latest of our series of transformation blogs, Lucy Mills, Project Lead, tells us about the new search service that will provide new tools to help you search and analyse IP."
        },
        {
            "text": "I’ve been working on major IT changes at IPO for over 30 years. When I first started, we had a purely paper-based search system for trade marks and no IT systems at all. To now be involved in such a big transformation of our search services is incredibly exciting!"
        },
        {
            "heading": 2,
            "text": "Why are we building a new search service?"
        },
        {
            "text": "At IPO we help people to get legal protection for their ideas, but also share those ideas so the whole of society can benefit. The new search service is fundamental to both of those goals. It’s essential that people are able to easily find information about what IP exists, and how they can make the most of the UK’s best ideas."
        },
        {
            "text": "But for too long this has been too difficult, even for IP experts. At the moment, you have to search for different IP rights in different places. You are very limited in what information you can search for – typically you need to search for a patent, trade mark or design by its unique reference number. It only works if you know exactly what you’re searching for. These are all things that we aim to put right with the new search."
        },
        {
            "heading": 2,
            "text": "What can you expect from the new service?"
        },
        {
            "text": "There are three key things that you can expect from the new search service:"
        },
        {
            "heading": 2,
            "text": "Where we are now"
        },
        {
            "text": "We are testing and refining early designs of the new search service. What we’ve worked on so far focuses on patents, but even at this early stage there’s plenty of benefits to see for trade marks and designs too."
        },
        {
            "text": "Below is a short video demonstration of an early design of the service. This is a very early version so there’s still plenty of time for changes and improvements."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "The new search will be the first part of the ‘One IPO’ service to be rolled out to customers, which is really exciting, but also a bit daunting! We’ll start piloting the search service for patents customers in June 2023, before launching for all patents customers in autumn 2023. Trade marks and designs will be added in 2025."
        },
        {
            "text": "In the next few weeks, we’ll start building the new service on our brand new 'One IPO' systems and keep testing and refining our designs as we get closer to the pilot."
        },
        {
            "heading": 2,
            "text": "What do you think?"
        },
        {
            "text": "We’re always keen to get more feedback in order to build services that work for you. Feel free to include any thoughts in the comments section, or if you’d like to see our new designs as we’re developing them, please email usertesting@ipo.gov.uk."
        }
    ]
}