{
    "url": "https://socialcare.blog.gov.uk/2022/12/08/positive-dementia-care-a-win-for-staff-and-residents/",
    "title": "Positive dementia care: a win for staff and residents",
    "authors": [
        "Victoria Edwards"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Dementia",
        "Workforce"
    ],
    "pub_date": "2022-12-08T12:13:06+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Care in the round"
        },
        {
            "text": "I’m the home manager at Vida Grange, one of Vida Healthcare’s care homes based in Harrogate. I’m taking this opportunity to highlight the work we're doing behind the scenes to help raise awareness around dementia and specialist care delivery in a care home."
        },
        {
            "text": "Every day is different, particularly for care settings specialising in residents living with dementia. I work closely with every resident to make sure they receive the right care, in consistent environments, to help reduce their stress levels. It’s crucial to us that everyone at Vida feels at home and we do everything we can to create a family feel."
        },
        {
            "text": "We achieve this through meaningful, therapeutic and enjoyable activities including musical performances and exercise classes, local community outings and social events, and regular contact and visits from families."
        },
        {
            "text": "It’s not only residents we support. Our staff are the lifeblood of the home and, without them, we simply wouldn’t be able to provide our residents with the care they need."
        },
        {
            "text": "Looking after my team at Vida Grange is extremely important, whether this is attending inductions at our training platform, Vida Academy, which supports staff with opportunities for career progression, or being present at job interviews to make sure we’re hiring people who share our values and passion for great care."
        },
        {
            "text": "My role also includes coordinating staff rotas, investigating HR-related matters and making sure the right staff are deployed in the right place at the right time."
        },
        {
            "heading": 2,
            "text": "15 years of caring"
        },
        {
            "text": "I joined the social care sector in 2007, supporting a group of care homes with hospitality-related services. After a period of intense training, I became home manager at a national care provider before moving to Vida."
        },
        {
            "text": "I’ve always specialised in dementia care, however Vida is the first care provider I’ve worked for specialising in this area. Many people who come to us are often at the later stages of their dementia journey, sometimes because other care homes no longer have the capability to provide the care they need. We are open to anyone at any stage, from diagnosis to palliative care."
        },
        {
            "text": "To work in social care, we must be passionate about giving the people we care for the best quality of life possible. It’s important to remember that just because someone is living with dementia, it doesn’t mean they can’t live well and it’s our job to make this a reality."
        },
        {
            "text": "To make sure our residents are happy and healthy, I visit the eight smaller houses that make up Vida Grange. This involves catching up with residents and staff across day and night shifts."
        },
        {
            "text": "Facilitating meetings and conversations with the families and friends of our residents is also crucial to keep them up-to-date with the daily lives of their loved ones when they can’t be there in person."
        },
        {
            "text": "However, it’s not always plain sailing and there are numerous challenges that care workers can experience. Working during the Covid pandemic was a particularly stressful time for my team and I. Even before Covid happened, the social care sector was dealing with recruitment and retention issues, alongside underfunding."
        },
        {
            "text": "The pandemic exacerbated this further, and also placed extreme pressures on staff, residents and their families. It was a very emotional time for everyone, with the regular changes in guidelines only adding to the pressure. However, overall we did the absolute best that we could and I’m so pleased to see things returning to normal, and families once again visiting our care homes."
        },
        {
            "text": "For more information, please visit www.vidahealthcare.co.uk"
        }
    ]
}