{
    "url": "https://hodigital.blog.gov.uk/2022/12/08/sharing-user-centred-design-lessons-learnt-at-the-home-office/",
    "title": "Sharing user-centred design lessons learnt at the Home Office",
    "authors": [
        "Chris Taylor, Head of User-Centred Design",
        "Sara Vincent, Head of Content Design"
    ],
    "categories": [
        "Continuous improvement",
        "User centred design"
    ],
    "pub_date": "2022-12-08T10:11:31+00:00",
    "content": [
        {
            "text": "For 8 years, the user-centred design (UCD) team in the Home Office were lucky enough to be led by the brilliant Katy Arnold, who grew design and research here from the ground up. Before she left her role she summarised what she learnt during her time establishing UCD at the Home Office. We’d like to share some of these lessons with you."
        },
        {
            "heading": 2,
            "text": "It’s important to bring people together"
        },
        {
            "text": "When Home Office Digital was being set up in 2014, we learnt from some brilliant people who were building teams at the Government Digital Service (GDS). They taught us how important it is to bring people together. So when our team was initially formed we established community meetups and they’re still running strong."
        },
        {
            "text": "Some are led by specific disciplines or business areas; others are open to anyone involved in UCD. They help people feel like they’re part of something bigger – a community of like-minded people who continually inspire and support each other to do amazing things."
        },
        {
            "heading": 2,
            "text": "Establish systems and processes to support your community"
        },
        {
            "text": "Early on we had a handful of people who 'did UCD' but we had no systems or processes in place. We’ve since set up usability labs, a design system, an ethics board, a user research repository and an award-winning Digital Development Programme."
        },
        {
            "text": "We’ve also raised the profile of accessibility and UCD across the organisation, establishing policy and innovation labs, and a dedicated accessibility and inclusion team along the way."
        },
        {
            "heading": 2,
            "text": "Hire the best"
        },
        {
            "text": "It’s crucial to hire the best people you can."
        },
        {
            "text": "This includes testing internal candidates against what the market has to offer and keeping standards high."
        },
        {
            "heading": 2,
            "text": "Do your best work and aim for impact"
        },
        {
            "text": "We’re delivering high-quality design and user research across a fascinating range of areas, including visas, passports, policing, refugees, and victims of modern slavery."
        },
        {
            "text": "In this way, we’re influencing how policy is implemented and bringing into focus the impact of design on how people experience government policies through their interactions with departments."
        },
        {
            "heading": 2,
            "text": "Get behind your strongest message"
        },
        {
            "text": "Early on, we understood that our strongest message was the importance of accessibility and inclusion on making better products and services."
        },
        {
            "text": "The emphasis we placed on inclusive design led to the creation of a number of products including some accessibility posters that have since gone viral and been translated into several languages. This helped us make the case for a dedicated accessibility and inclusion team."
        },
        {
            "heading": 2,
            "text": "Be adaptable and work closely with your delivery teams"
        },
        {
            "text": "We’ve built trust with our delivery teams. We understand the constraints they face, and we adapt the Service Standard to create successful solutions together."
        },
        {
            "text": "This is how we build support and momentum for becoming more user-centred in a complex organisation like ours."
        },
        {
            "heading": 2,
            "text": "Find allies to champion your ideas"
        },
        {
            "text": "We’ve learnt that when we give senior people enough knowledge about what UCD does they become strong allies who will champion our ideas."
        },
        {
            "text": "Put in the time to build your relationships and share what you’re working on. Be mindful of how your work contributes to wider business and strategic objectives and build your narrative and messaging around that."
        },
        {
            "text": "When big decisions are being made, having your allies in your corner can make all the difference."
        },
        {
            "heading": 2,
            "text": "Take a pragmatic approach to design standards"
        },
        {
            "text": "It's really common for designers and researchers to start off by trying to follow the Service Standard to the letter. But sometimes there are realities we have to face, such as resource or time limitations, so we have to find more pragmatic ways to get teams thinking and working."
        },
        {
            "text": "We need to get the ways of working right, make sure everyone is working to solve the same problem, fix small issues first to gain trust and prove value before turning to the theory."
        },
        {
            "heading": 2,
            "text": "Be respectful of the expertise at the table"
        },
        {
            "text": "It’s crucial to respect the expertise of everyone around the table. Designers aren’t the only ones who know how to fix a problem. But we do have a unique response to design problems and there are sensible reasons behind the challenges we put to delivery teams."
        },
        {
            "text": "All the people on a team have something to bring to the design process. It’s our role as designers to listen and make room for them to contribute. This is how we build trust and social capital, which is how we gain support for what we want to do."
        }
    ]
}