{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/12/08/want-to-work-with-the-digital-markets-unit/",
    "title": "Want to work with the Digital Markets Unit?",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA",
        "Markets"
    ],
    "pub_date": "2022-12-08T09:52:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making digital markets work for everyone"
        },
        {
            "text": "Are you excited about the potential of tech, but concerned about how it may affect society?"
        },
        {
            "text": "Have you ever wondered why your Airpods might not work properly with an Android phone? Or why nobody says to ‘Bing it’ or ‘DuckDuckGo it’?"
        },
        {
            "text": "If so, then you’re thinking about issues central to our work at the CMA’s Digital Markets Unit (DMU). These issues are important and complex. And our work in this area is growing."
        },
        {
            "heading": 3,
            "text": "Sign-up now to hear more about future job opportunities and careers events"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The benefits and challenges of digital markets"
        },
        {
            "text": "We believe in the benefits digital technologies and markets bring to consumers. The UK digital sector is growing faster than the rest of the economy, generating billions of pounds and millions of jobs."
        },
        {
            "text": "But we also believe in the need for clear rules, so competition remains fair and UK businesses and consumers benefit from this growth. We are seeing trends that, in the longer term, could lead to higher prices, less innovation and real consumer harms."
        },
        {
            "text": "The government recently announced that it will be accelerating the introduction of new rules to make sure digital markets work well, including equipping the DMU with new powers to address harms and promote innovation."
        },
        {
            "heading": 2,
            "text": "Making a real difference for UK consumers and businesses"
        },
        {
            "text": "Joining our team offers you the opportunity to scrutinise digital markets and shape the future of regulation in relation to one of the biggest policy challenges faced by governments and regulators."
        },
        {
            "text": "We recently announced an investigation into the way that Apple and Google dominate the mobile browser market and how Apple restricts cloud gaming. And just last week we published the findings from our study into the music streaming market. We are also taking action beyond the ‘Big Tech’ firms, for example working to improve the information provided by influencers when promoting products on social media and giving people advice on how to avoid online scams (‘Rip Off, Tip Off’)."
        },
        {
            "text": "We are also working at the cutting edge of digital technology. Working closely with the CMA’s Data, Technology and Analytics Unit, we are analysing how tech companies’ machine-learning models work and considering the impact of these algorithms on markets and consumers. In partnership with other UK regulators through the Digital Regulation Cooperation Forum we have contributed to debates surrounding Web 3.0 and distributed ledger technology and considered how we can support the emergence of algorithm auditing and compliance."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Come and join our growing team"
        },
        {
            "text": "As we grow the DMU over the next few years to support our expanded role, we are keen to hear from people with a range of skills and expertise – you may have experience working in digital markets, or using data and technology, or research, policy, government, regulatory, economics or legal skills."
        },
        {
            "heading": 2,
            "text": "If this sounds like you, please register your interest in a career in digital markets at the CMA."
        },
        {
            "text": "We are planning events to coincide with active recruitment early in the new year; if you have any of these skills but aren’t sure whether you’d fit our criteria we encourage you to register your interest and attend one of these events to hear more about the roles on offer and working at the CMA."
        },
        {
            "heading": 2,
            "text": "Inclusivity, flexibility, and opportunity in the DMU"
        },
        {
            "text": "Learning and development are important to us and we make sure people have time to focus on building their areas of expertise, as well as opportunities to debate ideas as a team."
        },
        {
            "text": "We work hard, but flexibly and with a focus on collaboration. Many people in the team have alternative working patterns and the CMA operates a hybrid model, with a mix of office and home working."
        },
        {
            "text": "We are also growing our presence outside London, with established offices in Edinburgh, Belfast and Cardiff. A newly opened office in Manchester will be a key hub for the DMU."
        }
    ]
}