{
    "url": "https://forestrycommission.blog.gov.uk/2021/11/09/autumn-tis-the-season-for-managing-woodlands/",
    "title": "Autumn – ‘Tis the season for managing woodlands’",
    "authors": [
        "Marcus Stroud"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2021-11-09T16:00:09+00:00",
    "content": [
        {
            "text": "Autumn is a key time in the woodland calendar. It marks the start of tree planting season and visually it makes the biggest impact on our landscapes in the shortest amount of time, as the trees change colour and then lose their leaves."
        },
        {
            "text": "If you own a woodland, Autumn is an ideal time to get out into the trees and make sure your woodland is in the best health it can be to get through the cold, winter months."
        },
        {
            "text": "Here’s our tips for the best management practices to carry out in Autumn."
        },
        {
            "text": "During late Autumn the sap is sinking in the trees, so if you have any pruning, thinning or tree maintenance that needs to be done now is the time to do it. This is especially important for broadleaves, as you want to avoid the trees bleeding sap and becoming distressed. Now we are out of bird nesting season if you’re carrying out any hardwood felling, then you’ll also be ready for the annual winter hardwood auctions."
        },
        {
            "text": "If you have any tree guards which are no longer needed, or need removing and replacing, we recommend doing this now as the scrub and weed growth will be dying down. You can find guidance on how to reuse and recycle tree guards in our Tree Production: The use of tree shelters and guards publication on GOV.UK."
        },
        {
            "text": "The drop in temperature and the increase in rain at this time of year leads to softer ground, which makes it a good time to put up fencing to keep livestock or deer away from your trees. Of course, this time of year is also generally much cooler so you’ll work up less of a sweat pruning trees or building fences!"
        },
        {
            "text": "If you’re planning to expand your woodland or replant any felled areas this planting season, then you should look to choose and order your trees in advance. When you receive them, store the trees safely in a well ventilated and covered area. They can be planted anytime between Autumn and very early spring."
        },
        {
            "text": "As a woodland owner it’s important to protect your trees from pests and diseases, and some simple biosecurity measures can stop them from being introduced. Ask any visitors to clean their shoes and vehicles before and after entering your woodland. Falling leaves can carry fungal diseases in the leaf litter, and this measure will help prevent them from spreading."
        },
        {
            "text": "Keep an eye out for signs of disease in your trees. With the leaves off most broadleaf trees and some conifers, such as larch, Autumn can sometimes be a more difficult time to detect signs of ill health in the trees. Keep a close eye on the bark for lesions and weeping, as well as an eye up in the crown for dying, twiggy branches."
        },
        {
            "text": "Information on how to identify and report tree pests and diseases can be found on our GOV.UK Tree Pests and Diseases collection page"
        },
        {
            "text": "Finally, take some time for yourself to enjoy the last strains of sunshine filtering through the trees. Getting out into woodlands brings a variety of physical and mental health benefits, and working now to prepare your site for winter will bring a great sense of satisfaction."
        },
        {
            "text": "If you have children, send them on a leaf hunt whilst you work! Autumn is the best time to look for and identify leaves because they've only just fallen and haven't yet started to rot fully. When they’re back home, get them to create an autumn colour wheel from all the beautiful leaves they’ve collected."
        }
    ]
}