{
    "url": "https://dcmslibraries.blog.gov.uk/2021/11/09/climate-change-and-the-power-of-libraries/",
    "title": "Climate change and the power of libraries",
    "authors": [
        "Emma Noyce, Assistant Director: Culture and Information Services, Hampshire County Council"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2021-11-09T13:00:27+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The unequal impacts of climate change"
        },
        {
            "text": "In 2017, a UN Report on Climate Change and Social Equality[1] found that if you are from an already disadvantaged group, climate change will mean:"
        },
        {
            "text": "Put bluntly, climate change will affect everyone, but it will disproportionately affect people from disadvantaged groups and make existing inequalities that much worse.  And a key reason for this is a lack of information, awareness and support."
        },
        {
            "heading": 2,
            "text": "So how can libraries help?"
        },
        {
            "text": "In Hampshire Libraries, we wanted to explore the particular role that we could play in sharing information about climate change and making this accessible to groups who might not currently be part of the climate change conversation. We looked at where our power to make a difference might come from and identified four key areas:"
        },
        {
            "heading": 2,
            "text": "Improving the energy efficiency of our buildings"
        },
        {
            "text": "Like many others, we initially focused on our own environmental impact and how we can reduce this – for example by utilising Government Decarbonisation and Salix funding to improve the energy efficiency of our libraries through installing more energy efficient lighting, Solar PV and replacement windows[2].  We have installed smart meters in all our libraries and data is available to all library managers – so we can start to understand our energy usage and the impact of our actions."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Resources, access to information and alternative ways to engage with the Climate Change message"
        },
        {
            "text": "We also looked at the core role of libraries in providing access to information and resources.  This year we have launched climate change related book collections (including our Earth Heroes collection for young children).  We have also started programming a range of events and activities which help to share climate change messages in novel and innovative ways to different audiences.  "
        },
        {
            "heading": 2,
            "text": "Developing our libraries as hubs for skills and community action"
        },
        {
            "text": "Finally, we wanted to look at how we can work with community organisations to welcome a range of new initiatives into libraries. Food waste reduction is just one area where we feel we can have real impact, and this year we have welcomed organisations providing community fridges and pantries into two of our libraries. Not only does this bring in new people who might not have visited before, but we have been able to develop free courses (for example on cooking from scratch or helping people pay less for utilities) to better support these visitors."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "In the future, we want to draw this all together so we can develop our libraries as truly ‘eco-excellent’ buildings; buildings which have the lowest possible environmental impact themselves and work in the heart of communities as centres for engagement on climate change issues. When it comes to climate change, it is absolutely clear that there is a real opportunity for libraries across the UK to play a leading role, making sure everyone has equal access to knowledge, information and support. It’s what we do every day, after all."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Footnotes"
        },
        {
            "text": "[1] wp152_2017.pdf (un.org) page 6"
        },
        {
            "text": "[2] £26.9m investment in carbon savings for County Council buildings and local schools | Hampshire County Council (hants.gov.uk)"
        }
    ]
}