{
    "url": "https://educationhub.blog.gov.uk/2021/11/09/cop-26-everything-you-need-to-know-about-the-departments-quest-to-put-climate-change-at-the-heart-of-education/",
    "title": "COP 26: Everything you need to know about the department’s quest to put climate change at the heart of education",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Conference",
        "Primary Schools",
        "Secondary schools"
    ],
    "pub_date": "2021-11-09T13:09:14+00:00",
    "content": [
        {
            "text": "We are putting climate change at the heart of education. As part of COP26, the 2021 United Nations climate change conference, the Education Secretary set out his vision to empower all young people in the importance of conserving and protecting our planet, as well as developing the skills needed to solve the problems. The climate talks bring together heads of state, climate experts and campaigners to agree coordinated action to tackle climate change."
        },
        {
            "text": "Here’s everything you need to know about the action the department is taking and proposals being developed through wider engagement with stakeholders and young people."
        },
        {
            "heading": 3,
            "text": "Additional curriculum support for teachers "
        },
        {
            "text": "Teachers will be supported to deliver world-leading climate change education through a model primary science curriculum. The curriculum will be in place by 2023 and will teach children about nature and their impact on the world around them."
        },
        {
            "text": "Currently climate change is on the curriculum and taught in science, citizenship and geography from Key Stage 3 (the beginning of secondary school) onwards."
        },
        {
            "text": "In primary school (Key Stages 1 and 2) pupils are taught the core concepts – so what the climate is, how it changes, the difference between a man made and natural environment and where different types of animals live."
        },
        {
            "text": "What we’re introducing:"
        },
        {
            "text": "Primary"
        },
        {
            "text": "Secondary"
        },
        {
            "heading": 3,
            "text": "National Education Nature Park"
        },
        {
            "text": "School grounds alone in England cover an area over twice the size of Birmingham. The National Education Nature Park will encourage nurseries, schools, colleges and universities to think of this land as one whole ‘park’ with vast potential to help halt the decline of biodiversity in this country."
        },
        {
            "text": "As their work starts to have an impact, young people involved will upload their progress on the park’s digital mapping services. They will be able to see how the Park is ‘growing’ while increasing their knowledge of species and developing important skills, such as biodiversity mapping, data collection and analysis."
        },
        {
            "text": "The park will be developed in collaboration with children and young people and the many excellent stakeholders that work in this area."
        },
        {
            "heading": 3,
            "text": "The Climate Leaders Award"
        },
        {
            "text": "The Climate Leaders Award will help children and young people develop their skills and knowledge in biodiversity and sustainability, and celebrate and recognise their work in protecting the local environment. For example, young people may choose to undertake a project that delivers change in their local community, such as increasing the biodiversity of a neighbourhood piece of land or helping to deliver experiences for younger children to explore nature and local woodland."
        },
        {
            "text": "The award will be developed in collaboration with children and young people so that we can ensure it supports them in making an impact in their local communities."
        },
        {
            "text": "Pupils and students will be able to progress either individually or as groups through different levels of the award, ‘bronze’, ‘silver’ and ‘gold’, in a similar way to the Duke of Edinburgh Awards."
        },
        {
            "heading": 3,
            "text": "Net Zero Schools "
        },
        {
            "text": "These measures also build on the government’s pledge for every new school delivered under the department’s school rebuilding programme to be cleaner, greener and net-zero in operation."
        },
        {
            "text": "The Education Secretary also confirmed plans to test innovative new Energy Pods that could start to replace gas and coal boilers and supply a school’s entire heating and hot water without any carbon emissions."
        },
        {
            "text": "‘Energy Pods’ are a low to zero carbon plug and play technological solution that provide heating and hot water to existing school settings via solar panels and technology to maximise their output."
        },
        {
            "text": "The Pods will first be tested in some schools and colleges and if successful, they could be extended across the school estate and into more public sector buildings."
        },
        {
            "text": "Last week’s announcement comes as part of the Department’s commitment to keep the education system at the forefront of sustainability and innovation and help meet the government’s target of reducing emissions by 78% by 2035 and reaching net zero by 2050."
        }
    ]
}