{
    "url": "https://hmlandregistry.blog.gov.uk/2021/11/09/digital-applications-will-be-game-changing-for-you-and-us/",
    "title": "Digital applications will be game-changing – for you and us",
    "authors": [
        "Simon Hayes, Chief Executive and Chief Land Registrar"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services"
    ],
    "pub_date": "2021-11-09T09:17:23+00:00",
    "content": [
        {
            "text": "The pandemic has changed the way we work over the past 20 months, especially in the use of technology. With more of us working from home, the ability to access and work on documents online at all times has become even more critical for all of us, and the move towards paperless systems and processes has accelerated."
        },
        {
            "text": "In April this year, we took a step further in moving away from paper-based processes. We launched the Digital Registration Service on the HM Land Registy portal. Customers can now enter application details directly into the portal. Basic errors are checked automatically and the service creates the e-AP1 ready for submission. "
        },
        {
            "text": "As we’ve recently discussed, to date we have received more than 100,000 applications via this service and are delighted with the impact it’s having. Requisitions on basic errors are down 25%, and applications are processed and completed in half the time of an uploaded application. "
        },
        {
            "text": "Since launch, we have added a range of new transaction types into the service, including applications affecting more than one title. We are on track to support all applications to update the register via the Digital Registration Service by spring 2022. You can see what’s available now and what’s coming next on our plan. "
        },
        {
            "text": "We’re also investing in our Business Gateway platform, which already supports digital applications via case management systems and other technology platforms. New services have been launched this year with more to come in 2022. "
        },
        {
            "text": "The evidence suggests digital applications are game-changing. Given the mutual benefits – fewer errors, automation, and faster processing time – we want more customers to make the shift."
        },
        {
            "heading": 2,
            "text": "Get ready for the change"
        },
        {
            "text": "We’re asking customers who haven’t already moved over, to start now by considering how they will create and submit digital AP1 applications in 2022. We know that many will use the Digital Registration Service on the HM Land Registry portal and you can start using it now. For customers who create their AP1s using a case management system, forms provider or other software, we’d encourage you to start talking to us or your technology partner about connecting to HM Land Registry's Business Gateway  to submit applications digitally. See an overview of the services via this short video. "
        },
        {
            "text": "A digital application process, based on data rather than traditional paper-based methods, is fundamental to transforming the way we register land and ultimately will play a vital role in improving the end-to-end conveyancing journey. Not only does it offer the immediate benefits of quicker processing times and fewer errors, but it opens the opportunity for further innovation in the future. "
        },
        {
            "text": "Ultimately, we will all benefit from a more efficient, and easy to use registration process. In the short-term we need to work together to overcome the hurdles that inevitably come with change.  "
        },
        {
            "text": "We know there is still work to do to make this transition a smooth one for all our customers and we are committed to working with you to resolve any issues ahead of November next year. We are keen to get your feedback on this change and understand how you plan to switch to digital AP1 applications. Please complete this short survey to share your views. "
        }
    ]
}