{
    "url": "https://deframedia.blog.gov.uk/2021/11/09/environment-bill-storm-overflows-amendment/",
    "title": "Environment Bill storm overflows amendment",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-09T13:34:34+00:00",
    "content": [
        {
            "text": "There has been widespread coverage including in BBC News Online, the Independent the  Guardian, the Express, the Sun, the Daily Mirror and the Press Association of the passing of the government’s amendment to the Environment Bill on storm overflows in the House of Commons yesterday evening."
        },
        {
            "text": "The new amendment strengthens the Environment Bill to ensure water companies secure a progressive reduction in the adverse impacts of discharges from storm overflows. This enshrines our position in law, and follows the direction in the government draft Strategic Policy Statement for Ofwat, published earlier this year, which makes clear that water companies must reduce storm overflows as a priority."
        },
        {
            "text": "The coverage reports on the response of campaign groups to the new amendment, many of whom said it failed to go far enough to tackle environmental damage, claiming our amendment is weaker than that proposed by the Duke of Wellington."
        },
        {
            "text": "These claims are not true. Our amendment will categorically reduce the amount of untreated sewage in our waters and means water companies must reduce the operation of storm overflows. Our version places an additional duty on water companies, bringing it under the Water Industry Act’s powerful enforcement mechanism."
        },
        {
            "text": "The Lords’ amendment does not include a workable enforcement mechanism, and does not allow Ofwat to fine, direct or otherwise force companies to comply with this duty, whereas our amendment ensures the regulator Ofwat can enforce the new duty on companies. As well as this, our new enforcement body, the Office for Environmental Protection, will hold Ofwat, the Government and other regulators to account in matters of environmental law."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "The Government amendment bolsters a raft of measures already being taken by Government through the Environment Bill to deliver progressive reductions in the adverse impacts of storm overflows on the environment and on public health."
        },
        {
            "text": "Our Environment Bill will ensure we deliver the most ambitious environmental programme of any country - transforming how we protect our natural environment, make better use of our resources and clean up our air and water."
        },
        {
            "text": "The Bill has entered the final stage of parliamentary process before it achieves Royal Assent."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}