{
    "url": "https://equalities.blog.gov.uk/2021/11/09/improving-maternal-health-disparities-my-recommendations-going-forward/",
    "title": "Improving Maternal Health Disparities: My recommendations going forward",
    "authors": [
        "Kemi Badenoch, Minister of State for Equalities",
        "Race Disparity Unit"
    ],
    "categories": [
        "Women"
    ],
    "pub_date": "2021-11-09T10:23:37+00:00",
    "content": [
        {
            "text": "The UK is one of the safest places in the world to give birth. Although maternal deaths are fortunately very rare, when they do happen, there are devastating consequences for families and children, and it is vital we tackle this issue."
        },
        {
            "text": "I was personally driven to understand the causes of stark ethnic disparities in maternal mortality, particularly for Black and Asian women, and do something about them. This is not only because I first became a Minister for Equalities upon my return from maternity leave at the height of the pandemic, but also because of my own experiences with difficult pregnancies. "
        },
        {
            "text": "Today, I am concluding a one-year investigative project I led, with the support of the Race Disparity Unit (RDU). Here I set out some of our key findings, lessons learned, and recommendations. "
        },
        {
            "text": "During the course of this project, I have met with expert midwives and healthcare professionals doing excellent work and everything they can to tackle these ethnic disparities and improve maternal health for all. "
        },
        {
            "text": "We know there is evidence of racism in individual women's experiences of care. This is unacceptable and must be eradicated, and the NHS is taking action to address this. But racism doesn’t explain everything, and any claim that it does is not only false, but counterproductive. "
        },
        {
            "text": "The data shows that personal health conditions, like heart disease, diabetes, and mental health, that pregnant women may have, even before they conceive, are significant contributory factors to these disparities. So, to address these deeply concerning statistics, we need to focus on tangible, achievable solutions - ones that we can all deliver from our respective roles."
        },
        {
            "text": "Understanding the numbers first is crucial. We must be careful and precise in our use of statistics. MBRRACE-UK has stressed the importance of qualifying the stark statistics we see in the media and from other politicians with absolute numbers to reassure women that maternal deaths are still very rare. "
        },
        {
            "text": "Using these numbers without context can put women off going for the prenatal checks that could save them. We must focus our efforts on ensuring women regularly attend their antenatal appointments to catch any issues before they become problems, as this has been found to be the number one thing they and clinicians can do to save lives. "
        },
        {
            "text": "We  do know, however, that for every death there are 100 women who suffer from long-term, pregnancy-related, health complications. That is why this government has commissioned research into disparities in these ‘near-miss’ cases, where the mother survives childbirth but suffers from long term health problems postpartum. This will allow us to devise interventions that impact larger numbers of women. "
        },
        {
            "text": "Following the findings of the Sewell Report into race and ethnic disparities, published earlier this year, last month the Health Secretary formally launched a new Office for Health Improvement and Disparities.  One of its priorities is to work alongside the NHS and others to better understand and address why maternal deaths, however few, seem to occur. Professor Dunkley-Bent, the Chief Midwifery Officer for England, is leading research as to why mortality rates are higher for some ethnic groups, and to consider the evidence on reducing the mortality rate."
        },
        {
            "text": "The low numbers of maternal deaths in this country also make understanding statistically significant changes and setting realistic and effective targets very difficult. However, even though setting a ‘maternal mortality reduction target’ doesn’t work statistically - the government still takes this issue very seriously and wants to address it. "
        },
        {
            "text": "The number one driver of safety has been found to be having the same clinical carer throughout pregnancy and birth. In particular, there is evidence that having access to the same midwife can improve access to care for women who find services hard to navigate, and leads to better coordination of their care between midwifery, specialist and obstetric services."
        },
        {
            "text": "Using these findings, NHS England and Improvement has set out its mission to ensure that, by 2024, 75% of black and Asian women, and a similar proportion of those women who live in the most deprived areas, will receive continuity of care from their midwife throughout pregnancy, labour and the postnatal period."
        },
        {
            "text": "Ethnic minority women themselves have been active and influential in creating the positive changes we are already seeing. NHS Trusts, local maternity systems, and clinical networks are having ongoing conversations with women across the country. They have been working with over 100 Maternity Voice Partnerships (MVPs) across England to ensure that services are responsive and inclusive. Researchers are also working with MVPs to ensure parents have all the data they need, and to put it into their personal contexts."
        },
        {
            "text": "We also know that the causes of good health outcomes are much wider than NHS services. It involves having good local infrastructure, transport, housing, and support for families, to level up regions facing disadvantage. In my new role as Minister of State for Levelling Up, I will continue to use these findings to support this government’s ambition to create a society where everyone, wherever they live, regardless of their background or circumstance, has access to the services they need to thrive in their community and take up every opportunity to succeed in all areas of their lives."
        },
        {
            "text": "I’m leaving my work in extremely capable hands. I have written to the new Patient Safety Minister Maria Caulfield MP and Chief Medical Officer Professor Chris Whitty who is leading the new Office for Health Improvement and Disparities, established following the recommendation of the Commission on Race and Ethnic Disparities report, with my lessons learned and recommendations going forward. This signals there is still more to be done, with a focus on improving data access and quality to strengthen the research base. "
        },
        {
            "text": "We must keep the momentum going and build upon positive improvements. Throughout this year-long project, I have been impressed by the incredible work going on across the healthcare sector, and the tireless, coordinated response from determined healthcare professionals working together to achieve the ambition of driving down disparities in outcomes. "
        },
        {
            "text": "By focusing on early intervention, ensuring the right local services are in place, and continuity of care is maintained throughout a woman’s pregnancy, we can ensure that we eradicate disparities."
        }
    ]
}