{
    "url": "https://ukhsa.blog.gov.uk/2021/11/09/understanding-the-health-effects-of-climate-change/",
    "title": "Understanding the health effects of climate change",
    "authors": [
        "Isabel Oliver"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2021-11-09T11:14:40+01:00",
    "content": [
        {
            "text": "Last week world leaders arrived in Scotland for twelve days of talks on how to tackle the huge global impacts of climate change."
        },
        {
            "text": "For UKHSA, our changing climate is one of the most challenging health security threats we face and understanding and mitigating its impact on our health is a key priority."
        },
        {
            "text": "We continue to be concerned that extreme weather, from heatwaves and flooding - through to the risk of mosquito-borne diseases becoming endemic - could cause increasing health and economic harm in the UK."
        },
        {
            "text": "In this blog we set out some of the key health challenges and UKHSA’s activities to tackle them."
        },
        {
            "heading": 3,
            "text": "Extreme weather events"
        },
        {
            "text": "The last decade has seen warmer and wetter weather than previous decades."
        },
        {
            "text": "While many enjoy hot weather, high temperatures already have consequences. In Summer 2020 we saw 2,556 all-cause excess deaths (excluding deaths from COVID-19) during episodes of heat."
        },
        {
            "text": "It is projected that numbers of heat related deaths will triple by 2050, with the hottest summers on record that we have observed in recent years, becoming simply “normal” summers."
        },
        {
            "text": "UKHSA’s scientists develop the evidence base and make the case for interventions such as modifications to housing as well as strengthening resilience within health and care systems, and raising public awareness, so people at risk can take appropriate protective actions (for instance modifying their behaviour and environments) prior to and during heatwaves."
        },
        {
            "text": "UKHSA’s scientists also work to understand the ‘urban heat island’ effect where cities are commonly observed to be hotter than surrounding rural areas. Our work looks at characterising and quantifying the impact urban heat has on health, as well as potential interventions (such as building modification) to reduce urban heat exposure."
        },
        {
            "text": "Flooding can also have impacts on our health and wellbeing, with our research showing that there are long term negative impacts on the mental health of people whose homes are flooded, or lives affected by flooding."
        },
        {
            "text": "Working in partnership with colleagues in the Met Office, we provide extreme weather early warning systems and ensure that we have surveillance systems to monitor health impacts both in real-time and longer term."
        },
        {
            "heading": 3,
            "text": "Changing disease risks from mosquitoes and ticks"
        },
        {
            "text": "Did you know that warmer temperatures could see non-native mosquito species establishing in parts of the UK, and the diseases they carry being transmitted to humans?"
        },
        {
            "text": "The UK already has around 30 species of mosquito, some causing nuisance biting. The emergence of mosquito-borne viruses, such as West Nile Virus, is an increasing risk to UK public health due to a warming climate, and we have already seen evidence of this virus in the Netherlands and Germany, and outbreaks in Italy associated with hot spring weather."
        },
        {
            "text": "Where we see extreme weather events and environmental changes that lead to more flooding (and the creation or expansion of wetlands) this affects both the density and distribution of native mosquitoes by providing new habitats for them. But a warming climate could also lead to non-native mosquitoes (such as the tropical species Aedes albopictus which has colonised Europe in recent decades) establishing and then increasing in numbers here in the UK. This increases the risk of diseases rarely seen in the UK such as dengue, chikungunya and Zika."
        },
        {
            "text": "Ticks are also a public health concern, with Lyme disease already endemic in the UK. Milder winters and springs will lengthen the periods ticks are active and biting (though it is also the case that warmer summers could limit their activity). Non-native ticks, imported on travelling pets and migratory birds, are now also being found in the UK, particularly associated with heatwave events, and their ability to survive and establish will be enhanced by climate change."
        },
        {
            "text": "UKHSA scientists keep a close eye on this issue, running surveillance and monitoring programmes to understand the activity and distribution of ticks and mosquitoes. We are also engaged in ongoing research to assess the impact of climate change on mosquito and tick distribution and the diseases they can transmit. This helps us raise awareness of strategies for managing the problem, including how the public can reduce their own risks."
        },
        {
            "heading": 3,
            "text": "Climate change can affect the air we breathe"
        },
        {
            "text": "Air pollution is a significant public health problem. Long term exposure (over years or lifetimes) reduces life expectancy, mainly due to cardiovascular and respiratory diseases and lung cancer, but it is also linked to dementia, cognitive decline and early life effects. Many people will also feel short term effects due to episodes of higher levels of air pollution, with effects on lung function, exacerbation of asthma and we also see increases in respiratory and cardiovascular hospital admissions."
        },
        {
            "text": "We know that air pollution levels are driven primarily by emissions such as those from vehicles or industry, which contribute to climate change. This is a vicious cycle as many experts note that more frequent and intense heat waves could lead to more episodes of high ozone and particulate matter (such as allergens in the air) which could harm health."
        },
        {
            "text": "UKHSA scientists have a crucial role in studying the evidence to understand the likely impacts of our changing climate on air quality and health. Through our wider work on all aspects of air quality we’ll further develop and share the evidence base on air pollution harm and make the case that measures to improve air quality can also offer wider public health and wellbeing mutual-benefits, including an improvement in overall environmental quality, increased physical activity due to less reliance on vehicles, noise reduction, greater road safety and climate change mitigation."
        },
        {
            "heading": 3,
            "text": "Impacts on our food supplies"
        },
        {
            "text": "Climate change is already having a negative impact on food and nutritional security, mainly through disrupted food production around the world, particularly in the Global South. This is leading to considerable health burdens, especially in poorer parts of the world."
        },
        {
            "text": "These impacts also pose risks to the UK food system. For instance, whilst foods like cereals, potatoes, dairy and eggs are predominantly produced in the UK, we are more dependent on imports for our supply of fruits, legumes and vegetables."
        },
        {
            "text": "A key role for UK experts and scientists is to understand and model the effects of changes to our food supplies on the ability of our citizens to have equal and equitable access to healthy and sustainable diets, and in turn the impacts this has on the health of the whole population here and globally."
        },
        {
            "text": "The relationship between food and climate is complex, and warmer summers, milder winters and higher rainfall may influence the spread or transmission of foodborne pathogens (bacteria or viruses) and potential occurrence of illness and outbreaks of food poisoning. The impacts of climate on risks to our food will need to be monitored closely in the years ahead."
        },
        {
            "heading": 3,
            "text": "UKHSA’s long term work on climate change and health"
        },
        {
            "text": "Alongside our research and surveillance programmes linked to specific health risks, such as air pollution or diseases carried by vectors like mosquitos or ticks, UKHSA also plays a role in monitoring and responding to the overall impact of climate change on health."
        },
        {
            "text": "We are currently working on the fourth iteration of the Health Effects of Climate Change in the UK report, produced periodically and last published in 2012. The new edition of this report will bring together the latest UK climate change projections and an assessment of the health risks posed by issues linked to climate change like weather and its extremes (temperature, flooding, droughts and wildfires), air pollution, allergens, UV radiation, infectious diseases, especially vector borne disease (transmitted by ticks and mosquitoes), water and foodborne illness."
        },
        {
            "text": "New aspects of the report include an assessment of the role that adaptations (such as changes to our living environments and behaviour) can take in reducing future climate-related health impacts, to inform national and local policy."
        },
        {
            "text": "The COVID-19 pandemic has reinforced that collaboration at global, national and local level is crucial in order to tackle the major threats we face and as UKHSA develops we are committed to forging new partnerships with government, academia, public and private sector organisations to strengthen the evidence-base, working with research funders to ensure gaps are addressed."
        },
        {
            "text": "And alongside building the evidence we want to connect science, policy and delivery to ensure scientific evidence can be translated into action."
        },
        {
            "text": "We will set out more detail on our climate change priorities later this year."
        }
    ]
}