{
    "url": "https://food.blog.gov.uk/2021/11/09/understanding-consumer-attitudes-to-healthy-and-sustainable-diets/",
    "title": "Understanding consumer attitudes to healthy and sustainable diets",
    "authors": [
        "Michelle Patel, Deputy Director, Analysis and Insight"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2021-11-09T10:21:46+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Joining the conversation around sustainable food production at COP26, Deputy Director, Analysis and Insight, Michelle Patel reflects on findings from our recent research into consumer attitudes towards healthy and sustainable diets, and what they mean for policy makers and the food industry."
        },
        {
            "text": " "
        },
        {
            "text": "People tend not to distinguish between different parts of the machinery of Government: they see the world of food more holistically. We strive to understand the consumer interest in food - you can’t do that without considering the consumer interest in sustainability."
        },
        {
            "text": "When people are confronted with the challenges, they start to interrogate their own consumption patterns and whether these are sustainable in the global context. They start at home and think about the changes they can make - by buying less and wasting less; eating less meat; or re-thinking purchasing habits like buying out of season. Others prefer not to change and would rather steps were taken to allow them to maintain their current lifestyles."
        },
        {
            "heading": 2,
            "text": "An environmentally friendly diet"
        },
        {
            "text": "In our recent nationally representative survey (August 2021) over half of us (54%) say they want to change their diet to make it more environmentally friendly. Only a minority (13%) told us that they would not want to change their diet for that reason."
        },
        {
            "text": "But, consumers feel that there are barriers that hinder their shift to a more sustainable diet, including the cost of sustainable foods (29%), not understanding what is sustainable and what is less sustainable (16%), limited choices for sustainable options (13%) and difficulty in forming new sustainable habits (13%). Many interventions have been trialled to encourage more sustainable diet choices, but none are a silver bullet and many, including labelling, do not necessarily lead to behaviour change in isolation."
        },
        {
            "text": "Meat and dairy reduction are polarising issues. Nine in ten of us eat meat regularly. While many people recognise the benefits of reducing their meat and dairy consumption, their interests, values, beliefs and what they can afford vary widely; all these influence their thoughts on this question. It is also a not unreasonable position when there is no general agreed amount that should be consumed either for health or for sustainability."
        },
        {
            "heading": 2,
            "text": "The role of consumers in a sustainable food system"
        },
        {
            "text": "Consumers sometimes feel that they themselves are unable to effect significant change in the context of the global, structural challenges facing the food system. When surveyed as part of our study earlier this year on food during the pandemic, 69% thought the Government should be doing a ‘great deal’ or a ‘fair amount’ to encourage people to eat more sustainable diets."
        },
        {
            "text": "However, they think that food producers and manufacturers are also responsible, followed by retailers and the public themselves. Whilst they are thinking about diet, they are also concerned about issues like unnecessary packaging on food items, and the carbon trade-offs involved in producing our food. While people look first to changes they believe they can make in their own lives, they tell us that they want to see evidence of industry’s commitment to reducing waste at all stages of the food chain: from production techniques to retail and marketing practices."
        },
        {
            "heading": 2,
            "text": "Enhancing sustainability through emerging technologies and innovation"
        },
        {
            "text": "What will the future hold? Many of the emerging technologies and innovations in the food industry have great promise to enhance sustainability while improving nutrition and public health. More than half of the respondents to our recent survey (58%) thought that the Government should invest in developing new healthy and sustainable food products if the private sector does not. This responsibility includes investing in independent research and technology to support sustainable intensification and innovative farming methods."
        },
        {
            "text": "However, consumer acceptance of new food is influenced by perceptions of ‘unnaturalness’, and the lack of certainty about potential impacts on health, animal welfare, farming and the environment."
        },
        {
            "text": "People also tell us that that they want the Government to be visible in terms of looking out for the health, safety, food quality, security, and environmental impact of the food supply. People do not always trust the motives of the people promoting these technologies."
        },
        {
            "text": "They deploy a number of rules of thumb to evaluate how risky something feels for them – for example, whether they feel that it might have a severe impact, whether it’s something they themselves can control, whether it feels ‘natural’ or ‘unnatural’, or familiar, and whether it feels proportionate set against other benefits, particularly the benefits to them. Acceptance of insects as a human food is rising but they will need to be processed into ingredients for more appetising products. Survey data in the UK indicates that just under 1 in 5 consumers would eat cultured meat, and many would not or are currently undecided."
        },
        {
            "text": "Interestingly we see a younger generation fear technology far less, with lab-grown meat or gene editing (which felt like science fiction twenty years ago) seen as the solution to intractable problems. But they also want to see government setting standards."
        },
        {
            "text": "These solutions offer the potential to improve food security, food safety, and food nutrition, while at the same time delivering environmental sustainability benefits, waste reduction, and possibly reduced carbon emissions. However, alongside these huge benefits, new technologies may present new food safety issues around nutrition, allergenicity, toxicity potential, and traceability – all of which, of course, will need to be addressed in their regulation."
        },
        {
            "heading": 1,
            "text": "Deall agweddau defnyddwyr tuag at ddeietau iachus a chynaliadwy"
        },
        {
            "text": "Yn ymuno â’r sgwrs am gynhyrchu bwyd yn gynaliadwy yn COP26, mae Pennaeth Gwyddor Gymdeithasol, Michelle Patel, yn cnoi cil ar ganfyddiadau ein hymchwil ddiweddar i agweddau defnyddwyr tuag at ddeietau iachus a chynaliadwy, a’r hyn y maent yn ei olygu i lunwyr polisi a’r diwydiant bwyd."
        },
        {
            "text": " "
        },
        {
            "text": "Mae pobl yn tueddu i beidio â gwahaniaethu rhwng gwahanol adrannau’r Llywodraeth: maen nhw’n gweld y byd bwyd mewn modd mwy cyfannol. Rydym ni’n ymdrechu i ddeall buddiant defnyddwyr mewn perthynas â bwyd – ni allwch chi wneud hynny heb ystyried buddiant defnyddwyr mewn perthynas â chynaliadwyedd."
        },
        {
            "text": "Pan fydd pobl yn wynebu heriau, maent yn dechrau dadansoddi eu patrymau bwyta eu hunain ac yn ystyried a yw’r rhain yn gynaliadwy mewn cyd-destun byd-eang. Maent yn cychwyn yn y cartref ac yn meddwl am y newidiadau y gallant eu gwneud: trwy brynu llai a gwastraffu llai; bwyta llai o gig; neu ail-ystyried arferion prynu, fel prynu y tu allan i'r tymor. Mae’n well gan eraill beidio â newid. Byddai’n well ganddynt gymryd camau i'w galluogi eu hunain i gynnal eu bywyd cyfredol."
        },
        {
            "heading": 2,
            "text": "Deiet sy’n well i’r amgylchedd"
        },
        {
            "text": "Yn ein harolwg diweddar, sy’n cynnwys barnau cynrychiolwyr o’r wlad gyfan (Awst 2021), dywed dros hanner ohonom (54%) ein bod am newid ein deiet i'w wneud yn well i'r amgylchedd. Lleiafrif yn unig (13%) a nododd na fyddent am newid eu diet am y rheswm hwnnw. Ond, mae defnyddwyr yn teimlo bod yna bethau sy’n eu rhwystro rhag newid i ddeiet mwy cynaliadwy, gan gynnwys cost bwydydd cynaliadwy (29%), methu deall beth sy’n gynaliadwy a beth sy'n llai cynaliadwy (16%), dewisiadau cyfyngedig ar gyfer opsiynau cynaliadwy ( 13%), anhawster wrth ffurfio arferion cynaliadwy newydd (13%). Cafodd llawer o ymyriadau eu treialu i annog dewisiadau diet mwy cynaliadwy. Fodd bynnag, nid yw un ohonynt yn datrys y broblem, ac nid yw llawer, gan gynnwys labelu, o reidrwydd yn arwain at newid ymddygiad."
        },
        {
            "text": "Mae defnyddio llai o gig a llaeth yn fater sy’n gwahanu’r genedl. Mae naw o bob deg ohonom yn bwyta cig yn rheolaidd. Er bod llawer o bobl yn cydnabod buddion defnyddio o gig a llaeth, mae eu buddiannau, eu gwerthoedd, eu credoau a’r hyn y gallant ei fforddio yn amrywio’n fawr; mae’r rhain i gyd yn dylanwadu ar eu meddyliau am y cwestiwn hwn. Nid yw hon yn sefyllfa afresymol chwaith pan nad oes swm cytunedig cyffredinol y dylid person ei fwyta/yfed naill ai at ddibenion iechyd neu ddibenion cynaliadwyedd."
        },
        {
            "heading": 2,
            "text": "Rôl defnyddwyr mewn system fwyd gynaliadwy"
        },
        {
            "text": "Weithiau, mae defnyddwyr yn teimlo nad ydyn nhw’n gallu peri newid sylweddol yng nghyd-destun yr heriau strwythurol, byd-eang sy’n wynebu’r system fwyd. Pan arolygwyd defnyddwyr fel rhan o’n hastudiaeth yn gynharach eleni ar fwyd yn ystod y pandemig, roedd 69% ohonynt o’r farn y dylai’r Llywodraeth fod yn gwneud ‘llawer iawn’ neu ‘ymgais weddol’ i annog pobl i fwyta deietau mwy cynaliadwy. Fodd bynnag, maent o’r farn bod cynhyrchwyr/gweithgynhyrchwyr bwyd hefyd yn gyfrifol, ac yna fanwerthwyr a’r cyhoedd eu hunain. Wrth iddynt feddwl am ddeiet, maent hefyd yn poeni am faterion fel deunydd pecynnu diangen ar eitemau bwyd, a’r cyfaddawdau carbon sy’n gysylltiedig â chynhyrchu ein bwyd. Er bod pobl yn edrych yn gyntaf ar newidiadau y maent yn credu y gallant eu gwneud yn eu bywydau personol, maent wedi nodi eu bod am weld tystiolaeth o ymrwymiad gan y diwydiant i leihau gwastraff ar bob cam o’r gadwyn fwyd: o dechnegau cynhyrchu i arferion manwerthu a marchnata."
        },
        {
            "text": "Beth fydd yn digwydd yn y dyfodol? Mae llawer o’r technolegau a’r datblygiadau arloesol sy’n dod i’r amlwg yn y diwydiant bwyd yn addo gwella cynaliadwyedd wrth wella maeth ac iechyd y cyhoedd. Roedd mwy na hanner o’r ymatebwyr i’n harolwg diweddar (58%) o’r farn y dylai’r Llywodraeth fuddsoddi mewn datblygu cynhyrchion bwyd iachus a chynaliadwy newydd os nad yw’r sector preifat yn gwneud hynny. Mae’r cyfrifoldeb hwn yn cynnwys buddsoddi mewn ymchwil a thechnoleg annibynnol i gefnogi dulliau dwysáu cynaliadwy a dulliau ffermio arloesol. Fodd bynnag, mae canfyddiadau o ‘annaturioldeb’, a’r diffyg sicrwydd am yr effeithiau posibl ar iechyd, lles anifeiliaid, ffermio a’r amgylchedd yn dylanwadu ar sut mae defnyddwyr yn derbyn bwyd newydd."
        },
        {
            "heading": 2,
            "text": "Gwella cynaliadwyedd trwy dechnolegau sy'n dod i'r amlwg ac arloesi"
        },
        {
            "text": "Mae pobl hefyd yn nodi eu bod am i’r Llywodraeth fod yn amlwg mewn perthynas â gofalu am effeithiau’r cyflenwad bwyd ar iechyd, diogelwch, ansawdd bwyd, mynediad at gyflenwad bwyd a’r amgylchedd. Nid yw pobl bob amser yn ymddiried yng nghymhellion y bobl sy’n hyrwyddo’r technolegau hyn. Maent yn defnyddio nifer o reolau anghyson i werthuso pa mor beryglus y mae rhywbeth iddyn nhw – er enghraifft, a ydynt yn teimlo y gallai gael effaith ddifrifol, a yw’n rhywbeth y gallant ei reoli eu hunain, a yw’n teimlo’n ‘naturiol’ neu’n ‘annaturiol’, neu’n gyfarwydd, ac a yw’n teimlo’n gymesur â buddiannau eraill, yn enwedig y buddiannau sy’n berthnasol iddyn nhw. Mae derbyn pryfed fel bwyd i’w fwyta gan bobl yn cynyddu ond bydd angen prosesu’r pryfed yn gynhwysion ar gyfer cynhyrchion mwy blasus. Mae data arolygon yn y Deyrnas Unedig yn dangos y byddai ychydig llai nag 1 o bob 5 defnyddiwr yn bwyta cig wedi’i feithrin, ond ni fyddai llawer ohonynt yn gwneud felly, neu maent heb benderfynu ar hyn o bryd."
        },
        {
            "text": "Yn ddiddorol, rydym ni’n gweld cenhedlaeth iau sy’n ofni technoleg lawer llai. Maen nhw’n ystyried cig sydd wedi’i dyfu mewn labordy, neu addasu genynnau (a oedd yn teimlo fel ffuglen wyddonol ugain mlynedd yn ôl), yn broblemau anodd eu rheoli, ond maen nhw hefyd eisiau gweld y llywodraeth yn gosod safonau. Mae’r atebion hyn yn cynnig y potensial i wella mynediad at gyflenwad bwyd, diogelwch bwyd a maeth bwyd, ac ar yr un pryd sicrhau buddion cynaliadwyedd amgylcheddol, llai o wastraff, ac o bosibl lai o allyriadau carbon. Fodd bynnag, ochr yn ochr â’r buddion enfawr hyn, gall technolegau newydd gyflwyno materion diogelwch bwyd newydd o ran maeth, alergenau, potensial gwenwyndra, a’r gallu i olrhain. Bydd angen mynd i’r afael â phob un ohonynt, wrth gwrs, wrth eu rheoleiddio."
        }
    ]
}