{
    "url": "https://hmlandregistry.blog.gov.uk/2022/11/30/digital-by-default-the-day-has-arrived/",
    "title": "Digital by default – the day has arrived",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services (Head of Product)"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-11-30T10:00:33+00:00",
    "content": [
        {
            "text": "HM Land Registry has hit a major milestone following the publication of our 2022+ Strategy: we are now digital by default. Digital applications are something we’ve been talking about for a while and today our digital and automation ambitions became more of a reality."
        },
        {
            "heading": 2,
            "text": "What do we mean by digital by default?"
        },
        {
            "text": "Applications submitted to HM Land Registry will now be digital by default, whether they’re submitted using the Digital Registration Service (DRS) on the HM Land Registry customer portal, or using legal software connected to HM Land Registry using our Business Gateway application programming interfaces (APIs)."
        },
        {
            "text": "This is a move away from paper-based electronic applications. Rather than a scan of a paper form, or a PDF, the details of the application are entered directly into the service, capturing the data digitally. Digital data is more structured, more accurate (due to the pre-submission checks), and will enable HM Land Registry to automate more applications."
        },
        {
            "heading": 2,
            "text": "The route to automation"
        },
        {
            "text": "Automation is at the heart of our plans to develop efficient and resilient land registry services, as set out in our new Business Strategy. Our objective is to support the development of a simpler, paperless, transparent and user-friendly process for buying and selling property."
        },
        {
            "text": "The move to digital by default is the first major milestone in achieving this objective, which we believe will ultimately lead to better services and quicker applications, when combined with the other changes and updates we’re making to our services and processes."
        },
        {
            "heading": 2,
            "text": "Digital by default"
        },
        {
            "text": "DRS has now become the default way to submit applications via the portal. This means that, going forward, the vast majority of applications we receive will be digital – those submitted via legal software connected to our Business Gateway APIs have been submitted to us in ‘digital’ form since 2011."
        },
        {
            "text": "Our customers have been embracing digital applications. Since DRS was made available to all customers in April 2021, they’ve submitted nearly 680,000 applications through the service. More than 1.3 million digital applications were submitted through the portal and Business Gateway between October 2021 to September 2022."
        },
        {
            "text": "In advance of today’s switch to digital by default, both DRS and Business Gateway have started receiving more applications individually than the legacy electronic Document Registration Service."
        },
        {
            "text": "The digital applications submitted through DRS are already having an impact: requisitions for incorrect name and fee errors have fallen nearly 40% for applications submitted through the service."
        },
        {
            "heading": 2,
            "text": "What changes have you made?"
        },
        {
            "text": "To support the move to digital, we’ve launched the new portal homepage. This gives the portal a new look and feel, designed to both make the portal easier to use and to support customers in submitting and managing their applications."
        },
        {
            "text": "This redesign hasn’t changed any of the services, but it will change how our customers use and interact with the portal – beginning with a personalised homepage."
        },
        {
            "text": "The DRS start page guides customers into the service and directs them to the legacy service for the applications that aren’t yet available in DRS. We’re aiming to have these in place by mid-January and from there we’ll start winding down – and eventually withdrawing – the legacy service."
        },
        {
            "text": "I’m proud of the work we’ve achieved to make this possible. None of this would’ve been possible without the hard work and dedication not only from colleagues across HM Land Registry but from our customers and the market as well who have collaborated, challenged and supported us in making this happen."
        }
    ]
}