{
    "url": "https://companieshouse.blog.gov.uk/2022/11/30/disability-inclusion-how-were-encouraging-people-to-think-differently-and-take-action/",
    "title": "Disability inclusion: how we’re encouraging people to think differently and take action",
    "authors": [
        "Rebecca Bodger, Intelligence Researcher"
    ],
    "categories": [
        "People and culture",
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2022-11-30T12:00:00+00:00",
    "content": [
        {
            "text": "Applying for a job at a new company can be scary, especially if you have a disability or a health condition. You might wonder if the company will support your needs and make flexible adjustments for you."
        },
        {
            "text": "I have a long-term health condition. From the beginning of my time at Companies House, I’ve felt it’s a place that works hard to build an inclusive and welcoming culture. The diversity and inclusion priorities and agenda are not just for show – they’re part of daily working life."
        },
        {
            "text": "Three years ago, I caught a virus that made me acutely unwell. My body couldn’t fight it off and instead went into a sort of shutdown state, leaving me battling chronic pain and fatigue. After being unable to work for several months, I was ready to take tentative steps back into the workplace. The challenge was finding an employer who would understand my situation and be flexible to the adjustments I needed."
        },
        {
            "text": "The part-time working hours at Companies House caught my eye, along with the many awards that Companies House has won, including being a Disability Confident Employer and a MIND charity Gold award winner for wellbeing."
        },
        {
            "text": "When I joined Companies House, it was clear that their focus on inclusion and wellbeing was part of every day. I was encouraged to work flexibly, offered beneficial workplace adjustments, and directed to the people-led networks and support groups."
        },
        {
            "text": "The people-led networks have been particularly helpful to me. They’re created by colleagues to support each other and raise awareness of the issues that matter to them. Our networks include the mental health network, the ability network and the carers network, among others. They organise training sessions, awareness sessions and colleague catch-ups so that members feel included and heard. For example, the mental health network provides mental health advocates and first aiders for anyone who needs support in the workplace. The networks also hold events across the organisation, which highlights just how much Companies House cares about wellbeing and inclusion."
        },
        {
            "text": "Alongside other networks, I’m a member of the ability network. It supports colleagues and allies living with health conditions and disabilities. Our mission statement is ‘Empowering everyone to flourish in Companies House’."
        },
        {
            "text": "Each year we support the #PurpleLightUp campaign - a global movement celebrating the economic contribution of the 386 million disabled employees around the world. It has become synonymous with the International Day of Persons with Disabilities (IDPD), held annually on 3 December. #PurpleLightUp calls on people to drive social change within their organisations, help develop workplace policies for disabled employees, and spark conversations about disability inclusion worldwide."
        },
        {
            "text": "The ability network takes part in the #PurpleLightUp campaign by asking colleagues to wear purple and lighting up the office in purple, which is emblematic of disability. Last year we invited our CEO Louise Smyth to join us in a podcast to discuss the importance of celebrating the economic contribution of employees with disabilities and why disability networks are such a powerful vehicle for cultural change."
        },
        {
            "text": "The ability network also organised the #ThisIsUs campaign across Companies House. We uploaded podcasts and blogs to our internal site to raise awareness of the conditions that affect us and address the stigma around disability."
        },
        {
            "text": "The ability network creates a safe space to share experiences and hold discussions. We highlight the potential barriers that people with disabilities might face, both as an employee or as a Companies House customer. We improve guidance around how to answer questions on health conditions and disabilities, and encourage senior leaders and colleagues to think differently about disability and take action where needed."
        },
        {
            "text": "All the work that the culture change community does at Companies House aims to make everyone feel included and supported, whatever their situation. I’ve found that Companies House really does put wellbeing, diversity and inclusion at its heart."
        }
    ]
}