{
    "url": "https://insidedio.blog.gov.uk/2022/11/30/military-training-at-penhale-training-area-helps-restore-vital-sand-dune-habitats/",
    "title": "Military training at Penhale Training Area helps restore vital sand dune habitats",
    "authors": [
        "Private Ethan Treloar"
    ],
    "categories": [
        "Biodiversity",
        "British Army",
        "Conservation",
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Explosive Ordnance Clearance",
        "Military Training",
        "Penhale Training Area"
    ],
    "pub_date": "2022-11-30T13:05:20+00:00",
    "content": [
        {
            "text": "I’m a Reservist with the British Army’s 232 Port Squadron, 165 Port and Maritime Regiment Royal Logistic Corps (RLC), and I recently volunteered for the Penhale Dunes Dynamic Dunescape support exercise as I wanted to contribute to a unique local conservation project in Cornwall. Dynamic Dunescape is an ambitious conservation project aiming to restore 7,000 hectares of sand dunes in England and Wales."
        },
        {
            "text": "A joint effort between DIO, Cornwall Wildlife Trust and the British Army the exercise has helped to restore sand dune habitats at Penhale Training Area in Cornwall, which is situated within Penhale Dunes Special Area of Conservation (SAC). This is the second year that the exercise has taken place because it was so successful last time."
        },
        {
            "heading": 2,
            "text": "The benefits of volunteering"
        },
        {
            "text": "I volunteered for the exercise as it gave me the opportunity to spend more time operating JCBs as part of a very small team, which meant there was more individual time to operate them. I wouldn’t normally get the chance as a Reservist to operate a JCB for three whole days in a row by myself, with someone just guiding and directing the work I’m doing."
        },
        {
            "text": "A military digger hard at work moving soil and scrub at Penhale [MOD Crown Copyright 2022]The work, which involved clearing the scrub and the long grasses back to bare sand, has helped improve my operating skills and I feel even more confident manoeuvring the JCB now as the work was very different to what we normally do on a beach."
        },
        {
            "text": "The other bonus was that this exercise was local for me and I didn’t have to travel very far, as sometimes we travel many hours to military training areas to do our training."
        },
        {
            "heading": 2,
            "text": "Penhale Dunes Special Area of Conservation (SAC)"
        },
        {
            "text": "The UK Defence Training Estate is home to a diverse range of habitats and wildlife species, many of which have been granted protected status. DIO is committed to sustainably managing land used for military training and balancing military needs with ecological conservation and joint projects of this nature have a real, positive impact on the ecology of the training estate."
        },
        {
            "text": "Penhale’s coastal sand dune system hosts a wealth of native wildlife, from reptiles like the common lizard and adder to delicate orchids, the rare silver-studded blue butterfly, and the silvery leafcutter bee. These ‘dune-specialist’ species thrive in our coastal landscapes when there are plenty of areas of bare sand available for burrowing into or hunting on top of, as well as areas of low grassland in which to hide or to produce flowers."
        },
        {
            "text": " "
        },
        {
            "text": "Silver-studded blue butterfly at Penhale Dunes SAC. [Credit: Emma Brisdion]At Penhale Dunes these areas are becoming smaller and further apart due to the loss of natural grazing, climate change and nitrogen increases caused by air pollution. As a result, coastal sand dunes are experiencing significant biodiversity loss."
        },
        {
            "heading": 2,
            "text": "How military training supports ecological conservation"
        },
        {
            "text": "A significant part of Penhale Dunes SAC is situated within Penhale Training Area, which DIO maintain in partnership with Cornwall Wildlife Trust, who oversee the environmental aspects of the training area. The work was completed as part of a machinery training programme for the Regiment and is a prime example of the positive role military training can play in conservation efforts on the Defence estate."
        },
        {
            "text": "To ensure work could begin safely, DIO worked with Army colleagues to provide unexploded ordnance clearance on the dunes. Me and my team then removed areas of overgrown scrub and exposed bare sand on overgrown dunes."
        },
        {
            "text": "In areas of low scrub, plant material was raked out, and areas of dense mature scrub like blackthorn and hawthorn were plucked and pulled from the dunes. In a previously damaged area that is now suffering from lower plant biodiversity than the surrounding dunes, diggers were used to strip away the top layer of turf to expose patches of bare sand. This will create better conditions for sand dune wildlife."
        },
        {
            "heading": 2,
            "text": "Reflecting on the exercise and personal success"
        },
        {
            "text": "Our colleagues at Cornwall Wildlife Trust were really pleased with last year’s work. The clearance work successfully reduced the cover of thick blackthorn scrub and Great mullein has been one of the first plants to colonise the area adding a splash of bright yellow to the area. The site has also seen Common restharrow appearing. Exmoor ponies have enjoyed rolling in the bare sand patches too, and both the ponies and cattle have been grazing the regrowth in the area helping to keep the area open and prevent scrub regrowing. I hope our work this year reaps the same success next year."
        },
        {
            "text": "A Mullien moth caterpillar on a Great mullien plant [copyright Dave Thomas]As for me, I applied to join the Regular Army as an Officer and I start at Sandhurst in January 2023, so this will be my last exercise in the Army Reserve. It’s been fantastic to do something unique and linked to the environment in Cornwall and a great way to finish my Reserve Service. I would really encourage others to volunteer for and support exercises like this."
        },
        {
            "text": " "
        }
    ]
}