{
    "url": "https://healthmedia.blog.gov.uk/2022/11/30/nhs-industrial-action-media-fact-sheet-2/",
    "title": "NHS industrial action - media fact sheet",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2022-11-30T10:43:52+00:00",
    "content": [
        {
            "text": "This fact sheet sets out the Department of Health and Social Care’s position on industrial action by NHS staff on Agenda for Change contracts, such as nurses, midwives, ambulance workers, porters and cleaners."
        },
        {
            "text": "Agenda for Change is the system which governs pay across all non-medical NHS staff – more than 1 million workers - and it aligns pay scales and career progression across all groups, meaning pay rises apply to everyone under this contract."
        },
        {
            "text": "Health and Social Care Secretary Steve Barclay said: "
        },
        {
            "text": "“I’m hugely grateful for the hard work and dedication of NHS staff and deeply regret some will be taking industrial action – which is in nobody’s best interests as we approach a challenging winter."
        },
        {
            "text": "“Our economic circumstances mean unions’ demands are not affordable - each additional 1% pay rise for all staff on the Agenda for Change contract would cost around £700 million a year."
        },
        {
            "text": "“We’ve prioritised the NHS with record funding and accepted the independent pay review body recommendations in full to give over one million NHS workers a pay rise of at least £1,400 this year, with those on the lowest salaries receiving an increase of up to 9.3%."
        },
        {
            "text": "“This is on top of 3% last year when public sector pay was frozen and wider government support with the cost of living.”"
        },
        {
            "text": "“Our priority is keeping patients safe during any strikes and the NHS has tried and tested plans to minimise disruption and ensure emergency services continue to operate."
        },
        {
            "text": "“My door remains open to discuss with the unions ways we can make the NHS a better place to work.”"
        },
        {
            "text": "Q&A "
        },
        {
            "text": "What is the Royal College of Nursing asking for and how much would this cost?"
        },
        {
            "heading": 4,
            "text": "What are other unions asking for and how much would this cost?"
        },
        {
            "heading": 4,
            "text": "What is the government offering? "
        },
        {
            "heading": 4,
            "text": "How much are nurses paid? "
        },
        {
            "heading": 4,
            "text": "How much are ambulance workers paid?"
        },
        {
            "heading": 4,
            "text": "How much are midwives paid?"
        },
        {
            "text": "How much are porters/cleaners paid? "
        },
        {
            "heading": 4,
            "text": "Is this a fair deal? "
        },
        {
            "heading": 4,
            "text": "How is pay decided? "
        },
        {
            "heading": 4,
            "text": "Will the government go back to the negotiation table with unions? "
        },
        {
            "heading": 4,
            "text": "Will patient care be affected? "
        },
        {
            "text": "What contingencies do you have in place to ensure emergency services continue to operate? "
        },
        {
            "text": "What are you doing to improve access to emergency care?"
        }
    ]
}