{
    "url": "https://environmentagency.blog.gov.uk/2022/11/30/water-crowfoot-or-how-we-learned-to-love-ranunculus/",
    "title": "Water crowfoot, or how we learned to love Ranunculus",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-11-30T12:04:27+00:00",
    "content": [
        {
            "text": "Ranunculus sounds like a spell from the wizard world of Harry Potter. However, it is a lovely aquatic plant you would see in the UK’s chalk streams. The presence of Ranunculus is usually a benefit, rarely a nuisance. But the history of river management has not been kind to water crowfoot, to use Ranunculus’ common name."
        },
        {
            "text": "This blog will explain what Ranunculus is, the benefits it brings to chalk stream, the rare reasons why it needs it to be removed and who is responsible for doing so."
        },
        {
            "text": "What is Ranunculus?"
        },
        {
            "text": "Found in gin-clear chalk streams, Ranunculus springs from a sturdy root network that clings to the gravel on the riverbed. Long, narrow, tassel-like segments that grow underwater become vast raft-like structures that flow gracefully with the current."
        },
        {
            "text": "Beds of Ranunculus offer excellent habitat for an abundant invertebrate ecosystem and provide vital refuge and cover for fish and other aquatic species. In June, the long, slender stems carry white flowers that are held above the water level, that are around 2–3 cm across."
        },
        {
            "text": "The historic reasons for removing Ranunculus"
        },
        {
            "text": "In some areas there has been a long history of cutting aquatic vegetation. Historically this work was justified on the grounds of fishery management, agricultural production and land drainage."
        },
        {
            "text": "Since the late 1970s, government priorities have switched from land drainage for agriculture to flood defence and then flood risk management, primarily to protect people and property from flooding. However, there is some ongoing aquatic vegetation management carried out by various fishing clubs and organizations."
        },
        {
            "text": "The Environment Agency has no statutory obligation or duty to cut aquatic vegetation. The potential to damage habitats and the environmental constraints have a significant impact on our work. The cutting activities themselves can have a detrimental impact on the river ecosystems."
        },
        {
            "text": "The Environment Agency will consider cutting aquatic vegetation at the right time of year if abundant vegetation could hinder the operational ability of our assets, for example, pumps, weirs or sluices."
        },
        {
            "text": "Removing Ranunculus can harm the river"
        },
        {
            "text": "The delicate ecosystem in chalk streams heavily rely upon aquatic vegetation to support the species that thrive in this unique habitat."
        },
        {
            "text": "During the summer when flows are naturally lower in the chalk rivers, aquatic vegetation is even more important to the stability of the watercourse. Leaving beds of ranunculus holds up lower water levels and provides pockets of deeper water."
        },
        {
            "text": "The flowing channels in between the beds of ranunculus are important to maintain a flow of oxygenated water that fish species are heavily reliant upon during the summer months when water flows are low."
        },
        {
            "text": "Removing aquatic vegetation at this time of year may have a detrimental impact on local water levels and a negative impact to fish and other aquatic life. Vegetation management requires careful consideration. Leaving beds of Ranunculus and other aquatic vegetation can help retain water levels."
        },
        {
            "text": "Whose job is it to cut aquatic vegetation?"
        },
        {
            "text": "One of our most commonly asked questions is who is responsible for managing vegetation, particularly by rivers."
        },
        {
            "text": "The answer is usually riparian owners, those responsible for the stretch of river under their ownership. If one bank is owned, then riparian ownership is usually up to the centre line of the watercourse. But as said earlier, the impacts of removing aquatic vegetation should be thoroughly considered before the works are carried out."
        },
        {
            "text": "For more information visit Owning a watercourse - GOV.UK (www.gov.uk)"
        },
        {
            "text": "What to do if aquatic vegetation affects your flood risk"
        },
        {
            "text": "Lower summer flows are a natural occurrence in chalk-fed rivers, in some cases the upper reaches of that watercourse will dry out. It is important to let these watercourses dry out naturally as removing weed and further reducing flows may impede the free movement of fish that are looking to head downstream in the catchment to higher flows and deeper water."
        },
        {
            "text": "If water levels are being held up by abundant aquatic vegetation growth and pose a flood risk to your property, here is advice on how to maintain your stretch of watercourse to balance flood risk and wildlife."
        },
        {
            "text": "Cutting Ranunculus before or when it is flowering may stimulate more vigorous growth from the plant. If maintenance is required, doing this after flowering is the best time."
        },
        {
            "text": "This vegetation will naturally die back towards the end of the summer months and as flows increase through the recharge period when periods of long and heavy rainfall begin to recharge the aquifers."
        },
        {
            "text": "You may have to apply for a weed cutting permit or exemption to carry out this work. See the above link for owning a watercourse."
        },
        {
            "text": "If you enjoyed reading about the unique life of chalk streams you might enjoy this news story about the River Tarrant in Dorset, which vanishes in the summer and is reborn in the winter, which can pose problems for the fish. And we have just released how we intend to implement the chalk stream restoration strategy."
        },
        {
            "text": " "
        }
    ]
}