{
    "url": "https://deframedia.blog.gov.uk/2022/11/30/water-company-fines-to-be-invested-back-into-the-environment/",
    "title": "Water company fines to be invested back into the environment",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water",
        "Weekly stories"
    ],
    "pub_date": "2022-11-30T17:24:37+00:00",
    "content": [
        {
            "text": "There has been national coverage today (30 November), including in the Guardian, the Evening Standard, the Metro and the Independent about new plans to channel money from water company fines into environmental improvements."
        },
        {
            "text": "Water companies were handed a record amount in fines for pollution incidents last year and since 2015, the Environment Agency has concluded 56 prosecutions against water and sewerage companies, securing fines of over £141m."
        },
        {
            "text": "At present, money from these fines is returned to the Treasury. Under the new plans, ringfenced funds will go to Defra and will be invested directly back into environmental and water quality improvement projects."
        },
        {
            "text": "This could include initiatives to restore our water environments by creating wetlands, re-vegetating river banks and reconnecting meanders to the main channel of rivers."
        },
        {
            "text": "Water Minister Rebecca Pow said:"
        },
        {
            "text": "Chancellor of the Exchequer, Jeremy Hunt said:"
        },
        {
            "text": "To crack down on water pollution, government has boosted funding for the Environment Agency, with £2.2 million per year specifically for water company enforcement activity, including at least 4,000 farm visits per year and 500 sewerage inspections."
        },
        {
            "text": "Earlier this year the Government’s Storm Overflows Discharge Reduction Plan also brought in strict targets on sewage pollution and will require water companies to deliver the largest infrastructure programme in their history to tackle storm sewage discharges – a £56 billion capital investment over 25 years."
        },
        {
            "text": "Further details on the plans will follow next year."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here"
        }
    ]
}