{
    "url": "https://traderemedies.blog.gov.uk/2022/11/30/when-it-comes-to-trade-who-decides-whats-fair/",
    "title": "When it comes to trade, who decides what’s fair?",
    "authors": [
        "David Collins, Independent Member of Audit and Risk Assurance Committee (ARAC)"
    ],
    "categories": [
        "Investigations",
        "Policy"
    ],
    "pub_date": "2022-11-30T12:05:21+00:00",
    "content": [
        {
            "text": "As a public body committed to defending the UK from unfair international trade practices, we tackle the question of what counts as fair daily. Let’s examine some of the complexity by looking at a recent trade remedy case involving Argentinian exports of biodiesel."
        },
        {
            "text": "Biodiesel is a renewable energy source made from vegetables or animal fats, once touted as an important alternative source of power as the world attempts to shift away from fossil fuels. In recent years environmental concerns over land use in the production of biodiesel have made it less attractive as a solution to many countries’ energy woes."
        },
        {
            "heading": 2,
            "text": "The case of alleged Argentinian dumping"
        },
        {
            "text": "Argentina is among the world’s largest producers of biodiesel, and due to changing market conditions, found itself with an over-supply of the fuel. Low-priced exports of biodiesel from Argentina triggered anti-dumping allegations from the EU and the US, resulting in import tariffs which drove Argentinian producers away."
        },
        {
            "text": "While Argentina managed to successfully challenge some of the anti-dumping duties levied against it through the World Trade Organization (WTO), other complaints have since materialized regarding Argentina’s biodiesel exports, most recently from Peru, which has also accused Argentina of subsidizing their biodiesel industry, enabling their producers to undercut global prices."
        },
        {
            "text": "Earlier this month Argentina initiated a request for consultations with Peru through the WTO, objecting to Peru’s anti-dumping tariffs on their biodiesel exports. The complaint focuses on the calculations Peru undertook to set their anti-dumping duties which Argentina says were either lacking in information or inaccurate. Argentina also asserts that Peru failed to establish causation between the low-priced biodiesel and ensuing injuries to the Peruvian biodiesel market."
        },
        {
            "text": "Since Peru failed to conduct an objective, informed examination, Argentina claims that Peru’s anti-dumping tariffs and countervailing (anti-subsidy) duties were illegal. Should the consultations fail, Argentina will likely instigate a full complaint through the WTO’s dispute settlement system, requesting the establishment of a panel."
        },
        {
            "heading": 2,
            "text": "The importance of reliable data"
        },
        {
            "text": "Argentina’s challenge to Peru’s trade remedies illustrates the importance of having a well-equipped, experienced body to evaluate the unfair trade practices of other countries, like dumping and subsidies, and to ensure that any duties levied in response are done so lawfully and accurately. This is a highly technical, complex and time-consuming process which requires careful assessment of all available data, much of which will be drawn from foreign countries."
        },
        {
            "text": "In the UK, the Trade Remedies Authority was established to conduct these investigations in order to protect British industries from unfair trade practices. In previous blog posts, we have looked at what data we gather as part of our investigations and what we do with it, as well as what we publish in the interest of transparency."
        },
        {
            "text": "Whether or not Argentina indeed subsidized or dumped biodiesel into Peru remains to be seen, but its initial challenge shows that the imposition of tariffs in response to these actions must be done cautiously and defensibly, otherwise there could be formal, lengthy and costly complaints through the WTO dispute settlement system, something best avoided."
        },
        {
            "text": "The UK government has recently agreed with the TRA’s recommendation on anti-dumping and countervailing measures on imports of Biodiesel from the USA and Canada. You can find out more about this case in our news story and the public case file."
        }
    ]
}