{
    "url": "https://aphascience.blog.gov.uk/2022/02/28/classical-bse-confirmed-in-somerset/",
    "title": "Unexpected notifiable disease confirmed in Somerset",
    "authors": [
        "Timm Konold"
    ],
    "categories": [
        "Prions"
    ],
    "pub_date": "2022-02-28T12:21:34+00:00",
    "content": [
        {
            "text": "Whilst the current avian influenza outbreak makes all the headlines, APHA’s Dr Timm Konold, Lead Scientist for Transmissible Spongiform Encephalopathies (TSEs), turns our attention to a disease that hardly anyone expected anymore: bovine spongiform encephalopathy (BSE)."
        },
        {
            "text": "BSE, commonly referred to as mad cow disease, is a fatal brain disease in cattle. BSE is a notifiable animal disease which means that by law, all suspected cases of the disease must be reported to the APHA (contact details can be found at the end of this blog)."
        },
        {
            "text": "Clinical signs of BSE are usually seen in cattle above four or five years old and include behavioural changes such as aggression, nervousness and frantic kicking during milking as well as skin tremors and weakness in the hind legs."
        },
        {
            "heading": 3,
            "text": "Confirmed case of classical BSE"
        },
        {
            "text": "BSE was confirmed in September 2021 in a six-year-old cow that was unresponsive to veterinary treatment and therefore euthanised. As with all fallen stock over 48 months of age, the brain had to be tested for BSE which was sadly subsequently confirmed as classical BSE."
        },
        {
            "text": "Classical BSE is linked directly to ingestion of feedstuffs contaminated with the pathogen, which was responsible for more than 30,000 annual cases in Great Britain at the height of the epidemic in the early 1990s and was identified as the cause of human variant Creutzfeldt-Jakob disease, but has since become a very rare disease, making the origin of this case all the more important to investigate."
        },
        {
            "text": "Measures have been in place for many years to prevent this, such as the complete ban on feeding animal protein to livestock since 1996. However, cases of classical BSE have continued to occur, most likely due to residual contamination of feed, feed production or feed storage units."
        },
        {
            "text": "Mathematical modelling by APHA scientists suggested an exponential decline in the number of cases born after this ban within Europe, but with Great Britain having comparatively more cases at the time of the feed ban, the decline would take longer, and there was a low probability of having a case as late as 2026."
        },
        {
            "text": "By contrast, atypical BSE, which was discovered much later, is believed to be sporadic in nature and rare (approximately one case per 1,000,000), similar to sporadic Creutzfeldt-Jakob disease in humans, and can unfortunately appear in older cattle but is not linked to ingestion of contaminated feed."
        },
        {
            "heading": 3,
            "text": "Likely cause"
        },
        {
            "text": "Having a case in 2021 is therefore not unexpected but epidemiological investigations were needed to identify the cause of the classical BSE case and the suspected food-borne source. This is generally difficult because of the long time between possible exposure to the pathogen and death from the disease: consumption of contaminated feed most likely occurred when the animal was a calf, but disease is often only detected many years later. In the latest case, the animal was six years of age."
        },
        {
            "text": "For the previous British BSE case detected in Scotland in 2018, the epidemiology report did not identify a plausible source of exposure. In the current case, the investigation concluded that the most likely source was feed from a silo that had been on the farm since the 1980s, never been thoroughly cleaned, and might have still contained traces of old feed that were inadvertently ingested by the affected cow."
        },
        {
            "text": "It is hoped that this case will be the last classical BSE case in this country. Active monitoring for BSE in fallen stock will continue for the foreseeable future but it is still equally important for animal keepers and veterinarians to be aware of the clinical presentation of this notifiable disease and report any disease suspicion to APHA so that it can be investigated. This applies in particular to downer cows that do not respond to treatment, and the clinical history (changed behaviour, abnormal gait) may be indicative of a neurological disease or the animal is old enough to consider atypical BSE (usually 8 years of age or older). An investigation may also produce a differential diagnosis if BSE is not confirmed, which is beneficial to both owner and private veterinary surgeon."
        },
        {
            "heading": 3,
            "text": "How to report a suspected case of BSE"
        },
        {
            "text": "If you live in England, please call the Defra Rural Services Helpline on 03000 200 301. In Wales, contact 0300 303 8268. In Scotland, contact your local Field Services Office."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "Further information about why reporting suspect BSE cases is important can be found in a recent article by APHA’s Dr Timm Konold and Dr Carmen Marco."
        },
        {
            "text": "Details on how to spot and report BSE can be found on GOV.UK."
        },
        {
            "text": "The original announcement on GOV.UK with comments from Dr Christine Middlemiss, UK Chief Veterinary Officer and from the Food Standards Agency."
        },
        {
            "text": " "
        }
    ]
}