{
    "url": "https://dwpdigital.blog.gov.uk/2022/02/28/great-new-workspaces-for-dwp-digital/",
    "title": "Great new workspaces for DWP Digital",
    "authors": [
        "Christina Jeffs, Head of Digital Spaces, DWP Digital"
    ],
    "categories": [
        "hybrid working",
        "workspace"
    ],
    "pub_date": "2022-02-28T14:03:07+00:00",
    "content": [
        {
            "text": "Over the last few weeks, DWP Digital teams have started to spend even more time back in the office. As we begin to fully embrace hybrid working within the organisation, we’ve taken this opportunity to look at our how our digital hubs are configured to meet user needs."
        },
        {
            "text": "My team has been working to make sure the workspace is set up to help us get the most out of the time we spend there. With nearly 5,000 colleagues working in DWP Digital, as the prime occupiers across 17 floors in six digital hubs (excluding the new Birmingham hub), this has been a mammoth task."
        },
        {
            "heading": 2,
            "text": "We started with user research"
        },
        {
            "text": "Early last year we carried out extensive user research with a variety of roles, teams and locations to find out exactly what our colleagues needed from their workspace in the future."
        },
        {
            "text": "The user research set out to understand:"
        },
        {
            "text": "A report was then produced with recommendations including workspaces with fewer desks and a greater range of good, flexible collaboration spaces which can be adapted and scaled up and down for the different activities that our colleagues in DWP Digital carry out."
        },
        {
            "heading": 2,
            "text": "Testing and learning"
        },
        {
            "text": "Before making the changes across all our digital hubs, we decided to take a test and learn approach so we can evaluate what works well and address anything that doesn’t."
        },
        {
            "text": "In February, the first test and learn environment was opened in our Newcastle hub. We’re planning to follow this in Manchester in March."
        },
        {
            "text": "The bright and airy activity-based workspaces have been designed to enable multi-disciplinary working and collaboration, as well as other activities which are better delivered within our hubs."
        },
        {
            "text": "Hybrid working has been factored into the design and we aim to keep adapting the hub space to make sure that what we have is being used effectively and is not wasting valuable DWP estate by being under-utilised. This means catering for the activities that people will be carrying out in the hubs in the future."
        },
        {
            "text": "The test and learn environments offer a wide variety of activity-based workspaces: different types of space suited to different types of activities, such as collaborative work, formal team meetings, informal chats, and touchdowns in-between meetings. We have even created amphitheatre spaces which work well for show and tells."
        },
        {
            "text": "And while there are fewer desks, there are still many available within other areas of the hubs for colleagues who need them."
        },
        {
            "text": "We've developed a handbook for colleagues, which explains what different workspaces are available, how to access and use them and how to provide feedback. We also have our Spaces Support team on the ground to help colleagues understand what’s in the test and learn workspaces, as well as helping people get used to finding their way around and use the equipment."
        },
        {
            "text": "Early visitors have praised the spaces as being impressive and innovative:"
        },
        {
            "text": "We’re looking forward to welcoming lots of colleagues to come and try out the spaces and letting us know what they think.  We’ll continually evaluate how people are using the new Newcastle and Manchester spaces and take what we learn to inform DWP Digital’s future workspace strategy and the wider DWP departmental workspace strategy."
        },
        {
            "heading": 2,
            "text": "Come join us"
        },
        {
            "text": "Hybrid working looks like it’s here to stay, and I’m excited that we’re adapting our workspaces to reflect this.  We’re recruiting hundreds of digital specialists into the organisation over the next year, so if you think  our test and learn floors look like a great place to work, take a look at some of the vacancies on the DWP Digital careers site."
        }
    ]
}