{
    "url": "https://civilservice.blog.gov.uk/2022/02/28/living-with-an-eating-disorder/",
    "title": "Living with an eating disorder",
    "authors": [
        "Martin Riley"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-02-28T10:10:11+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Eating Disorders Awareness Week (28 February - 6 March) helps fight misunderstandings over anorexia, bulimia, binge eating and other eating disorders. It also highlights the importance of receiving professional help early. Below, Martin Riley shares his experiences. "
        },
        {
            "text": "I can’t pinpoint when it started – it just seemed to creep up in my early twenties. Comments about my weight and height crept into my head and I started to see my body in a different way from reality. My wife Lindsay recognised something wasn’t quite right more than 15 years ago, and persuaded me to see my doctor."
        },
        {
            "text": "I was diagnosed with bulimia, but my doctor’s response was that I looked healthy, so I was fine. In my head I convinced myself that nothing was wrong, and I could just carry on. I hope that today, any doctor wouldn’t dismiss me as easily."
        },
        {
            "text": "It’s taken me years to accept that I have an eating disorder. I thought that not eating during the day, then bingeing after work was a character flaw rather than an actual illness. I blamed myself for being unable to control how much I ate, and to a degree, I still do. It makes me feel guilty and ashamed."
        },
        {
            "text": "Years of denial"
        },
        {
            "text": "The first time I spoke to someone about my eating disorder was incredibly hard. I finally confessed to my wife that I had a problem. I’m lucky that Lindsay was, and continues to be, supportive; she just listened. After years of denial, it was a relief to finally admit I had a problem."
        },
        {
            "text": "Living with an eating disorder feels humiliating. During a binge, I felt disconnected from everything, almost as if I was in a trance. I’d feel self-disgust and regularly concealed the evidence."
        },
        {
            "text": "Worried"
        },
        {
            "text": "It’s an incredibly isolating illness. I’ve felt extremely self-conscious eating in front of people. In my mind, I worried others would think: ‘He’s fat enough, he doesn’t need any more food.’"
        },
        {
            "text": "I came up with a cunning plan to skip breakfast and lunch at work, then exercise in the gym until I dropped; that would solve all my problems. Of course, it didn’t."
        },
        {
            "text": "Once I discovered the gym, I thought I had finally found a way to control my weight. I devoted hours trying to perfect the look I craved in my head. I was determined to be slim. I resisted the urge to eat, ignoring the rumblings from my stomach. I could now eat what I wanted without guilt or risk gaining weight."
        },
        {
            "text": "At my worst, I wasted hours looking at my body and feeling physically sick at what I saw. I didn’t leave home without a jacket or coat and covered up at every opportunity – I still do. I kept this a secret for a long time. One of my biggest regrets is not confiding in my dad before he passed away, and I’ve never told my mum."
        },
        {
            "text": "Having an eating disorder can take over your life and consume every thought and behaviour. I’d become so overwhelmed that I felt increasingly lost."
        },
        {
            "text": "Ongoing battle"
        },
        {
            "text": "I wish I could say I’ve made a full recovery but it remains an ongoing battle every day. However, I’m slowly hacking away at the negative thoughts fighting in my brain. Since admitting that I have a problem, I’ve found counselling beneficial, as well as talking openly with people about my experience."
        },
        {
            "text": "My wife has been a massive support, despite finding it difficult watching me struggle, but we’re a team facing this journey together. I now have a routine with meals and exercise which is vital for my mental health."
        },
        {
            "text": "A Modern Civil Service"
        },
        {
            "text": "As the Civil Service evolves into A Modern Civil Service, there’s increasing emphasis on being ‘innovative’ with growing recognition that human beings are complex with differing needs and sensitivities. That means looking beyond a ‘one size fits all’ approach so we can all maintain a happy, inclusive workplace. Line managers can play a key role in opening up conversations about eating disorders and building a supportive workplace."
        },
        {
            "text": "Since launching a year ago, the Civil Service Eating Disorder Network (CSEDN) is committed to raising awareness offering valuable support for colleagues of those affected."
        },
        {
            "text": "We should never judge someone on their appearance, so we must listen and keep making space for people to tell their stories. More than 1.6 million people live with an eating disorder, and around 25% are male. The good news is that a full recovery is possible."
        },
        {
            "text": "Amazing support"
        },
        {
            "text": "Meanwhile, if you’re struggling, there’s amazing support through the Beat Eating Disorders website and the CSEDN’s Eating Disorders Workplace Toolkit. To seek support for yourself or someone around you, contact the Mental Health First Aider community and support networks in your department e.g. for parents or carers, as well as HR services for help."
        },
        {
            "text": "I hope my story will encourage colleagues living with an eating disorder to take action and seek out support. For more information, contact the network at edsg@beis.gov.uk."
        }
    ]
}