{
    "url": "https://educationhub.blog.gov.uk/2022/02/secondary_school_offer_day_how-do-i-appeal-my-childs-secondary-school-admission-decision/",
    "title": "What you need to know about secondary school offer day",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2022-02-28T14:37:37+00:00",
    "content": [
        {
            "text": "On Tuesday 1 March year 6 pupils across the country will find out which secondary school has offered them a place for September 2022."
        },
        {
            "text": "The vast majority of pupils will be offered a place at one of their preferred schools – most will be offered their top preference."
        },
        {
            "text": "Last year, 93.4% of applicants for a secondary school place received an offer from one of their top 3 choices, while 81.1% were offered their first choice secondary school."
        },
        {
            "heading": 3,
            "text": "Parents or carers who applied on time will receive an offer from their local authority"
        },
        {
            "text": "Once a parent or carer receives their offer, they must formally accept that offer by the deadline set – usually through the local authority’s admissions portal or system. The offer received will have details of the steps needed to be followed."
        },
        {
            "heading": 3,
            "text": "If your child didn’t receive their preferred place, parents or carers can appeal"
        },
        {
            "text": "If a parent or carer wants to appeal, they should first contact the school’s admission authority. The school’s admission authority is responsible for establishing the appeal panel, but the panel itself is independent."
        },
        {
            "text": "The appeal panel must come to its own independent conclusion as to whether the school should admit the child, having regard to the case presented by both the admission authority and the parent."
        },
        {
            "text": "The decision of the appeal panel is binding – if the appeal is upheld, the admission authority must offer the child a place at the school."
        },
        {
            "text": "Admission authorities and appeal panels must comply with the statutory School Admission Appeals Code, which is available here. Guidance for parents on the admission appeals process can also be found here."
        },
        {
            "text": "If a parent or carer is unsure of how to find their school’s admission authority, they can search it by visiting the find a local council website: Find your local council - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Why your child may not have been offered a place at one of your preferred schools"
        },
        {
            "text": "If the local authority is unable to offer a place at one of the parents’ preferred schools, it must offer a place at another school where there are places available."
        },
        {
            "text": "Where a school receives more applications than it has places available, not every parent will be successful, and priority must be given to those who most closely meet the school’s published admission arrangements."
        },
        {
            "text": "In the unlikely event that a parent does not receive an offer of a place on Tuesday 1 March, parents should contact their local authority for further advice."
        },
        {
            "heading": 3,
            "text": "We have made the appeals process more flexible "
        },
        {
            "text": "Because of COVID-19, we introduced temporary regulations and accompanying guidance giving admission authorities, local authorities and admission appeal panels more flexibility to carry on hearing appeals such as holding hearings remotely or through written submission."
        },
        {
            "text": "The temporary regulations are due to expire on 30 September 2022, however, the department is currently consulting on proposals to make some of the temporary arrangements permanent."
        },
        {
            "heading": 3,
            "text": "We are providing extra school places in areas that need them most"
        },
        {
            "text": "Going to secondary school is an important step in building the foundations for a child’s future."
        },
        {
            "text": "That’s why we announced nearly £500 million to provide both primary and secondary places needed for 2023."
        }
    ]
}