{
    "url": "https://defrafarming.blog.gov.uk/2022/02/28/the-farming-innovation-programme-in-2022/",
    "title": "The Farming Innovation Programme in 2022",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2022-02-28T14:38:31+00:00",
    "content": [
        {
            "text": "In October, we launched the first rounds of funding in our Farming Innovation Programme."
        },
        {
            "text": "We allocated £17.5 million across 3 competitions in our Industry-led Research and Development Partnerships Fund. We delivered this with UK Research & Innovation (UKRI)."
        },
        {
            "text": "It's been encouraging to see a large number of really high-quality applications, demonstrating the appetite for more innovation in the sector. "
        },
        {
            "text": "As we've been processing the applications, we've seen a promising spread of ideas across the livestock, horticulture and broadacre sub-sectors. These ideas are coming in from across the whole of England. "
        },
        {
            "text": "In this post, I'll share what to look out for this year."
        },
        {
            "heading": 2,
            "text": "Large R&D Partnership Projects"
        },
        {
            "text": "In March, we will launch the fourth competition in the Industry-led Research & Development Partnerships Fund. "
        },
        {
            "text": "£8 million will be made available for the first Large Research & Development Partnership Projects."
        },
        {
            "text": "These will be collaborative, business-led projects which provide clear benefits to farmers or growers in England. "
        },
        {
            "text": "We want to see large-scale research, development and demonstration of solutions that have the potential to improve productivity and environmental sustainability, with projects valued between £3 million to £5 million over 4 years."
        },
        {
            "text": " We expect these projects to have a strong focus on knowledge exchange and demonstration, thereby bringing the outputs of the competition closer to commercialisation and mass uptake. "
        },
        {
            "text": "More information on how to apply will be available in the coming weeks. "
        },
        {
            "heading": 2,
            "text": "Launching the Farming Futures Research & Development Fund"
        },
        {
            "text": "Also in March, we will launch the first competition in the Farming Futures Research & Development Fund in partnership with UKRI. "
        },
        {
            "text": "We seek projects that will help us realise government's Net Zero Strategy. "
        },
        {
            "text": "We are making the first £12.5 million share of funding available in March to attract a range of high-value projects (£3 million to £6 million over 4 years) where businesses and researchers will collaborate to develop ambitious and transformative solutions to help the farming sectors reduce their greenhouse gas emissions and help them to adapt to the effects of climate change. "
        },
        {
            "text": "Applicants will be invited to submit a short expression of interest, after-which the most promising and ambitious ideas will be invited to submit a full application. "
        },
        {
            "text": "We will share more information in the run up to launch both here on the blog and on the Farming Innovation Programme website. "
        },
        {
            "text": "Innovate UK KTN (formerly The Knowledge Transfer Network) will run webinars for Large R&D Partnership Projects and Farming Futures R&D Fund for those interested in applying for these 2 funding rounds once the application window has opened.  "
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "In summer, we plan to launch a second competition in the Farming Futures Research & Development Fund, which is likely to focus on sustainable proteins, reflecting our ambition to address the challenges we face to preserve and develop a sustainable and resilient food system.  "
        },
        {
            "text": "We will also open the second wave of funding across the industry-led Research & Development Partnerships Fund, beginning in the spring with the next £1 million competition for the 1-year Research Starter Projects. "
        },
        {
            "text": "These are designed to help farmers and growers with bold, ambitious ideas to step into innovation, build an expert collaborative team and further develop their ideas. New opportunities for Feasibility Projects and Small Research & Development Partnership projects are then expected to follow in the autumn. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "If you are interested in getting involved in Research & Development, our Deputy Director for Innovation, Productivity and Science, Tim Mordan recorded a podcast with a successful applicant to UKRI’s Transforming Food Production programme. "
        },
        {
            "text": "Rui Andrês, CEO of Fieldwork Robotics talks about The Soft Selective Raspberry Harvester, or SoSeRaH project. "
        },
        {
            "text": "The pair also provide an insight into the application process, and discuss the value of collaboration.  "
        },
        {
            "text": "Listen to the Future Farming Podcast"
        }
    ]
}