{
    "url": "https://insidehmcts.blog.gov.uk/2022/02/28/working-together-to-avoid-delays-to-probate-applications/",
    "title": "Working together to avoid delays to probate applications",
    "authors": [
        "Adam Lennon"
    ],
    "categories": [
        "Court and tribunal reform",
        "Family"
    ],
    "pub_date": "2022-02-28T15:30:13+00:00",
    "content": [
        {
            "text": "Behind every probate application there’s a bereaved family trying to organise their affairs at what can be a very sensitive time. It’s important that we make the process of applying for probate as efficient as possible for everyone using our service. "
        },
        {
            "text": "From January to September 2021, we received 130,000 probate applications from practitioners. Although most applications proceeded smoothly – taking on average 4 weeks to complete from receipt of documents – we know that stopped applications can cause anxiety for clients and create extra work for practitioners.  "
        },
        {
            "text": "Stopped applications can take more than double the amount of administrative time to issue compared to those we can issue on our first attempt. We estimate that we could increase the number of grants we issue by over 50,000 each year for practitioners and reduce waiting times if we work together to reduce the number of stopped applications.  "
        },
        {
            "heading": 3,
            "text": "What are the most common causes of stopped applications? "
        },
        {
            "text": "We stop applications because: "
        },
        {
            "text": "Missing documents "
        },
        {
            "text": "Some applications are stopped because the supporting documents we need to grant probate are missing. It’s very important that all supporting documents are sent to us at the same time as the application to reduce the risk of delays. Common missing documents include Power of Attorney forms or Inheritance Tax forms.  "
        },
        {
            "text": "Missing inheritance tax information "
        },
        {
            "text": "Inheritance tax is administered by HMRC. We need form IHT421 from HMRC before we can process applications, and this takes around 21 days to reach us. If we receive an application for probate before 21 days elapse, we cannot issue it, and this will cause delays. MyHMCTS sets out this requirement as part of the application process but some practitioners are still sending in their applications too soon. We’ll continue to test ways to reduce this issue but please leave enough time before applying for probate. "
        },
        {
            "text": "Missing executors "
        },
        {
            "text": "Another common issue we encounter is applications that do not include all the executors of an estate. Missing executors have often passed away, but we need to be told why any executor is not applying. We know that practitioners are busy and managing competing client demands, so to help we’re improving the guidance on MyHMCTS. In the future there will be a prompt to check that all executors are added. "
        },
        {
            "text": "Tell us about the condition of the will "
        },
        {
            "text": "For grant of probate applications, we need to stop applications that have unexplained changes to their condition to reduce the risk of fraud.  "
        },
        {
            "text": "Changes we look for include staple holes, rips or stains. To avoid delays there are text boxes on MyHMCTS to explain any issues about the will’s condition. The information shared in this box is added to the legal statement and then reviewed by our assessors. We’re adding more questions to MyHMCTS to provide a reminder to add these details. "
        },
        {
            "heading": 3,
            "text": "How MyHMCTS can help "
        },
        {
            "text": "There are lots of ways that MyHMCTS can help reduce the risk of delays to applications. For example, it generates a coversheet that lists the documents that need to be sent to us and the forms that need to be completed. It’s important that you use the coversheet because includes the case reference number by default. Having this number ensures we can match your documents to the online application quickly and reduces the risk of delays. "
        },
        {
            "text": "In the future, MyHMCTS users will receive reminders about any outstanding documents needed and their dashboard will hold all application updates in one place. "
        },
        {
            "heading": 3,
            "text": "What happens when an application is stopped? "
        },
        {
            "text": "When applications are stopped, they’re moved to a separate queue for processing while we wait for the information or documents that we need. We alert the practitioner and set out what we need in order for the application to progress. Once we have the information, we continue processing the application and the practitioner dashboard on MyHMCTS is updated. "
        },
        {
            "heading": 3,
            "text": "We want to hear from you "
        },
        {
            "text": "We’re always keen to listen to feedback and we meet regularly with our Probate Service User Group so if you have feedback please send it to your representative at the following organisations: "
        },
        {
            "text": "You can also email us to share your feedback with us directly.  "
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": "All supporting documents for online applications should be sent by recorded delivery to HMCTS Probate, PO Box 12625, Harlow, CM20 9QE. Documents should include the MyHMCTS coversheet which includes your case reference number. "
        },
        {
            "text": "Applications and supporting documents made by a paper form PA1A/PA1P, or a caveat submitted via a paper form PA8A should be sent to Newcastle District Probate Registry or Cardiff Probate Registry of Wales. "
        }
    ]
}