{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/28/chief-scientific-advisors-network-engagement-lead-go-science-heo/",
    "title": "Chief Scientific Advisors’ Network Engagement Lead – GO-Science (HEO)",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-11-28T22:36:28+00:00",
    "content": [
        {
            "text": "Chief Scientific Advisors’ Network Engagement Lead – GO-Science (HEO)"
        },
        {
            "text": "Do you care about the importance of science and evidence to inform government policy? Are you passionate about science leadership in government? If the answer is yes, then we would like to hear from you! This is an excellent opportunity to influence this important policy area with the very top scientists in government!"
        },
        {
            "text": "This role occupies a central position in the Science Networks, Systems and Capability Team at the Government Office for Science (GO-Science). We are a diverse and inclusive team and are looking for people who are comfortable working with a diverse range of people inside and outside the civil service. You will enjoy working creatively and independently to take forward this work which has been identified as a top priority by the Government Chief Scientific Adviser (GCSA), Patrick Vallance."
        },
        {
            "text": "You will provide the central secretariat support to the Chief Scientific Advisers’ Network (CSA Network) in cross-Government CSA, Deputy CSA and CSA Officials meetings. This high-profile cross-government working group is crucial to ensuring that scientific advice in government is appropriately communicated and actioned."
        },
        {
            "text": "We are also responsible for the implementation of the Science Capability Review. The review addresses the capability of Government Science and Engineering, recommending actions to further embed government science into policy making, so you will make a real difference in the delivery of science across Government. The findings and recommendations of the review work to the UK’s ambition to capitalise on the UK’s standing as a global leader in scientific research and education."
        },
        {
            "text": "Responsibilities"
        },
        {
            "text": "The closing date is Monday, 6th December. To find out more and to apply, visit Civil Service Jobs."
        }
    ]
}