{
    "url": "https://educationhub.blog.gov.uk/2021/11/what-the-new-temporary-covid-19-measures-mean-for-early-year-settings-out-of-school-settings-schools-colleges-and-universities/",
    "title": "What the new temporary COVID-19 measures mean for early year settings, out-of-school settings, schools, colleges and universities",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Colleges",
        "Coronavirus",
        "Primary Schools",
        "Schools",
        "Secondary schools",
        "Testing",
        "Universities"
    ],
    "pub_date": "2021-11-28T17:41:37+00:00",
    "content": [
        {
            "text": "On Saturday 27 November, the Prime Minister announced new temporary measures to “buy more time” for our scientists to understand the situation."
        },
        {
            "text": "Most of the guidance hasn’t changed and the new measures that are being introduced are temporary and precautionary and will be reviewed in three weeks."
        },
        {
            "text": "We will continue to keep this under review as the situation develops."
        },
        {
            "text": "Education Secretary Nadhim Zahawi said:"
        },
        {
            "text": "Here we outline what the new measures mean for education and childcare settings and what’s changed."
        },
        {
            "heading": 3,
            "text": "Face coverings"
        },
        {
            "text": "From tomorrow (Monday 29 November), we are strongly advising that face coverings should be worn in communal areas in all settings by staff, visitors and pupils or students in year 7 and above, unless they are exempt."
        },
        {
            "text": "Pupils or students (in year 7 or above) should continue to wear face coverings on public and dedicated school transport, unless they are exempt."
        },
        {
            "heading": 3,
            "text": "Testing"
        },
        {
            "text": "All educational and childcare settings should continue to encourage staff and students to test twice weekly using lateral flow device (LFD) tests."
        },
        {
            "heading": 3,
            "text": "Contact tracing and isolation"
        },
        {
            "text": "The current guidance on contact tracing and isolation remains in place - which means that close contacts should take PCR tests but do not need to isolate unless they are over 18 and unvaccinated. The exception is for close contacts of suspected or confirmed Omicron cases, who will be asked to isolate for 10 days."
        },
        {
            "heading": 3,
            "text": "Vaccination"
        },
        {
            "text": "All eligible staff and students aged 12 and over are encouraged to take up the offer of the vaccine, including boosters."
        },
        {
            "text": "Vaccines are our best defence against COVID-19. They help protect young people and adults, and benefit those around them. Vaccination makes people less likely to catch the virus and less likely to pass it on."
        },
        {
            "text": "To book a vaccine, please visit: Book or manage a coronavirus (COVID-19) vaccination - NHS (www.nhs.uk)."
        },
        {
            "heading": 3,
            "text": "International visits and trips"
        },
        {
            "text": "Individuals arriving in England must follow the red list rules."
        },
        {
            "text": "South Africa, Botswana, Eswatini, Lesotho, Namibia and Zimbabwe moved onto the red list at 12.00pm Friday 26 November."
        },
        {
            "text": "Angola, Malawi, Mozambique and Zambia were added to the red list at 4am Sunday 28 November."
        },
        {
            "text": "Schools, out of school settings and colleges will want to consider whether to go ahead with planned international educational visits at this time, recognising the risk of disruption to education resulting from the need to isolate and test on arrival back into the UK."
        },
        {
            "heading": 3,
            "text": "Good hygiene "
        },
        {
            "text": "Across all settings, people should continue to follow the basic rules of good hygiene. This will help to protect individuals and others from COVID-19. These are:"
        },
        {
            "text": "More information on our guidance for educational and childcare settings is available on gov.uk: Guidance for schools: coronavirus (COVID-19) - GOV.UK (www.gov.uk)."
        }
    ]
}