{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/10/09/applications-are-now-open-for-science-and-engineering-fast-stream-2026/",
    "title": "Applications are now open for Science and Engineering Fast Stream 2026",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Learning & Development",
        "Talent & Leadership"
    ],
    "pub_date": "2025-10-09T15:22:09+01:00",
    "content": [
        {
            "text": "Are you curious about science and engineering roles in government? Would you like to influence decision-making and policy using your science and engineering background? Then the Government Science and Engineering Fast Stream (SEFS) could be the career choice for you."
        },
        {
            "text": "Expertise applied to real-world challenges"
        },
        {
            "text": "Now is a fascinating time to start your career in government, with scientists and engineers making vital contributions to some of the biggest projects and policy decisions facing the government today. This covers a range of policy areas including climate, energy, health and the application of critical emerging technologies. Not only will you apply your existing knowledge and expertise to these areas, but you will also bring a new way of thinking to big social and economic challenges."
        },
        {
            "text": "About the Fast Stream programme"
        },
        {
            "text": "We are recruiting for the 2026 Science and Engineering Fast Stream. The Fast Stream is the Government's flagship graduate development programme, which equips the brightest candidates with the knowledge, skills and experience they need to become future leaders of the Civil Service."
        },
        {
            "text": "We want to recruit a diverse and versatile range of scientists and engineers to the scheme that reflect the diversity of our population. This diversity is crucial as it brings a variety of perspectives and ideas, which are essential for innovation and progress."
        },
        {
            "text": "Who can apply?"
        },
        {
            "text": "You may be a science or engineering graduate straight out of university, an experienced postgraduate academic, a seasoned industry professional or a current civil servant with relevant experience. This scheme allows you to become part of a modern community of science and engineering professionals. Your background brings valuable skills that will support our goal of a more scientific Civil Service."
        },
        {
            "text": "Over three years, you will experience a wide range of rewarding postings in diverse discipline areas across various departments such as Department for Environment, Food and Rural Affairs, Department of Business and Trade, or Department for Science, Innovation and Technology."
        },
        {
            "text": "Skills and networks"
        },
        {
            "text": "Throughout the scheme you’ll gain new skills and experience to help prepare you for a future leadership role.  You will join the Government Science and Engineering (GSE) Profession, a community of around 10,000 scientists, engineers and technical specialists across government, and you’ll also get the opportunity to join different Fast Stream networks. Through your networks, you can make an impact by taking part in wider corporate contributions to build your interpersonal skills, strategic understanding and experience working with a range of stakeholders."
        },
        {
            "text": "Unique placements"
        },
        {
            "text": "The GSE Profession are keen to provide a broad experience within our scheme, and we offer a unique six-month placement in your second year which may include working in local government, charity and private sector roles. Together, these postings will develop your ability to apply your scientific mindset and your leadership potential, to prepare you to become a future senior leader in the Civil Service."
        },
        {
            "text": "How to apply"
        },
        {
            "text": "The Science and Engineering Fast Stream will develop you into a confident and inspiring future senior leader in the Civil Service, supporting our ambition to put science and engineering at the heart of government decision-making. If you are passionate about a leadership career in science and engineering, this is a great opportunity, don’t delay, apply today and grow like nowhere else."
        },
        {
            "text": "For more information and to apply, please visit the Science and Engineering Fast Stream on the Civil Service Fast Stream website."
        },
        {
            "text": "Applications open midday Thursday 9 October 2025 and close midday Thursday 6 November 2025.   "
        }
    ]
}