{
    "url": "https://space.blog.gov.uk/2025/10/09/celebrating-world-space-week-2025-on-londons-piccadilly-lights/",
    "title": "Celebrating World Space Week 2025 on London’s Piccadilly Lights ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space"
    ],
    "pub_date": "2025-10-09T16:47:51+01:00",
    "content": [
        {
            "text": "This World Space Week, we’re proud to see space, art, and creativity come together on one of London’s most iconic landmarks – the Piccadilly Lights. "
        },
        {
            "text": "On Wednesday 8 October, SPACE for a Better World and the Space for Art Foundation lit up the famous screen with a digital mosaic created from over a thousand artworks submitted by people across the world. Each piece reflected this year’s World Space Week theme, “Living in Space.” "
        },
        {
            "heading": 2,
            "text": "Inspiring people through art and space"
        },
        {
            "text": "The UK Space Agency supported the project, alongside partners including UK Scouts, Great Ormond Street Hospital, Ocean Culture Life, and the Sustainable Markets Initiative. Together, the partners are helping to highlight how space exploration and technology shape our everyday lives – from supporting climate science to inspiring the next generation. "
        },
        {
            "text": "Matthew Cook, Head of Space Exploration at the UK Space Agency, said: "
        },
        {
            "text": "Christina Korp, founder of SPACE for a Better World, explained: "
        },
        {
            "text": "Nicole Stott, astronaut, artist, and founder of the Space for Art Foundation, added: "
        },
        {
            "heading": 2,
            "text": "A celebration of creativity and collaboration"
        },
        {
            "text": "Representatives from all the partner organisations joined the event, recognising the role of art in making space more accessible and inspiring. Piccadilly Lights, a long-time supporter of the project, once again generously provided the stage for this unique celebration. "
        },
        {
            "text": "Following the mosaic reveal, invited guests attended a reception hosted by Bang & Olufsen at their Mayfair Boutique. The evening featured a fireside chat with Christina Korp, Nicole Stott, and Matthew Cook, exploring how art, science, and storytelling can open new perspectives on why space matters to us all here on Earth. "
        }
    ]
}