{
    "url": "https://dragonsden.blog.gov.uk/2025/10/09/dragons-den-ip-blog-series-22-episode-11/",
    "title": "Dragons Den IP Blog - Series 22 Episode 11",
    "authors": [
        "Megan Davies"
    ],
    "categories": [
        "Designs",
        "IP",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2025-10-09T21:00:00+01:00",
    "content": [
        {
            "text": "This week’s episode of Dragons’ Den featured some extra fire as guest Dragon Joe Wicks returned to the Den to join the other five investors. As they settled in to see what this week’s entrepreneurs would bring, I was playing a game of spot the intellectual property (IP). "
        },
        {
            "text": "This week had pitches for playful puppetry, plant-based protein, physical performance and professional placement, and the entrepreneurs all brought their a-game.  "
        },
        {
            "heading": 3,
            "text": "Delicious and nutritious  "
        },
        {
            "text": "One of the pitches on this evening’s episode came from entrepreneurs Sam Fresco and Steve Wildish. The pair were seeking a £100,000 investment in exchange for a 20% stake of their business, Notorious Nooch.  "
        },
        {
            "text": "Having been vegan myself for four years, I am already familiar with nutritional yeast, nicknamed nooch. These are flakes that can be added to food to help vegans and omnivores alike, make sure they’re getting enough vitamin B12 in their diet while giving food a slightly cheesier, nuttier flavour. "
        },
        {
            "text": "Sam and Steve’s brand gives this product, in Steven Bartlett’s own words, a “Gen Zillenial” fresh look, with its colourful cartoon, vintage style branding. And it’s not just the packaging that makes it stand out from long standing competitors - with new flavours such as smoky bacon, cheesy or grilled chicken on offer for consumers.  "
        },
        {
            "text": "Several of the Dragons enjoyed how the food tasted and were interested in the high protein content, especially vegan Deborah Meaden who is a regular consumer of nooch. "
        },
        {
            "heading": 3,
            "text": "Polarising packaging "
        },
        {
            "text": "While I'm a personal fan of the Nooch packaging and branding (perhaps because I fall into the Gen Zillenial category Steven mentioned!), it certainly divided the Den. Joe Wicks said he loved it, Peter Jones said he hated it, and Deborah Meaden stated that she both loved AND hated it! The branding became one of the biggest talking points during the pitch, demonstrating just how crucial visual identity can be for product success. "
        },
        {
            "text": "Regardless of others’ opinions, protecting your brand identity is essential. A quick search on our trade mark search confirms that Notorious Nooch have wisely registered their logo under trade mark UK00003546764. Without trade mark protection, competitors could potentially use similar logos, causing confusion in the marketplace and potentially damaging your brand's reputation. Registration gives you exclusive rights to use your logo and enables you to take legal action against anyone who uses it without permission.  "
        },
        {
            "text": "Beyond the logo, if Sam and Steve decide to disregard the Dragons’ comments on their packaging, they could choose to protect the packaging as a registered design. If it’s new and has individual character, you can apply for design registration, starting from £50.  "
        },
        {
            "heading": 3,
            "text": "An offer deficiency "
        },
        {
            "text": "Ultimately, as tasty as some the Dragons deemed the product to be, none chose to invest, citing a lack of passion and packaging flair as their main reasons. Although the entrepreneurs exited the Den empty handed, their brains were surely full of considerations for propelling the brand, thanks to the Dragons’ advice."
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}