{
    "url": "https://socialcareinspection.blog.gov.uk/2025/10/09/prioritising-social-care-registration-applications-putting-the-needs-of-children-and-young-people-first/",
    "title": "Prioritising social care registration applications: putting the needs of children and young people first   ",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes",
        "local authorities",
        "looked after children",
        "social care professionals",
        "social care regulation"
    ],
    "pub_date": "2025-10-09T10:06:27+01:00",
    "content": [
        {
            "text": "Following an unprecedented and sustained rise in applications to register children’s homes, on Thursday 18 September, we published our revised policy for prioritising children’s homes applications. The revised policy sets out the criteria for urgently dealing with applications. In short, these include: "
        },
        {
            "text": "You can look at the policy in more detail, where we also explain other exceptional circumstances that may lead to us prioritising an application. These circumstances can include the need for a home that can care for children with complex support needs. The revised policy complements April’s changes to the Social Care Common Inspection Framework to promote greater stability for children who might otherwise experience multiple moves and disruption in their lives. "
        },
        {
            "text": "Applications that meet the priority criteria will be informed by a thorough understanding of local need, informed by productive discussions with local authorities. Applicants will be able to demonstrate that they will be able to provide the kind of high-quality care and support that all children deserve. "
        },
        {
            "heading": 2,
            "text": "Higher numbers of registration applications "
        },
        {
            "text": "In June we published a blog post about registration applications, explaining that the unprecedented number of applications were taking longer than usual to register. The total number of children’s home applications in the last 12 months was almost double the figure for the previous year. We are also still receiving a significant number of supported accommodation applications each month, adding to the already unexpectedly high volumes. We have not been able to keep pace with the increase in applications. "
        },
        {
            "text": "This is clearly not a satisfactory situation for providers who are keen to begin supporting and caring for children, and for local authorities who are desperately looking for suitable homes for their children and young people. Most importantly, it’s harmful to children.  "
        },
        {
            "heading": 2,
            "text": "Why we have revised our policy "
        },
        {
            "text": "It is important that, in line with our core inspection principles, we use our limited resources in a way that best serves the interests of children and young people. We want to be as transparent as possible about the way we are working.  "
        },
        {
            "text": "We don’t think it makes sense to deal with applications solely in order of the date they are received. This approach would fail to fully take into account which applications are best placed to provide what children need now. The sufficiency challenges demand a considered response. "
        },
        {
            "text": "There is a disproportionately high number of homes in some areas while, elsewhere, there is a chronic shortage. Too many children are living too far from home, isolated from their family and friends, and not necessarily receiving the type of care that meets their specific needs. We believe it is right that we prioritise applications that address the shortage of placements for those children in most urgent need and, more generally, those areas where there is clear evidence of a lack of suitable provision.  "
        },
        {
            "text": "As you’d expect, we have liaised closely with Department for Education colleagues on this change which is closely aligned with the government’s commitment to increasing children’s access to high-quality, stable homes in the right place, underpinned by a well-balanced regulatory regime that focuses on what matters most to children and young people (Keeping Children Safe, Helping Families Thrive). "
        },
        {
            "text": "While we will make sure the applications that meet the relevant criteria are prioritised, we will carry on progressing all applications in the system as efficiently as we can.  "
        },
        {
            "text": "The revised policy only relates to children’s homes. However, I am aware that similar issues are faced by children needing supported accommodation. We will closely monitor the effectiveness of this approach for children’s homes in the coming months. If it has the desired impact, we will consider implementing a similar policy for supported accommodation applications in April 2026. In the meantime, I urge all potential providers to base their applications on a clear understanding of local need and their ability to meet that need. "
        },
        {
            "heading": 2,
            "text": "Time taken to reach a decision "
        },
        {
            "text": "The time it takes to reach a registration decision is dependent on several factors, including receiving the correct information in a timely manner. We expect that we will be able to reach a decision within 3 to 6 months of receiving a complete children’s homes registration application that meets the criteria for prioritisation, but there may be cases where it takes longer.  It is likely to take 6 to 18 months for those that do not meet the prioritisation criteria."
        }
    ]
}