{
    "url": "https://ipo.blog.gov.uk/2025/10/09/the-curtain-falls-a-farewell-to-the-karaoke-shower/",
    "title": "The curtain falls, a farewell to the Karaoke Shower ",
    "authors": [
        "Catherine Davies"
    ],
    "categories": [
        "Copyright",
        "Innovation",
        "IPO",
        "Schools"
    ],
    "pub_date": "2025-10-09T09:10:47+01:00",
    "content": [
        {
            "text": "After more than a decade of touring the nation and out of tune singing, the time has come to bid farewell to our beloved Karaoke Shower. Yes, that is right, the shower curtain is finally coming down on what must rank as one of the most bizarre education initiatives, not just at the Intellectual Property Office (IPO), but in government history. "
        },
        {
            "text": "For those who are wondering what I could possibly be talking about, let me take you back to 2013, Peter Capaldi was Doctor Who and Disney were readying to release a film based on the snow queen with a fairly catchy soundtrack.  "
        },
        {
            "text": "Picture if you will, a travelling karaoke booth disguised as a shower, complete with curtain for privacy. The concept was simple (and borrowed from the Cracking Ideas Exhibition the IPO had funded a few years earlier). Get people singing popular songs, capture their performance on camera, share them on social media, and in the process, teach them about respect for copyright. It was Dragons’ Den meets Britain’s Got Talent, but with more intellectual property (IP) and significantly less talent."
        },
        {
            "text": "The Karaoke Shower turned our approach to copyright and IP education on its head. It tackled the barriers to behaviour change that prevented young people from respecting copyright. It made copyright concepts tangible by connecting them to music that young people loved. When you’re singing along to chart hits, you naturally relax your guard and start to think about the creators.  "
        },
        {
            "text": "Singing your favourite songs, laughing with friends and sharing music made our IP education fun rather than worthy, interesting not finger wagging. We created an environment where learning about copyright felt natural, not preachy. "
        },
        {
            "text": "The Karaoke Shower made its debut at the Music Show in Manchester 2013 and was in fact a last-minute filler to an exhibition space booked by UK Music to launch MusicInc game (which was eventually launched 3 months later).   From the moment the event opened we knew we were onto a winner. Lines of young people formed to take their turn and the huge queues were a captive audience for our messaging on respect for copyright.   "
        },
        {
            "text": "From there, the Karaoke Shower toured the UK stopping at the Houses of Parliament for ‘Rock the House’, the Glasgow Science Centre, the Beatles Experience, Liverpool and newly opened Birmingham Library. At its peak it was in demand for every youth experience and became part of The Big Music Project and World Skills.  But it wasn’t just young people who wanted a go – prominent MPs, Queen’s Brian May, JLS’ Oritse Williams and even Father Christmas himself all took a turn in the Karaoke Shower. "
        },
        {
            "text": "The Karaoke Shower toured regularly until Covid, and the world has moved on. Social media platforms like TikTok have made everyone a performer, streaming services have revolutionised how we consume copyright materials and the challenges facing the industry have evolved in a way that we could not have imagined when we first pulled back the curtain. But the message remains the same. Creativity has value and that value deserves protection and respect. "
        },
        {
            "text": "As we bid farewell to our travelling companion, let’s remember what it represented, the willingness to try something completely different to educate young people about copyright and IP.   "
        }
    ]
}