{
    "url": "https://cspl.blog.gov.uk/2023/04/13/an-opportunity-to-reform-standards-in-central-government/",
    "title": "An opportunity to reform standards in central government",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Standards Matter 2"
    ],
    "pub_date": "2023-04-13T14:16:49+01:00",
    "content": [
        {
            "text": "In November 2021, the Committee published the report on its landscape review of the standards regime in central government. "
        },
        {
            "text": "Upholding Public Standards made recommendations to increase the independence of regulators, strengthen the rules and build a better compliance culture in central government. "
        },
        {
            "text": "Like the previous Boardman report into Greensill, and PACAC report published in December 2022, the evidence we heard pointed to the need for greater proactive attention to standards to protect the integrity of government."
        },
        {
            "text": "Changes to the structures and processes that support high standards often follow a scandal and response. But when changes are made following media and public outcry this runs the risk of rushed, disproportionate or partial reforms. The Committee’s 2021 report was not a response to any particular scandal, but was intended as a health check on the complex web of regulatory bodies, rules and codes that have evolved over several decades. We looked at the ethical regulation of public appointments made by ministers, how conflicts are managed in business appointments when people leave public office, the Ministerial Code governing ministerial conduct, and the level of transparency around lobbying and ministers’ interests."
        },
        {
            "text": "The current system - mostly non statutory and based on convention - has been stress tested in recent years. And while I am not someone who believes that there has ever been a golden time for perceptions of standards, recent polling shows the worrying impact negative perceptions of standards can have on public trust. "
        },
        {
            "text": "The government has committed to responding to our report before the Summer and we remain hopeful that our 2021 proposals are being carefully considered. "
        },
        {
            "text": "The appointment of Sir Laurie Magnus last December and the publication of his reports on individual cases is also a welcome step. "
        },
        {
            "text": "There is a real opportunity to repair and update the way standards are maintained and promoted in central government, providing the transparency, accountability and scrutiny that helps build and maintain the public’s trust. We await the government’s response with interest."
        },
        {
            "text": " "
        },
        {
            "text": "Download CSPL previous reports"
        },
        {
            "text": "What are the Nolan Principles?"
        },
        {
            "text": "Watch short film about the work of the Committee"
        }
    ]
}