{
    "url": "https://ipo.blog.gov.uk/2023/04/13/standard-essential-patents-do-they-work-for-smes/",
    "title": "Standard Essential Patents – do they work for SMEs?",
    "authors": [
        "kayleighenticknap"
    ],
    "categories": [
        "Patents",
        "Transformation"
    ],
    "pub_date": "2023-04-13T12:35:16+01:00",
    "content": [
        {
            "text": "Following the Standard Essential Patents (SEP) Call for Views that we ran last year, we’re now hosting a short SEPs Questionnaire. This time, we want to understand how the SEPs framework and licensing environment works for smaller-sized businesses.  "
        },
        {
            "text": "We spoke to Sarah Whitehead, Director of Business and International Policy, to find out more.  "
        },
        {
            "heading": 2,
            "text": "Sarah, why is the government running the SEPs Questionnaire now, and why is it specifically seeking views from SMEs, small-cap and mid-cap businesses?"
        },
        {
            "text": "Technology is constantly evolving and becoming more widespread in our daily activities. It is increasingly likely that businesses will interact with technical standards when innovating with products requiring the use of technical standards.  "
        },
        {
            "text": "We asked a number of questions in the SEPs Call for Views last year, asking for responses that we hoped would reflect a wide range of interests that we could consider as we develop policy and think about interventions in this area. "
        },
        {
            "text": "The responses we received were mostly from large organisations involved in standard development and SEP licensing.   "
        },
        {
            "text": "While we mainly received anecdotal evidence from bodies representing smaller companies, we realised that we didn’t hear sufficient evidence directly from UK SMEs, small-cap and mid-cap businesses.  "
        },
        {
            "text": "We are now running a SEPs questionnaire because we want to hear views from those smaller businesses and find out about their experience of interacting or using technical standards when innovating."
        },
        {
            "heading": 2,
            "text": "What role does the IP framework play and why is it important to SEPs?"
        },
        {
            "text": "Part of the IPO’s role is ensuring that the intellectual property framework is functioning efficiently to promote innovation and that it creates the right balance for interested parties who engage in SEP licensing.  "
        },
        {
            "text": "The IP framework plays a crucial role in enabling creativity and incentivising innovation. It creates jobs and encourages economic growth and, for the UK, it allows us to maintain our position as one of the global leaders of innovation. "
        },
        {
            "text": "Innovation is at the forefront of the UK Government's ambitions, and our goal is to make the UK a global hub for science and innovation. As technologies become increasingly interconnected, we are relying more heavily on technical standards. "
        },
        {
            "text": "This means that people wishing to operate in these technologies, so called implementers, have no option but to use those standards, including access to the SEPs within them. "
        },
        {
            "heading": 2,
            "text": "Can you tell us more about the 2022 Call for Views on SEPs and the responses you received? "
        },
        {
            "text": "We launched a call for views on SEPs and Innovation to better understand if the current framework for SEPs is providing a fair balance for those involved in the licensing and implementing of SEPs."
        },
        {
            "text": "The call for views closed in March 2022 and the responses provided valuable evidence and data and various issues were raised. "
        },
        {
            "text": "The themes the call for views covered included: "
        },
        {
            "heading": 2,
            "text": "What feedback did you receive? "
        },
        {
            "text": "We heard about a lack of transparency in the licensing system, including in the pricing of SEPs and uncertainty around whether a patent being licensed is essential to technical standards being relied upon. "
        },
        {
            "text": "A number of respondents also told us that threats of court-imposed injunctions and the potential for litigation impacted on business' approach to licensing of SEPs. We heard that new entrants and SMEs often lack the experience and knowledge to enter negotiations on a level playing field. "
        },
        {
            "text": "We also heard that new entrants and SMEs do not take part in the standardisation process. This may mean they have no insight into whether a patent is essential to a standard and therefore whether a licence is required. "
        },
        {
            "text": "Some respondents also stated that some of these issues may cause barriers to innovation and scale-up. We also received various proposed solutions. Some said that Government intervention may help improve these issues through changing legislation, issuing guidance or establishing or strengthening institutions or processes. "
        },
        {
            "text": "It should be noted that this publication does not propose any changes or reforms to the SEPs framework and the views are not of the government but those of respondents."
        },
        {
            "heading": 2,
            "text": "What is your advice for SMEs, small-cap and mid-cap businesses who interact with SEPs?"
        },
        {
            "text": "I would urge them to get in touch to let us know whether they have had first-hand experience of interacting with the development of technical standards and SEP licensing, and if so, how it impacts on their business or approach to innovation. "
        },
        {
            "heading": 3,
            "text": "The SEPs Questionnaire is open until 24 April 2023.   "
        },
        {
            "text": "If you have any further questions, would like to speak directly with the IPO about completing the questionnaire, or would prefer to share your experiences via email or phone call, please contact: sepcallforviews@ipo.gov.uk. "
        },
        {
            "text": " "
        }
    ]
}