{
    "url": "https://videosurveillance.blog.gov.uk/2023/04/13/the-biometrics-institutes-new-learning-tool/",
    "title": "The Biometrics Institute's new Learning Tool",
    "authors": [
        "frasersampson"
    ],
    "categories": [
        "AI technology",
        "Biometrics",
        "Biometrics and Surveillance Camera Commissioner",
        "DNA",
        "Ethics",
        "Facial Recognition Technology",
        "Fingerprints",
        "Regulation",
        "Standards",
        "Training"
    ],
    "pub_date": "2023-04-13T14:58:37+01:00",
    "content": [
        {
            "text": "The Biometrics Institute has launched a Biometrics Essentials learning tool. This online course will teach the ethics and good practices that need to be considered when implementing a biometric system."
        },
        {
            "text": "The learning tool is designed for people working in both the public and private sector, from a range of different fields and expertise. It includes regular updates to the learning tool content by the Institute’s expert groups and covers a wide range of topics, types of biometrics modalities and varying standpoints on biometric technologies used in the biometric systems."
        },
        {
            "text": "The course, developed by the Biometrics Institute, is based on their Good Practice Framework, a risk and decision-making management tool. It will have learners gaining insight into the complex decision-making processes involved when implementing biometrics, while understanding how these decisions impact the biometric user."
        },
        {
            "text": "The online format allows participants the flexibility to learn at their own pace and schedule. Learners will be taught through real world experiences, exploring the strengths and weaknesses that existing biometrics systems have."
        },
        {
            "text": "“Over the past 21 years we have been providing better education on biometrics. We are therefore thrilled to offer this user-friendly programme to professionals wanting to expand their knowledge and skills in biometrics” says Isabelle Moeller, Chief Executive Officer, of the Biometrics Institute.  “With the rapid growth and adoption of biometrics in various industries, it is more important than ever for users, suppliers and others considering the implementation of biometrics to have a strong understanding of this technology. Our Biometrics Essentials learning tool is designed to provide everyone with the knowledge and skills they need to mitigate risk in this field.”"
        },
        {
            "text": "The Biometrics and Surveillance Camera Commissioner Professor Sampson has stated that, “One of the key elements in ensuring accountability and legitimacy in the use of biometrics by the State is understanding – the better people’s understanding of what’s possible (technologically), what’s permissible (legally) and what’s supported/expected (societally) the closer we will get to balancing these three appropriately. Having learning tools such as this can make a big contribution to that outcome.”"
        },
        {
            "text": "The Biometrics Institute is an independent and impartial international membership organisation for biometric users and other interested parties. They have been educating users and suppliers in the responsible, ethical, and effective use of biometrics for over two decades. The learning tool is a reminder of the importance of applying the Three Laws of Biometrics in biometrics applications and complemented by other good practice guidance material the Institute provides."
        },
        {
            "text": "The course has been tested by novices, interim and seasonal professionals and is free for all to take, not just those who are already members. It takes approximately one hour, and the user will be awarded with a certificate upon completion."
        },
        {
            "text": "More information about the Biometrics Essentials learning tool is available here."
        }
    ]
}