{
    "url": "https://educationhub.blog.gov.uk/2022/01/28/2022-2023-student-loan-repayment-thresholds-confirmed/",
    "title": "2022-2023 Student Loan repayment Thresholds Confirmed",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2022-01-28T17:41:57+00:00",
    "content": [
        {
            "text": "The repayment threshold for Plan 2 student loans – the income level above which post-2012 student loan borrowers are required to make repayments - will remain at its current level of £27,295 per year for the next financial year."
        },
        {
            "text": "The government has also confirmed that the repayment threshold for Plan 3 student loans (postgraduate loans) will remain at its current level of £21,000 per year for financial year 2022-23."
        },
        {
            "text": "Tuition fees will continue to be frozen at £9,250, helping to deliver a fair deal to current students. This is the fifth year in succession that fee caps have remained at the same level, saving a typical full-time student finishing a course in the 2022/23 academic year over £3,000 across a three year degree."
        },
        {
            "heading": 3,
            "text": "What does this mean in practice? "
        },
        {
            "text": "Maintaining the Plan 2 and Plan 3 repayment thresholds for 2022-23 are expected to have only small impacts on individual lifetime student loan repayments. But at the same time maintaining the Plan 2 repayment threshold will save an expected £3.7bn (PSNB) over the period up to April 2025."
        },
        {
            "text": "In brief, individuals with Plan 2 loans who earn over £27,295 will repay up to an additional £9.45 per month."
        },
        {
            "heading": 3,
            "text": "Is my loan a Plan 2 or 3 loan? "
        },
        {
            "text": "Plan 2 student loans includes anyone who took out a student loan for an undergraduate, Level 4/5, and/or PGCE course beginning on or after 1 September 2012, as well as Advanced Learner Loan borrowers. More details of the student loan plans can be found here: Repaying your student loan: Which repayment plan you're on - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Plan 3 loans are postgraduate loans."
        },
        {
            "heading": 3,
            "text": "Why have you made this change?"
        },
        {
            "text": "Overall, the cost of higher education to the taxpayer is rising, so the government wants to ensure the student loan system is underpinned by sustainable funding arrangements so it provides value for money for both those who benefit from higher education and the taxpayer."
        },
        {
            "text": "Higher education will continue to be open to everyone who has the ability and the ambition to benefit from it, including the most disadvantaged, and no student will have to start repaying their loan until they can afford to."
        },
        {
            "text": "Median annual earnings for young graduates have risen from £24.5k to £28k over 2016-20, and in 2020 they typically earned £6.5K more per year than their non-graduate counterparts."
        },
        {
            "text": "This update comes ahead of significant wider improvements to the post-18 system which will improve social mobility and help level up opportunities across the country."
        },
        {
            "text": "This includes the introduction of the Lifelong Loan Entitlement from 2025 – which learners will be able to use to support up to 4 years of flexible post-18 study throughout their lifetime – and proposed reforms to tackle poor-quality higher education courses that offer poor job prospects for graduates."
        },
        {
            "text": "We will drive up standards across our universities ensuring all students receive a world class education that will lead to high value, high quality and high wage jobs and are fair to graduates as well as a good return on investment for the taxpayer."
        },
        {
            "text": "A Department for Education spokesperson said:"
        }
    ]
}