{
    "url": "https://civilservice.blog.gov.uk/2022/01/28/civil-service-awards-data-modelling-isnt-a-crystal-ball/",
    "title": "Civil Service Awards: Data modelling isn't a crystal ball",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-28T13:11:50+00:00",
    "content": [
        {
            "text": "The government has often talked about “following the science” - but how? One way is by utilising the Scientific Pandemic Influenza group on Modelling (SPI-M), all made possible by a small team of brilliant civil servants. "
        },
        {
            "text": "The SPI-M Secretariat is the crucial link between world-class mathematical epidemiologists and government. How? They ensure that decisions affecting public health are underpinned by the best evidence - producing extraordinary quality advice despite huge pressure."
        },
        {
            "text": "What you may also not know about the secretariat is that they’re a small team of civil servants who facilitate cutting edge science and ensure that objective, impartial insight is provided to government. They have delivered innovative, high-impact science in direct support of ministers, senior officials and the public."
        },
        {
            "text": "“They are *the*nexus that links generalist policy makers to specialist mathematicians so that the right science is applied to the appropriate questions… It is no exaggeration to say that their work directly supports decisions that have saved tens of thousands of lives.” Professor Dame Angela McLean, Chief Scientific Adviser, Ministry of Defence "
        },
        {
            "text": "Career highlight"
        },
        {
            "text": "With such high praise, it’s no wonder the judges found a worthy winner of the Science and Innovation Award in the SPI-MSecretariat. Whilst the win came out of the blue to the team, it meant a lot to be recognised in this “career highlight” for what they have achieved throughout the pandemic. It was particularly meaningful because it is unsung teams like this which tend to operate behind the scenes, but produce work that has asignificant impact."
        },
        {
            "text": "“With SPI-M, the government has a fairly unique asset which allows it to get free, robust advice that is both influential and relevant while facilitating high impact science. The secretariat has been the interface that has made that work.” - Paul Allen, Deputy Director, COVID-19 and Health Protection Analysis"
        },
        {
            "text": "The team organised more than 140 scientific meetings, often turning around modelling insight consensus around in less than 12 hours. They’ve influenced the government to use science when developing policy and have successfully fought for academics to access the data necessary to enhance their models. Ultimately, they produce even better results for decision makers. They’ve also played a part in the major steps the government has taken to protect citizens, such as national lockdowns, prioritising education, support bubbles and the vaccination programme."
        },
        {
            "text": "However, Paul Allen (a scientist before becoming a civil servant) warns that modelling is not an exact science."
        },
        {
            "text": "“It's been great to be in a role that incorporates elements of both science and policy - making sure we have good collaborative relationships with colleagues across government, and ensuring that the value and relevance of the science is understood.” He adds, “One of the things we are constantly emphasising to colleagues is that modelling is a useful to tool to help understand potential scenarios, but it’s not a crystal ball!”"
        }
    ]
}