{
    "url": "https://civilservice.blog.gov.uk/2022/01/28/cs-awards-pm-award-for-exceptional-public-service/",
    "title": "CS Awards: PM's Award for Exceptional Public Service",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-28T17:28:21+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Rizwan Ahmad paved the way to help more than 5,500 young East Londoners join the Kickstart scheme."
        },
        {
            "text": "Rizwan Ahmad was “proud, privileged and humbled” to scoop the inaugural Prime Minister's Award for Exceptional Public Service. Rizwan saw off stiff competition from Neha Dutt (Defra) and Rhys David Thomas (Ministry of Defence) to come out on top in his hard-fought category, and is justifiably feeling chuffed. No wonder his triumph has shot to the top of his personal career highlights – he said:"
        },
        {
            "text": "“I’m truly honoured to have received this award and deeply proud of the great work my inspiring team of dedicated public servants deliver.” "
        },
        {
            "text": "Rizwan, who works for the Department for Work and Pensions, won the award for his success in remobilising face-to-face service delivery across the East London Jobcentre network. This includes the opening of six new Jobcentres, and recruiting, inducting and training more than 1,000 new Work Coaches who help steer individuals and families through difficult times to find, stay in and progress in a job."
        },
        {
            "text": "Leadership and focus"
        },
        {
            "text": "Rizwan oversees more than 1,990 colleagues across 16 Jobcentres and one Service Centre in East London. His focus on supporting people back to work resulted in the best performance at district level anywhere in the UK. Thanks to his efforts, more than 5,500 young East Londoners have now joined the Kickstart programme. These achievements are testament to Rizwan’s leadership and focus."
        },
        {
            "text": "Vital leg up"
        },
        {
            "text": "Rizwan knows only too well that delivering exceptional public service helps embody A Modern Civil Service, whilst the Kickstart scheme gives a vital leg up onto the job ladder for 16- to 24-year-olds on Universal Credit."
        },
        {
            "text": "“I really value inclusion, it’s at the core of everything we do and critical to creating successful teams,” said Rizwan. “Colleagues who feel valued are energised to deliver exceptional public service, to take on new opportunities, to create new solutions and innovate - in this environment, colleagues thrive. For me, this embodies A Modern Civil Service.”"
        }
    ]
}