{
    "url": "https://mojdigital.blog.gov.uk/2022/01/28/how-accessibility-issues-led-to-authentically-voiced-content-on-the-hub/",
    "title": "How accessibility issues led to 'authentically-voiced' content on the Hub",
    "authors": [
        "Jane Stead"
    ],
    "categories": [
        "Accessibility",
        "Content",
        "Content Hub Team"
    ],
    "pub_date": "2022-01-28T17:12:12+01:00",
    "content": [
        {
            "text": "In the previous blog about how a focus on accessibility moulded the Content Hub, we talked about how a simple misunderstanding of rules and protocol in prison establishments can lead to increased frustration, anger, and violence. In this blog, we talk about how this focus led to even more authentic audio and visual content, and we share plans for increased accessibility in the near future…"
        },
        {
            "text": "Hear, Hear"
        },
        {
            "text": "It's a great step forward having all the correct information about a prison in one place - simple, visual, easily updated and 24/7 - in the 'Guide to Cookham Wood'. Staff also refer to this Guide quickly and easily. Now all people in this prison establishment are singing from the same song-sheet so things should be more harmonious, right?"
        },
        {
            "text": "Yes. But we knew we could go further. Although flooded with infographics, the Guide still held some text-heavy content. Aware of the poor literacy levels in Young Offenders' Institutions (YOIs), Senior Content Designer Jo Meek commissioned National Prison Radio (already a positive force on the Hub providing 24/7 music and talk) to come into HMYOI Cookham Wood and record some of the boys on their radio production course to 'voice' this new digital Guide. This day went very well. The boys learnt a lot about radio production and we now have, on the Content Hub, YOI boys telling other YOI boys everything they need to know about living in Cookham. The very first authentically-voiced prison audio rulebook. "
        },
        {
            "text": "But we thought, what if rules and processes change? That would mean the audio Guide is outdated, leading directly to the confusion we want to avoid? We didn't want to suddenly introduce a 'new bit of voice' to update part of the Guide. So we decided to use several voices to add variety, but also so we can continually update the Guide as it becomes outdated, without ruining the 'authentic voice' flow. This voice edit of the Guide can be done on-site, by a boy in the radio production course, so the Guide can remain a single source of truth. "
        },
        {
            "text": "This very first audio prison Guide was studio-edited and is now LIVE on the Content Hub alongside the infographic version and has received positive feedback from the boys. When boys are telling other boys the correct rules about Cookham Wood, we envisage a reduction in anxiety, self-harm and violence. Boys trust other boys because they have 'lived experience', even if they don't necessarily know or like them. So far, all direct feedback about the Guide from the boys has been good. We have now shared the transcript of the audio Guide to other prison sites for them to edit, create in-house with local prisoners and upload to the Hub."
        },
        {
            "text": "Increased digital literacy"
        },
        {
            "text": "Backed by Will Finn's research, we were conscious of the introduction of digital posing further breakdowns of communication. For example, some of the children had never used a laptop before. To remedy this, we created step-by-step guides, with screenshots and videos on exactly how to use a computer. This, in itself, is a step towards better digital literacy in the prison estate. It's hard to get, or even apply for, a regular job on the outside without basic computer skills. "
        },
        {
            "text": "Watching and listening is the best communication"
        },
        {
            "text": "Psychologists now know we learn far more and far more deeply by watching and listening to people we trust, than through any other form of communication. We 'imitate' our trusted role models. Direct feedback from the 2 pilot prisons told us that videos proved the most effective communication."
        },
        {
            "text": "Building on this, we joined forces again with National Prison Radio. "
        },
        {
            "text": "Senior Content Designer, Jo Meek, had already worked tirelessly with them to create 24/7 music, talk and original authentic-voice distraction content on the Hub. Jo observed closely the impact of the Content Hub on residents and staff for almost 2 years. With her usual foresight, Jo commissioned a series of 10 authentic voice videos, in which LJ Flanders, former HMP Pentonville resident and author of the 'In-cell Workout', leads exercises and discusses important issues such as men’s mental health and wellbeing. Exercise in prison is vital for mood stability, as well as physical health, and residents continually ask for more exercise videos. This new commission now means we have an authentic voice, an inspirational story and full accessibility in our exercise videos. We hope it will lead to a continual flow of authentically-voiced exercise videos on the Hub? The more residents spend time with positive role models (albeit virtually), the closer they may come to making more positive life decisions."
        },
        {
            "text": "For the female estate, some of the content needs are different, as Jo Meek explains in our next blog. In response to this, Jo commissioned a series of 10 videos led by a female trainer with lived experience of prison who leads exercises, as well as discussing women’s mental health and wellbeing. These are now live in female estate sites."
        },
        {
            "text": "Future accessibility on the Hub"
        },
        {
            "text": "There is always so much more that 'could' be done if we had time, a concept many people in digital are familiar with. But looking forward, in-cell tech is now working on further accessibility measures:"
        },
        {
            "text": "A different and expanding mindset"
        },
        {
            "text": "All these creative ways of communicating with people in prison have come about by making the most of what the digital world has to offer. "
        },
        {
            "text": "We're convinced by Hub feedback that an authentic voice 'talking' through prison laptops means 'word' gets out to more residents of how to make the best of their time there, to learn something about themselves and others and to feel a real sense of agency."
        },
        {
            "text": "The start of things to come..."
        },
        {
            "text": "A resident from HMP Wayland inspired by the Content Hub created a fantastic video called 'Welcome to the Hub'. He worked closely with the local Hub staff for a long time, recording voiceovers from HMP residents, and he wrote and produced his video for use on the Content Hub. We now use it as an introduction on all sites. Perhaps there's a job waiting for him at MOJ Digital and Technology when he gets out?"
        },
        {
            "text": "We hope the Content Hub will be exactly this kind of rehabilitation resource. A Hub FOR people in prison, made BY people in prison. When a variety of users with lived experience make their own content, most accessibility issues will be instantly covered."
        },
        {
            "text": "Alongside this, the Content Hub team is collaborating with the HMPPS education and psychology departments so that creating content for the Hub becomes part of the residents' every day 'educational pathway' (as discussed in the Hub cross-agency collaboration blog). Creating for the Hub inside prisons, residents can learn employable skills like audio and video production, creative writing, mentoring, original music, teamwork, idea creation and content strategy. They can build up a good CV, learn people skills along the way, not to mention the pride they will feel when they see it online. This can lead to purposeful and sustainable employment, community participation, identity, motivation and agency which are all listed as vital factors in reducing reoffending, according to the Prison Leavers' project."
        },
        {
            "text": "Breaking down barriers between HMPPS staff and its residents has such a good chance of success if the Content Hub is used consistently and well. Sometimes, it's best to just let them all speak for themselves. Thanks to Senior User Researcher Will Finn who spent so much time over the past few years talking about the Hub with staff and prison residents, we can conclude with some of his findings:"
        },
        {
            "text": "Staff feedback"
        },
        {
            "text": "\"The Hub has changed the way we communicate with the community for the better\" - Governor Garvie, HMP Wayland"
        },
        {
            "text": "\"(I don't) know how Berwyn would have coped without in-cell tech during COVID, it pays for itself\" - Prison group director for Wales (includes HMP Berwyn) "
        },
        {
            "text": "Resident feedback"
        },
        {
            "text": "\"Very grateful for this level of communication and plan you outlined for this challenging time. Thank you & Staff.”- Resident feedback during Covid lockdown 2020, HMP Berwyn"
        },
        {
            "text": "“I respect the fact they are getting these videos out to us. It shows the prison cares. If I have to be in prison, at least I am here where the staff are compassionate and are trying to help. Very glad to have the digital platform. Cheers”- Resident feedback, HMP Wayland"
        },
        {
            "text": "\"When I saw the spice stuff on there, I watched all of it. I haven’t touched spice since\"- Resident feedback after the 'Inside Spice' series of content we uploaded, made by HMP Berwyn"
        },
        {
            "text": "“Good video on informing you that you can change and it's never too late”- Resident feedback after watching lived experience video, 'David's Story' "
        },
        {
            "text": "\"I would like to say thank you very much for putting this video on here because I have changed the way I think about things\"- Resident feedback after watching 'Your Stories: There is hope for us'"
        },
        {
            "text": "\"There's a lot of time to think when you're in prison and I think these can take you away, people can destress with these\"- Resident feedback after watching nature documentaries"
        },
        {
            "text": "\"If you have the info on here, you don't need to ask for peoples opinions, cos a lot of the time its negative in here\"- Resident on the importance of correct information"
        },
        {
            "text": "\"I basically learned how to use a computer through this thing in my cell, just trial and error and that\"- Resident teaches himself digital skills"
        },
        {
            "text": "\"Outside I didn’t really train. I've only trained inside and I've got more into it, learning about it and that's through this as well\"- Resident talks about how he's started getting fit using the exercise videos"
        },
        {
            "text": "\"you can ask staff and it will take you a week to find out your account, so by the time it comes round you don’t know how much money you have left in your account\"- Resident frustrated by not having his personal information to hand (this is now on the Hub)"
        },
        {
            "text": "\"I've found the courses you can do too, I wasn’t looking for any of that but it's caught my eye\"- Resident discovers education online "
        },
        {
            "text": "\"So everything is on here that we would be asking officers but can't really access ourselves, until now\"- Resident grasps he can now self-serve and do things for himself using the laptop"
        },
        {
            "text": " "
        },
        {
            "text": "If your team or department wants to create content for the Hub, please get in touch. Email: hubcontentteam@digital.justice.gov.uk"
        },
        {
            "text": " "
        }
    ]
}