{
    "url": "https://ipo.blog.gov.uk/2022/01/28/insights-into-tech-careers-and-courses-with-code-first-girls/",
    "title": "Insights into tech careers and courses with Code First Girls",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Digital",
        "Gender Pay Gap",
        "Inclusion and diversity",
        "Recruitment",
        "STEM career"
    ],
    "pub_date": "2022-01-28T16:00:29+00:00",
    "content": [
        {
            "text": "The IPO is actively seeking to recruit more women into specialist STEM roles to reduce our gender pay gap and remove unintended barriers for all our women. "
        },
        {
            "text": "One of the ways we’re doing this is by working with Code First Girls to implement a series of 8-week courses running in February and March and places on their Nanodegree programme."
        },
        {
            "text": "Code First Girls describe themselves as ‘dedicated to transforming tech by providing the skills, space and inspiration for women to become cutting edge developers and future leaders’. Their mission is to transform tech by encouraging women to join the programme, which provides them with the skills and inspiration they might need on their journey. "
        },
        {
            "text": "Emma Thomas, Head of Service Design at the IPO, spoke at the ‘Insight into user-centred design’ MOOC. She explained how she enjoyed putting together the presentation for the course."
        },
        {
            "heading": 3,
            "text": "“It gave the team a chance to focus on why we’re so passionate about our profession.” "
        },
        {
            "heading": 3,
            "text": "“Go for the job you like the look of”"
        },
        {
            "text": "Although job descriptions for tech roles can often include lots of technical requirements, Emma explained that instead of focusing on each skill, it’s more important to just try something new. "
        },
        {
            "heading": 3,
            "text": "“GOV.UK has changed the way people interact with government services” "
        },
        {
            "text": "Emma has been part of the organisation’s One IPO Transformation programme – a five-year plan to upgrade services for our users. She described what excited her about  the future of service design at the IPO:  "
        },
        {
            "heading": 4,
            "text": "Viktoria Hatton, a Junior DevOps Engineer spoke at our ‘Insight into DevOps’ MOOC"
        },
        {
            "text": " She joined the IPO during her year in industry during her degree. Since then, she has stayed at the IPO part time. Flexible working has enabled her to finish  her degree simultaneously."
        },
        {
            "text": "Viktoria explained how the MOOC went: "
        },
        {
            "heading": 3,
            "text": "“I got into DevOps for the challenge, and it has definitely lived up to all my expectations.” "
        },
        {
            "text": "Since starting her career, Viktoria has found that adaptability is one of the most important skills to have: "
        },
        {
            "text": "DevOps is a career which can offer something different every day, and the range of tasks that can arise isn’t always thought about when considering a role in tech. "
        },
        {
            "heading": 3,
            "text": "Your future in tech"
        },
        {
            "text": "If you or anyone you know are interested in a career in tech, or would like to improve your coding skills, take a look at our upcoming classes with Code First Girls starting soon. "
        },
        {
            "text": "The eight-week courses consist of one class a week and topics include web development, python and apps and data and SQL. "
        },
        {
            "text": "Take a look at some the vacancies we have and find out what it’s like to work here on our Vercida page. "
        }
    ]
}