{
    "url": "https://naturalengland.blog.gov.uk/2022/01/28/natural-englands-climate-change-adaptation-plan/",
    "title": "Natural England's Climate Change Adaptation Plan",
    "authors": [
        "Mike Day",
        "Sarah Taylor"
    ],
    "categories": [
        "Climate change",
        "Natural England"
    ],
    "pub_date": "2022-01-28T12:09:20+00:00",
    "content": [
        {
            "text": "Today we have published our Climate Change Risk Assessment and Adaptation Plan. The plan has been produced, along with many other organisations, to report under the third round of the Adaptation Reporting Power of the Climate Change Act 2008. As the government’s advisor for the natural environment climate change impacts will be felt throughout our work and we are keenly aware of the need for sound adaptation planning. As an organisation we are working to increase the resilience of the natural environment to cope with climate change. Our adaptation plan highlights some of the crucial work we are undertaking to help people and nature adapt to a warmer world."
        },
        {
            "text": "The reality of a changing climate"
        },
        {
            "text": "We are living at a time of change and climate change is exacerbating existing pressures on the natural world and altering everything across Natural England’s remit: our landscapes, ecosystem processes, habitats and protected sites, species, geology, historic environment and the ways people engage with nature. These changes will only increase as warming continues and species move, sea levels rise and the composition of ecosystems continues to change."
        },
        {
            "text": "Climate change has the potential to have disastrous impacts on the natural world. And, of course, on us. Even if we manage to reduce our global emissions, change is already happening, and more is inevitable. Adapting to climate change is therefore essential. Our climate change adaptation plan sets out Natural England’s response."
        },
        {
            "text": "Our role in helping nature adapt to climate change "
        },
        {
            "text": "We have a leadership role to play as both a statutory nature conservation body and a leader in climate change adaptation and mitigation evidence. As outlined in Nature Positive 2030, the twin crises of biodiversity loss and climate change are interlinked. Reversing the destruction of nature is crucial to reducing emissions and reaching net zero as well as enabling us to live with the impacts of climate change."
        },
        {
            "text": "Adaptation planning also provides opportunities to ensure the value of good conservation is highlighted in response to the climate crisis. For example, nature recovery, including bigger, better, more joined up protected areas can increase the resilience of the natural environment to cope with climate change. Nature-based Solutions, can also deliver mitigation and adaptation with measurable benefits for both people and nature."
        },
        {
            "text": "What next?"
        },
        {
            "text": "Despite the challenges we face, it is important to recognise that there is significant scope to adapt the natural environment to climate change, alongside developing opportunities for both people and the natural world. We need to be bold and forward looking as we adapt to a changing world."
        },
        {
            "text": "As an organisation we recognise this will mean developing our approach in response to the climate and ecological crises. As such, we are building capability and taking a science-led approach to tackling climate change. Producing our adaptation plan is just the first step. We now need to ensure the plan is implemented and, if necessary, expanded as the realities of a warming world continue to materialise."
        }
    ]
}