{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/01/28/revisiting-safeguarding-practice/",
    "title": "Revisiting safeguarding practice",
    "authors": [
        "Lyn Romeo",
        "Fran Leddra",
        "Mark Harvey"
    ],
    "categories": [
        "Guidance",
        "Knowledge and skills",
        "Our profession",
        "Safeguarding"
    ],
    "pub_date": "2022-01-28T15:36:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Revisiting our practice is essential"
        },
        {
            "text": "Fran Leddra, Mark Harvey: As former interim Chief Social Workers for Adults, we are delighted to finally see the publication of our adult safeguarding guide,  which we pledged to produce as part of our annual report last year."
        },
        {
            "text": "Sadly, we were somewhat driven off course by the coronavirus pandemic which delayed some of our work as we’re sure, it delayed many other projects."
        },
        {
            "text": "Lyn Romeo is back in post, of course, and we are pleased to continue the work on our shared priorities and support Lyn and her office to bring them to fruition."
        },
        {
            "text": "We both have a background in adult safeguarding. When we were appointed to the CSW role, we were keen to produce a practical guide, not only offering links to other publications, but also revisiting the principles of the Care Act and supporting consistency of application across local authorities."
        },
        {
            "text": "We also wanted a social work specific focus, as it is social workers who lead in safeguarding practice. They bring a personalised, rights based and enabling approach, making sure abuse and safeguarding concerns are recognised and responded to."
        },
        {
            "text": "Now, more than ever, we need to revisit this practice. Most of us will have seen an increase in referrals exacerbated by the pandemic. We are talking about the hidden harms behind closed doors and the stifled voices of those people who need our care and support during these difficult times."
        },
        {
            "heading": 2,
            "text": "Learning from the truth of others"
        },
        {
            "text": "We heard many stories from people with lived experience about how it feels when safeguarding responses go wrong, and how practice has become more about gate-keeping and process than people."
        },
        {
            "text": "Most of all, we saw wide variations of practice across the country, both through the data and, anecdotally, through people’s stories. If we are to truly get adult safeguarding right, it is vital local authorities and social workers apply safeguarding practice, as set out in the Care Act and its associated statutory guidance."
        },
        {
            "text": "What warrants an enquiry under section 42? Who do safeguarding duties apply to? How is self-neglect responded to within safeguarding process? These and many more areas of practice must be applied consistently across the country and this guide will help achieve that."
        },
        {
            "text": "Principal social workers have a clear leadership role in making sure safeguarding is the very best it can be, that Directors of Adult Social Services (DASS) are advised appropriately on safeguarding processes, and that social workers and the local health and social care systems are legally literate in their application."
        },
        {
            "text": "We are pleased this guide is now published and available to support a locally delivered approach, setting out national expectations from the adult social work profession and the people and services who stand to benefit."
        }
    ]
}