{
    "url": "https://forestrycommission.blog.gov.uk/2022/01/28/tree-production-innovation-fund-second-spotlight-on-successful-applicants/",
    "title": "Tree Production Innovation Fund - Second spotlight on successful applicants",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Tree Planting"
    ],
    "pub_date": "2022-01-28T14:02:19+00:00",
    "content": [
        {
            "text": "In 2021 it was announced that the Tree Production Innovation Fund would be making over £1 million available to 16 innovative projects striving to increase and diversify our domestic tree production"
        },
        {
            "text": "In our Tree Production Innovation Fund success stories blog post we gave a brief introduction into those 16 successful projects, and took a closer look at three of them in Tree Production Innovation Fund - Spotlight on successful applicants blog post."
        },
        {
            "text": "Here we take a look at three more projects in more detail and the organisations behind them."
        },
        {
            "heading": 2,
            "text": "Maelor Forest Nurseries"
        },
        {
            "heading": 3,
            "text": "Using AI in developing image analysis software for improved productivity in advanced somatic embryogenesis systems."
        },
        {
            "text": "In forestry, seeds derived from superior genetic stock are used to produce stock hedges, which form the 'backbone' of traditional vegetative propagation by cuttings, but this process from single seed to hundreds of cuttings often takes several years for the genetic gains to be realised in the field. This problem is compounded as these seeds are often produced through manual cross-pollination and are therefore in very limited supply."
        },
        {
            "text": "Somatic embryogenesis though is an advanced vegetative propagation technology where clonal embryos are multiplied and germinated under laboratory conditions. This is a complex process with several inter-dependant stages, but it can provide a rapid and efficient means of producing thousands of plants from each seed."
        },
        {
            "text": "The main benefits of somatic embryogenesis are a better conversion rate and quicker turnaround time from seeds to plants than the traditional route. As a result, somatic embryogenesis can be used to rapidly diversify planting stock in response to changing market or environmental conditions, for instance, by bulking up new species or hybrids that are disease resistant or drought resilient."
        },
        {
            "text": "However, somatic embryogenesis is a labour-intensive process, which is currently a severe bottleneck to mass production. Yet the nature of the process also means that it is well-suited to scaling-up to an automated facility, which would increase production capacity and reduce costs. Image analysis software though is key to successful automation."
        },
        {
            "text": "The aim of our joint project with Forest Research is to develop software to extract information or so-called ‘metrics’ from digital images of plant material, then harness the power of machine learning to determine their quality. This involves generating a training data set with RGB images of callus, embryos, and plants, which allows the software to link traits such as colour, shape, and texture to plant quality. In the future, this software could provide a non-invasive and real-time means for a ‘go’ or ‘no go’ decision at each production stage, which in turn could underpin automation."
        },
        {
            "text": "For laboratory technicians, automation of the process not only reduces injury risks associated with repetitive tasks but also offers rewarding opportunities for upskilling jobs, which is critical for this digital generation. For the forestry sector, automation will promote diversity of planting stock and contribute to meeting the planting targets in England and elsewhere."
        },
        {
            "heading": 2,
            "text": "Future Trees Trust"
        },
        {
            "heading": 3,
            "text": "Establishment of clonal seed orchards for oak, bringing together trees of a superior phenotype to develop Qualified Forest Reproductive Material (FRM) seed sources."
        },
        {
            "text": "Sourcing sufficient acorns for the British forestry industry is always problematic. Oak masts periodically, typically every 5 – 7 years. Acorns are recalcitrant – they do not store well for more than a few months and so in many years supply exceeds demand. This means foresters must source their oak from elsewhere, sometimes from sources mal-adapted to the British climate, or delay planting a year."
        },
        {
            "text": "Future Trees Trust is creating seed orchards for oak to help meet this shortfall in supply. To do this, we have selected the best parents in terms of timber traits such as form and vigour (Figure 1). We then use tree climbers to get to the top of the crown (Figure 2) to take cuttings referred to as scions for grafting on to rootstocks (Figure 3). These are grown on in the nursery for one to two years (Figure 4) before being planting out in replicated blocked orchards (Figure 5). This allows all the best trees to be brought together so that they can cross pollinate and hopefully produce acorns that will grow in to superior quality timber trees."
        },
        {
            "text": "Establishing clonal seed orchards for oak is slow work, because grafting success is not always what we would wish it to be. This makes the work long term and expensive. In 2021, Future Trees Trust were really fortunate to receive a Tree Planting Innovation Fund (TPIF) grant of £20,030 to enable us to climb the next 24 trees (around the Forest of Dean, and Welsh Marches), to revisit clonal archive and collect enough scionwood to make over a thousand new grafts."
        },
        {
            "text": "These will be grown on for a year in glasshouses, and then deployed to the half-filled clonal seed orchards we are establishing in four locations:"
        },
        {
            "heading": 2,
            "text": "Chestnut Natural Capital"
        },
        {
            "heading": 3,
            "text": "Development of bio-based weed prevention textiles for improved tree/shrub planting success, soil quality and carbon sequestration."
        },
        {
            "text": "Freshly planted, young saplings compete with other plants ('weeds') for nutrients, water and light. Currently, the most effective weed control methods involve a combination of deploying mulches/weed mats and spraying with herbicides. Although effective, these methods bring their own problems; most common mulches are made from fossil-fuel-based (FF) plastics, when used at commercial scale; herbicides deployed are indiscriminate in their targeting of 'weeds', causing more widespread damage to habitats and ecology. Some pesticides remain in the soil for many years, as toxic elements/compounds, affecting and accumulating in the flora and fauna."
        },
        {
            "text": "At CNC, we are working towards solutions to address several issues: sustainable raw materials for production; product biodegradability; added value to the environment. Our solution for addressing the current weed control methodology is to create new (novel) weed mat material, which is easy to produce using existing techniques, has good mechanical properties (as FF plastic) and is as effective as FF plastics in weed control. We will use our proprietary blend of biodegradable ingredients, to form sheeting which can be tailored to the end use."
        },
        {
            "text": "Our material will remove the need to apply herbicides during the first 2-3 years of growth, after which it will biodegrade, in the environment, to harmless by-products. All our ingredients are non-toxic and nature-based so as not to create any harmful compounds during degradation. During degradation, our material will confer additional benefits to the soil e.g., improve soil structure/integrity, improved water-holding and nutrient-holding capacity, and a degree of C-sequestration."
        },
        {
            "text": "This project will bring our new materials closer to market, by enabling us to produce and test our materials, to ensure they have the required functionality. Our aim is to replace long-lived, indiscriminate weed-control methods, to remove detrimental knock-on effects to ecology and ecosystems, while improving the viability and growth of young saplings."
        }
    ]
}