{
    "url": "https://lifeathmrc.blog.gov.uk/2022/01/28/were-winners-tackling-economic-crime/",
    "title": "We’re winners: tackling economic crime",
    "authors": [
        "Mems Bangura"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-01-28T09:00:12+00:00",
    "content": [
        {
            "text": "We are responsible for collecting money that pays for the UK’s public services and giving financial support to people who need it and that includes tackling economic crime. We recently spoke to Alex whose team won the Outstanding Team award at the Tackling Economic Crime Awards (TECAs). TECAs are open to people who are outstanding at tackling different aspects of economic crime working in the UK across the public, private and third sector."
        },
        {
            "text": "Working with the Financial Development Team from the Risk Intelligence Service (RIS), Alex’s team stopped a systematic cyber-attack on the Coronavirus Job Retention Scheme (CJRS). Through their innovation and hard work, they secured more than £26.5 million in criminal funds and blocked £80 million in further fraudulent claims."
        },
        {
            "text": "What’s a typical day like for you? "
        },
        {
            "text": "I currently lead a team of frontline criminal investigators and it may sound cliché, but due to the type of work we do, each day is different. Our job is to gather evidence and bring forward cases to prosecute those who commit criminal offences against HMRC. This can be through a variety of methods, such as, surveillance deployments, obtaining witness statements, arresting and interviewing suspects, and searching premises."
        },
        {
            "text": "Our goal is to dismantle and disrupt organised crime groups using a range of covert and overt tactics. We combine this with confiscating criminal assets which can include seizing cash and freezing fraudulent funds in bank accounts."
        },
        {
            "text": "We’re at the forefront of tackling economic crime. Our most recent case secured HMRC’s largest ever account freezing order where we successfully froze and subsequently forfeited £26.5million. This was a huge result for us and we’re incredibly proud."
        },
        {
            "text": "What challenges do you face?"
        },
        {
            "text": "These can often be dynamic and involve managing safety risks to both the officers and the investigation especially at the covert stage of an operation. The number of offences we deal with brings challenges but being part of a great team alleviates this and makes the job interesting."
        },
        {
            "text": "What does winning the award mean to you?"
        },
        {
            "text": "It’s an honour to receive this prestigious award, especially when up against such great competition in this category. We would like to thank the judges and sponsors of the Tackling Economic Crime Awards for recognising us this year. We work alongside some fantastic teams in law enforcement and intelligence and this award recognises not just the efforts of these individual teams but highlights the success we can achieve with collaboration by using our expertise across different areas to tackle criminals and protect public funds."
        }
    ]
}