{
    "url": "https://defrafarming.blog.gov.uk/2023/12/05/annual-health-and-welfare-review-of-livestock-now-available-to-more-farmers-in-england/",
    "title": "Annual health and welfare review of livestock now available to more farmers in England",
    "authors": [
        "Stewart Houston CBE"
    ],
    "categories": [
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2023-12-05T12:12:47+00:00",
    "content": [
        {
            "text": "The last time I wrote a blog post was in February, when I shared that the first step on the Animal Health and Welfare Pathway, the  annual health and welfare review of livestock, was being rolled out.   "
        },
        {
            "text": "While that initial rollout was an exciting and important moment for the Animal Health and Welfare Pathway, it was only the beginning of the story.  "
        },
        {
            "text": "In my post, I said that we’d learn lessons from the initial roll out and reflect what we learned in improvements to the service as we go.  "
        },
        {
            "text": "We’ve already seen some really important changes take effect since February: from streamlining the application process to changing disease testing protocols."
        },
        {
            "text": "Today, I want to share another important change: the annual health and welfare review is now open to non-BPS registered farmers. This means more farmers in England can now apply."
        },
        {
            "heading": 2,
            "text": "Apply today "
        },
        {
            "text": "If you previously met all the other eligibility criteria but were unable to apply because you weren’t eligible for BPS, you can now apply! "
        },
        {
            "text": "All the details of the eligibility criteria are in the updated guidance on GOV.UK."
        },
        {
            "text": "When you’re ready, you can make an application through the online portal.  "
        },
        {
            "text": "All you'll need is your Rural Payments Agency Customer Reference Number (CRN) and password.  "
        },
        {
            "text": "Getting your application in won’t take long either, I’ve been told that one farmer got through it in the time it takes to boil the kettle! "
        },
        {
            "heading": 2,
            "text": "Future support through the Pathway "
        },
        {
            "text": "Of course, the Pathway doesn’t stop here. Work is underway to co-design new Infrastructure Grants beyond the hugely popular calf housing grant, as well as developing the next round of the very successful Animal Health and Welfare Equipment and Technology grant.  "
        },
        {
            "text": "Alongside that we also have the Pathway’s disease eradication and control programmes, which are well along the development journey. These programmes will offer financial support to address endemic diseases that consistently impact farmers’ bottom lines. "
        },
        {
            "text": "A great way to prepare to take advantage of this support is to have a Review, which includes diagnostic testing for Bovine Viral Diarrhoea (BVD) in cattle, porcine reproductive and respiratory syndrome (PRRS) in pigs and the effectiveness of worming treatments in sheep.  "
        },
        {
            "text": "Get the tests so you know where you stand, at the same time as getting advice from your choice of vet on what the right next steps are for you. "
        },
        {
            "text": "If this all feels like a strong package, that’s because it is! So, for those who haven’t taken their first step on the Pathway yet, I strongly recommend you do. "
        },
        {
            "text": "If, after reading the guidance, you have questions about the Review, leave a comment below. The guidance for vets can be found on GOV.UK. "
        }
    ]
}