{
    "url": "https://gott.blog.gov.uk/2023/12/05/building-a-successful-team-for-tech-transfer-in-the-public-sector/",
    "title": "Building a successful team for Tech Transfer in the public sector",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "Intellectual Property"
    ],
    "pub_date": "2023-12-05T07:45:26+00:00",
    "content": [
        {
            "text": "Author: Maggie McGowan, Deputy Director, GOTT"
        },
        {
            "text": "Last week I chaired a panel discussion on how to resource Knowledge Asset (KA) management, what capability looks like and how we can develop it in the public sector. KA management and technology transfer are relatively new activities in the public sector. Whilst there are pockets of expertise and experience in government departments and arm’s length bodies, there needs to be an increase in the skills and capability of the existing workforce if we are to catch up to universities."
        },
        {
            "text": "I was joined by Dr Anji Miller from LifeArc, Dr Heather Lewtas from UK Atomic Energy Authority and Dr Rob Singh from the University of Essex, who explored some of the challenges and also offered practical advice."
        },
        {
            "text": "Below are the three takeaways:"
        },
        {
            "heading": 3,
            "text": "It’s a people issue"
        },
        {
            "text": "A consistent talking point for the panel was that this is fundamentally a “people issue”. We need people with the knowledge to identify when they might have created a valuable knowledge asset and the skills to identify a market for the asset and how to reach it. Critically, we need to develop a collaborative culture where this knowledge is shared and capability enhanced across the public sector."
        },
        {
            "text": "Developing policies and KA management strategies is essential for creating a framework that supports innovation, but this will have little benefit if teams don’t engage with the process. If our innovators don’t buy into the agenda, then organisations will fail to maximise the value of their assets."
        },
        {
            "text": "The panel discussed the importance of staff understanding the potential impact of their innovation. Improving lives, public services, and delivering value to the taxpayer, are core responsibilities for  public sector workers, and the public sector has the potential to deliver economic and societal value from their knowledge assets. For example, by creating and sharing a tool to improve the efficiency of public services, or by developing new medical technology that can help save lives."
        },
        {
            "heading": 3,
            "text": "Incentives matter"
        },
        {
            "text": "Value and recognition were noted by the panel as key to incentivising staff to put time and energy into innovation and exploitation. Dr Singh shared that this has been  tackled in the university sector  by including these activities in institutional review processes, such as REF (the Research Excellence Framework) and KEF (the Knowledge Exchange Framework) and linked it to staff promotional criteria."
        },
        {
            "text": "The lack of career awareness and direction stimulated a lively discussion, with suggestions that it might be beneficial to establish a career path for tech transfer professionals within government. This would ensure appropriate recognition for the work and give confidence to civil servants that they are moving into a recognised career path."
        },
        {
            "heading": 3,
            "text": "Top- down support is essential"
        },
        {
            "text": "The panel hit the nail on the head when they said there needs to be support from leadership teams to truly drive cultural change within an organisation. This support can come through building KA management into the organisation priorities, recognising and rewarding efforts, giving people the time and space to do the work as part of their jobs rather than additional to it."
        },
        {
            "text": "A common challenge discussed by the panel was the lack of time dedicated to managing and exploiting KAs. Senior leaders need to support the time needed for innovators to focus on exploitation of their knowledge assets for any real progress to be made."
        },
        {
            "text": "Please do share with us how you are building your teams to deliver successful tech transfer. We're always keen to learn from others, please get in touch and let us know."
        },
        {
            "text": " "
        }
    ]
}