{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/12/05/drawing-from-childrens-experiences-as-members-of-the-fjypb/",
    "title": "Drawing from children’s experiences as members of the FJYPB",
    "authors": [
        "FJYPB members"
    ],
    "categories": [
        "Leadership",
        "Social work: the profession",
        "Wellbeing"
    ],
    "pub_date": "2023-12-05T09:00:34+00:00",
    "content": [
        {
            "text": "The Family Justice Young People’s Board (FJYPB) are a group of up to 75 children and young people across England and Wales, aged 7 to 25 years old.  All members have either had direct experience of the family justice system or have an interest in children’s rights and the family courts. The aim of FJYPB is to support the work of the Family Justice Board (FJB), from ensuring their work is child-centred and child-inclusive, to through delivering improvements to the family justice system and ensuring the FJB provides the best experience and outcomes for children."
        },
        {
            "text": "In this blog we hear from two members of the FJYPB who tell us about their personal childhood experiences, and how they use this later in their life to advocate for children's voices."
        },
        {
            "text": "The importance of keeping children and young people updated – written by an anonymous FJYPB member "
        },
        {
            "text": "When I was going through proceedings regarding my parents' divorce, only my parents told me what was going on, which had a big impact in how I digested the situation. My mum had to use a penny chart on an A3 piece of paper to describe the custody arrangement to us, which I now understand must have been very difficult for her given that she had tried to limit the shared custody. My dad would tell me every tiny detail or ‘update’ in the proceedings in a way that was not suitable for a 7 year old."
        },
        {
            "text": "I wish there had been someone ‘neutral’ to tell us what was happening. Yes, I was 7, but I remember and reflect a lot about how much easier it would have made the situation for me. I was asked my wishes and feelings, but no one told me what was happening or how my views were going to be considered. All I knew was the outcome, which my mum told me about."
        },
        {
            "text": "As a member of the FJYPB I advocate for children to be kept updated throughout their personal proceedings because I know what it feels like to not be, to be ‘ignored’ by the services which are supposed to offer you support and guidance. It makes me happy now when I hear of individuals or services who are working hard to make sure children now are kept updated in an appropriate manner as I know they will appreciate that, as little me would have."
        },
        {
            "text": "Importance of trust and building relationships – written by Oli, FJYPB Member"
        },
        {
            "text": "No matter how old a child or young person is when going through family court proceedings, they will always benefit from being able trust to professionals. When I went through family court, I always felt a certain distance from everything going on. This could have been for a multitude of reasons; I wasn't reading any reports and I wasn't sitting in the court room. But what always made it feel warmer, and more inclusive was trust."
        },
        {
            "text": "Having a trusted relationship throughout a proceeding can have a hugely positive impact on a child or young person's mental health and help guide them through an otherwise daunting time. As well as having a positive impact on mental health, children and young people may well feel more inclined to contribute to their proceedings with the right support and guidance, as they recognise that what they say is heard. They would also feel a lot more secure having someone with experience of family court on their side. Someone who they can confide in and offload any negative emotions that may have been pulling them down and affecting them in any way at all. Ultimately as long as there is trust, trust to talk and express your wishes, there will be fair justice for all of those involved."
        },
        {
            "text": "You can keep up to date with the work of the FJYPB, download a free debut book ‘In Our Shoes’ and free top tips for professionals"
        },
        {
            "text": "The Family Justice Unit within DfE work on supporting and improving the family justice system. The FJYPB also sit on the Family Justice Board, which is co-chaired by DfE and MoJ ministers. The Family Justice Board is the primary forum for setting direction for the family justice system and overseeing performance."
        }
    ]
}