{
    "url": "https://companieshouse.blog.gov.uk/2023/12/05/filing-your-register-of-overseas-entities-update-statement/",
    "title": "Filing your Register of Overseas Entities update statement",
    "authors": [
        "Nick Lindsay, CEO of Elemental",
        "Tobias Latham, Solicitor at Elemental"
    ],
    "categories": [
        "Register of Overseas Entities"
    ],
    "pub_date": "2023-12-05T16:12:57+00:00",
    "content": [
        {
            "text": "The one-year anniversary of the UK Register of Overseas Entities has come and gone, which brings with it the start of the updating duty process."
        },
        {
            "text": "Every entity must file an update statement, even if there are no changes, and so every entity should familiarise themselves with the rules and allocate appropriate time frames. Some are already finding they do not have as much time as they first thought."
        },
        {
            "text": "Here we share some practical tips to consider alongside the latest guidance."
        },
        {
            "heading": 2,
            "text": "Every entity must contact their Registered Beneficial Owners"
        },
        {
            "text": "Every entity should get in touch with their Registered Beneficial Owners (RBO) or Managing Officers (MO) to verify the information filed is still accurate. This is officially called a section 12 notice for an RBO."
        },
        {
            "text": "Respondents have up to a month to reply. Overseas entities should allow for this as part of their time frames. Failure to comply with this obligation is a criminal offence, even if the overseas entity believes they already know the information on the RBO."
        },
        {
            "heading": 2,
            "text": "Every entity must file by the deadline"
        },
        {
            "text": "Your statement date is within a year of the date the overseas entity was registered, or within a year of your last update statement. Overseas entities have 14 days to file the update statement."
        },
        {
            "text": "What this means in practice is that even for the simplest entity ownership structures where there are no changes, the entity will need to have carried out the necessary due diligence to declare that:"
        },
        {
            "text": "Entities that wait until their renewal date may find that 14 days does not allow enough time to put a robust process in place to carry out the necessary checks to file the statement. For example, a change of address for a managing officer can be easily missed. Allowing enough time to complete a section 12 notice will help, but also never underestimate the power of a good checklist."
        },
        {
            "text": "Entities that are aware of changes or that have trusts will want to build in even more time."
        },
        {
            "heading": 2,
            "text": "All changes must be verified by a UK regulated agent"
        },
        {
            "text": "Where there are changes to information, these changes must be verified by a UK regulated agent. These include changes to details such as:"
        },
        {
            "text": "UK regulated agents will be very busy during the winter period. Last year around half of all Register of Overseas Entities filings were filed in January and February. It's likely that many will experience a peak in demand."
        },
        {
            "text": "If you have changes, allow enough time to engage your UK regulated agent and follow any internal processes you may have to appoint them."
        },
        {
            "heading": 2,
            "text": "All trusts need to file, even if there are no changes"
        },
        {
            "text": "Overseas entities with trust information must also file their update statement online. This includes trusts that the entity has already informed Companies House about, and trusts that need to be highlighted as part of the update statement."
        },
        {
            "text": "You must file an updated statement even where there are no changes to trust information."
        },
        {
            "heading": 2,
            "text": "What to do next"
        },
        {
            "text": "The secret to a smooth update process is preparation. Overseas entities should not mistake their renewal date as the point when they should act. For many, this point may be too late. Instead, they should familiarise themselves with the requirements to identify the steps they will go through."
        },
        {
            "text": "Overseas entities should ask themselves the following questions:"
        },
        {
            "text": "If the answer to any of the above questions is ‘yes’, they will want to start sooner."
        },
        {
            "text": "We’re already working with clients who are not due for renewal until next year. Some are keen to just lay the groundwork, others are keen to file earlier to align with other reporting deadlines. A UK regulated agent can assist and advise with all elements of the update process - from the initial information notice to filing the update statement, whether there are changes or not."
        },
        {
            "text": "Finally, this is an evolving area of law. Overseas entities should stay up to date with the latest guidance from Companies House to make sure they continue to meet the latest requirements."
        },
        {
            "text": "Future reforms to the process have been legislated for in the Economic Crime and Corporate Transparency Act 2023 but are not yet in force. When these provisions come into force overseas entities will need to make sure that they take appropriate action."
        }
    ]
}