{
    "url": "https://apprenticeships.blog.gov.uk/2023/12/05/skills-for-a-greener-future-introducing-our-new-green-toolkit/",
    "title": "Skills for a greener future: Introducing our new Green Toolkit!",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "COP28"
    ],
    "pub_date": "2023-12-05T16:04:27+00:00",
    "content": [
        {
            "text": "The World Climate Action Summit has been reflecting on the world’s progress towards climate aims, and planning where to go next. The UK aims to lead international efforts on climate change. As part of this, the government has committed to net-zero carbon emissions by 2050. It’s also set ambitious goals to reverse the biodiversity decline."
        },
        {
            "text": "To meet these goals, all jobs will need to become ‘greener’. Learners will need more ‘green skills’ for new or changing jobs. Apprenticeship and other technical qualifications will therefore need to change, and IfATE is ready to help!"
        },
        {
            "text": "IfATE expects standards and qualifications to factor in green. We are aiming for qualifications and standards that:"
        },
        {
            "text": "IfATE has published the green toolkit to help."
        },
        {
            "text": "What’s in the toolkit?"
        },
        {
            "text": "The toolkit sets out 6 ‘Green Themes’:"
        },
        {
            "text": "Considering these six themes will help to describe how jobs, and the skills to do them, will change."
        },
        {
            "text": "The toolkit also includes routes-specific guidance, green behaviours, and our way of defining ‘green jobs’."
        },
        {
            "heading": 2,
            "text": "How and why should it be used?"
        },
        {
            "text": "The toolkit contains step by step guidance on how to use it. This guidance is tailored to different users, including employers creating or revising standards, awarding bodies, and route panels."
        },
        {
            "text": "The previous version of the toolkit, the \"Sustainability Framework\", was used to green many occupations. For example, adding KSBs on reducing waste and following environment laws to construction standards. The new toolkit goes even further."
        },
        {
            "text": "Embracing green isn’t just loaded with benefits, it’s also rapidly becoming the only option. As our climate changes, employers need people with the skills to comply with the law, and make the most of new opportunities."
        },
        {
            "text": " "
        }
    ]
}