{
    "url": "https://forestrycommission.blog.gov.uk/2023/12/05/supporting-seed-supply-across-the-nations-forests-and-beyond/",
    "title": "Supporting seed supply across the nation’s forests and beyond.",
    "authors": [
        "David Bole"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-12-05T14:01:20+00:00",
    "content": [
        {
            "text": "Despite being the fundamental first stage, seeds can be an overlooked step of the tree production process. Often, it is assumed that seed will be readily available for any species or provenance that may be needed to plant thriving and resilient trees and woodlands. However, the situation is much more complex."
        },
        {
            "text": "On occasion, British seed supply for some species does not meet requirements. Sometimes this leads to imports of seed from other countries to meet nurseries needs. However, imported seed is not always sufficient to meet demand, may not be genetically appropriate, and comes with the risk of importing harmful pests and pathogens. As tree planting continues to accelerate, demand for seed and therefore reliance on imports will also increase."
        },
        {
            "text": "We are aiming to expand domestic seed production to offset this. Through Defra’s Nature for Climate Fund (NCF) we are investing in both the private and public sectors to ensure we have a resilient, diverse, and bio-secure supply of tree seed for our ambitious tree planting targets of 16.5% tree and woodland cover by 2050. So, how are we doing this?"
        },
        {
            "heading": 2,
            "text": "The nation’s forests"
        },
        {
            "text": "The nation’s forests are made up of over 1,500 woods and forests managed by Forestry England."
        },
        {
            "text": "To increase the quantity, quality, and diversity of seed sources from the nation’s forests we have funded a Seed Resources Manager in Forestry England’s Plant & Seed Supply team. The team have been working to establish new Seed Orchards and seedling Seed Stands, and are identifying, registering, and managing existing stands across the nation’s forests for seed production."
        },
        {
            "text": "In addition, they are planning to re-inspect existing registered Seed Stands and establish long-term management plans to enhance their productivity and resilience. These activities will help ensure we optimise the opportunities to source tree seed from the nation’s forests."
        },
        {
            "text": "As well as for Forestry England’s own use, these seed sources are available and accessible for private sector seed collectors. Forestry England has recently published a helpful ‘Seed collection protocol’ which provides a step-by-step guide for those wishing to ask permission to collect seed and plant material from the nation’s forests."
        },
        {
            "text": "We have also invested in Forestry England developing a state-of-the-art new Seed processing unit at Delamere. As well as processing seed for use in the nation’s forests, this facility will continue to make surplus seed from a limited number of species available to the private sector."
        },
        {
            "text": "Read more about Forestry England’s plans to enhance the quality, quantity, and diversity of tree seed from the nation’s forests, including the Seed collection protocol, in their recently published plan."
        },
        {
            "heading": 2,
            "text": "Our Grants"
        },
        {
            "text": "In addition to supporting Forestry England, we have developed bespoke NCF grants to provide support for projects that increase tree seed and sapling production. Private nurseries, seed suppliers, estate managers, and landowners have a major role to play in ensuring we have a diverse and secure supply of tree seed. Whether they plant or manage Seed Stands or Orchards for themselves or for others to collect seed to process, grow and sell, they play an important role in tree production."
        },
        {
            "text": "The Seed Sourcing Grant (SSG) was developed to provide funding for activities that enhance the quality, quantity and diversity of England’s tree seed sources. Projects that have previously been awarded funding include small-scale projects, such as woodland manager Clive Ellis’ project to develop a small-leaved lime Seed Stand, as well as larger ones like The Woodland Trust’s project to conduct desk and field studies to identify and register Seed Stands across their estate for several species."
        },
        {
            "text": "The SSG has just re-opened for a third round of funding applications, with £260,000 available for projects during 2024/25."
        },
        {
            "text": "As well as the SSG, we also have two other NCF grants to support tree and seed supply: The Tree Production Innovation Fund (TPIF), which supports innovation in how we produce tree planting stock and the Tree Production Capital grant (TPCG), which provides support to increase the domestic production of tree seed and saplings through investing in facilities and equipment."
        },
        {
            "text": "Read about some of the successful TPCG recipients on our blog; How we're supporting tree and seed suppliers to boost domestic tree production. The TPCG has also re-opened for a third round, with £2.5 million available for the 2024/25 financial year."
        },
        {
            "heading": 2,
            "text": "More information"
        },
        {
            "text": "We’re starting to see great progress through the grants that are now in place and the work that is being undertaken to enhance seed sourcing on the nations forest’s but there is still more to be done. Therefore, if you have a project in mind that could help boost seed supply, we’d really encourage you to have a look at our grant offers and consider applying."
        }
    ]
}