{
    "url": "https://defradigital.blog.gov.uk/2023/12/05/world-soil-day-how-were-improving-access-to-soils-data-and-information-for-england-and-wales/",
    "title": "World Soil Day: How we’re improving access to soils data and information for England and Wales",
    "authors": [
        "Naomi Lees"
    ],
    "categories": [
        "Geospatial information",
        "Open data"
    ],
    "pub_date": "2023-12-05T07:30:26+00:00",
    "content": [
        {
            "text": "On World Soil Day, Naomi Lees explains the importance of Defra’s new four-year agreement with Cranfield University for the maintenance and licensing of the Land Information System (LandIS)."
        },
        {
            "text": "LandIS is recognised by the UK Government as the definitive source of national soils information for England and Wales, and access to this resource provides the Defra group with invaluable data. The data it provides is being used on a number or projects and policy areas across Defra, helping to inform our soil, future farming and environmental policies to meet government ambitions."
        },
        {
            "text": "As a Data Resources & Licensing Manager, my role in Defra involves negotiating contracts and licences for access to key data resources from third party organisations. This includes negotiating and managing our contract with Cranfield University for the maintenance and supply of LandIS soil data. As Defra and Cranfield University jointly own the Intellectual Property Rights in LandIS, the agreement we have been working on reflects how we will continue work in partnership to maintain this important resource."
        },
        {
            "text": "Cranfield has a world-leading role in driving agricultural innovation and development. In 2017, Cranfield was awarded the Queen’s Anniversary Prize for its research and education in large-scale soil and environmental data for the sustainable use of natural resources in the UK and worldwide. As soil health is central to delivering our objectives on biodiversity and profitable agriculture, LandIS continues to be a key resource for the Department."
        },
        {
            "heading": 2,
            "text": "What data does LandIS contain?"
        },
        {
            "text": "LandIS contains the following soil mapping, soil property, and agro-climatological data:"
        },
        {
            "heading": 2,
            "text": "Uses within Government"
        },
        {
            "text": "LandIS is a valuable resource for government agencies and departments involved in a wide range of activities, including:"
        },
        {
            "heading": 2,
            "text": "Uses within Defra and beyond"
        },
        {
            "text": "I’ve listed below some specific examples of how government agencies and departments are using LandIS data. There are many others, but I hope these provide a strong flavour of the benefits we get from this data:"
        },
        {
            "heading": 2,
            "text": "Case study: Natural England and LandIS"
        },
        {
            "text": "Natural England is using LandIS data to help develop an improved peat map for England, available free to use, which will help better understand greenhouse gas emissions, support nature recovery, target peatland restoration and help with natural capital accounting."
        },
        {
            "text": "The current best product showing the extent of peaty soils in England is derived in part from Landis data, but it only tells us where peaty soils are located.  Extensive surveys are now being carried out which will improve our knowledge of where peaty soils are, determine their depth, tell us about erosion and drainage and what is growing on our peatlands."
        },
        {
            "text": "Not all peaty soils occur at the surface making them particularly hard to find. For instance, clayey soils in the Cambridgeshire Fens sometimes have thick layers of peat underneath.  Natural England uses LandIS soil association data to tell its surveyors where to look for these hidden peatlands."
        },
        {
            "text": "The surveyors record any peat they find in the first metre of soil.  Not enough is known about how buried peats are responding to the changing climate and changes in water table. This new data will help us identify where they are and how best to look after them."
        },
        {
            "heading": 2,
            "text": "Useful tools and resources"
        },
        {
            "text": "LandIS provides a number of specific tools and resources for government users, including:"
        },
        {
            "text": " "
        }
    ]
}