{
    "url": "https://educationinspection.blog.gov.uk/2022/11/11/education-for-prisoners-with-learning-difficulties-and-or-disabilities/",
    "title": "Education for prisoners with learning difficulties and/or disabilities",
    "authors": [
        "Maria Navarro HMI",
        "Rebecca Clare SHMI"
    ],
    "categories": [
        "Education in prisons",
        "further education and skills",
        "Prisons"
    ],
    "pub_date": "2022-11-11T10:00:45+00:00",
    "content": [
        {
            "text": "This blog sets out some of the findings from our focus on the quality of education in prisons."
        },
        {
            "text": "In March 2022, we published our Review of reading education in prisons. Since then, we have continued with a year of enhanced focus on the quality of education in prisons."
        },
        {
            "text": "Over 30% of prisoners have learning difficulties and/or disabilities. We are particularly concerned about these prisoners. They can face challenges while in prison and after release, especially if they cannot read or write."
        },
        {
            "text": "Background"
        },
        {
            "text": "This work follows the Education Select Committee’s report ‘Not just another brick in the wall’. The report highlighted the significant challenges that prisoners with LDD can face."
        },
        {
            "text": "We are also building on the Criminal Justice Joint Inspection’s report on neurodiversity. It estimated that around half of prisoners have a neurodivergent condition that affects their ability to engage. The report concluded that provision for prisoners with neurodiversity is:"
        },
        {
            "text": "Pandemic delays"
        },
        {
            "text": "We found that most prison education managers had developed appropriate plans to support prisoners with LDD. Most also informed relevant staff about prisoners’ additional needs. For instance, one manager told us about plans to appoint LDD champions who will train staff throughout the prison. This aims to embed a whole-prison approach to supporting complex needs."
        },
        {
            "text": "However, in many cases, the implementation of these plans had been postponed due to the pandemic. We are concerned that some are still delayed long after lockdowns ended. Delays particularly persisted in communicating with staff in skills and work areas. They need to know how they can support prisoners with LDD."
        },
        {
            "text": "Getting screening right"
        },
        {
            "text": "We were pleased to see that most pandemic-related backlogs in screening new prisoners for LDD have been resolved. Most prisons have begun to use the same standardised screening of prisoners. We hope that this will improve information-sharing between prisons."
        },
        {
            "text": "However, the following problems are limiting the impact of screening for prisoners with LDD:"
        },
        {
            "text": " Giving the right support"
        },
        {
            "text": "We found many good examples of support for prisoners with LDD. These included useful resources such as pen grips, line trackers and coloured overlays. One prisoner who had dyslexia told us she was given an hour of support each day. This prisoner had a history of vision and musculoskeletal problems. She had supervised rest breaks in tests, an ergonomic pen, and lighting adjustments in education and skills sessions. She was also provided with special seating in skills and work sessions."
        },
        {
            "text": "However, we saw too many support plans that were formulaic and repetitive. They often identified the same support for lots of prisoners, without enough attention to individual needs."
        },
        {
            "text": "In some cases, prisoners’ needs for learning support were very extensive. This meant that education staff found it difficult to provide appropriate resources. For example, one prisoner was making little progress in English because of memory damage caused by substance misuse. Education staff struggled to identify appropriate strategies to help them improve."
        },
        {
            "text": "Education staff should work closely with healthcare staff, including psychologists, in the interests of prisoners. However, this does not always happen."
        },
        {
            "text": "Some prisons did not give prisoners in-class support at all. Instead, prisoners were taken out of classes for extra support. In some instances, this was because of a desire not to identify prisoners with LDD to their peers. However, it meant that they missed out on important parts of the curriculum."
        },
        {
            "text": "Many prisons did implement support plans well and gave prisoners the support they needed. Where this happened, prisoners were able to engage with education, skills and work. We want to see this working for all prisoners with LDD."
        },
        {
            "text": "The importance of curriculum and effective teaching"
        },
        {
            "text": "We found some interesting and helpful instances of curriculum planning to support prisoners with LDD. In particular some focused on their mental health and wellbeing needs. These included:"
        },
        {
            "text": "However, we also saw curriculums that were unambitious and lacking a clear focus. Some were also not well understood by staff."
        },
        {
            "text": "We saw a lot of evidence of helpful teaching. Many teachers were also skilled in managing behaviour to support learning. For example, at a young offenders’ institution, an inspector found that:"
        },
        {
            "text": "However, we also found that staff did not always track the progress that prisoners with LDD made. This reduced their ability to adjust the curriculum or the support available."
        },
        {
            "text": "Training and staffing"
        },
        {
            "text": "In most prisons, education staff had received appropriate training. However, prison officers and key workers often did not receive this. As a result, they were not always able to give prisoners with LDD support on prison wings."
        },
        {
            "text": "Staff shortages meant that too many crucial appointments in education, skills and work remained vacant. Staff shortages also delayed post-pandemic education recovery. In one case, there were not enough staff to take prisoners from the medication station to lessons. This meant that prisoners who needed medication were not able to access education."
        },
        {
            "text": "Next steps"
        },
        {
            "text": " We will continue to focus on prison education throughout the coming year, including education for prisoners with LDD."
        },
        {
            "text": "Our suggested next steps are:"
        },
        {
            "text": "We urge everyone working in prisons to address these recommendations. They should make sure that prisoners with LDD access an ambitious, effective, and well-taught curriculum. All prisoners with LDD should be able to make good progress, fulfil their potential, and improve their life chances on release."
        }
    ]
}