{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/11/field-officers-proud-to-help-our-farmers/",
    "title": "Field Officers: Proud to help our farmers",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2022-11-11T12:43:05+00:00",
    "content": [
        {
            "text": "With the introduction of a more supportive, partnership-based approach to site visits, moving away from the penalty-based system of inspections under the EU, to farmer-focused visits for schemes such as the Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS), Field Officer Jackie Renwick talks about her role and the difference it’s making to farmers. "
        },
        {
            "text": "I’m Jackie Renwick and I’m a Field Officer with RPA. I started working as a Field Officer (at that time we were Inspectors) in November 2015, having previously worked on the front line for Border Force for 15 years. I have a HND in Agriculture and I was determined to get back into the agricultural industry in some way, so when I saw the role of Field Officer advertised, I knew I just had to go for it. In May this year I was actually promoted and I’m currently a Subject Matter Expert for Rural Development. However, I’m still fulfilling the role of Field Officer by conducting regular site visits to help farmers be compliant with the terms and conditions of the schemes they’re entered into, and I get to see how recent changes to schemes are impacting on them."
        },
        {
            "text": "A typical day as a Field Officer depends on the time of the year. In winter it starts with checking I have my paperwork, PPE, disinfectant, water, wellies and warm socks before heading out to complete a cattle visit. The Field Officer role is very flexible, and I’ve always tried to use that flexibility to assist farmers, which in the case of cattle visits might mean getting up very early and attending morning milking so that you can read the herd’s ear tags as they come out of the milking parlour."
        },
        {
            "text": "Or it might mean that you don’t start until mid-morning when the first jobs of the day have been completed. Spring, summer and autumn are taken up primarily with land-based visits and a typical day here involves walking land, checking boundaries and features and measuring options. Whilst I might be walking land on the same farm for several days, I’m never in the same place twice. It might be marshland one day and up in the hills the next. I can always find a lovely spot to stop for a slurp of coffee from my flask. Having completed a visit there is a report to write and submit, so some days are spent in the office (home for me). How I organise my time is up to me, and as long as the work is completed in a timely and efficient manner."
        },
        {
            "text": "RPA’s new approach to site visits is having a positive effect on relationships with farmers, which will hopefully only improve as we move away from EU regulations to entirely domestic ones. With the new Countryside Stewardship under domestic controls, and the Sustainable Farming Incentive, we can give more notice than we could under the EU regulations, and this has been positively received."
        },
        {
            "text": "It also means we can ring farmers on a Friday to tell them we need to visit on a Monday, rather than having to ring them at the weekend. Also, the opportunity to work with the farmer if issues are found is a positive step and will in time, I hope, remove the reputation we have and have been referred to as ‘the RPA Police’."
        },
        {
            "text": "Simple issues can now be resolved rather than them leading to a reduction or penalty. I was off out on my first Domestic Countryside Stewardship visit last year and found that the farmer had tipped a pile of compost in the corner of one of the grassland fields he had in his agreement. His intention was to spread it on the neighbouring arable parcel after harvest. I measured the pile of compost and told him how much of the grass parcel would be ineligible for payment as a result and he immediately said he would move it. I asked him to send in photos when he had done so and as a result he was paid for the whole area of grassland."
        },
        {
            "text": "One change that has been extant for a couple of years now is the pre-visit checklist which is emailed to farmers who’ve been selected for a Cross Compliance visit. This sets out all the records we will need to see so they have a chance to get it all together before we visit. I’ve seen on more than one occasion that farmers have printed this out and have used it to check off the items they need to present to us."
        },
        {
            "text": "Last year saw the introduction of the new Domestic Countryside Stewardship scheme, where the emphasis has moved from prescription-based requirements for chosen options to option aims, and with that a greater flexibility both for managing the options and for how Field Officers can deal with any issues found during visits. This was another big change."
        },
        {
            "text": "Although these changes only came in for domestically controlled schemes last year, it has been my experience that farmers are embracing the opportunity to correct problems and as Field Officers it is satisfying to be able to work with them."
        },
        {
            "text": "In terms of farmers’ attitudes, there will always be the phone calls made just as they are about to start calving or combining and the last thing, they want is a phone call from me telling them I’m coming to see them. However, I’ve always explained that I want to work with them so that we can both get done what needs to be done and the new approach to visits only assists with this."
        },
        {
            "text": "I’m involved with the Sustainable Farming Incentive Pilot farm visits and here again it has been my experience that agreement holders are engaging with the new scheme. A dairy farmer I visited had chosen to have the on-farm woodland standard in her agreement and using the learning opportunities the pilot has provided, she has taught herself about woodland management and can competently meet all actions required by the standard. A second visit took me to a farm consisting of just one field, a smallholder with six sheep, 12 goats, various poultry and two donkeys, whose day job is as a musician. He had taken the opportunity SFI is giving him to learn more about land management and was delighted someone visited him so that he could check his understanding."
        },
        {
            "text": "What I love about the Field Officer role is travelling around, visiting somewhere new all the time, meeting farmers, landowners and agents, using good communication to interact with them and create a constructive and positive relationship."
        },
        {
            "text": "Outside of work I love cycling, enjoy gardening and I manage a Facebook page for an actress, which is my passion and takes up a lot of my spare time!"
        },
        {
            "text": "I do feel proud, when I look to the future and see the changes we are making and how the emphasis is moving from penalising to helping our farmers. Yes, it’s early days, but we are making positive steps in the right direction.”"
        }
    ]
}