{
    "url": "https://defradigital.blog.gov.uk/2022/11/11/remembrance-day-what-it-means-to-me/",
    "title": "Remembrance Day – what it means to me",
    "authors": [
        "Tony Horseman"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-11-11T11:00:33+00:00",
    "content": [
        {
            "text": "Defra IT Training Lead, and Royal Air Force (RAF) veteran, Tony Horseman, explains what remembrance means to him and why he attends the annual service at The Cenotaph each year."
        },
        {
            "text": "As a military veteran, Remembrance Day is so much more than just one day a year. It's every day."
        },
        {
            "text": "I can be doing the most mundane task, or busy working, head down, when a memory of a fallen comrade suddenly pops into my head. I pause, reflect, and remember and try to smile at the times we laughed together, or moaned about what the big chiefs had got us doing this time."
        },
        {
            "text": "Then I try not to cry as I wonder what they would have been like today, if they were still around? What if they hadn’t paid the ultimate price doing their duty? Would we still be in touch? Or would we maybe just see each other once a year at a parade, and catch up on how life was, how the family is?"
        },
        {
            "heading": 2,
            "text": "A day to gather, and remember"
        },
        {
            "text": "So, Remembrance Day; a time to gather, whatever the weather, to pay our respects. A time to catch up with old mates, as well as make new ones over a drink or three after the parade."
        },
        {
            "text": "A time to check in, in person, so you can pick up on the body language of your mates and really make sure they are doing okay. Chat about old times, chat about current times and just help each other get through the day. It is, after all, a very emotional time for everyone, but one where we all know we’ve got each other’s backs."
        },
        {
            "text": "The camaraderie between Service personnel cannot be replicated anywhere else outside of the services and can be very strongly felt and missed by all veterans wherever they are. That’s why it's so important."
        },
        {
            "text": "For me, it's a chance to catch up with colleagues and rekindle long lost friendships. I was a Survival Equipment Specialist (affectionately known as a Squipper) in the RAF for 12 years. I served around the world, made many friends, had some incredible experiences and lots of ups and downs."
        },
        {
            "text": "After I’d left the RAF, in my first year attending The Cenotaph as part of our Squipper trade association, I met up with another veteran that I hadn't seen or spoken with for 27 years! Despite the time that had passed, we recognised each other immediately from across the parade square (amongst thousands of other vets)."
        },
        {
            "text": "In our eyes we are still ‘twenty somethings’, we hadn't changed a bit. Well, perhaps a little wider round the middle, with a few more wrinkles and less hair, but that was all. It was like we'd seen each other just last week and our conversation came as easy as if we'd spoken just yesterday. We picked up where we left off."
        },
        {
            "text": "By then, I had been out of the Air Force for 10 years, doing okay-ish, but I was feeling the ‘need’ to re-connect with my past. I’d heard on the grapevine that a few guys from my old trade had started a private group on Facebook. I didn’t know any of them, but I requested to join and that’s where I found out they were doing Remembrance Day in London, and I requested to attend."
        },
        {
            "heading": 2,
            "text": "My first time"
        },
        {
            "text": "The first year the group attended The Cenotaph, twelve years ago, there were just eight veterans of my trade. As news of our association gathered pace, so did our numbers year on year. This year we will be parading a column of 64 survival equipment veterans in our own association column - the first RAF engineering flight with our own colours."
        },
        {
            "text": "And our numbers keep on growing. It’s not about pulling up a sandbag and swapping ‘war-stories’. It’s about creating that history and making a note of it for future generations. Our trade association is doing just that, gathering old kit and information from our time in our trade, and presenting this as part of a museum collection."
        },
        {
            "text": "Telling a story, not of the aircraft or the aircrew, but of the groundcrew that helped make it happen. Detailing the changes in our trade over the years, the improvements, and the adaptations in kit to protect the aircrew."
        },
        {
            "text": "From the first pilot to use a parachute to bail out in an emergency in 1926 - Pilot Officer Eric Pentland - to the most recent RAF Red Arrows pilot - Red 6, Squadron Leader Gregor Ogston - who successfully ejected following a bird strike at the Rhyl air show earlier this summer, and who survived with just a scratch on his cheek thanks to his survival equipment."
        },
        {
            "text": "It's important to remember that Remembrance Day is not just a time to reflect on the two World Wars, however brutally devastating they were for forces and civilians alike. But the many other conflicts that have happened since, that have massive life changing effects on those that were involved as well as their families. Whether physical or psychological; just because you can't see an injury, doesn't mean they’re not broken."
        },
        {
            "text": "The Falklands Conflict, forty years ago this year, both Iraq wars in 1990 and 2003, Afghanistan from 2001 to 2021, as well as many other global peacekeeping operations that often don’t make the headlines, but which keep our armed forces extremely busy 365 days a year. Many of our brave men and women fought, died, were, or are, permanently injured physically and mentally, protecting people they didn't even know. That’s why it's so important to remember."
        },
        {
            "heading": 2,
            "text": "Remembrance Day – why it matters"
        },
        {
            "text": "That’s what it means to me."
        },
        {
            "heading": 2,
            "text": "And finally, a bit of Squipper trivia…."
        },
        {
            "text": "The primary and secondary stripes of our RAF Survival Equipment Association tie are black and gold, and they represent the operating handles fitted to survival equipment installed in aircraft or worn by aircrew."
        },
        {
            "text": "The first four of the five secondary stripes in the design represent the colours found on an i24 Irvin emergency escape parachute that signify the regions which our equipment covers; sand (desert), olive green (temperate & jungle), white (polar/arctic) and orange (rescue)."
        },
        {
            "text": "The fifth and final stripe of pale blue is reflective of our role in supply dropping and our links with the ‘Goldfish Club’, who represent those whose aircraft have ditched and used survival equipment to save their lives."
        },
        {
            "text": "In the final black stripe, you will note the RAF ‘DZ’ patch which represents our work with UK Special Forces."
        }
    ]
}