{
    "url": "https://teaching.blog.gov.uk/2022/11/11/supporting-pupils-learning-and-development-through-engagement-with-nature/",
    "title": "Supporting pupil’s learning and development through engagement with nature",
    "authors": [
        "Julie Newman"
    ],
    "categories": [
        "Primary schools"
    ],
    "pub_date": "2022-11-11T15:36:23+00:00",
    "content": [
        {
            "text": "One of the objectives of the Department for Education’s Sustainability and Climate Change Strategy is to increase opportunities for children and young people to learn from and connect with nature and improve biodiversity in their schools. "
        },
        {
            "text": "There are a number of schools across the country already doing fantastic work in this space, one of which is St Alban’s CE (Aided) Primary School, which has won awards for its commitment to sustainability, including Hampshire and Isle of Wight Wildlife Trust’s first ‘Wilder School of the Year’ in 2021. Their outdoor education lead, Julie Newman, shares how the school has taken action to support biodiversity in their grounds and beyond. "
        },
        {
            "text": "Power of pupil voice"
        },
        {
            "text": "Many young people are aware that we are in the midst of climate and biodiversity crises. The curriculum is crowded but, like many schools, we have begun to find ways to weave sustainability through the subjects we teach. Raising awareness of climate change and biodiversity is essential and it’s vital that all pupils have the opportunity to bring about change. Otherwise, we run the risk of leaving young people with a sense of helplessness."
        },
        {
            "text": "Being part of the national Polli:Nation project prompted us to focus on pupil voice. We saw how, driven by a group of passionate pupils, action for biodiversity became part of the ethos of our school. Students devised their own PolliPromise campaign and began to engage the local community. Successive cohorts have taken this on board and, as part of X-Polli:Nation, the campaign became international."
        },
        {
            "text": "Another initiative we have participated in is the Tree Council’s ‘Young Tree Champions’, where a class is given the responsibility of leading the school to instigate change. They chose to focus on biodiversity and wellbeing because, as one of our pupils explained, without biodiversity there can be no wellbeing. The project has been threaded through the school curriculum and pupils share their actions through audio trails, videos, assemblies and tours."
        },
        {
            "text": "Making connections with nature and each other\n"
        },
        {
            "text": "We are a Hampshire County Council Trailblazer school. This scheme is all about ‘learning to learn’ and includes connecting to and caring for nature. By the time our pupils go to secondary school, we want them to have developed a love and respect for the natural world and feel empowered and confident in displaying pro-environmental behaviour.  Nature engagement connects our pupils with each other and their environment. Many of our pupils do not have a garden or access to local greenspace, so school grounds are vital places. Exploring throughout the seasons helps develop a sense of place and belonging, which drives pupils to protect nature and bring about change."
        },
        {
            "text": "The connections we have made with our local community have also been extremely rewarding. Our team of garden volunteers work alongside our pupils using a buddy/mentoring approach that has worked well. We also have links with many local individuals and organisations. We share ideas and resources with other schools and groups, helping to build a support network. A blog to share ideas is available on the project website."
        },
        {
            "text": "Growing together "
        },
        {
            "text": "Horticulture in schools can seem daunting, but a single patch of fruit, vegetables or plants can make a difference for both wildlife and our school community. We began with a school club and learned to grow with our garden. Creating a wildlife habitat is much easier than maintaining one, so small steps worked for us:"
        },
        {
            "text": "Impact "
        },
        {
            "text": "By making physical changes to our grounds, our children link their knowledge and skills across the curriculum. Enthusiasm for one species often spills over into another and  becoming increasingly aware of the inter connectedness of living things. Our grounds have become a better place for nature and an example of the power of cumulative, small changes. They are also a better place for people; many of our pupils speak of the calm and joy that comes from being in them. There is immense satisfaction in looking back and knowing you are part of positive change."
        }
    ]
}