{
    "url": "https://disabilityunit.blog.gov.uk/2022/11/11/supporting-blind-and-partially-sighted-library-users/",
    "title": "Supporting blind and partially sighted library users",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-11-11T14:20:23+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "This blog was originally published on the DCMS Libraries Blog on 13 October 2022 for World Sight Day."
        },
        {
            "text": "Currently throughout the UK there are over 2 million people living with sight loss and this number is only expected to rise."
        },
        {
            "text": "Even more significant, is that one in every five people will start to live with sight loss in their lifetime."
        },
        {
            "text": "Since libraries are vital community hubs which thousands of disabled and vulnerable people use, the Department for Digital, Culture, Media and Sport want to make sure we can reach as many blind and partially sighted people as possible through an effective and mutually beneficial partnership with the public library service."
        },
        {
            "heading": 2,
            "text": "RNIB support available"
        },
        {
            "text": "There is a huge plethora of resources, partnerships and expertise that the Royal National Institute of Blind People (RNIB) can offer including:"
        },
        {
            "text": "To carry out this important work the RNIB have recruited a new Library Engagement Manager, whose main role is to liaise with all the public libraries in the UK, so that they have the tools and resources to be able to provide the best possible customer service, support and advice for blind and partially sighted patrons. The RNIB is extremely excited to be setting up this partnership form of working with libraries and is working in partnership with Libraries Connected and their Vision and Print Impaired People’s Promise."
        },
        {
            "text": "Read all about Share the Vision and their new resources at the Reading Sight website."
        },
        {
            "heading": 2,
            "text": "RNIB tech hubs to breach the digital divide"
        },
        {
            "text": "An example of a wonderful collaboration with libraries has been our tech hubs which are run by RNIB volunteers in a community space to help breach the digital divide specifically for blind and partially sighted people. The video below is an example of a Tech Hub run by a volunteer in the café area at the RNIB office in Edinburgh."
        },
        {
            "heading": 3,
            "text": "If you would like to work more closely with the RNIB to assist the library users in your community, please reach out to Lara Marshall – lara.marshall@rnib.org.uk."
        }
    ]
}