{
    "url": "https://companieshouse.blog.gov.uk/2021/09/21/a-conversation-about-the-responsibilities-of-a-company-director/",
    "title": "A conversation about the responsibilities of a company director",
    "authors": [
        "Gary Townley - Senior communications manager",
        "Harry Birmingham - General Counsel and Company Secretary at Sparqa Legal"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-09-21T12:51:21+01:00",
    "content": [
        {
            "text": "As well as keeping records and making annual filings, all company directors owe general duties to their company. These duties regulate how they should carry out their role on a day-to-day basis."
        },
        {
            "text": "Here, Gary Townley from Companies House and Harry Birmingham from Sparqa Legal discuss some of the directors’ duties."
        },
        {
            "text": "Gary: We’re currently in our peak accounts filling period and we’ve issued a lot of information about filling accounts, such as encouraging everyone to file online as it’s quicker and cheaper. But as well as annual filings, there are other responsibilities that come with being a company director. Can you explain what these are?"
        },
        {
            "text": "Harry: That’s right, becoming a director is more than just a box-ticking exercise. As well as taking on responsibility for your company’s various filing and record-keeping obligations, by becoming a director you agree to take on a range of further legal duties. The consequences of neglecting these responsibilities can be serious."
        },
        {
            "text": "The main legal duties of a director are to:"
        },
        {
            "text": "Directors also have a duty to make sure their personal interests do not conflict with those of the company. As part of this, directors must:"
        },
        {
            "text": "It’s important to understand and put these duties into practice day to day, because directors can potentially face legal threats, claims and even personal liability if they do not."
        },
        {
            "text": "To show that you’ve properly accounted for your duties in each decision you make as a director, it’s sensible to record in board resolutions that you’ve properly considered your duties before coming to a particular decision. But equally, you must make sure you fully understand the extent of your duties in the first place, so you can be confident that you’re fulfilling them."
        },
        {
            "text": "Gary: Can we look at these in more detail? How does a director ‘promote the success of the company for the benefit of all the shareholders'?"
        },
        {
            "text": "Harry: In practice, this means that as a director you must make the interests of the company a priority. You must not favour your own personal interests, or the interests of a particular shareholder, or group of shareholders, over others."
        },
        {
            "text": "When exercising this duty, each director must act honestly and fairly. Some factors to think about are:"
        },
        {
            "text": "Of course, these factors may overlap, but it’s a question of weighing them up to come to an appropriate decision."
        },
        {
            "text": "Gary: Yes, and if you do relocate your registered office, do not forget to inform us at Companies House by updating your company details. On to exercising reasonable care, skill and diligence, what skills and experience are directors expected to have?"
        },
        {
            "text": "Harry: As a director, you must exercise the care, skill and diligence which can reasonably be expected of someone who’s a company director. This is very general, and what it actually means in practice will depend on a range of factors including:"
        },
        {
            "text": "As a general rule, you should consider the following factors when judging the level of care, skill and diligence you need:"
        },
        {
            "text": "Your company can expect more from you as a director in an area where you have particular expertise. For example, if you’re also a qualified accountant, you’ll be expected to exercise a higher level of skill and care in relation to financial matters than other directors without the same accounting background."
        },
        {
            "text": "In certain situations, you should be able to rely on external advisers for advice, such as:"
        },
        {
            "text": "But you'll need to monitor their activities and keep on top of what they’re doing. You risk a breach of your duties if you blindly rely on others without any oversight."
        },
        {
            "text": "The way you’re involved in the affairs of your company and the board generally is relevant. For example, if you’re a managing director or chief executive you would generally be expected to be more closely involved in the day-to-day affairs of your company than a non-executive director."
        },
        {
            "text": "Gary: Thanks Harry, we often try to inform directors that although you can employ someone to manage things for you, ultimately the responsibility for the company lies with you as a director. On to independent judgement, how is this exercised?"
        },
        {
            "text": "Harry: That’s quite right, and it’s important for directors to always appreciate that they’re responsible for making sure their company complies with the law."
        },
        {
            "text": "As a director, you must make sure you’re making your own independent decisions at all times. Even if you’ve been nominated to the board by a specific shareholder, for example, you must not let loyalty to that shareholder affect your judgement."
        },
        {
            "text": "You must make sure you do not limit your discretion by agreeing to exercise your powers in a certain way, or by simply following the instructions of a third party with no independent consideration of your own."
        },
        {
            "text": "The main exception to this duty is when you’re acting in a way which is required by your:"
        },
        {
            "text": "If, for example, your articles require you to declare a fixed dividend to certain shareholders each year, as a director you could not be accused of failing to exercise independent judgement if you approve that dividend."
        },
        {
            "text": "This duty does not prevent you from relying on the advice or expertise of others, when it’s appropriate. You’re likely to need to get external advice in some cases, to make sure you’re complying with your other duties to your company. But you should be careful not to simply follow advice blindly or hide behind advice to spare yourself of personal responsibility."
        },
        {
            "text": "Gary: Thanks Harry, the last thing we’re going to discuss today is directors’ powers. Can you explain what they are and how these are applied?"
        },
        {
            "text": "Harry: This depends on the terms of your company’s articles of association. They give powers to directors and also set out the rules which directors must follow when carrying out their day-to-day management duties."
        },
        {
            "text": "As a director, you should familiarise yourself with the terms of your company’s articles and have them in mind when making decisions. For example, there may be restrictions in your articles on how much your company can borrow or who your company can issue shares to. There’ll also be certain decisions that only company shareholders can make."
        },
        {
            "text": "You should review your service agreement or letter of appointment and any shareholders' agreement for further provisions which might grant you specific powers - or place restrictions on - what you can do as a director."
        }
    ]
}