{
    "url": "https://naturalengland.blog.gov.uk/2021/09/21/biodiversity-net-gain-more-than-just-a-number/",
    "title": "Biodiversity Net Gain – more than just a number",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2021-09-21T12:12:13+01:00",
    "content": [
        {
            "text": "It has been great to see the growing amount of coverage in the news about Biodiversity Net Gain (BNG), including a recent episode of BBC Countryfile. Under the Government’s flagship Environment Bill, both Town and Country Planning Act (TCPA) and Nationally Significant Infrastructure Project (NSIP) developments will need to deliver a minimum 10 per cent BNG."
        },
        {
            "text": "This is a significant opportunity to ensure that developments provide lasting benefits for wildlife and to people’s ability to experience nature where they live and work. For generations, the natural environment has all too often been negatively impacted by development. While designated sites have received certain protections under current law, other habitats have shrunk, connectivity between them has been lost and our ability to experience and encounter wildlife in our daily lives has been reduced. BNG provides a unique opportunity to begin to redress that, to support the nature recovery network and put nature back at the heart of planning and development."
        },
        {
            "text": "Much of the recent coverage of BNG has focussed, for understandable reasons, on the recently launched Biodiversity Metric 3.  This Metric is a key part of BNG, and it is important that we, as Natural England, get it right. We will continue to listen to feedback and adjust it if  necessary, before we recommend its usage for mandatory BNG, as set out in the Environment Bill, to Government. Any changes will be clearly communicated."
        },
        {
            "text": "The metric, however, is but one part of BNG. Of even greater importance is ensuring that BNG is undertaken to a high standard and that habitats are created or enhanced to achieve BNG are managed, maintained, and monitored for the long-term."
        },
        {
            "text": "We were delighted to see the publication in August of the new British Standard for BNG – BS 8683. Developed collaboratively with a wide range of expert input, this is a process standard for designing and implementing BNG. Natural England was involved in the development of this standard which is equally as relevant to land managers delivering off-site net gains as it is to development projects delivering BNG within their development. Uniquely, and unlike the BNG requirement set out in the Environment Bill, the standard can be applied by projects across the UK, not just England."
        },
        {
            "text": "Natural England is also developing a net gain sites register, a key component of the future mandatory BNG requirement. The register will include information about any site that is being used to deliver BNG. The register will be publicly accessible and detail the baseline biodiversity value of the delivery site and the expected future biodiversity value of that site. The register will also contain information about who owns the site and it will enable such sites to be traced back to the individual development whose BNG requirement they are helping to fulfil. The register will play a key role in minimising the risk of ‘gaming’ the BNG system by ensuring that the same parcel of land cannot be claimed as the means for delivering BNG by multiple developments. It will also ensure that there is a transparent, public record setting out what existed on the site before its use to deliver BNG and what the site biodiversity outcome the site is supposed to deliver. This will help reduce the risk of fraudulent or misleading claims."
        },
        {
            "text": "However, we recognise that a register alone is not enough. We are finding that people are generally supportive of the principles of BNG but like us, want to be assured that the policy is helping to contribute towards nature recovery (and into local nature recovery strategies) and is providing more opportunities to experience wildlife close to where people live and work.  This is a new policy with new delivery tools relying on a wide cohort of deliverers which brings a lot of uncertainty at this stage that many are picking up on. Natural England, working with Government, has commissioned a study to help shape what a future monitoring and evaluation framework for BNG should consist of and how we can ensure approaches are adapted as we gather more evidence over the long term. Between now and the commencement of the mandatory BNG requirement we will be working with colleagues across Government to implement this macro-level monitoring and evaluation framework."
        },
        {
            "text": "At the individual site level, we are also starting work on a net gain habitat management plan and reporting template. It is vitally important that habitats are managed and maintained for the duration of the BNG agreement and that, if necessary, corrective measures are implemented if the BNG outcomes forecast through the metric are not forthcoming. None of us wants to see an outcome that looks good in the metrics calculation but then fails to materialise on the ground. Habitat enhanced or created to achieve BNG must achieve the distinctiveness and condition forecast and be managed and maintained over the long-term to benefit wildlife. Currently many habitat plans only consider what is needed over a 5-10-year period. BNG requires habitats be secured for at least 30 years, which means they must be managed and monitored. Adaptive management techniques may be needed to help facilitate this combined with periodic reporting of the habitat outcomes that enable corrective or enforcement (in extremis) action to be undertaken. Natural England will work with key stakeholders to develop a long-term habitat management and reporting plan for use in BNG."
        },
        {
            "text": "The above only touches on some of the additional detail that is still needed to ensure that BNG delivers the outcome that we all want. This Autumn, Defra will be consulting on BNG Secondary Legislation and Regulations. We anticipate that this consultation will set out more of the detail needed to help ensure BNG delivers for nature and for people. Natural England has been working closely with Defra group colleagues in on this and we encourage everyone to get involved when the consultation is published."
        },
        {
            "text": "So, to conclude. BNG is not just about the metric, important as that is. It is also about ensuring that BNG is delivered to a good standard, in the right places and in a manner that is transparent and can be managed, monitored, and maintained for the long term.  Natural England has a key role in some aspects and welcomes engagement, but we must all work together over the coming years while this beds in to ensure that we do realise our ambitions – this is too good an opportunity to miss."
        }
    ]
}