{
    "url": "https://buyingforschools.blog.gov.uk/2021/09/21/get-help-buying-for-schools/",
    "title": "Get help buying for schools",
    "authors": [
        "Matthew Gage - Deputy Director, Schools Commercial Team"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2021-09-21T12:47:56+01:00",
    "content": [
        {
            "text": "We know there has been much anticipation around the next steps for a Department for Education (DfE)-funded national schools buying service, following our pilot schemes in the North West and South West, which launched in 2018. The pilots proved there was an appetite within the sector for professional support with complex procurement."
        },
        {
            "text": "As you may now know, in February 2021 we consulted the sector for views on our proposal for the DfE to provide a new national buying service from within the department. The feedback was very positive overall, reinforcing our understanding of the need for this type of support for schools."
        },
        {
            "text": "By building on the learning and successes of our hubs pilots, and other successful DfE services such as Risk Protection Arrangement (RPA) and Teacher Vacancies, we believe we are not only best placed to provide this service, but we’re also confident we are equipped to evolve the service over time to meet your changing needs. You can be assured that we will be impartial, have your best interests at heart and provide a consistent, user-centred service across England."
        },
        {
            "text": "We have a regionally-focused engagement team, so schools will benefit from having a contact in their area, with a good understanding of the sector and the challenges of school buying."
        },
        {
            "text": "In recent months our engagement team have been busy hosting a range of webinars on a variety of our recommended frameworks, which have been attended by more than 1,600 school business professionals. The team are very much looking forward to getting back out on the road, to meet with schools and multi-academy trusts (MATs) to discuss how we can support your buying activity."
        },
        {
            "text": "We know some large MATs employ CIPS-qualified procurement specialists, but for most schools procurement is one of many tasks undertaken by busy school business professionals – we’ve listened to the problems they’re facing and we want to help."
        },
        {
            "text": "We’re ambitious on 2 fronts: firstly, to help schools make savings to reinvest back into frontline education; secondly, to help busy school business professionals build their confidence and capability around procurement. So the way we have designed our new service reflects this."
        },
        {
            "text": "We are building an online service that will help support you with your procurement needs. In addition, we’re recruiting a team of procurement specialists with education specific knowledge, who will work exclusively with schools and MATs to resolve their complex school buying problems."
        },
        {
            "text": "We are keen to work alongside, and in partnership with, other commercial suppliers in the market and local authorities to ensure that all schools really get best value for money, complimenting good existing local provision and stepping in to help where this doesn’t exist."
        },
        {
            "text": "We’re going to start slowly and build and test the service over the next year, learning as we go. From the autumn we will be rolling out some online services to all schools, while our procurement specialists are focussed on continuity of service for schools in the north-west and south-west who are engaged with the pilot hubs."
        }
    ]
}