{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/09/21/go-science-emtech-library/",
    "title": "GO-Science EmTech Library",
    "authors": [
        "Rumbi Ruwanza",
        "Charlie Rogers",
        "Jagjit Singh"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2021-09-21T17:04:35+01:00",
    "content": [
        {
            "text": "The Government Office for Science’s (GO-Science) emerging technologies (EmTech) team recently launched our new EmTech library which has been a great success so far. The library has a wide range of technology based scientific papers, horizon scans, tech reports and annual reports. Topics covered in the library include the future of AI, quantum computing, lab grown meat technology, and synthetic biology."
        },
        {
            "text": "Various EmTech teams across government contribute to the library including the Cabinet Office, Department for International Trade, UK Space Agency, and the MoD. It also contains high-quality reports commissioned from Roke Manor, a consultancy specialising in academic horizon scanning that produce in-depth reports on emerging technologies for civil servants."
        },
        {
            "text": "If you are a civil servant and would like to access the library, please contact the EmTech mailbox."
        },
        {
            "heading": 3,
            "text": "EmTech Knowledge Mobilisers"
        },
        {
            "text": "We will shortly be launching a new network of EmTech Knowledge Mobilisers. The mobilisers will consist of a group of external organisations such as learned societies and knowledge exchange networks with strong pre-existing connections to academia and industry. The network will enable civil service policy teams to tap into a broader and more diverse range of technology experts.\nTo find new sources of external expertise to support your work, please contact the EmTech mailbox."
        },
        {
            "heading": 3,
            "text": "About the EmTech Team"
        },
        {
            "text": "The GO-Science EmTech team aims to improve Government understanding of future technologies, and ensure policy is supported by the best available scientific evidence. They support these aims through the following mechanisms :"
        },
        {
            "text": "Please note : The GO-Science EmTech library is for use of civil servants only. We are not able to share the contents of the library with individuals outside of the civil service."
        }
    ]
}