{
    "url": "https://kingsawards.blog.gov.uk/2021/09/21/maths-circle-receive-their-prestigious-queens-awards-trophy/",
    "title": "Maths Circle Receive their Prestigious Queen's Awards Trophy",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Assessors",
        "Judges",
        "Lord-Lieutenants",
        "queens awards",
        "queensawards",
        "Winners"
    ],
    "pub_date": "2021-09-21T17:16:56+01:00",
    "content": [
        {
            "text": "After a pandemic-laden 18 month wait, the team at Maths Circle were absolutely delighted and honoured to formally receive their Queen’s Award for Enterprise from the HM Lord Lieutenant of Bedfordshire, Helen Nellis, at a wonderful celebration hosted at Bedford Heights."
        },
        {
            "text": "The Lord Lieutenant said:"
        },
        {
            "text": "The afternoon was a chance for the team to reflect on the last few years of growth and educational impact that Maths Circle’s platforms, Times Tables Rock Stars and NumBots, have had on over 10 million pupils worldwide."
        },
        {
            "text": "Bruno Reddy, CEO said:"
        },
        {
            "text": "The event was a double celebration as 11-year-old Nadub Gill - the current world record holder for the most times tables questions answered correctly in a minute on TT Rock Stars (that’s 208 in case you’re wondering!) - was surprised with the award of his Guinness World Record certificate by an Official Adjudicator from the Guinness World Records."
        },
        {
            "text": "Maths Circle created 'Times Tables Rock Stars' a gamified app solution to engage children with learning of times tables and increase their confidence and proficiency in maths and 'NumBots' an app to engage children in the learning of addition, subtraction and number bonds to improve basic numeracy skills. The team are passionate about making maths fun and aim to give every child the opportunity to leave school saying they were \"good at maths\"."
        },
        {
            "text": "Check out their brilliant video from their presentation day here: https://www.youtube.com/watch?v=_mS9P51vvTA"
        },
        {
            "text": "For more information about Maths Circle, or to subscribe to Times Tables Rock Stars or NumBots, please visit https://www.mathscircle.com."
        },
        {
            "text": "For more information, visit https://www.gov.uk/queens-awards-for-enterprise."
        },
        {
            "text": " "
        }
    ]
}