{
    "url": "https://deframedia.blog.gov.uk/2021/09/21/new-gb-consultation-to-protect-plants-from-harmful-pests-and-diseases/",
    "title": "New GB consultation to protect plants from harmful pests and diseases",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-21T16:17:28+01:00",
    "content": [
        {
            "text": "There has been positive media coverage in The Times, Press Association, Eastern and Western Morning News and in trade outlets including Agriland, Horticulture Week and Fruitnet, about today’s launch of a consultation to protect plants from harmful pests and diseases."
        },
        {
            "text": "The joint Defra, Scottish and Welsh Government consultation sets out a new vision for plant health and potential measures to strengthen the existing biosecurity regime. Responses will inform a new Plant Biosecurity Strategy for Great Britain."
        },
        {
            "text": "Coverage in The Times highlights that stricter rules could help to protect British plants from imported pests, and that the consultation follows on from stricter measures introduced in March. Quotes are carried from both Lord Benyon and Nicola Spence highlighting how we are looking to build on existing high biosecurity standards."
        },
        {
            "text": "Comments from Lord Benyon and Nicola Spence are also featured in Garden News and Horticulture Week following their visit to RHS Chelsea Flower Show to launch the consultation."
        },
        {
            "text": "Minister for Biosecurity Lord Benyon said:"
        },
        {
            "text": "The threat from plant pests and diseases is significant and growing due to globalisation and climate change. The risks to food production and our precious landscapes, trees, parks and gardens are all too real."
        },
        {
            "text": "We already have some of the highest biosecurity standards in Europe but as we look to build back greener from the pandemic, we want to consider any further safeguards needed to protect our natural world. That’s why we’re asking for views from all sectors, including horticulture, forestry and farming, to help us shape our future biosecurity strategy and ensure our trees and plants are protected for future generations."
        },
        {
            "text": "UK Chief Plant Health Officer Nicola Spence said:"
        },
        {
            "text": "We take the nation’s biosecurity very seriously and currently have some of the strongest measures in Europe. This consultation provides an opportunity for us to build on our current regulations and ensure our high plant health and biosecurity standards are maintained."
        },
        {
            "text": "I urge everyone working in the sector and the public to respond to this consultation so we can uphold our biosecurity standards for future generations."
        },
        {
            "text": "Wales’ Minister for Climate Change, Julie James said:"
        },
        {
            "text": "The consultation reflects our shared ambitions for a strengthened biosecurity regime, and is clear on the need to work in partnership to achieve our aims."
        },
        {
            "text": "Plant Biosecurity is hugely important to address threats from pests and diseases and this consultation is an opportunity for all to inform our future approach to plant health."
        },
        {
            "text": "Scotland’s Minister for Environment and Land Reform Màiri McAllan said:"
        },
        {
            "text": "Plants underpin our environment, rural industries, wellbeing and biodiversity. With an ever increasing number of plant health threats, we need to work collaboratively to effectively shape our policies and safeguard against biosecurity risks in the years ahead. I would therefore encourage all stakeholders to contribute to that process by responding to this consultation."
        },
        {
            "text": "Great Britain already has some of the most robust biosecurity measures in the world but our approach is kept under constant review to ensure these standards are maintained and plants are protected as we face emerging challenges."
        },
        {
            "text": "Today’s announcement coincides with the Chelsea Flower Show. This year’s RHS Show shines a spotlight on the importance of protecting biodiversity and our planet with the COP26 garden, ahead of the UK’s Presidency at the climate change summit this November."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}