{
    "url": "https://phescreening.blog.gov.uk/2021/09/21/newborn-outcomes-solution-update/",
    "title": "New development in the newborn outcomes solution",
    "authors": [
        "Emma Proctor"
    ],
    "categories": [
        "NHS Sickle Cell and Thalassaemia Screening Programme"
    ],
    "pub_date": "2021-09-21T11:21:21+01:00",
    "content": [
        {
            "text": "The PHE sickle cell and thalassaemia (SCT) screening team is pleased to announce a new release of the newborn outcomes solution."
        },
        {
            "text": "The changes reflect feedback from users and include improvements for laboratory users and changes to data entry pages for laboratory and clinical (nurse/medical) users."
        },
        {
            "heading": 2,
            "text": "Improvements for laboratory users"
        },
        {
            "text": "Laboratory users need to indicate which nursing/treatment centre they want to refer a baby to."
        },
        {
            "text": "Currently, they have to choose from an alphabetical list of all the centres in the country. The updated list will display the nursing/treatment centres from their associated network list at the top. This should prevent errors in referral to the wrong centre and make the referral process more efficient. The list of centres in the rest of the country will still be available at the bottom."
        },
        {
            "text": "There is also a new ‘save as draft’ function for the laboratory. This is to enable the referral to be saved and checked by a second member of the laboratory team before it is submitted to the nursing/treatment centre."
        },
        {
            "text": "This reflects the process that happens in many newborn bloospot laboratories in England. The ability to review and submit a referral straightaway will be retained."
        },
        {
            "heading": 2,
            "text": "Changes to data entry pages for laboratory and clinical (nurse/medical) users"
        },
        {
            "text": "These changes include:"
        },
        {
            "text": "Please contact NBOsupport@phe.gov.uk if you have any queries relating to the system or would like to request training."
        },
        {
            "text": "For issues relating to user accounts, please contact support@mdsas.com."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}