{
    "url": "https://educationhub.blog.gov.uk/2021/09/21/removal-of-school-bubbles-cuts-disruption-as-more-than-91-of-pupils-attend-school/",
    "title": "Removal of school ‘bubbles’ cuts disruption as more than 91% of pupils attend school",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2021-09-21T15:42:07+01:00",
    "content": [
        {
            "text": "Earlier this month, all pupils returned to schools following the summer holidays."
        },
        {
            "text": "Our latest attendance statistics help paint a picture of how Covid-19 is impacting schools, and we’ll continue to release attendance statistics throughout the year.  "
        },
        {
            "heading": 3,
            "text": "What are the current attendance statistics? "
        },
        {
            "text": "99% of state-funded schools were open on 16 September, with 91.9 pupils attending school that same day."
        },
        {
            "text": "This is an increase from the 87% attendance at this time last year. This is hugely encouraging, and this year we have removed the ‘bubbles’ policy in schools and colleges meaning fewer pupils have to isolate in the event of a positive case. This means that only those who have symptoms or who have tested positive for the virus will need to isolate."
        },
        {
            "text": "This, combined with the impact of the vaccine rollout, means fewer pupils are seeing their schooling disrupted compared with last year."
        },
        {
            "heading": 3,
            "text": "How many pupils were absent because of COVID-19?"
        },
        {
            "text": "In all state funded schools 1.5% of pupils were absent because of COVID-19 on 16 September. Of this number, only 0.7 percent were absent due to a confirmed positive case of COVID-19."
        },
        {
            "heading": 3,
            "text": "What are you doing to ensure schools stay open and pupils can carry on attending? "
        },
        {
            "text": "It is hugely important that pupils can return the classroom with as much confidence as possible. We’re working closely with local authorities, schools and local health teams to ensure that learning is disrupted as little as possible."
        },
        {
            "text": "Although we are not yet out of the pandemic, compared with last September we have stronger defences in place, with every teacher and every 16- and 17-year-old having been offered a vaccination, and extra safety measures in place, including testing. The vaccination of 12–15-year-olds also began this week and is being led by the NHS and Department for Health and Social Care."
        },
        {
            "text": "We’re also making sure schools are as well ventilated as possible by providing a minimum of 300,000 carbon dioxide monitors to schools, backed by £25 million, so staff can quickly identify where ventilation needs to be improved."
        },
        {
            "text": "Special schools have been prioritised to receive a monitor first, given they care for the most vulnerable children, but monitors are being rolled out more widely to all schools as quickly as possible."
        }
    ]
}