{
    "url": "https://educationhub.blog.gov.uk/2021/09/21/the-big-ask-survey-the-findings/",
    "title": "‘The Big Ask’ Survey – The Findings",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-09-21T18:01:13+01:00",
    "content": [
        {
            "text": "Today (21 September) the Children’s Commissioner, Dame Rachel de Souza, published the results of ‘The Big Ask’ survey, the biggest ever consultation undertaken with children."
        },
        {
            "text": "As a department, we also recognise that this huge survey of half a million children and young people gives us some great insight into what makes them tick."
        },
        {
            "text": "That is why we are providing the largest mental health funding in NHS history - an extra £2.3 billion a year to services by 2023/24 – which will mean an additional 345,000 children and young people will be able access NHS-funded services or school and college-based support, per year."
        },
        {
            "text": "‘The Big Ask’ survey ran from April 19th to May 19th and asked children across England to set out their priorities for improving childhood post-Covid."
        },
        {
            "text": "The key findings of the interesting survey were;"
        },
        {
            "text": "The Children’s Commissioner has publicly praised the “resilience, optimism, and honesty of children” who, having lived through Covid, reject, as she does, talk of “a lost generation” and that they are a “roll-up-their-sleeves, heroic” generation."
        },
        {
            "text": "She has also issued a rallying call to put the next generation front and centre of the recovery from the pandemic by encouraging them to focus on their health and wellbeing; catch-up in schools; their family life; the communities they value and delivering on their ambition for good jobs."
        },
        {
            "text": "The Education Secretary reinforces this message and stresses the importance of young people being heard. This survey shows the variety of concerns young people have – and the Government has taken action to address them."
        },
        {
            "text": "To coincide with this news today, we have announced:"
        },
        {
            "text": "Earlier this year, we also appointed Dr Alex George as the Government’s Youth Mental Health Ambassador, who is playing an important role in raising the profile of mental health education and wellbeing in schools, colleges, and universities, including through the work of the Mental Health in Education Action Group."
        }
    ]
}