{
    "url": "https://buyingforschools.blog.gov.uk/2021/09/21/welcome-to-the-buying-for-schools-blog/",
    "title": "Welcome to the Buying for Schools blog",
    "authors": [
        "David Allen - Stakeholder and Engagement Lead, Schools Commercial Team"
    ],
    "categories": [
        "The team"
    ],
    "pub_date": "2021-09-21T12:53:39+01:00",
    "content": [
        {
            "text": "Hello and welcome to our new Buying for Schools blog."
        },
        {
            "text": "My name is David Allen and I am one of the Stakeholder and Engagement Leads in the Schools Commercial team at the Department for Education (DfE)."
        },
        {
            "text": "As we are launching a new blog, I thought it would be helpful to outline a little about who we are, what we do and most importantly how we can help you and your school."
        },
        {
            "text": "Our team is based across England and all have extensive experience of working with schools across the education sector. Our aim is to help you with your buying needs - everything from basic stationery items through to complex contracts, such as cleaning, catering and ICT."
        },
        {
            "text": "We publish buying guidance on GOV.UK and signpost a growing number of DfE-approved frameworks. These frameworks have been approved on the basis of their ease of use, value for money and meeting the needs of schools."
        },
        {
            "text": "Our team spends lots of time out and about talking with schools leaders and school business managers. We deliver a series of webinars that explain how you can use our approved frameworks to help your buying activity in school."
        },
        {
            "text": "In addition, our team attends many education shows and school business manager network meetings – so are always available to talk about how we can help and we want your feedback to help us develop the right buying solutions for you."
        },
        {
            "text": "We will be using our blog to let you know about events we are planning and new frameworks that we recommend for schools to use. We will also be highlighting other services which we think you might find useful."
        },
        {
            "text": "We hope you will find the blog informative and helpful and we value your feedback to help us inform future content."
        }
    ]
}