{
    "url": "https://buyingforschools.blog.gov.uk/2021/09/21/what-is-the-risk-protection-arrangement-rpa/",
    "title": "What is the Risk Protection Arrangement (RPA)?",
    "authors": [
        "Helen Lumb - Schools Engagement Manager, Schools Commercial Team"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2021-09-21T12:51:29+01:00",
    "content": [
        {
            "heading": 2,
            "text": "1. What is RPA?"
        },
        {
            "text": "The Risk Protection Arrangement is an alternative to commercial insurance for schools and academies, provided by the Department for Education (DfE)."
        },
        {
            "heading": 2,
            "text": "2. What’s the difference between RPA and commercial insurance?"
        },
        {
            "text": "RPA looks at the core classes of risks to the school sector. Under RPA, where losses arise they are covered by the UK government."
        },
        {
            "heading": 2,
            "text": "3. Why did DfE set it up?"
        },
        {
            "text": "We introduced RPA following independent analysis which showed that it would be cheaper for academy trusts if the UK government covered risks instead of commercial insurers."
        },
        {
            "heading": 2,
            "text": "4. What does it cost?"
        },
        {
            "text": "Currently it costs £19 per pupil, per year."
        },
        {
            "heading": 2,
            "text": "5. How many schools are now members?"
        },
        {
            "text": "We currently have over 8,500 schools who are members of RPA."
        },
        {
            "heading": 2,
            "text": "6. What’s coming up next for RPA?"
        },
        {
            "text": "We ask schools what they want us to cover. Cyber crime is something that many schools tell us concerns them, so we are currently running a pilot with 500 schools to see how we can help them with that. We are also doing some proactive work with schools around reducing the risks of crime and flooding."
        },
        {
            "heading": 2,
            "text": "7. What do schools say?"
        },
        {
            "text": "In a recent member survey 99.5% of respondents said they were satisfied/very satisfied with the service they receive."
        },
        {
            "text": "Here are a couple of recent quotes from schools:"
        },
        {
            "text": "\"They deal with claims very efficiently. I am also very impressed with the advice line/email address - they respond promptly and helpfully. During the coronavirus (COVID-19) crisis, I have been so grateful to be a member of the RPA. I am aware that colleagues in other schools have really struggled with their insurers and am pleased that we haven't had those added struggle during what is already is a difficult time.\""
        },
        {
            "text": "\"We feel secure knowing we have this alternative to a commercial policy in place which is by far a cheaper solution which means a great deal when budgets are very tight.\""
        },
        {
            "text": "8. How do you join?"
        },
        {
            "text": "It’s simple, just sign up."
        },
        {
            "heading": 2,
            "text": "9. What if I need to make a claim?"
        },
        {
            "text": "There is a 24/365 dedicated telephone helpline, and you’ll be given all the details in the welcome pack when you join."
        },
        {
            "heading": 2,
            "text": "10. What if I need more info?"
        },
        {
            "text": "Come along to one of our Wednesday information sessions - you can book for free or you can email us for an invitation."
        }
    ]
}