{
    "url": "https://despatch.blog.gov.uk/2023/04/26/ers-a-tale-of-two-trainers/",
    "title": "ERS – A tale of two trainers",
    "authors": [
        "Mark Jaffe",
        "Mike Desmond"
    ],
    "categories": [
        "Learning to ride",
        "Motorcycle test",
        "Motorcycle trainers"
    ],
    "pub_date": "2023-04-26T14:28:01+01:00",
    "content": [
        {
            "text": "As part of our commitment to a lifetime of safe riding, we want to encourage people who have passed their full test to keep improving their riding skills and knowledge.  "
        },
        {
            "text": "DVSA’s Enhanced Rider Scheme (ERS) is a great way for riders to continue the develop of their skills in environments they don’t ride in day to day. "
        },
        {
            "heading": 3,
            "text": "Mark Jaffe - Phoenix Motorcycle Training "
        },
        {
            "text": "Mark Jaffe of Phoenix Motorcycle Training has been delivering ERS training in London for over a decade. The school actively promotes ERS training to pupils as a gateway into developing new skills. He says: "
        },
        {
            "text": "Many of Mark’s ERS pupils are familiar with the challenges of riding safely in a city, however, they’re not so confident riding in unfamiliar surroundings."
        },
        {
            "text": "To change this, Mark takes them out on training rides to Kent and Sussex to develop the forward vision, planning skills and motorcycle control they need to ride safely and successfully on narrow, twisting country roads. He says: "
        },
        {
            "text": "Mark and his colleagues at Phoenix do the ERS course once a year themselves as a refresher. They find that teaching the wide variety of skills involved in ERS helps keeps their own skills and motivation fresh."
        },
        {
            "heading": 3,
            "text": "Mike Desmond - Practical Bike Training "
        },
        {
            "text": "Practical Bike Training, based in Morecambe, Lancashire close to the Lake District and the Pennines. The business has been running for 13 years.  "
        },
        {
            "text": "Mike Desmond has been a motorcycle trainer for three years and is in his second year of delivering ERS training. Like Mark, he actively promotes ERS to pupils as a way of developing skills that will enable them to ride safely and with confidence on the most challenging of roads. He says: "
        },
        {
            "text": "For Mike, the small group format of ERS training enables him to tailor training to suit his pupils’ needs. He finds it a particularly effective way to build the skills that will enable them to enjoy the thrills of riding a high-performance bike without compromising safety:"
        },
        {
            "text": "He believes that the skills people learn in ERS training build their confidence to take on new challenges successfully. He also finds that it deepens their enjoyment and appreciation of riding. Like Mark, he feels he gets as much out of teaching ERS as his pupils: "
        },
        {
            "text": "You can find out more about ERS and how to become an ERS trainer here:  Take the DVSA enhanced rider scheme assessment and training - GOV.UK (www.gov.uk) "
        }
    ]
}