{
    "url": "https://educationhub.blog.gov.uk/2023/04/26/school-funding-everything-you-need-to-know/",
    "title": "School funding: Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-04-26T09:31:34+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "No school, child or local authority is the same and school funding needs to reflect that. That’s why sometimes it can seem complicated."
        },
        {
            "text": "Here’s what you need to know about school funding."
        },
        {
            "heading": 3,
            "text": "How are schools funded?  "
        },
        {
            "text": "Most state-funded schools in England receive funding through two main funding pots which determines what the money can be spent on – revenue funding and capital funding.  "
        },
        {
            "text": "Schools can decide how they spend their revenue funding. It is used to pay for the day-to-day running costs of a school, such as teacher pay, support staff pay, energy bills, minor maintenance, and teaching materials.  "
        },
        {
            "text": "Capital funding is a separate pot of money used to pay for new school buildings and improvements to the school estate.  "
        },
        {
            "heading": 3,
            "text": "How does government decide how much revenue funding each school gets? "
        },
        {
            "text": "Each year, the government allocates money for all state-funded mainstream schools, including academies and council-run schools, using a formula that ensures funding is fair and reflects their pupils’ needs. "
        },
        {
            "text": "This is called the National Funding Formula (NFF) which you can read more about here.  "
        },
        {
            "text": "This formula takes a variety of factors into account, such as the number of pupils a school has and how its location may affect the school’s running costs. "
        },
        {
            "text": "The funding system also protects schools against large decreases in per-pupil funding from one year to the next, giving schools stability to help their budget planning.  "
        },
        {
            "text": "Schools have the flexibility to decide how to use this funding. Most of the money is spent on paying staff, but it can also be used for other costs such as classroom materials and energy. "
        },
        {
            "text": "Independent or private schools operate outside this system and raise their funding through fees. "
        },
        {
            "heading": 3,
            "text": "How much is spent on school funding? "
        },
        {
            "text": "In autumn, we announced that in 2023-24, schools will get an extra £2 billion of revenue funding and the same again in 2024-25.  "
        },
        {
            "text": "This is on top of the £1.5 billion increase schools were already set to receive in 2023-24, bringing the overall funding increase this year to £3.5 billion, compared to 2022-23.  "
        },
        {
            "text": "It means that total school revenue funding in England is £57.3 billion for 2023-24, rising to £58.8 billion for 2024-25.  "
        },
        {
            "text": "As a result, in 2024-25 schools will receive the highest ever level of per pupil in real terms, as measured by the Institute for Fiscal Studies.  "
        },
        {
            "text": "According to the Organisation for Economic Co-operation and Development (OECD), in 2019-20 the UK was the highest spender in the G7 on schools and colleges delivering primary and secondary education as a share of GDP. "
        },
        {
            "heading": 3,
            "text": "What does this money mean for my child’s school? "
        },
        {
            "text": "The additional £2 billion will mean that a typical primary school with 200 pupils can expect to receive around an extra £35,000 in funding.   "
        },
        {
            "text": "A typical secondary school with 900 pupils would receive an additional £200,000.   "
        },
        {
            "text": " Schools can choose how they spend the additional funding, for example, on staffing, classroom materials, or other running costs.  "
        },
        {
            "text": "Overall, funding for mainstream schools is increasing by around £310 per pupil this year – which is on top of the average £300 per pupil increase last year (2022-23).    "
        },
        {
            "text": "In total, average per-pupil funding in schools for 2023-24 is £7,460.   "
        }
    ]
}