{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/04/26/stem-challenge-2023/",
    "title": "STEM CHALLENGE: 2023",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Outreach"
    ],
    "pub_date": "2023-04-26T13:34:00+01:00",
    "content": [
        {
            "text": "A schools outreach initiative aiming to inspire secondary school students to get involved in science and policy making"
        },
        {
            "text": "The GSE Profession, in collaboration with Civil Service Fast Streamers, is proud to announce the launch of the STEM Challenge 2023. Running for its second year, the Challenge encourages secondary school students to act as policy makers tackling Net Zero, aiming to communicate the real-world relevance of STEM and to demonstrate that STEM careers are about much more than just working in a lab. The Challenge has been designed to align with the Government’s Levelling Up agenda and ultimately reduce the disparity in STEM uptake across the country."
        },
        {
            "text": "This year, we are asking teams of four to six secondary school students to explore their vision of a carbon neutral day in 2050, focusing on creative scientific solutions to one of the following sustainability-related topics:"
        },
        {
            "text": "Benefits of participating"
        },
        {
            "text": "Students will submit a report or poster to be judged by a panel of cross-government civil servants, including policy experts. Participating students will receive certificates and careers resources about STEM in Government, while top entries will receive prizes such as Amazon vouchers and site visits!"
        },
        {
            "text": "The Challenge will target Good Career Guidance Gatsby Benchmarks 4 and 5 and will develop key skills in the Skills Building Partnership Framework, including problem solving, creativity, teamwork and writing skills."
        },
        {
            "text": "Schools from the following regions are participating in the Challenge:"
        },
        {
            "text": "If you have any questions about the STEM challenge or would like to sign your school up and receive student and teacher packs, please get in touch with stemchallenge@faststream.civilservice.gov.uk and use the subject line ‘STEM Challenge Enquiries’ when contacting us. We are accepting school sign-ups until 26th May 2023 and entry submissions until 7th July 2023. "
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}