{
    "url": "https://dragonsden.blog.gov.uk/2023/04/26/toddle-born-wild-big-innovation-for-little-hands/",
    "title": "Toddle Born Wild: ‘big innovation for little hands’",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "IP",
        "Trade marks"
    ],
    "pub_date": "2023-04-26T11:12:00+01:00",
    "content": [
        {
            "text": "Entrepreneur Hannah Saunders pitched her range of child-friendly, eco-friendly, ethically-sourced skincare products to the Dragons' Den investors during Series 19 in March 2022. Her presentation attracted high praise from the Dragons, and gained the support of investors Deborah Meaden and Steven Bartlett, which she says really helped her on her way. "
        },
        {
            "text": "We spoke to Hannah about her success as a woman in business and how registering her IP has helped her protect and add value to her brand, ‘Toddle Born Wild’.  "
        },
        {
            "heading": 2,
            "text": "What was the inspiration for Toddle Born Wild? "
        },
        {
            "text": "After being in the RAF for 9 years and loving the travel and adventure, Hannah became a mum in 2014.  "
        },
        {
            "text": "“I was planning on leaving the British Armed Forces as I didn’t want to have to deploy away from him for six months at a time. I’m quite an outdoorsy person and really wanted my children to come on adventures with me. However, my son would get windburned cheeks and his lips would get chapped from the cold air. I couldn’t find any products on the market for children under 3 that could help. So, I decided to make my own.  "
        },
        {
            "text": " “Things all came together at the right time.” "
        },
        {
            "heading": 2,
            "text": "How did Toddle start? "
        },
        {
            "text": "\"I started making lip balm in my kitchen, then sunscreen followed pretty soon after that. I looked at different routes to market, selling online to consumers initially. To attract investment I knew I needed a much broader range and I needed to be able to demonstrate growth, so that's when we brought in the hand gel.” "
        },
        {
            "text": "Hannah’s business now produces a range of 15 natural eco-friendly skincare products for children, from dribble-proof lip balm to probiotic hand gel. Vegan and natural and refillable, sustainability is important too. “We reduce our carbon footprint by using UK businesses for our ingredients, formulations and packaging,” she told us. "
        },
        {
            "heading": 2,
            "text": "What intellectual property do you have, and how have you protected it?  "
        },
        {
            "text": "Hannah knew early on that intellectual property protection needed to be a fundamental part of her business plan.  "
        },
        {
            "text": "“I attended an IP workshop to get some practical business advice. I know that IP is sometimes overlooked, and in terms of protecting yourself commercially, it’s so important to protect your brand when you’ve spent all that time, money and effort building up customer loyalty.  "
        },
        {
            "text": "“It just really made me think that, you know, we are being quite innovative and different with what we're doing. As these products become more and more popular, I really do want to try and protect them, and protect ourselves. "
        },
        {
            "text": "“We've got trade marks for our Toddle Dribble-proof Lip and Cheek Balm, the bear logo along with the name Toddle, the Happy Gut Hand Gel. Then we've got registered designs for our Toddle design, and for our magic mist bottle, which has stood us in really good stead.  "
        },
        {
            "text": "“We also have trade secrets. We ask everyone to sign a non-disclosure agreement (NDA). The ingredients list tells you what’s in our products, but it’s actually quite hard to replicate somebody else’s product if you don't know the percentages. We guard those well.”  "
        },
        {
            "heading": 2,
            "text": "Have you got any IP advice for entrepreneurs just starting out? "
        },
        {
            "text": "“I think IP is sometimes overlooked. Two or three times now the registered designs or trade marks we have in place have protected us from losing a lot of money.  "
        },
        {
            "text": "“If you are going to build a successful company, it's going to make money. People are going to start to look at you, and in some cases, they're going to copy you. So definitely, protect your IP.”  "
        },
        {
            "heading": 2,
            "text": "What advice do you have for women in business?  "
        },
        {
            "text": "“From my own experience, we do need to be more confident. Men are really good at backing themselves, even when they may not be the best prepared in terms of cash flow forecast and business plan. My confidence comes from being well prepared - I will have worked on my pitch and my business plan for many months and have a meticulous cash flow forecast for the next three years.” "
        },
        {
            "heading": 2,
            "text": "“You can’t be what you can’t see” "
        },
        {
            "text": "“The thing is, over the last 50 years, as markets have deregulated, the start-up landscape has mainly been driven by men. As women, you can't be what you can't see. Women haven’t had the role models, the networks. Luckily that is all changing.\""
        },
        {
            "text": "“I do think women need a mindset change though. While there is definitely room for humility, we just need to understand that we belong in the room, we're qualified to be in that room and needn’t feel uncomfortable asking people for money. Investors want to give you money. They want to see returns. They want to work with an interesting range of people.”  "
        },
        {
            "heading": 2,
            "text": "And your thoughts on getting where you are today? "
        },
        {
            "text": "There's a lot to learn. I think one of the best assets that I have is my ability not to have any ego, but just do what's best for the business. I've always got my ears open and I'm very fortunate to have some incredible mentors that give me great advice.  "
        },
        {
            "text": "Reflecting on where I am now, I can say that I'm a successful business-woman. It's all a bit crazy when I stop to think about it, but absolutely brilliant! "
        },
        {
            "text": "You can hear more from Hannah when she tells us all about her Dragons' Den experience in next week's blog."
        }
    ]
}