{
    "url": "https://companieshouse.blog.gov.uk/2023/04/26/using-the-companies-house-advanced-search-function/",
    "title": "Using the Companies House advanced search function",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2023-04-26T09:00:11+01:00",
    "content": [
        {
            "text": "The Companies House register contains public information about all companies incorporated in the UK. It also holds information about other types of businesses, such as limited liability partnerships (LLPs) and community interest companies (CICs)."
        },
        {
            "text": "The register provides transparency and accountability in the UK's business environment. It makes information about companies visible and searchable. This helps to build trust, which is important for attracting investment, creating jobs, and promoting economic growth."
        },
        {
            "text": "By providing information about a company's ownership, financial status and other key details, the register helps to protect consumers from fraud and unethical business practices. It helps consumers and businesses make informed decisions about which companies to work with."
        },
        {
            "text": "The register also provides a central repository of information about companies and other businesses that regulators can use to ensure compliance with relevant laws and regulations. This helps to maintain a level playing field for all businesses and promotes fair competition."
        },
        {
            "text": "The new Register of Overseas Entities was recently added to the information available. It includes details of overseas entities, their beneficial owners or managing officers."
        },
        {
            "heading": 2,
            "text": "Finding company information"
        },
        {
            "text": "The Companies House advanced search function is a feature of the Find and update company information service. It allows users to search for specific information about companies on the register and is designed to make it easier for individuals and businesses to access the information they need."
        },
        {
            "text": "Introduced in November 2021, the advanced search function allows users to search for companies using a range of criteria. This includes the company name, registration number, location, and date of incorporation. Users can also filter their search results based on factors, such as the status of the company (active or dissolved) and the type of filing history (confirmation statements or accounts)."
        },
        {
            "text": "The search results generated by advanced search provide detailed information about each company. Users can also view the company's filing history, including its confirmation statements, accounts, and other documents filed with Companies House. Users can scroll through results or download a spreadsheet containing up to 5000 companies."
        },
        {
            "heading": 2,
            "text": "Register of overseas entities"
        },
        {
            "text": "Accessing the new register of overseas entities is simple. Using the advanced search function, change the company type filter to ‘overseas entity’ and select search. This will show you the first 10,000 records on the register. By using the incorporation date filter, you can access the whole register. If you're searching for a specific company use the company name filter or the registered office address filter."
        },
        {
            "text": "Once you’ve found the company, you’ll have access to the overview, filing history and people, including officers and beneficial owners (where available). You’ll be able to view a company information snapshot and order a certified document. It’s also possible to follow the company."
        },
        {
            "heading": 2,
            "text": "Follow a company"
        },
        {
            "text": "The Companies House following service is a free service. Users receive email notifications of events related to a company, such as when the company files accounts, submits a confirmation statement or makes changes to its directors."
        },
        {
            "text": "To use the follow service, you first need to create an account on the Companies House website. Once you have an account, you can search for a company and select the ‘follow’ button to receive email notifications for that company. You can choose which types of notifications you want to receive."
        },
        {
            "text": "The follow service is useful for anyone who wants to keep track of a particular company's activities. By receiving notifications of important events, you can stay up to date with the company's financial and legal status. This can be especially important if you’ve invested in the company or are considering doing business with it. For added security, you could choose to follow your own company."
        },
        {
            "text": "It’s possible to see all the companies you’ve chosen to follow by selecting ‘Companies you follow’. To stop receiving email alerts for a company, simply select ‘Unfollow’."
        },
        {
            "heading": 2,
            "text": "Companies House Direct (CHD) and WebCHeck services"
        },
        {
            "text": "The Companies House Direct (CHD) and WebCHeck services will be closing on 30 November 2023. We advise users to become familiar with the Find and update company information service, which is a fully accessible service and has already replaced the majority of the functions provided by CHD and WebCHeck."
        },
        {
            "text": " "
        }
    ]
}