{
    "url": "https://charitycommission.blog.gov.uk/2023/04/26/what-is-a-trustee-and-how-to-become-one/",
    "title": "What is a trustee and how to become one?",
    "authors": [
        "Becky Kelly"
    ],
    "categories": [
        "Trustees",
        "Volunteering"
    ],
    "pub_date": "2023-04-26T16:13:08+01:00",
    "content": [
        {
            "text": "The Big Help Out aims to help people experience volunteering and make a difference in their communities. Getting On Board and the Charity Commission are here to support."
        },
        {
            "text": "Volunteering can be incredibly rewarding, and there are many ways in which you can devote some of your time to charitable work."
        },
        {
            "text": "Have you ever considered helping to run a charity? "
        },
        {
            "text": "Trustees are the volunteers who lead charities and decide how they are run. You may have heard them called board members or the board. Trusteeship is a great way of contributing to causes you care about and developing strategic and leadership skills at the same time."
        },
        {
            "text": "Anyone can be a trustee, regardless of how junior or senior you are in your career, whether you’re in paid employment or not, regardless of your ethnicity, class, gender orientation, sexuality or any other difference. Boards thrive when they have a diversity of skills, knowledge, age and experience on their board."
        },
        {
            "text": "Did you know?"
        },
        {
            "text": "Getting on Board also has other useful resources to support you. You can read their guide on How to Become a Trustee Guide, they also have a series of useful webinars, Getting on Board Events"
        },
        {
            "text": "You can find hundreds of trustee vacancies listed on the Reach Volunteering search platform."
        },
        {
            "text": "The Charity Commission also has a series of guides to support you on your Trustee Journey. Advice and guidance for Charity Trustees – Getting the most out of being a charity trustee"
        }
    ]
}