{
    "url": "https://teaching.blog.gov.uk/2022/04/18/advice-on-how-to-address-the-topic-of-pornography-in-the-classroom/",
    "title": "Advice on how to address the topic of pornography in the classroom",
    "authors": [
        "Jenny Fox"
    ],
    "categories": [
        "Curriculum best practice"
    ],
    "pub_date": "2022-04-18T09:13:05+01:00",
    "content": [
        {
            "text": "Jenny Fox is a Senior Subject Specialist at the PSHE Association. Here, she shares advice on how to approach the difficult topic of pornography with young people as part of a school’s PSHE/RSHE curriculum."
        },
        {
            "text": "The prospect of teaching a lesson about porn can feel daunting. And, of all the topics in the Relationships and Sex Education guidance, pornography feels both desperately important and hard to get right."
        },
        {
            "text": "A lot of young people are seeing pornography – some as young as aged 10-11 – and in many cases it is happening accidentally through being shared by peers, clicking suspicious links, or innocently searching terms to find out what they mean. And we know that the kind of pornography accessed may be violent and degrading, with long-lasting effects on expectations of relationships and sex. So the case for addressing porn in the classroom has never been more persuasive or pressing. But how do we approach this tricky and potentially embarrassing topic through PSHE education?"
        },
        {
            "heading": 3,
            "text": "Plan in regular lessons"
        },
        {
            "text": "Firstly, treat pornography like any other topic on your PSHE/RSHE curriculum. It needs to be embedded in wider learning about consent, relationship expectations and how these are influenced by different sources such as the media, peers and porn. Good teaching about the online world will also reduce chances of accidental access. It should however never be dealt with through assemblies or one-off sessions alone but effectively sequenced through regular lessons."
        },
        {
            "heading": 3,
            "text": "Establish ground rules"
        },
        {
            "text": "Secondly, as with any PSHE lesson, the classroom needs to be a safe space where you feel comfortable teaching and the pupils feel comfortable learning. Establish ground rules about respecting other’s views, and avoiding making assumptions or asking personal questions. It is also a helpful staff training exercise to map out and rehearse tricky questions and answers to avoid feeling ‘on the spot’ in lessons.  Encourage anonymous questions in class as they allow pupils to ask what they might be afraid to in front of others. This also gives you time to prepare your answer."
        },
        {
            "heading": 3,
            "text": "Frame issues with care"
        },
        {
            "text": "Thirdly, think about how to frame the issue of pornography. This can be a delicate balancing act; we do not want to normalise porn viewing given there will be those in class who have never seen it. We also cannot be ambivalent or positive in our messaging around porn given the research is too clear on the harms it can do. But, we also don’t want to shame those who have seen it, as this is likely to alienate members of the class. Instead, we should provide a better understanding of the way in which online pornography is pushed by the industry, including the way in which algorithms graduate towards harder content – so-called ‘dark nudges’."
        },
        {
            "text": "Our pupils need non-judgemental support to:"
        },
        {
            "text": "They also need RSHE teaching which helps them to recognise their values about relationships, and how viewing porn may be undermining these."
        }
    ]
}