{
    "url": "https://insidehmcts.blog.gov.uk/2024/08/16/enhancing-witness-suites-transforming-court-spaces-for-better-access-to-justice/",
    "title": "Enhancing witness suites: Transforming court spaces for better access to justice",
    "authors": [
        "Sue James"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "User experience and research"
    ],
    "pub_date": "2024-08-16T11:00:52+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Entering a courtroom can be a daunting experience, especially for those appearing as complainants or witnesses. Ensuring the comfort and safety of some of the most vulnerable people using the courts is crucial to making their experience as tolerable as possible. Recently, witness waiting rooms in 10 court buildings across England and Wales underwent significant improvements, aiming to create a more welcoming environment for those who need to use them. "
        },
        {
            "text": "From repainting to damp-proofing, from installing new carpets and sofas to deep-cleaning, these improvements have turned these spaces into more comfortable environments. "
        },
        {
            "heading": 2,
            "text": "Revitalising Gloucester Crown Court "
        },
        {
            "text": "One notable transformation occurred at Gloucester Crown Court, where damp-proofing, replastering, and a fresh coat of paint revitalised the once drab witness room. The space now radiates warmth and comfort, a testament to the hard work and dedication of the court staff there. "
        },
        {
            "text": "Claire, Delivery Manager at the court, shared insights into the upgrades:  "
        },
        {
            "text": "“Before the work took place the room felt uninviting and lacked facilities to make a drink.  "
        },
        {
            "text": "People working at the court were delighted to hear about the planned improvements. The room was stripped back, damp was addressed, the carpet was replaced and the walls were re-plastered and painted in the calmest blue colour. A new drink station with storage for refreshments and wipeable flooring was created. Old seating was removed and replaced with clean and tidy chairs. Existing pictures were re-hung but told a different story against their new backdrop of freshly painted walls. "
        },
        {
            "text": "All of this work was undertaken with minimal disruption to the running of the court and the project was turned around in swift time. The redecoration has been completed to a very high standard, they look amazing”. "
        },
        {
            "text": "Beyond aesthetics, these improvements enhance access to justice for court users, underscoring our commitment to supporting potentially vulnerable individuals. "
        },
        {
            "heading": 2,
            "text": "Enhancing comfort and safety for all "
        },
        {
            "text": "Bethan Laughlin, Gloucestershire Service Manager for Citizens Advice Witness Service also shared her feedback on the transformation: "
        },
        {
            "text": "“Having the witness room re-decorated has made a huge difference to victims and witnesses. Not only does it look better and is more practical but it demonstrates that we as a system recognise their need for a tranquil and private space to wait during their time in court.  "
        },
        {
            "text": "The redecoration has also made for a much better working environment for my team. Little touches like the flooring in the coffee area has meant we are able to provide a better service to those in need by keeping the environment safe and clean.” "
        },
        {
            "heading": 2,
            "text": "Expanding improvements across England and Wales "
        },
        {
            "text": "Other improvements in this project include consolidating video link rooms at Mold Crown Court to better facilitate pre-recorded evidence recording and installing a new intercom system in Kirklees Magistrates Court. There were fresh coats of paint in Crewe, Truro and Chelmsford and new carpets in Highbury and Winchester. In total, 10 sites have benefited from these upgrades, each contributing to a more supportive and inclusive experience for visitors to our buildings. "
        },
        {
            "text": "By prioritising the needs of vulnerable users, we move closer to ensuring equal access to justice for all. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Gwella ystafelloedd tystion: Trawsnewid mannau llys ar gyfer gwell mynediad at gyfiawnder"
        },
        {
            "text": "Gall mynd i mewn i ystafell llys fod yn brofiad brawychus, yn enwedig i'r rhai sy'n ymddangos fel achwynwyr neu dystion. Mae sicrhau cysur a diogelwch rhai o'r bobl fwyaf agored i niwed sy'n defnyddio'r llysoedd yn hanfodol i wneud eu profiad mor oddefgar â phosibl. Yn ddiweddar, gwnaethpwyd gwelliannau sylweddol i ystafelloedd aros i dystion, mewn 10 adeilad llys ledled Cymru a Lloegr, gyda'r nod o greu amgylchedd mwy croesawgar i'r rhai sydd angen eu defnyddio."
        },
        {
            "text": "O ailbeintio i atal lleithder, o osod carpedi a soffas newydd i lanhau, mae'r gwelliannau hyn wedi troi'r mannau hyn yn amgylcheddau mwy cyfforddus."
        },
        {
            "heading": 2,
            "text": "Adfywio Llys y Goron Caerloyw"
        },
        {
            "text": "Digwyddodd un trawsnewidiad nodedig yn Llys y Goron Caerloyw, lle adfywiodd atal lleithder, ail-blastro, a chôt newydd o baent yr ystafell a oedd unwaith yn ystafell dystion blaen yr olwg. Mae'r man bellach yn creu cynhesrwydd a chysur, sy'n dyst i waith caled ac ymroddiad staff y llys."
        },
        {
            "text": "Rhannodd Claire, Rheolwr Cyflawni yn y llys, yr wybodaeth ddiweddaraf am gynnydd y gwaith:"
        },
        {
            "text": "\"Cyn i'r gwaith ddigwydd nid oedd yr ystafell yn teimlo'n groesawgar ac roedd yn brin o gyfleusterau i wneud diod."
        },
        {
            "text": "Roedd y bobl a oedd yn gweithio yn y llys yn falch iawn o glywed am y gwelliannau arfaethedig. Cafodd yr ystafell ei thynnu’n griau, aethpwyd i'r afael â’r tamprwydd, cafwyd gwared ar y carped ac ail-blastrwyd y waliau a'u paentio yn y lliw glas mwyaf hyfryd. Crëwyd man diodydd newydd gyda storfa ar gyfer lluniaeth a gosodwyd llawr newydd y gellir ei lanhau’n hawdd. Tynnwyd yr hen seddi a'u disodli gyda chadeiriau glân a thaclus. Ail-osodwyd y lluniau presennol ond roeddent yn adrodd stori wahanol yn erbyn cefndir newydd o waliau wedi'u paentio'n ffres."
        },
        {
            "text": "Gwnaed yr holl waith hwn heb fawr o darfu ar y llys a chafodd y prosiect ei wneud yn gyflym. Mae'r ailaddurno wedi ei gwblhau i safon uchel iawn, maen nhw'n edrych yn anhygoel\"."
        },
        {
            "text": "Y tu hwnt i estheteg, mae'r gwelliannau hyn yn gwella mynediad at gyfiawnder i ddefnyddwyr y llys, gan gyfleu ein hymrwymiad i gefnogi unigolion a allai fod yn agored i niwed."
        },
        {
            "heading": 2,
            "text": "Gwella diogelwch a chysur i bawb"
        },
        {
            "text": "Rhannodd Bethan Laughlin, Rheolwr Gwasanaeth yn Swydd Gaerloyw ar gyfer Gwasanaeth Tystion Cyngor ar Bopeth ei hadborth ar y trawsnewidiad:"
        },
        {
            "text": "\"Mae ailaddurno'r ystafell i dystion wedi gwneud gwahaniaeth enfawr i ddioddefwyr a thystion. Nid yn unig y mae'n edrych yn well ac yn fwy ymarferol ond mae'n dangos ein bod ni fel system yn cydnabod eu hangen am fan aros tawel a phreifat yn ystod eu cyfnod yn y llys."
        },
        {
            "text": "Mae'r ailaddurno hefyd wedi gwneud amgylchedd gwaith llawer gwell i'm tîm. Mae pethau fel y lloriau yn yr ardal goffi wedi golygu ein bod yn gallu darparu gwell gwasanaeth i'r rhai mewn angen trwy gadw'r amgylchedd yn ddiogel ac yn lân.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Ehangu’r gwelliannau ar draws Cymru a Lloegr"
        },
        {
            "text": "Mae gwelliannau eraill yn y prosiect hwn yn cynnwys cydgrynhoi ystafelloedd cyswllt fideo yn Llys y Goron Yr Wyddgrug er mwyn hwyluso recordio tystiolaeth a recordiwyd ymlaen llaw yn well a gosod system intercom newydd yn Llys Ynadon Kirklees. Rhoddwyd cotiau ffres o baent yn Crewe, Truro a Chelmsford a gosodwyd carpedi newydd yn Highbury a Chaerwynt. Mae cyfanswm o 10 safle wedi elwa o'r uwchraddiadau hyn, gyda phob un yn cyfrannu at brofiad mwy cefnogol a chynhwysol i ymwelwyr ein hadeiladau."
        },
        {
            "text": "Trwy flaenoriaethu anghenion defnyddwyr sy’n agored i niwed, rydym yn symud yn agosach at sicrhau mynediad cyfartal i gyfiawnder i bawb."
        }
    ]
}