{
    "url": "https://ukhsa.blog.gov.uk/2024/08/16/how-to-stay-healthy-while-wild-swimming/",
    "title": "How to stay healthy while wild swimming",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-08-16T15:59:19+01:00",
    "content": [
        {
            "text": "Swimming is a great form of exercise we can all enjoy, and there are hundreds of beautiful wild swimming sites across the UK to explore. This blog post has essential tips and advice if you're thinking of dipping your feet in the cool water of Britain's beaches, lakes and rivers. Read our tips on reducing your risk of becoming ill after open water swimming."
        },
        {
            "heading": 2,
            "text": "Before you swim"
        },
        {
            "heading": 3,
            "text": "Check water quality by visiting Swimfo before heading to a beach, lake or river"
        },
        {
            "text": "To get the most out of your visit to a beach, lake or river, check out the Environment Agency’s free Swimfo service for the latest information on 451 designated bathing waters across England. Unlike other areas of water, when open water is designated safe to swim in, it means that sources of pollution are being controlled and reduced to make water quality suitable for bathers."
        },
        {
            "text": "On Swimfo, you can search by name or location to look for any incidents or predictions of reduced water quality levels, as well as review whether allocation is classed as excellent, good, sufficient or poor. Annual ratings classify each site based on measurements taken over a period of up to four years."
        },
        {
            "text": "Swimfo also shows water quality sample results. From May to September, more than 7,000 water samples will be taken by the Environment Agency and the results fed into Swimfo."
        },
        {
            "text": "In addition, Swimfo includes a service which lets you know that at some sites, water quality can be temporarily reduced due to factors such as rainfall, wind and high tides. Bathers may be at a higher risk of becoming ill when using a bathing water at this time."
        },
        {
            "heading": 2,
            "text": "While you swim "
        },
        {
            "heading": 3,
            "text": "Protect yourself from exposure to contaminated water "
        },
        {
            "text": "You can reduce the chance of exposure to anything harmful in the water by:"
        },
        {
            "heading": 2,
            "text": "After you swim "
        },
        {
            "heading": 3,
            "text": "Wash well after swimming outdoors"
        },
        {
            "text": "It is important to wash after swimming in open water.  Clean your hands thoroughly with soap and water, especially before eating or handling food. Also, thoroughly clean any cuts and abrasions to the skin. It is also a good idea to wash your wetsuit or swimsuit with care, and wash your hands again after handling the wetsuit. Allow it to dry out thoroughly to stop any bacteria growing in the wet material before you next use it."
        },
        {
            "text": "If you become ill after swimming, with diarrhoea / sickness or other symptoms, seek medical help and let them know that you have been swimming in open water. Don’t go swimming again until at least 48 hours after symptoms have stopped, or you might risk passing on the illness to other people using the water."
        }
    ]
}