{
    "url": "https://cddo.blog.gov.uk/2024/08/16/implementing-the-secure-by-design-approach/",
    "title": "Implementing the Secure by Design approach",
    "authors": [
        "Fotini Tsekmezoglou, Head of Securing Digital Transformation, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Cyber security",
        "Digital transformation"
    ],
    "pub_date": "2024-08-16T10:56:41+01:00",
    "content": [
        {
            "text": "The rollout and implementation of the cross-government Secure by Design approach is well underway. It's great to see departments and arm’s length bodies (ALBs) motoring ahead with its implementation and starting to embed this philosophy across their security practices for digital delivery. You may have recently heard Secure by Design being mentioned in Parliament in the statement and debate about the global Crowdstrike issue. "
        },
        {
            "text": "The implementation of Secure by Design is a multifaceted endeavour. Each government organisation faces unique challenges and opportunities on their journey towards full integration. "
        },
        {
            "text": "As part of the roll-out we have prioritised government organisations into two groups. The first group - with ministerial departments, and arm’s length bodies (ALBs) managing Critical National Infrastructure or Top 75 services - is currently in the preparation and piloting stages of implementation. Meanwhile, the second group, consisting of the remaining ALBs, executive agencies, and treasury-funded regulators, will formally join the rollout from January 2025 (although many are already taking proactive steps)."
        },
        {
            "heading": 3,
            "text": "The importance of the Secure by Design Champions"
        },
        {
            "text": "Central to the successful adoption of the Secure by Design approach are the champions appointed within each organisation. These individuals, nominated by Chief Digital Information Officers and other senior leaders, will play a pivotal role in driving day-to-day implementation. Together with a multidisciplinary working group, they will lead on stakeholder engagement, readiness assessments, developing transition plans and ensuring alignment with overarching strategic goals. "
        },
        {
            "text": "Recently, we’ve focused on supporting champions from the first group by hosting awareness webinars and running kick-off meetings. The kick-off sessions aim to build a mutual understanding of implementation plans and each organisation’s specific context including structure, resources and ongoing cyber security efforts."
        },
        {
            "heading": 3,
            "text": "Key steps and resources for preparing "
        },
        {
            "text": "As we move forward, essential resources - including an implementation guide, preparation checklist and communication toolkit - have been made available at Implementing Secure by Design. These resources will empower organisations to assess their readiness, plan their transition, and communicate effectively with stakeholders. For those government organisations now implementing Secure by Design, here are the immediate actions to prioritise:"
        },
        {
            "heading": 3,
            "text": "Stay tuned"
        },
        {
            "text": "Secure by Design is not merely a cyber security initiative but a transformative approach that enhances digital resilience across government. By embracing this approach, we are poised to elevate our cyber security standards and safeguard critical infrastructure effectively."
        },
        {
            "text": "Stay tuned as we continue to navigate this transformative journey towards a more secure digital future. Together, we can ensure that Secure by Design becomes ingrained in every facet of our digital operations, reinforcing our commitment to cyber resilience. "
        }
    ]
}