{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/08/16/rg-train-ukranian-soldiers/",
    "title": "Royal Gibraltar Regiment help train Ukrainian soldiers",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases",
        "Training"
    ],
    "pub_date": "2024-08-16T12:14:17+01:00",
    "content": [
        {
            "text": "A team of 18 Royal Gibraltar Regiment (RG) soldiers were invited by the Coldstream Guards to help train 116 Ukrainian soldiers in a Basic Infantry Course."
        },
        {
            "text": "The five-week long course was held in the UK and is designed to transform raw recruits into soldiers."
        },
        {
            "text": "Collaborating with British Army Reservists and the Estonian Army, the RG taught Ukrainian soldiers techniques including weapon handling, field craft, medical training and counter explosive ordinance training."
        },
        {
            "text": "The recruits were also taught urban and rural fighting and trench warfare – before the course ended with a live fire phase."
        },
        {
            "text": "The training is part of a British-led multinational military operation to train the Armed Forces of Ukraine (AFU). So far this has led to the training of over 30,000 Ukrainians in the United Kingdom."
        },
        {
            "text": "A spokesperson for the Royal Gibraltar Regiment said: “This collective effort reflects the spirit of international cooperation, knowledge sharing, and professional development, to enhance the capabilities and readiness of the AFU. They were accompanied by the AFU command team who aided in administrating and disciplining the recruits – most of whom had combat experience."
        },
        {
            "text": "Many trainees were already proficient in using rifles, and some were skilled with machine guns, grenades, and shoulder-launched anti-tank capabilities. This expertise was valuable for training purposes. Additionally, some AFU members had received basic medical training in Ukraine and had even applied it during the war.”"
        },
        {
            "text": "However, some trainees had no prior military experience prior to starting the course."
        },
        {
            "text": "The spokesperson added: “As the course progressed, it was incredibly satisfying to witness the transformation in these soldiers. Through rigorous training, discipline, and dedication, they evolved into competent and skilled individuals in just five weeks. The investment in their development had undoubtedly paid off, turning inexperienced recruits into capable soldiers ready to face the challenges ahead. This training provides the AFU with the skills and experience to improve their survivability and lethality on the frontline in Ukraine."
        },
        {
            "text": "“This highlights one of numerous instances where The Royal Gibraltar Regiment has deployed its service personnel throughout the globe. This year alone the Regiment has had service personnel spread across three continents as well as completing their duties in Gibraltar.”"
        }
    ]
}