{
    "url": "https://deframedia.blog.gov.uk/2024/08/16/the-impact-of-the-common-user-charge/",
    "title": "The impact of the Common User Charge",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Borders and trade"
    ],
    "pub_date": "2024-08-16T14:49:40+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "This morning, the Financial Times has reported on the impact of the Common User Charge (CUC) introduced under the Border Target Operating Model (BTOM) on 30 April earlier this year."
        },
        {
            "text": "The import controls introduced by the BTOM are essential to protect national biosecurity and prevent an outbreak of disease that would severely damage the UK’s food supply, the environment, and trade."
        },
        {
            "text": "These important border checks at Sevington are funded by the CUC, which has been designed to minimise impact across all businesses. Every effort has been made to set CUC rates at the lowest possible levels for businesses of all sizes, across all sectors."
        },
        {
            "text": "This approach spreads the costs across the maximum number of imports, keeping charges as low as possible while providing a high level of predictability, and ensuring we only import safe, high-quality products."
        },
        {
            "text": "A major outbreak of plant or animal disease could be far more costly and have a devastating impact on the economy, our natural environment, and on public health."
        },
        {
            "text": "Defra informed traders that CUC invoices would be issued no sooner than 12 weeks from the introduction of the BTOM on 30 April, and had previously outlined to industry the charges and their eligibility criteria to give businesses time to prepare."
        },
        {
            "text": "Traders do not need to submit an import notification on the Import of Products, Animals, Food and Feed System (IPAFFS) for medium risk B and low risk plants and plant products. If traders do submit a notification for these goods, they will be charged the Common User Charge of £29 for each commodity line, up to the limit of five commodity lines per Common Health Entry Document (CHED)."
        },
        {
            "text": "Over the next several months, the impact of the CUC on businesses will be monitored and kept under regular review. Any CUC changes will be reviewed and updated annually."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}