{
    "url": "https://naturalengland.blog.gov.uk/2024/08/16/weve-enabled-thousands-of-homes-in-the-tees-area-and-much-more/",
    "title": "We've enabled thousands of homes in the Tees area - and much more!",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Development",
        "Environment Act",
        "Environmental Improvement Plan",
        "Nutrient Neutrality",
        "Protected sites and species"
    ],
    "pub_date": "2024-08-16T11:45:23+01:00",
    "content": [
        {
            "text": "The Nutrient Mitigation Scheme (NMS) continues with our sixth nutrient credit round now open in the Tees."
        },
        {
            "text": "To date we have offered credits for over 6,000 new homes in the Tees catchment area and have mitigation ready to meet thousands more. We are in a strong position, with credit supplies expected to comfortably meet the demand in the coming rounds. NMS has succeeded as an efficient nutrient mitigation solution for housing developers in the catchment. Its great news that we have solutions in place to accelerate housebuilding and nature recovery in the Tees and we want to work with partners to do that right across the country."
        },
        {
            "text": "But what makes this work special and exciting is the range of benefits provided by working strategically and with partners. The nature benefits include protecting our rivers and the Tees and Cleveland coast and creating wildlife hubs across the farmed landscape. The social and community benefits from new green spaces which once open will reconnect people with nature and the outdoors. And of course, economic by enabling new homes to be built in the area."
        },
        {
            "text": "The headlines often capture the housing story, so here we wanted to share a bit more of the bigger picture. In total we have secured almost 440ha of land for nature recovery in the Tees through NMS. That’s 722 football pitches. What that really means is more space for songbirds, hedgehogs, newts and butterflies to call home."
        },
        {
            "text": "Morden Carr was our first success. This low-grade farmland was ready for its next chapter. The land was purchased by the Durham Wildlife Trust (DWT) for nature recovery. The change in land management by DWT meant Natural England could buy the nutrient credits the site would generate and enable housing."
        },
        {
            "text": "The lowland landscape here was once covered by stunning fenland flora which is now restricted to the small area of SSSI. However, with DWTs ambition to restore the site it will now form part of a wider landscape-scale restoration project with land they already own nearby. This is an exciting example of nature recovery at landscape-scale."
        },
        {
            "text": "It will take time, but once restored to a more natural condition, the site’s benefits are vast. From boosting biodiversity to restoring the peat which captures carbon. From slowing the water which will reduce flooding, to strengthening the SSSI by surrounding it with complementary habitats. All alongside the driving purpose to enable new homes by preventing additional pollution reaching the Tees and Cleveland Coast Estuary. All by working with rather than against natural processes."
        },
        {
            "text": "Our latest milestone was with the Tees Rivers Trust at Galley Law. This site will help increase the mosaic of habitats in the wider landscape and enable housing. Habitat change takes time, and the River’s Trust with the support of local farmers will gradually reduce the nutrient levels in the soil, so it can become a biodiverse wildlife rich space. Their big ambition for the site is to provide an example of Nutrient Mitigation, Biodiversity Net Gain (BNG) habitat creation and local nature recovery for local farms, schools and universities alongside an inclusive biodiverse green space that will benefit the local community."
        },
        {
            "text": "So, 6,000 homes is a lot, but what we have delivered with partners is so much more. And with our scheme now active in Dorset and solutions being secured in Norfolk these benefits will continue to spread. Giving nature space not just to survive but thrive."
        }
    ]
}