{
    "url": "https://traderemedies.blog.gov.uk/2022/04/01/a-year-older-a-year-more-confident/",
    "title": "A year older, a year more confident",
    "authors": [
        "Janey Merrick, Head of HR"
    ],
    "categories": [
        "HR",
        "hybrid working"
    ],
    "pub_date": "2022-04-01T12:48:53+01:00",
    "content": [
        {
            "text": "My LinkedIn pings to remind me it’s been one year since I started work at the TRA. Wow, one year already?"
        },
        {
            "text": "It got me thinking. I was nervous moving to a new organisation after 13 years, a new job, new people, and all virtually.  I needn’t have been worried. I joined a HR team that live our values by being inclusive, expert and working with integrity. I joined an organisation ready to be established as an independent public body; and soon the TRA will be celebrating its own one-year anniversary."
        },
        {
            "text": "There was no settling in period or building up to speed. My first week ended with me holding one-to-one staff consultations as part of the setting up of the TRA as an independent body and the pace has carried on since then. For me, feeling I was contributing so soon was just what I needed."
        },
        {
            "text": "So much has happened in this last year. I have engaged with many of our people. Luckily, they too want to make TRA a great place to work. They are involved in helping our team identify priorities and deliver HR solutions, from working with our (newly created) Staff Voice Forum on ways to build our workplace inclusivity, to facilitating all-staff discussions on hybrid working. I’ve had the opportunity to influence and the autonomy to make decisions and help a start-up public body start to find its identity and mojo."
        },
        {
            "text": "There is still much to do! It isn’t all roses. But as a colleague said to me earlier this week ‘It’s been a great year, let’s hope for many more.’"
        },
        {
            "heading": 2,
            "text": "Join me"
        },
        {
            "text": "If you fancy working for a new small public body where you can build trade remedies expertise in an environment that supports your development, check out our vacancies on Civil Service Jobs."
        }
    ]
}