{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/04/01/calling-for-competition-economists-secondment-opportunities-at-the-cma/",
    "title": "Calling for competition economists: Secondment opportunities at the CMA",
    "authors": [
        "Julie Bon"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2022-04-01T11:59:52+01:00",
    "content": [
        {
            "text": "If you are a competition economist and want to find out more about the CMA and its work, we want to hear from you! We are now launching a new round of secondment opportunities for competition economists."
        },
        {
            "heading": 2,
            "text": "The secondment programme"
        },
        {
            "text": "As a secondee, you will form an integral part of our multi-disciplinary teams just as CMA economists. You will gain hands-on experience in CMA casework which can be with mergers, markets, antitrust investigations and subsidy advice, depending on need and your preference."
        },
        {
            "text": "Taking part in a secondment at the CMA is an unparalleled experience that will add value to private-sector economists’ portfolio of skills. We believe the CMA experience will offer you and your consulting firm a number of benefits, including:"
        },
        {
            "text": "Our secondments last for 6 months with usually 2 intakes annually on a rolling basis. There is flexibility around arranging a start date which would be suitable for both the CMA and your employer."
        },
        {
            "heading": 2,
            "text": "Application details"
        },
        {
            "text": "If this sounds like you, and you have at least 3 years of competition consulting experience and a master’s degree in economics: we’d love to hear from you."
        },
        {
            "text": "Applicants must be based and eligible to work in the UK. If you’re successful, the CMA will contribute a flat rate to the cost of secondees, with further details available on request. We encourage you to discuss with your employer before applying."
        },
        {
            "text": "Firms that would like to put candidates forward should email a full CV and a cover letter for each candidate describing their relevant experience and when they could start, by Monday 9 May 2022 to the contact details set out below."
        },
        {
            "text": "We will only contact successful short-listed candidates for a brief interview for the programme."
        },
        {
            "heading": 3,
            "text": "Contacts"
        },
        {
            "heading": 4,
            "text": "Eugenia Brandimarte"
        },
        {
            "text": "Economics Adviser, eugenia.Brandimarte@cma.gov.uk"
        },
        {
            "heading": 4,
            "text": "Momna Khan"
        },
        {
            "text": "Personal Assistant to the Office of the Chief Economic Adviser, momna.khan@cma.gov.uk"
        },
        {
            "text": "If you have any queries about the secondment programme, please get in touch with either of the contacts listed above."
        }
    ]
}