{
    "url": "https://educationhub.blog.gov.uk/2022/04/how-we-are-supporting-adults-to-secure-a-better-job/",
    "title": "How we are supporting adults to secure a better job",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2022-04-01T10:00:14+01:00",
    "content": [
        {
            "text": "Making sure everyone can upskill or retrain so they can get better paid jobs is a key priority for government."
        },
        {
            "text": "That’s why we are expanding our popular Skills Bootcamps and Free Courses for Jobs training offers this year. Thousands of adults have already benefited from these free training offers to help them get on the path to a rewarding career. "
        },
        {
            "text": "And respondents to a consultation we ran last year that asked for views on these programmes also said they were supportive of these training offers."
        },
        {
            "text": "So, how are these offers equipping adults for the jobs of the future and boosting the supply of skills in sought-after industries?"
        },
        {
            "heading": 3,
            "text": "Skills Bootcamps"
        },
        {
            "text": "Skills Bootcamps are flexible courses of up to 16 weeks, giving people the opportunity to gain sector-specific skills in area including construction, digital, HGV driving and green transport and fast-track to an interview with a local employer."
        },
        {
            "text": "They are developed in partnership with local employers, training providers and local authorities to help fill skills gaps and vacancies in local areas."
        },
        {
            "text": "Rafi Mahmood, from Manchester, was furloughed from his role in financial administration during the COVID-19 pandemic."
        },
        {
            "text": "With some time away from work, the 24 year-old decided to build up his skills in computing – a longstanding hobby – and explore how to make a career move into the tech industry."
        },
        {
            "text": "He successfully applied for a Skills Bootcamp in cyber security, which he says gave him a “strong foundation” in the subject."
        },
        {
            "text": "“The course is designed to put you in a really strong position for employment or an apprenticeship,” he says, noting that he gained a Cyber Security and Network qualification for his CV."
        },
        {
            "text": "After completing the course, Rafi got a job as a Junior Security Operations Centre Analyst, which he is doing alongside a Cyber Security Technologist apprenticeship."
        },
        {
            "text": "And he credits his Skills Bootcamp for giving him the “boost” he needed to pursue a new career and get on the path to a more rewarding job."
        },
        {
            "text": "So that even more adults can get the skills they need for good jobs we are investing up to £150 million in 2022/23. This includes providing up to £70 million to Mayoral Combined Authorities and the Greater London Authority so they can offer more local Skills Bootcamps – creating up to 20,000 places across the country."
        },
        {
            "heading": 3,
            "text": "Free Course for Jobs "
        },
        {
            "text": "Our Free Courses for Jobs programme gives adults aged 19 or over without a full qualification at Level 3 (equivalent to an advanced technical certificate or diploma, or A levels) access to over 400 qualifications free of charge."
        },
        {
            "text": "Courses are available in subjects ranging from engineering and construction to adult care and digital, allowing adults to access better job opportunities."
        },
        {
            "text": "For Vernetta Clarke, taking a free Level 3 qualification helped her to invest in her career and learn to be a leader, after losing two jobs."
        },
        {
            "text": "After 19 years in the hospitality industry, the 37-year-old was made redundant in December 2019."
        },
        {
            "text": "Following a brief stint with a temp agency, she finally landed a role that she enjoyed, as a sales executive in the conferences and events team at a local hotel. But three weeks later, after lockdown arrived, she lost the job. She was recently pregnant."
        },
        {
            "text": "“I thought, ‘Oh my gosh, I’m pregnant and unemployed, what am I going to do?’”, Vernetta says."
        },
        {
            "text": "Then Vernetta’s sister told her about a free Level 3 qualification in leadership and management at Weston College."
        },
        {
            "text": "Now Vernetta, who secured a new job in the hospitality industry last autumn, has a recognised qualification that proves she is ready to advance to managerial and leadership positions."
        },
        {
            "text": "It is also recognised by employers across multiple industries – giving her the option to move sectors in future if she chooses."
        },
        {
            "text": "As of today (1 April 2022) we are expanding eligibility for this offer, so that anyone who earns below the National Living Wage annually (£18,525, equivalent to £9.50 per hour for a 37.5 hour week) or is unemployed is now able to boost their skills or retrain for free. This is regardless of any prior qualifications you may have."
        },
        {
            "text": "Depending on your local area, you may still be eligible even if you earn slightly more than this, you may still be eligible. If unsure, you can check with local training providers."
        },
        {
            "heading": 3,
            "text": "How to get training"
        },
        {
            "text": "You can find more information on how to access these free training programmes and more on our Skills for Life page."
        }
    ]
}