{
    "url": "https://marinedevelopments.blog.gov.uk/2022/04/01/i-vms-behind-the-scenes/",
    "title": "I-VMS:  Behind the Scenes",
    "authors": [
        "Sean Douglas, Head of Enforcement, Intelligence and Investigations"
    ],
    "categories": [
        "Coastal",
        "I-VMS",
        "Uncategorized"
    ],
    "pub_date": "2022-04-01T10:27:00+01:00",
    "content": [
        {
            "text": "Since the launch of the I-VMS project in February, we have been working hard to listen to any concerns fishers may have and doing all we can to answer their questions. I’d like to thank everyone for their contributions, which have helped us put in place the level of help and support fishers have told us that they need. Everything from how to choose, buy and install an onboard device to helping navigate the grants application process. (More helpful advice can be found on our frequently asked questions page)"
        },
        {
            "text": "It’s great to see more and more fishers get in touch with our Grants and I-VMS Engagement and Support Teams to begin the process, and we’ve seen vessels of varying sizes within the under 12m inshore fleet already have their preferred devices installed.  We have four, phased tranches throughout the year, to allow time for first the 8m – 11.99m vessels and then later the 6m-7.99 followed by below 6m vessels to get their onboard equipment fitted and ready to transmit by the end of the year."
        },
        {
            "text": "We’ve begun to see the first data arrive to the I-VMS Hub as test transmissions, which is very encouraging. These initial test ‘pings’ are part of the grant process and won’t be used for any other purpose than to confirm devices are operationally ready for full transmission to I-VMS Hub when it becomes a legal requirement at the end of the year."
        },
        {
            "text": "In our National Operations Room, our data collection and analysis teams - following very strict data protection guidelines – will be able to use the information provided by fishers from individual vessels through I-VMS technology, to help map out the future of the English inshore fleet."
        },
        {
            "text": "It’s the first time anyone has been able to gather this level and breadth of information, and we’ll use it to create better understanding and appreciation within Government and partner agencies, of the vital role inshore fishers play in the local, regional and national economy and promote and protect their individual and collective interests."
        },
        {
            "text": "The I-VMS data will help us to identify exactly what fishing activity is taking place and where, and will also help provide fishers with documented evidence of their catch to help with future quota, grant applications and business plans."
        },
        {
            "text": "We know there are concerns from fishers around overcrowding in our seas who say they have to navigate other vessels, marine protected spaces and renewable energy infrastructure on a daily basis. The information we receive from I-VMS will help us feedback where fishing can be done sustainably and give fishers the ability to make informed choices on where they choose to fish."
        },
        {
            "text": "We are at the beginning of the I-VMS project, and with the continued help and support of all our fishers we can work in partnership to ensure we are Improving Fishing Together."
        },
        {
            "text": "Please talk to us if you need any additional support of help with the application process.  We can be reached by telephone: 0330 041 6579 or email:UKFisheriesSupport@marinemanagement.org.uk"
        },
        {
            "text": " "
        }
    ]
}