{
    "url": "https://ruralpayments.blog.gov.uk/2022/04/01/introducing-you-to-2/",
    "title": "Introducing you to…",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Introducing You To"
    ],
    "pub_date": "2022-04-01T12:03:25+01:00",
    "content": [
        {
            "text": "My name is Jacki and I work in the RPA Customer Service Centre. I’m based in Cumbria and I answer customers’ queries on the Countryside Stewardship, Environmental Stewardship and Sustainable Farming helpline. In the past I’ve also covered the Rural Payments helpline and British Cattle Movement System (BCMS)."
        },
        {
            "text": "As part of my role, I help customers complete their application/claim forms online or by paper. I can tell them how far an application/claim is progressing. I sometimes arrange a call back from the operational team if I can’t answer their query. I really hope the customer goes away feeling that a call to us has been worthwhile and they’re happy with the service we’ve given them. We quite often have a chat as well about the weather and family life – it really makes you connect with your customer more when you feel at ease."
        },
        {
            "text": "I also take an active role in helping customers to self-serve as we’ve moved to more digital services. I advise them on how to do this from the initial RPA identification check, through to them creating and establishing their business within the Rural payments Service, guiding them through the applications and claims they may need to complete."
        },
        {
            "text": "My typical day has changed in last nine months as I’ve been delivering virtual training to helpline colleagues the length and breadth of the country to help us to provide a better service to customers who ring the helpline. It has also been great to share my knowledge by way of hints and tips on the work areas of the Customer Service Centre.  I recently had a workbook published within RPA for the Customer Service Centre operatives on how to guide a customer through a Sustainable Farming Incentive (SFI) application."
        },
        {
            "text": " I feel I bring a lot of experience to my current role. I started my working career as a Policewoman many years ago in Workington. I also worked in an accountant’s office for four years and moved to work in what was one of our local breweries in the accounts office. From there I went to work for the DSS in the benefits fraud department, then moved over to the Job Centre before joining the RPA in 1998, when we were known as the Ministry of Agriculture, Fisheries and Food (MAFF)."
        },
        {
            "text": "Outside work my passion is baking cakes (though these usually end up in the office for the team). I’m also a keen gardener and provide a lot of hanging baskets outside a restaurant in our town. The hanging basket side has developed into me doing a lot for other places as well and it gets very busy when you’re growing the plants from seeds."
        },
        {
            "text": "I have a 37-year-old daughter and two sons aged 34 and 29. Even though they’re all now adults, I do wonder as they keep bouncing back (usually for a loan). It’s not true when they say things get easier as they get older! I also have a 17-year-old grandson who is now doing a joinery apprenticeship and a 14-year-old, very laid back, granddaughter. At home there is my husband and Archie, our Cocker Spaniel, who is totally spoilt."
        },
        {
            "text": "My dad instilled two things in me. ‘It costs nothing to have manners,’ which thankfully my children and grandchildren also abide by. And the second thing is to travel as much as you can as you only live once and it’s a fantastic world out there."
        },
        {
            "text": " "
        }
    ]
}