{
    "url": "https://insolvencyservice.blog.gov.uk/2022/04/01/life-as-a-senior-coordinator-in-the-official-receiver-services/",
    "title": "Life as a Senior Coordinator in the Official Receiver Services",
    "authors": [
        "Rukhi Arshad"
    ],
    "categories": [
        "Official Receiver Services",
        "People and culture",
        "Working for the Insolvency Service"
    ],
    "pub_date": "2022-04-01T13:26:36+00:00",
    "content": [
        {
            "text": "I’m Rukhi, and I’m a Senior Coordinator in Official Receiver Services here at the Insolvency Service. I joined the Civil Service over 25 years ago and what appealed to me about being a civil servant was the desire to make a difference and provide a good public service."
        },
        {
            "heading": 2,
            "text": "Starting out as an insolvency Case Officer"
        },
        {
            "text": "Before I joined the Insolvency Service, I worked in retail. But I knew I wanted to stretch myself and I was attracted to applying for the role of Case Officer because I knew I had the right skills and lots of customer service experience."
        },
        {
            "text": "As an insolvency case officer I administer bankruptcy and liquidation cases from start to finish, which includes communicating with creditors, third parties and realising assets for the benefit of creditors for divided purposes."
        },
        {
            "text": "I was delighted when I was offered the post and my first role was as a cashier dealing with monies moving in and out of bankrupts’ estates. Within a year, I became an administrative officer who administered bankruptcy and company cases."
        },
        {
            "heading": 2,
            "text": "Investing in people"
        },
        {
            "text": "I always had terrific support from my seniors, from Official Receivers to managers, and every bit of training was available to me. I received face-to-face training on all aspects of the Case Officer role, which included how to deal with insolvency assets and court work."
        },
        {
            "text": "But after 5 years, I changed direction from an administrative officer to an office manager. This was an enjoyable time for me, and I was keen to encourage my own staff to develop themselves. Within a year, all the members of my original team had been promoted."
        },
        {
            "text": "It was lovely for me to offer the same encouragement and opportunities my managers had given me.  Soon after, I started managing office managers and supported them as well as guided them on conduct and management attendance issues."
        },
        {
            "heading": 2,
            "text": "Life as a Senior Coordinator"
        },
        {
            "text": "My current role as a Senior Coordinator gives me the greatest satisfaction. I have been in this role for last 8 years and it means I support and work alongside the Official Receiver on important issues, circulating key messages from the business or senior leaders, as well as running recruitment campaigns and coordinating training and development opportunities.  I love the unpredictability of what is going to land in your inbox, and my skills are stretched in so many different directions. I welcome this because I love the challenge of doing well in all areas of my work."
        },
        {
            "text": "I am also a Capability Champion and take a lead in promoting development and training across all Insolvency Service’s offices. Civil Service Learning and the Insolvency Service Investigator Programme are the key training tools that are available to staff."
        },
        {
            "text": "The Insolvency Service also offers further opportunities for administrative staff to explore other areas of the agency and give them a chance to excel, such as the Administrative Development Discovery Learning scheme. This scheme is designed to inform, inspire and enable administrative grades to identify and explore different career aspirations either within the agency or elsewhere."
        },
        {
            "heading": 2,
            "text": "My caring responsibilities"
        },
        {
            "text": "The chance to work for the Insolvency Service which offers flexible working hours was an attractive offer. It meant I was able to balance my work life with my family life and as the years passed it became a major factor in being able to care for my parents."
        },
        {
            "text": "I was a carer for my late parents who were elderly and had chronic illnesses. I was given the opportunity to work from home and balance my caring responsibilities alongside my day job. It was important to me that I had supportive managers, and I will always be thankful to them for that."
        },
        {
            "heading": 2,
            "text": "Chairing one of our People Networks"
        },
        {
            "text": "I am also the Chair of one of the agency's people networks called FACES (Fairness, Awareness, Culture, Equality, Support), which is our Black Asian Minority Ethnic network. It’s a role I’m very passionate about. Joining the network gave me the opportunity to support and guide a fellow colleague, who was also from a Pakistani background, which lead me to become Chair of the network for 2022."
        },
        {
            "heading": 2,
            "text": "The holy month of Ramadan"
        },
        {
            "text": "The holy month of Ramadan begins on 2 April 2022. Ramadan is an Islamic festival which is observed by Muslims around the world. Those who observe fasting means they will not be able to consume food or water during daylight hours."
        },
        {
            "text": "Whilst some Muslim colleagues may seek to take time off work during Ramadan, some will continue to work, like myself. The agency understands the challenges during Ramadan and provides support by accommodating flexible working and being respectful of colleagues who need to take breaks for prayer times. Prayer rooms or space for praying are also available across our offices."
        },
        {
            "text": "I enjoy every aspect of my job, and the Insolvency Service is really a great place to work. It’s diverse, it’s flexible, it’s fair, and it offers so many opportunities to try different things such as being champions and leading networks. But most importantly, for me, it’s a friendly and professional organisation that warmly welcomes new starters and encourages everyone to succeed."
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}