{
    "url": "https://companieshouse.blog.gov.uk/2022/04/01/mental-health-for-small-businesses-why-its-time-to-talk-and-time-to-act/",
    "title": "Mental health for small businesses: why it’s time to talk and time to act",
    "authors": [
        "Adrian Wakeling - Senior Policy Adviser at Acas"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2022-04-01T11:00:17+01:00",
    "content": [
        {
            "text": "Starting a business for the first time can be both exciting and nerve-racking. There’s a lot to do – getting your plans, finances and paperwork in place. If the mental health of your staff crops up as an issue, it might be under the heading ‘we can sort that one out as we go along’."
        },
        {
            "text": "This is not such a bad approach, as small businesses can often nurture a close-knit environment in which people are more open than they might be in a large organisation."
        },
        {
            "text": "But why leave it to chance? A recent Acas YouGov poll has shown that over a third (35%) of British employers have not spoken to their staff about mental health and wellbeing over the past year."
        },
        {
            "text": "New Acas advice highlights the link between positive mental wellbeing and:"
        },
        {
            "text": "Acas has been talking to small businesses and SME stakeholders, like the Federation of Small Businesses. At a roundtable we held, we aimed to answer the following questions:"
        },
        {
            "heading": 2,
            "text": "What do you want?"
        },
        {
            "text": "Stress is always near the top of the ‘reasons for being absent’ chart. The latest CIPD ‘health and Wellbeing Survey’ found stress at number 3 in the causes of long-term absence."
        },
        {
            "text": "With the Royal College of Psychiatry likening the impact of the pandemic to a tsunami, it makes sense to have managers who are comfortable talking about mental health, senior managers who lead by example and, above all, a plan of action. Keeping staff at work or, if they are off, returning as quickly as possible, is the primary objective."
        },
        {
            "heading": 2,
            "text": "Why do you want it?"
        },
        {
            "text": "Stress negatively impacts productivity and levels of motivation. It makes business as well as people sense to tackle the causes of stress. Common causes are workload, poorly managed change and lack of support."
        },
        {
            "text": "We want all staff to be able to bring their whole selves to work. Managers that know their staff and can listen will gain more trust and get better engagement levels. And let’s remember, we’re all getting behind this issue. The government review of mental health set out a vision for good jobs for all by 2027. It will not happen overnight, but you can build a better workplace by putting mental health at the heart of all your business decisions."
        },
        {
            "heading": 2,
            "text": "How do you get it?"
        },
        {
            "text": "It’s tough to generalise with mental health because we all have a unique set of circumstances and experiences. But from an employer point of view, it makes sense to know your sector. For example, the challenges have been very different for those on the front line in the catering and care sectors. A risk assessment can tell you how your workplace is fairing."
        },
        {
            "text": "Wellbeing Action Plans can help provide structured support to staff, but why not stop and ask yourself – ‘if my business was a person, how well would I say they were?’"
        },
        {
            "text": "The signs of a healthy workplace include:"
        },
        {
            "text": "My top 3 tips for better mental health at work are:"
        },
        {
            "heading": 2,
            "text": "1. Know your staff"
        },
        {
            "text": "Listen, involve, feedback, listen again and keep reviewing. Managers are not supposed to be counsellors so it’s worth remembering where that line is between good people skills and professional medical or therapeutic help. You can invest in training for line managers and make sure you know where to signpost for specialist help."
        },
        {
            "heading": 2,
            "text": "2. Know yourself"
        },
        {
            "text": "Self-care is not selfish. It leads to better decision making and more capacity to support staff. If there has been one tiny silver lining to the pandemic, it’s that we have all had to work on our personal coping strategies. Whether it’s going for a walk, practising mindfulness or just being open when you are struggling, if it helps, do it! We all need to become more literate in the language of mental health."
        },
        {
            "heading": 2,
            "text": "3. Know the law"
        },
        {
            "text": "All employers have a duty of care to look after the health and wellbeing of their staff. The Health and Safety Executive have some useful tool kits for assessing risk in your workplace."
        },
        {
            "text": "Mental health may be classed as a disability. Consider workplace adjustments for staff who are struggling – go beyond the law! Some form of flexible working is the most common way of helping staff stay in work or return. As well as thinking about when and where people work, pay attention to ‘how’ they work – so things like channels of communication, levels of job autonomy and how agile or otherwise decision-making processes are."
        }
    ]
}