{
    "url": "https://dluhcdigital.blog.gov.uk/2022/04/01/reflections-on-my-time-as-the-head-of-local-digital/",
    "title": "Reflections on my time as the Head of Local Digital",
    "authors": [
        "May-N Leow"
    ],
    "categories": [
        "Cyber",
        "Digital Planning",
        "Local Digital",
        "Local Digital Declaration",
        "Local Digital Fund",
        "Local Digital Team"
    ],
    "pub_date": "2022-04-01T15:39:32+01:00",
    "content": [
        {
            "text": "May-N presenting at an event for local government"
        },
        {
            "text": "This week brings to a close my two and a half years as Head of the Local Digital Collaboration Unit (LDCU). In this blog post, I want to reflect back on the lessons learnt and achievements, such as bringing local authorities together to solve common challenges, and in particular how a group of local authorities and suppliers are cooperating together to deliver an open source solution."
        },
        {
            "heading": 2,
            "text": "Call to action"
        },
        {
            "text": "I was working in Southwark Council when LDCU launched the Local Digital Declaration in July 2018. Other local government leaders and I were inspired by the camaraderie and call to action, and the Declaration launched with 44 co-publishers, including Southwark Council."
        },
        {
            "text": "The Declaration put in one place the pathway to great digital services and the principles that were needed, and it helped build credibility and permission for change in the council. On a personal level, being able to connect with a growing community of like-minded people made the hard and often lonely work of change a much more positive experience."
        },
        {
            "text": "Although the Declaration was the centrepiece of the movement, it was the Local Digital Fund that gave us the opportunity to address common challenges and we kicked of two Local Digital projects:"
        },
        {
            "heading": 2,
            "text": "Collaboration, sharing and reuse"
        },
        {
            "text": "It was the ability to make such projects happen for local authorities that drew me to join LDCU in 2019."
        },
        {
            "text": "Three years into the Fund, more than 100 councils on 44 projects have built, or are building, sharing and re-using common tools, products and standards. The Fund has shown that if the main barriers of collaboration are removed (such as funding) and collaboration is incentivised, then local authorities can and will come together to solve common issues."
        },
        {
            "text": "A great example of this is the LocalGov Drupal project, currently in beta, that can now count 24 councils and 8 suppliers among its growing community. The project has built a reusable council website codebase that can be set up in days instead of months."
        },
        {
            "text": "The LocalGov Drupal project is also redefining how local authorities can partner with suppliers to deliver open source solutions with a business and operating model that gives councils ownership of what is developed, but leverages suppliers to offer different levels of platform hosting and service. The approach is based on sociocracy working groups and platform co-op governance. These are not new, but are not often used in local government and it’s exciting to see such shared ownership approaches being tested."
        },
        {
            "text": "Focusing on common challenges rather than location, and collaborating with a minimum of three councils per project, allowed local authorities that have never worked together before to collaborate on problems that were a priority for them. This also drove the development of solutions that catered for different population sizes, demographics and service profiles, as the Housing Repairs project demonstrates in the image below."
        },
        {
            "text": "Diagram showing different demographics such as population, percentage of social housing and number of repairs reported for Southwark, Gravesham, Lincoln and Lewisham Councils. Source: Housing Repairs discovery presentation 2019."
        },
        {
            "heading": 2,
            "text": "Supporting the funded projects"
        },
        {
            "text": "In addition to funding, we have a dedicated team to support the projects. The LDCU team consists of:"
        },
        {
            "text": "Having dedicated support has been one of the most successful ingredients of the Fund, and our projects have told us how much this has helped—particularly to gain permission to work in the open, which is not common in local government."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "The majority of our projects are now in their beta phase. Together, we are exploring the question of how to scale products nationally and the route to long term sustainability."
        },
        {
            "text": "We have also shared the exciting news of our next phase, which will be even more ambitious and provide even greater support for local authorities. Join us at our upcoming roadshows to help shape what comes next."
        },
        {
            "text": "In this final week, I’ve had mixed emotions as I move to my new role as DLUHC’s Digital Planning Head of Product. I’m leaving a team that is made up of the nicest people I’ve ever worked with and I’m super proud of what we have achieved together, including rapidly responding to support local authorities during the COVID-19 pandemic, and successfully bidding for £85m funding for the programme. I know the team will continue to thrive as we all share the same passion for improving local government services."
        },
        {
            "text": "I am taking the Local Digital collaborative approach to our Digital Planning programme and we’re already co-creating and learning from local authorities with our funded pathfinders to modernise planning software and increase citizen engagement in planning. So this isn’t a goodbye, as I’ll continue to be part of the local government digital community, but more of a hello to the local government planning community!"
        }
    ]
}