{
    "url": "https://defencedigital.blog.gov.uk/2022/04/01/strategy-to-execution-series-delivering-the-data-foundation-pan-defence/",
    "title": "Strategy to Execution Series - Delivering the Data Foundation Pan-Defence",
    "authors": [
        "JP Bhamu"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2022-04-01T15:07:30+01:00",
    "content": [
        {
            "text": "Welcome to the first in our series of blogs exploring delivery of the Data Strategy for Defence in our Pan-Defence environment. "
        },
        {
            "text": "Since the Data Strategy for Defence was published last September there has been a clear shift change in how Defence is thinking about and using data. JP Bhamu, Head of Data Management, Governance and Capability Development within the Defence Data Office, discusses in this blog what his team has been delivering to support this. "
        },
        {
            "text": "The Data strategy for Defence spells out a very clear vision for data that all Defence organisations are committed to deliver upon, and our teams in the Defence Data Office (DDO) have a functional mandate on data to enable interoperability, sharing and its fullest exploitation, Pan-Defence.  "
        },
        {
            "text": "Caroline Bellamy, our Chief Data Officer (CDO), calls my division the data heartland, and rightly so, as my division plays a significant role in delivering the functional mandate on Data that translates the strategy into a plan that is already delivering real change."
        },
        {
            "text": "We have aligned our outcomes under three strands (1) full life-cycle management of data, (2) its pan-Defence governance and (3) building a data savvy workforce that can exploit and unleash the power inherent in data. "
        },
        {
            "heading": 2,
            "text": "Full life-cycle management of data"
        },
        {
            "text": "Our plan looks long-term to enable the interoperability and sharing of curated and trusted data, where permissible, across Defence, our partners and allies. Having trusted data enables our leaders to make evidence-based decisions and provides us with the knowledge and confidence that allows efficient and effective operations."
        },
        {
            "text": "Working with Pan-Defence organisations, in the first instance, our team is driving forward the development of a Data Estate Map.  This is a view of Defence's data landscape, encompassing the cataloguing and curation of key data, along with policies and principles required to turn siloed data into 'trusted' pan-defence data."
        },
        {
            "text": "In short, this will enable trusted data to be seamlessly and securely available to all when needed."
        },
        {
            "text": "The significant benefits are endless such as - expedited sharing of trusted data, better exploitation of data, cost savings, improved efficiency and a further reduction of the information risk."
        },
        {
            "heading": 2,
            "text": "Data Governance "
        },
        {
            "text": "Our goal is to ensure “Data investments are governed consistently and coherently”. Standardisation, re-use and business efficiency are all met when taking a holistic approach to governance."
        },
        {
            "text": "With this goal in mind, our team has established a governance board, that I chair,called the Delivery Group on Data (DGoD).  Its members include CDOs, Chief Data Information Officers (CDIOs) and other data leaders from across our Defence organisations. The DGoD members work together to identify opportunities, prioritiseand resource activity that delivers benefit Defence wide."
        },
        {
            "text": "By setting and delivering on our Defence data priorities, the DGoD has created a gold standard in fostering a culture of co-delivery and co-creation of frameworks, processes and solutions across Defence. "
        },
        {
            "text": "This ensures that data investments across Defence are striving for consistency and coherence – resulting into cost saving, reuse and speed of delivery."
        },
        {
            "heading": 2,
            "text": "Capability Development"
        },
        {
            "text": "Within Capability Development we are focusing on both positioning Defence as an employer of choice for Data professionals and enabling a data savvy workforce that can exploit and unleash the power inherent in data. "
        },
        {
            "text": "Working with the defence wide skills network we are currently designing a framework that will clearly define data roles and the skills that are required to uplift Defence’s data maturity. It will provide a clear pathway for progression and map available training to deliver the skills needed for a fully data fit business. ​​​ Leveraging pan Defence training investments will ensure that any training demands are met with efficiency and represent value for the business."
        },
        {
            "text": "Our goal is to enable and empower Defence leadership - both military and civilian, to think about data and ask the right questions while making decisions on any large procurement, change program and/or transformation initiative."
        },
        {
            "heading": 2,
            "text": "What’s been delivered so far? "
        },
        {
            "text": "We are already working with multiple partners within the Defence Organisations and have delivered:"
        },
        {
            "text": "In the next edition of our Strategy to Execution series, we’ll talk in more depth about some of these initiatives mentioned today and our plans for the future."
        }
    ]
}