{
    "url": "https://mojdigital.blog.gov.uk/2022/04/01/we-have-a-lot-of-work-to-do/",
    "title": "We have a lot of work to do!",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "a great place to work",
        "Data",
        "our users",
        "strategy",
        "Women in Tech"
    ],
    "pub_date": "2022-04-01T17:06:05+01:00",
    "content": [
        {
            "text": "Recently, my leadership team and I made a commitment to spend more time understanding our users and their context. To that end I spent time this week with colleagues at the Legal Aid Agency (LAA) to better understand what their day to day looks and feels like, and how we help or hinder that through the services we provide. I also heard from users from many other parts of our organisation as I travelled almost the length of the country (so many hours on trains!) launching our 2025 strategy."
        },
        {
            "text": "I’d like to share my key reflections."
        },
        {
            "text": "We need our legacy technology to work better. Our colleagues in the LAA and third party providers are completely reliant on our complex, monolithic, legacy technology in order to provide legal aid."
        },
        {
            "text": "While we are working hard on building modern, fit for purpose digital services for our users, we absolutely can’t pull all of our focus from the systems they have to use today. Not just to keep those services running or to update them when legislation changes, but to make them as good as they can be for our users as long as they have to use them."
        },
        {
            "text": "In the past 12 months we have made significant improvements to the core system that the LAA uses which has absolutely had a positive impact for our users. These changes include speeding up batch processing by over 90%, moving services to the cloud and making simple changes to functionality. All of this has added up to a system that is more resilient, faster and less frustrating for our users enabling them to work faster and smarter."
        },
        {
            "text": "The basics are really important to our colleagues. Whether I was talking to caseworkers, prison officers, or probation colleagues, a large part of their focus was on basic infrastructure and end user services working effectively."
        },
        {
            "text": "We and I probably spend a lot of time thinking and talking about the new software services we are building, but a lot of the feedback, both positive and negative, was around the basics."
        },
        {
            "text": "Having kit that works, improved and reliable WiFi, a responsive service desk with multiple channels to engage through, and a service catalogue that allows people to get the replacements and peripherals they need quickly and easily are key to having happy and productive users."
        },
        {
            "text": "Our colleagues collect, analyse and interpret vast amounts of data to make hundreds of decisions every day. The rules that we must apply to assess legal aid applications are complex and need a lot of data from many different sources in order to inform the right decision, and our current technology landscape makes this harder than it should be."
        },
        {
            "text": "Data is one of the strands of our strategy but its importance was reinforced as I watched a caseworker call up and scroll through pdf versions of documents to find particular bits of data that we have available digitally in a different part of our organisation - how frustrating! And again when I learned of the (many and manual) steps a colleague needs to take to get basic reporting for our contact centre, because the current set up doesn’t cater for their needs."
        },
        {
            "text": "Overall I am ending the week with two thoughts. The strategy that we now have in place is the right one and can and will make a material difference to users of justice services. And we have a lot of work to do to implement it, but implement it we will. And as we do we will continue to work closely with and learn from our colleagues and users, and continue to update you on our progress."
        }
    ]
}