{
    "url": "https://defencedigital.blog.gov.uk/2022/01/13/5g-just-a-faster-4g-and-other-misconceptions/",
    "title": "5G- Just a 'faster 4G’ and other misconceptions",
    "authors": [
        "Ben Parish"
    ],
    "categories": [
        "Digital Innovation"
    ],
    "pub_date": "2022-01-13T15:36:41+00:00",
    "content": [
        {
            "text": "First things first, I think we have a little way to go to break from the misconception that 5G is \"just a 'faster' 4G\" - this misrepresentation hinders the vision of what can be achieved."
        },
        {
            "text": "TV ads that pitch 5G at the consumer don't help the situation of misunderstanding; the true benefit of 5G technology is in the enterprise, less so with the consumer."
        },
        {
            "text": "The internet is not short of articles extoling the potential of 5G networks to deliver huge business advantage across a range of sectors."
        },
        {
            "text": "We are familiar with the known characteristics of 5G networks that provide high data rates (Enhanced Mobile Broadband (EMBB)), the ability to connect a huge number of devices (Massive Machine Type Communications (MMTC)) and provide Ultra-Reliable, Low Latency Communications (URLLC)."
        },
        {
            "text": "I'm fortunate enough to have the opportunity to explore 5G-enabled concepts for Defence. I've seen private 5G networks in action & I've spoken with many suppliers building and creating innovative solutions upon 5G enabled architectures and ecosystems."
        },
        {
            "text": "I believe there is transformative potential in 5G technologies and here are some of my thoughts in the first of what may become several blogs on our 5G journey."
        },
        {
            "text": "I'm excited that across Defence there are pockets of activity starting to experiment with 5G networks and associated digital technology innovation.We are on a journey shared by other sectors and organisations to understand the scale of potential transformation and the path to reach it."
        },
        {
            "text": "However,  like many other sectors there is an inevitable challenge around fundamentally rethinking some of our traditional activities and capabilities in light of new technology options."
        },
        {
            "text": "This shouldn't be about fitting new technology to existing activities - it should be about re-casting our views on which new outcomes can be achieved using new technology."
        },
        {
            "text": "This will require experimentation, testing of hypotheses, maybe failing, pivoting and progressing."
        },
        {
            "text": "We need to be savvy about the way we explore the opportunities - there is capital investment required to deliver new architectures of 5G networks and associated innovations, so the return on investment needs to be understood to drive investment decisions. We need direct line of sight between our digital ambition and cost-benefit to underpin the future busines case."
        },
        {
            "text": "In Defence Digital's Innovation Team we have identified and gathered a proactive community starting to experiment with 5G technology concepts across Defence."
        },
        {
            "text": "We lead the Pan-Defence 5G Technology Working Group which is the primary forum for 5G technology discussions in Defence and I’m really thankful to all those that enthusiastically participate."
        },
        {
            "text": "We are also working with colleagues across government to learn from other sectors and investments in 5G technology trials and testbeds. This helps us with investigating and defining new capability concepts within other Defence transformation initiatives – from logistics to medical services."
        },
        {
            "text": "We are sharing insights with our international Defence Allies along the way."
        },
        {
            "text": "The power of mobile edge computing (perhaps described in terms of Internet of Things (IOT)) is brought to life with 5G wireless enablers. It is this computing environment and the data-driven-capabilities and insights that will enable the transformation we desire."
        },
        {
            "text": "As we continue to explore the use cases that will eventually be enabled by 5G wireless architectures, I expect us to be experimenting with a range of technologies and innovations in scope both within the network architecture and the edge compute devices."
        },
        {
            "text": "The hype around 5G probably isn't really about 5G itself; it's about the rest of the innovation that we can layer up and connect with the 5G foundations. This combinational innovation, across a range of potential Defence use cases excites me, as there is plenty to do it this space."
        }
    ]
}