{
    "url": "https://dragonsden.blog.gov.uk/2022/01/13/dragons-den-episode-2-series-19/",
    "title": "Dragons' Den, Episode 2, Series 19",
    "authors": [
        "Laurien Webb"
    ],
    "categories": [
        "Confidentiality",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-01-13T21:19:38+00:00",
    "content": [
        {
            "text": "From eco-friendly paint trays to sustainable beauty products and at home puddle patches for your pooches, there was a vast range of products in the Den this evening. But there were two pitches that really caught my eye."
        },
        {
            "text": "If you’re anything like me, I can often overindulge at Christmas. It’s my favourite time of year. I spend most of December playing Christmas songs on repeat, getting my children as excited as they possibly can be, and everything just seems that much louder. The laughing, the music, the counting down until end of term and my out of office is switched on just in time for my children to return home to enjoy the festive period. By the time that’s done though, the break goes by in a flash and I’m left feeling in need of some rest and relaxation or some valuable me time."
        },
        {
            "heading": 3,
            "text": "Brown paper packaging…"
        },
        {
            "text": "That’s why James and Diana’s luxurious at home spa experience caught my eye. With current restrictions in place, it’s been difficult to plan ahead to visit my local spa, so an at home spa experience already had me enthused."
        },
        {
            "text": "First up to inspect the product was Peter Jones who seemed to be impressed with James’s product development background but unfortunately not the product itself."
        },
        {
            "text": "Whilst the emphasis from the pair was on sustainable packaging Peter was left unimpressed by the biodegradable bottle, that was decaying in his hands."
        },
        {
            "text": "This left me wondering whether it would be something I would be bothered about as a paying customer, of course I support anything that is sustainable and environmentally friendly!"
        },
        {
            "text": "Deborah Meaden, the Dens most ardent environmentalist was certainly inclined to green light their branding and stated that she is fed up with brown paper packing, and I can’t say I blame her."
        },
        {
            "text": "Branding is so important. It can influence the way that your customer perceives you when they hear or think of your company name, service, or product. This includes everything they think they know about your brand, including information, your packaging, but also emotive elements, like for example, the impression that it’s luxurious."
        },
        {
            "text": "You can register your trade mark to protect your brand, such as the name of your product or service. When you register your trade mark, you'll be able to:"
        },
        {
            "text": "Check out this video for more information on protecting your brand"
        },
        {
            "heading": 3,
            "text": "Not for a retail shelf"
        },
        {
            "text": "Unfortunately, the eco entrepreneurs failed to secure their 50k investment for 10% of their business and left the Den with nothing."
        },
        {
            "heading": 3,
            "text": "Toto night sleep"
        },
        {
            "text": "The next entrepreneur to capture my interest was fellow mother Victoria Fullarton."
        },
        {
            "text": "Victoria was off to an excellent start pitching her product the “Toto” with its accompanying slogan “take back bedtime”."
        },
        {
            "text": "Even though my children are older now, I can vividly remember the days of being a new mum and the struggle of sleepless nights as well as trying to find out my babies’ sleep routine."
        },
        {
            "text": "Victoria was asking for £150k for a 20% stake in her business. The Toto is a wearable device for your baby that sends notifications to your smart phone letting you know when it’s the best time for your baby to sleep. I could have only dreamed of such an invention many years ago!"
        },
        {
            "heading": 3,
            "text": "Keeping Mum?"
        },
        {
            "text": "The Dens newest fire breathing Dragon didn’t waste time in asking Victoria how the device could predict the best time for a baby to sleep to which she replied “That’s patent protected and I’m quite nervous about telling you the algorithm”."
        },
        {
            "text": "So, should Victoria be worried by her patent pending status?"
        },
        {
            "text": "The simple answer is you can disclose whatever is disclosed in the patent application as filed. Any new matter, such as improvements or later versions, should be kept confidential until you file a new application covering any subject matter that was not included in the first filing."
        },
        {
            "text": "You can use a patent to protect your invention. It gives you the right to take legal action against anyone who makes, uses, sells or imports it without your permission."
        },
        {
            "text": "Applying for a patent can be a complex process and the IPO strongly advises individuals to seek legal advice from a patent attorney or advisor. A patent specification is a legal document and requires specialist skills to draft properly."
        },
        {
            "text": "To be granted a patent, your invention must be all of the following:"
        },
        {
            "text": "Before you apply, check if a patent is right for your business."
        },
        {
            "text": "With Victoria’s resistance of disclosing the unique algorithm that is patent pending the Dragons’ put on a united, and impressive display of coaching Victoria when it came to the world of IP."
        },
        {
            "text": "Fortunately for Victoria after all Dragons but Sara declared themselves out of her tech business, Sara made an offer that Victoria simply couldn’t refuse - £150k for 35% of the business. Congratulations Victoria!"
        },
        {
            "text": "If you are thinking about the intellectual property in your business, visit the IP for Business section of our website or sign up to receive regular updates."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}