{
    "url": "https://deframedia.blog.gov.uk/2022/01/13/environmental-audit-committee-report-on-water-quality-in-rivers/",
    "title": "Environmental Audit Committee report on water quality in rivers",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2022-01-13T18:16:33+00:00",
    "content": [
        {
            "text": "There has been widespread coverage in The Guardian, The Times, The Telegraph, The Independent, The Mirror, The Express, The Financial Times and BBC Online on the Environmental Audit Committee’s report on water quality in England’s rivers."
        },
        {
            "text": "The report calls for action from everyone - the Government, regulators, water companies and farmers - to come together to deliver real change to improve the state of our rivers."
        },
        {
            "text": "The government welcomes this report and will be reviewing its recommendations carefully before responding later this year."
        },
        {
            "text": "Our Environment Act has already put in place more protections against water pollution than ever before and we are the first government to instruct water companies to take steps to significantly reduce storm overflows, which we have also put into law."
        },
        {
            "text": "Increased monitoring and transparency is key. More than 12,000 of England’s 15,000 storm overflows now have Event Duration Monitors to capture the frequency and duration of discharges, and the remaining 3,000 will have them by end of next year. All the data is published online so everyone can see what is happening."
        },
        {
            "text": "We are also doing much more to reduce pollution from agriculture, doubling the budget for our programme which provides practical support and advice for farmers and rolling it out across the whole of England."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "An Environment Agency spokesperson said:"
        }
    ]
}