{
    "url": "https://hmlandregistry.blog.gov.uk/2022/01/13/hm-land-registry-fees-are-changing/",
    "title": "HM Land Registry fees are changing",
    "authors": [
        "Iain Banfield, Chief Financial Officer"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-01-13T15:11:47+00:00",
    "content": [
        {
            "text": "From 00.01 am on Monday 31 January 2022, Scale 1 and Scale 2 land registration fees will increase for the first time since 2009."
        },
        {
            "text": "Applications for first registration and for registration of transfers, leases and mortgages of property submitted on or after that date will be charged under the new 2021 Fee Order."
        },
        {
            "text": "All applications started before 31 January, but submitted on or after this date, will be subject to the new fees."
        },
        {
            "text": "If an application was submitted before 31 January, subsequently cancelled or rejected and then resubmitted on or after 31 January, it will be subject to the new fees."
        },
        {
            "heading": 2,
            "text": "Get ready"
        },
        {
            "text": "To reduce unnecessary delays, please make sure you are familiar with the new fees."
        },
        {
            "heading": 3,
            "text": "Digital Registration Service"
        },
        {
            "text": "If you are creating and submitting your application using the Digital Registration Service, you don’t have to do anything. The system will notify you of any saved applications that need to be updated and recalculate the fees for you. Any applications created on or after 31 January will automatically get the new fee applied."
        },
        {
            "heading": 3,
            "text": "Electronic Document Registration Service (e-DRS) and postal applications"
        },
        {
            "text": "If you are preparing applications for submission on or after 31 January, you will need to use the new fees to avoid unnecessary delays. You might need to amend an AP1 that has already been created but won’t be submitted until after Sunday 30 January."
        },
        {
            "heading": 3,
            "text": "Business Gateway customers"
        },
        {
            "text": "Please make sure the system you use will apply the new fees to any application submitted on or after 31 January, to avoid unnecessary delays. This includes any applications that have been prepared and saved in advance of the fee change."
        },
        {
            "heading": 2,
            "text": "The main changes coming into effect on 31 January"
        },
        {
            "text": "The reduction in fees for electronically lodged register update applications has increased to 55% (rounded to a multiple of £5). There is still a 25% reduction in voluntary first registrations fees (rounded to a multiple of £5)."
        },
        {
            "text": "Fixed fees remain the same and are still reduced by 50% for electronically lodged applications."
        },
        {
            "heading": 2,
            "text": "Minor changes to fees and exemptions"
        },
        {
            "heading": 2,
            "text": " Next steps"
        },
        {
            "text": "The fee increase allows HM Land Registry to move forward with plans to deliver what customers need – more consistency and speed in service delivery – by investing in both operational capacity and accelerating the digitalisation and automation of services."
        },
        {
            "text": "With this in mind, we are exploring further changes to the Fee Order, including its structure and simplicity. We are currently engaging as widely as we can before we set out any proposals."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "For full details and other changes see our Guidance page on GOV.UK: Increase to HM Land Registry fees."
        },
        {
            "text": "Remember, our handy Fee calculator is available too."
        }
    ]
}