{
    "url": "https://defencedigital.blog.gov.uk/2022/01/13/mod-are-doing-cyber-security-awareness-differently/",
    "title": "MOD are doing cyber-security awareness differently",
    "authors": [
        "Isobel D"
    ],
    "categories": [
        "Cyber Confidence"
    ],
    "pub_date": "2022-01-13T14:25:03+00:00",
    "content": [
        {
            "text": "Cyber security can often be difficult to understand and as a result, we may not know how to fully protect ourselves if we are unsure about the guidance that is out there. It is crucial that everyone, no matter their role or seniority takes cyber accountability. As the cyber domain grows and we become more reliant on the internet and technology, the threat to our cyber safety is evolving and changing, making us more likely to become victim of a cyber-attack."
        },
        {
            "text": "Guidance documents filled with cyber jargon and highly technical phrases only distance those from cyber security. It is therefore crucial that people are engaged through memorable and novel ways of learning that gives an individual the opportunity to actively understand their role in protecting Defence through a hands-on or visual experience."
        },
        {
            "text": "The MOD’s approach to the international initiative, Cyber Awareness Month, has embodied just that, we have hosted a variety of exciting activities from a podcast, a three part video series, and a Cyber escape room tour to ensure every individual we come across within Defence is able to easily take away key cyber security messages."
        },
        {
            "text": "Our Script Kiddie Escape Room allowed those participating to experience a simulated cyber -attack under a safe and gamified condition.  The room toured across multiple UK sites filled with teams from various roles, ranks experience."
        },
        {
            "text": "We were truly blown away by the number of teams going through the room and we saw some impressively fast times! Not only was the room a test of teamwork, problem solving and decision making it also tested cyber security knowledge by teaching players how to identify possible threats to our security. We may come across such threats at work or even at home, both online and offline demonstrating the importance of ensuring we always present cyber secure behaviours."
        },
        {
            "text": "It was especially great to see CIO Charlie Forte and Second Permanent Secretary Laurence Lee take part in the room and brush up on their cyber security knowledge. Thanks to both for taking part."
        },
        {
            "text": "It is important to understand that cyber security isn’t just for October but all the time, online or offline, in the office or out and about."
        },
        {
            "text": "And remember, the front line is you."
        },
        {
            "text": " "
        }
    ]
}