{
    "url": "https://digitaltrade.blog.gov.uk/2022/01/13/our-new-strategy-user-centered-design/",
    "title": "Our new strategy: User-centered design",
    "authors": [
        "Anais Reding, Chief Engagement and Design Officer"
    ],
    "categories": [
        "Culture",
        "People and Skills"
    ],
    "pub_date": "2022-01-13T11:35:34+00:00",
    "content": [
        {
            "heading": 6,
            "text": "Some of our user-centred design team in the office"
        },
        {
            "text": "Our DDaT Director, Jason Kitcat, recently wrote about the new Digital Data and Technology (DDaT) Strategy that we’ve adopted at the Department for International Trade (DIT), marking our progression from a start-up to a scale up DDaT function. As the Chief Engagement & Design Officer at DIT, I wanted to follow up on his post and share more about what this means for user centred design."
        },
        {
            "text": "DIT was only formed in 2016 with a single focus on enabling the UK to trade independently when it exited the EU. Our DDaT function worked at pace and delivered some really impressive achievements."
        },
        {
            "heading": 3,
            "text": "Becoming a user-centric organisation"
        },
        {
            "text": "What we didn’t create enough space for, in this environment, was user-centred design. While central to the development of our transactional services, the pace at which we had to work meant we were primarily focused on usability. We wanted to redress this balance and be more strategic with our practice. User-centred design is now on an equal footing to other DDaT professions in our strategy. Our mission is to “explore and champion the needs of our users, helping DIT design services that maximise successful international trade and the delivery of its outcomes. We will partner with the business and collaborate with other business-facing departments to achieve this goal.”"
        },
        {
            "text": "Championing the user is also one of our five strategic pillars. This means that in everything we do we will strive to “develop a robust understanding of the user, using simple solutions wherever possible and putting service design at the heart of our delivery approach; as well as collect data once, maximising utility to minimise the collection burden. We see this as essential to producing products and services that deliver the intended outcomes and maximise value for money for DIT.”"
        },
        {
            "text": "Our aspiration for the next few years is to evolve from an organisation where our user-centred design practice is emergent, often specific to projects, to a place where it is integrated, where being user-centred is the default for the department. Our interim Head of Design, Michal Ozorowski, captured our ambition in a simple visual:"
        },
        {
            "heading": 6,
            "text": "Two onion diagrams. The first shows what user-centred design looks like today at DIT: it is a central but small focus area within the DDaT function; the second shows how user-centred design will surround both DIT and DDaT in the future."
        },
        {
            "text": "This isn’t just talk. We’ve already taken a number of steps to make this a reality. My role as Chief Engagement & Design Officer was created, at senior civil service level, on a par with my Chief Data, Technology and Product & Delivery peers. We also adopted the Government Pay and Capability Framework. While it benefits all of DDaT, it means we now value, invest and support the development of our user-centred designers as much as any other profession."
        },
        {
            "text": "I have rarely worked with an organisation like DIT where the full leadership team, across strategy, policy, and operations, wants to embrace user-centred design. So I am confident we can get there. But it won’t be overnight. And while our priorities for the next few years are simple and clear, they’re going to be challenging to achieve."
        },
        {
            "heading": 3,
            "text": "Our top three priorities for the next few years"
        },
        {
            "text": "In many areas we don’t yet have as good an understanding as we’d like of our users and their needs, their journeys, or the patterns they respond to best. It's especially important we take a step back as the trade landscape is complex, relying on multiple government departments, private, and third sector organisations, and has changed significantly in recent years. We’re evolving how we organise ourselves so user-centred design leads can look after a set of user needs, across multiple services. They do this as part of a portfolio team that aligns to the department’s outcomes and gives them access to the strategy, policy, and operational teams responsible for those."
        },
        {
            "heading": 6,
            "text": "Visual showing how DIT service users perform a range of activities, enabled by multiple capabilities. "
        },
        {
            "text": "From what we know of the diversity of our users' needs and journeys, there cannot be a single front door to government support. However, with strategic user-centred design and the right data and technology infrastructure, we can give users what feels like a single front door. To get there we will clarify our strategy for serving businesses across both GOV.UK (hosting regulatory services) and great.gov.uk (hosting educational and promotional services) and knit together more of DIT’s new online services. We will also help our DIT colleagues clarify our channel strategy and figure out any adjustment we need to make to our service offering. Many of our services have fundamentally been the same for decades. DIT now has the opportunity to adapt them to the needs of businesses today so we can maximise our impact on the UK economy.  As user-centred designers, we have a responsibility to help get this right, and we will be tapping into the government policy design community to help us collaborate effectively with policy colleagues."
        },
        {
            "text": "We’ve already shown that as a department, we’re not shy of being innovative where that can help us deliver the right outcomes. The recent revamp of our online offer for businesses learning to export is one example: powered by a state-of-the-art data infrastructure, we’ve developed the capability to personalise content for our users. We want to continue to build on this, and go further still. As a global promotional department at our core, information is a key asset. We create, change, and share it at immense pace and at scale: our network operates in 177 locations across the world. There are new capabilities available on the market that can help us do this more effectively and efficiently."
        },
        {
            "heading": 3,
            "text": "Join us on our mission"
        },
        {
            "text": "I’m biased of course, but I think we’re embarking on a challenging and exciting user-centred design mission at DIT. We’d love your support if you can help us get it right."
        },
        {
            "text": "We also have to grow across our professions if we’re going to succeed. I hope this post will help you decide if you might be interested in coming with us on this journey."
        }
    ]
}