{
    "url": "https://lifeathmrc.blog.gov.uk/2022/01/13/supporting-the-covid-19-vaccination-booster/",
    "title": "Supporting the COVID-19 Vaccination booster",
    "authors": [
        "Vicky Day"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-01-13T16:13:25+00:00",
    "content": [
        {
            "text": "The Civil Service has been asked to support the Prime Minister’s challenge to deliver COVID-19 vaccination boosters to everyone aged 18 and over in England. Many colleagues across our organisation have volunteered across England and found the experience incredibly rewarding. Read on to find out how Vicky’s experience went."
        },
        {
            "text": "I work in HR at HMRC and lead the Recruitment Marketing, Attraction and Outreach team. Yes, we’re fans of long titles here and also of acronyms, but I’ll try to avoid them in this post!"
        },
        {
            "text": "My team are responsible for promoting HMRC as a great place to work to help find and attract candidates to come have a career with us. We run marketing channels, such as this blog and Twitter, Facebook groups for new starters and manage our online presence on job boards and careers sites."
        },
        {
            "text": "Most people know who HMRC is, but they don’t necessarily consider working for us and we’re aiming to change that by giving people an insight into what it’s actually like working for the third largest UK Government department."
        },
        {
            "text": "Just before Christmas, my day at work looked a little different. I don’t usually wear a hi-vis vest (or a mask) to work in my home office. I’ve been doing my bit to help with the national vaccine effort. As civil servants, we get 5 paid days off a year to volunteer. Given the government’s priority to get everyone boosted as soon as possible, the 5-day limit was temporarily lifted and we were all being encouraged to help out if we can. I stuck my hand up to try something different and be part of something bigger than the day job."
        },
        {
            "text": "I rubbed shoulders (not literally of course, but at a safe social distance) with military personnel, dentists, community nurses and children’s NHS workers, all coming together to play their part and I have to say, it felt good."
        },
        {
            "text": "I arrived at lunch time for a short briefing in a car park before being assigned my task. I was to welcome people arriving for their booster vaccines and show them to a free booth. As I’ve spent the last 21 months working on my own it was quite exciting to interact with people in real life. I soon figured out those administering the vaccines were in a competition to see who could do the most in a day and I had the power to help them win or lose. Of course, I did my best to keep it fair."
        },
        {
            "text": "During my 15-minute break, I chatted to a military man who last month had been saving elephants in Africa, a military woman whose day job is setting up hospitals in developing countries and a dentist. I told them I’m a civil servant and work for HMRC. Besides the usual jokes about tax returns, they were interested to hear that my profession is marketing and communications, I probably don’t know any more about tax than they do and that there’s actually lots of different types of roles at HMRC."
        },
        {
            "text": "I think most of us join the Civil Service because we want the make a positive difference to the lives of people in the UK, and we do that every day. My volunteering shift gave me the chance to do it more directly and I knew my team would keeping the ship sailing back in the office. I’m very grateful for the opportunity and looking forward to my next shift!"
        },
        {
            "text": "Happy New Year to everyone."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}