{
    "url": "https://educationhub.blog.gov.uk/2022/01/13/what-were-doing-to-keep-vulnerable-children-safe-and-what-to-do-if-you-have-concerns-about-a-childs-welfare/",
    "title": "What we’re doing to keep vulnerable children safe and what to do if you have concerns about a child’s welfare",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Child protection"
    ],
    "pub_date": "2022-01-13T15:19:35+00:00",
    "content": [
        {
            "text": "The death or serious harm of any child is a tragedy and recent cases such as those of Arthur Labinjo-Hughes and Star Hobson have shocked and appalled the nation. It is imperative in all these circumstances that we find out what happened and what needs to change and improve so we can protect vulnerable children."
        },
        {
            "text": "But how are we doing this? And what can you do? Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "How are you protecting vulnerable children?"
        },
        {
            "text": "We want every child to have the best start in life and keeping children safe and happy is our number one priority."
        },
        {
            "text": "Over the course of the pandemic, we kept schools open for the most vulnerable children. We also launched the See, Hear, Respond programme with Barnardo’s to support vulnerable children and young people whose usual support networks were impacted by the pandemic and extended the role of Virtual School Heads in September, meaning there is now a local champion for every child with a social worker in every local authority across England."
        },
        {
            "text": "We have put new responsibilities on councils, police and health services to work together to protect vulnerable children and introduced tougher Ofsted inspections for children’s services. These are driving up standards, with 50% of local authorities now rated ‘Good’ or ‘Outstanding’ by Ofsted, compared to 36% at the end of 2017. Where Ofsted tell us a council’s performance is not good enough, we can support it to improve."
        },
        {
            "text": "The Government also recently launched a new Stop Abuse Together campaign, which will provide important advice to parents on how to spot the potential signs of abuse and where to go for support. We’re also working closely with the NSPCC and have given it additional funding to expand its national helpline for adults to report concerns."
        },
        {
            "heading": 3,
            "text": "What lessons will be learnt from these recent cases?"
        },
        {
            "text": "Parents and carers have primary care for their children, but local authorities, working with partner organisations and agencies do have specific duties to safeguard and promote the welfare of all children in their area."
        },
        {
            "text": "Following Arthur’s death, we made the decision to launch two reviews."
        },
        {
            "text": "The first is a single, national review of Arthur’s death led by the Independent Child Safeguarding Practice Review Panel to identify what we must learn from this terrible case. This involves local government, as well as those working in the police, health and education sectors to identify where improvements need to be made not only in Solihull, but across the country."
        },
        {
            "text": "The second review is what is called a ‘Joint Targeted Area Inspection’ and in Arthur’s case, this is looking at where improvements are needed by all the agencies tasked with protecting children in the Solihull area. Like the national review, the learnings from this review will also be applied in other areas around the country."
        },
        {
            "text": "In addition to the two reviews following the death of Arthur, we are also carrying out a wide ranging independent review of the Children’s Social Care system, which we launched in January 2021. This will identify what is needed to make a real difference to the needs, experiences and outcomes of those supported by children’s social care."
        },
        {
            "heading": 3,
            "text": "What is the difference between these reviews and how will they work together?"
        },
        {
            "text": "Whilst the National Review will look at the circumstances surrounding Arthur’s horrific death, the Joint Targeted Area Inspection will look at how the multi-agency arrangements are working now in the Solihull area. Together, these two actions will offer a deep, independent look at Arthur’s case, and any lessons that need to be learnt nationally."
        },
        {
            "text": "The Independent Review of Children’s Social Care meanwhile, is a wide-ranging review of social care."
        },
        {
            "heading": 3,
            "text": "Why didn’t you announce a national review for Star Hobson and other children like her?"
        },
        {
            "text": "Child abuse is a deeply disturbing crime and we are completely appalled by any case that involves the death of a child. This is why there is a locally led review system in place to properly review and investigate cases, to look at what exactly went wrong and why."
        },
        {
            "text": "The national review takes into account the significance and scale of the circumstances of Arthur’s murder, allowing findings to be rolled out across the country to improve practice and identify the lessons that must be learnt. It is the first individual national case review undertaken by the Panel since it was set up in 2018."
        },
        {
            "heading": 3,
            "text": "What can I do if I have concerns about a child? "
        },
        {
            "text": "We are urging communities to come together to keep an eye on some of our most vulnerable children."
        },
        {
            "text": "Anyone who sees or suspects child abuse or neglect, or is worried about a child known to them, can report concerns to their local children’s services or by contacting the government-supported NSPCC helpline, which is for adults or practitioners concerned about a child or young person."
        },
        {
            "text": "To do this, you can call 0808 800 5000 or email help@nspcc.org.uk."
        },
        {
            "heading": 3,
            "text": "What are the signs I should look out for? "
        },
        {
            "text": "Our new Stop Abuse Together website has some useful guidance on the signs to look out for which might indicate that a child is being abused. It’s important to know that these signs might not always be obvious, but may include changes in their behaviour, mood and/or appearance. More advice is available here."
        },
        {
            "text": " "
        }
    ]
}