{
    "url": "https://ruralpayments.blog.gov.uk/2023/11/24/rpa-grants-and-rural-payments/",
    "title": "RPA grants and rural payments",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Farming Investment Fund",
        "Grants"
    ],
    "pub_date": "2023-11-24T16:01:59+00:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants and rural payments to farmers, businesses and local authorities. In this blog, and an upcoming series, we will be looking at the grants available in more detail, using case studies to showcase those who have taken advantage of these opportunities, as well as highlighting the work of the RPA Grants Service Team in administering them."
        },
        {
            "text": "What are the existing grant schemes?"
        },
        {
            "text": "The Farming Investment Fund (FIF) offers funding for equipment, technology, and infrastructure that improves farm productivity and benefits the environment. This fund provides grants to farmers, foresters and growers, including contractors to these sectors, so they can invest in the things they need to improve productivity and enhance the natural environment."
        },
        {
            "text": "FIF is made up of two grants:"
        },
        {
            "text": "The Farming Equipment and Technology Fund (FETF) provides grants between £1,000 and £25,000 towards the cost of equipment and technology to improve productivity, the environment and animal health and welfare. We have had two rounds of this scheme – Round 1 was for general items and Round 2 was split into two application windows with items relating to Productivity and Slurry and items on Animal Health and Welfare. All are currently closed for applications, but we expect there will be further FETF opportunities launched in 2024 including new items."
        },
        {
            "text": "The Farming Transformation Fund (FTF) provides grants of £25,000 to £500,000 towards large capital items to help businesses improve productivity, profitability, and environmental sustainability. There are currently five competitive grants available through the FTF:"
        },
        {
            "text": "What’s coming in the future?"
        },
        {
            "text": "Further rounds of these schemes, and any new schemes under the Farming Transformation Fund, will be announced in 2024."
        },
        {
            "text": "Please visit https://www.gov.uk/guidance/funding-for-farmers  regularly for more information as this page sets out every payment on offer, with links to learn more."
        }
    ]
}