{
    "url": "https://naturalengland.blog.gov.uk/2023/11/24/the-countryside-code-cbbc-newsround/",
    "title": "The Countryside Code: CBBC Newsround",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Coast and access",
        "Countryside Code",
        "Education",
        "Mental health and wellbeing",
        "Natural England",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2023-11-24T11:26:52+00:00",
    "content": [
        {
            "heading": 4,
            "text": "By Bruce Cutts "
        },
        {
            "heading": 4,
            "text": "Senior Advisor, Natural England"
        },
        {
            "text": "The Countryside Code is a guide to the outdoors. Whether you’re in the countryside, enjoying the coast, our waterways or an urban park, it’s there to help guide all of us through nature."
        },
        {
            "text": "Since the refresh of the Code in 2021, Natural England has been active in promoting the Code’s messages through ongoing campaign activity. We’ve been fortunate enough to work with some amazing people, and a partnership with Shaun, a very well-known sheep!"
        },
        {
            "text": "Back in September we secured a fantastic opportunity with CBBC Newsround to feature the Countryside Code and share our messages which aim to help young people learn about protecting and enjoying outdoor spaces."
        },
        {
            "text": "The Countryside Code team worked with Debbie North from Access the Dales, a charity dedicated to improving access to the countryside.  Through Debbie, we engaged with Highbury Primary School – a specialist school providing specialist education for children with a wide range of complex educational needs and disabilities between the ages of 4-11."
        },
        {
            "text": "Before the filming took place Debbie had developed a version of the Code which would be more suited to Autistic children, with adapted Countryside Code messaging to share with the children of Highbury Primary School. This version is also now available on the resource pages of the Countryside Code website. "
        },
        {
            "text": "On the day of filming, Debbie and I took a group of children, and presenter Shanequa Paris, on a walk around Shibden Hall and talked to them about various elements of the Countryside Code, such as not dropping litter, saying hello to people, and leaving gates how you find them. We also emphasised that the countryside is for everyone to enjoy and that everyone has a role to play in protecting it."
        },
        {
            "text": "Tailoring our responses to the Newsround audience was quite a challenge to begin with, for me anyway, but I hope we were able to explain the essence of the Code. Which is essentially, regardless of people’s needs, the outdoors is for everyone."
        },
        {
            "text": "The children at Highbury Primary School had a great day learning for themselves the Code’s importance for respecting, protecting, and enjoying time in nature. Opportunities such as these highlight the necessity of spending time outdoors for both mental and physical wellbeing; the Code is a tool to help people get there."
        },
        {
            "text": "You can watch the clip on the BBC iPlayer here:"
        },
        {
            "text": "Shaun the Sheep helps teach children how to look after nature - BBC Newsround"
        },
        {
            "text": " "
        },
        {
            "text": "The Countryside Code team at Natural England are leading on the public information campaign to promote the messages of the Code. If you are interested in hearing more on the campaign we issue a quarterly newsletter (next edition due at the end of November) – if you would like to be added to the mailing list please email countryside.code@naturalengland.org.uk."
        },
        {
            "text": "For more information on the Countryside Code, visit our website"
        },
        {
            "text": " "
        }
    ]
}