{
    "url": "https://vmd.blog.gov.uk/2023/11/24/vmds-path-safe-project-an-update-on-amr-surveillance/",
    "title": "VMD’s PATH-SAFE project – an update on AMR surveillance",
    "authors": [
        "Anju Kirby"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)"
    ],
    "pub_date": "2023-11-24T15:45:50+00:00",
    "content": [
        {
            "text": "The Pathogen Surveillance in Agriculture, Food and Environment (PATH-SAFE) programme uses the latest DNA-sequencing technology and environmental sampling to improve the detection and tracking of foodborne disease and antimicrobial resistance (AMR)."
        },
        {
            "text": "This project led by the Food Standards Agency (FSA), launched the programme in 2019. As well as the VMD, it gave departments across government, including;"
        },
        {
            "text": "the opportunity to explore and investigate new areas of AMR surveillance along the agri-food chain."
        },
        {
            "heading": 2,
            "text": "What is VMD doing"
        },
        {
            "text": "Within the PATH-SAFE programme, we have looked to address commitments within the UK National Action Plan for AMR (2019-2024) including;"
        },
        {
            "text": "In the UK, through the harmonised monitoring programme, we conduct routine AMR surveillance in in two key livestock species, healthy pigs and poultry. The results from this are published yearly in the UK Veterinary Antimicrobial Resistance Sales and Surveillance (VARSS) report."
        },
        {
            "text": "PATH-SAFE has provided the opportunity to bolster this surveillance through four AMR pilot surveillance projects which will help address key surveillance gaps, including generating baseline data for AMR in ruminants."
        },
        {
            "text": "Read more about these four projects that the VMD’s AMR surveillance and evidence team kicked off in 2022:"
        },
        {
            "heading": 3,
            "text": "1. Pilot surveillance of AMR in bulk milk "
        },
        {
            "text": "This project is investigating bulk milk as a novel tool for AMR surveillance in dairy cattle. It will test milk samples collected by the National Milk Laboratories (NML) to find out what AMR genes and AMR bacteria are present in bulk milk across GB."
        },
        {
            "text": "This project is a great example of using the UK’s existing sample collecting infrastructure to expand AMR surveillance."
        },
        {
            "heading": 4,
            "text": "What is the evidence gap addressed"
        },
        {
            "text": "Currently, there is no routine surveillance of AMR bacteria in healthy ruminants. This survey will address this evidence gap by piloting AMR surveillance of bulk milk as an indicator of AMR levels in dairy cattle."
        },
        {
            "heading": 4,
            "text": "Who are we working with"
        },
        {
            "text": "National Milk Laboratories (NML) and APHA"
        },
        {
            "heading": 3,
            "text": "2. Pilot survey of AMR in sheep"
        },
        {
            "text": "This project looks at AMR levels in healthy sheep at slaughter in England and Wales. Additionally, this project will pilot methodology for both environmental and wastewater sampling in abattoirs."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "What is the evidence gap addressed"
        },
        {
            "text": "The last time there was a national survey of disease risk in healthy sheep in abattoirs  was almost 20 years ago and therefore, existing data may not represent the current situation."
        },
        {
            "text": "This survey will establish a new baseline of bacterial and AMR prevalence in healthy sheep at slaughter."
        },
        {
            "heading": 4,
            "text": "Who are we working with"
        },
        {
            "text": "APHA, FSA, Defra, Cefas and sheep abattoirs across the UK."
        },
        {
            "heading": 3,
            "text": "3. Pilot surveillance of livestock feed and feed ingredients"
        },
        {
            "text": "This project assesses the potential AMR risks associated with both domestic and imported feed ingredients and finished feed."
        },
        {
            "text": "This will contribute to informing risk-based decisions about surveillance and control measures, which are essential for facilitating good biosecurity measures in the UK."
        },
        {
            "heading": 4,
            "text": "What is the evidence gap"
        },
        {
            "text": "Currently, there is no programme for monitoring AMR in domestic or imported animal feed ingredients in the UK."
        },
        {
            "text": "Through this work we hope to generate a better understanding of the AMR load in imported feed ingredients."
        },
        {
            "heading": 4,
            "text": "Who are we working with"
        },
        {
            "text": "Agriculture Industries Confederation (AIC) and APHA."
        },
        {
            "heading": 3,
            "text": "4. Pilot Surveillance of AMR in beef cattle"
        },
        {
            "text": "This project will establish the prevalence of AMR in bacteria in healthy beef cattle."
        },
        {
            "text": "Surveillance is being carried out in some of the key bacterial species, present in humans and animals, that are monitored in other surveillance programmes, allowing comparability of results."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "What is the evidence gap"
        },
        {
            "text": "Cattle farming represents a significant sector within agriculture in the UK, with the UK being the third highest producer of beef in Europe in 2019."
        },
        {
            "text": "However, there is no UK-wide programme for monitoring AMR in healthy cattle which makes it difficult to assess the risk of transmission across the agri-food chain."
        },
        {
            "heading": 4,
            "text": "Who are we working with"
        },
        {
            "text": "SRUC, FSS, AFBI and FSA"
        },
        {
            "heading": 2,
            "text": "Looking forward  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}