{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/11/24/we-are-strategic-command-with-wo2-joseph-washington/",
    "title": "We Are Strategic Command with WO2 Joseph Washington",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Overseas Bases",
        "Personnel"
    ],
    "pub_date": "2023-11-24T10:00:59+00:00",
    "content": [
        {
            "text": "In our latest article, we caught up with Joseph Washington, who talks about his role and what it’s like being on deployment in the Falklands Islands."
        },
        {
            "text": "Interviewer: Can you introduce yourself and tell us about your role?"
        },
        {
            "text": "WO2 Joseph Washington: I'm WO2 Joseph Washington, and I'm currently on a six-month deployment in the Falklands Islands as the Resident Sky Sabre Battery Sergeant Major (RSSB SM) for 30 Battery (Rogers’s Coy) RA of 16 Regt RA. My primary responsibilities involve ensuring that discipline and G1 is adhered to for both my junior ranks and officers alike. This means ensuring my service personnel (SP) carry out their day to day duties in the highly professional manner expected of the Gunners, some of which involves, guard duties, day to day maintenance of the Sky Sabre (SkS) fleet, and integrated training with the RAF.  This also includes keeping up detachment training on Sky Sabre to ensure we can deliver a 24-hour capability of detect, track, identify, and defend against enemy aircraft if needed."
        },
        {
            "text": "My role is to also coach and mentor my Troop Commander and seniors, and be my soldiers sounding board to my Officer in Command and vice versa. Additionally, I'm the Engagement Commander to cover Rest & Recuperation (R&R), which means that if the need arises, I would help run the Ground Based Air Defence Battle (GBAD) battle with the RAF."
        },
        {
            "text": "Interviewer: Can you give us a peek into a typical day in the life of someone in the Sky Sabre Battery?"
        },
        {
            "text": "WO Joseph Washington: A typical day for someone like me in the Sky Sabre Battery starts early. I kick it off with some training at the gym and then every other day join in with collective battery PT run by the RAF PTIs’. After my cup of coffee and lengthy session of tackling my inbox, I check in with my team to discuss the day's events. This is determined by the information briefed from the various RAF departments, which determines if we are conducting integrated training with RAF or conducting our own SkS training. Another significant part of my day is ensuring our Battery members are also focused on their personal and professional development, enabling them to progress with their careers."
        },
        {
            "text": "Interviewer: What's your favourite part of your role?"
        },
        {
            "text": "WO Joseph Washington: The most rewarding part has to be looking after my SP. It's truly fulfilling to work with this team and observe their growth and development daily. For me, it means keeping their morale high, helping them evolve in their roles, and boost their confidence. Organised team activities such as Battlefield Studies, team sports and competitions, days out to see what Falkland’s Islands has to offer, and battery cohesion events, these all directly contribute to building an effective team that want to continually push themselves personally and professionally, seeing this makes me immensely proud of my SP. It’s a little like being a dad seeing their children grow."
        },
        {
            "text": "Interviewer: What's it like being based in the Falklands?"
        },
        {
            "text": "WO Joseph Washington: Being stationed in the Falklands is quite the experience. This is my first deployment here, and I'm fortunate that it's during the summer deployment, so the weather is a nice bonus. It's an island, so you can expect some extremely windy days, but overall, it's fantastic, and I'm genuinely enjoying it. Just last week, I watched and supported my SP participate in a local half marathon to Stanley followed by a great lunch together overlooking Stanley Harbour. We also make time to explore the island's beauty, including the penguins and sealions in their natural habitat. Evenings usually mean team gatherings, there's a lot to do here and it's all about what you make of it. You can either stay in and get bored or go out, participate in activities, and explore the island."
        },
        {
            "text": "Interviewer: It's been mentioned that the Falklands have unique terrain for training purposes. Can you share more about this?"
        },
        {
            "text": "WO Joseph Washington:  The terrain here is a huge asset for soldier Battle Craft Syllabus (BCS) development. It's the perfect playground for honing basic soldiering skills in different and sometimes very harsh environments. I often get the SP together to explore and use the unique landscape to deliver unconventional lessons. We're also fortunate to have The Roulement Infantry Company (RIC), currently The Welsh Guards, offering various equipment and weapons for training. Coupled with the unique terrain, it leads to fantastic training experiences and, of course, a lot of fun for the troops. We're always on the lookout for interesting places on the island to enhance our training and development, whether that is basic soldering skills or for our main trade craft as SkS soldiers."
        },
        {
            "text": "Interviewer: What's the role of the Falklands within the Overseas Base Directorate?"
        },
        {
            "text": "WO Joseph Washington: Our role is to demonstrate the government’s continued commitment to the security of UK overseas territories in the South Atlantic. This is a tri-service enduring operation that include air defence assets, maritime patrol capability and infantry forces. This in turn assures and helps guarantee the Islands’ safety and to support the population’s wish that the Islands remain UK sovereign territory."
        },
        {
            "text": "Interviewer: Can you tell us about the benefits of the Falklands Island base and how it contributes to the broader defence strategy?"
        },
        {
            "text": "WO Joseph Washington: Our location helps us stay active and ready to respond to any emerging challenges or threats. With an area two-thirds the size of Wales in which to operate, we are fortunate to be able to make the very best use of the training opportunities that the Island has to offer. With a unique and challenging terrain and extremely challenging climate, the phrase ‘all four seasons in one day’ isn’t an exaggeration! Falklands provide an outstanding training environment which stands British forces in good stead for operational service anywhere and in any challenging environment."
        },
        {
            "text": "For broader defence, Falkland Islands provides a critical strategic point to maintain a visible presence in the region, reassuring the local population and our allies and deterring potential threats."
        },
        {
            "text": "Interviewer: How does working in Strategic Command compare to your previous roles?"
        },
        {
            "text": "WO Joseph Washington: Working for Strategic Command is a completely different ballgame compared to my previous roles. It's challenging working out how the 3 services work and operate together, which is very different to what I am used to in the RA, but that's what makes it exciting. I come from a predominately technical and instructional background, I have worked on a few occasions with the RAF and Navy but singularly. This is my first tri-service experience since the HERRICK deployments, even then you tended to stay with your core. This deployment will definitely enhance my professional development and enhance my ability to work with tri service SP."
        },
        {
            "text": "Interviewer: What's been your highlight working at Strategic Command?"
        },
        {
            "text": "WO Joseph Washington: My highlight at Strategic Command is definitely being out here in the Falklands as the RSSB SM, it allows me to do what I'm passionate about whilst also providing crucial Ground Based Air Defence (GBAD) capability for Commander British Forces South Atlantic Islands, whilst ensuring that we stay at the forefront of air defence capabilities and remain updated on emerging threats and trends in defence."
        },
        {
            "text": "Interviewer: How would you sum up Strategic Command?"
        },
        {
            "text": "WO Joseph Washington: Strategic Command is all about being at the cutting edge of defence, adapting to new challenges, and providing critical support to the British Forces. It's a dynamic and fast-paced environment where you have to stay on your toes to meet the ever-evolving needs of the military."
        }
    ]
}