{
    "url": "https://socialcare.blog.gov.uk/2023/06/09/carers-week-crunching-the-numbers/",
    "title": "Carers Week 2023: crunching the numbers...",
    "authors": [
        "Emily Holzhausen OBE"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Events"
    ],
    "pub_date": "2023-06-09T08:52:39+00:00",
    "content": [
        {
            "heading": 2,
            "text": "...to make the case for support."
        },
        {
            "text": "New research released for this year’s  Carers Week reveals we need to think and plan differently for people with unpaid caring responsibilities."
        },
        {
            "text": "The YouGov research, using a poll of 4,000 adults across the UK, found 50 percent of the population has had some sort of experience of providing unpaid care, either now (20 percent of the population) or in the past (30 percent). Of these people, a staggering 73 percent had not identified as unpaid carers, translating to a staggering 19 million people."
        },
        {
            "text": "Caring, unpaid, for older, disabled or chronically ill relatives or friends is something most of us will experience in our lives. In fact, all of us has a two in three chance of doing so."
        },
        {
            "text": "Women are far more likely to care earlier and have a 50:50 chance of doing so by the time they are 46, men have the same likelihood by the time they are 57 – 11 years later."
        },
        {
            "text": "According to research by the University of Sheffield based on the Census 2021 findings, it is estimated the value of unpaid care is equivalent to a second NHS – £152 billion in England alone."
        },
        {
            "text": "We asked how long it took people to identify as a carer and anything they missed out on as a result of delay. A staggering 46 percent felt they had missed out financially providing unpaid care, 35 percent on practical support and 23 percent on workplace adjustments."
        },
        {
            "text": "It’s clear we need greater efforts and mechanisms to systematically identify unpaid carers earlier in their journey and make sure they are connected to support, information and advice."
        },
        {
            "heading": 2,
            "text": "Identifying carers starts at home"
        },
        {
            "text": "It turns out family and friends are best at helping to identify people as unpaid carers – so there’s a lot we can all do within our own personal networks and connections. 22 percent said health professionals had identified them. For those in paid work, 12 percent said they were identified by their employer. And 14 percent had identified themselves as carers online."
        },
        {
            "text": "We asked all those with past and present experience of unpaid care what negative impacts they associate with this period of their lives. One third said it had impacted on their health – a staggering 8 million people. Of those in work, nearly one in five said caring had impacted negatively on their ability to work and one in seven (14 percent) said it had affected their financial security. Carers’ support needs a whole population approach."
        },
        {
            "text": "Even if someone doesn’t want to be labelled as an unpaid carer, identifying them and ensuring they are supported remains critical."
        },
        {
            "text": "If you are thinking about what you can do, there’s no shortage of ideas and options. Employers can take the opportunity to talk about unpaid caring with employees and a lot are doing just that during Carers Week. Including a simple question on a staff survey can make all the difference to understanding your colleagues and staff, which we know to be true from our 230 strong Employers for Carers forum."
        },
        {
            "text": "Most of us will care at some point in our lives. For some it will be fleeting and short. For others, it will be long term and very significant over time. None of us can predict when, how or what will happen, but we need society and systems around us to make sure we have the best support available. That’s why you could make a difference for Carers Week this year by making saying I Care and doing something practical to support unpaid carers."
        },
        {
            "text": "Ideas for action in Carers Week and beyond"
        }
    ]
}