{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/06/09/gse-leadership-values-collaboration/",
    "title": "GSE Leadership Values: Collaboration",
    "authors": [
        "Rick Mumford"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Talent & Leadership"
    ],
    "pub_date": "2023-06-09T10:26:37+01:00",
    "content": [
        {
            "text": "As a science leader, one of the key skills you need is the ability to collaborate with others. At the heart of this, you need to be a great communicator; someone who can explain complex information that can be understood by a diverse of audience. Through this, you can bring others with you, for example to deliver a shared vision or to inspire trust. With regards the latter, the Covid-19 pandemic demonstrated the vital role science plays in building trust and the influence which allows people to make informed decisions and take positive action.  "
        },
        {
            "text": "At the Food Standards Agency (FSA), trust is core to what we do. Indeed, it is enshrined in our mission of ‘Food you can Trust’. In my working life, as FSA’s Head of Science and deputy CSA, my focus is on the risks associated with food and being able to explain these in a clear and balanced way to a wide range of different interested parties, ranging from consumers to policy makers and politicians. There is the need to distil complex, technical information and clearly explain things like uncertainty. A great example of this was the risk assessment we produced on the transmission of SARS-CoV-2 via food and food packaging, which acted as the evidence base for our risk management advice throughout the pandemic. "
        },
        {
            "text": "But the ability to collaborate and communicate is not just about trust and communicating risk. It can also be about building partnerships to deliver innovation and change. At the FSA, we are leading a major cross-government programme called PATH-SAFE (Pathogen Surveillance in Agriculture, Food and the Environment). This £19M programme is funded via the Treasury’s Shared Outcome Fund and is exploring novel approaches for improving foodborne disease and antimicrobial resistance (AMR) surveillance within the agri-food-environment system. Building on approaches used elsewhere (e.g. wastewater testing for COVID-19), its vision is to create innovative solutions to sampling, testing and data analytics/sharing, allowing government to better manage risks (e.g. through more rapid tracing of disease sources). "
        },
        {
            "text": "With 40 partners from across government, academic, research establishments and businesses, PATH-SAFE can only operate through excellent collaboration and building effective partnerships. Individual partners will have their own drivers and priorities, and effective communication takes time and effort. But collaboration is the only way to drive significant change and innovation, and hence as a leader, communicating the big picture and a strategic vision is key to bringing everyone with you. "
        },
        {
            "text": "So yes, as a science leader, collaboration and communication is front and centre of what you do. You are often the bridge between experts and deep specialists and a frequently unexpert audience. You need to do so with clarity (assume a lack of audience knowledge; avoid jargon; decide on your take home messages). And remember, it is often your job to take the ‘what’ (e.g. some research) and translate it into the ‘so what’ (e.g. action). The value of government science is realised when it is used and effective communication is the key to achieving this. "
        },
        {
            "text": "Rick Mumford "
        },
        {
            "text": "Head of SERD – Food Standards Agency  "
        },
        {
            "text": "Related Link "
        },
        {
            "text": "GSE Leadership Values "
        }
    ]
}