{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/06/09/september-secondment-opportunities-for-competition-and-consumer-lawyers/",
    "title": "September secondment opportunities for competition and consumer lawyers",
    "authors": [
        "Victoria Oates"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2023-06-09T09:59:18+01:00",
    "content": [
        {
            "text": "We are launching a new round of secondment opportunities for lawyers, to start on 18 September 2023."
        },
        {
            "text": "Since its launch in June 2018, over 50 secondees from over 20 law firms have taken part in the programme and we are now accepting applications for the next round which is anticipated to start on 18 September 2023."
        },
        {
            "text": "We invite you to consider whether your firm and any of your associates wish to participate."
        },
        {
            "text": "The deadline for applications is 10 July 2023."
        },
        {
            "text": "Our programme offers an exciting opportunity for competition and consumer lawyers:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Secondments are open to all qualified lawyers currently employed in a law firm in the UK and with previous experience working on competition and/or consumer law or related litigation matters. While secondees to date have been based in our London office, we are open to consider requests for secondments to be based in CMA offices in Belfast, Edinburgh or Manchester."
        },
        {
            "text": "Additionally, we aim to offer secondees a range of work suitable for their level of experience and to provide training as part of the role, Our secondments last for 6 months with two intakes annually on a rolling basis. The CMA will contribute a flat rate to the cost of secondees, with further details available on request."
        },
        {
            "text": "Firms that would like to put candidates forward should email a CV and covering letter for each candidate by 10 July 2023 to Simon Harms, David Riley, Victoria Oates and John Bardsley."
        },
        {
            "text": "As part of their covering letter, candidates should confirm that they are able to start their secondment on 18 September 2023 for a 6-month period."
        },
        {
            "text": "Candidates should also express any preference for particular types of work within the CMA which we will do our best to accommodate, including with a view to maximising a firm’s exposure to different CMA tools among their associates seconded over time."
        },
        {
            "text": "Candidates should be available to have a meeting or call with the CMA during the weeks of either 17 July 2023 or 24 July 2023 to discuss the secondment."
        },
        {
            "text": "Please note we will not consider applications via agencies."
        },
        {
            "text": "If you have any questions or would like to discuss the benefits of the programme, please contact any of Simon Harms, David Riley, Victoria Oates or John Bardsley."
        },
        {
            "heading": 4,
            "text": "Simon Harms "
        },
        {
            "text": "Legal Director Simon.Harms@cma.gov.uk"
        },
        {
            "heading": 4,
            "text": "David Riley"
        },
        {
            "text": "Legal Director David.Riley@cma.gov.uk"
        },
        {
            "heading": 4,
            "text": "Victoria Oates"
        },
        {
            "text": "Assistant Legal Director  Victoria.Oates@cma.gov.uk"
        },
        {
            "heading": 4,
            "text": "John Bardsley"
        },
        {
            "text": "Legal Adviser John.Bardsley@cma.gov.uk"
        },
        {
            "text": " "
        }
    ]
}