{
    "url": "https://nda.blog.gov.uk/showcasing-the-nda-groups-decommissioning-expertise-on-an-international-stage/",
    "title": "Showcasing the NDA group's decommissioning expertise on an international stage",
    "authors": [
        "Melanie Brownridge"
    ],
    "categories": [
        "Innovation/savings",
        "International activities",
        "Research and development",
        "Science",
        "Skills"
    ],
    "pub_date": "2023-06-09T10:39:34+01:00",
    "content": [
        {
            "heading": 4,
            "text": "From Professor Melanie Brownridge, NDA Technology and Innovation Director"
        },
        {
            "text": "Last month I attended the International Atomic Energy Agency’s (IAEA) Conference on Nuclear Decommissioning in Vienna."
        },
        {
            "text": "The event brought together around 450 decommissioning experts from around the world to discuss achievements, challenges and lessons learned, highlighting the importance of sharing information on approaches that enhance safe, secure and cost-effective implementation of nuclear decommissioning."
        },
        {
            "text": "Representatives from the NDA, Dounreay and Sellafield, spoke at the event alongside National Nuclear Laboratory, Environment Agency, Office for Nuclear Regulation and our partners in the supply chain."
        },
        {
            "text": "It was a great opportunity to share our expertise on the world stage and learn from others, we were privileged to attend and present our work on UK experience in decommissioning, collaboration in innovation and investing in skills for the future."
        },
        {
            "text": "I presented an overview on how we’re collaborating across the NDA group on research and development through our groupwide Research Forum and took part in a panel discussing how we can encourage innovation working with our supply chain."
        },
        {
            "text": "This included sharing learning from our collaborative innovation programmes with other sectors such as defence where we’ve been able to support innovative technologies in exciting areas such as telexistence that could have multiple applications, from nuclear decommissioning to other hazardous environments, for example treating wounded soldiers on battlefields.   "
        },
        {
            "text": "Both opportunities were exciting, if a little daunting, they were live streamed and so questions came from all over the world – literally."
        },
        {
            "text": "NDA Decommissioning Strategy Manager, Simon Boniface,  also presented the NDA Code of Practice on the determination of the preferred pace and priority of dismantling, which included a discussion on at what point sites are at the end of the decommissioning process and when dismantling, and in particular the latter stages of demolition, should stop."
        },
        {
            "text": "This takes into account factors such as safety, what is best for the community and environmental sensitivities. This matter is relevant to UK and other member states recognising that achieving ‘green field’ (unrestricted use) might not be the optimal outcome or represent the best value for the respective taxpayer."
        },
        {
            "text": "Colleagues from Dounreay and Sellafield presented their work on robotics and laser cutting, showcasing that in some areas we are leading the way in how we’re adopting innovative ways of working to address some of our more complex challenges."
        },
        {
            "text": "We also had the opportunity to meet with government colleagues from the Energy Department and from wider government at the UK mission in Vienna to understand the bigger picture and how what we’re doing helps contribute to the international discussions they lead on UK’s behalf."
        },
        {
            "text": "Additionally, James Sant, IIND (Integrated Innovation in Nuclear Decommissioning) Active Demonstrator Lead from the Remediation value stream at Sellafield won a young professionals competition and was selected to attend and present at the conference sharing how the NDA funded innovation programme for remote integrated decommissioning solutions is progressing to trials at Sellafield and the challenges that will bring."
        },
        {
            "text": "We also took the opportunity to include Joe Watton, one of our NDA funded PhD students at the University of Leeds, in the conference and relevant side meetings so he could understand the opportunities a career in nuclear decommissioning can offer."
        },
        {
            "text": "Sharing and benchmarking our progress is key in us having confidence to deliver the mission, and part of being trusted to do more. We’ll be taking the opportunity to build on the links we made at the conference to progress further discussions on knowledge sharing and collaborative work."
        },
        {
            "text": " "
        }
    ]
}