{
    "url": "https://digitaltrade.blog.gov.uk/2023/06/09/spotlight-on-ddat-data-analysts/",
    "title": "Spotlight on: DDaT Data Analysts",
    "authors": [
        "Rachael Irwin, Data Analyst"
    ],
    "categories": [
        "People",
        "Professions"
    ],
    "pub_date": "2023-06-09T10:10:55+01:00",
    "content": [
        {
            "text": "On 11 May 2023, the Data Analysts from the Datasets and Analysis team got together at Old Admiralty Building (OAB) for their first away day of the year. For 2 of the analysts, based in Belfast, it was their first visit to OAB. It was an invaluable opportunity to meet the team in person for the first time. "
        },
        {
            "heading": 2,
            "text": "Who are we?"
        },
        {
            "text": "We are part of the Digital, Data and Technology (DDaT) team at the Department for Business and Trade (DBT). The team cover everything from data, development, design, content and user research to product and delivery. This allows the UK Government to support businesses in the UK and overseas.  "
        },
        {
            "text": "The Datasets and Analysis team are part of the wider Data Infrastructure team. Our work involves making quality data available across DBT. Our goal is to make DBT the world’s leading government department for trade-related data. We work with stakeholders to onboard new datasets to our central reporting and analysis platform, Data Workspace. We also support analysis and data visualisation projects and run bootcamps to train others across the department in our tools.   "
        },
        {
            "text": "Our team organises the annual DBT Data Challenge during DDaT week. Project ideas are proposed from teams across the department. Then we assign a member of our team to collaborate and support on the project throughout the week. This year, 7 projects were chosen and over 140 colleagues from across DBT attended the Awards and Showcase Ceremony. The challenge provides a wonderful opportunity to develop new data and digital skills, work with different teams and highlights the innovative work happening in DBT.  "
        },
        {
            "heading": 2,
            "text": "What did we get up to?"
        },
        {
            "text": "The analysts from Belfast arrived at OAB after their first experience of rush hour on the tube. So, after a much-needed coffee, we kicked off with the first of 3 workshops organised by the team.  "
        },
        {
            "text": "The first workshop, organised by our Delivery Manager Laxmi Kerai, was a series of ice breakers. They were designed to: "
        },
        {
            "text": "The second workshop led by Heidi de Sousa, a Senior Data Analyst, saw some members of the Data Science team join us.  We discussed what aspects of a team make it function well and allow it to be an enjoyable environment to work in. These led to discussions on how we collaborate, support and challenge each other. They helped us to form our team charter, a short list that defines our team’s mission and guides our ways of working together.  "
        },
        {
            "text": "After a short walk through St. James’s Park and lunch from Strutton Ground Market (can highly recommend!), we all joined the weekly DDaT Huddle. We listened to updates from across the directorate and took part in a Eurovision quiz, where answering Ireland seemed to get you most of the correct answers.   "
        },
        {
            "text": "The third and final workshop was led by Agnes Coaker, another Senior Data Analyst from our team. It allowed the analysts to create workflows which can now be followed to solve 3 common helpdesk requests. This was particularly useful for new members of the team. They now have a tried and trusted method to follow in the future, speeding up our help desk replies.  "
        },
        {
            "text": "It was a great trip for the analysts from Belfast to meet the wider team and take part in 3 very effective workshops that will help the team moving forward.   "
        },
        {
            "heading": 2,
            "text": "Next time"
        },
        {
            "text": "In July, the analysts and some of the wider team from London, will join the Belfast team members for more workshops and maybe even a Boojum burrito (a Belfast must!).  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}