{
    "url": "https://educationhub.blog.gov.uk/2023/06/09/what-are-we-doing-to-recruit-more-teachers-and-improve-retention/",
    "title": "What are we doing to recruit more teachers and improve retention?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-06-09T09:21:20+01:00",
    "content": [
        {
            "text": "Schools in England now have more teachers than ever before, with more than 468,000 in the profession. That’s 27,000 more than there were in 2010 and up by 2,800 since last year."
        },
        {
            "text": "The latest stats from the Department for Education show that teaching remains an attractive profession, with over 16,700 teachers choosing to rejoin state schools this year."
        },
        {
            "text": "What’s more, the majority of the time, pupils are taught by subject specialists. Around 87% of the English Baccalaureate (EBacc) teaching hours in secondary schools were taught by a teacher with a relevant post A level qualification. The EBacc is core subjects taken at GCSE like maths, English, science, modern foreign languages, history and geography."
        },
        {
            "text": "Driving up standards in education continues to be a priority for this government."
        },
        {
            "heading": 3,
            "text": "What are we doing to recruit more teachers?"
        },
        {
            "text": "This data shows that teaching remains an attractive and rewarding profession. However, we are committed to doing more to make sure we are recruiting the best and brightest educators for our young people."
        },
        {
            "text": "In some key subjects we offer tax free bursaries worth up to £27,000 and scholarships worth up to £29,000. We provide funding for programmes to boost subject knowledge, and we are developing a new physics Initial Teacher Training course for engineers."
        },
        {
            "text": "We are also supporting recruitment and retention of specialists in areas where they are most needed through the Levelling up Premium."
        },
        {
            "text": "The Levelling Up Premium is worth up to £3,000 tax-free annually for maths, physics, chemistry and computing teachers in the first five years of their careers who choose to work in disadvantaged schools, including in Education Investment Areas."
        },
        {
            "text": "We remain committed to increasing teacher starting salaries to £30,000 from September 2023 to make teaching an attractive option for high quality graduates."
        },
        {
            "heading": 3,
            "text": "What are we doing to encourage teachers to stay in the profession?"
        },
        {
            "text": "We want teaching to remain an attractive profession. Teacher retention is key to ensuring effective teacher supply and quality, and we are taking action to support teachers to stay in the profession and thrive."
        },
        {
            "text": "We have published a range of resources to help address teacher workload and wellbeing and support schools to introduce flexible working practices."
        },
        {
            "text": "We also know that offering high quality continuing professional development improves teacher retention. That’s why we’re delivering the biggest teaching reform in a generation – the Early Career Framework (ECF) – which provides the solid foundations for a successful career in teaching, backed by over £130 million a year in funding when fully rolled out."
        },
        {
            "text": "The ECF reforms aim to support teachers and school leaders to feel more confident and in control of their careers. It sets out what all early career teachers should learn about and learn how to do during the first two years of their careers."
        },
        {
            "heading": 3,
            "text": "Teachers leaving the profession"
        },
        {
            "text": "During the first two years of the pandemic, we expected the number of teachers leaving the sector to fall because of the pandemic’s impact on employment. Now, the numbers we are seeing are roughly back to pre-pandemic levels."
        },
        {
            "text": "Each year, more teachers join state schools than leave. This means that the overall number of teachers teaching full-time has increased by over 2,800 since 2021."
        },
        {
            "text": "We have taken a wide range of steps to address teacher workload and wellbeing and we are improving support for early career teachers and professional development for teachers at all stages of their career."
        },
        {
            "heading": 3,
            "text": "What about the number of teacher vacancies?"
        },
        {
            "text": "While the number of vacancies has risen in the past two years, the rate remains low with only five vacancies per 1,000 teachers."
        },
        {
            "text": "Many other industries have also seen a rise in the number of job vacancies. The latest ONS figures covering the closest time period to the School Workforce Census collection show that despite growing slightly, the vacancy rate for education at 2.8%, still falls short of the UK average of 3.6%"
        }
    ]
}