{
    "url": "https://movingon.blog.gov.uk/2022/10/26/encouraging-bus-operators-to-keep-to-their-timetables/",
    "title": "Encouraging bus operators to keep to their timetables",
    "authors": [
        "Stephen Spendley"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2022-10-26T14:56:48+01:00",
    "content": [
        {
            "text": "Outside London, 1.41 billion bus journeys were taken last year. Each of these journeys played a key role in getting people to their destinations. Whether it’s going to work or school, or visiting friends and relatives, passengers need the services to be punctual and reliable.  "
        },
        {
            "text": "Local bus services in England (outside of London and Hertfordshire) and Wales must be registered with the Traffic Commissioner and signed up to, and using, the bus open data service. In London and Hertfordshire, this task has been assigned to the relevant local authority (council). "
        },
        {
            "text": "Bus operators are expected to achieve the punctuality levels set out in the Senior Traffic Commissioner’s statutory document for local bus services. In Scotland, different regulations apply. "
        },
        {
            "text": "We realise there are challenges to this and we have increased vocational testing capacity to help support more drivers into the vocational driving industry. However, we acknowledge that recruitment regionally is ongoing and understand that this poses challenges for operators while providing vital services for communities. "
        },
        {
            "text": "It is important that contingency plans are put in place to ensure services continue runnning because your passengers need to see that your bus service is reliable and know what they can do if they encounter issues.   "
        },
        {
            "heading": 2,
            "text": "What bus operators can do "
        },
        {
            "text": "Bus services should depart from timing points up to 1 minute early and 5 minutes late, and 95% of your registered services need to operate within this window.  "
        },
        {
            "text": "There are unplanned situations that can delay a bus service such as extreme weather conditions, accidents, and no-notice roadworks. But overall, bus services should be able to operate and run to their registered timetable.   "
        },
        {
            "text": "To help establish any timetable issues, it’s recommended that operators monitor their routes which could include the use of daily logs. You should also get feedback from drivers and keep records of anything that affects the reliability of the service.   "
        },
        {
            "text": "Having full and regular contact with local authorities and other relevant parties (such as utility companies) may help to get advance notice of potential disruption to services, such as roadworks.  Bus operators should communicate any potential disruption to passengers as early as they can.  "
        },
        {
            "text": "Where appropriate, by regularly reviewing the registered timetables, operators can be proactive in submitting variations to timetables so they comply with the details they have registered..   "
        },
        {
            "text": "You can read more about this in the statutory guidance.  "
        },
        {
            "heading": 2,
            "text": "What is DVSA’s role? "
        },
        {
            "text": "We monitor bus services in England and Wales to ensure they’re running to their registered timetable ensuring that customers are getting the service they expect.   "
        },
        {
            "text": "When we receive a complaint from a member of the public, we will approach you as the bus operator for a statement on the allegation, including the cause and what you are going to do to prevent further occurrences.   "
        },
        {
            "text": "We want to work with operators to make improvements, so depending on the number and severity of the issues, we may:  "
        },
        {
            "text": "This means we will assess at least 10% of your services - not just the one we’ve received the complaint about. To establish how the service is operating overall, we would monitor both days and times relating to the complaint and other times.   "
        },
        {
            "text": "If the monitoring is unsatisfactory, we will:  "
        },
        {
            "text": "If the monitoring is satisfactory, we will let you know that we may continue to monitor your services for punctuality.  "
        },
        {
            "heading": 2,
            "text": "Referral to the Traffic Commissioner"
        },
        {
            "text": "If an assessment of your systems is unsatisfactory, before we would consider referring you to the  Traffic Commissioner, we would:  "
        },
        {
            "text": "You may need to make some improvements. These could include:  "
        },
        {
            "text": "We don’t tell you exactly what to do to improve your service – you will be free to decide on what measures will work best for your organisation.   "
        },
        {
            "text": "That way, you’ll be keeping to your commitments, and providing the best possible service to passengers.  "
        }
    ]
}