{
    "url": "https://educationhub.blog.gov.uk/2022/10/26/how-tutoring-is-working-in-schools/",
    "title": "How tutoring is working in schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "tutoring"
    ],
    "pub_date": "2022-10-26T14:28:24+01:00",
    "content": [
        {
            "text": "Primary and secondary schools are offering one-to-one or small group tuition to pupils that need extra help. Through the National Tutoring Programme (NTP) over two million tutoring sessions have started."
        },
        {
            "text": "The programme is now in its third year, and we look at the impact tutoring had on both pupils’ attainment and confidence in the second year."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the National Tutoring Programme? "
        },
        {
            "text": "The National Tutoring Programme (NTP) is helping pupils across the country catch-up on missed time in school due to the pandemic. It gives pupils access to one-to-one or small group teaching with specialist tutors."
        },
        {
            "text": "The programme provides schools access to high quality subsidies tutoring through three separate routes - tuition partners, academic mentors, and school-led tutoring."
        },
        {
            "text": "These tutors – who have all been subject to robust high-quality training and safeguarding checks – can provide additional capacity to schools to support disadvantaged pupils who have been impacted by disruption to their education."
        },
        {
            "text": "Information on how the three routes operate can be accessed via the NTP website How to guide - NTP (nationaltutoring.org.uk)."
        },
        {
            "text": "The NTP provides tuition funding in five main subject areas:"
        },
        {
            "text": "Tuition is very flexible and can happen in-school, either online or face-to-face, or during the school holidays. These arrangements will depend on individual circumstances such as suitability for schools and parents, and tutor availability."
        },
        {
            "text": "Tutoring is helpful because it can make a difference to academic progress that can be expressed in months."
        },
        {
            "heading": 3,
            "text": "What does this report show?"
        },
        {
            "text": "Most school leaders and teachers were generally positive about all three tutoring routes, although favoured the school led route because they valued control and autonomy over delivery of tutoring, the report on the second year of the programme showed."
        },
        {
            "text": "Most senior leaders involved in each of the individual routes perceived tutoring was having a positive impact on pupils’ attainment, self-confidence and them catching up with their peers."
        },
        {
            "text": "In addition, the majority who were participating in the programme were satisfied with the quality of tuition across all three routes, yet a minority had found it difficult to access provision and lacked confidence in being able to obtain high-quality tutoring."
        },
        {
            "text": "However, the report concluded that some schools were not participating in the programme because they felt the subsidies were insufficient but could be encouraged to participate in the future if subsidies were increased."
        },
        {
            "text": "You can view the report here: National Tutoring Programme year 2: implementation and process evaluation - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Have Ofsted also done a report on tutoring? "
        },
        {
            "text": "Ofsted has also published an evaluation of tutoring and catch-up support more widely."
        },
        {
            "text": "The key findings of this report support our findings in that school leaders wanted greater autonomy over the delivery of tutoring, which has been implemented this academic year in light of this feedback."
        },
        {
            "text": "All three tutoring routes were perceived to have a positive impact on pupils’ attainment, self-confidence and them catching up with their peers, but School Led Tutoring (SLT) was thought to have the most impact."
        },
        {
            "text": "Senior leaders also raised increased workload as an issue. They felt that they would benefit from being able to use some funding for the day-to-day running of the programme in their school."
        },
        {
            "text": "Following the changes to the funding available to schools, we will continue to monitor the take-up of the programme and impact of tutoring on pupils."
        },
        {
            "text": "You can view the report here: Independent review of tutoring in schools and 16 to 19 providers - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "How do you plan to use the feedback from the report? "
        },
        {
            "text": "Over two million tutoring sessions have been started through the National Tutoring Programme and the reports highlight the positive impact that tutoring is having on both pupils’ attainment and confidence."
        },
        {
            "text": "We have already taken on board feedback by introducing school-led tutoring and providing £349million of funding directly to schools to give them greater autonomy and will continue to work closely with the sector as we move towards our target of starting six million tutoring courses by 2024."
        },
        {
            "text": "We have simplified the programme for the 2022 to 2023 academic year and are offering support to any school that requires it. All School-Led Tutors and Academic Mentors complete training with the Education Development Trust."
        },
        {
            "text": "We have also commissioned a further evaluation of the programme, which examines its implementation this academic year, and aims to assess the impact of the programme on pupil academic attainment. The first outputs from this evaluation will be published early next year."
        }
    ]
}