{
    "url": "https://educationhub.blog.gov.uk/2022/10/how-to-access-support-for-food-during-the-half-term/",
    "title": "Help for Households – how to access support during the half term",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Help for Households"
    ],
    "pub_date": "2022-10-26T13:56:38+01:00",
    "content": [
        {
            "text": "Free school meals are only available during term time."
        },
        {
            "text": "Families on low incomes may be able to access food vouchers and other types of support over the half term through their local authorities."
        },
        {
            "text": "Delivered through the Department for Work and Pensions (DWP) Household Support Fund scheme, local authorities are responsible for determining what support they provide."
        },
        {
            "text": "If local authorities decide to provide food vouchers using the Household Support Fund, this would be subject to the local authority’s own eligibility criteria and DWP’s guidance."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What are food vouchers?"
        },
        {
            "text": "Local authorities can deliver the scheme through a variety of routes including providing vouchers to households, making direct provision of food or goods, or issuing grants to third parties."
        },
        {
            "text": "Vouchers can be given to families in need and the amounts can vary depending on the local authority area and how many children reside in the household."
        },
        {
            "text": "These vouchers can then be redeemable at a number of food outlets including supermarkets or foodbanks. If you are unsure on the support your council is providing, you must contact them directly. For those unsure on how to contact their council, visit: Find your local council - GOV.UK (www.gov.uk) and enter your postcode."
        },
        {
            "heading": 3,
            "text": "Are food vouchers the same as free school meal support?"
        },
        {
            "text": "No. Food vouchers are not the same as free school meals. Free school meals are only available to those eligible during term time only."
        },
        {
            "heading": 3,
            "text": "Are food vouchers the same as the Holiday Activity and Food Programme (HAF)?"
        },
        {
            "text": "No. The HAF programme provides free holiday club places with enriching activities and healthy meals to eligible children from low-income families. It runs during the longer school holidays: Easter, summer and Christmas."
        },
        {
            "text": "To see what else the government is doing to help households, please visit: Help for Households - Get government cost of living support."
        }
    ]
}