{
    "url": "https://despatch.blog.gov.uk/2022/10/26/how-we-are-creating-social-media-content-to-grab-learner-drivers-attention-and-get-them-to-act/",
    "title": "How we are creating social media content to grab learner drivers’ attention",
    "authors": [
        "Abigail Britten"
    ],
    "categories": [
        "Learning to drive",
        "Ready to Pass?"
    ],
    "pub_date": "2022-10-26T12:19:53+01:00",
    "content": [
        {
            "text": "We are all busy and have a lot of things competing for our attention. We also often multitask so it can be hard to get our full attention when required."
        },
        {
            "text": "Learner drivers are no different and will be juggling learning to drive along with their busy lives. This also means we will be competing for their attention on social media alongside any number of other interests they have."
        },
        {
            "text": "The ‘Ready to Pass?’ campaign is a no-cost campaign and means we cannot spend any money promoting it. So, we need to work really hard to create social media content that grabs learner drivers’ attention to get our messages across."
        },
        {
            "text": "In this blog post, Abigail Britten, Head of Recovery Communications talks about how we’ve been doing that."
        },
        {
            "text": "Saying it again and again to as many of our target audience as possible"
        },
        {
            "text": "Research shows that if you want your audience to change their behaviour you need to get your message to as many of your target audience as possible as often as possible."
        },
        {
            "text": "So, this means we need to look for ways to get our messages in front of as many learner drivers as possible as many times as we can."
        },
        {
            "text": "If you tell a person something once, they are unlikely to act on it. However, if you tell them multiple times and give them reminders around the time of a decision you improve your chance of getting them to take the desired action."
        },
        {
            "text": "This is especially true for those aged between 16 and 24 years."
        },
        {
            "text": "Use the channels our audiences use "
        },
        {
            "text": "Understanding your target audience and what social media they use is essential for campaign success."
        },
        {
            "text": "We needed to find out about what social media channels learner drivers use. 16-to 24-year-olds make up the largest group of people learning to drive, and research by Ofcom in 2022 tells us that Instagram, YouTube and TikTok are the most popular news sources for information for young people."
        },
        {
            "text": "So, for the launch of the ‘Ready to Pass?’ campaign, we repurposed DVSA Instagram channel to help us connect with learner drivers and to make it a channel specifically aimed at them."
        },
        {
            "text": "We’ve also been working with our partners to explore how we can use their TikTok channels to get our campaign messages across to learners and pre-learners. We’ll share more about this in the coming weeks."
        },
        {
            "text": "Increasing our Instagram followers"
        },
        {
            "text": "The relaunch of our Instagram account was a massive success. We increased our followers by 25,000 and 58% of our audience are aged between 16 to 34. Our animated motion graphics have been viewed, liked and shared the most which shows this is the type of content learner drivers prefer. This is called engagement."
        },
        {
            "text": "The challenge now is to maintain this engagement, as well as attract more followers with regular, new and varied content. For example, one way we’ve managed to keep engagement high and gained more eyes on our content is by creating quizzes from the Highway Code. This increased engagement to around 80 comments per post from around 5 comments per post previously."
        },
        {
            "text": "Making more content for YouTube"
        },
        {
            "text": "This is an important channel for us because 55% of learner drivers are visiting YouTube to find out information about the driving test and is their third biggest source of information about this."
        },
        {
            "text": "So we published a campaign launch video on YouTube."
        },
        {
            "text": "We will create more content for learners and pre-learners for this channel. This will help to make sure we get the attention of learner drivers when they are looking for driving test guidance on YouTube."
        },
        {
            "text": "Creating engaging content "
        },
        {
            "text": "For our social media channels to be successful, good content is important. Our messages should always be clear, high quality, engaging and relevant to our audiences."
        },
        {
            "text": "We will continue to make new and engaging content that is suitable for younger audiences."
        },
        {
            "text": "To keep our audience’s attention on a daily basis, we:"
        },
        {
            "text": "How you can help"
        },
        {
            "text": "We are always on the lookout for new ideas for content that will help get our ‘Ready to Pass?’ messages in front of learner drivers."
        },
        {
            "text": "You talk to your pupils and their parents on a daily basis, so we would love to hear from you any ideas you have for new content for Instagram and YouTube that they would find engaging and helpful.  If you have any ideas you want to share with us please add them to the comments below."
        },
        {
            "text": "Also, to help you promote the ‘Ready to Pass?’ campaign with your pupils, we have developed a communications toolkit. It includes:"
        },
        {
            "text": "Download our communications toolkit."
        }
    ]
}