{
    "url": "https://buyingforschools.blog.gov.uk/2022/10/26/my-experience-of-using-the-get-help-buying-for-school-service/",
    "title": "My experience of using the Get help buying for schools service",
    "authors": [
        "Kieren Done, School Business Manager at St Ambrose College"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-10-26T14:55:54+01:00",
    "content": [
        {
            "text": "Kieren Done is a School Business Manager at St Ambrose College, a grammar school in Altrincham, Manchester with around 1000 pupils. Kieren recently used the Get help buying for schools service to buy audit services for his school."
        },
        {
            "text": "In this blog post, Kieren shares his experience of using Get help buying for schools and how it could help you with your buying too."
        },
        {
            "text": "I was looking to buy audit services for my school and after initially hearing about the Get help buying for schools service through the ESFA Power Hour, I searched online and found the service straight away on GOV.UK. The process of submitting a query was very quick and simple, which I wasn’t expecting because in my experience there are usually various pages to get through with these kinds of things, plus the occasional log in process! However, in this instance, I was taken straight to the enquiry form which then only took around 5 minutes to complete."
        },
        {
            "text": "I was surprised with how quickly the team got back to me to set up a meeting following the initial online enquiry. I was expecting to have to wait a few days for a response, but I received a call from the team that same day and they quickly arranged a virtual meeting to go through my requirements in more detail, which was extremely helpful."
        },
        {
            "text": "My queries were quite specific, but the team were able to answer all my questions and I felt confident that they had understood my requirements. I had complete trust in the team and their expertise throughout the process."
        },
        {
            "text": "The team provided me with all the support I needed, including help with writing the specification for the tender, and made it clear that I was under no obligation to go ahead at any point in the process if I didn’t want to."
        },
        {
            "text": "I ended up using the CPC audit services framework on the advice of the Get help buying for schools service. The framework is free to access, and I found it easy to use, but I was reassured that the team were still there to support me if I needed them."
        },
        {
            "text": "We appointed an auditor, and the process has assured me that we achieved value for money and were fully compliant."
        },
        {
            "text": "I achieved everything that I wanted when I set out with my initial enquiry to Get help buying for schools. The school business manager role is so unique, and you manage so many things, sometimes it feels that you are barely scratching the surface. I wanted to get this right and make sure it was compliant. I also wanted to get value for money."
        },
        {
            "text": "Using Get help buying for schools ticked all those boxes – I am reassured that I am doing everything right, it has saved me time, and with an estimated saving of between £3-5k, it is delivering value for money."
        },
        {
            "text": "I will definitely use the Get help buying for schools service again. If you’ve got access to experts and there is no cost and no obligation, it’s a no-brainer – why wouldn’t you?"
        },
        {
            "text": "We’ve already launched tenders for LED lighting and MFDs this term and the Get help buying for schools service was again very helpful in reviewing the relevant documents."
        }
    ]
}