{
    "url": "https://ukhodigital.blog.gov.uk/2022/10/26/progress-to-date-uk-centre-for-seabed-mapping-uk-csm/",
    "title": "Progress to date - UK Centre for Seabed Mapping (UK CSM)",
    "authors": [
        "David Parker"
    ],
    "categories": [
        "Seabed 2030",
        "Seabed mapping",
        "UK CSM"
    ],
    "pub_date": "2022-10-26T14:46:38+01:00",
    "content": [
        {
            "text": "Since its launch in June 2022 The UK Centre for Seabed Mapping (UK CSM) has grown from 5 to 15 members. Members are public-sector organisations who share a common interest in marine geospatial information. The UK CSM, which is administered by the UK Hydrographic Office (UKHO), has a core focus on bathymetry and associated data. The UK CSM aims to enable a more unified voice to promote seabed mapping and the resultant data, as the foundation data set for the marine environment, and as a key element of the UK’s national infrastructure."
        },
        {
            "text": "This will be achieved through increased coverage, quality and access of seabed mapping data collected from public money or in collaboration with industry. The UK CSM is also a UK government voluntary commitment to the UN Ocean Decade, and goes hand in hand with the UKHO support of the Nippon Foundation GEBCO Seabed 2030 project."
        },
        {
            "heading": 2,
            "text": "Looking forward to a more focused collaboration"
        },
        {
            "text": "This month the UK CSM hosted its second Management Group and inaugural Working Group meetings online, chaired by David Parker, UKHO Head of Hydrographic Programmes. The Working Groups focused on the themes of national and international collaboration, data collection standards and specifications."
        },
        {
            "text": "The UKHO also hosted the inaugural Steering Committee meeting, chaired by National Hydrographer RAdm Rhett Hatcher, which brought together Government Departments. Members were invited to discuss current levels of funding, data accessibility and upcoming survey plans, with all organisations looking forward to more focused collaboration."
        },
        {
            "text": "“The UK Centre for Seabed Mapping is all about organisations across the marine environment coming together to improve the collection of and access to data, and collaborate to reinforce its importance. Bringing the current members together this month was hugely beneficial, and further endorses the importance of being a member of the UK CSM and what the initiative can achieve."
        },
        {
            "text": "We hope that more organisations will sign the MOU over the coming months and join existing members in making positive impacts in the marine geospatial sector, helping unlock a greater understanding for us all to support safe, secure and thriving oceans.  "
        },
        {
            "text": "We’ll be attending this weeks GEBCO Map the Gaps Symposium, where the UKHO will be showcasing the UK CSM, and I’ll be speaking on behalf of the UK CSM members. We hope to engage with as many people as possible at the event, and invite anyone to come along to our stand to find out more, or email us ukcsm@ukho.gov.uk”   Emma Brown – Hydrographic Programmes Officer."
        }
    ]
}