{
    "url": "https://gott.blog.gov.uk/2022/10/26/what-is-gott-interview-with-dr-alison-campbell-gott-ceo/",
    "title": "What is GOTT? Interview with Dr Alison Campbell, GOTT CEO",
    "authors": [
        "Jemima Gibbons"
    ],
    "categories": [
        "Alison Campbell",
        "Knowledge Assets Grant Fund",
        "Policy"
    ],
    "pub_date": "2022-10-26T08:57:59+01:00",
    "content": [
        {
            "text": "The Government Office for Technology Transfer officially launched last week. We caught up with Alison to find out more about her vision and plans for the new unit."
        },
        {
            "heading": 2,
            "text": "What is GOTT and why it has it been set up? "
        },
        {
            "text": "The Government Office for Technology Transfer (GOTT) is a new cross-government unit that has its genesis in the Cabinet Office and HM Treasury. Our objective is to support government-funded organisations and government departments in their management of intangible assets, such as intellectual property and knowhow, including their development and value creation. The potential value of knowledge assets was set out in the Mackintosh Report of 2021 and this was followed by publication of the Rose Book in the same year. The Rose Book explains the concepts and practicalities behind managing knowledge assets in government and the public sector.  "
        },
        {
            "heading": 2,
            "text": "Okay. So, what exactly does GOTT do? "
        },
        {
            "text": "As GOTT, our role is to provide guidance and to offer practical advice and support across government to help organisations develop their knowledge assets strategies and to become more effective at identifying and developing their intangible assets for adoption. That might mean sharing them across government, using them in collaboration with the private sector, offering external advisory services or through commercialisation - for example, licensing to an existing organisation or even creating a new company.  "
        },
        {
            "heading": 2,
            "text": "How do you see your role as CEO? What are your main responsibilities? "
        },
        {
            "text": "I came into post earlier this year to establish GOTT, having previously led the national office for knowledge transfer in Ireland. Before that I worked in UK public and private sector research commercialisation. I’m coming into GOTT at an exciting time. The wealth of knowledge assets across the public sector and their potential to drive innovation, productivity and growth is significant.  "
        },
        {
            "text": "In my few months in the job, I’ve had the chance to hear first hand about the collaborations with the private sector that organisations as diverse as the Science and Technology Facilities Council (STFC) and the Royal Botanic Gardens Kew are involved in. I’ve seen the value of the GOTT Knowledge Asset Grant Fund to the Office of National Statistics (ONS) and the National Physics Laboratory (NPL) in exploring projects with significant commercial and societal benefit. And I have learned about business processes developed in the Department for Education that have been adopted by HM Treasury which, for both Departments, have driven efficiency, saved £millions and improved job satisfaction.  "
        },
        {
            "heading": 2,
            "text": "Tell us about the expertise you have on your team. How is GOTT structured? "
        },
        {
            "text": "The GOTT team includes policy professionals and technology transfer specialists which means that we can address issues that range from policy dialogue and influence through to direct involvement with exploitation projects. We also manage the Knowledge Asset Grant Fund (KAGF), that can offer up to £250,000 towards the development of commercially attractive opportunities. And we have access to a dedicated public sector seed fund, UKI2S, that can invest in knowledge assets-based spin out companies. We’re also planning to develop training to support knowledge asset and IP identification and exploitation in the public sector context. GOTT is a small team and, as we develop, it will be important to work with partners across the public and private sectors to leverage capability.  "
        },
        {
            "heading": 2,
            "text": "What’s your advice to anyone who thinks they might have knowledge assets in their organisation but doesn’t know what steps to take? "
        },
        {
            "text": "For anyone in government and the public sector who thinks they might have knowledge assets in their organisation and would like to know more, including how to approach developing and exploiting them, the first port of call should be the Rose Book. It’s a mine of useful information and really sets the context. After that, I’d say - contact us in GOTT and we can explore how best to support you through your knowledge assets journey.  "
        }
    ]
}