{
    "url": "https://kingsawards.blog.gov.uk/2018/08/08/nouveau-lashes-winning-a-queens-award-was-a-team-effort/",
    "title": "Nouveau Lashes: winning a Queen's Award was a team effort",
    "authors": [
        "Bridgette Softley"
    ],
    "categories": [
        "International trade",
        "Recipients"
    ],
    "pub_date": "2018-08-08T08:00:31+01:00",
    "content": [
        {
            "text": "Nouveau Lashes is one of the 2018 Queen's Awards for International Trade winners. Bridgette Softley, Director of Nouveau Lashes, shares her thoughts on why they have applied and what it has meant to win."
        },
        {
            "text": "Nouveau Lashes is an eyelash extension brand that supplies training and professional in-salon products to the beauty industry. Already market leaders in professional treatments and products, we have gained a strong consumer following and are now focusing on an exciting new line of home lash care solutions."
        },
        {
            "heading": 2,
            "text": "Our decision to apply for Queen's Awards"
        },
        {
            "text": "One of our employees Keith Lockyer, International Business Development Manager, brought it to my attention and recommended we enter the awards. With a lengthy application process that requires lots of information to be gathered from various areas of the business we discussed the pros and cons of entering with our PR manager. I am pleased to say the positive reasons to enter outweighed the negative which were only related to time and available resource. Having won the award, it definitely has proven a worthwhile investment of the team’s time."
        },
        {
            "text": "There seems to be awards for everything these days so I am passionate that we only enter those that mirror our culture and support our business goals. After looking over the category options and discussing recent achievements it made perfect sense to enter the category for ‘International Trade’. In addition to our UK network of training academies, Nouveau Lashes now trades across 52 countries around the world. The company’s focused approach on market-leading innovations in treatments and products has seen us consistently grow sales and expand into new markets. Last year alone, our export performance contributed to a 41% increase in turnover."
        },
        {
            "heading": 2,
            "text": "Winning the Award for International Trade"
        },
        {
            "text": "I am extremely proud that Nouveau Lashes have been awarded The Queen’s Award for Enterprise in International Trade. When I first received the news, I was in shock and having to keep it a secret from the team until the embargo was lifted was very hard. As someone very patriotic I wanted to shout it from the rooftops. As soon as the embargo was lifted I organised a celebratory brunch with a themed Queens Awards cake for our employees who are split between the South Yorkshire and Purley sites. We also had Nouveau Lashes and royal themed biscuits made by Biscuiteers which we sent as part of a creative mailer to our Distributors, suppliers and media contacts. The edible treats went down very well. Brand fan and influencer In The Frow (Victoria Magrath) even shared our news with her 835k followers!"
        },
        {
            "text": "The award win has really boosted staff and distributor morale. I made it very clear the win was a team effort and that everyone should feel immensely proud. After all the Queens Awards are the highest official UK awards for British businesses. To be able to include the royal stamp of approval on your product is arguably the highest accolade the brand has received to date and we have won a lot of awards."
        },
        {
            "heading": 2,
            "text": "Advice for Queen's Awards hopefuls"
        },
        {
            "text": "Do not hesitate! Yes it can be a time-consuming task but while gathering all the information needed it also makes you realise just how far you have come. 12 years ago, when my Co-Director Karen Betts and I set out on our journey to find a solution for women living with hair and lash loss conditions I would never have imagined we (that’s the whole team at Nouveau Lashes) would turn something that looked like a bag of spider’s legs into a multi-million pound business."
        },
        {
            "text": "Subscribe to updates from this blog, or follow us on Twitter and LinkedIn."
        }
    ]
}