{
    "url": "https://valuationoffice.blog.gov.uk/2025/04/15/how-we-value-properties-for-business-rates-the-contractors-basis-method/",
    "title": "How we value properties for business rates: the contractors basis method",
    "authors": [
        "Alan Colston - Chief Valuer and Head of Surveying Profession"
    ],
    "categories": [
        "Business Rates",
        "How We Value",
        "Valuation Methods"
    ],
    "pub_date": "2025-04-15T15:40:53+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "In our first two blogs, we explained how we usually value properties using rental comparison, and how we apply the receipts and expenditure method when a property is profit-driven but lacks rental information.  "
        },
        {
            "text": "But what about properties that are rarely rented out and don’t operate for profit? For these special cases, we use what's called the contractor's basis method."
        },
        {
            "heading": 2,
            "text": "What is the contractor’s basis method?"
        },
        {
            "text": "This approach is used to value properties like:"
        },
        {
            "text": "Think of this method as answering a hypothetical question: \"what rent would someone pay for this property before deciding it would be better to build a new one instead?\""
        },
        {
            "text": "We answer this question by:"
        },
        {
            "text": "Finally, we multiply the total cost (also known as effective capital value) by something called a ‘decapitalisation rate’ - this is set by law and helps us convert the effective capital value into an annual rental value."
        },
        {
            "text": "For example, say we’re valuing a community centre. If the total estimated cost of the property and land is £1 million, and the legal decapitalisation rate is 5%, the annual rental value would be £1 million multiplied by 5% equalling a total rental value of £50,000. This £50,000 becomes the rateable value used to calculate business rates."
        },
        {
            "text": "This method ensures we can value properties fairly, even when a rental market does not exist."
        },
        {
            "heading": 2,
            "text": "How can I find out more?"
        },
        {
            "text": "You can sign up for a business rates valuation account to find out more about how your rateable value has been calculated.  "
        },
        {
            "text": "Further information on the rental comparison method of valuation can be found in the VOA Rating Manual Rating Manual section 4: valuation methods - Part 3: the contractor's basis of valuation - Guidance - GOV.UK."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Sut rydym yn prisio eiddo ar gyfer ardrethi busnes: dull sail y contractwr"
        },
        {
            "text": "Yn ein dau blog cyntaf, fe wnaethom esbonio sut rydym fel arfer yn prisio eiddo gan ddefnyddio cymhariaeth rhent, a sut rydym yn cymhwyso'r dull derbyniadau a gwariant pan fydd eiddo yn ddibynnol ar elw ond heb wybodaeth rhent. "
        },
        {
            "text": "Ond beth am eiddo sy'n anaml yn cael eu rhentu, a ddim yn gweithredu er elw chwaith? Ar gyfer yr achosion arbennig hyn, rydym yn defnyddio'r hyn a elwir yn ddull sail y contractwr."
        },
        {
            "heading": 2,
            "text": "Beth yw dull sail y contractwr?"
        },
        {
            "text": "Defnyddir y dull hwn i brisio eiddo fel:"
        },
        {
            "text": "Meddyliwch am y dull hwn yn nhermau ateb cwestiwn damcaniaethol: \"pa rent fyddai rhywun yn ei dalu am yr eiddo hwn cyn penderfynu y byddai'n well adeiladu un newydd yn lle hynny?\""
        },
        {
            "text": "Rydym yn ateb y cwestiwn hwn trwy:"
        },
        {
            "text": "Yn olaf, rydym yn lluosi cyfanswm y gost (a elwir hefyd yn werth cyfalaf effeithiol ) â rhywbeth o'r enw 'cyfradd ddatgyfalafu’ (decapitalisation rate) - mae hyn wedi'i osod gan y gyfraith ac yn ein helpu i drosi'r gwerth cyfalaf effeithiol yn werth rhent blynyddol."
        },
        {
            "text": "Er enghraifft, dywedwch ein bod ni'n prisio canolfan gymunedol. Os yw cyfanswm cost amcangyfrifedig yr eiddo a'r tir yn £1 miliwn, a'r gyfradd ddatgyfalafu gyfreithiol yn 5%, byddai'r gwerth rhent blynyddol yn £1 miliwn wedi'i luosi â 5% sy'n cyfateb i gyfanswm gwerth rhent o £50,000. Mae'r £50,000 hwn yn dod yn werth ardrethol a ddefnyddir i gyfrifo cyfraddau busnes."
        },
        {
            "text": "Mae'r dull hwn yn sicrhau y gallwn brisio eiddo yn deg, hyd yn oed pan nad yw marchnad rhentu yn bodoli."
        },
        {
            "heading": 2,
            "text": "Sut alla i ddarganfod mwy?"
        },
        {
            "text": "Gallwch gofrestru ar gyfer cyfrif prisio ardrethu busnes i ddarganfod mwy am sut mae eich gwerth ardrethol wedi'i gyfrifo."
        },
        {
            "text": "Gellir dod o hyd i fwy o wybodaeth am y dull sail y contractwr o brisio yn llawlyfr ardrethu Asiantaeth y Swyddfa Brisio Rating Manual section 4: valuation methods - Part 3: the contractor's basis of valuation - Guidance - GOV.UK"
        }
    ]
}