{
    "url": "https://medregs.blog.gov.uk/2025/04/15/medtech-regulatory-reform-and-the-importance-of-partnerships/",
    "title": "MedTech regulatory reform and the importance of partnerships",
    "authors": [
        "Rob Reid"
    ],
    "categories": [
        "Med Tech Regulations"
    ],
    "pub_date": "2025-04-15T11:07:55+01:00",
    "content": [
        {
            "text": "Medical technologies will play a critical role in delivering the government’s 10 Year Health Plan and its three shifts: hospital to community; analogue to digital; and sickness to prevention. Risk-proportionate regulation, which ensures patient safety whilst supporting innovation and access, will underpin the availability of these transformative technologies and is a key consideration for the multitude of stakeholders who need to work together to deliver change."
        },
        {
            "text": "The theme of this blog is the importance of partnerships to collaborate and deliver patient safety, innovation and access to medical technologies for the benefit of UK patients and the public. Working in partnership with stakeholders across national and devolved governments and with the NHS, patients, academia, and industry is essential as we progress with the reforms to medical device regulations. In this blog, I reflect on the importance of partnership working in our regulatory approach and highlight some of the key partnerships the MHRA’s Innovative Devices team is engaging with."
        },
        {
            "text": "Technology never stands still and regulations need to support evolution whilst sustaining certainty to innovators and manufacturers. Understanding the potential impact of emerging technologies and the regulatory opportunities and challenges they pose are important considerations as we update our framework. To support this work, the MHRA, the Office for Life Sciences, UK Research and Innovation, the Medical Research Council, and Innovate UK launched the UK Centres of Excellence for Regulatory Science and Innovation (CERSIs) in January to advance regulatory science and ensure the UK’s regulatory system is fit for the future. The end of March saw an important milestone as the seven CERSIs came together for the first time to discuss their goals, challenges and ways of working. With an opening address by Lord Vallance, the meeting was brimming with excitement and a palpable sense of optimism for an approach that is fundamentally centred on effective collaboration between partners."
        },
        {
            "text": "Our Innovative Devices team is providing the MHRA sponsorship for three of the seven CERSIs:"
        },
        {
            "text": "Close work with these CERSIs will provide valuable insight and access to academic and industry excellence in regulatory science, identifying and solving the regulatory problems of the future and ensuring the UK remains at the leading edge of innovative regulatory policy. I look forward to seeing the outputs from the teams and working with them to shape our future regulatory enhancements and innovative regulatory approaches."
        },
        {
            "text": "Speaking of innovative regulatory approaches, I was delighted that the second phase of our AI Airlock project was confirmed in the government's Regulation Action Plan, published recently. The value of early engagement between developers, regulators and health system partners was clear to see at the AI Airlock Connect event held on 11th March. Baroness Merron and Dr June Raine joined the four innovators and many partners taking part in our AI Airlock pilot, to share valuable insights into the regulation of AI as a medical device. The AI Airlock will be critical to help us ensure early access to effective and safe products."
        },
        {
            "text": "Confirmation of a second phase for AI Airlock means we're now working with partners to plan that next phase to further explore the AI as a Medical Device regulatory landscape. We published an AI Airlock blog recently and look forward to announcing further details in due course."
        },
        {
            "text": "One of many benefits of using innovative approaches to better understand novel regulatory challenges is the opportunity it provides to be a leading voice in the development of globally harmonised approaches to medical device regulation. International partnerships are key to ensuring that harmonised regulatory approaches support UK patient access and international trade. Last month, we attended the 27th International Medical Device Regulators Forum (IMDRF) Management Committee meeting in Tokyo where we provided updates and joined panel discussions with international regulators and industry partners across three important areas:"
        },
        {
            "text": "The MHRA is an active management committee member of IMDRF and we will continue to engage on alignment and harmonisation in several working groups."
        },
        {
            "text": "Our Digital Mental Health Technology (DMHT) team and partners from Wellcome also joined us in Japan to take advantage of international medical device regulators being together. They shared learnings from our Wellcome-funded DMHT work, which we are delivering in partnership with the National Institute for Health and Care Excellence (NICE), to encourage global alignment in how we regulate these emerging technologies for the benefit of patients. The latest project newsletter has updates about this work."
        },
        {
            "text": "International and domestic partnerships continue to be essential elements of our regulatory reform programme. They enable the MHRA to better understand regulatory opportunities and challenges to ensure that the regulatory policies we pursue are proportionate and deliverable."
        },
        {
            "text": "On the new post-market surveillance regulations, we appreciate the comprehensive feedback received from partners to the updated guidance we published in January to help manufacturers implement the new regulations before they come into force on 16 June. We are now reviewing this feedback to make necessary amendments for clarity and to finalise the guidance. We do not expect the guidance to change significantly, and manufacturers should continue using it to support the implementation of the new requirements. The feedback will also help us develop new guidance to further enhance support as part of ongoing improvements."
        },
        {
            "text": "Partnership working also continues to be central to our approach as we move forward with the next steps in our regulatory reform. A Statutory Instrument has been laid in Parliament to retain four pieces of assimilated EU law until they are replaced. This follows the publication of our consultation response which showed stakeholders favoured this approach. The SI is scheduled for debate in both Houses after the Easter recess and we’re working with Ministers to support this process."
        },
        {
            "text": "I’ve had the opportunity to work closely with our new Chief Executive, Lawrence Tallon, since his arrival on 1st April, and together we’re committed to ensuring that our future medical device regulatory reforms improve patient access to new medical devices in a way that is risk-proportionate, supports innovation and growth and builds on UK and international partnerships. We look forward to more engagement and dialogue as we move forward with the upcoming publication of the government response to the routes to market consultation, the World Trade Organization notification of the pre-market Statutory Instrument and identifying priorities for future enhancements."
        }
    ]
}