{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/04/15/the-uks-subsidy-control-regime-have-your-say/",
    "title": "The UK’s subsidy control regime: Have your say",
    "authors": [
        "Adam Land"
    ],
    "categories": [
        "Subsidy Advice Unit"
    ],
    "pub_date": "2025-04-15T13:03:21+01:00",
    "content": [
        {
            "text": "The Subsidy Advice Unit (SAU) is now well into its third year of operation after the UK’s subsidy control regime came into force in January 2023. As required by law, we are starting the process of reviewing the performance of the regime. This review aims to advise the UK Government – and other stakeholders – on whether the regime is working as intended, so that they can consider if any improvements should be made. "
        },
        {
            "text": "We’re kicking off that process with a ‘call for inputs’ asking anyone with experience of the regime to tell us what they think of it. "
        },
        {
            "heading": 2,
            "text": "Subsidies and the role of the SAU "
        },
        {
            "text": "Subsidies are given out by public authorities to support and pursue their policies – including to encourage economic growth by promoting innovation and investment.  "
        },
        {
            "text": "Our role in the SAU is to evaluate public authorities’ self-assessment of their adherence to certain legal principles, in relation to larger or more sensitive subsidies. The advisory reports we produce help public authorities comply with their legal obligations and give subsidies that have the minimum impact on competition and investment, so that organisations who do not receive subsidies can be confident that they are competing on a level playing field. "
        },
        {
            "text": "At the time of writing, since the start of the regime in January 2023, we’ve worked at pace to publish over 80 reports from 38 public authorities including:"
        },
        {
            "text": "The subsidies referred to us cover a wide range of sectors with energy, housing  and construction, and transport covered most frequently.  You can read our reports  on the Competition and Markets Authority cases and projects page."
        },
        {
            "text": "Source: SAU data, correct as of 15 April 2025 "
        },
        {
            "heading": 2,
            "text": "What are we reviewing? "
        },
        {
            "text": "We are required by law to review the effectiveness of the UK subsidy control regime.  This covers all aspects including, but not limited to, guidance, the referral process, our own role in the SAU, the ability to challenge subsidies, as well as the thresholds and exemptions that apply. "
        },
        {
            "text": "After consulting last year on what to include, we plan to review the effectiveness of the subsidy control regime by assessing how well it is meeting the objectives set out by the UK Parliament.  "
        },
        {
            "text": "These are: "
        },
        {
            "text": "We’ll also be looking at the impact of the regime on competition and investment in the UK. This means looking at the sorts of subsidies given (and not given) and their impact on prices, market shares, entry and exit, location, output, investment decisions and customer behaviour. "
        },
        {
            "heading": 2,
            "text": "Why are your views so important for us? "
        },
        {
            "text": "You may be: "
        },
        {
            "text": "To achieve a robust and representative evidence base, we need to understand how you experience the regime. The more views and evidence we can gather, the better we can reflect users’ experience and the more accurately we can communicate that in our final report. "
        },
        {
            "text": "It’s important to say that our work here is not about enforcement, or seeing if particular subsidies comply with the law. Rather, we want to know how well the different elements of the regime are all working – and whether they could be improved.  "
        },
        {
            "text": "The more people that respond, and the more open you are in your responses, the better and more robust our final report will be.  "
        },
        {
            "heading": 2,
            "text": "How to have your say"
        },
        {
            "text": "We have published a Call for Inputs which gives you the opportunity to have your say and provide evidence about the effectiveness and the impact of the UK’s subsidy control regime and how it's being operated and take part in our roundtable events."
        },
        {
            "heading": 4,
            "text": "Closing date for responses: 24 June 2025"
        },
        {
            "text": "We’ll also be engaging directly with stakeholders and gathering further evidence until late 2025, including through:"
        },
        {
            "text": "Our final report will be published as soon as is practicable after the end of the review period (31 March 2026). "
        },
        {
            "text": "We look forward to engaging with you and hearing your views over the coming months. "
        }
    ]
}