{
    "url": "https://mhrainspectorate.blog.gov.uk/2023/05/02/mhra-good-distribution-practice-symposium-2023/",
    "title": "MHRA Good Distribution Practice Symposium 2023",
    "authors": [
        "Emanuela Krasteva"
    ],
    "categories": [
        "Events and symposia",
        "Good distribution practice"
    ],
    "pub_date": "2023-05-02T12:01:28+01:00",
    "content": [
        {
            "text": "The first hybrid GMDP Symposium was held on 21-22 February 2023. For the first time, we offered delegates the opportunity to either watch the event online from the comfort of their homes or to join us in person in West London. The GDP team presented on 21 February opening with an enthusiastic “Good morning, Hammersmith!”. The event included a variety of topics with a special emphasis on updates on our regulatory position and the MHRA’s role as a sovereign regulator. The theme of the day was largely influenced by the changes following the UK’s departure from the EU."
        },
        {
            "text": "Delegates were first greeted by Chris Gray, Head of Compliance Team 2, who welcomed everyone and provided an overview of the interactive elements for audiences attending in person and online."
        },
        {
            "text": "Tanya Giles, GDP Inspector and Head of GDP Team 1, gave an update on the changes within the team. Tanya also presented the new inspection strategy in GDP, which now features licence inspections covering all sites on a licence as opposed to previous our previous inspection strategy which was primarily site-specific. With this holistic approach the intention for inspection periods is to be around 3 to 4 years. Where a licence inspection has been conducted, this will be reflected in the text of the corresponding GDP certificate, which will state compliance with GDP across all sites approved on the licence. Tanya also reminded delegates that short-notice and unannounced inspections remain part of our risk-based approach.\nPeter Brown, Expert GDP Inspector, and Cheryl Blake, Lead Senior GDP Inspector, jointly presented the MHRA Regulatory positioning since the last GMDP symposium in 2020. Peter talked about changes following the UK’s departure from the EU. He focused on the changes to supply chains of medicines to Northern Ireland. Peter also discussed the current positioning regarding the Falsified Medicines Directive. He further focused on the MHRA’s international partnering. Cheryl then discussed border formalities pertaining to goods flowing through the UK and Crown Dependencies. Cheryl also provided further insight on expectations for exporting medicines and compliance with the export ban list. Cheryl updated delegates on the extension of the validity of GDP Certificates until the end of 2023. Cheryl introduced the ‘Single Trade Window’ project, which is still in its early stages and involves collaboration between different Government departments. Delegates also were provided an update on the Covid Flexibilities, which were introduced in March 2020. Lastly, Cheryl presented the concept of the Compliance Monitor which is currently being piloted across GMDP cases at Inspection Action Group."
        },
        {
            "text": "Andy Morling, Enforcement Deputy Director, introduced the problem-oriented approach to medicrime. He also provided an insight on the strategy of the Enforcement Unit within the MHRA. Terry Madigan, Senior GDP Inspector, presented an overview of referral data pertaining to theft and loss of medicines in 2022. Terry shared several case studies pertaining to reports received by the Criminal Enforcement Unit. Terry discussed some of the methodologies used by criminals, the classes of medicinal products and location of reported theft of medicinal products. Peter Brown presented some of the new and emerging security trends in industry. He discussed further case studies pertaining to falsification of medicines and diversion of medicinal products outside the legal supply chain."
        },
        {
            "text": "Cheryl returned to the stage for the first session of the afternoon, which was the recurring presentation on Deficiency Data. Cheryl shared the deficiency data covering October 2021 until November 2022. She discussed the main areas of non-compliance based on the 1189 deficiencies, which were recorded over 473 inspections conducted in that period. Cheryl presented the top 5 deficiencies; she also explored the underlying contributing factors for IAG and CMT referrals. Cheryl also contrasted the most recent data with historical data from 2001-2005.\nChris Watson, GDP Inspector, delivered a session dedicated to environmental changes and their impact on GDP activities. Chris explored the effect of adverse weather events on the storage and distribution of medicinal products. With the weather becoming more extreme, he emphasised the need to adopt a risk-approach when dealing with extremes of temperatures.\nJohn McNulty, GDP Inspector and Head of GDP Team 2, provided insights to the role of Responsible Person (Import)- RPi, which was introduced following the UK’s departure from the EU. John reminded delegates that the transition period to name an RPi on existing licences, where licensed products were imported from countries on a list, had passed and companies who had failed to name an RPi on their licence would not be allowed to import from countries on a list. John also explained the scope of each category pertaining to importation from countries on a list and its interpretation."
        },
        {
            "text": "I delivered the history lesson of the day providing a retrospective review of how the guidelines on Good Distribution practice have shaped our expectations of minimum standards. I also shared the main changes that have been introduced to the guidelines since they first came into force in November 2012.\nAs it has now become a tradition, the GDP day ended with the Quiz which was presented by Lia Zelou and Claire Downes, GDP Inspectors. It provided an opportunity to delegates to test their knowledge and to race to be the first one to answer all questions. After the quiz, Chris Gray returned to the stage to deliver the closing remarks, which marked the end of the GDP day."
        }
    ]
}