{
    "url": "https://mhrainspectorate.blog.gov.uk/2023/05/02/mhra-good-manufacturing-practice-symposium-2023/",
    "title": "MHRA Good Manufacturing Practice Symposium 2023",
    "authors": [
        "grahamcarroll"
    ],
    "categories": [
        "Events and symposia",
        "Good manufacturing practice"
    ],
    "pub_date": "2023-05-02T12:01:31+01:00",
    "content": [
        {
            "text": "I write this blog post just after returning from the 2023 MHRA GMP Symposium in London. It has been more than two years since we held our last event virtually, and over three years since we were face-to-face for the 2019 symposium. What a pleasure it was to once again be meeting with our industry stakeholders, providing them with an opportunity to network with their peers, and sharing updates and knowledge from the MHRA GMP Team. This was also our first hybrid GMP symposium, which allowed us to deliver a focussed one-day in-person event in London, while opening the event to a significant number of additional delegates online. I was honoured to chair the day’s events and have the best seat in the house as the results of so many hours of hard work came together."
        },
        {
            "text": "The day began with a welcome and introduction from Chris Gray, Head of Compliance Team 2. Chris has taken over leadership of the GMP and GDP teams since the last GMP symposium and expressed her delight at being able to hold this event again. This was followed by a keynote address from James Pound, Deputy Director of Standards and Compliance. James shared an overview of the MHRA’s updated role as a sovereign regulator, enabling innovation through supportive and proportionate regulatory processes. Closer to home, James also provided a brief outline of the ‘Compliance Strategy’ that will define how the Compliance Teams (which include GMP and GDP Teams) will work in the future to support the medicines and blood for transfusion sectors to produce high quality, safe products for patients."
        },
        {
            "text": "I then shared updates to the GMP Team since the virtual GMP symposium in 2020. I outlined changes within the team and how we are working to fill our current vacancies. I also explained how industry can help us to help them by making full use of our published resources and ensuring that queries they submit are clear, structured, and directed to the appropriate mailboxes for triage and assessment."
        },
        {
            "text": "Ian Jackson’s session followed, providing an update on the MHRA’s regulatory positioning in 2022 and into the future. It was eye-opening to take stock of all the changes that have occurred since we last held the event. There have been significant updates not only to regulations and guidance, but also in areas such as our partnership working under Mutual Recognition Agreements (MRAs) and through the Pharmaceutical Inspection Co-operation Scheme (PIC/S), the International Coalition of Medicines Regulatory Authorities (ICMRA), and the Australia-Canada-Singapore-Switzerland-United Kingdom (Access) Consortium. Ian shared a range of examples showing how the MHRA is collaborating with various groups, not least in the area of GMP inspection recognition, reliance, and work sharing. Reflecting on this session I felt it provided excellent reference material for delegates, who would be able to make use of the many summaries and links within the presentation to ensure their operations remain up to date with current and impending regulatory expectations."
        },
        {
            "text": "It was then time for our first refreshment and networking break of the day. This is where our in-person delegates had an advantage over virtual delegates, with an opportunity to discuss what they had heard in the sessions and share experiences, helping to drive forward quality and compliance across the sector. Significant quantities of coffee and pastries helped to fuel these discussions! Our presenters were also on hand at each break to answer follow-up questions from delegates."
        },
        {
            "text": "Returning to the presentations, our next session was led by Ian Rees and Martine Powell. Their session ‘Enabling Innovation’ took a deep dive into how the MHRA is supporting disruptive changes in the manufacture and delivery of medicines. We had presented at a previous GMP symposium on how Point of Care (PoC) manufacturing was an emerging challenge to how we regulate; with new legislation now progressing that addresses the specific needs of this sector, this was a clear and compelling example of the MHRA fulfilling its brief to be an enabling regulator."
        },
        {
            "text": "At this point in the day our delegates may have been forgiven for any confusion as the theme tune for ‘The Ewan Me Show’ began to play and our host, Ewan Norton, bound onto the stage thanking his studio audience for their warm welcome after several years away from the limelight. Ewan is well known for his creative approach to presentations and this year he created a TV chat show format, complete with themed props, to interview Chris Jones and Jo Parkin on the Inspection Action Group and the Compliance Monitor programme respectively. It was a fantastic way to share information about these two very important topics."
        },
        {
            "text": "At lunchtime we provided a series of ‘Lunch and Learn’ videos for delegates to watch while having their lunch, or to review at their leisure later if they preferred to focus on networking opportunities. We shared updates on our work with the blood for transfusion sector, the recent Annex 1 revision, parallel imports, the Defective Medicines Report Centre (DMRC), cannabis-based products for medicinal use (CBPMs) and the British Pharmacopeia (BP). My thanks go to our presenters Callum McLoughlin, Alan Moon, Ghazal Rehman, Himal Makwana, Ewan Norton and Peter Crowley for their excellent presentations."
        },
        {
            "text": "After lunch we went courageously where no symposium has gone before. Leading a session on root cause analysis, bias, and effective decision making, Chris Gray provided an overview of the various cognitive biases that can catch us out when trying to establish why things have gone wrong. Officer Gray then called to the stage her assistants, Captain Martin Reed and First Officer Jo Parkin of the Starship Compliancewise, resplendent in their space officer uniforms. The Starship Compliancewise was having problems with its neutron imploder, which we learnt was fundamental to the basic life support and navigation systems on board. If any of our delegates had previously read a ‘choose your own adventure’ book, they would have felt at home as they were given the power to decide how the investigation would proceed via our interactive voting technology. Thank you to our delegates who helped Captain Reed and First Officer Parkin navigate around the potential pitfalls of their cognitive biases and conduct a successful investigation."
        },
        {
            "text": "We then had the first of our two Panel Q&A sessions. I was joined on stage by Chris Gray, Ian Jackson and Jo Parkin, and together we answered a range of questions from the audience related to our earlier presentations."
        },
        {
            "text": "At the final refreshment and network break of the day, as was the case during the earlier breaks, our delegates had the opportunity to meet with representatives from DMRC, the British Pharmacopeia (and their publisher, TSO), and Pharmaceutical Press (publisher of the Orange and Green Guides). Our GMP and GDP Inspectors were also on hand at our recruitment stand, helping to answer questions from delegates considering an inspector role as their next career step. I make no apology for taking time in my presentation earlier in the day to share what a fantastic opportunity the inspector role is, not just in terms of developing new skills and experience but also making a hugely significant difference to public health."
        },
        {
            "text": "We returned for our final presentation of the day, ‘Quality System Robustness’ by Shirley Stagg and Julio Benitez. This built on previous symposium sessions in 2017 and 2019 on organisational culture and knowledge management, quality risk management, and control strategies. Through the analogy of putting up and securing a tent, Shirley and Julio outlined the multifaceted nature of an effective quality system, described the elements needed for success, and shared examples of failure indicators. Special thanks go to Shirley’s family whose tent building skills were put to the test in aid of this session!"
        },
        {
            "text": "We ended the day with a second Panel Q&A session; this time I was joined on stage by Alan Moon and Ewan Norton as well as Chris Gray and Ian Jackson. Alan and Ewan expanded on their earlier presentations in response to specific queries, while Chris and Ian fielded more general questions. We then closed the day with Chris’s reflections on the event."
        },
        {
            "text": "Feedback received, both in person on the day and via email and social media after the event, indicates that we delivered an engaging and thought-provoking agenda. This is thanks to several key groups who were all instrumental in making the event a success:"
        },
        {
            "text": "If you attended, we really hope you found the event to be useful and engaging; if you haven’t already completed your feedback form please do so as soon as you can, so we can make the next event even better. If you couldn’t join us, then please do keep an eye out for our future events; we’d love to see you at the next one!"
        }
    ]
}