{
    "url": "https://educationhub.blog.gov.uk/2023/05/what-are-academy-schools-and-what-is-forced-academisation/",
    "title": "What are academy schools and what is ‘forced academisation?’",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-05-02T16:05:35+01:00",
    "content": [
        {
            "text": "We believe that academies are the best way for children to get an excellent education, which is why 80% of secondary schools in England are now academies."
        },
        {
            "text": "Many previously underperforming schools have been transformed by academy status."
        },
        {
            "text": "Find out more about what academies are and what they mean for your child."
        },
        {
            "heading": 3,
            "text": "What are academy schools?"
        },
        {
            "text": "Academies are state-funded schools. However, unlike other state-funded schools, they’re independent from local authorities, meaning that they aren’t overseen by councils. As a result, they have more freedom in how the school is run."
        },
        {
            "text": "Pupils in academies study the same core subjects and do the same exams as those in any other school, but unlike schools managed by the local authority, academies can choose to adapt the curriculum, term dates and school hours to help children learn."
        },
        {
            "text": "Academies also have the power to decide how to spend their money on things like teacher salaries and classroom equipment."
        },
        {
            "text": "Some academies used to be council-run schools and others are brand new schools known as ‘free schools’ which are established to create more school places in a local area."
        },
        {
            "text": "Any type of school can be an academy, including primary schools, colleges and special schools."
        },
        {
            "heading": 3,
            "text": "What is a multi academy trust (MAT) and what are the benefits?"
        },
        {
            "text": "All academies are run by trusts. These can be multi academy trusts (MATs) – which run several academies – or single academy trusts that run just one. All trusts are charities and so aren’t run for financial profit."
        },
        {
            "text": "MATs are networks of schools which work to support each other and raise standards. For example, a school that is not performing well could benefit from being in a trust with a better performing school, allowing them to share resources and knowledge."
        },
        {
            "text": "By working in partnership with each other, the schools within a trust can share staff, curriculum expertise and good teaching practices. This helps schools provide the best possible education for pupils."
        },
        {
            "text": "Joining a multi academy trust is a positive choice for schools. They help develop strong school leaders and great teachers, allowing schools to focus on the teaching and finding a curriculum that is based on what really works."
        },
        {
            "heading": 3,
            "text": "Can schools be forced to be an academy?"
        },
        {
            "text": "Around 73% of academy schools have voluntarily chosen to become an academy."
        },
        {
            "text": "However, the law requires schools which have received an ‘Inadequate’ rating from Ofsted to become academies. Schools which have received two or more consecutive ratings below ‘Good’ may also be converted into academies."
        },
        {
            "text": "For schools in this position, the Secretary of State for Education will send the school something called an ‘academy order’, which will start the process for the school to become an academy."
        },
        {
            "text": "In these circumstances, schools will be transferred to a trust with a strong track record of ensuring pupils receive the highest standard of education."
        },
        {
            "text": "We believe that joining a MAT is the best way to support schools to provide the best education possible, transforming outcomes for pupils."
        },
        {
            "text": "Schools transferring to academy status will be supported by a project-lead to guide them through the process."
        },
        {
            "heading": 3,
            "text": "What happens if an academy is underperforming?"
        },
        {
            "text": "If an academy has been rated as ‘Inadequate’ by Ofsted or less than ‘Good’ in two consecutive inspections, a Regional Director who acts as a representative for the Department for Education in their local area, can decide to transfer the school to a different MAT. This is to make sure the school is getting the support it needs."
        },
        {
            "text": "To begin this process, the school’s current trust will receive what is known as a ‘Termination Warning Notice’, which sets out the Regional Director’s concerns and gives the trust the opportunity to respond."
        },
        {
            "text": "If the Regional Director is not convinced the trust is able to improve the school, they will go ahead and transfer the school to a different trust to make sure of the best outcome for pupils."
        }
    ]
}