{
    "url": "https://nda.blog.gov.uk/corhyn-parr-talks-inclusion-and-building-female-representation-within-the-nda-group/",
    "title": "Corhyn Parr talks inclusion and building female representation within the NDA group",
    "authors": [
        "Corhyn Parr CEO Nuclear Waste Services"
    ],
    "categories": [
        "diversity",
        "Recruitment",
        "Skills",
        "skills"
    ],
    "pub_date": "2023-09-29T09:50:55+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "To mark National Inclusion Week, Corhyn Parr, CEO of Nuclear Waste Services, part of the NDA group, shares her views on the importance of creating inclusive  workplaces and the success of our partnership with the Whitehall and Industry Group to develop our Women in Leadership Programme, which is increasing female representation at all levels of our workforce. "
        },
        {
            "text": "At the Nuclear Decommissioning Authority (NDA) group we are committed to creating great places to work and inclusive environments that enable everyone to perform at their best."
        },
        {
            "text": "That includes ensuring we have female representation at all levels across our organisations and supporting women in their professional growth."
        },
        {
            "text": "The NDA is charged, on behalf of Government, with the mission to clean up the UK’s earliest nuclear sites safely, securely and cost effectively and, a key purpose of Nuclear Waste Services is to make nuclear waste permanently safe, sooner. Both of these objectives require a diverse range of roles and a diverse range of people to lead us."
        },
        {
            "text": "The nuclear industry has the capability to offer fulfilling and rewarding careers to all and by cultivating diverse leadership teams, we aim to enhance overall performance and drive positive outcomes within the sector driving our ambitious plans."
        },
        {
            "text": "That’s why we worked in partnership with the Whitehall and Industry Group (WIG), a not-for-profit organisation dedicated to promoting collaboration among the sectors, to launch the NDA Women in Leadership Programme."
        },
        {
            "text": "The programme aims to increase female representation in our workforce, foster the leadership development of more women in senior management positions, and strengthen talent pipelines across our businesses - so far we’ve had nearly 200 participants since we launched in October 2021 and are shortly due to add to this with our Autumn 2023 cohort of another 40 participants."
        },
        {
            "text": "There are two courses available, the Senior Programme, catering to women with potential for top leadership roles, and the Step Up Step Across Programme, targeting women seeking their first leadership positions."
        },
        {
            "text": "The objective is to address specific barriers hindering women's career progression, providing a safe and confidential environment where women can openly discuss their challenges, receive support, and be part of a network that inspires and empowers them."
        },
        {
            "text": "Participants learn through interactive modules, action learning sets, receive individual coaching sessions, and participate in experiential learning exercises."
        },
        {
            "text": "The programme offers a mix of different views, backgrounds and speakers from other sectors who are grappling with similar issues and challenges, and share insights from a different perspective."
        },
        {
            "text": "It also equips participants with negotiation skills to seize future career opportunities, emphasising the importance of actively managing their careers rather than solely focusing on the tasks at hand. The programmes provide participants with strategies to influence the key individuals who can further their professional aspirations."
        },
        {
            "text": "And it’s working, we have seen those who have completed the programme being identified for succession planning and actively encouraged to be part of the NDA Leadership Academy. The NDA Group has committed to achieving 30% representation of women at board and senior leader level by 2025 and it is through programmes like this that will help us reach that goal."
        },
        {
            "text": "Participants have found it extremely worthwhile, one said: \" This module was exactly what I need to help me through the challenges ahead – thinking differently. “I have made really strong connections with those in my action learning set which will prove invaluable as I go forward.”"
        },
        {
            "text": "One participant confirmed she had applied for a new senior role, which she would never have done if she hadn’t been on the programme and had even citied the programme as her reason for applying saying her confidence and ambition had grown to the extent that she now knew she was more than ready for the next level."
        },
        {
            "text": "Another reflected it had given her the confidence to take the reins on her career and approach a colleague at a directorate level to mentor her as well as setting up a meeting with the Director of HR to talk about her career aspirations."
        },
        {
            "text": "The programme is generating a pipeline of fantastic women across our businesses positioning them for leadership roles. In years to come we hope to look back and see how this programme played a little part in the journey of getting them to wherever they want to be."
        },
        {
            "text": "If you’re interested in a career in the NDA visit our website. For more information on how we are promoting inclusion across the NDA group you can read our inclusion strategy and for more information on WIG visit the Whitehall & Industry Group (WIG)."
        }
    ]
}