{
    "url": "https://naturalengland.blog.gov.uk/2023/09/29/state-of-nature/",
    "title": "State of Nature",
    "authors": [
        "Pete Brotherton"
    ],
    "categories": [
        "Biodiversity",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-09-29T10:01:53+01:00",
    "content": [
        {
            "text": "Dr. Pete Brotherton, Director of Science"
        },
        {
            "text": "Yesterday saw the publication of the fourth State of Nature (SON) Report, the product of a collaboration of environmental NGOs, academic institutions and government agencies, including Natural England. The report provides the most comprehensive overview ever of species trends across the UK, including specific assessments for England, Northern Ireland, Scotland and Wales, and for the UK’s Overseas Territories. Its conclusions are based on millions of records collected by thousands of volunteer ‘citizen scientists’ spanning terrestrial, freshwater and marine species."
        },
        {
            "text": "The report makes compelling reading. It lays bare the stark fact that nature is still seriously declining across the UK, a country that is already one of the most nature-depleted in the world. The data show that since 1970 UK species have declined by about 19% on average, and nearly 1 in 6 species (16.1%) are now threatened with extinction. This is a timely reminder, if we needed it, that the nature crisis isn’t restricted to far-off places like the Amazon or Great Barrier Reef. It is right here, on our doorstep. We are losing familiar wildlife that we cherish including the hazel dormouse and skylark."
        },
        {
            "text": "Beyond the troubling headlines of nature loss provided by the report, the evidence in the report also provides glimmers of hope. Although many species are in decline, there is also a significant number that are increasing. For example, while our pollinating insects are declining overall, some groups of freshwater insects such as dragonflies are faring better. Similarly, although most mammals are declining, many bat species are on the increase."
        },
        {
            "text": "SON goes beyond the bare statistics to assess the evidence behind these differences and to help identify the actions that are needed to recover nature. To quote the report, “We have never had a better understanding of the State of Nature and what is needed to fix it.”"
        },
        {
            "heading": 4,
            "text": "A Recipe For Recovery"
        },
        {
            "text": "So, what are the issues we need to address?  And what are the opportunities to address them?"
        },
        {
            "text": "Evidence from the State of Nature report and elsewhere points to four big on-the-ground changes that we can take to accelerate nature recovery:"
        },
        {
            "text": "How these changes happen matter. Space is scarce, so using it wisely by planning Nature Recovery Networks (such as through Local Nature Recovery Strategies) will be key, and we need to tackle the climate change and biodiversity crises in tandem – recovering nature can provide many solutions to climate change. People must also have the chance to be part of these changes, and more people deserve to experience the joy of connecting with abundant nature – or indeed any nature."
        },
        {
            "text": "So, what is Natural England doing? Here are just a few examples:"
        },
        {
            "text": "Delivering ‘30 by 30’"
        },
        {
            "text": "The State of Nature report stresses the importance of the new Global Biodiversity Framework, which includes the commitment by nations to protect 30% of their land and seas for nature, by 2030.  Natural England will work with others to improve management of existing protected areas including by implementing Site of Special Scientific Interest (SSSI) improvement plans as part of a phased programme towards the 2042 target for 75% of sites to be in favourable condition. We are also considering further places suitable to become sites of scientific interest, and we will establish another 25 National Nature Reserves by 2027."
        },
        {
            "text": "At sea, we are restoring marine protected areas with more designated marine features in favourable condition; working with partners to implement byelaws and other measures to improve our marine environment."
        },
        {
            "text": "Developing a Nature Recovery Network"
        },
        {
            "text": "Linked closely to the ’30 by 30’ ambition, we are working with partners to establish a Nature Recovery Network (NRN). This will comprise a network of wildlife rich places that also provides nature’s critical benefits to people, stretching across England from our cities to countryside, mountain to sea. Scale matters, and landscape-scale Nature Recovery Projects (NRPs) will make a major contribution to the NRN. In July 2023 an area bigger than Hertfordshire was dedicated to fast tracking nature recovery as six new NRPs were launched by Natural England and the government, working with partners to deliver. The projects, will help to manage flooding and wildfire risks, improve carbon stores and build diverse habitats for wildlife."
        },
        {
            "text": "Local Nature Recovery Strategies (LNRS) also underpin national ambitions for delivering the country’s Nature Recovery Network. They are putting power into the hands of local communities to tackle environmental pressures and recover nature. NE is supporting LNRS preparation, with senior advisors working in each of the 48 LNRS areas."
        },
        {
            "text": "Recovering our threatened species"
        },
        {
            "text": "In April this year, we launched a new Species Recovery Programme Capital Grant Scheme. The scheme offers grants of up to half a million pounds to projects across England aiming to halt and reverse declines in populations of our most threatened species. In September, 63 projects were awarded grants totalling £14.5m. With these grants, 74 different organisations will be working to help restore populations of rare species including the critically endangered European eel, Greater Mouse-eared bat, Sand lizard, Atlantic salmon, Eurasian curlew, Pasqueflower, Grizzled skipper and Northern lapwing."
        },
        {
            "text": "Restoring wildlife on the country’s farmland"
        },
        {
            "text": "Farmers hold the key to much of the change that is needed. Across the country, Natural England is working closely in partnership with farmers and other landowners to facilitate uptake of agri-environment schemes and deliver nature recovery from farm-level to a landscape-scale."
        },
        {
            "text": "Finally"
        },
        {
            "text": "The picture of ongoing nature loss painted by this report is stark. This isn’t just sad – nature loss undermines our economy, food systems and health and wellbeing. So we owe it to nature, and ourselves, to make sure that it is the last State of Nature report to chart continuing decline. I very much hope that everyone can take something from this report that will enable them to do their bit for nature recovery, and ensure that the next report can document the start of nature bouncing back."
        },
        {
            "text": "Read the State of Nature report here: State of Nature 2023 - report on the UK’s current biodiversity"
        }
    ]
}