{
    "url": "https://naturalengland.blog.gov.uk/2025/10/24/earls-court-where-nature-is-set-to-take-centre-stage-in-londons-next-great-neighbourhood/",
    "title": "Earls Court: Where Nature Is Set to Take Centre Stage in London’s Next Great Neighbourhood",
    "authors": [
        "James Scott"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Growth",
        "Natural England"
    ],
    "pub_date": "2025-10-24T10:33:09+01:00",
    "content": [
        {
            "text": "By James Scott, Non-Exec Board Member at Natural England and Group Director of Strategy and Planning at Urban&Civic plc"
        },
        {
            "text": "If you’ve ever wondered what happens when one of London’s largest brownfield sites is reimagined with a focus on nature, the answer has the potential to be Earls Court. On 9th October and wearing my Natural England (NE) non exec hat, I joined a team from NE led by its Chief Executive Marian Spain, to explore the 44-acre regeneration site in west London."
        },
        {
            "text": "Hosted by Ewan Oliver, Public Realm Development Manager and Peter Runacres, Head of Urban Futures of the Earls Court Development Company (ECDC), the visit offered a proper look behind the hoardings of the site that once housed London’s legendary exhibition halls. "
        },
        {
            "text": "Today, ECDC are showcasing plans for a landscape led masterplan — the sort that seeks to balance 4,000 homes, 12,000 jobs, and 20 acres of public realm with a clear commitment to restoring nature in this densely developed part of London."
        },
        {
            "text": "Having seen a few large-scale projects at this stage, it was reassuring that ECDC’s “Be Good Ancestors” philosophy clearly ran through every aspect of their thinking. Scale and complexity mean that you need simple but powerful drivers like that, which cut across the technicalities and the jargon, to craft places that future generations will thank us for. "
        },
        {
            "text": "It also clearly chimed with the NE team’s experience from the Nature Towns and Cities initiative, where nature and landscape are being retrofitted into an urban environment by ambitious authorities across the country."
        },
        {
            "text": "As we walked through, what is today, a largely barren, nature depleted concrete environment, crisscrossed by tube and rail lines, straddling the boundary of Hammersmith and Fulham and Kensington and Chelsea, the scale of both the risk and the opportunity for Earls Court became clear."
        },
        {
            "text": "At the heart of the proposal lies a 4.5-acre urban park, complete with ecological gardens that will stitch the development into the broader green network and hopefully supercharge the ambitions of the surrounding areas. Ewan explained that over 1,000 new trees will line streets and squares, creating a hard-working urban forest that will not only provide sustainable routes across the site and great local amenity but also capture carbon, mange surface water, cool the microclimate, and support biodiversity."
        },
        {
            "text": "Whilst the thinking behind this design has come from leading practices across the world, ECDC’s Public Realm Inclusivity Panel (PRIP) has also ensured that local voices, from teenage skaters to parents with pushchairs, help shape what the public spaces should feel like."
        },
        {
            "text": "High density urban development is not, however, without its challenges. Some people have raised concerns about the height of proposed buildings, worried they might overshadow the skyline as well as surface water runoff, having experienced backed up drains when the exhibition venue was in situ. "
        },
        {
            "text": "But, as the team discussed, the success of a major regeneration lies in balancing density with landscape design quality and innovation — ensuring tall buildings earn their place through what comes forward around them and working hard on water recycling and absorption solutions."
        },
        {
            "text": "Equally, the visit made clear that the investment needed to create a new great green space in the capital comes from the returns made by the development. However, great green spaces will also increase the development and investment value of, not just the proposals under consideration but the wider areas as well.  Earls Court clearly has the capacity to be a good example of where growth and green recovery are mutually reinforcing."
        },
        {
            "text": "The team at ECDC are working hard to make their case through the planning process but also to share their learnings and passion for placemaking. As a master developer, I particularly enjoyed hearing about their partnerships with Open City and Young City Makers to help inspire the next generation to actually think about how cities are made and what we need to do to keep them functioning effectively."
        },
        {
            "text": "By the time the visit wrapped up, in the aptly named Conversation Corner, the mood was upbeat and as we walked past the local pizzeria, on our way to the tube, I couldn’t help but smile at the “we plant one tree for every pizza we sell” promise in the window. It seems like good green growth is being baked into the future of west London."
        }
    ]
}