{
    "url": "https://forestrycommission.blog.gov.uk/2025/10/24/making-the-most-of-your-timber-unlocking-the-value-of-low-quality-wood/",
    "title": "Making the most of your timber: unlocking the value of low-quality wood",
    "authors": [
        "Chris Watson"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2025-10-24T09:00:00+01:00",
    "content": [
        {
            "text": "When we think of timber, it’s often the high-grade logs used for furniture or construction that come to mind. But in reality, much of the wood harvested from UK woodlands is lower in quality, smaller in diameter, irregular in shape or simply not suitable for premium products. "
        },
        {
            "text": "However, that doesn’t mean it’s without value. These lower-grade products play a vital role in woodland management, offering practical uses and economic returns while making every effort to ensure nothing goes to waste."
        },
        {
            "heading": 2,
            "text": "Selling timber"
        },
        {
            "text": "Timber sales vary depending on the type of wood and the buyer’s needs. High-value hardwoods and some softwoods are typically sold by volume – measured in cubic metres or hoppus feet (a traditional unit that accounts for sawmill waste). These logs are carefully graded and priced individually."
        },
        {
            "text": "Lower-value products like firewood or chipwood are often sold by weight (tonnes), which is easier to measure using crane scales or weighbridges."
        },
        {
            "text": "Timber can also be sold by area, especially in coppice woodlands, where a price is agreed for the standing crop over a set period. This is usually one dormant season from when the leaves turn through to bud burst in the spring."
        },
        {
            "text": "Sales are structured in two main ways:"
        },
        {
            "text": "Ahead of felling any trees, you will need to apply for a felling licence, and be aware of any other restrictions, for example, if it is a Site of Special Scientific Interest. You must seek relevant permissions before felling. There are some exemptions which can be specific to your site and the work you wish to carry out."
        },
        {
            "heading": 2,
            "text": "Important considerations"
        },
        {
            "text": "Before we dive into some of the wood products you can produce from your woodland, it is important to consider the health, safety and environmental impacts of any harvesting work. Getting professional advice at this stage is always valuable, and the UK Forest Industry Safety Accord (FISA) provides excellent technical guidance on best practice in forest operations which can help get you started.You also need to adhere to standards and certifications surrounding wood products before you can sell them. This particularly applies to wood being used for fuel, such as ensuring your firewood is certified as ‘Ready to Burn’ as specified in the Air Quality (Domestic Solid Fuels Standards) (England) Regulations 2020."
        },
        {
            "text": "The Woodsure voluntary quality assurance scheme ensures the quality of wood sold. The Small Woods Association have their own group scheme through Woodsure for woodland owners selling fuelwood."
        },
        {
            "heading": 2,
            "text": "Using wood for biomass"
        },
        {
            "text": "Biomass refers to using wood as fuel to generate heat or electricity. It’s become increasingly popular in the UK as a renewable alternative to fossil fuels.  "
        },
        {
            "text": "Biomass typically uses small-diameter timber, thinnings and branch wood material with limited other uses. It’s processed into either:"
        },
        {
            "text": "As a woodland owner, biomass is accessible for your own use, especially if you have a farm or estate. Small-scale woodchip boilers are available, and chipping can often be done onsite. However, it’s important to use clean, dry wood, free from soil or stones for the best results and a good market value. "
        },
        {
            "text": "There is strong market for biomass and woodchip, and it can be relatively straightforward to find a buyer for it. It’s important to adhere to woodchip standards such as the Woodsure quality assurance scheme."
        },
        {
            "heading": 2,
            "text": "Charcoal from your woodland"
        },
        {
            "text": "Charcoal has a long history in English woodlands, having once fuelled UK industry before being replaced by coal. Today, it’s mainly used for barbecues and outdoor cooking, though niche craft markets such as artists charcoal also exist."
        },
        {
            "text": "Charcoal can be made from most woody material, with high-quality charcoal being made from hardwoods like alder, oak, birch, hornbeam and hazel, often from coppiced wood. It’s especially useful during coppice restoration, when harvested material may not yet be suitable for other products."
        },
        {
            "text": "Production involves heating wood in a low-oxygen environment to 'char' it. While traditional earth clamps and kilns can be used, modern metal kilns and retorts are more efficient."
        },
        {
            "text": "Charcoal making is hands-on and requires training to get the most out of your burn, and equipment costs can vary from a few hundred pounds for a ring kiln to over £10,000 for a retort. Charcoal making is a realistic option for woodland owners, and because charcoal is lighter than raw wood, it’s easier to transport, reducing the need for heavy machinery and keeping costs low."
        },
        {
            "heading": 2,
            "text": "Harvesting firewood from your woodland"
        },
        {
            "text": "Firewood has long been a woodland staple, and its popularity has grown with the push for renewable heating. Woodfuel stoves and boilers are especially valuable in off-grid areas. Firewood is a great way to produce something from your woodland that you can make use of yourself and can help you to keep energy costs lower."
        },
        {
            "text": "Almost any tree species can be used for firewood, but hardwoods like beech, oak and ash are preferred for their long, hot burn. Softwoods like pine and spruce tend to produce more tar and burn faster and are often used for kindling or biomass."
        },
        {
            "text": "Firewood is typically made from small to medium sized trees, branches and offcuts, or from sustainably managed coppice. Uniform logs are preferred by producers using firewood processors, making thinnings a valuable source."
        },
        {
            "text": "For small-scale use, basic tools like an axe and bow saw are enough to get started. Larger operations require log splitters and processors to handle high volumes efficiently."
        },
        {
            "text": "Dryness is key for firewood. Since May 2021, small-scale firewood sold in England must meet ‘Ready to Burn’ standards, and most producers of firewood must register with the certification scheme. Firewood must have a moisture content below 20% to burn cleanly and legally. "
        },
        {
            "text": "Firewood prices are currently strong, making it a crucial part of woodland economics. However, where possible, higher-quality timber should be directed to uses that store carbon longer and allow for future recycling."
        },
        {
            "heading": 2,
            "text": "Woodchip for panel boards"
        },
        {
            "text": "A valuable outlet for lower-quality softwood is the panel board industry. Products like MDF (medium-density fibreboard) and OSB (oriented strand board) are widely used in construction, furniture and DIY."
        },
        {
            "text": "Panel boards are made from a mix of chipped roundwood, sawmill arisings and recycled wood. Wood chippings are processed in large factories, combined with resins and pressed into sheets. These are then cut for use in everything from kitchen cabinets to flooring."
        },
        {
            "text": "Selling timber for panel boards gives low-grade wood a longer carbon life and supports circular economy principles (a sustainable economic system with minimal waste and pollution which uses materials for as long as possible)."
        },
        {
            "heading": 2,
            "text": "Making the most of your timber"
        },
        {
            "text": "These products provide vital outlets for timber that might otherwise go unused due to the size, shape or market conditions. However, they can also be made from better-quality wood, so it’s important to consider the best possible use for each tree. "
        },
        {
            "text": "Producing high-quality timber should always be the goal. It offers more options for future foresters and greater long-term income. Woodland management is a long-term endeavour, and no one regrets inheriting too much good timber."
        },
        {
            "heading": 2,
            "text": "Sustainable timber harvesting"
        },
        {
            "text": "All timber harvesting must be done sustainably in line with the UK Forestry Standard (UKFS), and a woodland management plan is a great way of ensuring this happens, with Forestry Commission grants currently available to help with the cost of producing a management plan."
        },
        {
            "text": "Now is a great time to make that important first step before you can harvest your trees, and to obtain the necessary permissions and clarity from your management objectives. Timber sales can support broader woodland objectives, but care must be taken not to compromise ecological or social values."
        },
        {
            "text": "One key consideration is deadwood. While low-value markets can use almost everything, UKFS guidelines stress the importance of retaining standing and fallen deadwood for biodiversity. Therefore, a balanced approach is needed – using what’s appropriate while leaving enough to support future woodland health and biodiversity."
        },
        {
            "text": "Certification should be considered for all timber production. It adds value to your timber and provides independent assurances that your methods are sustainable and meet UK Forestry Standards."
        },
        {
            "heading": 2,
            "text": "Timber harvesting training"
        },
        {
            "text": "Further help and support to manage harvesting operations can be gained through the Forest Works Manager course from FISA. This is an important level of competency all woodland managers and owners should gain, and it provides the due diligence and knowledge needed to confidently oversee operations."
        },
        {
            "text": "In the next wood products blog we will identify the different medium-value wood products you could produce from your woodland."
        },
        {
            "text": "Author image: Chris Watson (left), Simon James (right, credit: Ed Bagnall)."
        }
    ]
}