{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/24/stakeholder-reaction-to-plans-to-ramp-up-housebuilding-in-london/",
    "title": "Stakeholder reaction to plans to ramp up housebuilding in London",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing",
        "Housing",
        "Planning"
    ],
    "pub_date": "2025-10-24T12:59:20+01:00",
    "content": [
        {
            "text": "There has been extensive reaction from the housing sector, and national coverage, of the joint announcement to ramp up housebuilding in the capital – and ensure more affordable homes are built."
        },
        {
            "text": "The package – agreed between the Housing Secretary and Mayor of London yesterday (23 October) – will see a time-limited planning route introduced to get more spades in the ground, temporary levy relief for developers, new powers for the Mayor to review and call-in housing schemes and £322m of initial funding for a City Hall Developer Investment Fund."
        },
        {
            "text": "It will mean that more homes, including affordable homes and those for social rent, can be built and built faster - with strict conditions in place to speed up the delivery of new homes. "
        },
        {
            "text": "Reaction from the housing sector includes:"
        },
        {
            "text": "Mark Allan, Chief Executive of Landsec, said:   “The Secretary of State, the Housing and Planning Minister and the Mayor of London should be congratulated on the pace and focus they have brought to agreeing this package. We recognise that they have moved substantially to put these measures in place.  "
        },
        {
            "text": " “At the moment, too few schemes are coming forward in London for development. That’s bad for Londoners and it’s bad for the nation. But we also know that if we significantly ramp up housing delivery in the capital we can unlock up to £40 billion in economic benefits to the UK.  "
        },
        {
            "text": " “The package announced today should go a long way to unlock delivery on stalled sites and accelerate delivery on others, ensuring thousands more homes – including social and affordable homes – are delivered for the benefit of Londoners. We’re keen to get moving.“ "
        },
        {
            "text": "John Mulryan, Group Managing Director, Ballymore, said:  “We welcome the package announced by the Government today. The measures will have a direct and positive impact on accelerating the delivery of affordable and private homes within our land pipeline — around 15,000 homes across London. "
        },
        {
            "text": "“Successful housing delivery in the capital depends on a shared commitment to tackling barriers together. Project viability remains the greatest obstacle to new homes, and we are encouraged that the Government has recognised this and is taking action.” "
        },
        {
            "text": "Fiona Fletcher-Smith, Group Chief Executive of L&Q, said:  \"We can't afford not to build new social homes in London, and owe it to the families living in temporary, overcrowded or unsuitable homes to find a way to kickstart development at scale.  "
        },
        {
            "text": "\"We're pleased to see the Government and Mayor of London working together on this challenge and are committed to being part of the solution. We have a strong track record of delivering high quality, affordable homes in London, and look forward to exploring the opportunities unlocked by these changes - alongside critical future measures including funding and rent convergence.\" "
        },
        {
            "text": "Clare Miller, CEO of Clarion Housing Group, said: “We welcome the government’s commitment to unlocking development in London. Meeting the capital’s housing need requires bold collaboration across sectors. Clarion is ready to work with government and private partners to deliver the affordable and social homes that Londoners urgently need.” "
        },
        {
            "text": "Stephen Teagle, Chief Executive Partnerships and Regeneration, Vistry Group, said: \"Vistry continues to work in partnership with the Government to help deliver its ambitious housing agenda, including transformative commitments to boosting affordable housebuilding. Delivering more affordable homes, particularly in London, remains central to achieving shared housing and growth objectives.  "
        },
        {
            "text": "While we recognise the immediate challenges around housing viability in London, Vistry remains committed to leveraging our unique partnerships model, close collaboration with planning authorities, and continued engagement with Government and partners to ensure that the affordable homes our communities need are delivered.\" "
        },
        {
            "text": "Ben Denton, Head of Strategic Growth, Affordable Homes, Legal & General, said: “This is a tough call for policy makers. But it is evident that new build housing in London has stalled due to viability issues. This temporary measure will help restart delivery—something that is crucial for London’s continued growth and accessibility as a place to live and work.” "
        },
        {
            "text": "Darragh Hurley, Chief Executive Officer, Mount Anvil, said: “In times of crisis, action is needed. We welcome these bold, creative, and decisive measures. Many more Londoners will now benefit from the improved life chances that the delivery of high-quality new homes offers.” "
        },
        {
            "text": "David Thomas, Chief Executive at Barratt Redrow, said: “This is a welcome set of proposals that will help to tackle the housing delivery crisis in London. Government and industry are united in wanting to build more homes of all tenures and deliver the investment in infrastructure, jobs and economic growth that development brings. We will continue to work with Government and the Mayor of London to find ways to bring forward developments and unlock more affordable housing to achieve their ambitious targets and meet housing need in the capital.\" "
        },
        {
            "text": "Paul Rickard, Chief Executive Officer, Pocket Living, said: “We are pleased to see a range of meaningful interventions from the Housing Secretary and Mayor of London that will make a real difference in delivering much-needed London homes of every type. The government and GLA continue to listen to the sector, and these changes could provide a vital lifeline for London’s SME housebuilders while ensuring the capital remains central to delivering 1.5 million new homes.” "
        },
        {
            "text": "Rob Perrins, Chair of Berkeley Group, said:  \"We commend the Secretary of State and Mayor of London's leadership in bringing forward this package, which goes a long way towards resolving London's viability challenge. For these measures to work in practice, every organisation involved in housing delivery must now get behind them, and act with real urgency and conviction to increase homebuilding at pace.  "
        },
        {
            "text": "\"At Berkeley Group, we want to play a lead role in driving London's growth. As viability is restored, we stand ready to invest some £3 billion into new land and homebuilding activity, alongside the investment to create our own £2 billion Build to Rent platform.\" "
        },
        {
            "text": "Simon Carter, CEO, British Land, said: \"We are delighted to see the new Secretary of State move quickly and whilst this is not a silver bullet, we are encouraged by the direction of travel for new planning applications.\" "
        },
        {
            "text": "Neil Jefferson, Chief Executive of the Home Builders Federation said:  “Today’s [23 October] announcement will be welcomed by anyone with an interest in seeing more new homes built for Londoners and ensuring that London thrives socially and economically. For many reasons, building homes in London has become ever more challenging over recent years and as a result the housing pipeline for the capital has all but dried up. To maintain its status as a world-leading city, London desperately needs more new homes. These efforts to improve the viability of delivering new housing and speed up the process of turning investment into homes will help reverse the decline in homebuilding. We now hope to see efforts to support affordability and home buyers, which would make sure this package truly delivers.\" "
        },
        {
            "text": "John Dickie, Chief Executive at BusinessLDN, said:  “With housing starts, planning applications and house sales at historic lows in the capital, the Government and Mayor are right to take action to accelerate delivery of the new homes that Londoners desperately need. As housebuilding costs have spiralled in recent years, construction has faltered. This is hitting London’s competitiveness by making it harder for employers to recruit and retain staff, while also forcing boroughs to collectively spend £5.5 million a day on temporary accommodation to tackle homelessness. "
        },
        {
            "text": "“Temporarily adjusting the percentage of affordable homes that a project should provide and offering time-limited relief on developer contributions to local infrastructure payments are welcome and these changes, along with greater flexibility on design standards and enhanced planning powers for the Mayor, will help to get more shovels in the ground. We are delighted to see the Government back our calls for the establishment of a City Hall Developer with £320m of funding which can be used to leverage in more private investment and create partnerships to unlock more land for development. "
        },
        {
            "text": "Antonia Jennings, CEO at Centre for London, said: “Housebuilding by developers in the capital has plummeted. And we’ve therefore seen a huge reduction in the number of social homes built in London. 336,000 London households are on the waiting list for a social home. Many people are stuck in overcrowded, mouldy or unsafe housing. Something has to change”   "
        },
        {
            "text": "“The 35% affordable homes target for new developments is admirable, and it’s one London should strive for in the long-term.   "
        },
        {
            "text": "“The reality is, however, that 35% of nothing, is nothing. When no new developments are being built, there will be no new social homes. If reducing the affordability targets to fast-track planning permission unlocks a substantial number of new developments, the end result will be more social homes in the capital. With the state of the housing crisis, we need immediate action and to make difficult decisions to get spades in the ground.   "
        },
        {
            "text": "“This is a pilot project, set to take place for two years. It must be used as a temporary measure to release the backlog of stalled sites and unused land, not as a long-term solution.”   "
        },
        {
            "text": "Kane Emerson, Head of Housing, YIMBY Alliance, said:  “YIMBY Alliance supports the Government’s drive for 1.5 million new homes in this Parliament. Britain has built far too few homes in the best connected locations, driving up housing costs and pricing out working people.  "
        },
        {
            "text": "The Government’s announcement on improving London Plan guidance is hugely welcome to tackle the housing crisis and allow London to meet the desperate need for more decent homes.”  "
        }
    ]
}