{
    "url": "https://planninginspectorate.blog.gov.uk/2025/10/24/striving-for-speed-without-compromising-quality/",
    "title": "Striving for speed without compromising quality",
    "authors": [
        "Graham Stallwood"
    ],
    "categories": [
        "Appeals",
        "Applications",
        "Examinations",
        "Performance",
        "Public service"
    ],
    "pub_date": "2025-10-24T11:19:05+01:00",
    "content": [
        {
            "text": "Graham Stallwood, Chief operating officer for the Planning Inspectorate, reflects on the practical impact of the Planning Inspectorate’s work and gives his insights into our most recent performance update. "
        },
        {
            "text": "We make 75-80 decisions and recommendations every working day on average and approaching 20,000 every year, each of them made with the highest care and consideration."
        },
        {
            "text": "However, in amongst the sheer volume it’s important to remind ourselves of the real impact those decisions make."
        },
        {
            "text": "In the seven Local Plan examinations opening in September and October 103,000 homes are proposed to be built."
        },
        {
            "text": "Not only is that giving more people the opportunity to have a decent, safe place to call home, perhaps giving more people a chance to get on the property ladder, but it's contributing considerably to the Government’s aim of having 1.5m homes built during this parliament."
        },
        {
            "text": "And it's not just Local Plans making a difference. Last month you will have seen the Department for Transport granted development consent for the Gatwick Airport Northern Runway application."
        },
        {
            "text": "They also gave development consent for the M62/M60/M66 Simister Island junction improvements following our examinations and recommendations, contributing to the government’s pledge to make decisions on 150 major economic infrastructure projects."
        },
        {
            "text": "The impact of that will be felt most by the 90,000 drivers a day (see notes) who pass through the Simister Interchange who can perhaps look forward to getting to work or home quicker or reaching appointments in a more relaxed state because of the planned work to ease that junction."
        },
        {
            "heading": 2,
            "text": "Our performance"
        },
        {
            "text": "Our latest performance statistics have just been published, and I’m really pleased with progress in some key areas."
        },
        {
            "text": "We're making quicker decisions. The median decision time for deciding appeal cases in September was 20 weeks (19 weeks for those decided by written representation), while the average over the past 12 months was 25."
        },
        {
            "text": "We're consistently bringing down the number of open cases. At the end of September this year we had 10,718 having worked hard to reduce it from 13,305 at the end of October 2024."
        },
        {
            "heading": 2,
            "text": "You can help"
        },
        {
            "text": "We'll keep doing all we can to decide cases by inquiries and hearings within 26 weeks, but there's more you can do to help us:"
        },
        {
            "heading": 2,
            "text": "Progress in our services"
        },
        {
            "text": "We're making progress in streamlining the local plan process for LPAs. We’ve just launched a pre-examination checklist so LPAs and the Planning Inspectorate can check if a Plan is ready for submission. This will potentially save all parties time and money and prevent more Plans from being found unsound."
        },
        {
            "text": "And as our Head of Service for Local Plans, Andrew Megginson, says in his blog, “We've also enhanced our programme officer training, recognising that an efficient programme officer can save considerable time and ensure smooth examination processes. Our next training session is on 5 November, and I'd encourage any authority considering internal recruitment to take advantage of this free resource.”"
        },
        {
            "text": "We continue to work to speed up each part of the NSIP process including a focus on expediting the pre-application and pre-examination stages and we are still hitting all our statutory timeframes."
        },
        {
            "text": "So that's a whistlestop tour of our corner of the planning world. It’s busy and the challenge is for us to get even quicker without compromising our quality, but it is a challenge we relish as we work together with you to improve the planning system for all."
        },
        {
            "heading": 3,
            "text": "notes"
        },
        {
            "text": "National Highways’ project information on the expected benefits of the Simister Island DCO - M60 junction 18 Simister Island Interchange - National Highways"
        },
        {
            "text": "See our Background Quality Report for details on how we report on open cases - Quarterly official statistics - background quality report 23 October 2025 - GOV.UK"
        }
    ]
}