{
    "url": "https://nationalscreening.blog.gov.uk/2025/10/24/uk-nsc-blood-spot-task-group-work-leads-to-new-journal-publication/",
    "title": "UK NSC Blood Spot Task Group work leads to new journal publication ",
    "authors": [
        "Silvia Lombardo"
    ],
    "categories": [
        "Newborn Blood Spot Screening",
        "UK National Screening Committee"
    ],
    "pub_date": "2025-10-24T08:46:06+01:00",
    "content": [
        {
            "text": "We’re pleased to announce the publication of a new article in the International Journal of Neonatal Screening following work commissioned by the UK National Screening Committee’s (UK NSC’s) Blood Spot Task Group (BSTG)."
        },
        {
            "text": "The paper explores the challenges, opportunities and practical approaches when developing mathematical models to support policy decisions in newborn blood spot (NBS) screening."
        },
        {
            "text": "Modelling studies use a set of techniques and methods to synthesise evidence from different sources with expert opinion. This enables the simulation of comparisons that often cannot be achieved using primary research methods1. "
        },
        {
            "text": "This project combined a systematic review of the literature with a series of workshops involving stakeholders from the UK and internationally. These stakeholders included modelling experts, members of the UK NSC, health professionals and patient voice representatives. "
        },
        {
            "text": "The new paper highlights the complexity of developing models in newborn screening and rare disease settings. It identifies gaps in current practice and makes recommendations for the improvement of model design, terminology, data infrastructure, and stakeholder collaboration. "
        },
        {
            "text": "Reference: "
        },
        {
            "text": "1. Lombardo S, Seedat F, Elliman D, Marshall J. Policy-making and implementation for newborn bloodspot screening in Europe: a comparison between EURORDIS principles and UK practice. The Lancet Regional Health – Europe. 2023;33. "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}