{
    "url": "https://dcmslibraries.blog.gov.uk/2025/10/24/unearthed-the-power-of-gardening-exhibition-in-libraries-across-the-uk/",
    "title": "\"Unearthed: The Power of Gardening exhibition\" in libraries across the UK  ",
    "authors": [
        "The British Library"
    ],
    "categories": [
        "British Library",
        "Case study"
    ],
    "pub_date": "2025-10-24T13:39:07+01:00",
    "content": [
        {
            "text": "Green Libraries Week 2025 celebrates climate initiatives led by the library sector. This blog highlights the impact of the British Library’s recent Unearthed: The Power of Gardening exhibition in libraries across the UK. Libraries have always been places of discovery and dialogue and are powerful catalysts for curiosity and creativity. This exhibition has reaffirmed the impact of cultural programming in libraries as an effective way to meaningfully engage people to take action on climate change, in the places where they live. "
        },
        {
            "text": "Unearthed in St Pancras"
        },
        {
            "text": "The exhibition ran at the British Library in St Pancras between May and August 2025, featuring historic manuscripts, artefacts and artworks alongside contemporary material. It featured a range of sustainable exhibition practices, building on previous work by the Library to reduce its emissions, including the reusing of exhibition cases, use of bio-based display material (timber, water-based paints, cork), working with sustainability-conscious designers, minimising travel impacts of loan items, and reducing waste. A partnership with local charity Global Generation planted a new wildflower meadow in the Poet’s Circle on the Library’s public Piazza. "
        },
        {
            "text": "Unearthed across the country"
        },
        {
            "text": "Earlier this year, the British Library’s Living Knowledge Network (LKN) delivered the Unearthed: The Power of Gardening exhibition in over 80 libraries across the UK. Between May and August 2025, these local exhibitions reached over 800,000 people who engaged with Unearthed LKN displays and events across the UK. "
        },
        {
            "text": "The LKN brings together local authority public library partners with the British Library, the National Library of Scotland and the National Library of Wales. The network promotes libraries as unique cultural spaces helping to support connected communities. Its exhibitions support libraries to explore a range of diverse themes in ways that are unique to each community."
        },
        {
            "text": "Unearthed explored the transformative, enriching and sometimes radical power of gardening in Britain and the impact it has on people, communities and the environment. It has proven to be hugely popular across the UK, highlighting the intrinsic connection between libraries, communities and their green spaces. "
        },
        {
            "text": "Over 370 events have taken place, programmed by partner libraries, including talks, creative sessions, seed banks and walking tours, sparking numerous local partnerships. Highlights include:"
        },
        {
            "text": "Impact"
        },
        {
            "text": "Unearthed provided libraries with an opportunity to explore the exhibition themes in ways unique to each community - showcasing local collections, creating book displays and developing connections with community groups. Libraries used the panel exhibition as a catalyst to engage with a wider range of local organisations and groups, including local gardening clubs, people with visual impairments, and arts and ecological organisations."
        },
        {
            "text": "The exhibition sparked a deeper understanding of the social history of gardening and created renewed appreciation of local green spaces and their importance to communities, with one visitor noting; “Learning about the history of allotments and land grabbing was very interesting and widened my appreciation for our access to outdoor spaces.”"
        },
        {
            "text": "The exhibition also resulted in libraries engaging with green spaces in new and interesting ways, with 75% of LKN libraries making use of outdoor library spaces in new ways or planning to do so. Libraries without green spaces have also re-looked at their offers and 85% of LKN libraries have already developed or are planning new green initiatives, such as seed banks. "
        },
        {
            "text": "Library events have connected people to the green spaces around them, with  opportunities to engage with sustainability and climate issues. In Cambridgeshire, a new partnership was developed with the local Botanic Garden which led to a tour there with a group of settled refugees. These partnerships with community groups supported people to connect to nature groups in their areas."
        },
        {
            "text": "“It really worked that they had introduced local organisations, because then you instantly know where you can go if you want to get more information or take that hobby further” (audience discussion group participant)."
        },
        {
            "text": "The exhibition also raised awareness of the range of activities and opportunities offered by libraries. "
        },
        {
            "text": "“After the Unearthed event, when I attended the workshop with my kid, I think something has changed, because I did not know that libraries can have these kinds of events. It has opened my mind.” (audience focus group participant)."
        },
        {
            "text": "The exhibition also inspired onward curiosity, with 51% of Unearthed audiences saying that they will explore or engage further with the topic, and 32% intending to borrow a book on the subjects covered."
        },
        {
            "text": "The exhibition is continuing in selected locations. We look forward to sharing more learning from this remarkable UK-wide exhibition with the sector and policymakers in early 2026, following a full evaluation of its impact."
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "Unearthed: The Power of Gardening has powerfully embodied the principles at the heart of Green Libraries Week, and through the Living Knowledge Network libraries have shown their remarkable ability to inspire and empower communities and individuals to take real action on climate and sustainability. "
        },
        {
            "text": "As part of the week the British Library is also looking forward to participating in the Green Libraries Conference in London on Monday 27th October. The conference will bring together library professionals from academic, school, public and legal sectors to share ideas on environmental understanding and action in the library sector. This will include a presentation from Maddy Smith, lead curator of Unearthed, on how sustainable practices were considered during the exhibition design."
        }
    ]
}