{
    "url": "https://environmentagency.blog.gov.uk/2022/08/17/environment-agency-warns-of-significant-surface-water-flooding-from-thunderstorms-in-london-and-south-east/",
    "title": "Environment Agency warns of significant surface water flooding from thunderstorms in London and south east",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood",
        "Flood Planning"
    ],
    "pub_date": "2022-08-17T10:52:06+00:00",
    "content": [
        {
            "text": "Significant surface water flooding is probable across London and parts of south-east England today due to heavy showers and thunderstorms."
        },
        {
            "text": "Surface water flooding generally occurs after heavy rainfall in urban areas, when water cannot drain away or soak into the ground. It can happen very quickly and can be difficult to predict."
        },
        {
            "text": "However the extremely dry conditions of recent weeks have meant that the ground is hard and compacted across the country, further increasing the risk of localised surface water flooding in all areas."
        },
        {
            "text": "The Environment Agency has teams out on the ground ready to support local authorities in responding to potential floods and is urging the public to take care."
        },
        {
            "text": "Neil Davies, Flood Duty Manager at the Environment Agency, said:"
        },
        {
            "text": "Local authorities are responsible for managing the risk of flooding from surface water. This includes planning for and responding to surface water flooding. We support them by sharing data and giving advice and guidance, helping shape their plans."
        },
        {
            "text": "But responding to all kinds of flooding needs us and local authorities to work together. Just as we need local authorities’ support when we’re facing flooding from rivers or the sea, the Environment Agency will be out and about, offering practical assistance and advice during surface water flooding incidents."
        },
        {
            "text": "You can check your flood risk, sign up for free flood warnings and keep up to date with the latest situation at https://www.gov.uk/check-if-youre-at-risk-of-flooding or follow @EnvAgency on Twitter for the latest flood updates."
        }
    ]
}