{
    "url": "https://educationhub.blog.gov.uk/2022/08/17/how-a-levels-gcses-t-levels-qualifications-have-been-graded-in-2022/",
    "title": "How A Levels, GCSEs, T Levels and other qualifications have been graded in 2022",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2022-08-17T14:49:45+01:00",
    "content": [
        {
            "text": "It’s vitally important that when young people have worked hard to get qualifications like GCSEs, A Levels, T Levels and vocational and technical qualifications (VTQs) like BTECs, the grades they receive reflect what they know, understand and can do."
        },
        {
            "text": "If that’s not the case then qualifications lose their worth and universities, other educational institutions and employers won’t take them seriously. That’s why the exams regulator Ofqual has said it wants to return to results that are in line with pre-pandemic grading, but not in one go. This year’s grades will be part way between summer 2019 and summer 2021."
        },
        {
            "text": "Because exams couldn't go ahead, grades in summer 2020 and 2021 were based on a different form of assessment."
        },
        {
            "text": "But with a return to exams this year, here we explain how the grading system worked the last time exams were sat, how it worked when exams weren’t taken and how we’re moving back to the system in place before the pandemic."
        },
        {
            "heading": 3,
            "text": "How did grading work before the pandemic?"
        },
        {
            "text": "In a normal exam year, Ofqual and awarding organisations use a combination of tools when setting grade boundaries in GCSEs, AS and A levels, and other qualifications."
        },
        {
            "text": "In all qualifications, awarding organisations use a range of evidence including, data on how students have performed in exams/assessments this year and previous years, and an expert examiner's review of the quality of a student's work."
        },
        {
            "text": "In GCSE and A levels, exam boards use data from Key Stage 2 tests and GCSEs. This is to align standards across exam boards in a subject, so it’s no easier to get a grade with one board than another. But other sources of evidence are used where they are available."
        },
        {
            "text": "In GCSE English language and maths, Ofqual also has evidence from the National Reference Test (NRT). The NRT is taken every year by a sample of year 11 students, a few months before GCSEs, to provide an objective measure of year 11 attainment in English and maths."
        },
        {
            "text": "VTQs are designed with different structures and purposes, and so the way students are assessed is more diverse than for GCSEs, AS and A levels."
        },
        {
            "text": "During the pandemic students were not able to take exams safely or fairly. This meant they were  assessed through a different system."
        },
        {
            "text": "Last year, teacher assessed grades were awarded using evidence collected through a range of assessments. Results were based on grades determined by teachers using guidance and frameworks from Ofqual and the Joint Council for Qualifications (JCQ). Teachers worked hard to make sure their judgements were a fair reflection of students’ performance."
        },
        {
            "heading": 3,
            "text": "How is grading working this year?"
        },
        {
            "text": "This year, as in any normal year in which exams take place, grades have been set using a combination of examiner judgement and data."
        },
        {
            "text": "However, to reflect the disruption that this year’s students have been through, Ofqual asked awarding organisations to be generous when setting grade boundaries, and to aim for a midpoint between 2019 and 2021. Grading for VTQs will reflect a similar level of generosity this year."
        },
        {
            "text": "Crucially, senior examiners have reviewed the work in all qualifications to make sure that grades continue to have meaning and value."
        },
        {
            "text": "T levels launched in 2020 and the first students will receive their T level results this year. T levels involve a wide range of written assessments and practical assessments."
        },
        {
            "text": "Ofqual and the Institute for Apprenticeships and Technical Education (IfATE) asked T Level awarding organisations to recognise the effects of the pandemic in the grading. This was for the Core and Occupational Specialism components of T Levels – those assessed by exams – this summer. This is in line with the approach taken in other qualifications such as A levels, reflecting the fact that these are new qualifications, and the disruption caused by the pandemic."
        },
        {
            "text": "Employers have also been involved in ensuring that the resulting standards meet their expectations."
        },
        {
            "heading": 3,
            "text": "What about grading in 2023?"
        },
        {
            "text": "Ofqual has said it is aiming to return to results that are in line with pre pandemic grading in 2023."
        }
    ]
}