{
    "url": "https://lifeathmrc.blog.gov.uk/2022/08/17/juggling-caring-with-a-career/",
    "title": "Juggling caring with a career",
    "authors": [
        "Sabrina Thomas"
    ],
    "categories": [
        "Culture & Values",
        "Diversity",
        "Inclusion",
        "Recruitment"
    ],
    "pub_date": "2022-08-17T08:55:16+00:00",
    "content": [
        {
            "text": "Like many carers throughout the UK, Sabrina Thomas juggles caring responsibilities with a full-time job. In our latest blog, Sabrina opens up about the challenges she has faced and how HMRC have supported her career progression whilst being a full-time carer for her parents.  "
        },
        {
            "text": "As an only child, I would often worry about how I would be able to juggle work with looking after my parents once they reached a certain age. This worry grew once I got into my teens, as both parents began to develop serious health problems. We lived in a small town in Wales without huge career prospects, so I moved to Cardiff (about an hour’s drive away) when I finished university. But, there always seemed like a dark cloud looming on the horizon, particularly now that there was some distance between us.  "
        },
        {
            "heading": 2,
            "text": "The challenges of private sector working  "
        },
        {
            "text": "Prior to HMRC, my career had mainly been in demanding sales jobs where there was very little flexibility. We were expected to work long hours to put the needs of the business first. Even when I worked in field sales, although there was some scope to work from home, our calendars were carefully monitored to make sure we weren’t working from home too much! Working part-time or compressed hours wasn’t an option with these roles either – if you couldn’t manage at least 40 hours a week, it was time to find a new job. In the end, I just accepted that I would need to make the most of having a full-time job and living away from home, as inevitably, I would need to regress my career to allow me to move back in with my parents as an unpaid carer.  "
        },
        {
            "heading": 2,
            "text": "A big career change  "
        },
        {
            "text": "My interest in working with HMRC initially stemmed from wanting a more secure job, as there is very little job security in sales. I hadn’t considered a career in the Civil Service before, but someone randomly recommended a job to me on Twitter, so I applied during the pandemic despite not knowing much about being a civil servant. I was successful in securing a role as a Band O Compliance Caseworker and started with HMRC in March 2021 – the time where everyone was still working from home during the Covid-19 pandemic. It felt a bit strange starting a new job completely remotely and only meeting my colleagues virtually, but everyone was incredibly warm and welcoming. It didn’t take long for me to realise I’d made the right choice by moving to the public sector. "
        },
        {
            "heading": 2,
            "text": "Becoming a carer at 33  "
        },
        {
            "text": "As my parents were vulnerable, I had already moved back home temporarily during the pandemic to ensure they didn’t need to go out until they were fully vaccinated. However, this became a more permanent arrangement when my dad had a heart attack and was diagnosed with severe heart failure in June 2021, and then a few months later in November, my mum became mostly bedbound due to severe osteoarthritis. With both needing care and no other family to provide support, it fell to me to be the sole carer of my parents.   "
        },
        {
            "text": "Despite this being undoubtedly the most stressful time of my life and something, I had been dreading for many years, my job was never part of that stress. I have had a few managers since joining HMRC and all have been incredibly understanding and supportive. They have given me the opportunity to tell them what I need in order to be successful as both a civil servant and carer. HMRC already has many flexibilities in place that can help you juggle ‘regular’ life commitments and responsibilities, such as a flexible working policy and the ability to work from home a few days each week.  "
        },
        {
            "text": "Before people from Wales were able to return to the office after the peak of the pandemic, the flexible working policy at HMRC (the ability to decide your own start/finish times and to work more on certain days so you can work less on other days) was perfect for ensuring I could take my parents to numerous hospital appointments whilst still working full time. I started to feel anxious when I found out that we would have to return to the office, as I really couldn’t see how I would juggle being back in Cardiff for most of the week and caring for my parents. However, everyone has been overwhelmingly understanding, and I have been supported in making a request for a ‘special working arrangement’ to work from home until I can get support from social services in place.  "
        },
        {
            "heading": 2,
            "text": " Progressing my career whilst being a carer  "
        },
        {
            "text": "Given I was convinced that I would have to give up working completely at this point in my life, I’m even more amazed that my managers in HMRC have really supported my development and encouraged me to apply for promotions. Recently I was successful at obtaining a promotion as HO Business Change Manager, but instead of being happy and excited, I again found myself feeling anxious about whether my new team would be as understanding about my caring responsibilities as my current manager. I feel kind of embarrassed for worrying so much now! Before starting, a grade 6 and 7 from the team made some time to talk to me and instantly reassured me that my caring responsibilities wouldn’t be an issue. My new line manager has been especially fantastic – she eased any worries I had and has even already started talking about furthering my development too.  "
        },
        {
            "text": "Illness and accidents can happen to anyone at any time, so logically anyone can become a carer at any point in their life too. It’s not the most pleasant thing to have to think about, but it’s true, and not many people give it much consideration. I feel so much more at ease knowing I’m working for an organisation that understands this, and whatever may happen in my personal life, I’ll have support from my employer. I know a lot of companies really promote their interest in wellbeing, diversity and inclusion these days and it’s easy to think it’s just a marketing gimmick or tick- box exercise. But I can honestly say that it’s sincere in HMRC. I’m so grateful to that random person on Twitter for recommending HMRC to me - I hope I can be the random person that convinces you to apply too!  "
        },
        {
            "text": "Here is a photograph of the view from a restaurant I always used to take my parents to before they got too ill - it's fond memories like this that I will cherish forever."
        }
    ]
}