{
    "url": "https://insidedio.blog.gov.uk/2024/08/12/from-casualty-evacuations-to-historic-ruins-ready-for-anything-in-belize/",
    "title": "From casualty evacuations to historic ruins: ready for anything in Belize ",
    "authors": [
        "Maj Dai Davies"
    ],
    "categories": [
        "Archaeology",
        "BATSUB",
        "Belize",
        "Defence Training Estate (DTE)",
        "Military Training",
        "Working at DIO"
    ],
    "pub_date": "2024-08-12T15:45:45+00:00",
    "content": [
        {
            "text": "Facilitating military training anywhere in the world is an important job. The primary role of DIO (Belize) Range Control, Wardens and Tracker teams is providing a safe place to train and working with exercising units to ensure that military training is both demanding and delivered safely. The ability to work in a safe place also applies to our Locally Employed Civilian, Wardens and Trackers. Although their knowledge, skills and experience while operating within what we call a Close Country Tropical Environment is second to none, we have a duty of care to ensure they receive annual refresher training on first aid, casualty evacuation by road and air, and the use of chainsaws and strimmers.  "
        },
        {
            "text": "As I mentioned, first aid training is important for all DIO range staff worldwide. Here at BATSUB – the British Army Training Support Unit Belize - our range control staff recently undertook their annual first aid training. This saw them reminding themselves of best practice to deal with fractures and breaks, choking, resuscitation, and burns, ready to potentially save a life. This is separate to the battlefield first aid course they also take, which focuses more on first aid for traumatic injuries such as treating wounds.   "
        },
        {
            "heading": 2,
            "text": "First aid and casualty evacuation "
        },
        {
            "text": "As well as first aid, our range staff in Belize undergo training that simply wouldn’t be needed for many of their counterparts working in training areas elsewhere in the world. "
        },
        {
            "text": "Range control staff went to the base of Astrum Helicopters for refresher training in how to load casualties onto helicopters if they require evacuation. The dense nature of the jungle training areas means evacuation by road would not always be practical or fast enough, so we have a contract with Astrum Helicopters in the event that such action is needed. The training covered procedures for safely approaching a helicopter, properly stowing a casualty on a spinal board, and how to then exit the helicopter safely.  "
        },
        {
            "text": "A few days later, they took part in Op TOUCAN, a drill to put these procedures into practice, observed by the training safety officer and the BATSUB medic. Op TOUCAN combines the first aid and helicopter training to ensure that staff can treat a casualty and safely load them onto the helicopter for evacuation. The team and colleagues from Astrum Helicopters then train visiting troops on these procedures before they start any exercise, so it’s vital to keep procedures top of mind. This ensures all personnel deploying onto the training estate have confidence in the casualty evacuation plan. "
        },
        {
            "heading": 2,
            "text": "Jungle-specific training "
        },
        {
            "text": "Our tracker teams are Locally Employed Civilians who are responsible for maintaining the training areas, including helicopter landing sites. They also prepare the training areas for the needs of exercising troops, such as maintaining the ranges and building harbours, which are a sort of temporary base in the field. Additionally, they deliver jungle skills training alongside the Army’s jungle warfare instructions, covering skills such as starting fires, building shelters, traps and collecting water. All of this makes them absolutely vital members of the team and their contribution is greatly appreciated by all of us at BATSUB and the exercising units. Even these experts need to keep their skills fresh, so they too had refresher training in recent months. They covered safe use of chainsaws and strimmers, which can be needed to prepare the land for training, and a number of BATSUB staff also undertook fire training, covering what to do in the event of a fire and maintenance of fire safety equipment.  "
        },
        {
            "text": "While deployed on the training area, our teams have to be able to recognise archaeological sites and artefacts. The Mayan people lived in Belize for centuries and remnants of their civilisation can be found on our training estate. In May, the Belizean Institute of Archaeology offered the team, along with colleagues from the Belize Mayan Forest Trust, refresher training on archaeology. The training covered known sites in the area, how to identify archaeological ruins, artefacts and burial sites, and what action to take. The trackers are told not to touch anything, note the GPS coordinates and report the potential find to the correct authorities. They also have to look for signs of disturbance in case of unauthorised people digging on the site looking for valuable finds.  "
        },
        {
            "heading": 2,
            "text": "Passing on knowledge  "
        },
        {
            "text": "As well as being the beneficiaries of training, our team in Belize also train others. Our training safety marshal spent two days on the training area with staff from the Belize Mayan Forest Trust, which owns some of the land, teaching them to track the signs of movement of animals or people through the jungle.  "
        },
        {
            "text": "Training in the jungle is complicated, and we need top professionals to facilitate it. Fortunately, that’s exactly what we have. "
        },
        {
            "text": "  "
        }
    ]
}