{
    "url": "https://environmentagency.blog.gov.uk/2024/08/12/restoration-of-coastal-grazing-marsh-in-essex/",
    "title": "Restoration of Coastal Grazing Marsh in Essex",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency"
    ],
    "pub_date": "2024-08-12T08:55:15+00:00",
    "content": [
        {
            "text": "My name is Nicola and I work as a Catchment Co-ordinator in the East Anglia Environment Programme team. I work across Essex from the River Colne to the Mardyke including our extensive coastline. A key aspect of my job is to establish and foster relationships with external partners, such as Essex Wildlife Trust, and support them in delivering environmental improvement projects. Together, we work to make Essex a better place for people and wildlife."
        },
        {
            "text": "Last year, I worked on the Fobbing Marsh restoration project which was part of the Environment Programme of 2022/2023. This programme includes environmental projects in East Anglia. Numerous partners have contributed to the successful delivery of this programme, such as wildlife trusts, rivers trusts, landowners, local authorities, and water companies."
        },
        {
            "text": "For those who are not familiar with Essex’s natural environment, Fobbing Marsh is a 76-hectare reserve in the county managed by Essex Wildlife Trust. The reserve is coastal and floodplain grazing marsh and is part of a wider network of marshland along the Thames Estuary."
        },
        {
            "text": "During winter, internationally important numbers of wildfowl and waders use the Thames Estuary. In the summer though, there is very little breeding habitat or significant areas of freshwater. The restoration of Fobbing Marsh seeks to meet that shortfall. The focus of the project was to renovate this priority habitat into a dynamic wetland, complete the connectivity of the landscape and build resilience to the effects of climate change."
        },
        {
            "text": "Essex is one of the driest areas in the UK. As we experience hotter and drier summers this will impact on the health of coastal grazing marsh habitat and its dependent species. Although there is currently sufficient rainfall there is a lack of capability to store this water and control the water levels on site. Holding this water on site for longer into the spring and summer will maintain optimum conditions for ground nesting wading birds and support other plant and animal communities. By managing the site as coastal grazing marsh in good condition it will hold and secure carbon."
        },
        {
            "text": "The capital works included installing a tilting weir to manage the water levels. We also blocked ditches and low points in 14 different areas to retain the water.  Upon completion of the project, we created the opportunity for optimal habitat conditions across 61 hectares of coastal grazing marsh and improved the connectivity between existing grazing marsh sites covering approximately 2,000 hectares."
        },
        {
            "text": "During the works, we adopted a ‘watching-brief’ approach to keep an eye on potential archaeological discoveries or unexploded ordinance. This site has a rich history and archaeology, so we were eager to secure and protect any remains we found. We were also conscious of finding potential unexploded bombs when digging which can be found because of heavy bombardment during WWII."
        },
        {
            "text": "Mark Iley, Essex Wildlife Trust, said “we are very pleased with the improvements that have been carried out using WEIF (Water Environment Improvement Fund) funding (and the later rotary ditching funded by Mace). The sluice is functioning well, holding water on site and the ditch blocking has raised water levels after the winter rainfalls. Water levels are very high with extensive areas of splashy grassland being created and water spilling out of the ditches at field level, so exactly what we want. Hopefully, we should see some lapwing prospecting and moving across from nearly RSPB Vange Marshes to take advantage of this new habitat, but it may take a couple of seasons for them to establish.”"
        },
        {
            "text": "The 2023 Breeding Bird Survey at Fobbing Marsh shows an increase in numbers of species compared to 2022, with a rise of 25 species to 37 species surveyed on site. The site continues to be monitored as part of the Trust’s Ecology Monitoring Programme and we should see a recovery against last year’s baseline."
        },
        {
            "text": "Subscribe to updates from the Environment agency or follow us on X"
        },
        {
            "text": " "
        }
    ]
}