{
    "url": "https://digitalpeople.blog.gov.uk/2024/02/02/2023-summer-interns-working-in-agile-sprints/",
    "title": "2023 summer interns - working in agile sprints",
    "authors": [
        "Haleema Hussain, Summer Intern, GDS"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Diversity and Inclusion",
        "Government Digital and Data",
        "Graduate schemes and Fast Stream"
    ],
    "pub_date": "2024-02-02T13:29:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "I am immensely grateful for the opportunity to work in the Government Digital Service (GDS). This internship has offered me the opportunity to thoroughly explore working with a variety of teams within GDS and contributed to developing my understanding of what working in an agile environment entails."
        },
        {
            "heading": 3,
            "text": "Agile and Sprint Working"
        },
        {
            "text": "Working in two-week “sprints” was a completely new experience to me but has made me value the importance of prioritising efficient and communicative working. This has made tackling large projects more manageable. Additionally, the opportunity to reflect on previous sprints to highlight what went well, the pain points and identify the blockers has been a valuable evaluative approach. I hope that I can continue to implement sprint working in future projects and job prospects."
        },
        {
            "text": "I worked across the design systems team where we explored the importance of user research and the role user research has in ensuring users receive an accessible experience across government platforms. Working with the Notify team offered an opportunity to examine both qualitative and quantitative data from interview surveys. Being asked to do a presentation on some of the findings was a great opportunity to further develop my analytical and data analysis skills. Additionally, working alongside the Forms Adoption team helped me develop my knowledge of auditing skills while also developing my user researcher tool kit."
        },
        {
            "heading": 3,
            "text": "Conclusion"
        },
        {
            "text": "Ultimately, I am extremely grateful to the GDS team for their kindness and generosity. Having one-to-one conversations with user researchers, developers, product managers and many more team members where I was able to ask questions regarding their role has been extremely insightful."
        }
    ]
}