{
    "url": "https://environmentagency.blog.gov.uk/2024/02/02/governments-environmental-improvement-plan-one-year-on/",
    "title": "Government’s Environmental Improvement Plan: One year on",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Sustainability"
    ],
    "pub_date": "2024-02-02T14:09:58+00:00",
    "content": [
        {
            "text": "Our chair Alan Lovell reflects on our progress to achieve government’s Environmental Improvement Plan (EIP) goals. "
        },
        {
            "text": "One year ago, the government published the Environmental Improvement Plan (EIP) to halt and reverse the decline of nature in our country."
        },
        {
            "text": "With climate change impacting us more and more, the Environment Agency is working closely with government, businesses and communities to ensure we are making progress towards nature recovery.\nTo achieve EIP goals we need thriving, diverse and species-rich ecosystems."
        },
        {
            "text": "But ecosystems cannot adapt as fast as the climate is changing. Freshwater ecosystems are particularly at risk from rising temperatures, water demand, pollution and invasive species."
        },
        {
            "text": "Science plays such an important role in everything the Environment Agency does. It provides us with the insights we need to decide how to respond to the changes we are experiencing. Our Science Strategy describes the broad areas of science where we will continue to invest in ourselves and work in partnership with others to achieve our ambitions."
        },
        {
            "text": "We have already made some exciting progress in creating and restoring habitats, reducing pressures and supporting the species that need bespoke action. We are improving the resilience of wildlife species and ecosystems."
        },
        {
            "text": "Here are some of the projects we’re involved in. "
        },
        {
            "text": "Tree Planting: Keeping Rivers Cool project "
        },
        {
            "text": "Keeping Rivers Cool is an Environment Agency led project to help rivers and ecosystems adapt to a changing climate."
        },
        {
            "text": "As the climate changes, rivers and streams are likely to get warmer, and this reduces oxygen in the water, affecting fish and other wildlife. This project promotes a simple idea: that riparian shade keeps rivers, the salmon and trout and other life within them, cool. So, we’ve collaborated with key partners such as the Woodland Trust and Rivers Trusts to plant trees and install riparian fencing along appropriate sites."
        },
        {
            "text": "Planting trees helps by shading the watercourses, which lowers river temperatures. Shade from trees can reduce temperatures in small rivers on average by 2–4ºC (compared to unshaded streams). In the Ribble catchment we’ve seen some great results of shaded sites being over 6°C cooler on hot days."
        },
        {
            "text": "The project uses our LIDAR data. This data allows to produce fascinating maps showing rivers and shading across England. The keeping Rivers Cool targeting maps are being used to help increase riparian tree planting as part of the England Woodland Creation offer and support projects such as Woodlands for Water."
        },
        {
            "text": "Learn more about the project and how you can get involved: https://jncc.gov.uk/our-work/keeping-rivers-cool/"
        },
        {
            "text": "Landscape Recovery: River Axe project "
        },
        {
            "text": "We’re working with partners and 32 farmers and landowners to improve the condition of the Upper Axe across 2,777 hectares of land."
        },
        {
            "text": "Restoring habitats in the upper part of the river will also benefit the condition of the SSSI further downstream."
        },
        {
            "text": "Just over a year ago, the project received funding via Defra’s Landscape Recovery to establish a plan to reduce pollution, restore nature and reconnect the Axe with its floodplain."
        },
        {
            "text": "Our collaborative approach is essential to the success of the project. The Upper Axe Landscape Partnership Community Interest Company (CIC) has paved the way for this project and helped establish strong partnerships between all the stakeholders involved. We’re working with farmers, ecologists, vets and the Magdalen Environmental Trust, just to name a few."
        },
        {
            "text": "In the Axe catchment and across the south-west, the soil has a high clay content which can’t hold as much rainwater as other soil types. This leads to more surface-water runoff and more flooding.\nThe project seeks to modify farm practices to improve soil structure, helping reduce this runoff and improving the overall quality of the soil. Only by working alongside farmers can we realise the potential for the public to view farms and food production as part of the solution to biodiversity loss, greenhouse gas emissions and climate change."
        },
        {
            "text": "Alongside improvements to the soil, our project will improve and create biodiverse habitats (in and out the water) through tree planting and river channel restoration. This will help increase carbon sequestration, reduce pollution and produce a network of different habitat types for wildlife."
        },
        {
            "text": "Read more about River Axe project."
        },
        {
            "text": "Read about other Landscape Recovery projects we’re involved in."
        },
        {
            "text": "Peat Restoration: Moors for the Future "
        },
        {
            "text": "Moors for the Future is one of many projects we’re involved in across England, aiming to restore upland peat. Peatlands are an iconic feature of England’s landscape - often referred to as “our national rainforest”. They contain over half of the country’s terrestrial carbon stores and provide a haven for wildlife, as well as supporting better water quality and natural flood management.\nThey cover just 3% of the world’s surface yet holds nearly 30% of soil carbon. Around 70% of drinking water in the UK comes from peat dominated landscapes, yet ~80% of peatlands are degraded or modified.\nWe have a unique role with peat management: from reducing climate change impacts and flood risks to improving biodiversity and maintaining sustainable agriculture through nature-based solutions.\nLearn more about the project."
        },
        {
            "text": "It is great that the Environment Agency is an active partner in the array of successful projects that are paving the way to nature recovery and environmental improvement for future generations.\nWe can successfully tackle the climate emergency if we do the right things and early action counts! We must step up to level up and show what it takes to live in a changing climate. It may require us to think differently, collaborate and invest in change but together these actions will help us to transition to a climate resilient nation."
        }
    ]
}