{
    "url": "https://forestrycommission.blog.gov.uk/2024/02/02/growing-strong-defras-trees-and-forestry-team-reflect-on-the-last-6-months/",
    "title": "Growing strong: Defra’s Trees and Forestry Team reflect on the last 6 months",
    "authors": [
        "Bella Murfin and Naomi Matthiessen"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2024-02-02T17:18:21+00:00",
    "content": [
        {
            "text": "Time flies when you’re having fun, or so the saying goes – time also flies when you’re running a major programme, and we can hardly believe that we’re just a few months away from the last year of the Nature for Climate Programme as we know it!"
        },
        {
            "text": "We’ve been as busy as ever since our last blog in July 2023 and wanted to use this one to reflect a bit on the highs and lows of almost 4 years, and our hopes for 2024/25."
        },
        {
            "text": "As we write, the recent freeze has passed and Storms Isha and Jocelyn have blown through the country. All this noteworthy weather has a real impact on the delivery of tree planting schemes, which is one of the many reasons that planting rates have been, and will continue to be, unpredictable."
        },
        {
            "text": "None-the-less, we’re on track to build on the success of last year’s planting season, where we saw 40% more trees go in the ground, year-on-year. We are still aiming to treble rates over the lifetime of the programme and, whilst it’s going to be hugely challenging, we can’t help but be proud of how far the tree programme team has come."
        },
        {
            "heading": 2,
            "text": "Putting Down Roots "
        },
        {
            "text": "The first thing that feels different to the early days of Nature for Climate is that we now have solid foundations to build the future upon – bigger, stronger teams in core Defra, Forestry Commission, Natural England and Community Forests all striving to identify the best places to plant and establish new trees and woodland, working with landowners and managers right across the country. We have created new jobs in Forestry and related sectors over the last 4 years, with more to come in the future (see our forestry apprenticeship programme)- the roots of this programme will run deep."
        },
        {
            "text": "And more people know now that there’s never been a better time to plant trees – our  Put Down Roots campaign has been promoting the benefits of tree planting and woodland creation to farmers and landowners across England, encouraging them to apply for tree planting grants, and access expert advice from local Woodland Creation Partners. You can read more about this in Farmers Weekly."
        },
        {
            "text": "This support from farmers and landowners is a vital plank of our work acknowledging that it takes specialist knowledge to grow our treescape in ways that will generate the most benefits, for climate, and people. Farmers like Ben Andrews, Ally Hunter Blair, Jimmy Doherty, Joe Seels, and Tom Martin have been sharing their experiences of putting trees on their farms, helping to bring things to life. And we’ve been giving more people access to training via the Trees and Arboriculture Training Fund that will help them to grow and manage trees effectively."
        },
        {
            "text": "In September we launched the Woodland Management Matters campaign which aimed to encourage existing woodland owners and those considering woodland creation to adopt sustainable woodland management practices, increase the number of woodlands that are actively managed and prevent neglect by giving woodland owners the information, support, advice and confidence they need to effectively manage their woodland."
        },
        {
            "text": "The other strong root we’ve put down, perhaps the tap root, is our legally binding target to increase tree and woodland canopy cover to at least 16.5% of England by 2050. This is a clear commitment to long-term action on Trees, as described in the Environmental Improvement Plan."
        },
        {
            "heading": 2,
            "text": "Managing the metaphorical woodland of the programme"
        },
        {
            "text": "From making it quicker to plant a tree, to ensuring our grant schemes are providing longer-term funding for the establishment of new woodlands, to helping realise the big ambitions for Local Authorities tree cover in their areas through the Woodland Creation Accelerator Fund, the tree programme team is always monitoring, learning, listening and adjusting.  We know we won’t always get things right first time, but we will keep working to make things better."
        },
        {
            "text": "This ‘can do’ attitude made it possible for the team to pull out all the stops and launch our £2.5 million Coronation Living Heritage fund to commemorate the Coronation of His Majesty King Charles III. The fund is creating green spaces and connecting communities with nature as a reminder of the Coronation, and a fitting tribute to his lifetime of advocacy for nature and the environment. We look forward to sharing the results with you in our next blog!"
        },
        {
            "heading": 2,
            "text": "New woodlands in National Tree Week"
        },
        {
            "text": "Four years of the Tree Programme means four years of involvement in National Tree week, and we have seen them go from strength to strength. The most recent one ran earlier in the winter, and saw new woodlands, improved woodland access, and greater protections for street trees announced in a Defra press release as part of the celebrations."
        },
        {
            "text": "During the 2023 National Tree Week there was the announcement of a £16 million boost in funding for Forest Research giving an insight into, and underpinning the  importance of, Research and Development to the work of the NCF Programme. Scientific research will leave a lasting legacy of knowledge that will have far-reaching benefits. Newly funded projects are helping us better understand how trees interact with soils, each other, and the wider environment. There is so much that we still need to learn, and partnerships with Forest Research, Royal Botanic Kew Gardens, University of Gloucester and University of Reading  and the advice of our expert Trees and Woodland Science Advisory Group are helping us understand more all the time."
        },
        {
            "heading": 2,
            "text": "Planting the future "
        },
        {
            "text": "Along with all of the work described above, we’re seeing more trees than ever becoming part of our landscape."
        },
        {
            "text": "We estimate that 15 million trees have been planted since the start of the programme with nearly 5 million in the last year alone. It’s an extraordinary achievement, and testament to the effort and collaboration of hundreds of people. That includes those in our network of Community Forests, who have created around half of the hectares of new woodland funded by the programme so far."
        },
        {
            "text": "Defra and England’s Community Forests welcomed two new Community Forests into the network during National Tree Week, Tees Valley and Derbyshire Heartwood. The new forests will build on the success of the 13 existing Community Forests across England and will contribute to the government’s tree planting targets.  They are bringing people closer to nature in and around some of the most nature-deprived parts of the country."
        },
        {
            "heading": 3,
            "text": "A new Forest for the Nation"
        },
        {
            "text": "With that ambition in mind, government recently launched a competition for a new national forest as part of an ambitious package to help people across the country access nature."
        },
        {
            "text": "Communities will be able to put their local areas forward to become a new Forest for the Nation, with the winning location receiving up to £10 million to help fund the project. This will build on the success of the National Forest in the Midlands, which spans 200 square miles across parts of Derbyshire, Leicestershire, and Staffordshire."
        },
        {
            "text": "As well as helping to deliver on biodiversity net gain, the Forest will champion the role of local communities and organisations in driving forward the forest’s creation, management, and delivery of important social and economic benefits, including tourism. It will, in time, bring communities together by gifting them an authentic sense of ownership over their local woodlands and green spaces."
        },
        {
            "text": "Another area where we’re so pleased with the great progress that’s been made over recent years is on getting more domestic timber into our built environment. We closed the door on 2023 with the launch of our  Timber in Construction Roadmap which is one of many excellent examples of how tree programme team spans more than the Defra group. Collaborating with other government departments, the construction and insurance sectors, wood processors, academic institutions and many more, we’ve co-created a pathway that will see us address knowledge gaps and take action to increase the safe use of timber in construction, locking up carbon and providing many other benefits."
        },
        {
            "text": "Increasing our timber security is vital to meeting our demand for timber and wood-based products. We’re pleased to have engaged with the Industry Leadership Group on the National Wood Strategy, also launched at the end of 2023. Highlighting opportunities for innovation and growth in a sector that has strong potential to positively contribute to net zero, biodiversity gain, housing, and health, this is just the beginning of positive, long-term, cross-sector conversations that will see a thriving and resilient forestry sector through collaboration."
        },
        {
            "text": "2023 was the latest in an action-packed few years for us, our team, and our delivery partners. We are looking ahead to 2024 with lots of hope for even higher planting rates, more progress on transforming the Forestry sector, and strengthening those foundations of Nature for Climate. As the roots of all our efforts grow ever stronger, we hope the branches of its impact continue to spread and flourish."
        },
        {
            "heading": 3,
            "text": "Interested in planting?"
        },
        {
            "text": "If you’re a landowner, forester, or farmer we urge you to look at what’s on offer to create woodland and find out if you’re eligible to apply."
        }
    ]
}