{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/02/02/national-apprenticeship-week-2024-meet-the-stem-apprentices-2-3/",
    "title": "National Apprenticeship Week 2024: Meet the STEM Apprentices 2/3",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Talent & Leadership"
    ],
    "pub_date": "2024-02-02T11:13:01+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Luke – Engineering Degree Apprentice: Bachelor of Engineering (BEng) in Electronic Engineering "
        },
        {
            "text": "I’m a final year Engineering Degree Apprentice studying for a Bachelor of Engineering (BEng) in Electronic Engineering, with the ambition of achieving Incorporated Engineer (IEng) status on completion, through the Institute of Engineering and Technology (IET).  "
        },
        {
            "text": "I have been fortunate to undertake my apprenticeship within the Submarine Delivery Agency (SDA), an executive agency of the Ministry of Defence (MOD).  "
        },
        {
            "text": "It was a bit daunting at first to move away from home and join the scheme. However, I have met other trainees within the organisation and quickly made lots of new friends. As part of the apprenticeship, I’ve had the opportunity to move around the organisation and get involved in a variety of projects spanning the whole submarine life cycle.  "
        },
        {
            "text": "The scheme encourages me to choose my own placements within the SDA, MOD, wider government departments and our tier 1 industry partners. This has given me the opportunity to tailor my experience to suit my own personal development goals and interests within engineering, while gaining valuable skills, such as managing stakeholders, dealing with change and decision-making. The hybrid approach of apprenticeships has given me the chance to achieve professional accreditation from the Engineering Council in a shorter space of time, helping to accelerate my career. "
        },
        {
            "text": "This alternative pathway to the traditional route of studying at university for three or four years full-time has given me the chance to gain extra qualifications, four years of work experience, build contacts, and develop skills required to progress into the next stage of my career.  "
        },
        {
            "text": "I would thoroughly recommend considering an apprenticeship to anyone. You can find a local apprenticeship event and visit www.apprenticeships.gov.uk to find out more information about what it could offer you. "
        },
        {
            "text": "To find out more about STEM apprenticeships, sign up to the GSE Profession event on 5th February at 2:30-3pm here."
        }
    ]
}