{
    "url": "https://educationhub.blog.gov.uk/2024/02/02/recruit-early-years-workers-trial-bonus/",
    "title": "What we're doing to recruit more early years workers including trialling a £1k sign-on bonus",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare"
    ],
    "pub_date": "2024-02-02T10:44:53+00:00",
    "content": [
        {
            "text": "We’re taking important steps to deliver the expanded  30 hours free childcare scheme for working parents from when their child turns nine-months-old until they start school, saving them £6,500 a year. "
        },
        {
            "text": "Over 100,000 parents of two-year-olds have already registered their children on the system to benefit from the first stage of the roll out that entitles them to 15 hours free childcare from April 2024. "
        },
        {
            "text": "To prepare for the new offer, we’ve invested an extra £200million in funding to the sector in September 2023 and promised over £400million for 2024-25 to uplift hourly rates for the early year entitlements.  "
        },
        {
            "text": "We’re confident in the strength of our childcare market to deliver the expanded offer, making sure there’s a place for every child that needs it. "
        },
        {
            "text": "We’re also trialling a new recruitment offer to increase the number of staff nurseries and early years providers need to offer more childcare places to parents. New recruits will receive a £1,000 bonus when they start their first role in childcare. "
        },
        {
            "text": "You’ll also see our ‘Do Something Big’ recruitment adverts on TVs, at the cinema, hear them on the radio and just generally out and about.  "
        },
        {
            "text": "We’re making the biggest investment by a UK government into childcare in history, doubling the amount we expect to spend over the next few years from around £4 billion to around £8 billion each year.  "
        },
        {
            "text": "We explain everything you need to know.  "
        },
        {
            "heading": 3,
            "text": "Who is entitled to the £1,000 bonus?  "
        },
        {
            "text": "Our £4.9 million financial incentives pilot scheme will provide up to 3,000 new starters and returners with a £1,000 tax-free cash payment shortly after they take up a job working in early years and childcare.  "
        },
        {
            "text": "The pilot will run from April to December 2024 and this is the list of Local Authorities invited to take part:   "
        },
        {
            "text": "They have been chosen to take part in the pilot based on the greatest need for staff to deliver places in the local area.  "
        },
        {
            "text": "To be eligible, staff must be new to the profession, or returning after a break of at least 6 months, and spending at least 70 percent of their time working directly with children. "
        },
        {
            "heading": 3,
            "text": "What qualifications do I need to work in early years and how do I get a job? "
        },
        {
            "text": "You don’t need a qualification to start your career in early years and childcare but it’s something that nurseries and pre-schools often look for and there are roles where you will need one.  "
        },
        {
            "text": "Read more about early years and childcare careers, including qualifications requirements and how to find roles in your area here. "
        },
        {
            "text": "If you want to work as a childminder, you’ll need relevant first aid and childcare training.  Check what else you’ll need to become a childminder. "
        },
        {
            "heading": 3,
            "text": "How are you supporting staff to stay in a career in early years and childcare? "
        },
        {
            "text": "Those who work in early education and childcare settings have a significant impact on our youngest children – that’s what makes the job so rewarding.   "
        },
        {
            "text": "To ensure staff are able to progress in their careers, we’re continuing to invest the £180 million we set aside to provide a package of training, qualifications, expert guidance and targeted support.  "
        },
        {
            "text": "We’re also working closely with the sector to explore which policies would be most effective in increasing career opportunities including creating more routes to progress into senior early years roles.    "
        },
        {
            "text": "We have also increased how much funding early years providers receive so they are able to recruit and retain the staff the need.  "
        },
        {
            "text": "And to give providers more choice over how they operate, last year we announced a package of changes to the Early Years Foundation Stage (EYFS) framework.  "
        }
    ]
}