{
    "url": "https://naturalengland.blog.gov.uk/2024/02/02/wetland-restoration-for-people-and-planet/",
    "title": "Wetland restoration: for people and planet",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environment Act",
        "Environmental Improvement Plan",
        "Green Infrastructure",
        "Landscapes",
        "Mental health and wellbeing",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-02-02T11:11:43+00:00",
    "content": [
        {
            "text": "By Craig Ralston, Reserve Manager, Natural England"
        },
        {
            "text": "World Wetlands Day, an annual awareness day, marks the date of the adoption of the Convention on Wetlands on 2 February 1971. The adoption took place in the Iranian city of Ramsar, on the shores of the Caspian Sea. It provides a framework for the conservation and protection of wetland sites across the globe, through local and national action and international cooperation."
        },
        {
            "text": "The benefits our wetlands can bring to society and human wellbeing are the theme for 2024. It’s well-known that spending time outdoors brings a myriad of benefits to both physical and mental health, with 91% of adults who visited a green and natural space in the previous 14 days agreeing that spending time outdoors was good for their mental health. (People & Nature Survey data 2022-23). Blue environments, including ponds, lakes, rivers, and the sea, can provide people with space for recreation as well as respite from busy lifestyles, helping us to find a sense of peace and connect with nature."
        },
        {
            "text": "Our wetlands are vital for our planet, but they are disappearing at an alarming rate. Over the past 500 years, England has lost approximately 90% of its wetlands. Work is being done through many organisations and partnerships to restore, enhance, increase and connect the habitats that have been lost, helping to ensure that nature recovers – and thrives into the future."
        },
        {
            "text": "At our Lower Derwent Valley National Nature Reserve (NNR), to the south of York, we have long been supporting volunteers. This has involved engaging local communities with individual volunteering opportunities, through corporate volunteering and sponsorship, and through our pro-active ‘friends of’ groups. The Lower Derwent Valley NNR covers over 600ha of the 1000ha of floodplain meadows adjacent to Yorkshire’s River Derwent. It supports nationally and internationally important breeding, passage and wintering bird populations as well as a significant wet grassland communities. An estimated 40,000 visitors enjoy and benefit from the reserve every year."
        },
        {
            "text": "More recently, we have been extending our volunteering offer to NHS staff, hosting a number of ‘immersive days’ for their own health and wellbeing. The opportunities also aim to raise awareness of our Green Social Prescribing work being delivered within the area by our regional teams and pilot projects. These immersive days have included staff from the Humber, Tees, Wear and Esk Valley NHS trusts and have involved research teams, clinical and care staff and their executives."
        },
        {
            "text": "Following a talk and site introduction, teams get hands on with wildlife experiences such as bird ringing or the daily moth trap check. Other tasks include willow coppicing, footpath repair, boardwalk recreation, hedge planting or reedbed creation. Being involved in this way allows people to experience first-hand the wellbeing benefits of working to recover nature. All our participants have reported an improvement in mood and wellbeing, as well as a reduction in stress as a result of the volunteering work undertaken."
        },
        {
            "text": "Below are some of the responses and feedback we received from participants:"
        },
        {
            "text": "Alongside the amazing biodiversity that thrives on the site, the Lower Derwent Valley NNR’s floodplains are working to protect homes from flooding, and support water resources for the drinking water suppliers of West Yorkshire. It provides an important agricultural resource and locks away carbon in the soils. While supporting biodiversity and enhancing climate resilience, the site also provides a quiet retreat for those wishing to appreciate the natural world and find a sense of peace, as well as space for recreational activities."
        },
        {
            "text": "The area is seen as critical for growing the Nature Recovery Network and ‘extending’ the benefits of the reserve into the heart of York and the people who live there. The Nature Recovery Network (NRN) is a major commitment in the government’s Environmental Improvement Plan (EIP23). It is a growing national network of wildlife-rich places, that will expand, improve and connect these places across our cities, towns, countryside and coast. By bringing together partners, legislation and funding, we can restore and enhance the natural environment."
        },
        {
            "text": "Another example of our nature recovery work in the area, is at the Humberhead Peatlands NNR near Doncaster. The LIFE Moor Space project is focused on restoring the degraded lowland raised bog of Goole and Crowle Moors. Belonging to the Humberhead Peatlands NNR, the moors form part of the largest lowland raised bog complex in England."
        },
        {
            "text": "At the site, our local teams are installing dams and adjustable weirs to help control water, as well as clearing drains. Keeping water levels raised to ground level all-year round will encourage sphagnum moss and other desired bog plants to grow in areas where we currently have standing water and bare peat, supporting carbon storage. This is a true collaborative exercise involving multiple landowners."
        },
        {
            "text": "Our teams are working in partnership with Lincolnshire Wildlife Trust, landowners, farmers, internal drainage boards and local authorities to ensure restoration is successful and surrounding farmland is protected. Each action takes us one step closer to our nature recovery ambitions. Together, we are also investigating the viability of joining schemes like the Peatland Code, and identifying ways that farmers on the edge of the moors can manage their land to further enhance recovery."
        },
        {
            "text": "Using traditional tools alongside new ones such as drones, we are able to view the moors as never before, enabling us to target our interventions more effectively. We are also bringing the public along with us. Many of these new and novel tools have been used to ‘tell our story’, and that of the moor’s recovery, raising public understanding of the benefits of nature recovery and support for work in hand."
        },
        {
            "text": "Projects such as those at our Lower Derwent Valley and Humberhead Peatlands NNRs, show the importance of nature recovery in a place and restoring nature for the benefit of all. We are stronger together. Through partnerships we can work towards achieving the goals set out in the government’s Environmental Improvement Plan, to grow our national Nature Recovery Network. By increasing, improving and connecting green and blue wildlife-rich places close to where people live, and helping the next generation become champions for nature, we will see our wetlands and the species that dwell therein recover and thrive, for a much brighter, resilient, more nature-connected future."
        },
        {
            "heading": 5,
            "text": "Find out more about the Lower Derwent Valley NNR here and follow our Facebook page."
        },
        {
            "heading": 5,
            "text": "To learn more about the Humberhead Peatlands NNR and projects underway, see the following link. "
        }
    ]
}