{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/02/world-wetlands-day-2024-wetlands-and-wellbeing/",
    "title": "World Wetlands Day 2024: Wetlands and wellbeing",
    "authors": [
        "Jordan Timney"
    ],
    "categories": [
        "Access and engagement",
        "Nature",
        "Wetland"
    ],
    "pub_date": "2024-02-02T09:18:16+00:00",
    "content": [
        {
            "text": "My name is Jordan and I work in the Peatland Restoration team in Defra. Peatlands are a type of wetland that are critical for preventing and mitigating the effects of climate change.  "
        },
        {
            "text": "In my role, I work on the Nature for Climate Peatland Grant scheme that provides funding to help protect and restore peatlands. Since 2020, Defra has provided £35 million so far for peatland restoration projects through the scheme.   "
        },
        {
            "text": "So, what are wetlands? "
        },
        {
            "text": "Under the Ramsar International Wetlands Convention, wetlands encompass many habitats: from areas of marsh, fen, swamp and peatland to mangroves, salt marshes, mud flats, sea grass meadows and coral reefs. The Convention was established in 1971 and today 172 countries work together as signatories to protect the world’s wetlands and their resources.  "
        },
        {
            "text": "Wetlands are reservoirs of biodiversity, hosting 40% of the world's plant and animal species, including 100,000 freshwater species and 30% of all known fish species. They also protect against climate change by safeguarding coastlines, absorbing floodwater, and storing carbon. "
        },
        {
            "text": "Wetlands and human wellbeing "
        },
        {
            "text": "Wetlands are also really important for people, including for their wellbeing – which is what World Wetlands Day is highlighting today. "
        },
        {
            "text": "Each year, 2 February marks World Wetlands Day, where we highlight the importance of wetlands and celebrate the environment. This year’s theme is ‘Wetland and human wellbeing’. "
        },
        {
            "text": "As well as providing livelihoods to millions of people around the world, wetlands positively impact wellbeing by offering a way to connect with nature. Spending time in nature can lead to increased mindfulness and emotional balance.  "
        },
        {
            "text": "Wetlands are also the location of many recreational activities, both solo and group, making them a place where people can connect with one another as well as nature. "
        },
        {
            "text": "Local wetland projects "
        },
        {
            "text": "One of the restoration projects that is funded through the Nature for Climate Peatland Grant Scheme is Greylake in Somerset. This site is a total of 110 hectares, the restoration of 35 of these hectares has been funded through the Nature for Climate Fund.  "
        },
        {
            "text": "The restoration work is to return the land to fen which will protect the remaining deep peat. The restoration work has resulted in the site having high-quality water bodies, which supports a diverse range of flora and fauna communities.  "
        },
        {
            "text": "Defra’s aim is to restore a total of 35,000 hectares of peatland through the Nature for Climate Fund by 2025, and local projects like Greylake are crucial to hitting this target. "
        },
        {
            "text": "Our restoration work means the site now has high-quality water bodies, supporting diverse flora and fauna communities. "
        },
        {
            "text": "This project is just one of the ones Defra is supporting, to help this crucial habitat. "
        },
        {
            "text": "So, get outside and give your wellbeing a boost by enjoying all your local wetlands have to offer! "
        },
        {
            "text": "We’ll be publishing more updates like this, as well as in-depth looks at particular funds and policies, on this blog. Please subscribe to receive an email notification when we publish a new post. "
        }
    ]
}