{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/02/10/from-care-to-career-my-apprenticeship-journey/",
    "title": "From Care to Career: My Apprenticeship Journey",
    "authors": [
        "Jess McGovern-Guess"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2025-02-10T09:28:39+00:00",
    "content": [
        {
            "heading": 2,
            "text": "National Apprenticeship Week 2025"
        },
        {
            "text": "This week is National Apprenticeship Week, celebrating how apprenticeships are a great way to build experience and gain a qualification. As part of Portsmouth City Council's Employability Academy, care-experienced young people are supported into meaningful employment to develop a career."
        },
        {
            "text": "Children's social care wanted to recruit someone with lived experience to be an advocate and provide feedback on the best way to support young people."
        },
        {
            "text": "With the support of foster carers, social workers, and the virtual school service, Jess McGovern-Guess applied for a customer service apprenticeship and was successful. Jess talks about gaining new skills, surprising moments, and her aspirations for the future."
        },
        {
            "heading": 2,
            "text": "My path to an apprenticeship"
        },
        {
            "text": "I have recently found myself reflecting on my journey before starting my apprenticeship. It all began when I was put into care in year 6."
        },
        {
            "text": "From year 7 onwards, my life was a whirlwind of change. I moved around a lot, even leaving Portsmouth at one point. This constant moving made it hard to settle in school and build friendships."
        },
        {
            "text": "By the time I reached year 10/11, I finally stayed in one school, but it just wasn't for me."
        },
        {
            "heading": 2,
            "text": "Growing through work-based learning"
        },
        {
            "text": "At 17, I worked with my social worker and the virtual school team at Portsmouth City Council."
        },
        {
            "text": "An opportunity for an apprenticeship in customer service came up. I was so excited. Although I wasn't successful at first, the opportunity came up again."
        },
        {
            "text": "In my role, I am developing different skills to support customers. I've become much more confident in how I present myself, both with colleagues and the public. I've also learned important communication skills that are essential in a professional environment. These real-world skills have come directly from my apprenticeship."
        },
        {
            "text": "Choosing an apprenticeship over college was a big decision. The apprenticeship was the best option for me because I could learn and earn at the same time."
        },
        {
            "text": "I've had to be independent my whole life, and the apprenticeship suited that. It allowed me to work independently but also have the support of a team. This experience has made me more confident in dealing with the public, something I might not have gained elsewhere."
        },
        {
            "text": "Alongside completing my apprenticeship, I am looking to undertake my maths and English functional skills. The flexibility to complete these qualifications has also been a pleasant surprise."
        },
        {
            "text": "I don't feel pressured, as I can concentrate on my apprenticeship right now. I hope to complete both qualifications by the end of this year."
        },
        {
            "heading": 2,
            "text": "Advice and future goals"
        },
        {
            "text": "For other care-experienced young people thinking about starting an apprenticeship, my advice is simple: don't be afraid to ask for help."
        },
        {
            "text": "Build a support network around yourself. Once you secure your placement, get involved with your colleagues because relationships are important."
        },
        {
            "text": "Be patient. I wasn't successful the first time I applied, but I didn't give up. Remember, apprenticeships are about learning, so don't get frustrated."
        },
        {
            "text": "Looking to the future, I hope to pass my apprenticeship and get my qualifications. I want to be the first person in my family to have a career."
        },
        {
            "text": "I'd like to undertake a higher-level apprenticeship to gain more qualifications and experience. I'm not entirely sure what the end point is right now, but I enjoy working at Portsmouth City Council and hope to continue here after my apprenticeship ends."
        },
        {
            "heading": 2,
            "text": "Further reading"
        }
    ]
}