{
    "url": "https://mhclgdigital.blog.gov.uk/2025/02/10/national-apprenticeship-week-2025-my-story-as-a-cyber-security-apprentice-in-mhclg/",
    "title": "National Apprenticeship Week 2025: my story as a cyber security apprentice in MHCLG ",
    "authors": [
        "Billy Barnett, Cyber Security Apprentice"
    ],
    "categories": [
        "Apprenticeships",
        "Careers",
        "Cyber"
    ],
    "pub_date": "2025-02-10T12:04:06+00:00",
    "content": [
        {
            "text": "The Civil Service offers an attractive range of apprenticeship schemes providing the opportunity to work in departments across government, gaining a qualification on completion and build a fulfilling career. "
        },
        {
            "text": "To mark this year’s National Apprenticeship Week, Billy, a cyber security apprentice in The Ministry of Housing, Communities and Local Government (MHCLG), shares his experience of building his career within MHCLG Digital as part of his apprenticeship. "
        },
        {
            "heading": 2,
            "text": "How I found my career in cyber security "
        },
        {
            "text": "After finishing school at 18, I immediately entered the working world with no direction. For 2 years I worked in administrative positions, feeling as though my work wasn’t making a real difference.  "
        },
        {
            "text": "Through building my digital skills in my personal time, I landed a role as a junior software developer at an insurance company, aiding customers with data breaches and concerns. This role revealed to me the critical need for digital security and showcased the profound impact that technology can have when used to achieve positive outcomes. The work allowed me to use digital skills to solve complex problems, work under pressure and make a difference to people’s lives. "
        },
        {
            "text": "The fulfilment I found through this work led me to applying to the cyber security role I’m in today in MHCLG.  "
        },
        {
            "text": "I am currently pursuing a Level 6 Cyber Security Technical Professional (Integrated Degree), which is a 4-year programme.  "
        },
        {
            "heading": 2,
            "text": "Bolstering our security and countering cyber threats "
        },
        {
            "text": "I currently work in MHCLG’s Cyber Security team, specifically the Security Operations Centre (SOC). My responsibilities include responding to cyber security alerts, dealing with cyber quires throughout the organisation and building comprehensive policies and plans relating to emerging cyber threats. "
        },
        {
            "text": "In cyber, we concentrate on preparation over reaction. We aim to create an environment that continuously adapts to emerging cyber threats and remains prepared for any potential attacks. Our role in cyber is to build the foundations of this environment through continuous monitoring, threat intelligence, incident management, threat detection and proactive defence. "
        },
        {
            "text": "Many of the roles within our Cyber Security team can be found on the Government Security Profession Career Framework. The framework outlines the objectives of various cyber roles and explains how they enhance MHCLG’s security posture. "
        },
        {
            "heading": 2,
            "text": "Being a cyber apprentice in MHCLG Digital "
        },
        {
            "text": "From the beginning, I felt like ‘one of the team’. No question is too simple, and everyone is more than happy to take time out of their day to help me grow, learn and mature in the cyber field.  "
        },
        {
            "text": "Although I am an apprentice, the work, opportunities and goals are just as challenging and exciting as those of any full-time staff member. I am treated as a valued team member, with plenty of chances to contribute. In a short span of time, my work has created a lasting positive impact on MHCLG’s security posture, which will be evident for years to come.  "
        },
        {
            "text": "The cyber security industry is incredibly collaborative, and I’ve had the privilege of attending outstanding seminars and conferences in London, Birmingham and York as part of my work. Many of these events were hosted by industry leaders like Microsoft, the National Cyber Security Centre and the Ministry of Defence. "
        },
        {
            "text": "Through this collaboration, my team has been able to begin to implement exciting new threat detection and preparation techniques, allowing our work to continually evolve and improve. "
        },
        {
            "text": "I feel incredibly proud to be a part of this team. "
        },
        {
            "heading": 2,
            "text": "A cyber apprenticeship: my tips for applying "
        },
        {
            "text": "I discovered the role of Cyber Security Apprentice on the Civil Service Careers website, where you can find all the details of the application process.  "
        },
        {
            "text": "When applying, don’t fall into the trap of thinking: 'I have no prior experience, I’m not applying'. Professional skills like negotiating, persuading, influencing and teamwork are often just as powerful as technical skills. Try to showcase your abilities outside of cyber as well as any technical skills you may have. "
        },
        {
            "text": "To complete an apprenticeship in cyber, you need to have a passion for the field. The beauty of cyber is that many ideas, concepts and studies surrounding the topic are freely available online. Try to demonstrate your passion for cyber by completing a free course or simply read up on the new and emerging cyber risks and technologies. Not only will this evidence help in your application, it will also confirm for you if cyber is really the sector you wish to pursue.   "
        }
    ]
}