{
    "url": "https://cspl.blog.gov.uk/2025/02/10/peer-pressure-the-work-of-the-house-of-lords-appointments-commission-holac/",
    "title": "Peer pressure – the work of the House of Lords Appointments Commission (HOLAC)",
    "authors": [
        "Baroness Ruth Deech"
    ],
    "categories": [
        "30th Anniversary",
        "House of Lords appointments",
        "Nolan Principles"
    ],
    "pub_date": "2025-02-10T10:00:00+00:00",
    "content": [
        {
            "text": "To mark the 30th anniversary of the Nolan Principles, the Committee will be publishing a new series of blogs about the work of a range of standards bodies in England. Our first blog is from Baroness (Ruth) Deech who chairs the independent House of Lords Appointments Commission. "
        },
        {
            "text": "House of Lords Appointments Commission (HOLAC)"
        },
        {
            "text": "Members of the House of Lords, like all others in public office, are required to live up to the Nolan Principles. As an appointments and vetting body – and one of the patchwork of ethics regulators in Westminster - HOLAC has a part to play in ensuring those being nominated to the House understand the role and expectations of becoming a peer. "
        },
        {
            "text": "The independent House of Lords Appointments Commission (HOLAC) was first established in May 2000, and described as ‘an interim measure pending further reform of the House of Lords’.  25 years later, its role and remit remain part of the wider discussion on Lords reform taking place as the Hereditary Peers Bill passes through Parliament."
        },
        {
            "text": "The Commission is non-statutory and has a majority independent membership, with representation from the three main parties.  Unlike some of the other regulators, HOLAC did not originate from a Committee on Standards in Public Life recommendation; it was established by the Blair government as a new body to take on the role of appointing crossbench peers, previously carried out by Downing Street. It was then given the additional role (previously done by the Political Honours Scrutiny Committee in the Cabinet Office) of vetting political nominees to the House for propriety."
        },
        {
            "text": "Recommending new non-party-political peers"
        },
        {
            "text": "The Commission and our very small team of officials run an open, merit-based process for the appointment of non-party-political peers. We look for people with experience and expertise to bring to the process of scrutinising legislation in the House.  Over 5,500 people have applied - via an application form on our website – and there have been a      total of 76 peers appointed in this way in the last 25 years.  In recent years we have been asked to appoint only 2 non-party-political peers each year, so competition is intense - and we find ourselves having to disappoint some very talented people."
        },
        {
            "text": "While the number and timing of these appointments remain a matter for the Prime Minister, the choice of whom to recommend is made by the Commission alone. Most recently, in May 2024, HOLAC recommended Baroness Freeman, an expert in science communication and Lord Tarassenko, an engineer and academic, who is an expert in signal processing machine learning in healthcare."
        },
        {
            "text": "I was appointed to the House in this way in 2005 myself, after applying to HOLAC, so I was particularly delighted to be appointed as its Chair in 2023, following an open competition.  It is a huge privilege to be part of this process, and the Commission is proud of the contribution that its appointees have made to the work of the House over the years."
        },
        {
            "text": "Vetting for propriety"
        },
        {
            "text": "Our second role is vetting individuals who are nominated by the political parties for propriety. Unlike non-party-political appointments, we are not asked to assess the suitability or merit of those being put forward – that is for the political party. The Commission’s role is to carry out a range of checks with regulators, government departments and agencies and make an overall assessment of whether the nominee meets its published criteria:"
        },
        {
            "text": "‘an individual should be in good standing in the community in general and with the public regulatory authorities in particular; and that the past conduct of the nominee would not reasonably be regarded as bringing the House of Lords into disrepute.’"
        },
        {
            "text": "HOLAC’s advice – either to support the nomination or drawing concerns to the Prime Minister’s attention – is given in confidence, with the final decision left to the Prime Minister.  In its 25 years, HOLAC’s advice has been accepted on all but one occasion in 2020 when the then Chair wrote to Parliament and put this information into the public domain to ensure transparency and accountability."
        },
        {
            "text": "HOLAC’s remit and powers have been much discussed over the years, with some suggesting the Commission should be charged with looking at suitability for party nominations too. As the current Chair, I have made clear I would personally welcome this, although there are different views round the table."
        },
        {
            "text": "In the meantime, to help drive high standards and greater public confidence in appointments to the House, the Commission has revised the information required from the political parties in advance of vetting, to include confirmation that the party has carried out its own due diligence on people they are proposing and that the nominee understands the role and requirements of the membership of the House of Lords. And most recently, we were pleased that the government and parties agreed to publish a short citation setting out why someone is being nominated; this is something that the Committee on Standards in Public Life and HOLAC previously called for."
        },
        {
            "text": "Like many, I believe the House needs to urgently address its numbers problem while ensuring it has the right balance of skills, expertise and represents the whole United Kingdom."
        },
        {
            "text": "The Commission is proud of the quality and contribution of its non-party political nominees over the last 25 years. Whatever reform lies ahead, it is widely agreed that they bring deep expertise and experience, and their proportion of the membership needs to be maintained."
        },
        {
            "text": "The House of Lords does such important work within our democracy - making laws, investigating public policy and holding the government to account - but the burgeoning size of the House impacts on both its functioning and wider reputation."
        },
        {
            "text": " The Nolan Principles are an important framework for all of us in public life; they remind us that we are here to serve in the public interest."
        },
        {
            "text": "I congratulate the Committee on Standards in Public Life on its 30th anniversary – its work in promoting the principles and keeping standards in the spotlight is so important."
        }
    ]
}