{
    "url": "https://defencedigital.blog.gov.uk/2025/02/10/secure-by-design-user-centred-guidance-now-on-digital-mod-uk/",
    "title": "Secure by Design: User-Centred Guidance Now on Digital MOD.UK",
    "authors": [
        "J.Leach"
    ],
    "categories": [
        "Cyber",
        "Secure By Design"
    ],
    "pub_date": "2025-02-10T12:52:17+00:00",
    "content": [
        {
            "text": "Jonathan Leach, Deputy Head Cyber Security Assessment and Advisory Services (part of the Cyber Defence and Risk Directorate), tells us about the new Secure by Design (SbD) Guidance."
        },
        {
            "text": "For the past three years, Secure by Design has been the main focus of my work, looking to improve cyber security in defence by changing the culture to ensure that security is considered from the start of any capability. The aim of SbD is to reduce the cyber risks across MOD as well as promoting a ‘one team’ approach to cyber-security. This enables and empowers everyone to deliver and maintain capabilities that are resilient from cyber-attacks. To achieve this, we have introduced new policies, a new tool and guidance on how to apply the new approach."
        },
        {
            "text": "While SbD was mandated in MOD policy, the policy didn’t completely answer the users’ questions when they were looking to actively implement SbD for themselves. As a result, we recently wrote new user-centred guidance for SbD on Digital MOD.UK. This is now the go-to place for all Secure by Design guidance material, and replaces the previous guidance hosted on Defence Gateway."
        },
        {
            "text": "Why the change?"
        },
        {
            "text": "While the Defence Gateway guidance was comprehensive, it became increasingly technical and inaccessible to those who could not access Defence Gateway. The move to the Digital MOD.UK platform allows us to:"
        },
        {
            "text": " What’s next?"
        },
        {
            "text": "As we deliver Secure by Design, we understand that users may need additional support beyond the guidance. Other areas of support we will provide include:"
        }
    ]
}