{
    "url": "https://companieshouse.blog.gov.uk/2025/02/10/taking-a-responsible-approach-to-company-names/",
    "title": "Taking a responsible approach to company names",
    "authors": [
        "Justin Toland - Media & PR Lead"
    ],
    "categories": [
        "Changes to UK company law",
        "Starting a company"
    ],
    "pub_date": "2025-02-10T09:00:00+00:00",
    "content": [
        {
            "text": "Anyone setting up a company must choose an appropriate company name. In 2024, Companies House rejected 560 applications because the proposed name had the potential to offend or if registered, could commit an offence. This is an increase from 479 company names we rejected in 2023 and 351 rejected names in 2022."
        },
        {
            "heading": 2,
            "text": "Reasons we might reject a company name"
        },
        {
            "text": "Using a sensitive word or expression is just one reason why Companies House may reject a company name at incorporation. Other reasons include:"
        },
        {
            "text": "The list of restrictions has expanded under our new and enhanced powers to reject an application to register a name. These new measures were introduced in March 2024 under the Economic Crime and Corporate Transparency Act. They include restrictions on:"
        },
        {
            "heading": 2,
            "text": "Does it have the potential to offend?"
        },
        {
            "text": "Companies House has a statutory responsibility to make sure that the names we register do not have the potential to cause offence or commit an offence. We are an open register and anyone can view our data, so we take this responsibility seriously."
        },
        {
            "text": "All applications are carefully considered but we will not register a name which is considered offensive."
        },
        {
            "text": "Since 4 March 2024, we have introduced stronger checks on company names. We can also direct an existing company to change its name if it was wrongly registered, for example, where an offensive name gets on the register."
        },
        {
            "heading": 2,
            "text": "Are we being reasonable?"
        },
        {
            "text": "Companies House applies a long-established policy when reviewing the potential of company names to offend: would a reasonable person take offence?"
        },
        {
            "text": "Proposed company names containing a sensitive word or expression are automatically stopped. We then review to consider if the company names rules have been met."
        },
        {
            "text": "Our team of examiners take various factors into account including the evolution of society’s views about certain words and expressions. One of the key factors is context. National and global events such as a natural disaster, war or the death of a public figure may mean that a name that wasn’t previously offensive, is now considered offensive."
        },
        {
            "text": "As society changes and language evolves, we may now also accept names that we would have refused in the past."
        }
    ]
}