{
    "url": "https://hmlandregistry.blog.gov.uk/2025/05/15/finding-requisitions-on-the-portal-has-just-got-easier/",
    "title": "Finding requisitions on the portal has just got easier",
    "authors": [
        "Reid Spain, Product Manager - Portal and Digital Mortgage"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2025-05-15T08:59:53+01:00",
    "content": [
        {
            "text": "Two new enhancements have been added to the portal, designed to save customers’ time and provide greater clarity on the progress of their applications. It is now easier to find outstanding requisitions and the Estimated Completion Date (ECD) has been refined for certain types of application."
        },
        {
            "text": "These have been made in direct response to users’ needs and build on previous refinements to the ECD."
        },
        {
            "heading": 2,
            "text": "Find outstanding requisitions"
        },
        {
            "text": "Portal users are now able to see the number of applications which have unresolved requisitions against them, as soon as they sign in to the portal. A panel will be displayed at the top of the homepage, with a link to a pre-filtered View Applications page, which will just display the applications requiring action."
        },
        {
            "text": "Customers will be provided with an up-to-date number as the figure refreshes each time View Applications is accessed (or overnight, whichever is sooner).  "
        },
        {
            "text": "If no panel is displayed at sign-in, this means there are no applications with unresolved requisitions recorded against the user ID you have signed in with."
        },
        {
            "heading": 2,
            "text": "A more accurate Estimated Completion Date"
        },
        {
            "text": "Later this spring we will introduce an enhancement to the ECD to provide a more accurate reflection of certain types of application – namely the more complex updates to existing register titles. This will result in fewer applications showing as ‘exceeded’ and reduce the need for customers to call for progress updates."
        },
        {
            "text": "An ECD is HM Land Registry’s current projection of when 90% of cases of that type are completed. They are provided to customers to give an estimate of when their applications are likely to have been completed by."
        },
        {
            "text": "Separate ECDs will be calculated for both complex and standard executive register update applications.  The ECDs for all existing applications will also be updated."
        },
        {
            "text": "As always, customers can stay up to date with the work to enhance the portal, the Digital Registration Service and Business Gateway by checking the digital services roadmap which lists recent changes, projects being actively worked on, and ideas being explored for the future."
        }
    ]
}