{
    "url": "https://insidedvla.blog.gov.uk/2025/05/15/from-placement-to-professional-my-dvla-software-engineering-journey/",
    "title": "From placement to professional: my DVLA software engineering journey",
    "authors": [
        "Iestyn Green"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2025-05-15T11:00:49+01:00",
    "content": [
        {
            "text": "DVLA has several Centre of Digital Excellence (CoDE) programmes to support career development in the digital profession."
        },
        {
            "text": "If you’re looking to start a digital career, or simply improve your digital skills, DVLA is a great place to work. I started at DVLA as a Year in Industry student before joining the master’s degree programme and becoming a Junior Software Engineer."
        },
        {
            "text": "This is my journey."
        },
        {
            "heading": 2,
            "text": "Becoming a CoDE student at DVLA"
        },
        {
            "text": "I applied for DVLA’s Year in Industry scheme as I saw it as a great opportunity to improve my programming skills and gain valuable industry experience in a supportive environment."
        },
        {
            "text": "During the placement, I worked as a Software Development Engineer in Test (SDET), which gave me a great insight into the world of testing. This hands-on experience also gave me a significant advantage when I returned to university, as I was already familiar with concepts that were being introduced in my studies."
        },
        {
            "text": "My main responsibility was writing functional tests, which involved learning and working with languages and frameworks such as Ruby, Cucumber, and Gherkin. I also really enjoyed working in an Agile environment by participating in biweekly sprints, daily stand ups, sprint reviews and retrospectives."
        },
        {
            "text": "Additionally, I had the opportunity to attend careers events to help promote the Year in Industry scheme, which allowed me to develop my communication and networking skills."
        },
        {
            "text": "I received plenty of support throughout my placement. The SDET community is very close-knit, and they’re always there to offer guidance when needed. My squad were incredibly welcoming and patient, allowing me to develop my skills at my own pace, which made my experience enjoyable as a new starter."
        },
        {
            "heading": 2,
            "text": "Returning on the Software Engineering MSc programme"
        },
        {
            "text": "After my Year in Industry, I was eager to return to DVLA. I really enjoyed the work environment – both the pace of work and the people were great! I had a consistent workload to keep me engaged without the pressure of stressful deadlines, which made for a balanced and enjoyable experience."
        },
        {
            "text": "I applied for the MSc programme, which I’m still working on. It’s given me the opportunity to continue progressing my career at DVLA, while allowing me to earn a master’s qualification. It almost felt too good to be true! As part of the programme, we have a university day every Friday, which allows us time to focus on our studies without it interfering with our work at DVLA."
        },
        {
            "text": "During my Year in Industry placement, I primarily focused on testing, but now I'm working as a developer. This shift has allowed me to expand my knowledge of software engineering from a developer's perspective, learning new languages and frameworks along the way."
        },
        {
            "text": "The MSc programme has been really helpful for my development. Not only has it helped me improve my practical coding skills but, through my university studies, it’s also allowed me to dive into the theory behind it. This mix of hands-on experience and deeper knowledge means I can take what I’m learning and apply it to different roles in software engineering, carrying that knowledge with me wherever I go."
        },
        {
            "heading": 2,
            "text": "Working at DVLA"
        },
        {
            "text": "It’s a lot of fun! I’ve really enjoyed getting to know everyone and the squads have been very supportive. They’re always happy to offer their time and provide feedback on my work, which has really helped me grow as a developer. There are a few former master’s degree students in my squad, who I've become good friends with, and they've been especially understanding whenever I’ve needed advice."
        },
        {
            "text": "With the way technology is evolving, it's an exciting time to be part of DVLA, and I can’t wait to see what’s next! Once I complete the MSc programme, I hope to have the opportunity to continue my career here as a software engineer. And who knows, maybe one day I’ll work my way up to Senior Software Engineer!"
        },
        {
            "text": "There are so many things that make DVLA a great place to work. The people, career opportunities, technology, and support all contribute to a great experience. If you’d like to pursue a career in digital with us, find out more about DVLA digital professions and development programmes and visit Civil Service Jobs for all the latest career opportunities."
        }
    ]
}