{
    "url": "https://food.blog.gov.uk/2025/05/15/helping-to-create-an-environment-where-businesses-can-thrive-with-nfcus-new-powers/",
    "title": "Helping to create an environment where businesses can thrive with NFCU’s new powers",
    "authors": [
        "Andrew Quinn, Head of the National Food Crime Unit"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-05-15T15:26:19+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "New powers for the National Food Crime Unit (NFCU) mark a significant milestone in the team’s tenth year and coincide with the 25th anniversary of the FSA. Consumer confidence in the safety and authenticity of food remains high, which helps create a strong foundation for British businesses to thrive."
        },
        {
            "text": "The NFCU was established in May 2015 following the Elliott Review of the 2013 horse meat incident. At that time, we set ourselves clear strategic objectives which were to: prevent food being rendered unsafe or inauthentic through dishonesty, to disrupt offending and bring offenders to justice and build global and domestic counter food crime capability."
        },
        {
            "heading": 2,
            "text": "The past decade"
        },
        {
            "text": "Over the past few years, we’ve seen further threats to safety and authenticity, as well as the disruption of global supply chains, such as the pandemic and war in Ukraine."
        },
        {
            "text": "Despite these challenges, we can be confident that food in the UK remains safe and is what it says it is, and that consumer confidence in the safety and authenticity of food is high. But this doesn’t happen by itself. It’s the result of tens of thousands of businesses working hard to step up and meet their responsibilities, along with the collective efforts of everyone involved in the complex food chains."
        },
        {
            "text": "Beginning as a team of three, and now with over eighty officers, the NFCU has made significant strides. Our team has carried out significant work in disrupting food crime including:"
        },
        {
            "heading": 2,
            "text": "We need to be able to do more"
        },
        {
            "text": "Recent operational activity has highlighted that not having access to certain powers can create a significant disadvantage to the ability of NFCU officers to act swiftly, be lawfully on premises and assist with searches following an arrest."
        },
        {
            "text": "Therefore, we have worked to enhance our investigative capabilities by gaining powers under the Police and Criminal Evidence Act (PACE) and Criminal Justice and Public Order Act, (CJPOA)."
        },
        {
            "text": "These new powers came into force on the 1st of May. They enable our NFCU investigators to apply for and execute search warrants, respond quickly to intelligence and ensure that swift action is taken to tackle food fraud. Crucially, they enable us to more effectively protect consumers and legitimate businesses."
        },
        {
            "heading": 2,
            "text": "Together, we are more powerful"
        },
        {
            "text": "Across the food chain, organisations and individuals work hard to protect the integrity of British food. There are many layers to the prevention of food crime in England and Wales. Businesses are the first line of defence with a legal responsibility to sell food that is safe, supported by Local Authorities (LAs) and the FSA."
        },
        {
            "text": "So far, we’ve helped over five hundred businesses increase their resilience to fraud, and that number grows daily as we link in with industry. Our, guidance such as our Food Fraud Self-assessment Resilience tool and our work with LAs play a key role in ensuring this legal responsibility is met."
        },
        {
            "text": "The powers will give industry, partners and consumers increased confidence that we can carry out actions, in real time, to aid the prevention and prosecution of food crime locally and nationally."
        },
        {
            "text": "The new powers are vital for the NFCU to be able to build on our objectives of preventing food fraud, tackling dishonesty, bringing offenders to justice and to build our counter-crime capabilities. They are a much-needed addition to the 'toolbox' that enables the NFCU to function with increased effectiveness and autonomy."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We’ll be able to more independently achieve our mandate to lead criminal investigations into complex food crimes, for prosecution by the CPS.We’ll still be working closely with partners like Police and LAs, and our new powers will free up their vital resources so they can be diverted to other priorities."
        },
        {
            "text": "As always, my officers will tackle food fraud, seek to prosecute those that in food supply chains who act dishonestly for their own benefit, supporting industry to continue do the right thing and helping to uphold consumer trust in Britain’s food. Confronting food fraud helps create an environment where legitimate businesses can grow and consumers are protected."
        },
        {
            "text": "A shorter version of this blog appeared in The Grocer and Food Manufacture."
        },
        {
            "heading": 1,
            "text": "Helpu i greu amgylchedd lle gall busnesau ffynnu gyda phwerau newydd yr Uned Genedlaethol Troseddau Bwyd"
        },
        {
            "text": "Mae pwerau newydd i’r Uned Genedlaethol Troseddau Bwyd (NFCU) yn nodi carreg filltir sylweddol yn negfed flwyddyn y tîm, ac maent yn cyd-daro â phen-blwydd yr Asiantaeth Safonau Bwyd (ASB) yn 25 oed. Mae hyder defnyddwyr yn niogelwch a dilysrwydd bwyd yn dal yn uchel, ac mae hynny’n helpu i greu sylfaen gref i fusnesau Prydain ffynnu.    "
        },
        {
            "text": "Sefydlwyd yr NFCU ym mis Mai 2015, yn dilyn Adolygiad Elliott o’r digwyddiad cig ceffyl yn 2013. Bryd hynny, gwnaethom osod amcanion strategol clir i ni ein hunain, sef: atal bwyd rhag cael ei wneud yn anniogel neu’n annilys oherwydd anonestrwydd; amharu ar droseddu a dwyn troseddwyr gerbron y llys; a meithrin y gallu gwrth-droseddau bwyd byd-eang a domestig. "
        },
        {
            "heading": 2,
            "text": "Y degawd diwethaf "
        },
        {
            "text": "Dros yr ychydig flynyddoedd diwethaf, rydym wedi gweld bygythiadau pellach i ddiogelwch a dilysrwydd, yn ogystal â tharfu ar gadwyni cyflenwi byd-eang, fel y pandemig a’r rhyfel yn Wcráin."
        },
        {
            "text": "Er gwaethaf yr heriau hyn, gallwn fod yn hyderus bod bwyd yn y DU yn parhau i fod yn ddiogel a’i fod yn cyd-fynd â’r hyn sydd ar y label, a bod hyder defnyddwyr yn niogelwch a dilysrwydd bwyd yn uchel. Ond nid yw hyn yn digwydd ar ei ben ei hun. Mae’n ganlyniad degau o filoedd o fusnesau yn gweithio’n galed i gamu ymlaen a chyflawni eu cyfrifoldebau, ynghyd ag ymdrechion ar y cyd pawb sy’n ymwneud â’r cadwyni bwyd cymhleth. "
        },
        {
            "text": "Gyda dros wyth deg o swyddogion erbyn hyn, a ninnau wedi dechrau gyda thîm o dri, mae’r NFCU wedi gwneud camau breision.  Mae ein tîm wedi gwneud gwaith sylweddol o ran tarfu ar droseddau bwyd, gan gynnwys: "
        },
        {
            "heading": 2,
            "text": "Mae angen i ni allu gwneud mwy     "
        },
        {
            "text": "Mae gweithgarwch gweithredol diweddar wedi tynnu sylw at y ffaith y gall peidio â chael mynediad at rai pwerau greu anfantais sylweddol o ran gallu swyddogion yr NFCU i weithredu’n gyflym, cael mynediad i safleoedd a chynorthwyo gyda chwiliadau yn dilyn arestio, a hynny’n gyfreithlon.   "
        },
        {
            "text": "Felly, rydym wedi gweithio i wella ein galluoedd ymchwilio drwy gael pwerau o dan Ddeddf yr Heddlu a Thystiolaeth Droseddol (PACE) a Deddf Cyfiawnder Troseddol a Threfn Gyhoeddus (CJPOA).  "
        },
        {
            "text": "Daeth y pwerau newydd hyn i rym ar 1 Mai. Maent yn galluogi ymchwilwyr yr NFCU i wneud cais am warantau chwilio a’u gweithredu, ymateb yn gyflym i wybodaeth, a sicrhau bod camau gweithredu cyflym yn cael eu cymryd i fynd i’r afael â thwyll bwyd. Yn hollbwysig, maent yn ein galluogi i ddiogelu defnyddwyr a busnesau cyfreithlon yn fwy effeithiol.  "
        },
        {
            "heading": 2,
            "text": "Gyda’n gilydd, yn gryfach"
        },
        {
            "text": "Drwy gydol y gadwyn fwyd, mae llawer o sefydliadau ac unigolion yn gweithio’n galed i ddiogelu uniondeb bwyd Prydain. Mae sawl haen i atal troseddau bwyd yng Nghymru a Lloegr. Busnesau yw’r amddiffyniad cyntaf. Mae ganddyn nhw gyfrifoldeb cyfreithiol i werthu bwyd sy’n ddiogel, gyda chefnogaeth awdurdodau lleol a’r ASB. "
        },
        {
            "text": "Hyd yn hyn, rydym wedi helpu dros bum cant o fusnesau i gynyddu eu gwydnwch yn erbyn twyll, ac mae’r nifer hwnnw’n tyfu bob dydd wrth i ni gysylltu â’r diwydiant. Mae ein canllawiau, fel ein hadnodd Hunanasesu Gwydnwch yn erbyn Twyll Bwyd, a’n gwaith gydag awdurdodau lleol yn chwarae rhan allweddol wrth sicrhau bod y cyfrifoldeb cyfreithiol hwn yn cael ei gyflawni.  "
        },
        {
            "text": "Bydd y pwerau’n rhoi mwy o hyder i’r diwydiant, partneriaid a defnyddwyr y gallwn gymryd camau gweithredu, mewn amser real, i gynorthwyo’r gwaith o atal ac erlyn troseddau bwyd, a hynny’n lleol ac yn genedlaethol. "
        },
        {
            "text": "Mae’r pwerau newydd yn hanfodol er mwyn i’r NFCU allu adeiladu ar ein hamcanion o atal twyll bwyd; mynd i’r afael ag anonestrwydd; dwyn troseddwyr gerbron y llys a meithrin ein galluoedd i atal troseddu. Maent yn ychwanegiad sydd ei angen yn fawr at y ‘blwch offer’ sy’n galluogi’r NFCU i weithredu gyda mwy o effeithiolrwydd ac ymreolaeth."
        },
        {
            "heading": 2,
            "text": "Beth fydd yn digwydd nesaf? "
        },
        {
            "text": "Bydd modd i ni gyflawni ein mandad i arwain ymchwiliadau troseddol i droseddau bwyd cymhleth yn fwy annibynnol, er mwyn iddynt gael eu herlyn gan Wasanaeth Erlyn y Goron. Byddwn yn dal i weithio’n agos gyda phartneriaid fel yr heddlu ac awdurdodau lleol, a bydd ein pwerau newydd yn rhyddhau eu hadnoddau hanfodol er mwyn iddynt allu cael eu cyfeirio at flaenoriaethau eraill. "
        },
        {
            "text": "Fel bob amser, bydd fy swyddogion yn mynd i’r afael â thwyll bwyd, yn ceisio erlyn y rhai mewn cadwyni cyflenwi bwyd sy’n gweithredu’n anonest er eu budd eu hunain, gan gefnogi’r diwydiant i barhau i wneud y peth iawn a helpu i gynnal ymddiriedaeth defnyddwyr ym mwyd Prydain. Mae mynd i’r afael â thwyll bwyd yn helpu i greu amgylchedd lle gall busnesau cyfreithlon dyfu, a lle mae defnyddwyr yn cael eu diogelu. "
        }
    ]
}