{
    "url": "https://marinescience.blog.gov.uk/2025/05/15/marbled-crayfish-a-serious-non-native-threat-with-potential-risk-of-introduction-through-the-pet-trade/",
    "title": "Marbled Crayfish: a serious non-native threat, with potential risk of introduction through the pet trade. ",
    "authors": [
        "Nick Stinton"
    ],
    "categories": [
        "Animal Health",
        "biodiversity",
        "Invasive species"
    ],
    "pub_date": "2025-05-15T09:04:04+01:00",
    "content": [
        {
            "text": "Invasive non-native species, both plants and animals, threaten our native wildlife, natural ecosystems, economy, health, and interfere with activities we enjoy. "
        },
        {
            "text": "Invasive Species Week is led by the GB Non Native Species Secretariat and is an annual event to raise awareness of invasive non-native species and how everyone can help prevent their spread. "
        },
        {
            "text": "As part of Cefas’ Invasive Species Week highlights, today’s blog shares the threats marbled crayfish pose to our ecosystems and economy. "
        },
        {
            "text": "Thought to be possibly of North American origin (and a carrier of the disease, crayfish plague), marbled crayfish first appeared in the aquarium trade in Germany and Austria in the mid-1990s.  The marbled crayfish (Procambarus sp.) is the first recorded crayfish capable of asexual reproduction (parthenogenesis). This means that only one animal is required to establish a breeding population. An adult can produce up to 270 eggs every 8–9 weeks with sexual maturity being reached 25–35 weeks after hatching, under optimum conditions. This species has historically been released or has escaped into natural waters in neighbouring European countries, such as Germany and Holland, though its impact in these areas has yet to be assessed. "
        },
        {
            "text": "In addition to concerns that the species can carry crayfish plague, which is deadly to the white-clawed crayfish, native to the UK, there are also significant concerns around their impact on native ecosystems.  For the marbled crayfish to maintain its prolific reproductive capabilities it uses vast amounts of energy, so they have huge appetites, consuming a broad range of aquatic plants and invertebrates, and scavenging on other food sources. This poses the risk that they may have a devastating direct impact on native aquatic fauna and flora if released into our waters.  Marbled crayfish can survive in temperate waters, so there is a real concern that this alien species will become established in Great Britain if introduced. "
        },
        {
            "text": "In Great Britain, marbled crayfish have been found in the English aquarium retail trade and advertised for sale online.  These crayfish likely originate from hobbyists who are passing on excess home-bred stock to pet or aquatic retail shops. Consequently, there is a potential risk of introduction into natural habitats if these species are intentionally or unintentionally released from aquariums into the wild. To tackle this threat, Cefas’ Fish Health Inspectorate (FHI) makes efforts to seize and track the source of these crayfish and raise awareness at Border Control Posts (BCP’s) within ports and airports.  In addition, the FHI works closely with online shops and aquatic hobbyists’ websites to prevent the sale of the species and remove them from circulation.  The FHI also strives to educate the trade and hobby aquarists not to buy or keep these animals and aims to cooperate with them wherever possible.  To enforce this, action may be taken by the FHI against anyone considered to be deliberately committing offences with species listed under the Invasive Alien Species (Enforcement and Permitting) Order 2019 (IAS) or covered by the Crayfish Order. "
        },
        {
            "text": "In England and Wales, a general licence issued under the Crayfish Order permits the keeping of tropical species for ornamental purposes in heated indoor aquaria. At present, the Australian red-claw (Cherax quadricarinatus) is the only crayfish species recognised to be truly tropical and thus the only permitted species available for hobbyists in the UK. Under IAS, it is illegal to possess any crayfish from the list of six non-native crayfish species, including the marbled crayfish. Under the Crayfish Order a licence is required to hold any of the remaining non-native crayfish species not included by IAS, other than the red claw. "
        },
        {
            "text": "Through the FHIs’ work at our borders, and with the aquarium trade and hobbyists, Cefas is working to protect our native crayfish and the environment from threats from these invasive non-native species. "
        }
    ]
}