{
    "url": "https://naturalengland.blog.gov.uk/2025/05/15/protecting-one-of-englands-rarest-marine-habitats-natural-englands-work-on-maerl/",
    "title": "Protecting one of England's rarest marine habitats: Natural England's work on maerl",
    "authors": [
        "Angela Gall"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Marine environment",
        "Monitoring",
        "Natural England",
        "Nature"
    ],
    "pub_date": "2025-05-15T13:11:46+01:00",
    "content": [
        {
            "text": "By Angela Gall, Marine Senior Officer"
        },
        {
            "text": "Hidden beneath the waves along the south coast of Cornwall lies an ancient marine habitat, maerl beds. These pink, twiglet-shaped rhodoliths are free-living, calcified red seaweeds forming intricate, three-dimensional structures on the seabed. They're not just beautiful, they're biodiversity powerhouses, acting as nurseries for young fish, locking up carbon and playing a vital role in our coastal ecosystems."
        },
        {
            "text": "Since 2023, Natural England led a programme of collaborative research to better understand, protect and restore these remarkable habitats within the Falmouth Bay to St Austell Bay Special Protection Area (SPA), delivering on our mission to recover nature at pace and scale as part of the government’s growth, health and security agenda."
        },
        {
            "text": "Why Maerl Matters"
        },
        {
            "text": "Maerl grows at an incredibly slow pace; some beds in the Fal Estuary are thought to be up to 4,000 years old, but they are highly sensitive to damage. Recognised as a Priority Habitat under the Natural Environment and Rural Communities Act, they are legally protected, and were recently identified by Natural England as one of the UK’s most irreplaceable marine habitats."
        },
        {
            "text": "These habitats deliver significant natural capital. They act as nurseries for key commercial species like scallops and crabs and support food chains for birds such as the great northern diver and Slavonian grebe - species for which the Falmouth Bay to St Austell Bay Special Protection Area (SPA) was designated. They also play a role in coastal resilience and carbon storage, helping to tackle climate change."
        },
        {
            "text": "How We're Learning More"
        },
        {
            "text": "From 2023 to 2024, Natural England, alongside key partners including Cornwall Wildlife Trust, Cornwall IFCA (Inshore Fisheries and Conservation Authority) and other partners, carried out extensive seabed mapping and biodiversity surveys."
        },
        {
            "text": "Over 350 species were identified, including Bonnemaisonia clavata, a red seaweed not confirmed in UK waters for over 200 years - demonstrating the exceptional biodiversity associated with maerl beds."
        },
        {
            "text": "Key Discoveries"
        },
        {
            "text": "This data provides a critical natural capital baseline, informing marine management decisions and future investment opportunities and driving forward targeted action to recover sensitive habitats."
        },
        {
            "text": "Understanding the value of maerl within the Special Protection Area"
        },
        {
            "text": "Natural England’s mapping and monitoring work revealed that maerl is widespread within the Falmouth Bay and St Austell Bay SPA alongside seagrass beds and rocky reefs."
        },
        {
            "text": "In 2025, Natural England conducted a literature review to better understand how seabed habitats support SPA features: black-throated diver, great northern diver, and Slavonian grebe."
        },
        {
            "text": "The review found that maerl plays an essential role in supporting prey species such as sand eels, sprat, and edible crab. These ecological links strengthen the case for protecting maerl beds as a foundation for wider ecosystem function. Further research will help refine our understanding and shape future advice."
        },
        {
            "text": "Building inclusive partnerships"
        },
        {
            "text": "At the heart of Natural England’s strategy is the principle that everyone has a role in nature recovery. This project is a clear example of what can be achieved through collaboration."
        },
        {
            "text": "Local Seasearch divers helped rediscover extensive maerl beds. Cornwall Wildlife Trust led community engagement, including a Maerl Community Evening and the launch of the St Austell Bay Blue Carbon Mapping Report."
        },
        {
            "text": "In April 2025, Natural England co-hosted the inaugural UK Maerl Forum with partners from academia, authorities, NGOs and international representatives. The forum aligned research efforts, identified priority actions, and began shaping a shared vision for maerl recovery. A joint action plan is now in development to drive long-term change."
        },
        {
            "text": "The forum was organised by a Steering Group made up of:"
        },
        {
            "text": "What's Next for maerl and marine nature recovery?"
        },
        {
            "text": "With momentum provided by the UK Maerl Forum, Natural England will continue to lead the delivery of nature recovery through evidence-based standards, strategic partnerships, and targeted action."
        },
        {
            "text": "Priorities for the coming years include:"
        },
        {
            "text": "By focusing on places like Cornwall’s south coast, where the opportunity and risk are greatest, we aim to drive system-scale impact and safeguard vital marine ecosystems."
        }
    ]
}