{
    "url": "https://marinedevelopments.blog.gov.uk/2025/05/15/spotting-and-reporting-invasive-non-native-marine-species/",
    "title": "Spotting and reporting Invasive Non-Native marine species",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "fisheries",
        "marine conservation",
        "Uncategorized"
    ],
    "pub_date": "2025-05-15T09:31:18+01:00",
    "content": [
        {
            "text": "It’s Invasive Non-Native Species (INNS) week across the UK – a national effort to raise awareness of the threat invasive species pose to our environment, economy, and native wildlife."
        },
        {
            "text": "For those working on or near the water, especially fishers, you have a role in spotting and reporting."
        },
        {
            "text": "Non-native marine species "
        },
        {
            "text": "Towards the end of 2024, a couple of Atlantic Blue Crabs, easily recognised by their striking blue legs and orange-tipped claws, were identified on the English coast near Brighton."
        },
        {
            "text": "These crabs, native to the western Atlantic Ocean and the Gulf of Mexico, may pose a threat to our native marine life and fisheries if they establish themselves in UK waters."
        },
        {
            "text": "American lobsters and Dungeness crabs (a crab species native to the Pacific Northwest) were found near Brighton in June 2015, with fishermen reportedly catching American lobsters in Cumbria and North Cornwall."
        },
        {
            "text": "American lobsters in particular could have a major impact on UK lobster stocks, carry diseases, or compete for resources and interbreed with the native European lobster. They are generally bigger than native species but help with identification is available."
        },
        {
            "text": "Hooded shrimp (Nippoleucon hinumenis) a small crustacean, approximately 3-6mm in length and native to the Northwest Pacific have also been found in the Thames Estuary. It is a fouling organism of ships or infrastructure and could potentially impact fisheries."
        },
        {
            "text": "These are just few examples of marine non-native species (NNS) being found in our seas. While not all NNS become invasive, some do and they can spread quickly, outcompete native species, damage gear, and disrupt ecosystems."
        },
        {
            "text": "A full alert list for non-native species is available online."
        },
        {
            "text": "Why now is good time to be on look out"
        },
        {
            "text": "While there are many ways marine species can be introduced including shipping, ballast water, aquaculture, and climate change another less well-known route is prayer release."
        },
        {
            "text": "Prayer release involves the ceremonial freeing of animals into the wild as an act of compassion. This practice, associated with some religious communities, has been observed to include the release of marine species such as crustaceans, often around key times of the year including June and October."
        },
        {
            "text": "We recognise the cultural and spiritual importance of this practice and other agencies, including Defra are working with faith communities to promote understanding about the ecological impacts and legal considerations of prayer release and other government bodies take the issue very seriously."
        },
        {
            "text": "Enhancing biosecurity to reduce the spread and impacts of INNS is a key component of Defra’s 25 Year Environment Plan. A cross-governmental group has been set up (see the Great Britain Non-Native Species Secretariat website)."
        },
        {
            "text": "What you can do"
        },
        {
            "text": "With your help, we can better track and respond to the arrival of species that could pose a long-term risk to our seas, our native marine life, and our fishing livelihoods."
        },
        {
            "text": "Let’s work together to keep our waters healthy, sustainable, and safe for the future."
        }
    ]
}