{
    "url": "https://defradigital.blog.gov.uk/2021/06/14/celebrating-world-blood-donor-day-with-my-100th-blood-donation/",
    "title": "Celebrating World Blood Donor Day with my 100th blood donation",
    "authors": [
        "Charlie Beckett"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2021-06-14T15:22:38+01:00",
    "content": [
        {
            "text": "I started giving blood when I was 18, having seen my mother donate for as long as I can remember. For me, the motto of “If you can, you should” is very important and I derive a deep sense of satisfaction from potentially saving lives and really making a difference. I actually find the experience enjoyable."
        },
        {
            "text": "After filling in a health check questionnaire and drinking a pint of squash, they quickly test a drop of my blood for iron levels before I get to recline on a comfy chair and chat with the friendly nursing staff."
        },
        {
            "text": "Afterwards, we have a choice of crisps, biscuits and chocolate bars, along with tea, squash or water. The whole procedure is done in a COVID-safe way. Then, a few weeks later, I receive a text to say where my blood has been sent to in the country. You’d be surprised how far the blood travels to be used in the best way possible."
        },
        {
            "heading": 2,
            "text": "World Blood Donor Day\n"
        },
        {
            "text": "Combining my 100th whole blood donation with World Blood Donor Day is very exciting. It is an event that happens annually, raising global awareness of the essential need for the voluntary donation of safe blood and blood products."
        },
        {
            "text": "Governments and health authorities are encouraged to provide financing for the required infrastructure and systems, whilst the drive for new donors is ever present. The event is also an opportunity to thank all the unpaid donors worldwide."
        },
        {
            "heading": 2,
            "text": "The elephant in the room: needles!"
        },
        {
            "text": "Nobody wants to be jabbed with a needle. When I compare one needle four times a year (three times a year for women) with the amount of needles a child with Leukaemia or Sickle Cell Anaemia has to endure, I know I just need to ‘man up’ and do it."
        },
        {
            "text": "In England, around two thirds of the blood is used to treat medical conditions including anaemia, cancer and blood disorders, with about a third being used in surgery and emergencies including childbirth. I know several mums whose lives have been saved by transfusions following childbirth."
        },
        {
            "heading": 2,
            "text": "Can you help?"
        },
        {
            "text": "Nearly 400 new donors a day are needed to meet demand with around 135,000 new donors needed each year to replace those who can no longer donate. In addition, 40,000 more black donors are required to meet a growing demand for the rare blood types that are more common in people of black heritage. Not everybody can give blood, but from the 14 June, the questions asked before giving blood are changing. This means that more people will be eligible to donate blood based on their health, travel and sexual behaviour."
        },
        {
            "text": "If you want to find out more, please visit the NHS Blood Donation website. The experience of giving blood is quick and easy and you can book online or via the NHS Blood Donation app."
        },
        {
            "text": "Whilst you’re there, please check out organ, tissue and stem cell donation and information about cord blood and plasma donation."
        },
        {
            "text": "Giving blood costs nothing, takes very little time and most importantly, it saves lives."
        },
        {
            "heading": 2,
            "text": "Quick facts: blood donation by numbers"
        }
    ]
}