{
    "url": "https://dwpdigital.blog.gov.uk/2021/06/14/learning-javascript-with-codefirstgirls/",
    "title": "Learning JavaScript with Code First Girls",
    "authors": [
        "Beth Lambert-Matthews, apprentice software engineer, DWP Digital",
        "Shivangi Das, software engineer, DWP Digital",
        "Chloe Williams - software engineer, DWP Digital"
    ],
    "categories": [
        "coding",
        "Software Development",
        "Software Engineering",
        "Women in Digital"
    ],
    "pub_date": "2021-06-14T14:43:37+01:00",
    "content": [
        {
            "text": "Last month, DWP Digital hosted an online introduction to JavaScript course in partnership with Code First Girls. We’re dedicated to closing the gender skills gap within tech, so it was great to join up with Code First Girls whose mission is to encourage those who identify as women and non-binary into considering a future career within tech."
        },
        {
            "text": "Beth shares her views on the course which was delivered by Chloe and Shivangi."
        },
        {
            "heading": 2,
            "text": "Beth Lambert-Matthews: “After only 6 minutes, we started coding!”"
        },
        {
            "text": "I’m training to be a software engineer as part of the DWP Digital apprenticeship programme. Alongside computer courses and technical training, I get to work on real projects so I can put my new skills straight into practice."
        },
        {
            "text": "I attended the Code First Girls course to learn more about JavaScript. The session began with Chloe, a software developer at DWP Digital, explaining a bit about what JavaScript can be used for. I learned that it helps websites have actions and movement and is used in everything from smart watches to computer games. Internet browsers such as Chrome or Safari can decode JavaScript automatically."
        },
        {
            "text": "Then, only 6 minutes into the course, we starting coding! Using a free online resource called JSFiddle.net, we followed Chloe's instructions to write words in a specific pattern. These words were then ‘decoded’ or understood by the computer to make certain outcomes happen."
        },
        {
            "text": "Chloe discussed lots of aspects of code, from variables and datatypes, to using JavaScript console.log, which lets you ‘print’ or display items to the console, or computer screen."
        },
        {
            "text": "Next we learned more about JavaScript from Shivangi, also a software developer with DWP Digital. She explained some really useful parts of code like Boolean true/false types, if/else statements and loops. We were encouraged to code along as she demonstrated arrays (which let you store several pieces of data together) and how to add or remove items."
        },
        {
            "text": "I really enjoyed the enthusiasm that Shivangi and Chloe showed during the session. It was great being able to get straight into the coding exercises and learn more about scope of the topic. It definitely made me want to find out more about JavaScript."
        },
        {
            "heading": 2,
            "text": "Shivangi Das: “Representation matters.”"
        },
        {
            "text": "Representation matters because if you can see it, you can be it. That’s why I’m so keen to do what I can to encourage more women into tech careers."
        },
        {
            "text": "I’ve been part of so many women in tech communities over the 6 years I’ve worked in tech, and they’ve offered the welcoming, encouraging and supportive environment that I needed to keep loving to code."
        },
        {
            "text": "I hope that by delivering the course with Code First Girls I’ve been able to inspire more women into considering a digital role."
        },
        {
            "heading": 2,
            "text": "Chloe Williams: “You don’t need a Computing degree to be a software engineer.”"
        },
        {
            "text": "Having worked with Code First Girls in the past, I was really excited to be involved with the community again. I think it’s really important that companies like DWP Digital offer these kind of taster sessions, as they provide a window into an industry many young women may not have experienced before."
        },
        {
            "text": "Three years ago, my journey to becoming a Software Engineer started with something very similar and I hope this course highlights that you don’t necessarily need a Computing degree to be a software engineer."
        },
        {
            "heading": 2,
            "text": "A future in digital?"
        },
        {
            "text": "If you’re interested in a future career in tech, take a look at some of the introductory courses Code First Girls have to offer. You could also register for our virtual hackathon taking place from 6 - 8 July."
        },
        {
            "text": "And if you’re already working in a digital role, why not check out some of the roles we currently have available in DWP Digital on our careers website?"
        }
    ]
}