{
    "url": "https://ipo.blog.gov.uk/2021/06/14/prize-catch-hookpod-invention-keeps-seabirds-safe/",
    "title": "Prize catch - Hookpod invention keeps seabirds safe",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Environment",
        "Europe",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-06-14T12:47:03+01:00",
    "content": [
        {
            "text": "It’s not every day that a business finds a big gap in the market and creates a solution to a major environmental issue, but that’s exactly what Devon-based brothers Ben and Pete Kibel did."
        },
        {
            "text": "Ben and Pete have been nominated for a European Patent Office (EPO) Inventor Award in the SME category for their invention, Hookpod. You can vote for the brothers in the Inventor Award popular prize until the 17 June 2021 here."
        },
        {
            "text": "We spoke to the pair about their business Fishtek Marine, a smart tech fishing company that produces a range of devices that prevent fishing fleets from accidentally killing marine life."
        },
        {
            "heading": 3,
            "text": "Launching"
        },
        {
            "text": "Starting on the boats of the English Rivera 20 years ago, the brothers realised how much bycatch – fish or birds caught unintentionally - there is in fishing fleets."
        },
        {
            "text": "Engineer Ben and fishery scientist Pete thought, surely there must be a way of using smart technology to reduce this bycatch. That’s when they started with their first device, Baitpod."
        },
        {
            "text": "Ben explained:"
        },
        {
            "text": "\"We worked with the Albatross taskforce and the Royal Society for the Protection of Birds (RSPB) to trial our first device, Baitpod in Florida. We refined the device over many years because we had to come up with something that worked well operationally.\""
        },
        {
            "text": "Improving their invention led them to Hookpod. Their first tests showed that it reduced bycatch by 70 – 100%, preventing thousands of albatrosses from getting caught on fishing hooks."
        },
        {
            "text": "Find out how Hookpod works below."
        },
        {
            "heading": 3,
            "text": "Making waves"
        },
        {
            "text": "Innovation and determination are what really drives Fishtek Marine. Ben explained that"
        },
        {
            "text": "\"Through working on the Hookpod, we talked to other scientists and our awareness of other problems increased, such as those with dolphins and porpoises.\""
        },
        {
            "text": "They have since invented a range of devices to save many types of marine life. One example is SharkGuard, a low-cost device that uses electric fields to deter sharks from fishing hooks, reducing shark bycatch by 90%. Other devices include Pingers and net lights which prevent dolphins, porpoises and sea turtles from getting caught in nets."
        },
        {
            "heading": 3,
            "text": "Protecting the sea as well as their IP"
        },
        {
            "text": "It wasn’t smooth sailing the whole way though. Ben explained that:"
        },
        {
            "text": "\"Our biggest challenge was convincing fishing fleets of the benefits of smart technology. There weren’t any regulations in force saying they had to use them as there was no practical device. So, we thought, let’s make a Pinger that works.\""
        },
        {
            "text": "From here they were able to help change regulations by making durable low-cost devices, they recently supplied thousands of Pingers to the Norwegian cod fishery."
        },
        {
            "text": "A key step in persuading the fishing fleets to take on their inventions, was protecting their intellectual property. Ben and Pete have secured and applied for patents for most of their devices and have trademarked the name Hookpod. Protecting their IP persuaded regulators of their business’ credibility."
        },
        {
            "text": "\"Patents ensure that someone else can’t swoop in at the last minute and make a cheaper version of your products.\""
        },
        {
            "text": "Patenting their inventions was also vital in convincing banks to fund Fishtek Marine. Pete explained how they secured funding over the past 20 years:"
        },
        {
            "text": "\"We were initially self-funded, but if you really want to grow a business you need external funding and for that IP is crucial. So that’s why we secured our IP."
        },
        {
            "text": "\"Even though we’re a team of 8 or 9 staff, we’re global leaders as no one else has done this. As it’s quite a new area, we’ve been able to secure patents or have patents pending for most of our devices.\""
        },
        {
            "heading": 4,
            "text": "Advice for other businesses?"
        },
        {
            "text": "\"It’s worth applying for a patent as it’s relatively cheap. Then you’ve got 12 months to review it and get backing to develop the idea. We applied for patents from the start and then pared down our ideas."
        },
        {
            "text": "If you’ve got the next big idea for an invention, find out more about patenting your idea below."
        },
        {
            "heading": 3,
            "text": "European award nominees"
        },
        {
            "text": "From self-funded tests on their Baitpod, to inventors saving our oceans, the duo really have had quite a journey. We asked them how it felt to be nominated for the EPO Inventor Award."
        },
        {
            "text": "Ben said:"
        },
        {
            "text": "\"It’s fantastic, I was surprised to hear we were the only UK nominees, it feels amazing. We’re quite flattered to get recognition and it’s great for Hookpod to raise public awareness.\""
        },
        {
            "text": "Pete said:"
        },
        {
            "text": "\"When we first started, there wasn’t much awareness of marine bycatch. It’s only really been in the past few years that there’s been a much greater push. It feels like the drivers are now in place to get much broader uptake of Hookpod which is pretty exciting really.\""
        },
        {
            "text": "It seems that technology really is the way forward in fishing and saving our planet. Don’t forget to vote for Ben and Pete in the EPO Inventor Awards here."
        }
    ]
}