{
    "url": "https://insidedio.blog.gov.uk/2021/06/14/transforming-building-maintenance-and-repair-services-for-our-armed-forces-customers/",
    "title": "Transforming building maintenance and repair services for our Armed Forces customers",
    "authors": [
        "David Brewer"
    ],
    "categories": [
        "Commercial",
        "Facilities Management",
        "Future Defence Infrastructure Services (FDIS)",
        "Procurement"
    ],
    "pub_date": "2021-06-14T14:07:42+00:00",
    "content": [
        {
            "text": "The contracts cover facilities management. [Crown Copyright, MOD 2014]One of DIO’s main responsibilities is management of the Defence estate and a substantial part of this responsibility involves ensuring that our buildings, accommodation and training estate are working as well as they can be."
        },
        {
            "text": "We work together with our own teams and industry partners in hard facilities management to ensure management and maintenance is carried out efficiently and effectively so that our Armed Forces have the facilities that they need to live, work, train and deploy."
        },
        {
            "heading": 2,
            "text": "New ways of working"
        },
        {
            "text": "As the current contracts for these services come to an end, we have taken a new approach to procurement of these services. The Future Defence Infrastructure Services (FDIS) programme represents a new way of working for DIO, is in line with wider Government policy and demonstrates the approach set out in DIO’s Commercial Strategy. This approach will enable an improved relationship with suppliers based on openness, honesty and trust."
        },
        {
            "text": "Today has seen the first four new contracts, which cover key maintenance work, repairs, servicing and hard facilities management across the Defence estate, awarded. The successful bidders are Mitie, which has won the Scotland and Northern Ireland region, Vivo - a joint venture between Serco and Engie for the Central and South West regions, and Vinci for the South East region."
        },
        {
            "text": "Facilities covered by the new contracts include lighting, plumbing, heating, air conditioning, and fire safety systems."
        },
        {
            "text": "The new contract is worth £1.6bn. [Crown Copyright, MOD 2021]Later phases of the FDIS programme will see contracts awarded for Accommodation Services and management and maintenance of the UK Defence Training Estate."
        },
        {
            "text": "The contracts awarded today are worth £1.6bn and are part of the wider FDIS Programme which is worth around £3bn in total. It is currently the highest value facilities management procurement in Europe."
        },
        {
            "text": "The initial contracts are for seven years but could be extended up to a further three years."
        },
        {
            "text": "FDIS represents a new way of working for DIO that is more aligned with wider Government procurement policy and DIO’s Commercial Strategy."
        },
        {
            "heading": 2,
            "text": "Robust supplier relationships"
        },
        {
            "text": "We are keen to make sure we’ve got a range of service providers across each of the service areas - the Built Estate, Accommodation and the Training Estate. This will provide extra resilience and the opportunity for more competition between industry providers, which will drive continuous improvement and ultimately lead to better services for our Armed Forces customers."
        },
        {
            "text": "FDIS requires contractors to use industry-recognised building maintenance standards. This will ensure buildings are maintained at the right frequency and will increase the life span of the buildings and other assets, as well as delivering energy efficiency."
        },
        {
            "text": "We also wanted to ensure that our chosen suppliers shared our view on the importance of collaboration and partnership. The process saw suppliers and DIO representatives working together on solutions to realistic challenges. The results were submitted by suppliers and were scored as part of their submissions. This has been recognised by the procurement industry as a unique approach to the procurement process."
        },
        {
            "heading": 2,
            "text": "Improvements for our Armed Forces customers"
        },
        {
            "text": "FDIS is transforming DIO’s approach to maintaining the Defence estate and the new arrangements will mean improvements for service personnel."
        },
        {
            "text": "More robust supplier relationships and contract monitoring will lead to improvements for our Armed Forces customers. Our customers will have the opportunity to make choices about the level of service they receive, such as increasing the scope of planned preventative maintenance."
        },
        {
            "text": "Suppliers will also need to collect and manage estate data, exploit digital technology and provide estate intelligence. This will enable DIO to better support the Armed Forces in making investment decisions about how to manage the Defence estate."
        },
        {
            "text": "New contract performance measures will also be adopted to provide incentives for suppliers to perform well. This will lead to better quality services for military customers."
        },
        {
            "heading": 2,
            "text": "An ever-changing Defence estate"
        },
        {
            "text": "In DIO, we are passionate about the work we do every day to support the Armed Forces and their families. Throughout this procurement process we have sought to bring together good practice from across the facilities management market to introduce a more collaborative way of operating. This will provide the flexibility needed for an ever-changing Defence estate and ultimately deliver an improved experience for personnel."
        },
        {
            "text": "I am pleased to announce the successful suppliers for the Built Estate FDIS contracts and look forward to working with them to provide the best possible service for our Servicemen and women in the future."
        },
        {
            "text": " "
        }
    ]
}