{
    "url": "https://food.blog.gov.uk/2021/06/14/what-the-updated-approach-for-shellfish-harvesting-areas-means-for-industry-and-consumers/",
    "title": "What the updated approach for shellfish harvesting areas means for industry and consumers",
    "authors": [
        "Rebecca Sudworth, Director of Policy"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2021-06-14T14:16:35+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Rebecca Sudworth, Director of Policy at the Food Standards Agency, reflects on the work we’ve been doing to help shellfish businesses adjust to the new relationship with the EU. She explains some changes that have been made to our approach for classifying shellfish harvesting areas and what this means for businesses and consumers."
        },
        {
            "text": " "
        },
        {
            "text": "Shellfish such as oysters, mussels, clams and cockles are also known as live bivalve molluscs and feed by filtering their food from the water that they live in. That means they can pick up bacteria or viruses if they live in an area that is contaminated with sewage, for example."
        },
        {
            "text": "To protect us from becoming ill after eating shellfish, they must be harvested from waters that are classified. The shellfish beds are classified by the amount of E. coli bacteria that are contained within their flesh and are generally categorised as class A, B or C."
        },
        {
            "heading": 2,
            "text": "Why are we making these changes?"
        },
        {
            "text": "The FSA is responsible for classifying areas which are authorised for the harvesting live bivalve molluscs (LBMs)."
        },
        {
            "text": "Only LBMs harvested from class A areas can be placed on the market for direct human consumption without further processing."
        },
        {
            "text": "We were asked by Ministers to consider Shellfish Association of Great Britain (SAGB) proposals to review the FSA’s guidance for classifying harvesting areas. This followed the end of the Transition Period, where LBMs from Class B harvesting areas in Great Britain were no longer permitted to be exported to the EU for processing. That means it’s very important that classification around the A/B boundary is up to date and robust."
        },
        {
            "text": "As a first step, we agreed there was scope for improvements in the approach to anomalous results, and have therefore reviewed our approach for the classification of harvesting areas on the A/B boundary."
        },
        {
            "text": "These changes will help ensure classification decisions are proportionate, provide appropriate levels of public health protection, and remain compliant with the legislation in Great Britain and Northern Ireland."
        },
        {
            "heading": 2,
            "text": "Agreed changes to shellfish harvesting area classification"
        },
        {
            "text": "We are extending the criteria for excluding E. coli testing results that are uncharacteristically higher than those usually seen in an area. This will make it clear that additional statistical evidence can be taken into account when considering unusually high results."
        },
        {
            "text": "These results are called ‘anomalous’ and can be caused by a range of issues such as unusual events such as storms or sewage treatment failures. If a high result is recorded harvesting is stopped whilst an investigation takes place. Results are only excluded, and harvesting re-started, if there is good evidence that they are unlikely to happen again."
        },
        {
            "text": "The changes we are making will allow us to take a proportionate response to occasional results which are marginally above the threshold for class A harvesting areas, where the results from the remaining monitoring data shows that the area is within the class A criteria."
        },
        {
            "heading": 2,
            "text": "The impact on consumers of these changes to classification"
        },
        {
            "text": "Maintaining high standards of consumer protection in the UK remains a priority for the FSA."
        },
        {
            "text": "We believe that there is no added risk to consumers from the changes we are making. We have applied the scientific evidence rigorously, and will continue to protect public health."
        },
        {
            "heading": 2,
            "text": "How our approach to classification compares internationally"
        },
        {
            "text": "Seafish, the public body supporting the seafood industry, have published a report on Official Controls for shellfish."
        },
        {
            "text": "The report offers, for the first time, a comprehensive review of how the EU Official Control Regulations (OCR) relating to LBM production are applied across different countries."
        },
        {
            "text": "The report suggests that the UK has previously taken a different approach to some other countries in interpreting the rules and we will take this into account as we move to the next stage."
        },
        {
            "heading": 2,
            "text": "Next steps for the FSA and shellfish classification"
        },
        {
            "text": "We are working at pace to consider how these changes will impact individual harvesting areas in England, Wales and Northern Ireland."
        },
        {
            "text": "The new approach will allow a small number of areas to move from class B or seasonal A/B classifications to year-round class A. This may include, subject to future monitoring data, some shellfish harvesters that have supplied export markets in the EU prior to the end of the transition period."
        },
        {
            "text": "Changes will take effect from September 2021 in England and Wales and January 2022 in Northern Ireland, to align with the annual reviews of shellfish classifications."
        },
        {
            "text": "Further technical detail can be found in the Chief Executive’s report."
        },
        {
            "heading": 1,
            "text": "Beth mae'r canllawiau wedi'u diweddaru ar gyfer ardaloedd cynaeafu pysgod cregyn yn ei olygu i’r diwydiant ac i ddefnyddwyr"
        },
        {
            "text": "Mae Rebecca Sudworth, Cyfarwyddwr Polisi yn yr Asiantaeth Safonau Bwyd (ASB), yn trafod y gwaith rydym ni wedi bod yn ei wneud i helpu busnesau pysgod cregyn i addasu i'r berthynas newydd gyda'r Undeb Ewropeaidd (UE). Mae hi'n egluro rhai newidiadau i'n dull o ddosbarthu ardaloedd cynaeafu pysgod cregyn a beth mae hyn yn ei olygu i fusnesau a defnyddwyr."
        },
        {
            "text": " "
        },
        {
            "text": "Mae pysgod cregyn fel wystrys, cregyn gleision, cregyn Berffro (clams) a chocos hefyd yn cael eu galw'n folysgiaid dwygragennog byw (live bivalve molluscs) ac maen nhw'n bwydo trwy hidlo eu bwyd o'r dŵr maen nhw'n byw ynddo. Mae hynny'n golygu y gallant godi bacteria neu firysau os ydynt yn byw mewn ardal sydd wedi'i halogi â charthffosiaeth, er enghraifft."
        },
        {
            "text": "Er mwyn ein diogelu rhag mynd yn sâl ar ôl bwyta pysgod cregyn, rhaid eu cynaeafu o ddyfroedd sydd wedi'u dosbarthu (classified). Mae'r gwelyau pysgod cregyn yn cael eu dosbarthu yn ôl faint o facteria E. coli sydd yn eu cnawd, ac yn gyffredinol cânt eu categoreiddio fel dosbarth A, B neu C."
        },
        {
            "heading": 2,
            "text": "Pam rydym ni'n gwneud y newidiadau hyn?"
        },
        {
            "text": "Mae'r ASB yn gyfrifol am ddosbarthu ardaloedd sydd wedi'u hawdurdodi ar gyfer cynaeafu molysgiaid dwygragennog byw."
        },
        {
            "text": "Dim ond molysgiaid dwygragennog byw sy'n cael eu cynaeafu o ardaloedd dosbarth A sy’n gallu cael eu rhoi ar y farchnad i'w bwyta'n uniongyrchol gan bobl heb eu prosesu ymhellach."
        },
        {
            "text": "Gofynnodd y Gweinidogion i ni ystyried cynigion Cymdeithas Pysgod Cregyn Prydain Fawr (SAGB) i adolygu canllawiau'r ASB ar gyfer dosbarthu ardaloedd cynaeafu. Roedd hyn yn dilyn diwedd y Cyfnod Pontio, lle na chaniateir i folysgiaid dwygragennog byw o ardaloedd cynaeafu Dosbarth B ym Mhrydain Fawr gael eu hallforio i'r UE i'w prosesu. Mae hynny'n golygu ei bod yn bwysig iawn bod y dosbarthiad ar ffin rhwng categorïau A/B yn gyfredol ac yn gadarn."
        },
        {
            "text": "Fel cam cyntaf, cytunwyd bod lle i wella'r dull o ymdrin â chanlyniadau anghyson, ac felly rydym ni wedi adolygu ein dull ar gyfer dosbarthu ardaloedd cynaeafu ar y ffin rhwng A/B.\nBydd y newidiadau hyn yn helpu i sicrhau bod penderfyniadau dosbarthu yn gymesur, yn darparu lefelau priodol o ddiogelwch i iechyd y cyhoedd, ac yn parhau i gydymffurfio â'r ddeddfwriaeth ym Mhrydain Fawr a Gogledd Iwerddon."
        },
        {
            "heading": 2,
            "text": "Newidiadau y cytunwyd arnynt i ddosbarthiad ardal cynaeafu pysgod cregyn"
        },
        {
            "text": "Rydym ni’n ymestyn y meini prawf ar gyfer eithrio canlyniadau profion E. coli sy'n annodweddiadol uwch na'r rhai a welir fel arfer mewn ardal. Bydd hyn yn ei gwneud yn glir y gellir ystyried tystiolaeth ystadegol ychwanegol wrth ystyried canlyniadau anarferol o uchel."
        },
        {
            "text": "Gelwir y canlyniadau hyn yn 'anghyson' a gallant gael eu hachosi gan ystod o faterion fel digwyddiadau anarferol megis stormydd neu fethiannau triniaeth garthffosiaeth. Os cofnodir canlyniad uchel, bydd cynaeafu yn dod i ben wrth i ymchwiliad gael ei gynnal. Bydd canlyniadau’n cael eu heithrio, a chynaeafu yn ail-ddechrau, dim ond os oes tystiolaeth dda eu bod yn annhebygol o ddigwydd eto."
        },
        {
            "text": "Bydd y newidiadau hyn yn ein galluogi ni i ymateb yn gymesur i ganlyniadau achlysurol sydd ychydig yn uwch na'r trothwy ar gyfer ardaloedd cynaeafu dosbarth A, lle mae canlyniadau'r data monitro sy'n weddill yn dangos bod yr ardal o fewn meini prawf dosbarth A."
        },
        {
            "heading": 2,
            "text": "Effaith y newidiadau hyn ar ddefnyddwyr"
        },
        {
            "text": "Mae cynnal safonau uchel o ran diogelu defnyddwyr yn y Deyrnas Unedig (DU) yn parhau i fod yn flaenoriaeth i'r ASB."
        },
        {
            "text": "Credwn nad yw’r newidiadau hyn yn peri risg ychwanegol i ddefnyddwyr. Rydym ni wedi defnyddio'r dystiolaeth wyddonol yn drylwyr, a byddwn yn parhau i ddiogelu iechyd y cyhoedd."
        },
        {
            "heading": 2,
            "text": "Sut mae ein dull dosbarthu yn cymharu'n rhyngwladol"
        },
        {
            "text": "Mae Seafish, y corff cyhoeddus sy'n cefnogi'r diwydiant bwyd môr, wedi cyhoeddi adroddiad ar reolaethau swyddogol ar gyfer pysgod cregyn."
        },
        {
            "text": "Mae'r adroddiad yn cynnig, am y tro cyntaf, adolygiad cynhwysfawr o sut mae Rheoliadau Rheolaethau Swyddogol yr UE sy'n ymwneud â chynhyrchu molysgiaid dwygragennog byw yn cael eu cymhwyso ar draws gwahanol wledydd."
        },
        {
            "text": "Mae'r adroddiad yn awgrymu bod y DU yn flaenorol wedi defnyddio dull gwahanol i rai gwledydd eraill wrth ddehongli'r rheolau."
        },
        {
            "heading": 2,
            "text": "Y camau nesaf ar gyfer yr ASB a dosbarthu pysgod cregyn"
        },
        {
            "text": "Rydym ni’n gweithio’n gyflym i ystyried sut y bydd y newidiadau hyn yn effeithio ar ardaloedd cynaeafu unigol yng Nghymru, yn Lloegr ac yng Ngogledd Iwerddon."
        },
        {
            "text": "Bydd y dull newydd yn caniatáu i nifer fach o ardaloedd symud o ddosbarth B neu A/B tymhorol i ddosbarth A trwy gydol y flwyddyn. Gall hyn gynnwys, yn amodol ar ddata monitro yn y dyfodol, rai cynaeafwyr pysgod cregyn sydd wedi cyflenwi marchnadoedd allforio yn yr UE cyn diwedd y cyfnod pontio."
        },
        {
            "text": "Daw'r newidiadau i rym o fis Medi 2021 yng Nghymru ac yn Lloegr, ac Ionawr 2022 yng Ngogledd Iwerddon, i gyd-fynd ag adolygiadau blynyddol dosbarthiadau pysgod cregyn."
        },
        {
            "text": "Gellir dod o hyd i fanylion technegol pellach yn adroddiad y Prif Weithredwr."
        }
    ]
}