{
    "url": "https://socialcareinspection.blog.gov.uk/2025/03/18/changes-to-our-sccif-guidance-to-improve-stability-for-vulnerable-children/",
    "title": "Changes to our SCCIF guidance to improve stability for vulnerable children",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes",
        "children's services",
        "local authorities",
        "looked after children",
        "social care regulation"
    ],
    "pub_date": "2025-03-18T13:48:34+00:00",
    "content": [
        {
            "text": "Next month, we will be making a small number of changes to our social care common inspection framework (SCCIF). These are mainly aimed at children’s homes and fostering agencies. The changes are intended to encourage more providers to look after children with high or multiple needs."
        },
        {
            "text": "We do not expect supported accommodation providers to be looking after children with complex needs. However, some of the changes are designed to promote stability for children wherever they live or receive support. The changes make it clearer that inspection outcomes will properly reflect practice that improves stability for children."
        },
        {
            "text": "This blog will set out the changes we’re making, our other work to support children who are most at risk of instability, and the next steps."
        },
        {
            "text": "Background"
        },
        {
            "text": "Local authorities are frequently unable to find suitable homes for children with complex needs. We published research last year which found that 91% of local authorities said they struggle with this. This often means that some extremely vulnerable children are living in unsuitable provision, far from family and friends. Some children wait months, or even years, for a settled and stable home."
        },
        {
            "text": "There is no easy solution to this challenge. We need to make sure the right homes, offering the right support, are opening in the right places. But we also want to make sure that homes are confident in providing long-term, sustainable care for vulnerable children who need it most."
        },
        {
            "text": "Reassuring providers"
        },
        {
            "text": "We know that some children’s homes providers continue to worry about their Ofsted grades when they consider referrals of children with complex needs."
        },
        {
            "text": "We will continue to reassure providers that they do not need to worry about this. As our Chief Inspector said in November:"
        },
        {
            "text": "So, what we want to see, what we will always want to see, is that you are doing the most you can, the best you can, for children.’"
        },
        {
            "text": "But we know the perception persists in some places, so we are determined to do more."
        },
        {
            "text": "Changes to inspections"
        },
        {
            "text": "We will publish updates to our social care common inspection framework (SCCIF) in April. They are intended to reinforce and clarify our intent, while reassuring providers."
        },
        {
            "text": "The changes will put a sharper focus on:"
        },
        {
            "text": "Other actions"
        },
        {
            "text": "These changes will build on our continued engagement with the sector, including people with lived experience."
        },
        {
            "text": "They will also add to the existing steps we have taken to make sure all children get the long-term, sustainable care that they deserve."
        },
        {
            "text": "These steps include:"
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "Every child deserves a stable, supportive home environment where they can thrive."
        },
        {
            "text": "We know that finding the right place for a child to live can be challenging. But we want homes and agencies to feel confident in their ability to provide long-term, sustainable care for vulnerable children who need it most."
        },
        {
            "text": "We hope that these changes, as well as the other steps we have taken, will send a clear message: that we will recognise providers who step up to support children with complex needs, and who stick with them though the most difficult times."
        }
    ]
}