{
    "url": "https://environmentagency.blog.gov.uk/2025/03/18/citizen-science-and-the-environment-agency/",
    "title": "Citizen Science and the Environment Agency",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Citizen Science",
        "Community",
        "Environment Agency",
        "Other areas of our work",
        "Science"
    ],
    "pub_date": "2025-03-18T17:46:03+00:00",
    "content": [
        {
            "text": "The Environment Agency is working with partners to develop tools, guidance and frameworks to support a standardised and connected approach to citizen science monitoring of the water environment."
        },
        {
            "heading": 2,
            "text": "The Citizen Science Technical Advisory Framework"
        },
        {
            "text": "Last year, we shared how the Supporting Citizen Science project is working with partners to develop a more collaborative approach to citizen science at the Environment Agency. Citizen science is a valuable tool for enhancing monitoring and engaging the public in scientific and environmental issues."
        },
        {
            "text": "Citizen science initiatives should be led by the organisation best suited to deliver them. Whilst this is not always the Environment Agency, we work closely with partners and often provide support by sharing our technical expertise. "
        },
        {
            "text": "Citizen science initiatives thrive through diverse leadership and collaboration. While the Environment Agency maintains all its statutory monitoring responsibilities, many local groups, charities and community organisations have the local knowledge and connections that make them well-positioned to lead citizen science projects. Our role is to provide technical expertise and guidance where appropriate, focusing our resources on priority areas while helping to ensure data collected can contribute to our shared understanding of the environment."
        },
        {
            "text": "We are delighted to share our new ‘Citizen Science Technical Advisory Framework’ as part of the next step in our Supporting Citizen Science project. This framework has been developed using valuable feedback from colleagues, consultees and partners, including our public consultation last year. Thank you if you shared your views!"
        },
        {
            "text": "Built around eight key principles, the framework supports well-designed monitoring initiatives. The framework’s recommended quality assurance measures will help ensure that the data collected is robust and accessible, enabling the Environment Agency and others to understand the environment better, and take informed action to improve it."
        },
        {
            "text": "The framework is an exciting step in our future plans with citizen science, and reflects our view that citizen science works best when partners:"
        },
        {
            "text": "We recommend that groups work through the key principles in this framework with their catchment partnership, citizen science community, or other local partners to benefit from collective knowledge, experience, and skills. We encourage groups to use this framework as a monitoring pathway and continue to revisit and review each principle as their monitoring progresses. "
        },
        {
            "text": "By following these principles and using the linked guidance and information within the framework, we hope that citizen science initiatives will become more meaningful and useful for you and others. "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The Environment Agency’s Science Strategy commits us to working with our partners to increase the use of third party data to augment existing monitoring approaches and answer questions about the environment."
        },
        {
            "text": "In our advisory role, we must balance our resources with government aims, meaning unfortunately we can’t support every initiative or project. Instead, we will use local priorities to test and develop this framework with partners and further strengthen our approach to citizen science."
        },
        {
            "text": "We will continue our work nationally to define our requirements and provide clear direction about how data and insights will be used and the level of feedback we can offer."
        },
        {
            "text": "Visit our Citizen Science Water Hub page to:"
        }
    ]
}