{
    "url": "https://digitaltrade.blog.gov.uk/2025/03/18/driving-fairness-in-business-the-rebuild-of-the-payment-practices-reporting-service/",
    "title": "Driving Fairness in Business: The rebuild of the Payment Practices Reporting Service",
    "authors": [
        "Tracey Wilson, Deputy Service Owner"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2025-03-18T10:13:05+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Tracey Wilson"
        },
        {
            "text": "Imagine the challenges small businesses face when waiting weeks—or even months—for large companies to pay their invoices. Late payments can create serious cash flow problems, making it difficult for businesses to pay suppliers, invest in growth, or even stay afloat. Tackling these delays is central to the Department for Business and Trade’s (DBT) mission to support small business growth and build a resilient economy. As a key ministerial priority for DBT, the Payment Practices Reporting Service plays a vital role in developing a fairer and more sustainable business environment."
        },
        {
            "text": "Originally launched in 2017 by the Department for Business, Energy & Industrial Strategy (BEIS), the service helps ensure that large businesses report their payment practices transparently. Following the merger of BEIS with the Department for International Trade (DIT) into DBT, a decision was made to rebuild the service.  This meant it would meet modern technology and design standards and prepare for new regulatory requirements taking effect on 1 January 2025.  "
        },
        {
            "heading": 3,
            "text": "Why a rebuild was needed: Addressing challenges and new reporting requirements  "
        },
        {
            "text": "Limited support made the original service hard to maintain and update, hindering adaptation for new reporting requirements, especially in the construction sector.  "
        },
        {
            "text": "However, rebuilding the service wasn’t just about regulatory compliance—it was an opportunity to create a scalable, user-centred service that meets the needs of businesses and policy teams alike.  "
        },
        {
            "heading": 4,
            "text": "Meeting new reporting requirements "
        },
        {
            "text": "Rebuilding the service allows us to be much more responsive to future policy and legal changes. Since January 2025, large businesses now need to report on:  "
        },
        {
            "text": "To address these changes, a content designer analysed the regulations and drafted updates, verified with policy and legal teams. The interaction designer used Figma —a design tool—to prototype and test layouts with users.   With the help of a user researcher, the prototypes underwent 2 rounds of usability testing. These sessions offered valuable insights into how users interacted with the proposed changes. Further testing is planned to ensure the service is as user-friendly and effective as possible."
        },
        {
            "heading": 4,
            "text": "Accessibility"
        },
        {
            "text": "An audit by the Digital Accessibility Centre (DAC) highlighted key issues in the legacy service, which was built before public sector accessibility regulations. The rebuild addressed many of these issues using modern GOV.UK components and updated development practices.  "
        },
        {
            "text": "An accessibility statement has been published, detailing remaining issues and outlining plans to resolve them."
        },
        {
            "heading": 3,
            "text": "The technical transformation "
        },
        {
            "text": "The rebuild began in June 2024, focusing on replicating all legacy features to ensure a seamless transition for users. Accessibility and usability improvements were prioritised where possible without disrupting core functionality. To ensure reliability, the team created automated end-to-end tests using Behave and Playwright, to confirm that the rebuilt service matched all the features of the original."
        },
        {
            "heading": 3,
            "text": "Data Migration challenges"
        },
        {
            "text": "Data migration involved updating legacy data to work with Django, a web development tool, cleaning outdated entries, and ensuring it fit the new platform."
        },
        {
            "heading": 3,
            "text": "Post-launch enhancements"
        },
        {
            "text": "Since the relaunch on 6 December 2024, the team has improved functionality and reliability through several key enhancements. These include a fully functional archive system, enhanced data validation, streamlined updates and proactive monitoring to ensure reliable performance."
        },
        {
            "heading": 3,
            "text": "Driving impact: Benefits for users"
        },
        {
            "text": "The improved Payment Practices Reporting Service benefits a wide range of stakeholders:  "
        },
        {
            "heading": 3,
            "text": "What's next: Supporting Live Service and continuous improvement "
        },
        {
            "text": "The rebuilt service is now supported by a dedicated live services team that focuses on:  "
        },
        {
            "text": "This team will also manage other live services within the Trade and Regulatory Services portfolio in DDaT, scaling resources as needed."
        },
        {
            "heading": 3,
            "text": "Conclusion: A step forward for small businesses"
        },
        {
            "text": "Rebuilding the Payment Practices Reporting Service has been a journey of collaboration, innovation, and user-centred design. The new service not only meets updated reporting requirements but also provides a scalable foundation for future enhancements. "
        },
        {
            "text": "“We are grateful to the DDaT team for their exceptional work on this rebuild. The rebuilt payment reporting service is a crucial foundation for our wider upcoming work on tackling late payments and long payment terms to help UK businesses get paid quickly and fairly,” said the policy team."
        },
        {
            "text": "For small businesses, the service marks a significant step toward greater transparency and accountability, ensuring that large companies pay their invoices quickly and fairly. "
        },
        {
            "text": "For DBT, it exemplifies the value of agile methodologies and teamwork in delivering impactful digital services. As we look ahead, the focus remains on continuous improvement, ensuring this service and others like it, adapt to the evolving needs of businesses and policymakers. "
        },
        {
            "text": "Explore the rebuilt service, and visit our guidance page for more on the reporting requirements."
        }
    ]
}