{
    "url": "https://mhclgdigital.blog.gov.uk/2025/03/18/funding-boost-to-support-digital-planning-innovation/",
    "title": "Funding boost to support digital planning innovation",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Digital Planning",
        "Planning Software"
    ],
    "pub_date": "2025-03-18T16:14:58+00:00",
    "content": [
        {
            "text": "The MHCLG Digital Planning programme is providing further grant funding to local planning authorities (LPAs), for specific digital, data and innovation work, to modernise their planning services.  In this blog post, we set out the allocation of funding for a range of improvements and projects which will transform planning processes and deliver efficiencies."
        },
        {
            "heading": 2,
            "text": "Digital planning innovation"
        },
        {
            "text": "The government has committed to building 1.5million new homes over this Parliament and modernising our planning system is crucial to achieving this goal. "
        },
        {
            "text": "Through our Digital Planning programme, we’re working hand in hand with LPAs to build a planning system which is fit for the 21st century – one that harnesses data and technology to make decisions faster and more transparent.  "
        },
        {
            "text": "Over the last few years, we’ve provided grant funding to LPAs, bringing them into the Open Digital Planning community and enabling them to embrace digital tools, make their planning data available and drive innovation. The results are promising, with early adopters already seeing reduced planning application processing times and better outcomes for communities.  "
        },
        {
            "text": "Read our previous blog post where we shared insights into our collaborative approach to learn more about the Open Digital Planning community and this ground-breaking partnership. "
        },
        {
            "text": "We’re now taking this work further and supporting more LPAs on their digital transformation journey and investing in new projects focused on scalable solutions that could be implemented nationwide.  "
        },
        {
            "heading": 2,
            "text": "Digital Planning Improvement Fund "
        },
        {
            "text": "We’re supporting a further 46 LPAs to join Open Digital Planning. Each will receive a £50,000 grant to help them to adopt modern planning practices, publish relevant planning data and develop their digital capabilities.  "
        },
        {
            "text": "The LPAs will embark on a digital journey where they will complete the following activities: "
        },
        {
            "text": "The LPAs are:  "
        },
        {
            "text": "You can find out more about joining our Open Digital Planning community through our dedicated website, and keep up to data via our LinkedIn page, and by subscribing to the regular newsletter. "
        },
        {
            "text": "You can also read a series of case studies about the work LPAs have done to modernise their services."
        },
        {
            "heading": 2,
            "text": "Continuous funding to support 12 impactful Round 4 PropTech (property technology) projects "
        },
        {
            "text": "The PropTech Innovation Fund is the largest UK government PropTech programme. To date, it has supported 77 LPAs working across 114 pilot projects to adopt digital tools in partnership with tech companies. These initiatives have helped mature the UK market and validate digital approaches as crucial levers for improved, faster plan-making and development outcomes. A series of case studies have been produced which capture the experience and outcomes of many of these pilots.  "
        },
        {
            "text": "With 4 rounds of funding completed, we’re now grant funding 22 LPAs working on 12 existing pilots who have demonstrated that their work is scalable, can unlock sites and speed up plan-making processes. "
        },
        {
            "text": "The successful recipients and their focus areas are:   "
        },
        {
            "text": "To find out more, look out for our online PropTech show and tells, visit our Digital Planning LinkedIn page and subscribe to the regular newsletter  for news and updates.  "
        },
        {
            "heading": 2,
            "text": "Development management software funding   "
        },
        {
            "text": "As part of our mission to modernise the planning system we’re also supporting a series of new partnership projects between LPAs and service providers in the planning industry to transform the existing back-office systems used by many LPAs.   "
        },
        {
            "text": "5 leading software suppliers are working with the Planning Portal and one of their existing local authority customers to pilot the adoption of new planning applications data standards which we’re currently developing.  "
        },
        {
            "text": "The partnerships, which are each being funded £225,000 and will work together from April to December 2025, are:   "
        },
        {
            "text": "Each partnership will test and implement the new data standards, capturing and sharing what they learn before a nationwide rollout across other local authorities in England.   "
        },
        {
            "text": "As well as accelerating the adoption of the new data standards, they will also explore additional benefits that consistent data across planning back-office systems can deliver.   "
        },
        {
            "text": "This focus on data standardisation will enable planning applications to be processed more efficiently – a significant milestone in our journey towards a fully modernised planning system that serves everyone better.   "
        },
        {
            "heading": 2,
            "text": "Other innovative digital planning projects "
        },
        {
            "text": "3 standalone transformative projects are each receiving £300,000 funding, with all initiatives launching in March 2025 to run for a full year. "
        },
        {
            "heading": 2,
            "text": "Get involved    "
        }
    ]
}