{
    "url": "https://insidehmcts.blog.gov.uk/2025/03/18/shining-a-light-on-interpretation-in-our-courts-and-tribunals/",
    "title": "Shining a light on interpretation in our courts and tribunals",
    "authors": [
        "Daniel Flury, Operations Director"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "Training and support",
        "User experience and research"
    ],
    "pub_date": "2025-03-18T13:30:56+00:00",
    "content": [
        {
            "text": "Interpreters are a vital part of the justice system. Through their skills we meet our duty to provide access to justice and ensure everyone involved in a hearing can understand proceedings."
        },
        {
            "text": "Coming to a court or tribunal can be a stressful experience, but for complainants or witnesses who may not speak English as their first language that anxiety can be increased. The ability to understand what’s happening and enabling people to communicate clearly is critical to the smooth running of a hearing, and for defendants, interpreters can be vital to receiving a fair trial."
        },
        {
            "heading": 2,
            "text": "Skilled interpreters meet the needs of our users"
        },
        {
            "text": "Each day, interpreters support around 600 hearings in venues ranging from high security prisons to Crown Courts. They interpret a huge range of languages from Bantu to Polish, as well as delivering British Sign Language (BSL) interpretation or our obligations under the Welsh Language Act. Interpreters support in-person and remote hearings across the civil, criminal and family courts, and in tribunals."
        },
        {
            "text": "Court or tribunal interpreters are highly skilled and experienced professionals. Many are qualified to degree level in their chosen language, but for some particularly rare languages where qualifications are not available, or there are fewer interpreters, we’re more flexible balancing support for court users with the experts available to work with us."
        },
        {
            "text": "In 2022, Ann Carlisle – a professional linguist and former Chief Executive Officer of the Chartered Institute of Linguists – began an Independent Technical Review of Qualifications and Experience Requirements for the Provision of Spoken Language Interpreting for the Ministry of Justice (with the exception of Welsh language interpretation which is subject to  separate qualification and experience requirements overseen by Cymdeithas Cyfieithwy Cymru/Association of Welsh Translators and Intepreters). We’ve accepted all the recommendations made in the review such as providing training to ensure interpreters have the skills they need to support remote hearings effectively."
        },
        {
            "heading": 2,
            "text": "Planning for the future"
        },
        {
            "text": "The needs of our users and interpreters are changing, so we’re looking to the future and running a procurement exercise that we expect to complete in 2026 for the provision of language services to take us through to 2030. We currently work with interpreter services organisation TheBigWord need and our own Welsh Language Unit to book Welsh language interpreters.  to ensure court users can access the interpreters they need. This is because the justice system is complex and finding interpreters for the variety of languages needed to the high standard the justice system demands is rightly time-consuming. If court staff were responsible for this, it would impact the time they have to spend on progressing hearings and supporting judges."
        },
        {
            "text": "This does not diminish the value we place on interpreters work and we’ve listened to their feedback and ideas on how we can continuously improve. For example, from 2026, we’ll be strengthening safeguarding guidance for interpreters so that they can be confident in highlighting any safeguarding concerns they encounter whilst working with us."
        },
        {
            "text": "We’re increasing the support we offer trainee interpreters as they begin their career and we’ll also improve signposting for all interpreters when they work on hearings dealing with sensitive issues. Interpreters will be able to decline bookings that they may find particularly distressing, for example, hearings involving sexual abuse or murder."
        },
        {
            "text": "These plans are very important to us. By supporting interpreters and listening any concerns they raise we’ll continue to ensure anyone – whether they’re at risk of being evicted, dealing with domestic violence, or involved in a case that relates to children – can access swifter, effective access to justice through our courts and tribunals."
        }
    ]
}