{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/03/18/world-social-work-day-2025/",
    "title": "World Social Work Day 2025: celebrating compassion and collaboration",
    "authors": [
        "Tapiwa Julius",
        "Shungu Chigocha",
        "Louise Spragg"
    ],
    "categories": [
        "Leadership",
        "Wellbeing",
        "Working in children's social care"
    ],
    "pub_date": "2025-03-18T08:51:02+00:00",
    "content": [
        {
            "text": "The Co-Chairs of the Principal Children and Families Social Worker (PCFSW) network, Tapiwa Julius, Shungu Chigocha, and Louise Spragg, talk about the importance of compassion and teamwork among social workers, highlighting how these values positively impact their work with children and families."
        },
        {
            "text": "They reflect on the transformative experience of shared leadership, the power of diverse voices, and the significance of professional development and well-being. Their work closely links in with the government's mission to break down barriers to opportunity, building family security and ensuring every child has a safe and loving home."
        },
        {
            "text": "The Principal Social Worker networks bring together Principal Social Workers from councils to share learning, and help shape and support practice and policy at local and national levels. The Department for Education funds the administration of the PCFSW Network to support Principal Social Workers in their leadership roles."
        },
        {
            "heading": 2,
            "text": "Compassion and collaboration"
        },
        {
            "text": "Compassion is the cornerstone of our practice, beginning with how we treat one another. It is one of our shared values, and we believe that without demonstrating compassion among colleagues, it will not be felt by the children and families we work with. By supporting and uplifting each other, we create a ripple effect that reaches the children, families, and communities we serve."
        },
        {
            "text": "Sharing the co-chair role has been a transformative experience for us, especially as we had no prior relationship until August 2024. Drawing on our diverse backgrounds and professional and individual experiences, we have successfully collaborated. This collaboration has strengthened our leadership and enhanced our contributions to the sector."
        },
        {
            "text": "By embracing vulnerability and sharing our stories and insights, we aim to foster stronger connections and engagement within the social work workforce. Our collective experiences underscore the importance of teamwork and the power of diverse voices in driving positive change in social work. We are deeply grateful to all the stakeholders we have engaged to improve outcomes for our sector and children and families."
        },
        {
            "heading": 2,
            "text": "Celebrating Social Work Week"
        },
        {
            "text": "As Principal Social Workers, we proudly celebrate the dedication, resilience, and compassion of our entire social work colleagues during Social Work Week. This is an opportunity to acknowledge not only social workers but also the multi-agency professionals who support us, working tirelessly to improve the lives of children, young people, and families."
        },
        {
            "text": "Social workers are at the forefront of safeguarding and supporting children and their families. Every day, we bring expertise, empathy, and commitment to complex situations, ensuring that children are safe and have the best possible outcomes in life. Our work often demands immense emotional resilience, skill, and trauma-informed approaches. Yet, it is profoundly rewarding to help children and families stay together, find appropriate support for children, or ensure a child is placed in a loving home."
        },
        {
            "text": "Social Work Week shines a light on all those who contribute to children's social care. As social workers, achieving outcomes for children is not a solitary effort. Many dedicated alternatively qualified practitioners play a crucial role in supporting us to deliver outcomes for children and families. Each role is vital. Without our colleagues, we could not perform our statutory duties effectively, and children and families would not receive the holistic support they need."
        },
        {
            "heading": 2,
            "text": "Commitment to workforce well-being"
        },
        {
            "text": "As we celebrate this Social Work Week, we reaffirm our commitment to recognising and supporting every member of our workforce. Investing in professional development, promoting wellbeing, ensuring manageable workloads, and maintaining anti-racist practices are essential to retaining and nurturing our workforce."
        },
        {
            "heading": 3,
            "text": "Useful links"
        }
    ]
}