{
    "url": "https://socialcare.blog.gov.uk/2023/12/21/an-opportunity-to-grow-shared-living/",
    "title": "An opportunity to grow shared living",
    "authors": [
        "Jess Jackson",
        "Heather Thomson",
        "Rebecca Viney-Wood"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Social care reform"
    ],
    "pub_date": "2023-12-21T10:49:11+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A design for shared lives"
        },
        {
            "text": "At Shared Lives Plus, we oversee two models of shared living: Homeshare, and Shared Lives. Shared Lives is a simple concept; it is a person-centred model which matches people who need support with those who can give it, empowering them to thrive within the community."
        },
        {
            "text": "Typically, in Homeshare an older person living in their own home with a spare room is matched with a younger person who provides a small amount of support in exchange for good quality, affordable accommodation."
        },
        {
            "text": "The strength and purpose of both models is to enable people to live fulfilling, meaningful and independent lives. Whether a person simply needs companionship, or is eligible for social care support, we believe that they should be able to access Homeshare and Shared Lives."
        },
        {
            "text": "The Department of Health and Social Care has recently recognised the innovative and person-centred nature of Shared Lives and Homeshare by including them in the Accelerating Reform Fund (ARF)."
        },
        {
            "text": "This means that local authorities, working within ICS consortiums, can choose to grow the shared living models as part of their scaling up of social care. You can read more about the ARF on the DHSC website, here."
        },
        {
            "text": "Both Homeshare and Shared Lives have measurably positive outcomes for those who participate in the models. Homesharing can reduce loneliness, improve wellbeing, and enable older people to stay in their homes for longer. It also facilitates intergenerational relationships. As Homesharer Olivia says:"
        },
        {
            "heading": 2,
            "text": "Positive percentages"
        },
        {
            "text": "The difference that Shared Lives makes to people drawing upon support is consistently high. In October 2023, CQC rated Shared Lives schemes as 97% good or outstanding, whilst 97% of people supported in Shared Lives told us that in the last year, they felt like part of the family most of the time. As our ambassador Heather further explains:"
        },
        {
            "text": "And it is not just supported people who appreciate the many benefits of Shared Lives. Georgina Diba, Director Adult Social Care Operations in Hackney, tells us that:"
        },
        {
            "text": "According to Georgina Diba, the ARF provides a “unique opportunity for areas to further diversify and grow their schemes”, which would enable many more people to access support that can help them to live a “fulfilling and community-based life”."
        },
        {
            "text": "If you’d like our support in submitting your accelerating reform fund application, please email us consultancy@sharedlivesplus.org.uk"
        }
    ]
}