{
    "url": "https://educationhub.blog.gov.uk/2023/12/21/british-sign-language-gcse-everything-you-need-to-know/",
    "title": "British Sign Language GCSE: Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "GCSE",
        "Schools"
    ],
    "pub_date": "2023-12-21T09:20:34+00:00",
    "content": [
        {
            "text": "Students will soon be able to study British Sign Language (BSL) as a GCSE following a consultation into the course content."
        },
        {
            "text": "Parents, teachers and organisations from the deaf and hearing communities, overwhelmingly agreed with the proposals it set out. The responses have helped ensure the content is knowledge-rich, coherent and challenging."
        },
        {
            "text": "Good communication is essential both inside and outside the workplace and this new GCSE will give students a vital life skill valued by employers."
        },
        {
            "text": "The introduction of the new GCSE is in part thanks to 17-year-old, Daniel Jillings, who has campaigned for the qualification since the age of 12."
        },
        {
            "text": "As well as being the focus of an Award-winning documentary film, Daniel has also addressed more than 20 MPs in his first language, BSL."
        },
        {
            "text": "Here’s what you need to know about this new and historic qualification."
        },
        {
            "heading": 3,
            "text": "What will be on the BSL curriculum? "
        },
        {
            "text": "As part of the GCSE, students will be taught at least 750 signs and how to use them to communicate effectively with other signers for use in work, social and academic settings.  "
        },
        {
            "text": "Students will also learn about the history of BSL, and how it evolved into the language it is today.  "
        },
        {
            "text": "The GCSE assumes no prior knowledge of BSL but will be accessible for students who use it as their first language. "
        },
        {
            "text": " We have worked closely with subject experts, stakeholders, exam boards and schools to ensure the subject content is knowledge-rich, diverse in its teaching and challenging. The qualification is internationally recognised and accepted in school and college performance tables.   "
        },
        {
            "text": "You can view the BSL GCSE subject content on Gov.uk.  "
        },
        {
            "heading": 3,
            "text": "When will the GCSE be available?  "
        },
        {
            "text": "We aim for the BSL GCSE to be available to teach in schools from September 2025.   "
        },
        {
            "text": "The BSL GCSE has been in development since 2019 but was delayed due to the pandemic.   "
        },
        {
            "text": "Qualifications do take time to develop from scratch. Once the subject content has been finalised post-consultation, any exam boards that choose to offer the GCSE need time to develop a full specification.   "
        },
        {
            "text": "Specifications must be reviewed and accredited by Ofqual before schools and colleges are able to teach them.   "
        },
        {
            "text": "Schools also require time to prepare for the introduction of new qualifications, including planning any timetable changes and ensuring teachers have the support they need to teach them. This is why it is our aim for the new BSL GCSE to be taught in schools from September 2025. "
        },
        {
            "heading": 3,
            "text": "What are the benefits of studying BSL at GCSE? "
        },
        {
            "text": "BSL was recognised in law as a language of Great Britain in the BSL Act (2022), and the new GCSE will be key to helping inclusivity within education.   "
        },
        {
            "text": "The study of BSL will help students to develop ways of expressing and negotiating meaning through visual spatial language, communication and visual memory skills that will be an advantage to them for the rest of their lives.    "
        },
        {
            "text": "As well as learning how to sign effectively, the GCSE will also give students an understanding of the history of sign language in the UK. This will provide a solid foundation for students' understanding of how the language has reached its current form.  "
        },
        {
            "heading": 3,
            "text": "Who can take the BSL GCSE?  "
        },
        {
            "text": "Any student, of any age, can take the GCSE, either through their school or college, or entering as a private candidate.  "
        },
        {
            "heading": 3,
            "text": "Will it be part of the national curriculum? "
        },
        {
            "text": "Studying BSL is not part of the National Curriculum, however, schools are able to teach BSL to their students if they wish.   "
        },
        {
            "text": "While it is optional, we are confident that its introduction will encourage more schools to teach the subject more widely.   "
        }
    ]
}