{
    "url": "https://designnotes.blog.gov.uk/2023/12/21/developing-a-set-of-principles-for-the-design-and-delivery-of-greener-services/",
    "title": "Developing a set of principles for the design and delivery of greener services",
    "authors": [
        "Ned Gartside – Senior service designer, Defra"
    ],
    "categories": [
        "Community",
        "Design"
    ],
    "pub_date": "2023-12-21T09:00:40+00:00",
    "content": [
        {
            "text": "'Our world needs climate action on all fronts — everything, everywhere, all at once.' António Guterres, UN, Secretary General, Video Message, March 2023"
        },
        {
            "text": "I'm Ned, a service designer at the Department for the Environment, Food and Rural Affairs (Defra). In March, I wrote a blog post on why a group of designers and researchers in Defra had come together to discuss the topic of planet-centricity, and played back 10 initial high-level principles we had sketched for the design of greener services."
        },
        {
            "text": "This blog post will first present the principles in their latest iteration, and then cover what’s next for 2024. The article will conclude by covering the collaborative process we followed, including gathering input from colleagues across government, in order to get the principles into their current state!  "
        },
        {
            "heading": 2,
            "text": "The latest iteration of the principles for the design and delivery of greener services"
        },
        {
            "text": "These eight principles focus on the roles involved in the delivery of services. They attempt to set aspirations for the direction of travel, helping us all become more aware of what the issues are from an environmental impact perspective, and what good practice might look like."
        },
        {
            "text": "The principles were designed based on feedback gathered through workshops with colleagues across the public sector."
        },
        {
            "text": "The first four principles relate to the work of the user-centred design roles. They are intended to help you to consider services holistically from a design point of view, including the online and offline impacts. The remaining four principles cover the other key disciplines involved in the design and delivery of services as well as the working practices of teams as a whole.   "
        },
        {
            "text": "Each principle includes some guidelines for putting it into action, and there are links to further reading and guidance for most of these at the end of the blog post.  "
        },
        {
            "heading": 2,
            "text": "Research to understand environmental impacts"
        },
        {
            "heading": 2,
            "text": "Design to help users succeed first time"
        },
        {
            "heading": 2,
            "text": "Design for lower user and agent impacts"
        },
        {
            "heading": 2,
            "text": " Design for low page, document, and communications weight   "
        },
        {
            "heading": 2,
            "text": " Develop green applications, software & systems"
        },
        {
            "heading": 2,
            "text": " Optimise processing, transmission and storage"
        },
        {
            "heading": 2,
            "text": " Be smart with data"
        },
        {
            "heading": 2,
            "text": " Set up teams to follow green working practices"
        },
        {
            "heading": 2,
            "text": "So where do we go from here, what are our plans for 2024?"
        },
        {
            "text": "The principles we have sketched are very much a work in progress, and there is more work to do to continue to evolve them and provide opportunities for discussion and feedback in 2024. We hope to:"
        },
        {
            "heading": 2,
            "text": "Our process: How did we develop the principles in 2023? "
        },
        {
            "text": "Following the blog post back in the spring, our planet-centred design working group caught the attention of the Digital Sustainability team at Defra, and they invited us to become a sub-working group of STAR (Sustainable Technology Assurance & Reporting), the cross-public sector group that they lead.  "
        },
        {
            "text": "In July, with the help of Transform and Kin & Carta, we ran a cross-public sector workshop to gather feedback on how best to evolve and develop the principles with 25 participants interested in this work from government departments, local authorities and supplier partners. Particular themes emerged around simplifying our use of language, making environmental impacts clearer and widening the scope of the principles to include all disciplines involved at the delivery stage.  "
        },
        {
            "text": "And in September, the principles and the rationale behind them were presented at a talk at Service Design in Government, facilitating another round of feedback and iteration."
        }
    ]
}