{
    "url": "https://insidehmcts.blog.gov.uk/2023/12/21/neurodiversity-and-remote-hearings/",
    "title": "Neurodiversity and remote hearings",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "Court and tribunal reform",
        "Podcast"
    ],
    "pub_date": "2023-12-21T12:45:12+00:00",
    "content": [
        {
            "text": "In our latest episode, we're focusing on an important and timely topic – making courts and tribunals more accessible for neurodivergent people."
        },
        {
            "text": "Neurodiversity, expresses the diverse ways people think, interpret, and process information, and it is at the forefront of our efforts to ensure justice is accessible to everyone."
        },
        {
            "text": "Our host, Liz Bryant, talks to Nicky Reynolds, Deputy Director of the Future Hearings Programme, and Adam Micklethwaite, Director of The Autism Alliance."
        },
        {
            "text": "Nicky sheds light on what neurodiversity is and the different needs neurodivergent people can have, it’s clear there’s no one size fits all."
        },
        {
            "text": "As they discuss remote hearings - conducted online with participants in different locations - the podcast explores the ongoing efforts to enhance accessibility for neurodivergent people within the justice system."
        },
        {
            "text": "Adam shares insights into autism, highlighting the individual nature of the experience. They delve into the challenges autistic people may face in accessing justice, emphasising the importance of an inclusive society. The discussion then turns to HMCTS's Video Hearing Service, a bespoke solution designed for remote participation, and Adam provides valuable feedback on its potential benefits and areas for improvement."
        },
        {
            "text": "As they explore the broader landscape of neurodivergence, the conversation emphasises the need for user-centered design, active engagement with neurodivergent communities, and meticulous preparation to create an inclusive and accessible justice system."
        },
        {
            "text": "Join us in this insightful dialogue, as we work towards a future where everyone can access justice with ease and dignity."
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": " "
        },
        {
            "text": "A transcript of the podcast is also available here."
        }
    ]
}