{
    "url": "https://vmd.blog.gov.uk/2023/12/21/vmd-amr-team-international-engagement/",
    "title": "VMD AMR team International Engagement",
    "authors": [
        "Sannah Malik"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)"
    ],
    "pub_date": "2023-12-21T13:02:50+00:00",
    "content": [
        {
            "text": "Over the last couple months, our AMR team has been meeting international colleagues to discuss and showcase ways of tackling AMR globally."
        },
        {
            "text": "The team showcased the UK’s progress in reducing antibiotic sales for food-producing animals by 59% and learnt of challenges and success stories around the world. Here we highlight some of the recent international work. "
        },
        {
            "heading": 2,
            "text": "Why do we engage globally"
        },
        {
            "text": "AMR has no respect of borders and even though the UK is at the forefront of this global issue, we are only as strong as our weakest link. This is why engaging with our global partners is essential in our commitment to reducing AMR, and the VMD is achieving this through many different collaboratives, such as:"
        },
        {
            "heading": 2,
            "text": "So this is where we've been"
        },
        {
            "heading": 3,
            "text": "AMR Amsterdam Conference 5-6 October"
        },
        {
            "text": "This presented an opportunity to learn and discuss optimal practices in the veterinary domain to protect human health care from antimicrobial resistance. It also provided a valuable opportunity to foster international connections with academic and governmental colleagues. A series of small group breakout sessions tackled complex issues from the role of wildlife as a possible AMR transmission route to the use of artificial intelligence, and other digital tools, to improve animal health and welfare."
        },
        {
            "text": "We are contributing to the review paper to capture the outcomes of these sessions which will be published in an open-source journal."
        },
        {
            "heading": 3,
            "text": "FAO Global Conference on Sustainable Livestock Transformation 25-27 September"
        },
        {
            "text": "VMD representatives attended the conference to engage with the wider sector and highlight the importance of including responsible use of medicines in the sustainable livestock narrative. The conference was used as an opportunity to launch the One Health/AMR Group of Friends co-chaired by Kenya and the UK, which is a collection of member state representatives working together to find solutions to the global threat of AMR."
        },
        {
            "heading": 3,
            "text": "Digivet Workshop Sweden 25-26 October"
        },
        {
            "text": "The VMD presented alongside UK industry stakeholders on the antimicrobial use (AMU) data collection platform developed for ruminants. We explored the opportunities and challenges of AMU data digitisation across and between different countries. The workshop brought together a UK contingent of farmers, vets and government experts as well as researchers to better understand the benefits of digitisation, use and sharing of data for different stakeholders."
        },
        {
            "heading": 3,
            "text": "WOAH European and Central regional ANIMUSE training workshop Serbia 6-10 November"
        },
        {
            "text": "VMD represented the UK in a 3-day World Organisation for Animal Health (WOAH) workshop for the European and Central Asian region. We had the opportunity to contribute UK data to the new, globally accessible antimicrobial use database. There were over 50 countries in the room from across Europe and Central Asia and was a great place to facilitate discussions about the importance of AMU data transparency, different countries’ animal health systems and learn from our international counterparts."
        },
        {
            "heading": 3,
            "text": "Transatlantic Taskforce for AMR (TATFAR) Luxembourg 14-15 November"
        },
        {
            "text": "Alongside human health colleagues, the VMD team attended this meeting in Luxembourg, bringing together technical experts from both sides of the Atlantic; including UK, Canada, USA, EU, and Norway, to address the threat of AMR. The VMD’s Head of Usage and Stakeholder Engagement, Fraser Broadfoot, chaired a panel on appropriate antimicrobial use in human and veterinary medicine and presented the UK’s latest results from the Veterinary Antibiotic Resistance and Sales Surveillance 2022 report."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "AMR Multi-stakeholder Partnership Platform meeting FAO Rome 16 November"
        },
        {
            "text": "The FAO hosted the inaugural plenary meeting for the Quadripartite AMR Partnership Platform. The platform is a global initiative to bring stakeholders together from across One Health sectors to drive change and implement action to reduce AMR."
        },
        {
            "text": "Over 150 people from the private sector, governments, research, civil society and funding institutions were in attendance. The UK had the honour of Christine Middlemiss, Chief Veterinary Officer, being appointed onto the Platform Steering Committee as the representative for all the national governments which is a great opportunity for UK leadership in this international forum."
        }
    ]
}