{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/06/coverage-of-our-proposals-to-shakeup-home-buying-and-selling-process/",
    "title": "Coverage of our proposals to shakeup home buying and selling process ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-10-06T13:13:10+01:00",
    "content": [
        {
            "text": "There has been widespread, positive coverage across every national outlet on the government’s announcement to speed up the long drawn-out and costly homebuying and selling process – the biggest shakeup in this country’s history.  "
        },
        {
            "text": "Hundreds of thousands of first-time buyers are set to save £710 when buying a home under the proposals which will reduce the process by four weeks, saving people time, money and reducing unnecessary stress.  "
        },
        {
            "text": "The Metro’s front page splashes on exclusive comments from the Prime Minister, stating the homebuying process is “one of the most stressful things” people will do. He focused on the “torturous process of transactions” that \"fall through at the last minute, costing thousands of pounds” after they have “shelled out for surveys and solicitors”.   "
        },
        {
            "text": "In addition, several national papers have run the story on its front pages including The Daily Telegraph, alongside further prominent coverage in The Guardian, Sky News (including a news alert), Independent, BBC News online, PA, The Mirror, The I, the Sun, Daily Star, Financial Times, The Times and the Daily Mail. Minister Fahnbulleh has also undertaken the morning broadcast round on the topic and carried out interviews with Times Radio, Sky News, BBC Breakfast, LBC, ITV’s Good Morning Britain, ITN, Bauer and GB News.  "
        },
        {
            "text": "The news has also been welcomed by a number of organisations, with comments across the media from groups such as Rightmove, Zoopla, Nationwide, Santander, and the Royal Institute of Chartered Surveyors.  "
        },
        {
            "text": "Reforms unveiled today include:  "
        },
        {
            "text": "Housing Secretary, Steve Reed, said:  "
        },
        {
            "text": "“Buying a home should be a dream, not a nightmare.   "
        },
        {
            "text": "“Our reforms will fix the broken system so hardworking people can focus on the next chapter of their lives.   "
        },
        {
            "text": "“Through our Plan for Change we are putting more money back into working people’s pockets and making a simple dream a simple reality.”  "
        }
    ]
}