{
    "url": "https://educationhub.blog.gov.uk/2025/10/everything-you-need-to-know-about-teacher-training-bursaries-and-scholarships/",
    "title": "Everything you need to know about teacher training bursaries and scholarships ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Teacher recruitment",
        "teachers"
    ],
    "pub_date": "2025-10-06T22:35:00+01:00",
    "content": [
        {
            "text": "We want to make it easier for talented people to train as teachers, especially in subjects where they’re needed most. That’s why bursaries and scholarships have just been announced for those starting teacher training courses. "
        },
        {
            "text": "Here’s what you need to know. "
        },
        {
            "heading": 3,
            "text": "What is being announced? "
        },
        {
            "text": "From today, people training to become teachers in key subjects can apply for tax-free bursaries and scholarships worth up to £31,000. "
        },
        {
            "text": "This funding is designed to attract more people into the profession by helping cover the cost of training, so that finances are less of a barrier. "
        },
        {
            "heading": 3,
            "text": "Which subjects are covered? "
        },
        {
            "text": "Bursaries are focused on priority subjects where more teachers are needed, including: "
        },
        {
            "text": "In addition, scholarships are available in Physics, Chemistry and Computing."
        },
        {
            "text": "These subjects are vital to young people’s futures, but also areas where schools have found it hardest to recruit enough teachers. "
        },
        {
            "heading": 3,
            "text": "How can I apply for the bursaries and scholarships?"
        },
        {
            "text": "Bursaries are straightforward - if you qualify for one, you'll get it automatically when you start your teacher training. No application is needed."
        },
        {
            "text": "Scholarships work differently. They're run by organisations who love their subject and want to support new teachers. As well as money, you'll get extra perks like mentoring and the chance to meet other teachers in your field. You do need to apply for these."
        },
        {
            "text": "However it is worth noting you can only get one or the other - not both."
        },
        {
            "text": "Find out more here."
        },
        {
            "heading": 3,
            "text": "Are there other routes into teaching? "
        },
        {
            "text": "Yes. There are also employment-based routes. We support these too, for example, schools offering Postgraduate Teaching Apprenticeships (PGTA) will continue to receive salary grants of up to £29,000. "
        },
        {
            "text": "This means trainees can earn a salary while they learn. "
        },
        {
            "heading": 3,
            "text": "How does this support fit into wider plans to recruit more teachers? "
        },
        {
            "text": "The government has pledged to recruit an additional 6,500 teachers by the end of this Parliament. "
        },
        {
            "text": "Already, there are over 2,300 more secondary and special schoolteachers in classrooms this year compared to last year, and 1,300 fewer teachers leaving the profession, meaning more pupils are being taught by experienced staff. "
        },
        {
            "text": "The bursaries build on this progress by encouraging more people to enter the profession. "
        },
        {
            "heading": 3,
            "text": "Why is this important? "
        },
        {
            "text": "High-quality teaching is the single biggest driver of school improvement and pupil success. "
        },
        {
            "text": "By supporting more people to train as teachers, particularly in shortage subjects, these bursaries will help ensure that every child has access to excellent teaching. "
        },
        {
            "heading": 3,
            "text": "What does this mean for families and pupils? "
        },
        {
            "text": "More teachers in classrooms, especially in maths, science and computing, means pupils can get the specialist teaching they need. This is particularly important in disadvantaged communities, where the impact of high-quality teaching can be most transformative. "
        }
    ]
}