{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/10/06/national-kinship-care-ambassador-2025/",
    "title": "Kinship care: a journey, not always a destination",
    "authors": [
        "Jahnine Davis"
    ],
    "categories": [
        "Kinship care"
    ],
    "pub_date": "2025-10-06T16:32:43+01:00",
    "content": [
        {
            "text": "In 2021, I was appointed to the Child Safeguarding Review Panel and became the National Kinship Care Ambassador in September 2024. Through my lived and professional experiences, I advocate for children living in kinship care and their families across England. Twelve months into this position, I've met children, parents, carers, extended family members, and professionals across the sector. Each conversation has deepened my understanding of kinship care's complexities and highlighted its vital role in giving children the best start in life."
        },
        {
            "text": "Children enter kinship care for various reasons—bereavement, parental mental ill-health, safeguarding concerns, and other challenges. The Department for Education supports kinship arrangements through statutory guidance and commissioned practice guides."
        },
        {
            "heading": 2,
            "text": "Reflecting on a Whole Family Approach"
        },
        {
            "text": "When first briefed on this role, I questioned whether we were taking a sufficiently holistic approach. While carers' experiences must never be overlooked, I found myself asking: Where are the children in this narrative? What do we know about parents and the wider family network?"
        },
        {
            "text": "In this role, my lens must include children, parents, carers, and supporting services. Policy must reflect this comprehensive view."
        },
        {
            "heading": 2,
            "text": "Listening to Families"
        },
        {
            "text": "This year's journey has taught me that focusing solely on carers, particularly those with Special Guardianship Orders, risks sidelining children's voices and needs, despite best intentions. We also overlook insights from other arrangements especially informal ones, and miss opportunities to understand and support parents navigating difficult circumstances."
        },
        {
            "text": "Most arrangements are loving, stable, and secure. Yet critical questions remain:"
        },
        {
            "text": "Research from Foundations and Coram found that mediation and conflict resolution between parents and carers can improve contact arrangements and alleviate concerns. Regardless of how children enter kinship care, family needs continue evolving—we must view kinship as a journey, and not always a destination."
        },
        {
            "heading": 2,
            "text": "Year Two Initiatives"
        },
        {
            "text": "To build a more inclusive kinship care landscape, I'm working on some new projects:"
        },
        {
            "heading": 2,
            "text": "Moving Forward Together"
        },
        {
            "text": "Kinship families’ needs continue to evolve once a placement is made, whether they are the child’s, parents’ or carers’. It is incumbent on all of us as policymakers, practitioners, families, and communities to work together to ensure that every child, regardless of where or with whom they live, can thrive."
        },
        {
            "text": "Please look out for a future First-Year Report reflecting on my first year in post. This will highlight insights from families and professionals, and showcases local innovation and challenges implementing the local offer of support to kinship families."
        },
        {
            "heading": 2,
            "text": "Find out more"
        }
    ]
}