{
    "url": "https://mhclgdigital.blog.gov.uk/2025/10/06/proptech-innovation-takes-on-housing-delivery-challenges/",
    "title": "PropTech innovation takes on housing delivery challenges  ",
    "authors": [
        "Joanna Averley, Chief Planner, MHCLG"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2025-10-06T10:06:48+01:00",
    "content": [
        {
            "text": "How do we embark on the journey of solving 3 fundamental problems holding back housing delivery in England?  "
        },
        {
            "text": "Several months ago, we challenged the PropTech sector to come up with scalable solutions to address land data accessibility, small site deliverability and infrastructure certainty.  "
        },
        {
            "text": "The response exceeded all our expectations. I discussed the overwhelming interest we had in a previous blog post. Now, following a series of in-depth judging days, 84 applications have been whittled down to 12 selected pilots which were launched at a celebration event at the end of September. These teams will now develop their innovations further, including real world testing with local authority and developer partners. "
        },
        {
            "text": "We’re running the PropTech Innovation Challenge in collaboration with Geovation from Ordnance Survey. At the recent event I was thrilled to hear from each of the winning teams about their innovative solutions. The energy in the room was tangible, and it was clear the teams were eager to move from their pitch presentations to the implementation phase.  "
        },
        {
            "text": "Each team is receiving up to £100,000 and will work up until March 2026 to develop and test their innovations.  "
        },
        {
            "heading": 2,
            "text": "3 critical areas "
        },
        {
            "text": "The solutions each cover one of the 3 challenge areas we set out. One company is developing an innovative approach to make land ownership data more accessible and transparent. Five teams are exploring how they can offer greater certainty to developers with tools that provide reliable insights into essential infrastructure capacity. Meanwhile 6 companies are focused on unlocking small site delivery by reducing investment risks and improving viability assessments for smaller developments. You can find out more about the statements in another one of our previous blog posts and Geovation's Challenge research report."
        },
        {
            "heading": 2,
            "text": "Powerful collaboration "
        },
        {
            "text": "At the event what struck me most wasn't just the innovative ideas and sophistication of the technology on display, but the genuine collaboration between public and private sectors. I am delighted that these teams are embarking on their journeys of discovery alongside local government partners who are equally passionate about solving these problems. These partnerships represent something new – a shared commitment to solving complex problems together, through innovation, with the ultimate goal of delivering the 1.5 million homes our country needs. "
        },
        {
            "text": "And that’s really what it all comes down to. And something we must keep front of mind. Having also chaired the recent Housing Design Awards, which culminated last month, I visited many schemes during the judging process and stood with people in their new homes. These visits are always powerful reminders of what a vital stepping stone a home is for people and just how important this work is.  "
        },
        {
            "heading": 2,
            "text": "The journey ahead "
        },
        {
            "text": "I’m looking forward to seeing how these 12 teams progress with their pilots and the advances they’ll have made by March 2026, which will hopefully lead to adoption and scaling across the housing sector. You can follow their progress and learn more about each solution on the PropTech Innovation Challenge website page. We’re planning to organise a show and tell in December.  "
        },
        {
            "text": "I also set the teams a challenge – to build open source solutions wherever possible and design out repeat costs. This way, we can maximise the number of people who benefit from these innovations. I have also asked them to consider how we can enable local authorities to leapfrog their current practice and what key messages I need to take back to policymakers to help make this happen. I am looking forward to seeing how they respond. "
        }
    ]
}