{
    "url": "https://aphascience.blog.gov.uk/2025/10/06/red-squirrel-recovery-why-apha-are-all-in/",
    "title": "Red squirrel recovery: Why APHA are all in",
    "authors": [
        "Sarah Beatham"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2025-10-06T09:00:00+01:00",
    "content": [
        {
            "text": "Red squirrels are fighting for survival and APHA is playing a key role with groundbreaking science, smart feeders, and a bold plan to restore balance to UK woodlands. APHA ecologist Sarah Beatham tells us how."
        },
        {
            "text": "This summer, my team at APHA Wildlife received some truly exciting news. The National Lottery Heritage Fund has awarded £4.86 million to Northumberland Wildlife Trust and its partners to launch the Red Squirrel Recovery Network (RSRN). This five-year initiative is a major step forward in protecting one of the United Kingdom’s (UK’s) most iconic native species, the red squirrel, and I am proud to say APHA is playing a key role."
        },
        {
            "heading": 2,
            "text": "What we are doing and why it matters"
        },
        {
            "text": "As part of the RSRN project, APHA will be working alongside conservation organisations and volunteer groups across Northern England and Southern Scotland. Our focus? Advancing our research into grey squirrel fertility control and supporting red squirrel conservation efforts on the ground."
        },
        {
            "text": "Grey squirrels are a major threat to red squirrels. Not only do they outcompete reds for food and habitat, but they also carry squirrelpox virus, which is deadly to red squirrels. That is why, funded by the UK Squirrel Accord, we have been developing a world-first contraceptive for grey squirrels and it is progressing well. The RSRN project gives us the opportunity to trial bait delivery methods on a much larger scale than ever before, laying the groundwork for future deployment of the contraceptive."
        },
        {
            "heading": 2,
            "text": "Building smarter feeders"
        },
        {
            "text": "To make this possible, we’re collaborating with manufacturers to develop two types of squirrel feeders:"
        },
        {
            "text": "These feeders are based on designs we have used in previous APHA research, and we are testing them to ensure they are robust, cost-effective, and capable of delivering bait exclusively to grey squirrels."
        },
        {
            "heading": 2,
            "text": "Field trials in action"
        },
        {
            "text": "In Southern Scotland and Northumberland, APHA will be training and working with red squirrel conservation volunteers in areas where both species coexist. The grey squirrel-specific feeders will be deployed and monitored using cameras to confirm that only grey squirrels are accessing the bait. These feeders use a clever weight threshold mechanism: the door to the bait only opens for animals weighing over 450 grams. Since grey squirrels are nearly twice the weight of reds, this threshold allows over 90% of adult greys access while excluding all red squirrels, something our research has so far demonstrated, but that needs to be fully tested on a larger scale."
        },
        {
            "text": "In a second trial, we will be working with partners in Cumbria and Lancashire to test the squirrel-specific feeder. This design features a metal tunnel with a bait compartment that squirrels access by pushing open a 70g door with their head. Volunteers trained by APHA will use these feeders to distribute bait containing a dye across large woodland areas. The dye helps us track which squirrels have consumed the bait."
        },
        {
            "text": "To determine how effective this method is, we will estimate local grey squirrel densities using a camera-based technique we developed. Then, by trapping squirrels and collecting hair samples, we will be able to see what proportion of the population consumed the bait, giving us critical insight into how well a contraceptive could work in the future. APHA research has shown that it is possible the deliver bait to most squirrels in most woods using this method."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "This project is incredibly important to us at APHA. It is not just about science, it is about restoring balance to our ecosystems. In the future, fertility control could offer a humane, sustainable way to reduce grey squirrel numbers, and with it, we hope to see red squirrels thrive once again across the UK."
        },
        {
            "text": "We are proud to be part of this journey, and we are excited to work with so many passionate volunteers and conservationists. Together, we are building a future where red squirrels are not just surviving, they are flourishing."
        },
        {
            "text": "The public are being encouraged to get involved with the Red Squirrel Recovery Network by supporting the “Don't Be Shy” campaign on social media, check out #DontBeShy to find out more."
        }
    ]
}