{
    "url": "https://space.blog.gov.uk/2025/10/06/uk-space-agency-funding-for-growing-welsh-space-sector/",
    "title": "UK Space Agency funding for growing Welsh space sector ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2025-10-06T12:52:03+01:00",
    "content": [
        {
            "text": "At the UK Space Agency, we are committed to building a truly national space ecosystem; one that draws on the strengths of every part of the UK. Wales is home to a dynamic and fast-growing space sector, and we’re proud to support its continued growth with a dedicated funding boost."
        },
        {
            "text": "Delivered through our Devolved Administrations Programme, this £247,000 funding will help deliver on the ambitions set out in Wales: A Sustainable Space Nation – the Welsh space strategy published in 2022. Working in partnership with Space Wales and the Welsh Government, the programme is designed to unlock new opportunities for businesses, researchers, and communities, driving local growth and supporting innovation. "
        },
        {
            "heading": 2,
            "text": "Driving sustainable growth across the UK"
        },
        {
            "text": "We want to build one of the most innovative and attractive space economies in the world. A big part of this mission is ensuring that every region of the UK plays a role in the sector’s success. "
        },
        {
            "text": "This new round of funding – announced ahead of World Space Week (4–10 October) – will enable organisations across Wales to deliver targeted, high-impact projects that support the goal of becoming a sustainable space nation. Funding is divided into two strands, ensuring opportunities are available for both early-stage innovators and established cluster partners. "
        },
        {
            "text": "Antonia Yendell, Head of Space Ecosystem Development at the UK Space Agency, said: "
        },
        {
            "heading": 2,
            "text": "A thriving Welsh space sector"
        },
        {
            "text": "The Welsh space sector already contributes £345 million annually to the economy, sustaining over 1,700 jobs across more than 105 organisations. It is home to an impressive mix of strengths, including an environment suited for spaceplane operations, advanced optical tracking and telemetry, and 7,100 sq km of segregated airspace with no ceiling. "
        },
        {
            "text": "Dr Rosie Cane, Cluster Development Manager at Space Wales, said: "
        },
        {
            "heading": 2,
            "text": "Apply for funding"
        },
        {
            "text": "We are inviting applications from organisations across Wales that can demonstrate: "
        },
        {
            "text": "Companies have until 24 October 2025 to apply via GOV.UK. All projects must be completed by 31 March 2026. "
        }
    ]
}