{
    "url": "https://food.blog.gov.uk/2023/03/10/british-science-week-2023-and-connections-across-government/",
    "title": "British Science Week 2023 and connections across Government",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-03-10T09:38:21+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Welcome to the beginning of British Science Week, a ten-day celebration of science, technology, engineering, and maths. Each year has a different theme, with this year's theme being ‘connections’."
        },
        {
            "text": "The Food Standard Agency’s (FSA) core mission is to ensure food is safe and is what it says it is.  Science and evidence lie at the heart of this mission and strong scientific networks help ensure our responses are always underpinned by evidence. British Science Week is therefore a great opportunity to blow the trumpet for FSA science as well as finding out more about science elsewhere in Government and further afield."
        },
        {
            "text": "As Chief Scientific Adviser (CSA), my job is:"
        },
        {
            "text": "I wouldn’t be able to do any of these things without the fantastic support of colleagues right across the organisation, though, so this is an opportunity for me to put on record my huge thanks to all of you within FSA and further afield who have helped provide briefings, data, explanations and a million other invaluable pieces of advice over the last year!"
        },
        {
            "text": "The public perception of science is often one of eccentric people in lab coats (usually elderly white men with crazy hair!) working alone in a windowless basement.  However, as many of us know, nothing could be further from the truth. Collaboration, conversation and challenge are integral to science and so ‘connections’ is a really appropriate theme for British Science Week."
        },
        {
            "heading": 2,
            "text": "The importance of the CSA Network"
        },
        {
            "text": "For me, a hugely important ‘connection’ is the cross-government CSA Network. All departmental CSAs meet weekly to swap notes on current topics and problems in our respective departments, to brainstorm cross-departmental science strategy and – very importantly – to help each other out with support and advice. It’s an invaluable forum for exchanging ideas and solutions, with the added bonus of hearing about the incredible breadth of Government science work from the frequent guest speakers."
        },
        {
            "text": "Another set of critical connections for FSA science are those we make with external organisations and independent experts. One of the most obvious examples of that is in our Scientific Advisory Committees (SACs) and Joint Expert Groups, but there are lots of equally valuable informal collaborations with industry and academia.  Similarly, our FSA-funded fellows and externally commissioned research projects provide strong connections into the wider science community, giving us access to the best international science and raising the FSA’s profile globally."
        },
        {
            "heading": 2,
            "text": "Our areas of research interest"
        },
        {
            "text": "Lastly, British Science Week is a great opportunity to highlight the connections that arise from our Areas of research interest (ARIs). These showcase the main research questions that the FSA are looking to address and have been recently refreshed in line with the FSA Strategy published last year. ARIs are a very visible ‘advert’ which helps to forge collaborations with universities, research institutes and other research providers as well as providing a useful way to readily identify synergies with research activities in other government departments."
        },
        {
            "text": "I hope this has given you a small flavour of what we do and how science ‘connections’ are fundamental to the FSA’s mission. Each day of British Science Week we’ll be showcasing incredible FSA science stories and highlighting many of the incredible scientists behind them, so stay tuned!"
        },
        {
            "text": "And, if you’d like to find out more after the week is over, then I would encourage you to sign up to our Science Newsletter for regular updates about FSA science and opportunities."
        },
        {
            "heading": 1,
            "text": "Wythnos Wyddoniaeth Prydain 2023"
        },
        {
            "text": "Mae hi’n ddechrau Wythnos Wyddoniaeth Prydain. Dyma gyfle i ddathlu gwyddoniaeth, technoleg, peirianneg a mathemateg dros gyfnod o ddeg diwrnod. Mae thema wahanol bob blwyddyn, a’r thema eleni yw ‘cysylltiadau’. "
        },
        {
            "text": "Cenhadaeth graidd yr Asiantaeth Safonau Bwyd (ASB) yw sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Mae gwyddoniaeth a thystiolaeth wrth wraidd y genhadaeth hon ac mae rhwydweithiau gwyddonol cryf yn helpu i sicrhau bod ein hymatebion bob amser yn seiliedig ar dystiolaeth. Mae Wythnos Wyddoniaeth Prydain felly yn gyfle gwych i ganu clodydd gwyddoniaeth yr ASB, yn ogystal â darganfod mwy am wyddoniaeth mewn adrannau eraill yn y Llywodraeth a thu hwnt."
        },
        {
            "text": "Fel Prif Gynghorydd Gwyddonol, fy swydd yw:"
        },
        {
            "text": "Fodd bynnag, ni fyddwn yn gallu gwneud unrhyw un o’r pethau hyn heb gefnogaeth wych cydweithwyr ar draws y sefydliad. Dyma gyfle felly i mi ddiolch yn fawr i bob un ohonoch yn yr ASB a thu hwnt sydd wedi helpu i ddarparu dogfennau briffio, data, esboniadau a llu o ddarnau amhrisiadwy o gyngor dros y flwyddyn ddiwethaf!"
        },
        {
            "text": "Mae’r cyhoedd yn dueddol o ystyried gwyddoniaeth fel maes sy’n llawn pobl ecsentrig mewn cotiau labordy (dynion gwyn oedrannus gyda gwallt gwallgof fel arfer!) yn gweithio ar eu pennau eu hunain mewn ystafell dywyll. Fodd bynnag, fel y mae llawer ohonom yn gwybod, nid dyma’r gwirionedd o gwbl. Mae cydweithio, trafod a herio yn rhan annatod o wyddoniaeth ac felly mae ‘cysylltiadau’ wir yn thema briodol ar gyfer Wythnos Wyddoniaeth Prydain."
        },
        {
            "text": "I mi, mae’r Rhwydwaith CSA trawslywodraethol yn ‘gysylltiad’ hynod bwysig. Mae CSA pob adran yn cyfarfod yn wythnosol i gyfnewid nodiadau ar bynciau a phroblemau cyfredol yn ein hadrannau priodol, i rannu syniadau am strategaeth wyddoniaeth drawsadrannol ac – yn bwysig iawn – i roi cymorth a chyngor i’n gilydd. Mae’n fforwm amhrisiadwy ar gyfer rhannu syniadau ac atebion, yn ogystal â chael y cyfle i glywed pa mor eang yw gwaith gwyddoniaeth y Llywodraeth gan y siaradwyr gwadd cyson."
        },
        {
            "text": "Mae’r cysylltiadau a wnawn â sefydliadau allanol ac arbenigwyr annibynnol hefyd yn hanfodol o ran gwyddoniaeth yr ASB. Un o’r enghreifftiau mwyaf amlwg o hynny yw ein Pwyllgorau Cynghori Gwyddonol (SACs) a’n Grwpiau Arbenigol ar y Cyd, ac mae llawer o gydweithrediadau anffurfiol gyda’r diwydiant a’r byd academaidd, sydd yr un mor werthfawr. Yn yr un modd, mae ein cymrodorion a ariennir gan yr ASB a’n prosiectau ymchwil a gomisiynir yn allanol yn darparu cysylltiadau cryf â’r gymuned wyddoniaeth ehangach, gan roi mynediad i ni at y wyddoniaeth ryngwladol orau a chodi proffil yr ASB yn fyd-eang."
        },
        {
            "text": "Yn olaf, mae Wythnos Wyddoniaeth Prydain yn gyfle gwych i dynnu sylw at y cysylltiadau sy’n deillio o’n meysydd o ddiddordeb ymchwil. Mae’r rhain yn arddangos y prif gwestiynau ymchwil y mae’r ASB am fynd i’r afael â hwy ac maent wedi’u diweddaru’n ddiweddar yn unol â Strategaeth yr ASB a gyhoeddwyd y llynedd. Mae’r meysydd o ddiddordeb ymchwil yn ‘hysbyseb’ amlwg iawn sy’n helpu i feithrin cydweithrediadau â phrifysgolion, sefydliadau ymchwil a darparwyr ymchwil eraill yn ogystal â darparu ffordd ddefnyddiol o nodi’n hawdd y synergeddau â’r gweithgareddau ymchwil yn adrannau eraill y llywodraeth."
        },
        {
            "text": "Rwy’n gobeithio bod hyn wedi rhoi blas bach i chi o’n gwaith ym maes gwyddoniaeth a sut mae ‘cysylltiadau’ yn hanfodol i genhadaeth yr ASB. Bob dydd yn ystod Wythnos Wyddoniaeth Prydain, byddwn yn arddangos straeon gwyddoniaeth anhygoel yr ASB ac yn tynnu sylw at lawer o’r gwyddonwyr gwych, felly cadwch lygad…!  Ac, os hoffech chi ddysgu mwy ar ôl i’r wythnos ddod i ben, ewch ati i danysgrifio i’n Cylchlythyr Gwyddoniaeth i gael diweddariadau rheolaidd am wyddoniaeth a chyfleoedd yr ASB."
        }
    ]
}