{
    "url": "https://deframedia.blog.gov.uk/2023/03/10/coverage-on-his-majesty-the-kings-visit-to-weybridge/",
    "title": "Coverage on His Majesty The King’s visit to Weybridge",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2023-03-10T11:12:40+00:00",
    "content": [
        {
            "text": "There has been positive coverage in the Daily Express (p.9), on BBC Online, the Evening Standard, The Independent and Express and Star following His Majesty The King’s visit to the Animal Plant and Health Agency (APHA) in Weybridge."
        },
        {
            "text": "His Majesty The King visited the site to congratulate staff and scientists for their work combatting the largest-ever avian influenza outbreak in the UK and for their support with Ukrainian refugee pet travel."
        },
        {
            "text": "His Majesty The King undertook a tour which involved briefings on some of most difficult animal health diseases the world faces, including avian influenza and bovine TB, as well as plant health challenges including invasive non-native species. He also visited dedicated specialist research laboratories to see genome mapping and a mosquito laboratory where he learnt about APHA’s vector-borne disease (VBD) programme."
        },
        {
            "text": "On the morning of the visit, the Today Programme interviewed the Chief Veterinary Officer, Christine Middlemiss, who discussed the APHA’s action to combat the Avian Flu outbreak to date, and BBC Radio Surrey interviewed Director of Science Professor Ian Brown to discuss how the visit would highlight work around the control of bovine tuberculosis and newly emerging disease threats."
        },
        {
            "text": "Ahead of the visit, Lord Benyon, Minister for Biosecurity, Marine and Rural Affairs, said:"
        },
        {
            "text": "“The Animal and Plant Health Agency has a long-standing reputation for excellence in the field of biosecurity and the work it does to protect the UK from animal diseases, which in turn supports our economy and food security."
        },
        {
            "text": "“I’m pleased we can use today to showcase our specialist world leading facilities.”"
        },
        {
            "text": "Ahead of the visit, Chief Veterinary Officer Dr Christine Middlemiss said:"
        },
        {
            "text": "“Today’s visit really is about recognising the last 18 months of remarkable work and the APHA staff who have worked day in and day out to help control and manage the spread of avian influenza."
        },
        {
            "text": "“The scale of avian influenza outbreaks across the UK and Europe has been unprecedented and our response has been underpinned by the world-leading science and disease control work carried out at Weybridge.”"
        },
        {
            "text": "Ahead of the visit, David Holdsworth, Chief Executive Officer of APHA, said:"
        },
        {
            "text": "“APHA staff work tirelessly day in day out to protect the UK, its people and economy from the growing biosecurity threats we face. They have faced a relentless battle against Avian Influenza over the last two years. So I am pleased to welcome His Majesty The King to Weybridge to meet with APHA staff from Scotland, Wales and England and see first-hand the incredible work they do."
        },
        {
            "text": "“I am proud to showcase our world-leading scientists, field teams and staff and the role they play in protecting the country.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}