{
    "url": "https://educationhub.blog.gov.uk/2023/03/10/how-are-apprenticeships-funded-and-what-is-the-apprenticeship-levy/",
    "title": "How are apprenticeships funded and what is the apprenticeship levy?",
    "authors": [
        "hollieborland"
    ],
    "categories": [
        "Apprenticeships",
        "Funding"
    ],
    "pub_date": "2023-03-10T18:49:55+00:00",
    "content": [
        {
            "text": "Apprenticeships allow people of all ages to earn while they learn and gain the skills they need to build a rewarding career. Since 2010, over 5.3 million apprentices have started their apprenticeship journey in a wide range of industries, from health to business, to engineering and beyond."
        },
        {
            "text": "This is in part thanks to the apprenticeship levy which was created so businesses can take on more apprentices, alongside the opportunity to invest in high quality training to develop the skilled workforce they need. Here, we explain more about how it works."
        },
        {
            "heading": 3,
            "text": "What is the levy and how does it work?"
        },
        {
            "text": "The apprenticeship levy is paid by large employers with a pay bill of over £3 million. Currently, only 2% of employers pay the levy, which is set at a rate of 0.5% of their total annual pay bill."
        },
        {
            "text": "Every employer who pays the levy has a digital account where they can access their levy funds to spend on apprenticeship training."
        },
        {
            "text": "While only the biggest businesses pay the levy, the funding generated by it also funds apprenticeship training for other employers who want to take on apprentices."
        },
        {
            "text": "Smaller employers – those with a total annual pay bill of less than £3 million – pay just 5% of the cost of their apprenticeship training and the Government pays the rest."
        },
        {
            "heading": 3,
            "text": "Does all the money actually get spent? "
        },
        {
            "text": "In terms of the overall apprenticeships budget, in the last financial year 99.6% of the budget was spent."
        },
        {
            "text": "For individual employers, they can see how much of their levy funds they have used and how much remains available. Although funds which they don’t use expire after two years, this money does not go to waste. Behind the scenes DfE is already using this money to pay for apprenticeship training for smaller employers and for any additional payments needed to support apprentices, training providers and employers."
        },
        {
            "text": "For employers who can’t make full use of their own levy funds, we have set up a system so they can pledge up to 25% of their levy funds to other smaller businesses to support them to invest in apprenticeship programmes."
        },
        {
            "text": "For example, North Cumbria Integrated Care NHS Foundation Trust has helped smaller healthcare organisations grow their own staff by transferring more than £122,000 of its levy funds to some 15 organisations, largely GP practices across Cumbria."
        },
        {
            "text": "Jean Hill, workforce development lead, said: “Apprenticeships are part of our attraction package – people know they can come and work for us, and benefit from career development."
        },
        {
            "text": "“The vast majority of our nursing staff stay with us after completing their apprenticeship, with a large number progressing up the organisation. Apprenticeships help us fulfil our ‘Grow Your Own’ strategy. Levy transfers are good for us, good for the organisations we transfer to and also benefit the local communities we serve.”"
        },
        {
            "text": "GlaxoSmithKline (GSK) has also used its apprenticeship levy to enable a range of smaller businesses and charities to hire and train apprentices. One company to benefit from the funding is Yunus & Eliza, a Cotswolds based jewellery company."
        },
        {
            "text": "Company director Eliza Higginbottom said: “The levy transfer from GSK has made it possible to provide an opportunity for our apprentices and also help us grow our business."
        },
        {
            "text": "“Our apprentices are fantastic. They attend college one week a month and when they are gone, we really miss them. It takes time and commitment to train them up on the job, but the time it takes is more than worth it, because they give us so much back.”"
        },
        {
            "heading": 3,
            "text": "What can the levy be used for?"
        },
        {
            "text": "Levy funding can only be used to invest in high quality apprenticeships. We want levy funds to be used to help more people to get on the path to a rewarding career and to support employers to take on new apprentices."
        },
        {
            "text": "The apprenticeship levy funds almost 650 different types of apprenticeships to train people for a huge variety of jobs. Whether funds are spent on degree apprenticeships in engineering, or GCSE-equivalent apprenticeships in social care work, the levy creates flexibility and choice in how employers provide apprenticeships."
        },
        {
            "heading": 3,
            "text": "What can’t the levy be used for?"
        },
        {
            "text": "Levy funds can only be used to pay for apprentices to achieve qualifications that are set out in their approved apprenticeship training programme and are deemed necessary to being effective in the job, such as a degree or a diploma. Businesses large and small offer apprenticeships in a wide range of exciting roles and at all levels right up to degree level."
        },
        {
            "text": "Levy funds can’t be used to pay apprentice wages, for ‘top-up’ qualifications, or qualifications that are not already approved as part of the apprenticeship."
        },
        {
            "text": "For example, levy funds can’t be used to pay for apprentices who are on the Level 7 senior leader apprenticeship to do their Master of Business Administration (MBA). MBAs are not a mandatory part of any apprenticeship. However, the apprentice or their employer is free to pay extra from their own funds for the MBA qualification."
        },
        {
            "heading": 3,
            "text": "What are you doing to get more young people into apprenticeships?"
        },
        {
            "text": "Young people under the age of 25 make up more than half of all apprenticeship starts and 70% of all starts are at Level 2 and 3."
        },
        {
            "text": "To support even more businesses to offer apprenticeships to young people:"
        },
        {
            "text": "To make it easier for young people to find apprenticeships, they will soon be able to use UCAS to search and apply for apprenticeships, alongside degrees. We’re also continuing to promote apprenticeships in schools and colleges through our Apprenticeship Support & Knowledge programme (ASK) – so far, over 2 million students have received support from ASK."
        },
        {
            "text": "Our ‘Get the Jump’ campaign also aims to raise awareness and understanding of all the different education and training pathways open at post-16 and post-18, including apprenticeships."
        },
        {
            "heading": 3,
            "text": "Find out more:"
        },
        {
            "text": "For more information on becoming an apprentice, visit this link."
        },
        {
            "text": "For employers looking to find out more about the levy, visit this page."
        }
    ]
}