{
    "url": "https://charitycommission.blog.gov.uk/2023/03/10/migration-and-refugee-crisis-charities-can-model-a-better-kind-of-discourse/",
    "title": "Migration and refugee crisis: charities can model a better kind of discourse",
    "authors": [
        "Orlando Fraser KC"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-10T09:51:01+00:00",
    "content": [
        {
            "text": "One of the hallmarks of our free and democratic society is the space it grants individuals and organisations to speak out on behalf of those in need."
        },
        {
            "text": "Quite rightly, this role often falls to charities. Our charities have a long and proud history of changing hearts and minds, often leading the charge on progress and speaking uncomfortable truths to power."
        },
        {
            "text": "Over the centuries, this work by charities has made our society kinder, more cohesive, and more resilient."
        },
        {
            "text": "And when charities campaign, they do so with the law on their side. Legislation enshrines charities’ right to campaign to promote their charitable purposes, as does the Commission’s guidance."
        },
        {
            "text": "So long as I am Chair of the Charity Commission, I will stand up for the right of charities to lawfully campaign and indeed I have made a point of stressing this fact since taking on the role nearly a year ago. And I am still doing it now, even while some critics seek to question charities’ campaigning role in the refugee crisis."
        },
        {
            "text": "But charity leaders must for their own part remember that it is not their opinion that matters, but the cause they are entrusted with."
        },
        {
            "text": "Because while the law protects charities’ right to campaign and engage in political activity, it also puts important safeguards in place."
        },
        {
            "text": "This includes the requirement that all and any campaigning by a charity must further its purposes. It must be done in the interests of the charity’s cause and the people it was set up to help."
        },
        {
            "text": "And so, as a new debate rages about how best to tackle the worldwide migrant crisis, and charities enter that fray, this will only intensify as we approach a general election.  Charity leaders must remember their responsibilities and avoid inflammatory rhetoric that may undermine public trust in the sector."
        },
        {
            "text": "Charities have an opportunity here – and I would say a responsibility – to model a better kind of public discourse. It is on us as a sector to work to reduce the heated frenzy of aggressive debates on public policy. Just as it is on decision-makers to do the same."
        },
        {
            "text": "When charities respond in combative terms to government proposals and language, even those that they feel strongly about, they risk achieving the opposite of what they are setting out to do - namely to change the minds of those who think differently - and instead harden attitudes against the causes they hold dear."
        },
        {
            "text": "So I will not tire of calling on charity leaders to use their voice with kindness, respect and tolerance – and with the wisdom that to win people over, they need to walk towards them, not push them away. As I have said before, Joe Biden led his presidency with the words: “Hear one another. See one another. Show respect to one another. Politics need not be a raging fire destroying everything in its path. Every disagreement doesn’t have to be a cause for total war… we have to be different than this.”"
        },
        {
            "text": "So, just as the Commission is seeking to balance the need to support charities’ political campaigning, with the need to enforce the rules around political campaigning, so I call on campaigning charities to balance their desires to campaign strongly on an issue, with the need to do so in a responsible and measured fashion."
        }
    ]
}