{
    "url": "https://apprenticeships.blog.gov.uk/2023/03/10/national-careers-week-accounting-pathway-apprentices/",
    "title": "National Careers Week: accounting pathway apprentices",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices",
        "Apprenticeship standards",
        "National Careers Week"
    ],
    "pub_date": "2023-03-10T10:11:12+00:00",
    "content": [
        {
            "text": "6th-11th March is National Careers Week. The week is a celebration of careers guidance and free resources in education across the UK."
        },
        {
            "text": "Apprenticeships are one way to kickstart a career, including in the legal, finance and accounting route. There are options for whatever stage you are at of a career, from finance assistant to internal audit professional."
        },
        {
            "text": "Hear from three payroll administrator apprentices on why they chose an apprenticeship, and what it's taught them so far."
        },
        {
            "heading": 2,
            "text": "Lucy, payroll administrator apprentice at London Borough of Enfield"
        },
        {
            "heading": 3,
            "text": "Why did you choose an apprenticeship?"
        },
        {
            "text": "I have been working in payroll for 10 years, and in that time I have learnt that you never stop learning, especially when it comes to payroll! Things are constantly changing and developing so I wanted to enhance my skills and develop my knowledge by doing an apprenticeship."
        },
        {
            "heading": 3,
            "text": "What skills do you think you have developed since becoming an apprentice? "
        },
        {
            "text": "The apprenticeship has given me confidence in my role and has allowed me to understand payroll legislation in a whole new light, and in a much more in-depth way."
        },
        {
            "text": "I have learnt so much about the world of payroll and now use this in my everyday role at work, to ensure I am a reliable and efficient payroll officer. This will also help me to progress in my future career."
        },
        {
            "heading": 2,
            "text": "Dieny, payroll administrator apprentice at AS Robins"
        },
        {
            "heading": 3,
            "text": "Why did you choose an apprenticeship?"
        },
        {
            "text": "I thought after leaving secondary school I had left maths behind. After years of having an interest in payroll but never pursuing it, I do not think there would have been a better way to do it than through an apprenticeship. It has been a great journey so far."
        },
        {
            "heading": 3,
            "text": "What skills do you think you have developed since becoming an apprentice?"
        },
        {
            "text": "The apprenticeship has helped me so much. I feel confident in an area I did not know if I would excel in. It has been so beneficial and I am constantly learning."
        },
        {
            "text": "I would tell anyone to do the apprenticeship if you have not worked in the industry before. It takes you through all the background. It is fulfilling and satisfying and what I believe a skill for life."
        },
        {
            "heading": 2,
            "text": "Kerri, payroll administrator at Aviva"
        },
        {
            "heading": 3,
            "text": "Why did you choose an apprenticeship?"
        },
        {
            "text": "I chose an apprenticeship as I am looking to progress my career to the next level.  I knew Aviva would support my learning and development whilst working alongside in my current role and that this would give me opportunities to learn and apply my knowledge in real time.."
        },
        {
            "text": "An apprenticeship builds professional relationships and networks within the workplace and enables you to interact and collaborate with others while teaching you to gain the skills in a real working environment."
        },
        {
            "heading": 3,
            "text": "What skills do you think you have developed since becoming an apprentice?"
        },
        {
            "text": "During my course I have gained confidence to lead and teach what I have learnt by giving presentations and leading training sessions."
        },
        {
            "text": "An apprenticeship builds professional relationships and networks within the workplace and enables you to interact and collaborate with others while teaching you in a real working environment."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}