{
    "url": "https://mhrainspectorate.blog.gov.uk/2023/03/10/reflections-on-the-shared-commitment-to-public-involvement/",
    "title": "Reflections on the shared commitment to public involvement",
    "authors": [
        "Caroline Barker-Hurden"
    ],
    "categories": [
        "Public involvement"
    ],
    "pub_date": "2023-03-10T08:06:19+00:00",
    "content": [
        {
            "text": "I remember first hearing about the shared commitment to public involvement when it was announced. I was working in a research department of a hospital, experiencing first-hand how people’s lived experience could drive more inclusive and meaningful health and social care research."
        },
        {
            "text": "Funders, regulators, and research organisations had come together to share a powerful message with the research community. Public involvement is important, expected, and possible in all types of health and social care research. This felt big."
        },
        {
            "text": "One year on, I am now working at the Medicines and Healthcare Regulatory Authority (MHRA). The shared commitment aligns well with our agency’s ambition to put patients first and is supporting us to deliver against our Patient Involvement Strategy."
        },
        {
            "text": "We have been involving patients in the Innovative Licensing Access Pathway. This pathway aims to reduce the time it takes for new medicines to be brought to market. This will give patients faster access. Patients are involved in the Steering Group (part of the governance structure). This group reviews applications from medicine developers to access the pathway. Patients’ valuable expertise and insight helps with the decision on whether to accept an application to the pathway."
        },
        {
            "text": "As a regulator, we have an important role to play to influence the research landscape. In the Innovative Licensing Access Pathway, we share the patient insights back to the medicine developer, so they can use these insights in their work. We encourage the developer to engage with a wider range of patient groups for diverse input, and to consider Patient Reported Outcomes and other measures to ensure the medicines in development offer the best outcomes for patients."
        },
        {
            "text": "We are not just committed to public involvement in research, but also across the regulatory pathway. One example is when a Hormone Replacement Therapy (HRT) was reclassified from a prescription-only medicine to pharmacy medicine, giving people experiencing menopause better access to treatment. A key factor in the reclassification process was focussing on issues that matter to patients, and over 1000 members of the public gave their views during our consultation."
        },
        {
            "text": "We have made changes to how we run our consultations, to support more people to respond. These are working well – the response to the HRT was the highest response we have ever received to a public consultation (the previous highest was 251). Small changes, such as how we promote our consultations to relevant audiences, so the right people know about it, are having an important impact."
        },
        {
            "text": "These steps create a good foundation, but we know we have much more to do to ensure the patient voice is embedded across the regulatory pathway. My personal commitment is to prioritise diversity and inclusion within our patient involvement, to support equity within health and care."
        },
        {
            "text": "I would like to say thanks to each member of the public, patients and patient groups who have contribute their lived experience to our work."
        }
    ]
}