{
    "url": "https://ukhsa.blog.gov.uk/2023/03/10/science-partnerships-can-secure-health-and-prosperity/",
    "title": "Science partnerships can secure health and prosperity",
    "authors": [
        "Isabel Oliver"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-03-10T10:12:39+01:00",
    "content": [
        {
            "text": "This year’s British Science Week theme is “connections” and throughout the week we’re highlighting how UKHSA science is carried out in partnership with a wide range of organisations. In this blog UKHSA Chief Scientific Officer Isabel Oliver looks at how these partnerships can benefit both health and society.  "
        },
        {
            "text": "When it comes to protecting health through science, partnerships matter."
        },
        {
            "text": "Over many years UKHSA and its predecessor agencies have worked hand in hand with universities, local and national government, the NHS, industry and international agencies to keep the public safe."
        },
        {
            "text": "But the emergence of COVID-19 - the most significant health threat the world has seen for a century - changed the way we think about collaboration."
        },
        {
            "text": "We witnessed great damage to lives and livelihoods around the world, but we also saw the art of the possible when governments, industry and academia worked at pace to translate science into public health action."
        },
        {
            "text": "Now the task for all of us is to maintain that momentum and spirit of collaboration."
        },
        {
            "text": "This means working in partnership with industry, universities and public sector research organisations to tackle the threats we face from new and emerging infectious diseases, the health risks posed by climate change through to the growing menace of antimicrobial resistance."
        },
        {
            "heading": 2,
            "text": "Science partnerships secure health and wealth"
        },
        {
            "text": "It has always been known that health is necessary for a prosperous society, but we now have a greater understanding than ever that as well as saving lives, protecting people from health threats keeps society moving and reduces pressure on vital public services like the NHS."
        },
        {
            "text": "Scientific advances will make a major contribution to our ability to detect threats earlier and control them, reducing their impact and saving more lives."
        },
        {
            "text": "Science also drives innovation making an important contribution to our nation’s prosperity."
        },
        {
            "text": "We are proud of the reach and impact of UKHSA science, but we are ambitious to play a greater role than ever in life sciences, nationally and internationally, and we will do this through the development of longer-term strategic partnerships with academia, industry, the NHS and fellow public sector research establishments."
        },
        {
            "text": "Partnership profile – Health Protection Research Units"
        },
        {
            "text": "One of UKHSA’s most important collaborations is our work with NIHR HPRUs; partnerships between UKHSA and universities, funded to support UKHSA in delivering its health protection functions. There are currently 15 HPRUs covering 13 topic areas, across 9 leading universities and other collaborators, building the evidence base to address some of our most pressing public health priorities."
        },
        {
            "text": "One of UKHSA’s most compelling offers to partners is the breadth of our expertise, combining science and unparalleled data with policy and operational response."
        },
        {
            "text": "In fact, some of our expertise and facilities are unique in this country."
        },
        {
            "text": "This includes our high containment facilities handling the world’s most dangerous pathogens or our end-to-end vaccine capability, with an ability to research the vaccine needs of the future, evaluate the safety and effectiveness of emerging vaccines, and once rolled-out, assess how vaccines are working in the community to inform policy on how to best procure and deploy them."
        },
        {
            "text": "Many people know UKHSA as an organisation that’s been heavily involved in the COVID-19 response, but our science spans from genomics and medical entomology through to radiation protection and toxicology."
        },
        {
            "text": "Crucially we pride ourselves on science for action. Because of all of our scientific work is focussed on protecting health, and through our links with national and local governments and the NHS, we ensure the evidence we generate informs policy and practice."
        },
        {
            "text": "So as I speak to colleagues across a wide range of sectors, the message I’m repeating is that UKHSA is very much open for business. We have a renewed commitment to seeking out partnerships that generate real impact for our nation’s health and prosperity."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "The challenge ahead of us is daunting but also exciting."
        },
        {
            "text": "Daunting because we know that we are operating in a context where our climate is changing and will bring a wide range of threats to our health including a growing risk of future pandemics."
        },
        {
            "text": "We also know that environmental hazards and antimicrobial resistance will have a profound impact on health and society."
        },
        {
            "text": "But exciting victories are within our grasp too, such as pushing towards measles, polio, hepatitis C and HIV elimination targets and the many opportunities to support the Government ambition for the UK to be a science superpower."
        },
        {
            "text": "I can’t emphasise enough that these challenges and opportunities can only be tackled and exploited by linking with others, whether that’s the quiet work we do every day to keep people safe working with colleagues in local government and the NHS through to major international initiatives such as the 100 Days Mission."
        },
        {
            "text": "As a new agency, we are keen to set out our long-term vision, so over the last year we have been developing a 10-year science strategy for UKHSA which will provide much more detail on our ambitions and capabilities and reinforce the importance of collaboration. Please look out for its publication very soon."
        },
        {
            "text": "I look forward to working with you to drive this agenda forward and protect more lives and livelihoods."
        }
    ]
}