{
    "url": "https://socialcareinspection.blog.gov.uk/2023/03/10/secure-training-centres-introducing-assurance-inspections/",
    "title": "Secure training centres – introducing assurance inspections",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "inspectors",
        "secure training centres"
    ],
    "pub_date": "2023-03-10T10:00:41+00:00",
    "content": [
        {
            "text": "From April 2023, we will be carrying out annual assurance inspections of secure training centres (STCs). These will be in addition to the full annual inspections we do with Care Quality Commission and His Majesty's Inspectorate of Prisons."
        },
        {
            "text": "Since 2016, our full inspections have shown that STCs do not provide the quality of care that we expect for children. In some cases, children were at risk of harm. This is simply not good enough for some of the most vulnerable children in our society."
        },
        {
            "text": "That is why we are introducing more frequent inspections."
        },
        {
            "text": "In a recent targeted consultation, stakeholders overwhelmingly agreed with our proposals because they share our concern about children who live in STCs and support more external scrutiny."
        },
        {
            "text": "What assurance inspections are and what they will they look like"
        },
        {
            "text": "Assurance inspections will be shorter than full inspections. They will focus on:"
        },
        {
            "text": "They will be a part of the joint inspection framework for STCs but will not replace or replicate full inspections."
        },
        {
            "text": "The inspection reports will state whether the quality of children’s experiences is improving or deteriorating. And they will say what action STCs must take to improve."
        },
        {
            "text": "Assurance inspections will be unannounced. This is because children told us that this is what they want. In previous consultations children told us they want inspectors to see places as they are day-to-day."
        },
        {
            "text": "The oversight of the experiences of children who live in secure provision is, rightly, high on our agenda. Introducing assurance inspections to STCs, as we have already done in secure children’s homes, is the right thing to do and will give us a better line of sight to children’s day-to-day lives."
        },
        {
            "text": "We will re-publish the Inspecting secure training centres framework on 5 April 2023. This will include full details about the new assurance inspections for STCs."
        }
    ]
}