{
    "url": "https://beisdigital.blog.gov.uk/2023/03/10/the-art-of-applying-to-the-civil-service/",
    "title": "The art of applying to the Civil Service",
    "authors": [
        "Enrico D’Annunzio"
    ],
    "categories": [
        "People and skills"
    ],
    "pub_date": "2023-03-10T15:27:23+00:00",
    "content": [
        {
            "text": "BEIS is changing, find out how by reading about the work in the 3 new departments. We'll continue using this blog for updates on our digital work for now. "
        },
        {
            "text": "Hello, I am Enrico D’Annunzio (he/him) the People and Development lead here in our Digital team."
        },
        {
            "text": "As you may have seen in the news, BEIS is splitting up. Alongside the new-look Department for Business and Trade, we’re also creating two new departments: the Department for Energy Security and Net Zero, and the Department for Science, Innovation and Technology."
        },
        {
            "text": "All BEIS Digital’s work is continuing, and there’s going to be a lot of demand for digital skills in the new departments."
        },
        {
            "text": "I’m going share with you some of my tips on how to apply for a job in the Civil Service, hopefully helping you apply for some of the fantastic opportunities we have available."
        },
        {
            "heading": 1,
            "text": "Joining the Civil Service"
        },
        {
            "text": "I am relatively new to the Civil Service, joining in 2021 after working as an agency recruiter in the private sector. When I began applying for roles in the Civil Service I was fascinated by the process and how it differed from the countless companies I had recruited for."
        },
        {
            "text": "The Civil Service recruits using a process called Success Profiles. This is just a different way of looking at candidates that means we can assess your application with a wider lens. It takes your transferable skills into account, rather than just your direct work experience."
        },
        {
            "text": "Transferable skills for digital roles can be assessed through looking at things such as what you do at work, your abilities and potential abilities, and your strengths."
        },
        {
            "heading": 1,
            "text": "The Digital, Data and Technology profession "
        },
        {
            "text": "Roles that are part of the Digital, Data and Technology (DDaT) profession in the Civil Service have a defined set of skills outlined by the DDaT Profession Capability Framework."
        },
        {
            "text": "Roles on the framework will have a list of skills needed to work in each role and a brief description of what they mean. We are transparent about the skills required for each role so you can be confident that you are applying for a job that matches your skills."
        },
        {
            "text": "For example, a Data Analyst will require the skill of data management – understanding data sources, data organisation and data storage. You can see how the same role uses the same skills at different levels at https://www.gov.uk/guidance/data-analyst."
        },
        {
            "heading": 1,
            "text": "Tips on applying for a digital job"
        },
        {
            "heading": 2,
            "text": "1) Keep a bank of examples"
        },
        {
            "text": "I have a section at the back of my note pad where I jot down things I do at work that make me think “this would be a great interview example”."
        },
        {
            "text": "We have all been there when we are writing a job application or sitting in an interview and struggle to think of a good example - even though we know we have done this task hundreds or even thousands of times!"
        },
        {
            "text": "Keeping a log of these is a fail-safe way to look back and reflect on the good work you have done, and then pick the best examples for your application or interview."
        },
        {
            "text": "You can look at skills required for your role in the DDaT framework and use these skills as the skeleton for your example bank."
        },
        {
            "heading": 2,
            "text": "2) Personal statement"
        },
        {
            "text": "Most of our applications will require a personal statement. You might also see it called a cover letter or suitability statement."
        },
        {
            "text": "When writing a statement, tailor it to the role you are applying for. The best way to tailor your statement is to address each essential skill outlined on the job advertisement and let us know how your transferable skills and/or experience make you the right person for the role."
        },
        {
            "text": "Check the key skills for your role in the DDaT framework looping in key skills noted on the framework for your role into your statement."
        },
        {
            "text": "I have read many amazing personal statements during my time as a recruiter, I love to hear all about the amazing skills and experience people have. However, personal statements that are curated and address the skills outlined on the job advert stand out."
        },
        {
            "heading": 2,
            "text": "3) Essential skills"
        },
        {
            "text": "When looking at a job advert or writing a personal statement or CV you should always look through the essential skills and explain how you can demonstrate these."
        },
        {
            "text": "It might surprise you that a role maybe two grades above you can be a great match based on essential skills. This has happened to me before - it was great to be assessed on my skills rather than my “time in role”."
        },
        {
            "heading": 2,
            "text": "4) STAR method"
        },
        {
            "text": "The STAR method is a way of structuring the examples you give at interview. It stands for Situation, Tasks, Action and Results."
        },
        {
            "text": "It’s a fantastic way to articulate an example in a clear and concise way allowing those on the interview panel to easily mark how you have addressed the question."
        },
        {
            "text": "Read more information on the STAR method and how to answer interview questions."
        },
        {
            "text": "All the best for your future applications and please keep an eye on our LinkedIn page for candidate application sessions we run virtually!"
        },
        {
            "text": "These sessions cover what we have noted above in more detail and give you the opportunity to ask any questions you may have about the application process."
        }
    ]
}