{
    "url": "https://environmentagency.blog.gov.uk/2023/03/10/working-to-reduce-pollution-from-farming/",
    "title": "Working to reduce pollution from farming",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-03-10T10:29:40+00:00",
    "content": [
        {
            "text": "By Nicola Riley, National Agriculture Manager"
        },
        {
            "text": "Regulating agriculture sector"
        },
        {
            "text": "It probably won’t have escaped anyone’s notice that the effects of pollution on water quality are very topical at the moment – and rightly so. The health of England’s rivers and waterways are critical to improving the natural environment for people and wildlife and the Environment Agency’s staff work every day, around the clock, to protect it."
        },
        {
            "text": "Pollution to water comes from many sources, the main ones being water companies, urban run-off and agriculture. Farming and agriculture are essential to this country for food production, the economy, and the livelihoods of thousands of people. But to ensure it is sustainable we need to ensure the land and water is protected."
        },
        {
            "text": "Agriculture is the biggest sector the Environment Agency regulates in terms of individual businesses, with around 100,000 premises covering 70% of the land in England. Farmers must juggle multiple technical, competing demands. It can be a heavy load, but the Environment Agency is helping in several ways."
        },
        {
            "text": "More boots on the ground"
        },
        {
            "text": "New post-Brexit farming policies will incentivise farmers to work with us to enhance watercourses on their land. With Natural England and Defra, we are providing free advice to farmers on how to manage sources of water pollution through the Catchment Sensitive Farming Programme – more on this later."
        },
        {
            "text": "And last year, we received a share of national Government funding to carry out advice-led regulation on farms to drive improved standards in agriculture and tackle pollution. So far, we’ve recruited and trained 84 new Agricultural Regulatory Inspection Officers to carry out advice-led regulation on farms. They complement our existing Land and Water officers who already regulate agriculture."
        },
        {
            "text": "The new officers were recruited mainly from agricultural backgrounds, as the ability to communicate with farmers and an understanding of farm businesses is critical to the team’s success in making a difference to the environment. We’ve seen this through the success of the River Axe project which has helped farmers to operate sustainably, protect and enhance the environment whilst increasing their profitability."
        },
        {
            "text": "The new officers work in assigned river catchments where they engage, inspect, advise and if necessary enforce the Silage, Slurry and Agricultural Fuel Oil regulations and Farming Rules for Water."
        },
        {
            "text": "Since April 2021, we have undertaken 4,815 inspections and requested 6,169 improvement actions on farm, with 2,791 having already been completed. We aim to perform more than 4,000 site inspections per year, checking and advising on regulatory matters, including nutrient, slurry, and manure management; ammonia emission reduction; farm infrastructure and machinery set-up; and pesticide handling."
        },
        {
            "text": "Targeted approach"
        },
        {
            "text": "We focus on high-risk locations, previously non-compliant businesses, and those farming sectors of greatest concern."
        },
        {
            "text": "We work with farmers providing advice and guidance, reflecting individual circumstances, and taking a proportionate approach based on risk to the environment."
        },
        {
            "text": "If advice is not heeded, we will pursue whatever sanctions are necessary – including penalties, formal cautions or prosecutions. We are currently taking enforcement action against 140 farms."
        },
        {
            "text": "Range of enforcement measures"
        },
        {
            "text": "We use farm inspections as part of a range of enforcement measures which can include regular audits, remote sensing, targeted campaigns and permitting approaches to ensure compliance with England’s water regulations."
        },
        {
            "text": "The government has also almost doubled the funding available (to £15 million) to help farmers tackle water pollution via the Catchment Sensitive Farming programme – a partnership between Defra, Natural England and the Environment Agency which provides free 1-2-1 advice to farmers to help them reduce pollution through management of farmyard manure and soils."
        },
        {
            "text": "The government’s Environmental Improvement Plan (published in February 2023) sets out how it will restore nature, reduce environmental pollution, and increase the prosperity of our country."
        },
        {
            "text": "It outlines the ‘Polluter Pays Principle’ which will provide a more stable funding base for the Environment Agency as an environmental regulator. The additional funding of £1.3m per year up to 2025 will allow us to continue to pilot methods to improve farmer compliance and environmental outcomes through the Testing Approaches to the Regulation of Agriculture project."
        },
        {
            "text": "Ensuring clean and plentiful water is one of the biggest challenges we face, and delivering it is one of the biggest gifts we can give to future generations. We are proud of the work we do, which is complex and challenging and requires investment from everyone. It’s a priority for the Environment Agency and government - and needs to be for everyone else, too."
        },
        {
            "text": "Call to Action: Follow the Environment Agency on Twitter, and sign up for email alerts."
        },
        {
            "text": " "
        }
    ]
}