{
    "url": "https://digitalpeople.blog.gov.uk/2024/02/23/2023-summer-interns-creating-a-new-brand/",
    "title": "2023 summer interns - creating a new brand",
    "authors": [
        "Thea Day, Summer Intern, CDDO"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Government Digital and Data",
        "Graduate schemes and Fast Stream"
    ],
    "pub_date": "2024-02-23T06:00:59+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "I joined the Central Digital and Data Office (CDDO) as an intern in the Communications team this summer. I was surprised when I found out I had been placed in CDDO as I had studied languages at university and had no background in digital or data. However, I quickly realised people in CDDO are not just techy people but people from all backgrounds. Working in the Communications team has allowed me to gain an insight into different teams in CDDO and wider projects across government. "
        },
        {
            "heading": 3,
            "text": "A new brand identity"
        },
        {
            "text": "My team has encouraged me to really get involved and take on responsibility both in internal and external communications. I’ve enjoyed taking a lead on the internal weekly CDDO newsletter by commissioning, collating and editing content and highlighting the exciting projects going on. "
        },
        {
            "text": "I have also had the chance to work on a project to create a new brand - Government Digital and Data for the function and profession with the  aim to increase the sense of community, drive recruitment and combat stereotypes about working in government. I have helped quantify and analyse survey results on the new brand. I also helped to review the implications and challenges of introducing a new brand across multiple government departments. The most exciting part of the project I have taken on is organising a photoshoot to create assets for the brand, sourcing participants from different departments and helping to create a photography brief. I cannot wait to see the results!"
        },
        {
            "heading": 3,
            "text": "Conclusion"
        },
        {
            "text": "This internship has been the perfect opportunity to get an insight into the type of work civil servants do and the structures within government which can seem very complicated at first! I have also greatly benefitted from centrally organised internship events about the Fast Stream selection process which will enable me to apply with confidence. I was even lucky enough to get a tour of Whitehall and a picture outside Number 10. "
        },
        {
            "text": "The work culture and flexibility at CDDO has really stood out to me with a strong focus on wellbeing and a very active People and Culture Committee. Everyone has been so welcoming and open to sharing their experiences and advice!"
        }
    ]
}