{
    "url": "https://environmentagency.blog.gov.uk/2024/02/23/bathing-water-classifications-and-short-term-pollution/",
    "title": "Bathing water classifications and short-term pollution",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Cleaner Seas",
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-02-23T11:45:33+00:00",
    "content": [
        {
            "text": "Our blog on 1 February explained how we approach monitoring, sampling and testing of bathing waters and our approach to keeping public informed and warned when there are short term risks of pollution which bathers would rightly want to be alerted to."
        },
        {
            "text": "A bit of history"
        },
        {
            "text": "The concept of managing areas of water for the protection of bathers’ health was introduced by one of the first European Directives in 1976. At the time, classifying bathing water quality was a pass or fail against the standards. In 2006, based on World Health Organisation (WHO) recommendations, a revised Bathing Water Directive introduced the classifications of Excellent, Good, Sufficient or Poor. These classifications were first made in England in 2015 and are what we use today."
        },
        {
            "text": "An annual report is produced each year listing the classifications based on a long-term assessment of water quality over a four-year period with samples being taken at each bathing water site during the bathing water season, between May and September each year."
        },
        {
            "text": "The classifications have many uses including showing trends, allowing comparisons of water quality between bathing waters and also informing decisions on long-term pollution reduction measures.  They give an overall indication that helps people make a choice on which bathing water to visit.  Most sites are sampled weekly and the cleanest have fortnightly sampling. For more information on sampling, read more on this blog."
        },
        {
            "text": "Pollution risk forecasting"
        },
        {
            "text": "WHO also recommended that bathers should be able to easily access a warning system so they know when there is expected to be a reduction in water quality caused by Short-Term Pollution (STP) events. To deliver our regulatory duty in relation to short term pollution, we have developed a Pollution Risk Forecasting (PRF) system. The Environment Agency uses weather and tidal data and other sources of information to make pollution risk forecasts to work out when bathing water quality might be temporarily reduced due to factors such as the weather. When the forecasts highlight an increased risk of reduced water quality, pollution risk warnings will be issued and advice against bathing is displayed on Swimfo – the online tool that allows you to look up details of a designated bathing water by name or location – and on signs at the beach."
        },
        {
            "text": "This system does not specifically make predictions of sewage pollution – the predictions include bacteria from all sources - instead it forecasts expected variations in water quality due to the measurable effects of rain, wind tide, sunlight and time."
        },
        {
            "text": "Daily forecasts of water quality allow bathers to make informed choices before going for a swim. Pollution risk forecasts are made at all bathing water sites where this is possible. Last year PRFs were made at 172 of the 424 designated sites."
        },
        {
            "text": "Why do we disregard some samples? "
        },
        {
            "text": "Bathing water quality is measured by sampling and analysing bacteria in the water, which is complex and changeable. WHO recommends that an overall bathing water classification should take into account where short term pollution warnings have been issued."
        },
        {
            "text": "Back to the legislation and regulation - in England, the Directive was transposed into the Bathing Water Regulations 2013. Under these Regulations, samples taken during a time where bathers have been advised against bathing may be disregarded from the overall classification."
        },
        {
            "text": "This is because a warning against swimming has been issued in advance and the conditions are not considered to be reflective of the actual water quality most people bathe in."
        },
        {
            "text": "We only do this where we have confirmed that bathers were actively warned through Local Authorities displaying dated signs at the beach."
        },
        {
            "text": "The Regulations specify up to 15% of samples may be disregarded, but in practice this rarely happens and last year about 3% of eligible samples were disregarded."
        },
        {
            "text": "All of our bathing water sampling data is made freely available via Swimfo in a transparent way. This includes those samples that were taken during a pollution risk warning, together with a flag of whether this was later disregarded from classification or not."
        },
        {
            "text": "From the wide range of data available, it has always been possible to calculate classifications in different ways including what they would have been if samples disregarded under STP were included."
        },
        {
            "text": "While the data is available to all, for ease of access and following recent media interest, we have produced a summary of bathing water classifications which includes samples disregarded under STP which can be downloaded."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}