{
    "url": "https://companieshouse.blog.gov.uk/2024/02/23/build-your-career-at-companies-house/",
    "title": "Build your career at Companies House",
    "authors": [
        "Katie Jones - Recruitment Manager"
    ],
    "categories": [
        "Working at Companies House"
    ],
    "pub_date": "2024-02-23T12:02:57+00:00",
    "content": [
        {
            "text": "Have you ever wondered what it's like to work for Companies House, and what kind of career you could build here? To help, we've created our new careers hub so you can find all this information in one place."
        },
        {
            "heading": 2,
            "text": "Introducing our new careers hub"
        },
        {
            "text": "Our careers hub will give you an idea of the culture and working environment in our Cardiff office, plus the additional benefits you’ll receive as part of your contract. This includes a generous pension contribution and flexible working."
        },
        {
            "text": "You can also find out more about our brilliant people and networks. Our networks offer opportunities to meet like-minded people in a supportive and friendly environment, giving you the chance to raise and talk about issues important to you. Making sure everyone can bring their full authentic selves to work is a key part of our equality, diversity and inclusion (EDI) strategy."
        },
        {
            "heading": 2,
            "text": "What to look out for on our careers hub"
        },
        {
            "text": "We have several directorates (departments) at Companies House, and each one focuses on a different area of the business. The careers hub provides more detail on the careers and roles available in each directorate, as well as helping you find where your skills best fit."
        },
        {
            "text": "You can visit Civil Service Jobs to see the vacancies we currently have. We've got lots of roles across the organisation coming up, so watch this space!"
        },
        {
            "text": "We’re working on big legislative changes at Companies House, with lots of innovative and wide-reaching projects underway. So it’s an exciting time to join us. You could be contributing to initiatives that positively affect the lives of thousands of people. We’re a friendly, supportive organisation where work-life balance is prioritised, but with challenging and fulfilling work."
        },
        {
            "text": "Building your career with us means starting a journey where you can be part of something bigger."
        },
        {
            "heading": 2,
            "text": "Our top tips for applying for a role at Companies House"
        },
        {
            "text": "Have you seen a job you’d like to apply for but not quite sure where to start with your application?"
        },
        {
            "text": "For those that are new to the Civil Service, the application and interview process can be a little daunting. On our careers hub you’ll find:"
        },
        {
            "text": "We want to make sure that applicants know they can be themselves right from the start of their Companies House journey."
        },
        {
            "heading": 2,
            "text": "The value of collaborative working at Companies House"
        },
        {
            "text": "We really believe in the value of working collaboratively across teams to produce excellent work. Our careers hub is a great example of this, with multiple teams and one brilliant intern using their collective skills and experience to deliver a much-needed product."
        },
        {
            "text": "A job at Companies House is a gateway to a diverse and exciting career in the Civil Service. There are a range of internal and external job and development opportunities available to give you the chance to shape your career path on your terms."
        }
    ]
}