{
    "url": "https://space.blog.gov.uk/2024/02/23/celebrating-three-years-of-the-uk-australia-space-bridge/",
    "title": "Celebrating three years of the UK-Australia Space Bridge",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2024-02-23T11:09:49+00:00",
    "content": [
        {
            "text": "The UK and Australia have a longstanding relationship when it comes to space, from the Black Arrow rocket launches from Woomera in the late 1960s, to the signing of the UK-Australia Space Bridge framework agreement half a century later."
        },
        {
            "text": "Today (23rd February 2024) marks another milestone as we celebrate the third anniversary of the UK-Australia Space Bridge."
        },
        {
            "text": "A world first, the Space Bridge is a framework that aims to strengthen the relationship between the UK and Australian space sectors by opening doors, starting conversations, and uniting over shared goals."
        },
        {
            "text": "Supported by the UK Space Agency, Department for Business and Trade (DBT), Australian Space Agency and Austrade, the Space Bridge Framework focuses on areas such as:"
        },
        {
            "text": "Since the framework was signed, it has increased engagement and significantly improved access for public and private stakeholders across both space sectors. As the Space Bridge enters its fourth year, this is an apt opportunity to look back at the successes it has generated so far, including:"
        },
        {
            "text": "The most recent highlight was UK Space Agency colleagues joining DBT’s trade mission to Australia in December 2023, where they attended the 16th Australian Space Forum - with UK Space Agency CEO Dr Paul Bate delivering an international keynote speech - and travelled across states to engage with the Australian space sector; sharing ideas and identifying new opportunities to work together."
        },
        {
            "text": "Reflecting on the achievements of the Space Bridge, Dr Paul Bate said:"
        },
        {
            "text": "Head of the Australian Space Agency, Enrico Palermo, says the partnership supports space sector growth in applications that positively impact our planet:"
        },
        {
            "text": "On today’s occasion of celebrating this historic agreement, we are excited to launch our joint ‘Soft Landing Zones’ guide, which provides more information on hubs and clusters to individuals and companies that are exploring working in the UK or Australia and look forward to working closely our Australian counterparts on further collaboration."
        },
        {
            "text": "Email spacebridgeuk-au@austrade.gov.au for more information."
        }
    ]
}