{
    "url": "https://defradigital.blog.gov.uk/2024/02/23/its-never-too-late-for-user-research/",
    "title": "It’s never too late for user research",
    "authors": [
        "Rob Finch"
    ],
    "categories": [
        "User research"
    ],
    "pub_date": "2024-02-23T07:30:12+00:00",
    "content": [
        {
            "text": "Content designer Rob Finch and his team reflect on how bringing in user research can be beneficial at any stage of a project."
        },
        {
            "text": "We are the user-centred design (UCD) team for wildlife licensing at Natural England. Our service is in private beta."
        },
        {
            "text": "Our goal is to let people apply for any kind of wildlife licence through our service. We are currently working on one specific licence for badgers."
        },
        {
            "text": "We want to help ecologists get a licence that lets them affect badger’s homes (setts). Ecologists can be licensed to do this work - which prevents harm to the badgers - as part of a development project. These development projects can include building a new housing estate or railway line."
        },
        {
            "text": "Ecologists ensure the badgers’ welfare by, for example, stopping them from re-entering a sett that is scheduled for destruction, and building an artificial sett for them to move into."
        },
        {
            "text": "Ecologists are concerned about:"
        },
        {
            "text": "For it to grant a licence, Natural England needs to collect lots of information. For example, details of the badgers’ ecology within a site can be straightforward. But some licence applications will need a lot of complicated detail to describe how the badgers use the landscape and what’s being proposed to mitigate their disturbance during development."
        },
        {
            "text": "This means we can’t always ask direct, specific questions to prompt users to give us the information we need. Ultimately, users need to describe what they are doing or upload documents rather than enter data."
        },
        {
            "text": "The badgers’ ecology and whether the development will happen on protected land affect what information is needed. This means it’s"
        },
        {
            "heading": 2,
            "text": "Uncovering a research ‘debt’"
        },
        {
            "text": "Our 3 user researchers are recent arrivals on the team. They each needed to take time to understand the service’s complexity."
        },
        {
            "text": "Existing UCD team members appreciated the extra support from more researchers. Together we identified what we were working on that we didn’t fully understand from ecologists’ viewpoints."
        },
        {
            "text": "This is what we call our research ‘debt’."
        },
        {
            "heading": 2,
            "text": "Identifying risks and gaps in our knowledge"
        },
        {
            "text": "To better understand the service, the researchers highlighted the gaps in our knowledge on the team’s risk log."
        },
        {
            "text": "To address some of the risk they created a collaborative ‘knowledge board’. This board is where the whole service delivery team and subject matter experts can ask questions and share knowledge. This board has helped:"
        },
        {
            "text": "Where the team didn’t have evidence to support some of its design decisions, the researchers created a research roadmap. This helped get agreement within the team on the scope of UCD activity that met the \"minimum viable product” (MVP) scope and business needs."
        },
        {
            "heading": 2,
            "text": "Meeting the government Service Standard"
        },
        {
            "text": "At this point, the private beta assessment for our service was imminent. Identifying all our research issues - and addressing them - would take more time than we had. The team took the difficult decision to postpone the assessment, meaning we could take the necessary time to work on meeting the government Service Standard."
        },
        {
            "text": "Each research sprint has been intense. All 3 researchers have been working on the longer-term strategy as well as carrying out testing."
        },
        {
            "text": "We knew the team’s designers had followed the GDS design system and had used their experience to make simple journeys. But by observing usability testing, they were able to better understand the issues and more easily identify where improvements were needed."
        },
        {
            "text": "For example, our biggest risk has been to make users create a Defra account so that they can sign in to the service. Having a shared in-house solution like Defra account has benefits but we found some issues, such as:"
        },
        {
            "heading": 2,
            "text": "What is happening in the run up to the Service Standard assessment"
        },
        {
            "text": "We’re preparing for the beta assessment. It has been intense, but the team has really benefited from having more researchers. They have been able to sense-check and support each other’s work. It has also given them the space to share issues with and get support from the UCD community across Natural England services."
        },
        {
            "text": "We’re now prioritising our activities, including:"
        }
    ]
}