{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/23/preventing-the-spread-of-invasive-plants-from-your-garden/",
    "title": "Preventing the spread of invasive plants from your garden",
    "authors": [
        "Lucy Cornwell"
    ],
    "categories": [
        "Gardening",
        "Invasive species",
        "Nature",
        "plants"
    ],
    "pub_date": "2024-02-23T15:18:07+00:00",
    "content": [
        {
            "text": "Plants are vital for our health and the environment. They improve air quality, boost our mood, improve the UK’s resilience to climate change, and provide a home for wildlife.  "
        },
        {
            "text": "Many of the plants in our gardens and ponds are not native to Britain - they have been introduced from all over the world by people.  "
        },
        {
            "text": "While non-native plants can help us create beautiful ornamental displays to enjoy, if they spread beyond the garden some become invasive and harm the environment.  "
        },
        {
            "text": "Non-native plants in the wild in Great Britain  "
        },
        {
            "text": "In Britain and Ireland, non-native plants now outnumber native plants in the wild.  "
        },
        {
            "text": "Trying to remove problem plants from natural habitats, especially important nature conservation sites, is expensive and difficult. Often complete eradication is impossible, and millions of pounds are spent each year to limit their spread.  "
        },
        {
            "text": "The Great Britain Non-native Species Secretariat, part of Defra’s Animal & Plant Health Agency, is responsible for helping to coordinate the approach to invasive non-native species in Great Britain. "
        },
        {
            "text": "The Great Britain Invasive Non-native Species strategy sets out a series of ambitious objectives to guide government departments, their related bodies, and key stakeholders in delivering the most effective response to preventing, eradicating and managing invasive non-native species. "
        },
        {
            "text": "The impacts of invasive non-native plants  "
        },
        {
            "text": "Invasive non-native plants and animals are one of the top drivers of biodiversity loss and cost the economy over £2 billion a year. The impacts of invasive plants include:  "
        },
        {
            "text": "How gardeners can help: Be Plant Wise "
        },
        {
            "text": "Around 40% of the invasive non-native species that cause problems in Great Britain are likely to have been introduced through horticulture.  "
        },
        {
            "text": "Gardeners can help to prevent further problems by following the Be Plant Wise campaign guidance:  "
        },
        {
            "text": "Know what you grow - choose the right plants for your garden, pond, aquarium and water features. To help you do this, you should: "
        },
        {
            "text": "Stop the spread - keep your plants in your garden. Don't plant them or allow them to grow in the wild. Even native plants can cause a problem if they are planted in the wrong place. You should:  "
        },
        {
            "text": "Compost with care - make sure nothing you remove from your garden or pond gets into the wild, you could be breaking the law if it does. "
        },
        {
            "text": "Most plants can be composted to boost your soil or put in your garden waste bin (but remember to check first what your local council will accept). "
        },
        {
            "text": "Find out more about plants that can’t be composted at home and how to dispose of them. "
        },
        {
            "text": "Plants to use in place of invasive species "
        },
        {
            "text": "You can find over 160 plants to use in place of invasive species in this booklet developed by the GB Non-Native Species Secretariat and Coventry University. It includes plants for wildlife, trees, pond plants, climbers, architectural species, ground cover, and more. "
        },
        {
            "text": "Below are a few examples:  "
        },
        {
            "text": "White laceflower (Orlaya grandiflora) "
        },
        {
            "text": "A long-flowering branching annual, 45 to 75cm tall. It has fern-like leaves and white lacy flowers, hence its name. White laceflower is attractive to insects and provides shelter for wildlife.  "
        },
        {
            "text": "Common foxglove (Digitalis purpurea) "
        },
        {
            "text": "A UK native species that forms a neat rosette of hairy leaves in its first year, and graceful spikes of tubular rosy, purple flowers in its second year. It can reach up to 2m tall. Common foxglove is highly attractive to pollinators and provides shelter for wildlife.  "
        },
        {
            "text": "Wintersweet (Chimomanthus praecox) "
        },
        {
            "text": "A deciduous shrub that can grow up to 4 m tall, with long glossy leaves. Delicate fragrant greenish-yellow flowers grow on the bare twigs in winter. Wintersweet provides shelter for wildlife and food for birds. "
        },
        {
            "text": "Water moss (Fontinalis antipyretica)  "
        },
        {
            "text": "An attractive, evergreen slow-growing moss with pretty leaves that can help hide aquatic pumps in ponds. Useful for improving water quality, much liked by aquatic wildlife, and provides an excellent site for spawning fish. Thrives in sun and shade and prefers moving water and cooler conditions.  "
        },
        {
            "text": "Reporting invasive plants  "
        },
        {
            "text": "You can help prevent future invasions by reporting problem garden plants to the Plant Alert citizen science project. Your data will help scientists identify which species are likely to become a problem in the wild in the future. "
        },
        {
            "text": "If you think you’ve spotted an invasive plant in the wild, you can report it online via  iRecord.  "
        },
        {
            "text": "For more information on non-native species, visit the NNSS website. "
        },
        {
            "text": "To receive an email notification each time we publish a new post, please subscribe to our Environment blog. "
        }
    ]
}