{
    "url": "https://socialcareinspection.blog.gov.uk/2024/02/23/the-importance-of-good-planning-for-children-moving-on-from-the-secure-estate/",
    "title": "The importance of good planning for children moving on from the secure estate",
    "authors": [
        "Shaun Common"
    ],
    "categories": [
        "local authorities",
        "secure children's home",
        "secure estate",
        "secure training centres"
    ],
    "pub_date": "2024-02-23T09:30:11+00:00",
    "content": [
        {
            "text": "Effective planning for when children move on from secure provision is vital."
        },
        {
            "text": "Our role"
        },
        {
            "text": "The children’s secure estate is a very important part of Ofsted’s work."
        },
        {
            "text": "Within Ofsted’s remit there are 13 secure children’s homes (SCH) and one secure training centre (STC). As well as inspecting SCHs and the STC, we also support His Majesty’s Inspectorate of Prisons (HMI Prisons) inspections of young offender institutions."
        },
        {
            "text": "The importance of good provision"
        },
        {
            "text": "Proper planning for children moving on from secure provision is vital. This should start the moment a child arrives at a secure provision. It requires multi-disciplinary and multi-agency collaboration. And the child’s views and wishes must be central to the plan. The best providers work effectively to make this happen."
        },
        {
            "text": "Good services help children to:"
        },
        {
            "text": "Some local authority planning needs to improve"
        },
        {
            "text": "Secure estate staff can only do so much on their own. They have a lead role in bringing together the professionals that are key to planning for a child to move on successfully. But it is not within their gift to find the right next place for a child: one that can meet their needs and help with their next steps. That task sits with the responsible authority."
        },
        {
            "text": "Increasingly, and too often, we see poor planning by some responsible local authorities. They leave it too late to plan."
        },
        {
            "text": "When planning is not in place, providers are proactive and contact senior managers in placing authorities to escalate their concerns. Sometimes they contact Ofsted. This has become a worrying trend."
        },
        {
            "text": "The impact of poor planning"
        },
        {
            "text": "The consequences of poor planning for children are not always well understood."
        },
        {
            "text": "Imagine being a child and:"
        },
        {
            "text": "The control you have over your life is limited and you rely on others to help you."
        },
        {
            "text": "You are then told by your social worker or youth offending team worker that they do not know where you will be going when you leave the secure provision. As a result, you do not know where you will end up. This is a regular experience and it leaves children feeling frightened, helpless and anxious."
        },
        {
            "text": "Obviously, it’s important that staff in secure provision work with children to address the reasons for children’s liberty being restricted. But if moving-on plans aren’t in place, it can make the journey much harder. And it can lead children to do things they would not ordinarily do, like hurt themselves or others, in a desperate plea to stay in the secure setting where they feel safe, until they have a future plan that they feel will help them."
        },
        {
            "text": "Children deserve better"
        },
        {
            "text": "We have heard from some secure providers that responsible local authorities sometimes ask the courts to extend a child’s welfare order until they can find the child somewhere to move on to. It can’t be right that we continue to deprive children of their liberty any longer than the minimum necessary."
        },
        {
            "text": "This is not acceptable for some of the most vulnerable children in our society. All the good work done can be quickly undone and the next steps may then fail. Staff in secure children’s homes tell us that they often see children coming back as a consequence of poor planning."
        },
        {
            "text": "Ofsted’s response"
        },
        {
            "text": "When we are made aware of poor planning, we take it very seriously. We are likely to contact the director of children’s services to make sure that they are aware and doing all that they can. As a minimum, it will be a line of enquiry for our next inspection of that local authority’s children’s services."
        },
        {
            "text": "We are also working with the secure children’s homes sector to better understand the different factors that are creating this problem so that we can share our insights with government to make a difference to vulnerable children’s lives."
        },
        {
            "text": "More suitable provision is required"
        },
        {
            "text": "We do see some responsible authorities doing their very best to find the right homes for children. And sometimes they find the right places. But we know there is insufficient suitable provision in the right places."
        },
        {
            "text": "This means their task is much harder and sometimes their only available option is not fully suitable. As a result, we have seen children placed in unregistered provision. These are places where there is no regulatory assurance about the people working with the children or the quality of practice. They also often impose a great financial cost on the relevant authority."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "We hope that cross-government work following the Independent review of children’s social care and implementation of the government’s strategy Stable homes, built on love will help to address these insufficiencies."
        },
        {
            "text": "Action is required to provide the much-needed help, care and stability for these vulnerable children."
        }
    ]
}