{
    "url": "https://space.blog.gov.uk/2024/02/23/uk-space-agency-provides-500000-through-accelerating-investment-programme/",
    "title": "UK Space Agency provides £500,000 through Accelerating Investment programme",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2024-02-23T17:26:02+00:00",
    "content": [
        {
            "text": "The UK Space Agency has provided up to £500,000 funding to support specialist projects, helping to accelerate high potential UK companies and support them on their investment journey."
        },
        {
            "text": "Accelerating Investment is a pilot programme to offer additional value and opportunities to the next generation of space entrepreneurs, in partnership with a range of organisations. It is designed to complement other investment focused-initiatives provided by UK Space Agency."
        },
        {
            "text": "Four projects have been selected, which will provide private investment focused acceleration to some of the UK’s most promising and innovative growing companies."
        },
        {
            "text": "Craig Brown, Director of Investment at UK Space Agency said:"
        },
        {
            "heading": 2,
            "text": "The projects"
        },
        {
            "heading": 3,
            "text": "Cosmic Capital"
        },
        {
            "text": "The SETsquared Partnership is the enterprise partnership of six leading research universities (Bath, Bristol, Cardiff, Exeter, Southampton, and Surrey). Its mission is to turn ideas and innovation into thriving businesses and support the commercialisation of research from its university partners to create economic, environmental, and social impact. It does this by providing world-leading business incubation, innovation, and growth support services. Since 2002, it has helped companies raise £4.4 billion of investment, and these businesses' economic impact is estimated to be £15.7 billion."
        },
        {
            "heading": 3,
            "text": "Seraphim Space Camp"
        },
        {
            "text": "Seraphim Space Accelerator UK is a world leader in early-stage space tech innovation and has run 12 accelerator programmes since 2018 across three continents."
        },
        {
            "text": "Seraphim Space Camp has enabled alumni teams to secure over $320 million (approx. £255 million) in fundraising from more than 110 global investors."
        },
        {
            "text": "Through Accelerating Investment, Seraphim will support 8-10UK businesses through their core accelerator programme that lasts for three months and is run twice per annum. Seraphim will also introduce a new programme of activity, the Seraphim Space Academy, which will support high-potential, Series A UK companies following their completion of the Seraphim Space Accelerator programme.  The Academy will include workshops and tailored networking to support the selected UK teams in achieving the milestones crucial to their fundraising and market traction success."
        },
        {
            "heading": 3,
            "text": "Southern California – UK Space Accelerator"
        },
        {
            "text": "Mandala Space Ventures (Mandala), a California-based venture studio and incubator focused on the emerging space ecosystem, will be tapping into their Southern Californian (SoCal) network to deliver an accelerator programme for high-potential UK space companies interested in creating close ties to the SoCal space ecosystem. Mandala will be attracting capital investment from the US private investors, venture capital firms and other financial institutions, identifying SoCal supply chain partners and technology collaborations, building connections with world class SoCal universities and national laboratories, and providing mentorship from the SoCal technical experts with decades of spaceflight experience, successful space entrepreneurs, innovators, and business professionals. Following a launch event in London, selected businesses will benefit from an eight-week virtual accelerator programme with Mandala experts and that will culminate in a demo day in Southern California USA."
        },
        {
            "text": "\"Mandala Space Ventures is honoured and excited to partner with the UK Space Agency to provide space accelerator services to early-stage startups in the UK'', said Mandala CEO and Founder, Dr Leon Alkalai, retired Technical Fellow at the NASA Jet Propulsion Laboratory, California Institute of Technology."
        },
        {
            "heading": 3,
            "text": "Venture into Space: Accelerating UK Space Tech"
        },
        {
            "text": "The UK Business Angels Association (UKBAA) and Type One Ventures are joining forces in a mission to activate their extensive investor communities as part of the newly launched Venture into Space programme. This programme will upskill high-potential, high-growth SMEs developing innovative space tech solutions to prepare them for successful investment raises."
        },
        {
            "text": "UKBAA is the trade body for angel and early-stage investment. It reaches over 15,000 “angels” across the UK and 220 organisations, including angel networks, syndicates, investment funds, equity crowdfunding platforms, accelerators and professional advisors that collectively invest over £2 billion per annum. It has devised a variety of novel formats through which the cohort will benefit from the expertise of their network."
        },
        {
            "text": "Venture into Space: Accelerating UK Space Tech will support selected businesses to engage with future buyers who are likely to procure their services and technologies, facilitating dialogue so participants can obtain pre-market engagement with potential revenue-generating sources."
        },
        {
            "text": "UKBAA’s Managing Director Roderick Beer said: “We are delighted to have partnered with Type One Ventures and the UK Space Agency to unlock investment capital across our combined investment communities. We look forward to helping investors to actively engage with the exciting opportunities in the UK’s growing space industry.”"
        },
        {
            "text": "The Accelerating Investment projects will deliver throughout 2024 and we look forward to seeing their impacts."
        },
        {
            "text": " "
        }
    ]
}