{
    "url": "https://ukhsa.blog.gov.uk/2024/02/23/will-climate-change-make-the-effects-of-pollen-worse/",
    "title": "Can you get hay fever in February or is the pollen count too low?",
    "authors": [
        "Bernd Eggen"
    ],
    "categories": [
        "Health in a changing climate"
    ],
    "pub_date": "2024-02-23T14:11:33+01:00",
    "content": [
        {
            "text": "Hay fever is already common during the spring and summer months, but our changing climate could see some symptoms starting earlier in the year for allergy sufferers across the UK. Recent studies suggest that some types of pollen and other allergens could be released earlier in the year and for longer durations as temperatures rise. For some types of pollen, this may mean levels high enough to trigger hay fever as early in the year as January or February."
        },
        {
            "heading": 3,
            "text": "What is pollen?"
        },
        {
            "text": "Pollen grains are tiny particles produced by flowering plants for reproductive purposes; some plants transfer pollen to other flowers of the same kind by means of insects, while many rely on wind to carry pollen grains through the air to their destination."
        },
        {
            "text": "Pollen contains proteins and a significant number of people have an allergic reaction to these proteins (most commonly hay fever, but also allergic asthma and eczema)."
        },
        {
            "text": "In the UK it is estimated that every year millions of people feel the ill-effects of pollen exposure."
        },
        {
            "text": "The pollen season in the UK has traditionally had 3 distinct but overlapping phases:"
        },
        {
            "text": "Research suggests that with increasing temperatures, oak and grass pollen seasons may start even earlier, meaning that some allergy sufferers could begin to experience hay fever and other reactions as early as January/February."
        },
        {
            "heading": 3,
            "text": "What will climate change do to pollen patterns in the UK?"
        },
        {
            "text": "The Health Effects of Climate Change in the UK report, published at the end of 2023, listed a number of ways that climate change is likely to have an impact on our lives. It’s likely a changing climate will impact pollen patterns in at least 3 ways:"
        },
        {
            "heading": 3,
            "text": "Can research help hay fever/asthma sufferers?"
        },
        {
            "text": "UKHSA, the Met Office and several universities collaborate on researching various aspects of pollen."
        },
        {
            "text": "Research suggests that careful cutting regimes of grass could make a significant difference to the amount of grass pollen produced, with more work needed in this area to find out the health impact of such a change."
        },
        {
            "text": "Looking to improve pollen forecasts using molecular genetics (i.e. DNA sequencing) will give more precise information to allergy sufferers, who already know which types of grass pollens affect them and when, so they can take appropriate action."
        },
        {
            "text": "There is currently no easy way of distinguishing between the pollen grains produced by 150 species of grass, however understanding which species of grass pollens are in the air in high quantities at a particular time will allow people with hay fever and/or asthma to better manage their allergies and medication."
        },
        {
            "text": "It may help people to discover which particular types of grass pollen they are reacting to."
        },
        {
            "text": "Maps developed as part of a joint Met Office/UKHSA project, show the locations of key allergenic plants. They are used by health researchers to study impacts of plants with allergenic pollen on hospital admissions for respiratory conditions, provide information to local authorities and healthcare practitioners, and are helpful to patients suffering from allergies."
        },
        {
            "text": "It's hoped that in the future more detailed source maps can be used, alongside wind direction and precipitation patterns, to provide improved local warnings to sufferers with information on the type(s) and concentrations of pollen within their area."
        },
        {
            "heading": 3,
            "text": "Tackling pollen with data"
        },
        {
            "text": "The Met Office, working with the University of Worcester’s National Pollen and Aerobiological Unit, has a network of pollen monitoring stations, which suck into a sampler containing sticky tape to capture the pollen. The tape is then placed under a microscope and the pollen particles are counted."
        },
        {
            "text": "If researchers can improve the quality of information about the type and seasonal occurrence of pollen that is provided to health care professionals, then they can better plan treatment and clinical trials for remedies."
        },
        {
            "text": "Smart-phone apps can help pollen sufferers by giving them individual forecasts and allowing users to feedback to the data providers."
        },
        {
            "text": "There is also a need for strategies to monitor and, where possible, contain the spread of invasive species (such as ragweed), to minimise future pollen risks to the UK population."
        },
        {
            "text": "Longer and more intense pollen seasons are something that we are beginning to experience in the UK. So, if you find yourself sniffling and rubbing your eyes in February, your symptoms could very well be caused by hay fever."
        },
        {
            "text": "Image: Clare Bell"
        }
    ]
}