{
    "url": "https://cddo.blog.gov.uk/2023/10/25/entries-open-for-civil-service-data-challenge/",
    "title": "Entries open for the Civil Service Data Challenge",
    "authors": [
        "Sue Bateman, Chief Data Officer, CDDO"
    ],
    "categories": [
        "CDDO",
        "Data",
        "DDaT events"
    ],
    "pub_date": "2023-10-25T10:26:57+01:00",
    "content": [
        {
            "text": "The Civil Service Data Challenge was launched last month by Minister Alex Burghart, Parliamentary Secretary for the Cabinet Office. "
        },
        {
            "text": "The competition was initially created to provide practical solutions to many complex data issues across government, and profile the hidden data talent across the civil service, who need a platform to launch their ideas. "
        },
        {
            "text": "Over the past two years, judges have seen that innovation demonstrated across the 400 ideas that have been submitted, and 16 brilliant semi-finalists. During this year’s data themed One Big Thing, the competition hopes to tap into even more data creativity."
        },
        {
            "text": "Now in its third year, this data competition is open to all civil servants, in any department, from operational delivery, to policy, at any grade, and colleagues are invited to submit data-led project ideas or join a team, to offer a solution to a technical issue or societal challenge. "
        },
        {
            "text": "\"Now, more than ever, the way we use data provides the lifeblood to our ability to deliver excellent public services."
        },
        {
            "text": "I am delighted to support the Civil Service Data Challenge, which allows us to use its ideas to drive efficiency, improve public services and help tackle some of the most pressing challenges in our society, and over the past two years we are already seeing tangible benefits delivered to the public.\""
        },
        {
            "text": "Alex Burghart, Parliamentary Secretary for the Cabinet Office"
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": "Colleagues who are keen to apply either as an individual or as part of a team, are asked to complete the entry form by 1 November."
        },
        {
            "text": "After the closing date judges will convene and a longlist of applications will be published on 10 January, the Dragon’s Den-style semi-final pitches take place on 21 March 2024, and the grand final concludes the competition, on 4 July 2024."
        },
        {
            "text": "The winner of the Civil Service Data Challenge 2024 will receive funding to help bring the project to life, as well as the backing of senior leadership within the Civil Service and technical expertise from NTT DATA."
        },
        {
            "text": "Last year’s winners, Project Heyrick, was made up of a team of civil servants from multiple departments. Their idea centred on developing technology to detect incidents of modern slavery, using a modern data-driven approach."
        }
    ]
}