{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/10/25/no-matter-what-walk-of-life-you-come-from-you-can-make-a-difference/",
    "title": "“No matter what walk of life you come from, you can make a difference.”",
    "authors": [
        "Joseph Kaley CertHE (Law)"
    ],
    "categories": [
        "Care leavers"
    ],
    "pub_date": "2023-10-25T11:28:42+01:00",
    "content": [
        {
            "text": "The Civil Service care leavers internship scheme gives care leavers the chance to benefit from a 12-month paid internship in a central Government department. Over 880 care leavers have been offered roles in over 26 government departments, with around 80% being converted to permanency."
        },
        {
            "text": "Joseph Kaley CertHE (Law), shares his experience of working on the internship scheme, from how he got there and the application process, to how he has progressed since."
        },
        {
            "text": "My name is Joseph, I am 22 years old, and I am currently working as a border force higher officer at Heathrow Airport. I started this role in April 2023 having worked my way up from starting on the civil service care leavers internship scheme, then working as a border force officer for nearly 3 years."
        },
        {
            "text": "The civil service internship scheme"
        },
        {
            "text": "I found out about the care leavers internship scheme through the after-care team at my local authority, who thought that given I was studying law at the time and already dabbling in local politics that exposure to the civil service would be good for me."
        },
        {
            "text": "My foster carer and tutor at university both supported me in making an effective written application and, once I found out I had been invited to interview, did some mock interviews with me. In the interview itself, the environment was very relaxed, and the panel gave me the confidence to perform to the best of my ability."
        },
        {
            "text": "The application process "
        },
        {
            "text": "Before applying I only had basic knowledge of what working in the civil service entailed – I knew that it centred around serving the government of the day regardless of political alignment, doing the day-to-day business and running of the country. I knew that there were many different government departments, but the depth and breadth of their individual portfolios were not known to me."
        },
        {
            "text": "When I was told that I had been successful at interview and would be working for the border force at Heathrow Airport, I had no idea what to expect. The only knowledge I had of border force was from TV shows such as Britain’s Busiest Airport. At the beginning, I did suffer a bit from imposter syndrome, but my amazing colleagues quickly put me at ease, and I got stuck in. My line manager and team were extremely sympathetic to my background and treated me with dignity and respect."
        },
        {
            "text": "After working part-time for a year, my line manager got a year extension granted to my internship. I was tenacious in ensuring I impressed the business, and it paid off, as I was then offered a permanent full-time role."
        },
        {
            "text": "My journey since "
        },
        {
            "text": "Shortly after I was offered a permanent role, I applied on promotion to become a border force higher officer and was successful. I very much doubt I would have been able to apply for this role, let alone acquire the necessary skills to even be considered as a candidate, without the opportunities provided by the care leavers internship scheme."
        },
        {
            "text": "I particularly enjoy working in a demanding operational environment, knowing that the work I deliver contributes to border force’s critical activities and helps keep our country safe. The immense diversity of the organisation has shown me that no matter what walk of life you come from, you can make a difference."
        },
        {
            "text": "My advice "
        },
        {
            "text": "If I were to give advice to any fellow care leavers considering applying for the scheme is to not underestimate yourself – you will find that you possess a life perspective and set of skills that not many others do. Don’t get hung up on whether you think you will “fit in”."
        },
        {
            "text": "If I had to describe the internship experience in 3 words, they would be:"
        },
        {
            "text": "Find out more about the civil service care leaver scheme"
        },
        {
            "text": "Find more care leaver support and opportunities with the Care Leaver Covenant"
        }
    ]
}