{
    "url": "https://dfedigital.blog.gov.uk/2023/10/25/using-feedback-to-develop-and-progress/",
    "title": "Using feedback to develop and progress",
    "authors": [
        "Stephen Milnes, Content Designer"
    ],
    "categories": [
        "Careers",
        "Content design",
        "culture",
        "recruitment"
    ],
    "pub_date": "2023-10-25T09:00:17+01:00",
    "content": [
        {
            "text": "I’ve been a content designer at the Department for Education (DfE) since April 2022.  Before that I recruited, developed and lead a content team at Severn Trent, the water company in the Midlands. I started out in content design, after a sidestep from journalism, at University of Bath in 2013 where we built a new website inspired by GOV.UK.  "
        },
        {
            "text": "I’ve wanted to work in content for the Civil Service ever since, so I was delighted to join DfE. "
        },
        {
            "text": "The community learning is what I appreciate the most about working here. "
        },
        {
            "heading": 2,
            "text": "Learning and developing "
        },
        {
            "text": "I’ve spent the last 18 months collaborating with and learning from the awesome civil servant and contractor researchers, designers, developers, analysts, product and delivery managers here. I’m a better content designer now than I was when I joined. My skill set has broadened because of the things I have learnt from all those people. "
        },
        {
            "text": "However, I miss helping others develop as somebody who managed a content team, in previous roles.  "
        },
        {
            "text": "I feel like I’m ready to take the next step to support and lead others within the civil service now.   "
        },
        {
            "heading": 2,
            "text": "Applying for roles, and initial disappointment "
        },
        {
            "text": "Applying for roles in the Civil Service is hard. "
        },
        {
            "text": "I’d tried for senior content designer roles in the civil service in the distant and more recent past but didn’t get interviews. Despite putting days of work into each application, making sure I had examples for each of the criteria, something was not working. "
        },
        {
            "heading": 2,
            "text": "Asking for feedback "
        },
        {
            "text": "I decided to ask people here at DfE for advice. It was the best thing I did. "
        },
        {
            "text": "When the next role I was interested in came up, I asked friends and colleagues already in senior roles to review and give feedback on my application before I sent it.  The advice I received was transformative. I want to share my experience of getting feedback in case it helps others who may struggle when applying for roles in the Civil Service. "
        },
        {
            "heading": 3,
            "text": "Get feedback from people in other professions "
        },
        {
            "text": "There will not always be somebody from your profession on the panel, such as a content designer. Although there should be, and it is something DfE is working towards. Explain what you do in a way that people without the same professional expertise can understand. Ask somebody in an adjacent role to check your application before you send it. "
        },
        {
            "heading": 3,
            "text": "Frame challenges as opportunities "
        },
        {
            "text": "We all face problems in our jobs. I tried to explain difficulties I’d faced in a way that I thought showed that I was taking initiative.  "
        },
        {
            "text": "What I learnt was that it came across as complaining. The exact opposite of what I was trying to do! "
        },
        {
            "text": "What I was trying to explain was a good thing, but I was talking about it negatively. Instead of saying “Despite X, I did Y” make a subtle change in the language you use. Say “I identified an opportunity to do X and lead on Y”. Focus on the positive action you took. "
        },
        {
            "heading": 3,
            "text": "Sell yourself "
        },
        {
            "text": "This is the bit that always makes my skin crawl. I am a natural deflector and self-deprecator. There’s a reason I left journalism for content design and not marketing or public relations. I would second guess myself in terms of how to write an application for a content design job.  "
        },
        {
            "text": "Should I use confident, positive, more verbose language or should I shut up and get to the point using plain English? "
        },
        {
            "text": "Remember, you’re not being scored on brevity. You’re trying to convince somebody that you are the right person for a specific job against a particular set of criteria. Being a good content designer is about understanding the needs and goals of your audience and the context they interact with that content in. "
        },
        {
            "text": "It’s ok to use longer words, buzzwords and workplace jargon here. "
        },
        {
            "heading": 2,
            "text": "Success, almost "
        },
        {
            "text": "After following that advice, I got an interview, got an appointable score, narrowly missed out on a role and made the reserve list. "
        },
        {
            "text": "The whole experience has been a great boost to my confidence and performance. My teammates have told me so: "
        },
        {
            "text": "My head of profession has also mentioned it, saying they have seen a shift in how I talk about myself, my work and in my confidence. "
        },
        {
            "heading": 2,
            "text": "Keep on trying "
        },
        {
            "text": "I’ll keep applying for roles, asking for feedback from each panel and learning how I can get better for the next one. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}