{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/10/05/black-history-month-2022/",
    "title": "Black History Month 2022",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion"
    ],
    "pub_date": "2022-10-05T16:33:28+01:00",
    "content": [
        {
            "text": "Entering its 35th year of celebration, Black History Month 2022 UK runs throughout the month of October. This year’s theme, Time for Change: Action Not Words, focuses on the double-burden black people carry: experiencing racism and discrimination and then being expected to fix the problem themselves. The event encourages people to get involved by taking action using the ‘see something, say something’ idea of tackling racism.  "
        },
        {
            "text": "Everyone can participate in Black History Month by championing, and celebrating diversity in the workplace, and embracing its theme through demonstrating inclusivity and challenging bad behaviours. Check out the information and resources available at https://www.blackhistorymonth.org.uk/ "
        },
        {
            "text": "International Black History Month (IBHM) organisation is exploring the black British community through their ‘Sharing Journeys’ feature find out more at https://www.ibhm-uk.org/black-history-month-uk.  "
        },
        {
            "text": "If you prefer to engage with IBHM through reading, then there are a number of good reads through the book recommendations initiative for Black History Month. Included in the list is ‘A Visible Man’ by Edward Enninful – “I set out to bring the 'othered' to the table. We're here to inspire and give people something to dream about as well as a sense of the possible here and now.” "
        },
        {
            "text": "I recently stumbled across extracts of the book, read by Edward himself on the radio, produced as a short series of readings for BBC Sounds. I was hooked on listening, transported to that time and place, immersed in his experience and eagerly anticipating what was to come as he charted the big events in his life that lead to his interest and success in his career. I thoroughly enjoyed it. "
        },
        {
            "text": " Tell us about your journey and we will share your story with other members here. "
        }
    ]
}