{
    "url": "https://ukhsa.blog.gov.uk/2022/10/05/getting-tested-for-an-sti-your-guide-to-how-it-works/",
    "title": "Getting tested for an STI: Your guide to how it works",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-10-05T10:15:23+01:00",
    "content": [
        {
            "heading": 3,
            "text": "What is an STI?"
        },
        {
            "text": "Sexually transmitted infections (STIs) are caused by bacteria, viruses or parasites that can be passed from one person to another during sex or intimate contact and most STIs are passed between sexual partners through oral, vaginal or anal sex - especially if you don’t use a condom."
        },
        {
            "text": "If you are diagnosed with an STI you should avoid having sex with anyone until you have completed treatment. If you do have sex, the infection could be passed to your sexual partner."
        },
        {
            "heading": 3,
            "text": "General symptoms"
        },
        {
            "text": "If you have signs or symptoms of an STI it is best to go to a sexual health service to be tested in person."
        },
        {
            "text": "Often people with STIs will get no symptoms at all or the symptoms will take a long time to show, meaning you could be passing infections on to other people without knowing it."
        },
        {
            "text": "The only way to know you have an infection is to get an STI test."
        },
        {
            "text": "STI symptoms vary from rashes, to pain when passing urine, discharge from the penis, vagina or anus, and lumps, or sores on the genitals and anus."
        },
        {
            "text": "Some symptoms may also be internal - for example, pain inside your stomach, testes, pelvic or rectal area."
        },
        {
            "text": "You can read more on types of STIs and their symptoms and treatment on the Sewwise website here."
        },
        {
            "heading": 3,
            "text": "What is an STI self-sampling kit?"
        },
        {
            "text": "Many sexual health services in the UK now offer free STI self-sampling kits for people who aren’t showing any symptoms or signs of a sexually transmitted infection (STI) and just want a routine check-up in the comfort and privacy of their own home."
        },
        {
            "text": "These self-sampling kits can be used to test for the most common STIs, including chlamydia and gonorrhoea, as well as for other STIs such as syphilis and HIV."
        },
        {
            "text": "The self-sampling kit will arrive in the post in a plain unmarked envelope or letterbox-friendly box and will have everything you need to take the samples, and a freepost return label to send them back."
        },
        {
            "text": "You take samples yourself and then send them to a laboratory to be tested and get your results back in a few days."
        },
        {
            "text": "Find out where to order free STI testing kits and find other free online services here."
        },
        {
            "heading": 3,
            "text": "When should I get tested?"
        },
        {
            "text": "It is a good idea to get tested, especially if you have recently changed partners or think you were exposed to an STI."
        },
        {
            "text": "You don’t need to have lots of partners to get an infection, as many people with STIs have no symptoms and are unaware they’re passing on an infection to their sexual partner."
        },
        {
            "text": "Regular testing for HIV and STIs is essential for good sexual health, and everyone should have an STI screen, including an HIV test, annually if having condomless sex with new or casual partners."
        },
        {
            "text": "If you’re a student going to university for the first time or returning for a new year, it’s a good idea to get tested before you start having sex."
        },
        {
            "text": "Women and other people with a womb or ovaries aged under 25 years who are sexually active should be screened for chlamydia on change of sexual partner or annually, and gay, bisexual and other men who have sex with men should test for HIV and STIs annually or every 3 months if having condomless sex with new or casual partners."
        },
        {
            "text": "If you have had sex without using condoms in the last 3 days and think you were exposed to HIV then don’t wait for a postal test - find HIV post exposure prophylaxis (PEP) services here or for out of hours support you can get PrEP from A&E."
        },
        {
            "heading": 3,
            "text": "What’s included in the STI self-sampling kits? "
        },
        {
            "text": "The contents of self-sampling kits will depend on the answers you give about the types of sex you have."
        },
        {
            "text": "Kits will include a combination of the following:"
        },
        {
            "text": "Your kit will come with instructions explaining how to best take the samples and some also link to video guides online."
        },
        {
            "heading": 3,
            "text": "Getting your test results"
        },
        {
            "text": "Self-sampling test kits must be sent back to the lab for analysis. There’s a separate labelled freepost laboratory return envelope or box included within your kit."
        },
        {
            "text": "Your personal details will not appear on any of the samples or the freepost label, postal test kits are completely confidential."
        },
        {
            "text": "Your test results will be returned as soon as possible, often by text message - usually within a few days. If you do have an infection, you will be advised of how to get treatment and further support."
        },
        {
            "heading": 3,
            "text": "How do I get treatment?"
        },
        {
            "text": "If you have an infection, you will get advice about treatment and further support. Usually, you will be advised on what treatment is needed or, when necessary, make an appointment at a local sexual health service for treatment."
        },
        {
            "text": "If you are diagnosed with an STI, it’s advised that you get treatment as soon as possible to prevent passing it on to your sexual partners or experiencing any long-term effects."
        },
        {
            "text": "It’s also important to inform recent partners that you have been diagnosed with an STI and that they should get tested."
        },
        {
            "text": "Typically, treatment will include a course of antibiotics, and may require you to pick up your prescription at a local pharmacy or attend a sexual health service in person."
        }
    ]
}