{
    "url": "https://defradigital.blog.gov.uk/2022/10/05/how-the-pandemic-altered-our-ways-of-working-and-advanced-our-learning/",
    "title": "How the pandemic altered our ways of working and advanced our learning",
    "authors": [
        "Cathy O’Sullivan"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2022-10-05T07:30:15+01:00",
    "content": [
        {
            "text": "In Libraries Week Defra library officer Cathy O’Sullivan shares some reflections on her learnings from the pandemic and how it’s changed the way in which the Defra library service works."
        },
        {
            "text": "Hi, I’m Cathy and I work in the Defra Library. Back in March 2020, when we were advised to work from home, I can remember saying to a colleague, “see you in a couple of weeks”. Little did we know it would be another 18 months until we were back in the office, and during that time my colleague had retired!"
        },
        {
            "text": "Looking back, I naively felt quite smug thinking I had all the right equipment already in place to work from home for a short time. My thoughts quickly changed when those “two weeks” continued into months.\nAdapting to a new way of communicating"
        },
        {
            "text": "Microsoft Teams quickly became our new way of communicating, but first we had to learn how to use it. Cue the many learning and development courses and bitesize sessions that were quickly implemented by our DDTS colleagues."
        },
        {
            "text": "It was a trial-and-error period for a while before we got to grips with it. Even now, at least once a day, I hear the words “you’re on mute!” Now, we’re using Teams every day to talk to colleagues, hold and attend meetings, host library presentations, record video tutorials and attend learning sessions. Teams has also been instrumental in training, and getting to know, our two new library staff remotely."
        },
        {
            "text": "It’s also incredibly useful when exploring resource/subscription issues and figuring out solutions via screen-share, and it has helped to maintain that personal face to face interaction we’d all been lacking."
        },
        {
            "text": "To improve customer access to library staff across the country we now host a weekly “Ask a Librarian” drop-in session every week, where colleagues can freely join with any questions or queries and one of the library team will be available online to help."
        },
        {
            "heading": 2,
            "text": "Moving to digital subscriptions"
        },
        {
            "text": "Earlier in the summer my colleague Sonja wrote about how we keep colleagues across the Defra organisations informed through a range of print and online resources, and the vital work our team does to manage a unique library collection."
        },
        {
            "text": "One of the biggest challenges we faced at the beginning of the pandemic was how we would switch from print to electronic subscriptions, ensuring our customers could still access their resources, but remotely."
        },
        {
            "text": "With a print subscription, we could circulate journals or books; all we needed to know was where, and whom, to send it to. With digital resources, it’s different; we’ve had to negotiate the cost of users with publishers, ensure we can comply with the licence, and set up organisational access on different platforms."
        },
        {
            "text": "This bit has been particularly complicated as we supply library services to six different organisations across Defra, namely, Animal and Plant Health Agency (APHA), Defra (Department for Environment, Food and Rural Affairs), Natural England (NE), Veterinary Medicines Directorate (VMD), Joint Nature Conservation Committee (JNCC) and more recently the Office for Environmental Protection (OEP)."
        },
        {
            "heading": 2,
            "text": "Promoting our services to those who need to use them"
        },
        {
            "text": "We’ve also successfully built SharePoint community sites for Defra, APHA and Natural England as well as individual sites for JNCC, OEP and VMD staff. All sites hold a wealth of information, including lists of available resources and how to access those resources, how to register for subscriptions, how to request documents via our interlibrary loans service, and much, much more."
        },
        {
            "text": "Courtesy of the rolling programme of remote learning sessions led by our Smarter Ways of Working team, we’re confidently using several new Microsoft applications to communicate with customers, to deliver virtual library inductions, and to support team tasks using Planner."
        },
        {
            "text": "More recently we’ve been looking at Power Apps to automate some of our library processes. Integrating new applications and processes into our service has now become the normal way of working for our team. So, visually, while our library at Weybridge might now look much smaller than it used to, digitally we are much bigger."
        },
        {
            "heading": 2,
            "text": "Here we are then"
        },
        {
            "text": "Two and a half years after the start of the first lockdown, all Defra Library staff are back in the offices, using all those new applications daily."
        },
        {
            "text": "It’s still a learning curve for us and always will be as ways of working change and technology moves on, but our commitment to deliver the best library service we possibly can remains the same…it just looks and feels a little different now."
        }
    ]
}