{
    "url": "https://lifeathmrc.blog.gov.uk/2022/10/05/learning-on-the-job-has-proven-to-be-a-great-career-move-for-neurodivergent-apprentice-hannah/",
    "title": "Learning on-the-job has proven to be a great career move for neurodivergent apprentice Hannah",
    "authors": [
        "Nicola Barson"
    ],
    "categories": [
        "Accessibility",
        "Culture & Values",
        "Digital Apprentices",
        "Diversity",
        "Guest blog",
        "Inclusion",
        "Needs Extra Support"
    ],
    "pub_date": "2022-10-05T09:25:11+00:00",
    "content": [
        {
            "text": "PR and Communications apprentice, Hannah Mead joined HMRC at the beginning of 2022 in the Sustainability team. Here she shares her experiences of learning on-the-job and her top tips for navigating ADHD in the workplace."
        },
        {
            "heading": 3,
            "text": "Building on my existing skills"
        },
        {
            "text": "I joined HMRC at the beginning of this year as a PR and Communications apprentice, part of the apprenticeship programme run by the Government Communications Service. As a recently diagnosed neurodivergent woman joining in her late 20s, with a university qualification under her belt (in something totally different), it’s been both a unique step back into education and a forward leap into the world of communications – and the Civil Service."
        },
        {
            "text": "As a recent graduate, I was looking to move into an office-based role in something meaningful, which could help the public in some way. When I saw the apprenticeship opportunity at HMRC, I knew I had to apply for it. It was a good match for me because I felt that my communication skills were already an existing strength, and I enjoy strategic thinking and problem solving. I also have foundation level knowledge of marketing and an interest in some of the core concepts."
        },
        {
            "text": "The 15-month long apprenticeship allows me to develop my communication skills in different areas of the organisation. So far, it has been fantastic. My first rotation was working in the Sustainability team and I loved it. Working on Internal Communications for Social Sustainability (volunteering, charitable giving and fundraising, and tax facts) has allowed me to build my creativity and strategic thinking simultaneously."
        },
        {
            "heading": 3,
            "text": "Growing my experiences "
        },
        {
            "text": "So far, my work has largely consisted of planning, designing, and delivering products on multiple channels to our wider HMRC audience. These products have been focused on encouraging colleague engagement in fundraising and volunteering."
        },
        {
            "text": "I currently lead on the overarching schedule for the internal communications plan, which involves writing copy and monitoring engagement rates. I liaise with colleagues across the organisation; collecting and sharing their positive experiences to inspire others, while working towards wider HMRC objectives and our vision."
        },
        {
            "text": "Within the last few months, I have also been working on a project for the launch of our Tax Facts refresh, which is our flagship tax education programme for young people. I have been leading on internal communications, and recently I have been collaborating with HMRC’s Social Media team to publish content on our social media platforms, which is a new experience for me."
        },
        {
            "text": "Speaking of new experiences, I’ve also stepped out of my comfort zone by volunteering to create products for the Environmental Sustainability team. This is something I’m passionate about but have very little experience in writing for sustainability, so I was a little nervous at first. But by challenging myself, it has made my experience very meaningful and vastly contributed to my ongoing learning. It has also quickly improved my writing and planning skills. This learning and improvement were in part due to the high degree of support I experienced from several colleagues."
        },
        {
            "heading": 3,
            "text": "Neurodiverse support in the workplace"
        },
        {
            "text": "My experiences so far have been enjoyable, eye-opening and challenging. I am learning about my own strengths and weaknesses, not only as a fresh face in the field and Civil Service, but as an ADHD-er who’s yet to master her own workflow and style. I am continuously learning so many different skills that many neurotypical people likely find natural – and trying to solidify them at lightning speed."
        },
        {
            "text": "A good example of this is being able to speak in a clearly organised, structured, and purposeful manner with my colleagues. I find myself losing track of my point, often misusing words due to subconsciously trying to rush through to the end – to warrant my contribution to begin with – because I know I want/need to contribute, but just can’t remember what I’m trying to say."
        },
        {
            "text": "This is a very common ADHD trait, and it can make me appear introverted or uncommitted to my work, because I am usually reluctant to speak. When then adding my slower information processing speed, which impacts my ability to follow lots of dialogue in real-time, this perception of me can easily be amplified."
        },
        {
            "text": "Working with various colleagues in person and on calls, in a department focused on colleague behavioural changes, has sharpened my ability to share and develop ideas in a fast-paced environment, and has helped structure my approach for maximising the conversation’s output."
        },
        {
            "text": "However, managing my ADHD at work is not something I always feel successful with – but the positive feedback I receive from my manager and colleagues confirms I am doing better than I think. I have learned to use a few specific techniques to help with workload management and productivity."
        },
        {
            "text": "For example, I use whiteboards for visual support in prioritising my tasks and understanding the multiple components of completing each task. Using 3-4 whiteboards to visually break down my work, the impact of my work, and the duration of different actions has supported me in working more effectively. I then estimate how long it should take to complete each task and use timers to create a sense of ‘pressure and accountability’ – a mindset, which other ADHD people will know, works well."
        },
        {
            "text": "My team have always been extremely vocal in their support of me as a new team member, and as a neurodivergent person. Most crucially, they have given me a safe space to share my needs and my personality. Underpinning my team’s ongoing support and reassurance is my manager, he has been a great person to go to for insight and direction. We have a friendly but informative relationship and I have learned a lot from him in a short amount of time. It has been a great first experience with a manager."
        },
        {
            "text": "As part of my role, I’ve been given the chance to present my ADHD experiences at an Equality, Diversity and Inclusion event for HMRC Communications. I’m excited and nervous to be part of this – wish me luck. I am not a member of the ED&I working group, so it is a brilliant opportunity to be involved in."
        },
        {
            "heading": 3,
            "text": "Next steps for me"
        },
        {
            "text": "I feel fortunate that this apprenticeship has been such a good opportunity to kick start my career. I am not used to learning on-the-job at the same speed and intensity as this role required, but I am solidifying skills so much faster than I could have predicted and I take real joy in knowing I am a genuine asset to my team – who I must credit with being brilliant to work with."
        },
        {
            "text": "Soon enough I’ll complete my next and final rotation, working in Strategic Communications. I’ll also be shadowing in other departments such as the Press Office and Social Media, and I’ll be preparing for my final assessment."
        },
        {
            "text": "As I finish my apprenticeship, I’ll be looking ahead to roles within the Sustainability Communications sphere; I’m keen to transition into another Civil Service role in communications, equipping me with essential skills and knowledge I need in my future career."
        }
    ]
}