{
    "url": "https://environmentagency.blog.gov.uk/2022/10/05/lincolnshire-farmer-tells-other-farmers-not-to-worry-about-environment-agency-check/",
    "title": "Lincolnshire farmer tells other farmers not to worry about Environment Agency check",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Greener business"
    ],
    "pub_date": "2022-10-05T14:07:02+00:00",
    "content": [
        {
            "text": "Lincolnshire farmer, Emma Billings, tells us about her positive experience with her first Environment Agency farm inspection."
        },
        {
            "text": "I farm at Manby Grange Farm with my husband Mark and my family, where the family has been farming for over 100 years. I inherited the farm from my parents and take great pride in all that we do."
        },
        {
            "text": "As well as being a farmer, I also support the Lincolnshire Rural Support Network and work with BBC Radio Lincolnshire, where we film my ‘Farm Diary’. So, I live and breathe all things agriculture."
        },
        {
            "text": "I was surprised and concerned when the Environment Agency wrote to me saying they needed to inspect my farm, as it isn’t something I had heard of before. But my nerves were calmed after I spoke to Caroline Hook who is an Agriculture Regulations Inspection Officer. Caroline explained the reason for the visit and that the Environment Agency will be evaluating all farms in my area, so it wasn’t just me! "
        },
        {
            "text": "The Environment Agency is taking a firmer approach to enforcing the Farming Rules for Water Legislation. This legislation aims to prevent and limit water pollution on farms, which can arise from the way we handle our livestock or spread our fertilisers for example. Inspectors are visiting farms to make sure farmers are working in a way which isn’t polluting watercourses. Inspectors are there to give advice and tips and work with farmers, and not against like I first feared. "
        },
        {
            "text": "On the day of the inspection, Caroline checked various paperwork I gave her a tour of the farm. It went really well. Caroline checked that we were correctly complying with farming regulations, from preventing nitrate pollution, to the way we stored oil and silage."
        },
        {
            "text": "During the inspection, we talked about how safe farming practices can help to limit pollution. She advised us on how some minor issues could be improved. I found this particularly useful as she gave me advice specific to my farm, and a reasonable deadline to get the work done by."
        },
        {
            "text": "My advice to farmers who are perhaps nervous about the farm inspections is, firstly, don’t panic! The inspection letter they send will include a list of all the information they might need, including your general farm records. This is mostly the same as what we do for our annual Red Tractor inspection. Also, the inspectors from the Environment Agency are very helpful. They are there to support you with anything you’re struggling with, listen to your concerns and offer practical advice which will specifically benefit you and your farm. "
        },
        {
            "text": "Caroline Hook, Agriculture Regulations Inspection Officer for the Environment Agency, said:"
        },
        {
            "text": "Supporting information"
        },
        {
            "text": "Follow @EnvAgencyMids on Twitter."
        }
    ]
}