{
    "url": "https://ukhsa.blog.gov.uk/2022/05/09/an-increase-in-hepatitis-cases-in-children/",
    "title": "An increase in Hepatitis Cases in Children",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-05-09T14:10:25+01:00",
    "content": [
        {
            "text": "Since January 2022, we have detected an increase in the number of acute (sudden onset) hepatitis cases in the UK in children aged 10 and under."
        },
        {
            "text": "Hepatitis is a condition that affects the liver and can be caused by infection with a virus. The viruses that normally cause hepatitis (hepatitis viruses A to E) have not been found in the children affected recently. Other possible causes of acute hepatitis, including some medications and toxins are also being investigated, however so far a link has not been found. The UK Health Security Agency is working with the NHS, a wide range of experts and with public health colleagues across the UK to find the cause as soon as possible."
        },
        {
            "text": "Hepatitis symptoms include:"
        },
        {
            "text": "Watch our video below for more information on symptoms."
        },
        {
            "heading": 2,
            "text": "What is causing the increase in cases?"
        },
        {
            "text": "The viruses that normally cause hepatitis (hepatitis viruses A- E) have not been found in the children affected by the recent increase in acute hepatitis, therefore public health teams are looking at all other possible causes. One area being explored is whether the hepatitis cases are linked to an increase in infections caused by adenovirus, a common cause of childhood illness. Over the last two years children have been mixing less because of the COVID-19 pandemic, and because of this the number of common infections seen in children was reduced."
        },
        {
            "text": "Now that children are mixing more we are seeing an increase in some infections, including adenovirus. We are also investigating other possible causes such as another infection (including COVID-19) or something in the environment."
        },
        {
            "text": "Some of the children with acute hepatitis have recently had a COVID-19 infection, but there has been a high number of COVID-19 infections in this age group so this is not unexpected. There is no link between these hepatitis cases and the COVID-19 vaccine. None of the current cases aged under 10 years old in the UK is known to have been vaccinated."
        },
        {
            "heading": 2,
            "text": "What do I need to do if my child is unwell with symptoms of a viral illness?"
        },
        {
            "text": "Viral infections, including adenovirus, are common in children and cause a range of mild illnesses including colds, vomiting and diarrhoea. Adenovirus or other infections don’t normally cause hepatitis, but it can be a very rare complication of some types of viral infection."
        },
        {
            "text": "If your child develops the common mild symptoms that could be due to a viral infection, such as symptoms of a cold, vomiting or diarrhoea, the chance of them developing hepatitis is extremely low. Most children will soon recover following rest and plenty of fluids."
        },
        {
            "text": "You do not need to contact the NHS unless your child is very unwell (for example, has breathing difficulties or is not eating or drinking) or if they develop jaundice (yellowing of the eyes or skin). If your child is getting rapidly worse or you are worried, trust your instincts and contact your GP or call the NHS on 111. Children who are unwell should be kept at home and not be sent to school or nursery."
        },
        {
            "text": "Children who have experienced symptoms of a gastrointestinal infection including vomiting and diarrhoea should not return to school or nursery until 48 hours after the symptoms have stopped."
        },
        {
            "heading": 2,
            "text": "How do I prevent the spread of common childhood infections?"
        },
        {
            "text": "Childhood infections are commonly passed from person to person through close contact, coughing and sneezing or by touching contaminated surfaces. The most effective way to reduce the spread of infections is to practice good hand and respiratory hygiene."
        },
        {
            "text": "Cover your nose and mouth when you cough and sneeze, wash your hands regularly. Supervise thorough handwashing in younger children and make sure they cover their nose and mouth when they cough or sneeze."
        },
        {
            "heading": 2,
            "text": "Who is at risk of hepatitis? "
        },
        {
            "text": "Almost all of the cases have been seen in children under 10, with most cases aged between 3 and 5 years. Most of the children affected were previously healthy, and only a very small number of cases are linked to another case of hepatitis. This means that even if there has been a case in your family or friends, or if a case has occurred at your child’s nursery or school, your child is still at low risk of developing hepatitis."
        },
        {
            "heading": 2,
            "text": "Could the cases be linked to COVID-19 infection or vaccine?"
        },
        {
            "text": "Only a few of the cases have had recent COVID-19 infection, in line with what we would expect given the current trends in the UK. However, we are investigating whether there could be a link to previous COVID-19 infection."
        },
        {
            "text": "There is no link between these hepatitis cases and the COVID-19 vaccine. The COVID-19 vaccines do not contain viruses that can grow in the human body. There were no COVID-19 vaccinations recorded in cases under 5, the age group which makes up over 75% of hepatitis cases. There are fewer than five older case-patients recorded as having had a COVID-19 vaccination prior to hepatitis onset."
        },
        {
            "text": "More information on can be found on the NHS website."
        }
    ]
}