{
    "url": "https://beisdigital.blog.gov.uk/2022/05/09/beis-digital-diversity/",
    "title": "Championing diversity and inclusion in BEIS Digital",
    "authors": [
        "Penelope Kopala"
    ],
    "categories": [
        "Engagement",
        "People and skills"
    ],
    "pub_date": "2022-05-09T13:57:59+00:00",
    "content": [
        {
            "text": "I’m Penelope Kopala, People and Development Manager in BEIS Digital."
        },
        {
            "text": "I do all things digital recruitment, working on bringing diverse talent into our digital teams. Getting through the last 2 years of remote working and intensified competition for digital talent has been no easy feat."
        },
        {
            "text": "However, attracting new staff isn’t our only focus. We are investing a lot more in professional learning and development, inclusion and wellbeing to ensure our staff are supported and continue to develop their careers with BEIS Digital."
        },
        {
            "heading": 2,
            "text": "Our diversity"
        },
        {
            "text": "We are proud to celebrate our achievement of surpassing the UK technology industry diversity average."
        },
        {
            "text": "BEIS Digital is currently made up of 37.5% women, which is well above the industry average of 25% in technology roles in the UK. 28% staff are from ethnic minorities compared to a UK average of 15%."
        },
        {
            "heading": 2,
            "text": "Our Diversity and Inclusion (D&I) champions"
        },
        {
            "heading": 3,
            "text": "Amanda Ofosu-Agyei - Diversity and Inclusion lead"
        },
        {
            "heading": 4,
            "text": "Why did you become a D&I Champion?"
        },
        {
            "text": "My primary role is as a Senior Digital Business Partner and I am one of the 3 group leads for diversity and inclusion in Corporate Services, which BEIS Digital is part of."
        },
        {
            "text": "I decided to take up the role as a D&I Champion to be drive forward diversity and inclusion in BEIS, to lead by example, and to share my previous experience of D&I in the NHS and the Metropolitan Police."
        },
        {
            "text": "Diversity and inclusion have been an important part of all my jobs, and I am keen to share the positivity and benefits they bring to our culture."
        },
        {
            "text": "The D&I Champions help to build and embed an understanding of diversity and inclusion throughout BEIS Digital. Our team organises events and workshops as well as contributing to the development of our D&I Action Plan sponsored and supported by our leadership teams."
        },
        {
            "heading": 4,
            "text": "What have the D&I Champions worked on over the last year?"
        },
        {
            "text": "Over the last 12 months the D&I Champions have increased our focus on social mobility, race, faith, neurodiversity, and invisible disabilities. We have worked very closely with colleagues across BEIS to deliver workshops, conducted focus groups and led the Corporate Services Diversity and Inclusion week."
        },
        {
            "text": "Our collective efforts meant we achieved a 100% diversity data declaration for the department."
        },
        {
            "heading": 4,
            "text": "What is the D&I Champions group working on next?"
        },
        {
            "text": "The future for BEIS Digital is to be inclusive in all that we do, from our technology to the way in which we deliver it."
        },
        {
            "text": "The D&I Champions continue to deliver various events and facilitate workshops and plans to obtain regular feedback from colleagues to help guide and understand how well we are doing and in ensuring we meet our Public Sector Equality Duty obligations."
        },
        {
            "text": "The group is looking at other topics such as age, gender, and other areas of diversity. We will be encouraging participation and innovative ideas from colleagues throughout BEIS Digital."
        },
        {
            "heading": 3,
            "text": "Laura Matthews - HR D&I Champion"
        },
        {
            "heading": 4,
            "text": "What is your role at BEIS?"
        },
        {
            "text": "I have over 20 years' experience in recruitment and recently moved into a role as the HR Business Partner for BEIS Digital and am also one of the D&I Champions."
        },
        {
            "text": "Having worked in a people focused roles throughout my career and particularly in recruitment I found that blind recruitment has been effective when hiring in the Civil Service."
        },
        {
            "text": "With blind recruitment the CV reviewing panel cannot see the applicants’ name, demographics, level of educational qualification and educational institutions which helped reduce the unconscious bias or affinity bias the panel may have."
        },
        {
            "heading": 4,
            "text": "What do applicants need to consider when applying for a role at BEIS Digital?"
        },
        {
            "text": "I’ve often been asked about what is different when applying for a role within the Civil Service and for any advice on what to consider when applying for a role within BEIS Digital."
        },
        {
            "text": "I would recommend:"
        },
        {
            "text": "We encourage diversity of thought and appreciate the value all new joiners bring to our teams. For this to happen we make sure that throughout the recruitment process, from the application review stage to interviews, we don’t just assess the specialist skills and experience needed for the job."
        },
        {
            "text": "We also assess the behaviours and potential a candidate demonstrates to show they will be successful in the role. This means we hire people who are aligned with our Civil Service values and core professional capabilities."
        },
        {
            "text": "We offer our staff specialist and on-the-job training, apprenticeships and mentoring programmes to develop their skills."
        },
        {
            "heading": 2,
            "text": "Come and work with us"
        },
        {
            "text": "Follow our blogs to get to know more about our exciting projects, people, and careers in upcoming blogs."
        },
        {
            "text": "Whether you are at the very start of your career or looking to grow and develop professionally in a new and exciting environment, BEIS might be the next place for you!"
        },
        {
            "text": "You can stay up-to-date with the latest developments by signing up for email alerts or by following us on Twitter."
        }
    ]
}