{
    "url": "https://defrafarming.blog.gov.uk/2022/05/09/bringing-bps-payments-forward/",
    "title": "Bringing BPS payments forward ",
    "authors": [
        "Alastair Walton"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2022-05-09T13:54:50+01:00",
    "content": [
        {
            "text": "The price of agricultural commodities has always been closely correlated to energy prices. "
        },
        {
            "text": "Manufactured ammonium nitrate and urea (the most commonly used nitrogen fertilisers in the UK) require a lot of energy to produce. When the gas price spikes, so can the price of fertiliser. Other input costs for farmers such as tractor diesel and electricity are also subject to price volatility."
        },
        {
            "text": "This means that farmers are carrying an increased risk on their profit and loss account, which creates increased pressure on cash flow in the short term. "
        },
        {
            "text": "For this reason, we’ve decided to change the way we make Basic Payment Scheme (BPS) payments. "
        },
        {
            "text": "We are planning to make BPS 2022 payments in 2 instalments. Farmers with eligible applications will receive half of their payment from the end of July, and the rest from December. "
        },
        {
            "text": "Bringing forward half of this year’s BPS payment gives farm businesses an advance injection of cash. It won’t affect farm profitability, but we’re hoping it will help farmers to make business decisions with more confidence. "
        },
        {
            "text": "We want to make this a permanent change to the way we pay Direct Payments in the future, with twice yearly instalments for the rest of the agricultural transition. "
        },
        {
            "text": "We’ve been told that more frequent payments help farmers manage their accounts. We’ve already committed to quarterly payments as we roll out the Sustainable Farming Incentive. This change to BPS payments is another example of us responding to farmer feedback. "
        },
        {
            "text": "The deadline to submit your 2022 BPS application is Monday 16 May 2022. There are penalties for late applications. "
        }
    ]
}