{
    "url": "https://food.blog.gov.uk/2022/05/09/emily-miles-stakeholder-update-cbd-and-the-challenge-of-getting-regulation-right/",
    "title": "Emily Miles' stakeholder update - CBD and the challenge of getting regulation right",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-05-09T15:49:54+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "As a regulator, the FSA’s job is to protect consumers and make sure that food businesses are doing the right thing. We also have a responsibility to ensure that the way we regulate helps industry to innovate and doesn’t hinder the growth of new markets."
        },
        {
            "text": "The challenge of getting this balance right has been evident in our work to regulate the cannabidiol (CBD) market. This is a booming sector offering a huge range of CBD-infused products, but none have been through the formal safety assessment required in law. There is little evidence of significant harm, but neither is there evidence of safety. We are also concerned that some products may not be what they say they are."
        },
        {
            "text": "We want to ensure that this sector is better regulated, so that consumers can trust what they are buying. In March, we published a list of CBD products linked to a credible application for authorisation. The idea is that if a product is not on the list, it should be removed from sale."
        },
        {
            "text": "We believe this offers a pragmatic and proportionate approach to regulation, allowing products that are moving towards full authorisation to stay on the market and ensuring enforcement authorities prioritise action against those products that aren’t in the FSA authorisation process."
        },
        {
            "text": "Our announcement about the list in March prompted some businesses to come forward with additional evidence linking their products to applications, which we are reviewing, FSA issues final call for CBD products to be added to the list. We also excluded some products linked to an individual application in error."
        },
        {
            "text": "We now plan to lock down the CBD list by the end of June and have made a final call to businesses to provide evidence to us. We acknowledge that this has been a difficult process for both sides. We are holding onto our belief that good regulation will support this growing sector. Food that consumers can trust is good for business."
        },
        {
            "text": "In the FSA’s new five-year strategy we stated that one of our guiding principles is being risk-based and proportionate. We are determined that the way we regulate will help businesses explore new markets, while always keeping consumers protected. This is particularly important as the food industry develops new products, for example in the sustainable protein sector, which the Benefits of Brexit policy paper identified as a potential opportunity for the UK. We will be working to update the process for approving novel foods to encourage safe innovation in this sector."
        },
        {
            "text": "If you have any thoughts on FSA regulation, please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "Diweddariad i randdeiliaid gan Emily Miles - CBD a her rheoleiddio’n iawn"
        },
        {
            "text": "Fel rheoleiddiwr, gwaith yr Asiantaeth Safonau Bwyd (ASB) yw diogelu defnyddwyr a sicrhau bod busnesau bwyd yn gwneud y peth iawn. Mae hefyd yn gyfrifoldeb arnom i sicrhau bod y ffordd rydym yn rheoleiddio yn helpu’r diwydiant i arloesi, ac nad yw’n rhwystro twf marchnadoedd newydd."
        },
        {
            "text": " "
        },
        {
            "text": "Mae taro cydbwysedd yn her amlwg yn ein gwaith wrth reoleiddio’r farchnad canabidiol (CBD). Dyma sector ffyniannus sy’n cynnig ystod anferthol o gynhyrchion wedi’u trwytho â CBD, ond nid yw’r un ohonynt wedi bod trwy’r broses asesu diogelwch sy’n ofynnol yn ôl y gyfraith. Prin yw'r dystiolaeth o niwed sylweddol, ond nid oes tystiolaeth ei fod yn ddiogel chwaith. Rydym hefyd yn bryderus nad yw rhai o’r cynhyrchion o bosib yn cyd-fynd â’r hyn sydd ar y label."
        },
        {
            "text": "Rydym am sicrhau bod y sector yn cael ei reoleiddio’n well, fel y gall defnyddwyr ymddiried yr hyn maent yn ei brynu. Ym mis Mawrth, fe wnaethom gyhoeddi rhestr o gynhyrchion CBD sy'n gysylltiedig â chais hygred am awdurdodiad. Y syniad yw y dylid tynnu cynhyrchion nad ydynt ar y rhestr oddi ar y farchnad."
        },
        {
            "text": "Credwn fod hyn yn cynnig dull pragmatig a chymesur ar gyfer rheoleiddio, gan ganiatáu i gynhyrchion sy'n symud tuag at awdurdodiad llawn aros ar y farchnad a sicrhau bod awdurdodau gorfodi yn blaenoriaethu camau gweithredu yn erbyn y cynhyrchion hynny nad ydynt ym mhroses awdurdodi'r ASB."
        },
        {
            "text": "Fe wnaeth ein cyhoeddiad am y rhestr ym mis Mawrth ysgogi rhai busnesau i gyflwyno tystiolaeth ychwanegol i gysylltu eu cynhyrchion â cheisiadau rydym yn eu hadolygu. Fe wnaethom hefyd eithrio rhai cynhyrchion sy'n gysylltiedig â chais unigol ar gamgymeriad."
        },
        {
            "text": "Rydym nawr yn bwriadu cloi'r rhestr CBD erbyn diwedd mis Mehefin ac rydym wedi cyhoeddi galwad olaf i fusnesau ddarparu tystiolaeth i ni. Rydym yn cydnabod bod hon wedi bod yn broses anodd ar y ddwy ochr. Rydym yn dal i gredu y bydd rheoleiddio llwyddiannus yn cefnogi’r sector hwn sy’n tyfu. Mae bwyd y gall defnyddwyr ymddiried ynddo yn dda i fusnes."
        },
        {
            "text": "Yn strategaeth bum mlynedd newydd yr ASB, fe wnaethom ddweud taw un o'n hegwyddorion arweiniol yw fod ein gwaith wedi’i seilio ar risg ac yn gymesur. Rydym yn benderfynol y bydd y ffordd rydym yn rheoleiddio yn cefnogi arloesedd ac yn helpu busnesau i archwilio marchnadoedd newydd, gan gadw defnyddwyr yn ddiogel bob tro. Mae hyn yn arbennig o bwysig wrth i’r diwydiant bwyd ddyfeisio cynhyrchion newydd, er enghraifft yn y sector protein cynaliadwy a nodwyd fel cyfle posibl i’r DU gan bapur polisi Benefits of Brexit. Byddwn yn gweithio i ddiweddaru'r broses ar gyfer cymeradwyo bwydydd newydd er mwyn annog arloesi diogel mewn perthynas â’r cynhyrchion hyn."
        },
        {
            "text": "Os oes gennych chi unrhyw sylwadau am ddulliau rheoleiddio'r ASB, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}