{
    "url": "https://civilservice.blog.gov.uk/2022/05/09/loneliness-isnt-always-obvious/",
    "title": "Loneliness isn't always obvious",
    "authors": [
        "Simone Filiaci"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-09T10:42:15+00:00",
    "content": [
        {
            "heading": 3,
            "text": "For many years, Simone Filiaci has experienced depression and loneliness. It can be difficult to understand how different factors can contribute to this debilitating condition. Simone explains how seeking help changed his life. "
        },
        {
            "text": "Mental Health awareness week runs from 9 to 15 May and explores the theme of loneliness, its impact on our mental health and how we can all play a part in reducing loneliness within our communities. Loneliness affects millions of people in the UK every year and can be a key cause of poor mental health."
        },
        {
            "heading": 4,
            "text": "Teenage angst"
        },
        {
            "text": "I’ve been suffering from depression since I was 13 or 14. Depression interferes with the reward system of the brain, so nothing feels good and everything is an exhausting waste of energy. Why should I bother with anything, if I still feel the same barren void? "
        },
        {
            "text": "At the time I didn’t know what was happening to me, and my parents didn’t have the tools to deal with it, so for years I thought it was normal teenage angst. I eventually realised that not everyone thinks of killing themselves several times a week, and that what I was experiencing wasn’t so common. For many years, I crawled on alone, until finally starting treatment in my late twenties."
        },
        {
            "heading": 4,
            "text": "Painfully aware "
        },
        {
            "text": "The long years before starting treatment were possibly the loneliest of my life. Not in the sense that I was physically alone - I did hang out with friends and family, when I could muster the strength to pretend to be a functioning human being. However, I was always painfully aware of my isolation, and how I had to put in effort to engage in social interactions that seemed effortless for others. My feeling of alienation was enormous; I could see others merrily socialising, yet all I wanted to do was crawl back to my dark bedroom and stare at the ceiling."
        },
        {
            "text": "The realisation that there was a gap between my personal life experience and the one that society considers ‘normal’ made things worse. How could I even try to make connections or confide in people about my feelings, if I knew there was something wrong with me? The internalised stigma and learned helplessness made any idea of seeking help seem pointless."
        },
        {
            "heading": 4,
            "text": "Upward"
        },
        {
            "text": "Like in most stories, things got worse before they got better. I eventually reached a breaking point, with regular insomnia and panic attacks. That finally pushed me over the edge, and I sought professional help. That remains the singular best decision of my life."
        },
        {
            "heading": 4,
            "text": "Support is available"
        },
        {
            "text": "Things changed literally overnight; looking back, I can’t believe I waited so long to start treatment. My message to anyone suffering from poor mental health is: support is available, and it’s never too late. Good health is something you’re entitled to. Just like you wouldn’t ignore an open wound and bleed all over the floor, don't feel that poor mental health is something you must endure. Things can get better, and it may not take as much as you think.    "
        },
        {
            "text": "Treatment also helped with the feeling of isolation and loneliness. A lot of the distance I used to perceive is actually just part of the normal human experience. Depression did make things worse, but there always is a gap between individuals that takes conscious effort to bridge and overcome. Every man actually is an island, we just tend to build bridges. So now if I avoid people, it’s because I want to."
        },
        {
            "heading": 4,
            "text": "Causes can vary"
        },
        {
            "text": "Causes of loneliness can vary from person to person and may be the result of a life event such as a bereavement, relationship break-ups or even retirement. Particular groups such as single parents, carers or disabled people may be more vulnerable to loneliness. There are many reasons why you may feel lonely and the MIND website offers some practical tips on how to manage the feeling of loneliness.  "
        },
        {
            "heading": 4,
            "text": "Supporting mental health"
        },
        {
            "text": "As A Modern Civil Service, our organisation takes pride in supporting mental wellbeing. For further help and support, check out your department’s intranet for links and information about your Employee Assistance Programme, Occupational Health and Mental Health First Aid/Wellbeing networks. "
        },
        {
            "text": "More help and resources can also be accessed via the Mental Health Foundation and Charity for Civil Servants website. If you prefer to talk to an organisation outside the Civil Service, the Samaritans can be contacted 24/7, 365 days a year."
        },
        {
            "text": "Finally, there's a great blog by Gul Naz Aziz from the Cabinet Office, Policy and Practice, Wellbeing team who narrates her own story about her personal experience of loneliness."
        }
    ]
}