{
    "url": "https://environmentagency.blog.gov.uk/2023/06/15/drought-and-water-resource-information-and-links/",
    "title": "Drought and Water Resource  Information and Links",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-15T09:52:42+00:00",
    "content": [
        {
            "text": "In the Devon, Cornwall and Isles of Scilly Area, we are still in a water supply drought due the levels in South West Water’s strategic reservoirs. Roadford and Colliford reservoir storage is improving but remain low for this time of year. A Temporary Use Ban (hosepipe ban) is in force in Cornwall and most of Devon (in the Roadford supply zone)."
        },
        {
            "text": "Parts of East Anglia are still seeing the effects of drought on surface water flows, groundwater levels, ecology, and abstractors. As we move into summer, we are working with abstractors to manage water availability and collecting ecological samples for analysis to observe the ecological response and effect of drought. We are planning for further dry weather impacts this year and do not rule out the potential need for active restrictions to abstraction, including Section 57 action, if we experience an extremely hot dry spell, though this is currently considered low risk."
        },
        {
            "text": "As we approach the warmer and drier summer months, we should be prepared for environmental drought."
        },
        {
            "text": "We have pulled together some information and links which may be useful to you."
        },
        {
            "text": "If you have any questions or queries you can call our National Customer Contact Centre for advice on 03708 506 506."
        },
        {
            "text": "The Environment Agency are carrying out farm visits and will be looking at private water supplies and regulation of taking water from the environment."
        },
        {
            "text": "If you have a private water supply, how much water are you taking? Do you need a licence?"
        },
        {
            "text": "More information can be found here: https://www.gov.uk/guidance/check-if-you-need-a-licence-to-abstract-water"
        },
        {
            "text": "The Environment Agency is working with the sector to produce Water Resources Management Plans for agriculture to help it achieve improved resilience of supplies."
        },
        {
            "text": "Water abstraction during prolonged dry weather and drought"
        },
        {
            "text": "Water abstraction is the process of taking water from a natural source, such as a river, lake, stream, spring, groundwater well, borehole, or the sea, for any purpose, such as irrigation, industry, recreation, flood control, or treatment to produce drinking water."
        },
        {
            "text": "Here is some guidance for non-water company abstraction licence holders affected by prolonged dry weather and drought: https://www.gov.uk/guidance/water-abstraction-flexible-options-in-exceptional-dry-weather"
        },
        {
            "text": "The information on the link above includes:"
        },
        {
            "text": "The National Farmers Union (NFU) have a Dry weather information and advice page:"
        },
        {
            "text": "https://www.nfuonline.com/updates-and-information/dry-weather-information-and-advice/"
        },
        {
            "text": "Water abstraction"
        },
        {
            "text": "Those with abstraction licences are only consented to take water in the pre-agreed terms and conditions."
        },
        {
            "text": "Abstractions of 20,000 litres (20 cubic metres) per day or less are exempt, provided the abstraction is part of a single operation – if you abstract from the same source at multiple points, the exemption only applies if the combined total of all abstractions is 20 cubic metres or less a day. Any abstraction of water greater than 20 cubic metres from the environment is likely to require a licence."
        },
        {
            "text": "List of exempt activities which do not require an abstraction licence: https://www.gov.uk/guidance/check-if-you-need-a-licence-to-abstract-water#when-you-do-not-need-a-licence"
        },
        {
            "text": "If there is no abstraction licence, it may be possible to enter into an agreement with an existing licence holder. It can be agreed for a licence holder to give you part or all their abstraction right, permanently or temporarily. This is called the trading of water rights."
        },
        {
            "text": "More information can be found here:"
        },
        {
            "text": "https://www.gov.uk/guidance/water-management-apply-for-a-water-abstraction-or-impoundment-licence#trading-abstraction-rights"
        },
        {
            "text": "No ‘temporary’ weirs can be constructed to impound water and boost abstraction during low flow periods."
        },
        {
            "text": "Repairing weirs without consent is either a breach in Environmental Permitting Regulations (EPR) or land drainage consent depending if it’s on a main river or not."
        },
        {
            "text": "More information can be found here:"
        },
        {
            "text": "Owning a watercourse: https://www.gov.uk/guidance/owning-a-watercourse"
        },
        {
            "text": "Water abstraction digital service"
        },
        {
            "text": "You can now use the Managing Water Abstraction service on gov.uk to submit your water abstraction returns online, view your licence and past returns, and give someone access to manage your account."
        },
        {
            "text": "Some abstractors are now receiving Water Abstraction e-Alerts from the service, which are email notifications sent by the Environment Agency when flows are low and licence conditions mean that abstraction needs to reduce or cease. The e-Alerts also let abstractors know that flows have recovered so they can take water again. The alerts improve access to water when it is available, and better protect the environment and other abstractors when it is not."
        },
        {
            "text": "Details about how to manage your water abstraction or impoundment licence online can be found here: www.gov.uk/manage-water-abstraction."
        },
        {
            "text": "More information about e-Alerts can be found here: https://defradigital.blog.gov.uk/2022/08/23/preservation-compliance-and-registration-three-keys-to-managing-our-precious-water-resources/"
        },
        {
            "text": "Spray irrigation"
        },
        {
            "text": "Sprinkler/spray irrigation is the method of applying water to a controlled manner in that it is similar to rainfall. The water is distributed through a network that may include pumps, valves, pipes, and sprinklers."
        },
        {
            "text": "Spray irrigation abstraction licence holders should have a number of actions to ensure the efficient use of water on the farm."
        },
        {
            "text": "Many of these measures represent best practice and will help to make the most of the water which the licence authorises to take."
        },
        {
            "text": "Information on how to manage water use, levels, drainage and irrigation, and avoid pollution from waste water and sheep dip, can be found here: https://www.gov.uk/guidance/manage-water-on-land-guidance-for-land-managers"
        },
        {
            "text": "Environment Agency updated prospects for irrigation - forecast for 2023, can be found here: https://www.farmingadviceservice.org.uk/technical-articles"
        },
        {
            "text": "Farming Rules for Water"
        },
        {
            "text": "Any new water sources would also need to comply with the new farming rules for water regarding livestock and protecting water sources."
        },
        {
            "text": "Details of the ‘farming rules for water’ can be found here: https://www.gov.uk/government/publications/farming-rules-for-water-in-england"
        },
        {
            "text": "Horticulture, water infrastructure and grants"
        },
        {
            "text": "The Department for the Environment, Food & Rural Affairs (Defra) is supporting farmers and growers to boost horticultural production by providing targeted productivity grants, such as those through the Farming Investment Fund and Farming Innovation Programme."
        },
        {
            "text": "For long-term planning of on-farm water infrastructure, such as water reservoirs and new irrigation systems, the Rural Payments Agency launched the Water Management grant."
        },
        {
            "text": "More information can be found here:"
        },
        {
            "text": "Water Management grants: get ready for round 2"
        },
        {
            "text": "https://defrafarming.blog.gov.uk/2023/04/04/water-management-grants-get-ready-for-round-2/"
        },
        {
            "text": "Apply for a Water Management grant"
        },
        {
            "text": "https://defrafarming.blog.gov.uk/2023/04/19/apply-for-a-water-management-grant/"
        },
        {
            "text": "Grants available in 2023"
        },
        {
            "text": "https://defrafarming.blog.gov.uk/2023/03/02/grants-available-in-2023/"
        },
        {
            "text": "Reporting incidents"
        },
        {
            "text": " "
        },
        {
            "text": "If you are out and about please report incidents to our hotline 0800 80 70 60."
        },
        {
            "text": "It's free and open 24 hours a day."
        },
        {
            "text": "Incidents you should report if you see them include:"
        },
        {
            "text": "More information on other incidents we would like to know about and how to report can be found here: https://www.gov.uk/report-an-environmental-incident"
        },
        {
            "text": "If you have any questions or queries you can call our National Customer Contact Centre for advice on 03708 506 506."
        }
    ]
}