{
    "url": "https://environmentagency.blog.gov.uk/2023/06/15/launch-of-the-chalk-stream-strategys-implementation-plan-by-charles-rangeley-wilson-chair-of-the-chalk-stream-restoration-group/",
    "title": "Launch of the Chalk Stream Strategy’s Implementation Plan by Charles Rangeley-Wilson, Chair of the Chalk Stream Restoration Group",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2023-06-15T13:55:35+00:00",
    "content": [
        {
            "text": "Today we formally launched the Implementation Plan for the recommendations in the Chalk Stream strategy."
        },
        {
            "text": "This is something of a first - or several firsts - in the now long history of action plans, charters and reports about the state of our chalk streams."
        },
        {
            "text": "It’s the first Implementation Plan, for a start. There will be others in the future, reflecting progress, highlighting shortfalls, outlining commitments and timetables."
        },
        {
            "text": "It is the first time that all parties – regulators, industry, NGOs and stakeholders – have debated, agreed and signed up to delivering the recommendations in a national strategy to restore good health to our chalk streams."
        },
        {
            "text": "It’s the first time that following through on those recommendations has been built into the process, so that we can all hold the delivery to account."
        },
        {
            "text": "And it’s the first time - in my view - that we have been forensic, realistic and pragmatic about the actions required, how long these will take to enact, and how iterative the process is."
        },
        {
            "text": "All of which adds up to a strategy and plan that is more likely to yield results than anything we have seen before. Not that we haven’t seen progress before now, but the pace has been achingly slow and the process mostly adversarial."
        },
        {
            "text": "In October 2021, we launched the Chalk Stream Strategy at a conference, situated on the banks of Hertfordshire’s River Mimram and that day the chalk stream turned a vivid and alarming shade of purple. Half an hour later the stream had cleared and happily, if puzzlingly, there was no apparent damage to the river life or remnant of the cause."
        },
        {
            "text": "But of course, a photo of the purple chalk stream hit social media in a big way. I saw the purple Mimram as a symbol of something else entirely, however: this was surely an all too vivid demonstration of exactly why we need a chalk stream restoration strategy."
        },
        {
            "text": "For a start, some people are careless around rivers and pour stuff into them without thinking. And secondly, because there is a lot of cynicism around progress. Some are fed up with what they see as irredeemably careless regulators, and a rapacious water industry."
        },
        {
            "text": "They’ve given up believing that things will ever get better, as much as they have started to believe they have never been worse."
        },
        {
            "text": "There is no silver bullet, no Damascene moment in chalk stream restoration, which is hard to take when you so desperately want there to be one."
        },
        {
            "text": "This despair is also built on a lack of historical perspective. Anyone who thinks chalk streams are generally worse now than ever in history was not paying attention in 1989."
        },
        {
            "text": "Without for a moment suggesting things are good enough now, it is true that against a 1990 baseline, groundwater abstraction is lower, phosphorus concentrations are lower at least downstream of larger sewage works and long-term trends in river insect communities show a general improvement, especially in urban areas."
        },
        {
            "text": "The Chalk Stream Strategy and the Implementation plan, which we launch today, are about illuminating what is broken, identifying how we fix those things with solutions that are simple, pragmatic and almost unarguable, and holding us to the task of actually going ahead and fixing them."
        },
        {
            "text": "Over time the Implementation Plan will set out timelines and goals relating to all the recommendations in the strategy. It is designed to be re-published regularly, to reflect progress where it has happened and highlight lack of it, where it hasn’t."
        },
        {
            "text": "Progress made to date and reflected in the plan includes:"
        },
        {
            "text": "as well as commitments in the Plan for Water to:"
        },
        {
            "text": "That’s all good news. This collaborative and ambitious work is only just at the beginning, but at least it is underway."
        },
        {
            "text": "Read the Chalk Streams Restoration Strategy here and the Implementation Plan here"
        }
    ]
}