{
    "url": "https://hmlandregistry.blog.gov.uk/2023/06/15/making-electronic-signatures-and-digital-identity-easier-to-use/",
    "title": "Making electronic signatures and digital identity easier to use",
    "authors": [
        "Michael Abraham, Product Owner",
        "Abbie Purslow, Land Registrar"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2023-06-15T16:10:11+01:00",
    "content": [
        {
            "text": "In summer 2020 we published our groundbreaking electronic signature practice. This offered a convenient and secure alternative to wet-ink signatures for deeds and documents relating to property transactions, removing the last requirement for a wet-ink signature."
        },
        {
            "text": "This was followed in 2021 with the launch of our Digital Identity Standard. The standard outlined the four requirements for digital identity tools for use in land registration purposes. This standard was written to a level of assurance that, if met, the conveyancer would be protected in the event that their client was not who they claimed to be, as HM Land Registry would not exercise its rights of recourse."
        },
        {
            "text": "While the initiatives were vital during the pandemic, we were also looking to the future and the enabling of secure and convenient digital land and property transactions. We have always envisioned digital identity and electronic signatures, along with digital, machine-readable data as critical to this objective."
        },
        {
            "text": "It is clear that the market is starting to use these tools and embracing the security and convenience they afford. We are seeing more firms using electronic signing platforms and conveyancer-certified electronic signatures; the benefits of quicker circulation of documents, less reliance on the postal system and a reduction in administrative tasks seen as just some of the key benefits of electronic signing. InfoTrack’s 2022 Digital Conveyancing Maturity Index found that 66% of firms used digital identity and 78% have electronic signature solutions in place."
        },
        {
            "heading": 2,
            "text": "The next generation of electronic signatures"
        },
        {
            "text": "To maximise the impact of this opportunity, we need to move away from viewing identity and electronic signatures as separate solutions with different outcomes. The security of an electronic signature comes from the technology that supports it, and, importantly, the standard of identity verification it is based."
        },
        {
            "text": "Digital identity and electronic signing tools are not always connected, so conveyancers may have to use one app for an identity check and another for the electronic signature. This is clearly not ideal for property transactions where ease of use and costs are important. Uniformity of approach to e-signing and online identity verification is seen as an outcome to work towards, as outlined in the recent Industry Working Group final report."
        },
        {
            "text": "That’s the opportunity that Qualified Electronic Signatures (QES) offer which we are currently testing through the pilot we wrote about previously. Hugh James solicitors are early adopters, having completed the first QES transaction lodged at HM Land Registry (HMLR):"
        },
        {
            "text": "Due to growing interest in QES, last month we extended the scope of the pilot to include some categories of mortgages."
        },
        {
            "text": "We recently attended the Department for Science, Innovation and Technology’s Digital Identity and Attributes Trust Framework (DIATF) adoption sprint for the property sector, and were encouraged by the appetite to adopt, within a regulated framework reusable identities and the credibility provided by the HM Land Registry digital identity standard, and the role that could play in adoption."
        },
        {
            "heading": 2,
            "text": "Bringing them together"
        },
        {
            "text": "So, what’s the future? We’re starting to see glimpses of enhancements linking digital identity verification and electronic signatures within the same tools, and it’s really encouraging. This is expected to lead towards the neat packaging of a certified provider, offering a trusted and reusable identity, held on a device in a digital wallet with QES signing functionality – all for a reasonable cost. So, what could that mean for conveyancers and their clients?"
        },
        {
            "text": "It could lead to a certified identity, to an agreed standard, which is also compliant with both HM Land Registry and Anti-Money Laundering standards. Ideally these could be re-used and relied upon by multiple parties in the transaction under trust framework principles; from estate agent to mortgage broker, through to lender and conveyancer, thereby eliminating the need for a party to a property transaction to prove their identity several times with each stage of the transaction"
        },
        {
            "text": "It could also deliver the ability to sign documents using a very secure digital signature without the need for witnessing, using the same digital tool, included in the same price."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "And then? We hope we can move away from electronic documents and towards the signing of data that can be read and validated instantly by HM Land Registry and other parties such as conveyancers. All of this plays an important part in our view of a simpler, quicker property market; one where property is bought and sold entirely digitally."
        },
        {
            "text": "For more guidance on how to use electronic signatures now, you can watch our latest webinar. We would also welcome any feedback you have on the use of electronic signature tools, or on our practice, to help inform our ongoing work in this area."
        }
    ]
}