{
    "url": "https://marinedevelopments.blog.gov.uk/2023/06/15/mmo-joins-operation-seabird-2023-and-encourages-everyone-to-act-responsibly-around-marine-wildlife/",
    "title": "MMO joins Operation Seabird 2023 and encourages everyone to act responsibly around marine wildlife",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine conservation",
        "Uncategorized"
    ],
    "pub_date": "2023-06-15T13:17:39+01:00",
    "content": [
        {
            "text": "Here in the UK we are never far away from the coastline. Our stunning shores, sandy beaches and coastal paths attract millions of visitors every year. This brings an economic boost to local communities, and alongside the growth of staycations we have seen a rise in people enjoying activities on or near the water, such as paddleboarding, kayaking and jet skiing, as well as wildlife tours or even wild swimming in more remote areas. This has led to a rise in reports of marine wildlife disturbance as these activities have the potential to disturb marine wildlife, leading to behaviour changes from what would normally be seen in wild animals."
        },
        {
            "text": "What is Operation Seabird?"
        },
        {
            "text": "Operation Seabird (#OpSeabird) was created by Geoff Edmond of the RSPCA in 2021, with the aim of addressing the issue of wildlife disturbance through education. It began as a local initiative in North and East Yorkshire, bringing together the resources of coastal partnerships, management schemes and enforcement agencies."
        },
        {
            "text": "#OpSeabird is now a police led operation with forces and joint partners working together, across England, Scotland and Wales. This network brings together knowledge and expertise from a variety of agencies and organisations to tackle coastal wildlife crime, marine wildlife disturbance and antisocial behaviour on over 30,000km of British coastline. Associates of the program engage and educate the public and local stakeholders about how to enjoy our coastal habitats while minimising negative impacts on our marine wildlife."
        },
        {
            "text": "Impacts of human activity on marine wildlife"
        },
        {
            "text": "We know that the impacts of human activity and disturbance on marine wildlife can be immediately noticeable, for instance through obvious changes in behaviour. However, there may also be more subtle or long-term impacts, including changes to feeding, nesting, socialising or breeding behaviours. On land, ground nesting birds may often be disturbed by people walking close to their nests. While this may cause the mother birds to flee the nest, which is an obvious and immediate response, this could have longer term impacts, such as chick predation or the mother’s energy reserves being depleted, which are not immediately noticeable. At sea, vulnerable or endangered species of marine mammals may be deterred from accessing vital food sources and feeding in an area due to the noise and impact of watercraft."
        },
        {
            "text": "MMOs role in Operation Seabird  "
        },
        {
            "text": "As England’s marine manager, we protect and develop our seas, coasts and communities. This includes the conservation of wildlife, habitats and species. As an Operation Seabird partner, we will be helping to deliver targeted Days of Action in various coastal areas across the summer, engaging with boat operators, jet ski operators and the public. During these events, we provide clear guidance designed to help prevent wildlife disturbance from occurring."
        },
        {
            "text": "In 2022, Days of Action were held in Southwold, Torquay, Godrevy, Ilfracombe and Bude to name but a few.  As marine wildlife concerns differ around the coast and with the time of year, as well as with the local level of protection, events are tailored to the specific concerns for that area. More events will be held around our coast in 2023. Stay tuned for further details."
        },
        {
            "text": "Marine and Coastal Wildlife Code"
        },
        {
            "text": "To avoid disturbing wildlife, there are a number of simple rules which you can follow such as observing from a distance, avoiding certain areas at certain times of the year and not overstaying your welcome."
        },
        {
            "text": "The Department for Environment, Farming and Rural Affairs, (DEFRA) has recently published its Marine and Coastal Wildlife Code, which provides useful guidance and information on how we should all aim to conduct ourselves on the coast."
        },
        {
            "text": "Resources "
        },
        {
            "text": "For more information about Operation Seabird, please follow MMO’s social channels on Twitter, Facebook, LinkedIn and Instagram. You can also search using the hashtag #OpSeabird to find local organisations taking part in your area. Find us @SeabirdOp #OpSeabird #EnjoyRespectProtect #ObserveDontDisturb"
        },
        {
            "text": "Other useful information:"
        }
    ]
}