{
    "url": "https://deframedia.blog.gov.uk/2023/06/15/tree-planting-grows-in-england/",
    "title": "Tree planting grows in England",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-06-15T10:17:52+01:00",
    "content": [
        {
            "text": "Today we are looking  at the latest government tree planting statistics published by the Forestry Commission"
        },
        {
            "text": "Overall, tree planting rates in England have increased since last year. The statistics show that the area of woodland creation in England has increased by 40 percent since last year to 3,128 hectares."
        },
        {
            "text": "This  increase was despite a difficult tree planting season with planting conditions affected  by drought, which  made it particularly challenging for young trees to establish"
        },
        {
            "text": "Commenting on the statistics, Forestry Minister Trudy Harrison said:"
        },
        {
            "text": "The annual statistics reflect how our England Trees Action plan has kickstarted tree planting across the country  with a holistic approach to growing our tree cover while also ensuring that we are planting the right tress in the right place."
        },
        {
            "text": "We are supporting farmers, local authorities and other landowners to plant trees in urban and rural areas. We are supporting landowners and farmers to increase tree cover through the England Woodland Creation grant scheme, encouraging diverse woodland types and tree species, this sits alongside our network of regional Community Forests and Woodland Creation Partnerships that create new woodlands near to where people live, and schemes focused on planting trees in urban areas such as the Local Authority Treescapes Fund and the Urban Tree Challenge Fund."
        },
        {
            "text": "We’re  funding nurseries to boost the supply healthy seeds and trees. We have awarded almost £3m for tree nursery projects via the Tree Production Capital Grant and Innovation Fund, in addition to £800k via the Seed Sourcing Grant to support our future seed supply."
        },
        {
            "text": "We are also boosting the domestic timber industry so that we can use more home-grown timber across the UK’s construction industry. Our The Woods into Management Forestry Innovation Funds is supporting projects which will develop new technologies and working practices to help homegrown timber production meet domestic and international demand – helping to bolster timber security and grow the United Kingdom’s forestry and primary wood processing sectors, which support 30,000 jobs and contribute over £2 billion to our economy every year."
        },
        {
            "text": "Due to these efforts our tree planting programme will help us reach net zero by 2050, reduce the impact of climate change and  turn the tide on biodiversity decline."
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}