{
    "url": "https://environmentagency.blog.gov.uk/2023/06/15/working-to-improve-norfolks-chalk-streams/",
    "title": "Working to improve Norfolk’s chalk streams",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-15T10:03:14+00:00",
    "content": [
        {
            "text": "Today, as the Chalk Stream Restoration Strategy (CSRS) Implementation Plan, is officially launched, our Norfolk catchment coordinator Amy Prendergast tells us about some partnership projects she has worked on to help improve chalk streams in Norfolk."
        },
        {
            "text": "As a catchment coordinator in Norfolk for the Environment Agency my role has many elements.  I develop projects to improve our rivers and lakes with partner organisations, I support local catchment partnerships - groups of organisations that come together to improve the water environment and I organise grant funding for projects on our programme.  A big part of my job is looking at how we can work with others to improve chalk streams. Chalk streams are a rare and valuable habitat, often referred to as the equivalent of England’s rainforests. It is estimated that 85% of the world’s chalk streams are in England and around 29% of these are in East Anglia. Most water we drink in the east, comes from rainwater stored deep beneath our feet in natural chalk ‘aquifers’, which also feed our chalk streams."
        },
        {
            "text": "Most recently I completed a river restoration with the Norfolk River Trust and Norwich City Council along the River Yare. We added woody debris to narrow the river, after it was historically altered to help with milling, this will benefit wildlife and improve water quality. Another factor that is in the forefront of my mind is how we can make our projects greener. With this restoration, the Norfolk River Trust project manager used heavy horses to bring the wood on site, this meant heavy machinery wasn’t needed and in turn reduced the project’s carbon footprint. You can read more about this project here: Rare Norfolk chalk stream improved for people and wildlife - GOV.UK (www.gov.uk)"
        },
        {
            "text": "I have also been working with the Norfolk Rivers Trust on a river restoration project on two tributaries of the River Wensum which is an internationally important chalk stream.  The project will improve the water quality by providing areas for fine silts to settle out of the water. It will also help habitats to absorb water in high flows and then slowly release it during the summer months which will benefit wildlife and help during times of drought. This was done by enhancing farmland and reversing historic drainage work to create a shallow meandering channel which reconnected the river with the surrounding floodplain. This will keep the soil wet which should mitigate against the climate crisis as it will reduce the carbon lost from the organic matter in the soil.  In times of high water, when the streams usually carries sediment, the stream will spread onto the floodplain meaning the sediment leaves the chalk stream. This improves water quality and in stream habitat quality as there is less fine sediments being deposited on river gravels leaving them to be clear and have spaces in between the stones for invertebrates."
        },
        {
            "text": "Old drainage ditches have been blocked to capture water and this will also help to raise the water table. This will retain water on site, sustaining wetter habitats over the summer months, which is good for the species that depend on these habitats. An estimated 0.5 hectares of woodland is also going to be created on one of the sites to link the site to the adjacent woodlands, this will be an important wildlife corridor between two existing wildlife sites."
        },
        {
            "text": "Over on the River Bure I am working with the National Trust and other partners on 8 miles river habitat restoration and 7 miles wetland restoration, known as the Upper Bure Riverlands project. The work will  improve water quality in this chalk stream and has established a diverse habitat for nature to thrive including water voles and eels. The hope is that work may even lead to the re-introduction of the bullhead, a small brown mottled fish also known as miller’s thumb, this species was historically wiped out. This work is complemented by a project with Norfolk Rivers Trust to restore eels to the catchment by allowing easier passage for elvers (young eels) around mills. I am currently working with students from University of East Anglia to better understand the issues for eels around certain structures and where the most suitable site is to re-introduce the bullhead. We are also preparing for phase 2 of the Riverlands project which will have more of a focusing on restoring the hydrology I will be exploring nature-based solutions that will help to do this. Read more here: Restoring the River Bure | Norfolk | National Trust"
        },
        {
            "text": "Additional information"
        },
        {
            "text": "If you have any questions or queries you can call our National Customer Contact Centre for advice on 03708 506 506."
        }
    ]
}