{
    "url": "https://insidedvla.blog.gov.uk/2023/03/28/5-myth-busting-facts-about-taxing-your-vehicle/",
    "title": "5 myth-busting facts about taxing your vehicle",
    "authors": [
        "Paul Davies"
    ],
    "categories": [
        "Enforcement",
        "Features",
        "Vehicle tax"
    ],
    "pub_date": "2023-03-28T16:17:19+01:00",
    "content": [
        {
            "text": "By law, you must tax your vehicle if you’re using it or keeping it on a public road. If you’re keeping the vehicle off the road, you must either tax it or register it as off the road by making a ‘Statutory Off Road Notification’ (SORN)."
        },
        {
            "text": "If you do not tax your vehicle, you could find your vehicle clamped or impounded. You could also face financial penalties or court action. So, remember to tax your vehicle on time - it’s never been easier!"
        },
        {
            "text": "In this blog, we tackle several of the biggest myths about vehicle tax."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "MYTH 1: I need to pay vehicle tax up front every year"
        },
        {
            "text": "Wrong! You can set up a Direct Debit when you tax your vehicle online (your vehicle must be insured and have a valid MOT in place if it needs one). By setting up a Direct Debit, you can spread the cost by paying your vehicle tax annually, 6 monthly or monthly - whatever works best for you!"
        },
        {
            "text": "Your Direct Debit will renew automatically when your vehicle tax is due to run out (providing you’re shown as the registered keeper and the vehicle has a valid MOT and insurance). So, there’s no need to worry! Find out more about setting up a Direct Debit for vehicle tax."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "MYTH 2: I’ve just bought a car - I cannot tax my vehicle because I do not have a V5C registration certificate (log book) in my name "
        },
        {
            "text": "If you’re the new keeper, you can use the green ‘new keeper’ slip from the log book to tax your vehicle straight away."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "MYTH 3: My vehicle is exempt from vehicle tax, so I do not need to do anything"
        },
        {
            "text": "In fact, you must still tax your vehicle even if you do not need to pay anything."
        },
        {
            "text": "Some types of vehicles are ‘exempt’ from vehicle tax, which means you do not need to pay, but you still need to tax the vehicle. The quickest way to do this is using our online service."
        },
        {
            "text": "If you’re unsure if your vehicle is exempt from vehicle tax, read our guidance on GOV.UK. To tax your vehicle as exempt for the first time, for example as disabled, you need to change your vehicle’s tax class."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "MYTH 4: I cannot drive a vehicle registered off the road, sometimes called a Statutory Off Road Notification (SORN), to an MOT test"
        },
        {
            "text": "Wrong. If you’ve pre-arranged an MOT test you can drive a SORN vehicle to its appointment."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "MYTH 5: I’ve not received a V11 vehicle tax reminder form so I cannot tax my vehicle"
        },
        {
            "text": "If you haven’t received your V11 vehicle tax reminder, you can use your V5C registration certificate (log book) instead. Your V5C will have a reference number which you can use to tax your vehicle."
        },
        {
            "text": "If you’ve changed address, let us know by updating the address on your V5C. If your vehicle needs taxing in the next 4 weeks, you’ll need to tax your vehicle using your current V5C before changing your address."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Tax on time, tax online"
        },
        {
            "text": "Use GOV.UK to check if your vehicle is taxed. If you need to tax your vehicle, you can do so quickly and securely online 24 hours a day, 7 days a week on GOV.UK."
        },
        {
            "text": "Simply visit www.gov.uk/vehicle-tax and read the information on the page. Check you have everything you need and click ‘Start now’. Answer the questions on each page and complete the required information to tax your vehicle - sorted. So, tax it, don’t risk it!"
        },
        {
            "text": " "
        }
    ]
}