{
    "url": "https://marinescience.blog.gov.uk/2023/03/28/breaking-the-green-tide/",
    "title": "Breaking the Green Tide: Developing innovative techniques to tackle nuisance green seaweed mats in coastal areas of England and France",
    "authors": [
        "Elisa Capuzzo"
    ],
    "categories": [
        "Aquaculture",
        "Fisheries",
        "Pollution",
        "Science",
        "Seaweed"
    ],
    "pub_date": "2023-03-28T10:25:45+01:00",
    "content": [
        {
            "text": "Coastal areas of the Channel Manche region (between England and France) have an excess level of nutrients (such as nitrogen) from river run-off and urban discharges, which causes excessive growth of green algal mats. Seaweeds will begin to build up over time on mudflats forming dense mats containing many layers of individual algae (Figure 1). Decaying algal mats are unpleasant to look at, and cause reductions in biodiversity and prey density for wading birds and wildfowl. The gases produced during seaweed decomposition can also be toxic to animals and humans if present in high quantities."
        },
        {
            "text": "Figure 1. Green algal mats in intertidal areas."
        },
        {
            "heading": 3,
            "text": "Finding a solution to the problem"
        },
        {
            "text": "Some intertidal and coastal areas of southern England (such as Poole Harbour and Langstone Harbour) and northern France are particularly impacted by these dense algae mats, with negative effects on the environment, economy and human health."
        },
        {
            "text": "To address this issue, an international team of researchers from universities and research organisations in France and England, led by the University of Portsmouth, has been working on the RaNTrans project for the past three years. The project aims to find innovative and cost-effective methods to reduce algal mat coverage in the Channel Manche region."
        },
        {
            "text": "“The RaNTrans project has represented a unique opportunity to collaborate with research organizations and universities in France (CEVA, ARGANS, Aleor, Université de Caen Normandie, Université de Bretagne Occidentale) and England (University of Portsmouth, Bournemouth University, Natural England) allowing cross-border knowledge sharing on methods to reduce nutrient levels in coastal regions” explained Cefas senior scientist Elisa Capuzzo."
        },
        {
            "text": "The project, which is coming to an end this year, investigated different nutrient removal methods including mechanical removal of algal mats, feeding algal mats to polychaete worms and converting these to aquaculture feed, seaweed aquaculture (Figure 2), and European oyster aquaculture."
        },
        {
            "text": "Figure 2. Seaweed aquaculture."
        },
        {
            "text": "Today (28 March) the international RaNTrans team are coming together in Pleubian (France), hosted by CEVA, to summarise the outputs of the project and discuss the next steps."
        },
        {
            "heading": 3,
            "text": "Cefas’ role in the project"
        },
        {
            "text": "Cefas, with its experience in developing models for seaweed growth (Modelling the distribution and growth of ‘problem’ green seaweed in the Medway estuary, UK | SpringerLink), has contributed to the project by modelling macroalgal mats occurrence in two English estuaries, Langstone and Poole Harbours (Figure 3)."
        },
        {
            "text": "Figure 3. Hydrodynamic model of Poole Harbour."
        },
        {
            "text": "Seaweed mat occurrence was predicted by modelling physical and nutrient conditions at the two study sites."
        },
        {
            "text": "John Aldridge, senior modeller at Cefas, explained: “Model simulations indicated that seaweed occurrence in Langstone and Poole Harbours was strongly linked to lower current speeds. Higher probability of occurrence of seaweed was also associated with low inundation (i.e. relatively long periods of the estuaries uncovered by water).”"
        },
        {
            "text": "This knowledge will help identify water bodies most at risk from excessive nutrient loads and allow us to better predict the response to possible remediation options."
        },
        {
            "heading": 3,
            "text": "The next steps"
        },
        {
            "text": "The resulting maps of the predicted occurrence of seaweed mats from the modelling (Figure 4) and satellite products will be available through the RaNTrans website, together with the multiple outputs generated by the project."
        },
        {
            "text": "Figure 4. Predicted occurrence of algae mats in Langstone Harbour."
        },
        {
            "text": "Gordon Watson (University of Portsmouth), RaNTrans’ principal investigator concludes “Through the hard work of the RaNTrans team we have been able to scientifically assess a suite of interventions to decrease the impact of algal mats and reduce nutrient concentrations. Our next task is to compare the cost-effectiveness of these methods and then to secure funding to scale these up to the harbour/estuary in both countries, which we hope will improve water quality across the Channel.”"
        },
        {
            "heading": 4,
            "text": "For more information and the latest updates on the project:"
        }
    ]
}