{
    "url": "https://rpc.blog.gov.uk/2023/03/28/defra-called-out-for-not-producing-post-implementation-reviews/",
    "title": "Defra called out for not producing post-implementation reviews",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2023-03-28T12:37:25+01:00",
    "content": [
        {
            "text": "The Office for Environmental Protection (OEP) yesterday published a report criticising the Government’s failure to publish post-implementation reviews (PIRs) on environmental legislation despite this being a legal requirement in many cases."
        },
        {
            "text": "The OEP show that the Department for the Environment, Food and Rural Affairs (Defra) has not published PIRs on at least 40 recent occasions and that there were similar failures by other government departments."
        },
        {
            "text": "In their report, the OEP recommend:"
        },
        {
            "text": "Recommendation 1: Government departments should set out time-bound delivery plans for publishing their outstanding, and upcoming, post-implementation review reports of environmental laws, prioritising those laws for which there is currently no published report. These plans and their prioritisation should reflect the need for post-implementation review to inform decisions about specific laws arising in connection with, for example, the REUL, Energy, and Levelling-up and Regeneration Bills."
        },
        {
            "text": "Recommendation 2: Government should ensure that, before it proposes to keep, amend, repeal or replace an environmental law it, Parliament, the public and others, have recourse to an up-to-date post-implementation review report (or similar evaluation of the law’s implementation where post-implementation review is not a legal requirement). This means a review should be completed and a report published in good time ahead of decisions being taken in relation to that law. Any discrepancy between the findings of the report and the proposed decision should be explained."
        },
        {
            "text": "Recommendation 3: All government departments should ensure wherever relevant that post-implementation reviews are undertaken taking appropriate account of implications for environmental protection and improvement, including by considering relevant environmental policies, targets and legislation."
        },
        {
            "text": "The RPC has also been critical of the Government’s performance on PIRs more generally. Our blog post Is regulation working as intended?  in September 2021 commented that, in the previous two years, less than 40% of PIRs had been completed on time – and since then the situation has not improved. We commented on how important PIRs are to improving regulation. They assess whether legislation is having the intended effect and whether the actual impacts are similar to those expected when the policy was put in place. They ensure consideration of whether changes to regulation are required."
        },
        {
            "text": "We support the OEP’s work looking at how well departments have been doing on PIRs. Their conclusions – challenging not only Defra, but also other departments who legislate on the environment (notably the Department for Business, Energy and Industrial Strategy (BEIS), the Department for Levelling UP, Housing and Communities (DLUHC) and the Department for Transport (DfT)) – reinforce our own concerns about the Government’s lack of commitment to evaluating legislation once it is in place."
        },
        {
            "text": "We are pleased that the Defra Secretary of State Thérèse Coffey has acknowledged that this is unacceptable and committed to address the backlog in her department by the end of next year. We hope that all departments will similarly address the backlog of both environmental and other PIRs, and we look forward to scrutinising those PIRs as they are produced."
        },
        {
            "text": "One of the five new regulatory principles that the Government has committed itself to in the Benefits of Brexit document is: “Recognising what works. We will thoroughly analyse our interventions based on the outcomes they produce in the real world and where regulation does not achieve its objectives or does so at unacceptable cost, we will ensure it is revised or removed.”"
        },
        {
            "text": "In order to deliver on that commitment departments need to carry out PIRs when they are required. They also need to act on their findings by revising or removing regulations as appropriate. It is therefore vital that the reformed Better Regulation Framework has stronger measures in place to ensure that PIRs are undertaken and that they are acted on."
        }
    ]
}