{
    "url": "https://nationalscreening.blog.gov.uk/2023/03/28/experts-discuss-models-for-personalised-breast-screening-based-on-risk/",
    "title": "Experts discuss models for personalised breast screening based on risk",
    "authors": [
        "Andrew Anderson"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-03-28T11:33:09+01:00",
    "content": [
        {
            "text": "Breast cancer is the most common form of cancer in the UK. Organised programmes, such as the NHS Breast Screening Programme (NHS BSP), improve breast cancer outcomes by finding signs of disease at a stage when treatment is likely to be more effective."
        },
        {
            "text": "Invited people should be given evidence based, unbiased, timely, balanced information in a format they can understand to help them make an informed choice about whether screening is right for them."
        },
        {
            "text": "This is because breast screening can tell some women they have a possible cancer when they do not, prompting potentially harmful follow-up investigations. It can also give false reassurance by telling others they do not need further tests when they do."
        },
        {
            "heading": 2,
            "text": "How risk stratification works"
        },
        {
            "text": "‘Risk stratification’ is the process of dividing the eligible population into groups based on their risk status to improve health outcomes. This has been proposed as a means of improving the balance of benefits over harms in the current national NHS BSP."
        },
        {
            "text": "Following an assessment of individuals’ relative risk of breast cancer, this could open the possibility of changing:"
        },
        {
            "text": "The NHS BSP already uses some risk stratification – offering additional screening for people with certain genes (BRCA1, BRCA2 or TP53), or with an identified family history of breast cancer."
        },
        {
            "text": "By further tailoring screening based on relative risk, it might be possible to achieve better outcomes than under the current one-size-fits-all population model."
        },
        {
            "heading": 2,
            "text": "Fact-finding event"
        },
        {
            "text": "Implementing changes to an established national cancer screening programme can be controversial and challenging. It is therefore important that those tasked with making recommendations on screening are engaging early with researchers, as the ground is being prepared for a future review of the evidence."
        },
        {
            "text": "The UK National Screening Committee (UK NSC) is the body that makes screening recommendations to ministers in England and the devolved nations."
        },
        {
            "text": "As part of its horizon scanning function, the UK NSC recently organised a risk stratification modelling event for researchers to showcase their work and outline possible improvements to the NHS BSP."
        },
        {
            "text": "It was the first risk stratification meeting organised by the UK NSC since its expansion to consider targeted and stratified screening in addition to whole population screening."
        },
        {
            "heading": 2,
            "text": "Thought-provoking presentations"
        },
        {
            "text": "No decisions were made at the modelling event, but there were a series of  presentations which prompted a wide ranging and thought-provoking discussion."
        },
        {
            "text": "One thing was clear: introducing risk stratification into an existing screening programme will not be easy."
        },
        {
            "text": "One presentation modelled 99 scenarios of risk-stratified breast screening to find the most effective. Another considered 551,368 scenarios."
        },
        {
            "text": "The presentations considered a wide range of factors, including the potential impact of risk stratification on women of different ethnicities, given their varying levels of risk."
        },
        {
            "text": "There was plenty of discussion about the possibilities offered by risk stratification for more, or less, screening, and how this might be received by women who have become accustomed to being invited for screening every 3 years."
        },
        {
            "text": "Overall, the range of presentations posed fascinating questions for the UK NSC to consider, including:"
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "Everyone at the meeting agreed on the importance of feeding good quality data into any risk stratification screening model. Bad data equals a bad model!"
        },
        {
            "text": "The task for the UK NSC and academics now is to find a way of comparing the models despite the large variation in what they are looking at, how they are put together, and their findings."
        },
        {
            "text": "This was one of the many challenges people took away from the meeting to discuss and work on."
        },
        {
            "text": "What is certain is that there is a huge amount of excellent research going on in this field and it is incredibly exciting to hear how it is progressing."
        },
        {
            "text": "As ever, there is a lot more work to be done and the UK NSC is keen to learn more. We’ll be sure to keep you up to date on progress via this blog."
        },
        {
            "text": "The UK NSC would like to thank all the presenters who took part in the meeting and looks forward to continuing to work alongside them."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}