{
    "url": "https://naturalengland.blog.gov.uk/2023/03/28/measuring-biodiversity-net-gain-publication-of-biodiversity-metric-4-0/",
    "title": "Measuring biodiversity net gain - Publication of Biodiversity Metric 4.0",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2023-03-28T09:48:37+01:00",
    "content": [
        {
            "text": "By Mike Burke, Programme Director – Sustainable Development"
        },
        {
            "text": "Hot on the heels of the recent policy updates and associated guidance from Defra last week, we're pleased to share the publication of the biodiversity metric 4.0, another important milestone for biodiversity net gain."
        },
        {
            "text": "This updates version 3.1 that was published in April 2022 and as per Defra’s recently published consultation response, Defra anticipate that biodiversity metric 4.0 will be the version of the metric that will become statutory. We have also published an updated version of the Small Sites Metric to align it with metric 4.0."
        },
        {
            "text": "Updates to biodiversity metric 4.0\nInformed by feedback from Defra’s metric consultation last Autumn, we have continued to listen and respond to feedback on previous biodiversity metric versions, incorporating much of the feedback received on version 3.1. The changes have largely focussed on further improving your experiences as users of the calculation tool and its accompanying guidance."
        },
        {
            "text": "The metric 4.0 updates now available include updated versions of:"
        },
        {
            "text": "To give you a flavour of the changes, the guidance has been streamlined and made more user friendly, work has been undertaken to ensure habitat names align as close as possible with relevant habitat classifications including UKHab and amendments to the calculation tool including creating a running total (area, length, and units) within the top of each page of the metric tool and changes to the way the spatial risk multiplier is applied."
        },
        {
            "text": "How did we get here?\nSince the original metric was published in 2012, a significant amount of work has been undertaken get to this point, none of which would have been possible without the welcome and valued contributions of others.\nWorking with stakeholders and partners, the Biodiversity Metric 4.0 is the culmination of feedback and input from across the environment, planning, land management, academic and development sectors.\nWe’ve been heartened by the widespread support for the principles behind the metric and the willingness of Local Authorities, developers, consultants and others to ‘get stuck in’, using the metric and road testing it. The biodiversity metric is already being used in a wide variety of ways, particularly by organisations who have decided to implement BNG ahead of it becoming a mandatory requirement. This engagement has been hugely valuable for Natural England and Defra to build confidence that we have an approach to measuring biodiversity gains that is both practical and scientifically robust.\nOne unexpected benefit that has emerged is that stakeholders feel the metric could have wider application beyond the implementation of BNG. This is particularly encouraging and we’d welcome engagement with anyone who thinks they could use this to pursue their organisation’s nature positive’ ambitions."
        },
        {
            "text": "The future of the biodiversity metric\nWith its anticipated future adoption as the statutory biodiversity metric, together with the Government’s recent BNG policy consultation response and coming publication of further guidance, the publication of Metric 4.0 is another step towards biodiversity net gain becoming mandatory."
        },
        {
            "text": "The next steps as per Defra’s response to the consultation on the biodiversity metric are:"
        },
        {
            "text": "“Natural England will publish the next version of the biodiversity metric, including the calculation tool for biodiversity metric 4.0, the calculation tool for the small sites metric, and the associated guidance documents following this government response. At the time of publishing biodiversity metric 4.0 and this consultation response, the relevant provisions in the Environment Act will not yet be in force. Therefore, at this time, biodiversity metric 4.0 will not be mandatory to use."
        },
        {
            "text": "\"We anticipate that this next version of the biodiversity metric, including the small sites metric, will form the basis of the statutory metric, for the purposes of Schedule 7A of the Town and Country Planning Act 1990 as introduced by Schedule 14 of the Environment Act 2021, once published by Defra’s Secretary of State. This will become mandatory to use once it is laid before Parliament, expected to be November 2023.”"
        },
        {
            "text": "A full version of Defra’s consultation response on the biodiversity metric is available on Gov.uk."
        },
        {
            "text": "Whilst the work does not stop here, Natural England will continue to work behind the scenes with stakeholders and interested parties on potential future improvements to the metric and will advise Government accordingly on these, with an understanding that major updates will occur at intervals every 3-5 years."
        },
        {
            "text": "We’d encourage you to familiarise yourself with the metric tool and its supporting guidance. Should you have any technical questions or queries not addressed through the accompanying guidance about the Metric 4.0 please email biodiversitymetric@naturalengland.org.uk"
        },
        {
            "text": "If you'd like to know more about mandatory biodiversity net gain, check out the most recent information here."
        }
    ]
}