{
    "url": "https://environmentagency.blog.gov.uk/2023/03/28/permitting-a-new-nuclear-power-station-sizewell-c/",
    "title": "Permitting a new nuclear power station - Sizewell C",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2023-03-28T08:37:56+00:00",
    "content": [
        {
            "text": "Simon Barlow is the Environment Agency’s project manager for Sizewell C. Here he talks about the challenges of permitting a new nuclear power station and the importance of engaging with local communities."
        },
        {
            "text": "Introduction"
        },
        {
            "text": "I started my job as Sizewell C project manager in 2010. I have worked for the Environment Agency since it was created in 1996 (and the National Rivers Authority - its predecessor - since 1990). In all those years this is, by far, the most challenging, exciting, interesting, and rewarding job that I’ve held."
        },
        {
            "text": "Our nuclear future"
        },
        {
            "text": "The Environment Agency is the independent environmental regulator for the nuclear industry in England. We make sure that nuclear power stations meet high standards of environmental protection."
        },
        {
            "text": "The government has set out its commitment to decarbonise the UK electricity system by 2035 which will involve increased deployment of low carbon energy technologies including renewables and nuclear. This builds on previous commitments set out in the government’s ‘Ten point plan for a green industrial revolution’ and the ‘Net zero strategy’. The  recent British Energy Security Strategy sets out how the UK is going to deliver a pipeline of new nuclear projects to contribute to this ambition. The Secretary of State for Business, Energy and Industrial Strategy granted development consent to the Sizewell C project in July 2022."
        },
        {
            "text": "Permitting Sizewell C"
        },
        {
            "text": "During the last thirteen years there have been many moments of challenge, but these have led to the moment where we can now begin to regulate the project. We started our pre-permit application discussions with NNB Generation Company (Sizewell C) Limited around a decade ago, which is hard to believe now. Our focus has always been to obtain the best outcome for the environment, which is tough to do in such a sensitive environment. Habitats and ecology must be protected, that is our starting point, and we have worked diligently to ensure that the operation of this power station will do so."
        },
        {
            "text": "During our journey we have worked tirelessly with our colleagues in Natural England and the Marine Management Organisation to ensure that our advice to NNB Generation Company (Sizewell C) Limited is joined up and helpful. We have managed to provide seamless advice and guidance which has benefitted the permit decision making process."
        },
        {
            "text": "We have met regularly with NNB Generation Company (Sizewell C) Limited, working constantly towards the objective of permit determination. Sometimes we hit barriers and sought better information, and this is right of course – as we are the regulator that protects this country’s environment, and its habitat. We wanted to be confident in our assessments and so demanded the best information available to help us reach our decisions. We broke through those barriers, and by doing so we have arrived at decisions, which are both thorough and robust."
        },
        {
            "text": "We have visited the site – improving our familiarity with the area and improving our knowledge of the habitat that is present both close to, and further away from, the site. I have been to the site many times over the last decade and each time I take away a new perspective."
        },
        {
            "text": "Importantly we have taken many lessons from EDF’s sister project at Hinkley Point C. Our work to regulate that project has provided many opportunities to transfer knowledge and thinking into our permit determination process for Sizewell C, only further increasing the robustness of our decisions."
        },
        {
            "text": "So what would these permits allow the company to do:"
        },
        {
            "text": "Engaging with communities in East Suffolk"
        },
        {
            "text": "We’ve been regularly visiting and talking with community representatives and environmental groups for several years now. Early engagement is really important to us, as is keeping everyone informed, and being open and transparent about what we are doing. Last summer, during our consultation, we met with local people in village halls and answered questions about our work. One of the most popular questions we were asked about was how confident we were that the sensitive ecology and habitats would be protected. Fortunately, we had completed a massive piece of work to assess the project against the Habitats Regulations and our conclusion had been reviewed, and agreed to, by Natural England – so providing positive answers was much easier."
        },
        {
            "text": "We’ll continue to meet with our stakeholders, in the months and years ahead, as the company takes forward its plans to build the power station. There will be further opportunities to get involved and have your say, and also to find out what our regulators and officers are up to at the construction site."
        },
        {
            "text": "Get more information"
        },
        {
            "text": "I’d encourage you to have a look at the documents we’ve published, particularly our public summary, where we provide information on what these permits are for – in an easy read!"
        },
        {
            "text": "Join our e-bulletin list if you’re interested in hearing more about our work at Sizewell or want to be kept informed about future engagement meetings or consultations. nuclear@environment-agency.gov.uk"
        }
    ]
}