{
    "url": "https://homeofficemedia.blog.gov.uk/2023/03/28/safe-and-legal-routes-factsheet-march-2023/",
    "title": "Safe and Legal Routes factsheet – March 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-03-28T10:49:06+01:00",
    "content": [
        {
            "text": "The UK has a proud history of providing protection for those who genuinely need it through our safe and legal routes. Since 2015, we have offered a safe and legal route to the UK to almost half a million men, women and children seeking safety, as well as family members of refugees. In fact, the UK is one of the largest recipients of UNHCR referred refugees globally, second only to Sweden in Europe since 2015."
        },
        {
            "text": "Our UK Resettlement Scheme, including Community Sponsorship and the Mandate Resettlement schemes, allow us to support the most vulnerable refugees direct from regions of conflict and instability. Through these schemes, the UNHCR refers refugees they have assessed as in need of resettlement to the UK."
        },
        {
            "text": "Our safe and legal routes are some of the most generous anywhere.  However, we cannot accommodate everyone who wants to come to the UK and we are not able to open a bespoke route for every situation."
        },
        {
            "text": "It is our longstanding principle that those in need of protection should claim asylum in the first safe country they reach. For many people, it is in their best interests to stay close to the region or in a neighbouring country where there are often similarities in culture and language, and can be supported by international organisations, including the UN."
        },
        {
            "text": "How many people has the UK provided refuge to?"
        },
        {
            "text": "Which nationalities has the UK helped – other than Afghans, Ukrainians, and Hong Kongers?"
        },
        {
            "text": "How can people from countries like Iran come to the UK to claim asylum?"
        },
        {
            "text": "Will you create a new safe and legal route?"
        },
        {
            "text": "How does the UNHCR assess people for resettlement in the UK?"
        },
        {
            "text": "What safe and legal routes does the UK offer?"
        },
        {
            "text": "The UK offers seven different safe and legal routes:"
        },
        {
            "text": "UK Resettlement Scheme"
        },
        {
            "text": "Community Sponsorship"
        },
        {
            "text": "Mandate Scheme"
        },
        {
            "text": "Family Reunion"
        },
        {
            "text": "Afghan Citizens Resettlement Scheme"
        },
        {
            "text": " Afghan Relocations and Assistance Policy (ARAP)"
        },
        {
            "text": " Hong Kong British Nationals (Overseas)"
        },
        {
            "text": "Ukraine Schemes"
        },
        {
            "text": "Do you provide other support for refugees other than safe and legal routes?"
        },
        {
            "text": "The Foreign, Commonwealth and Development Office provide humanitarian aid and support to refugees around the world. Some examples include providing £95m to aid refugees and vulnerable people in Jordan and humanitarian support for Rohingya people in Bangladesh."
        }
    ]
}