{
    "url": "https://educationhub.blog.gov.uk/2023/03/28/teacher-strikes-latest-everything-you-need-to-know-about-the-teacher-pay-offer/",
    "title": "Teacher strikes latest: Everything you need to know about the teacher pay offer",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "Teacher pay",
        "Teacher workload",
        "Trade Unions"
    ],
    "pub_date": "2023-03-28T18:10:04+01:00",
    "content": [
        {
            "text": "Teachers in England have been offered a pay rise after the Government set out an offer on pay, conditions and workload to the education unions."
        },
        {
            "text": "The offer follows more than a week of intensive talks between the Government and the National Education Union (NEU), National Association of Head Teachers (NAHT), the Association of School and College Leaders (ASCL) and NASUWT."
        },
        {
            "text": "Here we tell you everything you need to know about our pay offer for teachers, from how it’s funded to what it means for strikes, along with plans to tackle workload."
        },
        {
            "heading": 3,
            "text": "What is the Government’s pay offer for teachers?"
        },
        {
            "text": "Our offer includes pay increases for teachers for this academic year and next year."
        },
        {
            "text": "Teachers will receive a one-off payment of £1,000 for the current academic year."
        },
        {
            "text": "This is on top of the average pay rise of 5.4% which teachers received in September 2022. Teachers and leaders have been offered an average pay rise of 4.5% in 2023 to 2024. This is above the Office for Budget Responsibility (OBR) forecast for inflation at the end of this calendar year, which is 2.9% and forecast to fall further."
        },
        {
            "text": "The starting salary for new teachers will rise 7.1% to £30,000, delivering on the Government’s commitment."
        },
        {
            "text": "All four unions will now put this deal to their members."
        },
        {
            "heading": 3,
            "text": "Does the offer include anything about teacher’s working conditions?"
        },
        {
            "text": "As part of the offer, we have put forward reforms to teachers’ workload and conditions."
        },
        {
            "text": "Schools will be able to make their own decisions about pay progression, ending Performance Related Pay."
        },
        {
            "text": "Schools will get greater clarity on the timing of Ofsted inspections."
        },
        {
            "text": "A new taskforce will be created to help reduce workload by an average five hours a week for teachers and leaders."
        },
        {
            "heading": 3,
            "text": "How will the Government’s pay offer for teachers be funded?"
        },
        {
            "text": "Schools will receive further funding for the pay awards."
        },
        {
            "text": "The £1,000 one-off payment for teachers will be funded by Government, via a new grant to schools."
        },
        {
            "text": "Schools will receive an additional £2 billion in 2023 to 2024, and in 2024 to 2025, taking school funding to its highest level in history."
        },
        {
            "text": "Because energy costs are forecast to fall at a faster rate than previously expected, an average pay rise of 4% is now judged to be affordable for schools."
        },
        {
            "text": "The Institute for Fiscal Studies (IFS) also published an assessment of schools’ funding and costs, which comes to similar conclusions."
        },
        {
            "text": "Costs above this affordable 4% will also be provided for through the new grant."
        },
        {
            "heading": 3,
            "text": "Does this mean that schools will have to make cuts if the pay offer is accepted?"
        },
        {
            "text": "Based on school budgets over the period 2022 to 2024, after accounting for the increase in teacher pay in 2022, schools have a remaining £2.4 billion to fund:"
        },
        {
            "text": "The government will provide schools with further funding of around £620 million in 2023 to 2024, including a grant of £530 million for the one-off payment."
        },
        {
            "text": "Combining the existing headroom with the additional funding pledged in recent talks, schools should be able to give teachers an average pay increase of 4.5% without making cuts to other things."
        },
        {
            "heading": 3,
            "text": "How do teachers vote on the pay offer?"
        },
        {
            "text": "Unions will now put the offer to their members in the coming weeks."
        },
        {
            "text": "This is a fair and reasonable offer and we urge teachers and leaders to accept it."
        },
        {
            "text": "If the offer of more pay is rejected, pay for next year will go through the independent pay review process as usual."
        },
        {
            "text": "This will be disappointing for those teachers who want £1,000 extra this year and to be sure of a 4.5% pay increase next year."
        },
        {
            "heading": 3,
            "text": "Will there be more teacher strikes? "
        },
        {
            "text": "There are currently no further teacher strike dates confirmed but the NEU has threatened two further strike dates."
        },
        {
            "text": "It is deeply irresponsible that children’s education is disrupted because of trade disputes."
        },
        {
            "text": "With GCSE and A level exam periods approaching, students and their parents should not have to worry about potential strike disruption."
        },
        {
            "text": "Accepting this offer on pay, conditions and workload would prevent further disruption."
        }
    ]
}