{
    "url": "https://extremismcommission.blog.gov.uk/2023/03/28/the-commission-for-countering-extremism-publishes-annual-end-of-year-report-2022-23/",
    "title": "The Commission for Countering Extremism publishes annual End of Year Report 2022/23",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-28T09:20:22+01:00",
    "content": [
        {
            "text": "The Commission for Countering Extremism (CCE) today publishes its End of Year Report for 2022/23, highlighting the work undertaken by the CCE over the course of the last 12 months."
        },
        {
            "text": "The report provides a comprehensive overview of the CCE’s activities. This includes the success of its inaugural Policy Week, the commissioning of a portfolio of academic research papers, and ongoing engagement across the counter extremism sector."
        },
        {
            "text": "It also highlights fresh opportunities that have arisen for the CCE to enhance its role in advising and scrutinising the government’s approach to extremism."
        },
        {
            "text": "Key to this is the Independent Review of Prevent, which identified several areas where the CCE could be of assistance in helping refine Prevent’s attempts to stop people becoming terrorists or supporting terrorism. The CCE will offer support on a range of recommendations, including on training and the composition of advisory boards."
        },
        {
            "text": "Commissioner for Countering Extremism, Robin Simcox, says:"
        },
        {
            "text": "“We face major challenges in countering extremism. However, they are challenges that can be overcome."
        },
        {
            "text": "The CCE is at the forefront of this nation’s counter extremism efforts via the advice and scrutiny that we offer to government. This is supported by our ongoing engagement efforts, and determination to harness and disseminate fresh knowledge and innovation around extremism."
        },
        {
            "text": "We will look to expand on this work in the year ahead.”"
        },
        {
            "text": "Read the report here: Commission for Countering Extremism end of year report 2022 to 2023"
        }
    ]
}