{
    "url": "https://healthmedia.blog.gov.uk/2023/03/28/voluntary-scheme-for-branded-medicines-pricing-and-access-vpas-media-fact-sheet/",
    "title": "Voluntary scheme for branded medicines pricing and access (VPAS) - media fact sheet",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "Life Sciences",
        "Medicines"
    ],
    "pub_date": "2023-03-28T17:42:45+01:00",
    "content": [
        {
            "text": "This fact sheet sets out information regarding the 2019 voluntary scheme for branded medicines pricing and access (VPAS) and how it achieves faster patient access to innovative medicines, maintains the affordability of branded medicines for the NHS, and supports a successful UK life sciences industry."
        },
        {
            "text": " "
        },
        {
            "text": "Q&A"
        },
        {
            "text": "What are branded medicines?"
        },
        {
            "text": "Many medicines have at least two different names: the brand name – created by the pharmaceutical company that market the medicine, and the generic name – the name of the active ingredient in the medicine.  For example, Panadol is a brand name (containing the active ingredient paracetamol).  Paracetamol is an example of a generic name."
        },
        {
            "text": "Companies take out exclusive rights called patents on each new drug they discover. If a company has a patent on a drug, only that company can market it under their brand name once it's been granted a licence. Patent branded medicines typically cost significantly more than generic medicines."
        },
        {
            "text": "Other relevant definitions:"
        },
        {
            "text": "Generics – are medicines created to the same as an originator branded medicine and sold (once the patent has expired) under the generic name."
        },
        {
            "text": "Branded Generics – are generic medicines sold under a new brand name.  "
        },
        {
            "text": "Biologicals – are medicines that are made by or derived from a biological source using biotechnology processes e.g. proteins which have been purified from living culture systems or from blood, whereas other medicines are either made synthetically or purified from plants."
        },
        {
            "text": "Biosimilars – these are copies of biological medicines which are manufactured by different companies once the patent for an originator biological medicine has expired. These are similar in terms of quality, safety and efficacy to already licensed biological medicines."
        },
        {
            "text": "Where does the NHS get branded medicines from?"
        },
        {
            "text": "Medicines account for the second highest share of the NHS budget after staff costs. The NHS buys medicines from pharmaceutical companies and is internationally competitive in the speed in adopting innovative medicines. Industry data shows there are five treatments available in England for every four in Europe, as well as almost a third more cancer drugs."
        },
        {
            "text": "VPAS is one of the biggest commercial deals in government covering over £12bn in annual medicines sales and has enabled the NHS to deliver a record number of access deals for medicines."
        },
        {
            "text": "What is the voluntary scheme for branded medicines pricing and access? "
        },
        {
            "text": "The voluntary scheme for branded medicines pricing and access (VPAS) is a voluntary agreement between the Department of Health and Social Care (DHSC), NHS England and the Association of the British Pharmaceutical Industry (ABPI), designed to improve patient outcomes, manage the NHS’ medicines bill, and support the life sciences industry."
        },
        {
            "text": "VPAS sets a cap on the total allowed sales value of branded medicines to the NHS each year. The cap grows at an agreed rate of 2% per annum and any medicine sales above the cap are paid back to DHSC via a levy. For example, members of the scheme currently pay back 26.5% of their medicine sales in payments, which is calculated so that the NHS’ net branded medicines sales increase only to that 2% rate per year."
        },
        {
            "text": "The voluntary scheme took effect on 1 January 2019 and will be in place until 31 December 2023."
        },
        {
            "text": "What are the benefits of VPAS to patients?"
        },
        {
            "text": "VPAS allows for earlier engagement with companies in order to acquire new products and speed up drug evaluations - streamlining the process so that patients get better access to safe, financially sustainable and innovative medicines. This helps to ensure better outcomes for patients though access cost effective and innovative medicines on the NHS, which is beneficial to the taxpayer and to companies."
        },
        {
            "text": "Commitments in VPAS around patient access and uptake for innovative medicines have had a substantial positive impact on the speed of medicines access in England, ensuring that NHS patients benefit from cutting-edge treatments including personalised CAR T cancer therapies, lifechanging treatments for rare conditions and even lifesaving gene therapy."
        },
        {
            "text": "What are the benefits of VPAS to the economy and innovation?"
        },
        {
            "text": "VPAS contributes to maintaining the affordability of branded medicines spend across the UK and supports access to and uptake of new medicines across the NHS to allow companies to innovate more rapidly. VPAS also maintains the affordability of medicines to support the wider healthcare economy."
        },
        {
            "text": "The NHS is one of the largest single employers in the world, and the biggest in Europe, with over 1.3 million staff. The NHS is therefore an attractive partner for pharmaceutical companies – with a single commercial deal a company can have access to a market of over 55 million people."
        },
        {
            "text": "Is VPAS the only way we ensure the cost of drugs are reasonable?  "
        },
        {
            "text": "No, we also have the statutory scheme for branded medicine pricing which applies to companies that do not opt into VPAS. Under either scheme, companies must agree a public “list price” for a branded medicines with the Department before they can market it in the UK."
        },
        {
            "text": "It is intended that both schemes should work together cohesively and in a complementary fashion to create an environment where medicines are supplied at an affordable price, in a way which is consistent with supporting both the life sciences sector and the broader economy."
        },
        {
            "text": "More than 90% of companies supplying eligible health service medicines to the NHS are members of VPAS."
        },
        {
            "text": "The National Institute for Health and Care Excellence also assesses the cost-effectiveness of medicines before they are delivered through the NHS."
        },
        {
            "text": "Will you reduce the payments required by pharmaceutical companies to government, which industry is calling for? "
        },
        {
            "text": "The pharmaceutical industry, represented by the ABPI, negotiated, and signed the current VPAS in 2019, describing it as a “pro-innovation deal” that included a 2% cap on growth of the branded medicines budget."
        },
        {
            "text": "Recent higher payment percentages are below those projected when the scheme was agreed in 2019 and reflect the scheme working as intended to adjust for increased sales of branded medicines to the NHS."
        },
        {
            "text": "What happens when VPAS ends in 2023?"
        },
        {
            "text": "Negotiations on a successor scheme will start in Spring 2023 led by Sir Hugh Taylor. We are open to ideas about how a successor voluntary scheme should operate from 2024 onwards and look forward to working with industry to agree a mutually beneficial scheme that supports the sustainability of NHS spend on branded medicines, better patient outcomes and enables a strong UK life sciences industry."
        },
        {
            "text": "Why have you appointed an adviser to oversee VPAS?"
        },
        {
            "text": "Sir Hugh Taylor has been appointed to oversee the negotiations for a successor scheme to VPAS, which will aim to continue to provide better access to medicines for patients and investment opportunities for pharmaceutical companies in the UK."
        },
        {
            "text": "Negotiations between the government and the pharmaceutical industry to agree a mutually beneficial scheme will start in the spring and conclude this autumn. The new scheme is expected to come into force when the current one scheme expires at the end of 2023."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}