{
    "url": "https://socialcare.blog.gov.uk/2023/12/20/2023-reflections-on-a-busy-year-for-social-care-nursing/",
    "title": "2023: reflections on a busy year for social care nursing",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Diversity",
        "Leadership",
        "Recognition",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-12-20T09:55:31+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Time has flown"
        },
        {
            "text": "It’s hard to believe another year has passed and there is still so much to do. For social care nursing, we have seen some real changes. We began some great projects in 2023 and we can now look forward with optimism as we work to embed and build on them further in 2024."
        },
        {
            "text": "The Royal College of Nursing Foundation’s funding of the UK’s first Professor of Social Care Nursing at Salford University next year sets the tone for both education and research in our profession. The work they lead will be instrumental in challenging misconceptions, enhancing the perception of social care nursing, and adding to the evidence base."
        },
        {
            "text": "The development of the first standards for social care nursing and SPQ entry to the NMC register will also open up new vistas of opportunity for our specialism, setting the baseline and defining the scope of our contribution. We will see more universities using these standards to inform their programmes and develop comprehensive and attractive curriculums."
        },
        {
            "text": "Meanwhile, it’s been a pleasure to work with the National Institute of Health and Care Research (NIHCR) on the appointment of the first Fellow for Social Care Nursing. This has set a new standard for our research potential. Research careers have never looked so attractive and will be vital in our endeavour to shape, inform and share evidence of our effective practice."
        },
        {
            "text": "This year, we held our popular CRED Talks series focusing on frontline clinical research - please join us for future sessions. It’s a great way to get some CPD and see the brilliant work of researchers dedicated to improving our skill sets."
        },
        {
            "heading": 2,
            "text": "Supporting diversity in leadership"
        },
        {
            "text": "The second cohort of Global Majority nursing leaders are being recruited to the Florence Nightingale Foundation programme for social care. The first cohort have “graduated” and it’s been so rewarding to see them flourish and share their stories. Social care nursing is enriched by the diversity of their insights, skills and experiences."
        },
        {
            "text": "The November event for Global Majority nurses held at Buckingham Palace really brought this home. Hosted by HRH King Charles, it provided a magnificent backdrop for colleagues who represent our profession so well. A small group of attendees met the King and new Secretary of State Victoria Atkins, alongside current Minister for Social Care, Helen Whatley."
        },
        {
            "text": "As ever, our excellent colleagues at Skills for Care have been developing career resources, delivering training to colleagues at the NMC. This work has been essential to making sure colleagues making assessments and judgements on social care nurses undergoing Fitness to Practice panels apply criteria fairly. Regional events were held for social care nurses to come together to share their work and network, led by Skills for Care colleagues. Those important conversations suggest we need to do more of this."
        },
        {
            "heading": 2,
            "text": "Collaboration across the profession"
        },
        {
            "text": "We have maintained our collaborations with the Queen’s Nursing Institute (QNI), the Care Home Nurses and IPC (Infection Prevention and Control) networks. These are vital sources of information and forums for the sharing of best practice."
        },
        {
            "text": "Working with the Foundation of Nursing Studies we have announced the Resilience Based Clinical Supervision (RBCS) programme which will be developed to meet needs for social care nurses. This will be implemented regionally in the coming year."
        },
        {
            "text": "The publication this year of the Principles of Delegation, supporting delegated healthcare activities in care settings, has helped embed best practice in the sector. Pilot sites are now participating in testing and refining the principles so that more social care nurses can support clinical activities safely and consistently."
        },
        {
            "heading": 2,
            "text": "Credit where it's due"
        },
        {
            "text": "QNI have again recognised nurses in social care with dedicated awards. Please apply in 2024. It is open to you all and is a prestigious award which helps shine a light on social care."
        },
        {
            "text": "We have given out both team and individual Chief Nurse for Adult Social Care Awards and I ask that you nominate colleagues in 2024. Shouting about our work is vital and gives us a platform on which to celebrate and rise our profile within and beyond our profession."
        },
        {
            "text": "On this point, more King’s Honours were bestowed on social care colleagues this year, so please keep nominating worthy colleagues in 2024. Let’s have a bumper crop of nominations!"
        },
        {
            "text": "This year we saw Care UK win the Social Care Nursing Award at the Nursing Times Awards for their innovative project on hearing loss and the mitigation of dementia symptoms. There are so many great initiatives in social care and we need to shout louder about all the great work"
        },
        {
            "text": "The Social Care Nurse Advisory Councils (SCNACs) continue to develop and embed. The council Chairs in every ICS system meet regularly and give huge amounts of personal time to make these forums work. I really want to thank them and their organisations for supporting this.  Having our voice at the NHS system table is critical. Please join in. Find out who your Chair is and how to join your local SCNAC here."
        },
        {
            "text": "So, when I stop and reflect on 2023, I realise, with not a little satisfaction, we have laid some great foundations for a productive 2024."
        },
        {
            "text": "Thank you all for your personal commitment to social care nursing and the wider care sector. What we do makes a huge difference and when we work collectively, we can achieve truly transformative things for each other and the people we support. You are all amazing."
        },
        {
            "text": "Wishing you all a happy festive season and a healthy and happy 2024."
        }
    ]
}