{
    "url": "https://environmentagency.blog.gov.uk/2023/12/20/celebrating-a-decades-work-returning-fish-to-the-river-derwent/",
    "title": "Celebrating a Decade’s Work Returning Fish to the River Derwent.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-12-20T10:56:36+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "10 years ago, the Environment Agency started work to restore salmon and sea trout to the River Derwent. Today, they are flourishing along the river’s full twenty-mile stretch. This has been achieved in a body of water that was almost devoid of fish in the middle of the last century due to industrialisation. "
        },
        {
            "text": " "
        },
        {
            "text": "The problems for the River Derwent’s fish began at the dawn of the industrial revolution, some 300 years ago. A dam prevented their return from the sea to spawn upstream. Later, steel and coke works – as well as other industry – would pollute the river. By the 1950s and 1960s, there were virtually no fish in the watercourse. "
        },
        {
            "text": " "
        },
        {
            "text": "Work to correct that began in earnest in 2013, with the completion of a first major fish pass which meant, for the first time in three centuries, salmon and sea trout could spawn. "
        },
        {
            "text": " "
        },
        {
            "text": "In this blog, we’ll take you upstream, past a decade of projects to recover the River Derwent. "
        },
        {
            "text": " "
        },
        {
            "text": "Derwenthaugh Weir (2013) "
        },
        {
            "text": " "
        },
        {
            "text": "Just a short distance up from the Derwent’s confluence with the River Tyne is Derwenthaugh Weir. It’s a significant structure and the first major obstruction for salmon and sea trout. A fish pass was built here in partnership with Gateshead Council. "
        },
        {
            "text": " "
        },
        {
            "text": "The project was a challenge. Due to the site’s industrial legacy, the ground under the weir was contaminated. Real care had to be taken not to release that contamination to the river. "
        },
        {
            "text": " "
        },
        {
            "text": "Once completed in 2013, it meant the first barrier to the fishes’ spawning migration had been passed. "
        },
        {
            "text": " "
        },
        {
            "text": "Lintzford Weir (2016)   "
        },
        {
            "text": " "
        },
        {
            "text": "The next significant block for our salmon and sea trout is Lintzford Weir. Finishing the fish pass here in 2016 opened up a further 11km of spawning ground. "
        },
        {
            "text": " "
        },
        {
            "text": "This pass was very carefully designed to mimic the natural cascade of the river using boulders to make ‘steps’ for the fish to gradually work their way to the top of the weir. "
        },
        {
            "text": " "
        },
        {
            "text": "The Environment Agency undertook a lot of partnership work here, exploring how to improve the natural heritage of the Derwent Valley while preserving its industrial history. "
        },
        {
            "text": " "
        },
        {
            "text": "Shotley Bridge Weir (2019) "
        },
        {
            "text": " "
        },
        {
            "text": "300-years old, Shotley Bridge weir historically provided water for a paper mill. The fish pass here not only aids migratory fish but helps resident species like trout and grayling to move freely up and down the river. "
        },
        {
            "text": " "
        },
        {
            "text": "Here, the Environment Agency worked with partners including the Tyne Rivers Trust and the Marine Management Organisation to build a rock pool fish pass. It’s essentially six pools that get gradually deeper, allowing fish to swim through and get higher up past the weir. There’s also a side channel to give fish another option during high flows. "
        },
        {
            "text": " "
        },
        {
            "text": "2023 and Beyond "
        },
        {
            "text": " "
        },
        {
            "text": "At the top of the River Derwent catchment, near Derwent Reservoir, we reach the end of the salmon and sea trout’s spawning migration journey! The fish are present along more than 20 miles of the main River Derwent, all the way back to the confluence with the Tyne. It’s all the more impressive given it was achieved without artificial stocking. "
        },
        {
            "text": " "
        },
        {
            "text": "Going forward, the Environment Agency and its partners are looking at opening up some of the major tributaries of the River Derwent to salmon and sea trout, such as the Burnhope Burn. "
        },
        {
            "text": "\nYou can watch a video about the recovery of the River Derwent on Youtube.\n\n Follow the Environment Agency Yorkshire and North East on X (formerly Twitter). \n"
        }
    ]
}