{
    "url": "https://marinedevelopments.blog.gov.uk/2023/12/20/complete-our-surveys-for-your-say-on-two-key-fisheries-management-plan/",
    "title": "Complete our surveys for your say on two key Fisheries Management Plans",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Fisheries Management Plans"
    ],
    "pub_date": "2023-12-20T15:19:41+00:00",
    "content": [
        {
            "text": "We have launched two short surveys to enable stakeholders with an interest in skates and rays in the English Channel and Southern North Sea or demersal non-quota species in the Southern North Sea to give us their views on the issues facing these species and fisheries, alongside the measures that may help to address these issues."
        },
        {
            "text": "Before you complete the survey, it would be worthwhile reading our blog below for more information."
        },
        {
            "heading": 2,
            "text": "Fisheries Management Plans"
        },
        {
            "text": "Post EU Exit, the Fisheries Act 2020 requires UK fisheries policy authorities to publish Fisheries Management Plans (FMPs) to help deliver our ambition for sustainable fisheries."
        },
        {
            "text": "FMPs are evidence-based action plans, developed in collaboration with the fishing sector and other stakeholders. Their purpose is to deliver sustainable fisheries for current and future generations."
        },
        {
            "text": "Each FMP will specify the stocks, type of fishing and the geographic area covered, and how the plans will be monitored for their effectiveness. After public consultation, FMPs will be delivered via a range of actions, using existing or new measures, including voluntary codes of conduct."
        },
        {
            "text": "The Southern North Sea and English Channel Skates and Rays FMP is being drafted by the MMO and covers the English waters within ICES divisions 4b, 4c, 7d and 7e (these areas cover the Southern North Sea and English Channel) including the following species:"
        },
        {
            "text": "The Southern North Sea non-quota demersal FMP is being drafted by the MMO and covers the English waters within ICES divisions 4b and 4c (these areas cover the Southern North Sea) including the following species:"
        },
        {
            "heading": 3,
            "text": "Bony fish"
        },
        {
            "heading": 3,
            "text": "Elasmobranchs"
        },
        {
            "heading": 3,
            "text": "Cephalopods"
        },
        {
            "text": "The MMO are using these surveys to gather opinion and work collaboratively with the stakeholders in developing the FMPs."
        },
        {
            "text": "It is a voluntary survey open to all fisheries stakeholders for input into the development of the FMP."
        },
        {
            "text": "We are seeking your input on the main issues we have identified for the fishery, and the proposed measures to address them. We’re also asking for your thoughts on areas where we think more evidence is needed to allow us to make better decisions for the sustainable management of the fishery."
        },
        {
            "text": "This is your opportunity to have a say on the Plans as we are developing them. This survey will close on 9 Jan 2024. It is anticipated that the surveys will take 15-30 minutes to complete."
        },
        {
            "text": "Data collected from respondents will be used in the development of the FMPs, which will subsequently go to public consultation and published by the end of 2024."
        },
        {
            "text": "Aggregated responses to this survey will be summarised with the published FMP documents. All data collected will be anonymised."
        },
        {
            "text": "Please email the FMP team at FMP@marinemanagement.org.uk if you would like any further information on this FMP. General information on all FMPs currently published or in development can be found at Fisheries management plans: policy information - GOV.UK (www.gov.uk)."
        }
    ]
}