{
    "url": "https://ruralpayments.blog.gov.uk/2023/12/20/delinked-payments-news/",
    "title": "Delinked Payments News",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Delinked payments"
    ],
    "pub_date": "2023-12-20T14:35:08+00:00",
    "content": [
        {
            "text": "RPA will replace the Basic Payment Scheme (BPS) in England with delinked payments in 2024. The 2023 scheme year will be the last year of BPS. "
        },
        {
            "text": "Delinked Payments Information Statement "
        },
        {
            "text": "We have finished sending out initial Delinked Payments Information Statements to customers. "
        },
        {
            "text": " The statement shows reference data for your business and the reference amount we will use to calculate your delinked payments (from 2024 to 2027) if you are eligible. We will apply progressive reductions to the payments each year. "
        },
        {
            "text": "Most customers will have received information statements by email in November. If we did not have a business email address for you, we posted them to you. Printed statements were posted on 14 December, so delivery may be affected by the high volume of mail at this time of year. "
        },
        {
            "text": "We understand that your eligibility status for delinked payments may change as we process your BPS 2023 claim. If this happens, we will send you an updated information statement in due course.  "
        },
        {
            "text": "Have you received your statement? "
        },
        {
            "text": "If you claimed BPS in any of the scheme years 2020, 2021 or 2022, but did not receive an information statement, please contact us to request one. Call our helpline on 03000 200 301 or email ruralpayments@defra.gov.uk. We will then check our records to confirm if you should have received a statement and let you know the outcome. "
        },
        {
            "text": "What you need to do "
        },
        {
            "text": "You should check the reference data in the statement against the BPS payment data on your latest BPS claim statement for the relevant year(s). If after checking your latest claim statement you still do not agree with the values we’ve used, you need to fill in and return a Basic Payment Scheme: payment query form. You will need to do this by the 29 February 2024 deadline. "
        },
        {
            "text": "If you intend to transfer some or all of your reference data and have a query, tell us as soon as possible before 29 February. This will give us time to resolve your query before you transfer. "
        },
        {
            "text": "For any other queries about delinked payments please sign in to the Rural Payments service and on the ‘Your businesses and messages screen’ select ‘Create or view query’ to raise a new query. This is the quickest way to get a reply. "
        },
        {
            "text": "If you are unable to raise a query on Rural Payments, you can contact us by email, phone or post. If you contact us by email, use ‘Delinked payments information statement query’ as the subject of your email. "
        },
        {
            "text": "From 15 February to 10 May 2024, you can choose to transfer some or all of your reference data to another business. We will give you more information about how you can do this in early February. "
        }
    ]
}