{
    "url": "https://dfedigital.blog.gov.uk/2023/12/20/desk-research-in-discovery/",
    "title": "Desk Research in Discovery",
    "authors": [
        "Sarah Stewart, Senior Content Designer"
    ],
    "categories": [
        "Careers",
        "Content design",
        "multidisciplinary teams",
        "research operations",
        "Service design",
        "technology",
        "Uncategorized",
        "user research"
    ],
    "pub_date": "2023-12-20T08:44:21+00:00",
    "content": [
        {
            "text": "Desk research can help you find your bearings at the start of a project. Finding information about your users’ habits and priorities will give you a good basis to work from when user research begins. In some cases, you may be starting a project without a user researcher, or budget constraints which may mean you can’t access certain data sources."
        },
        {
            "heading": 2,
            "text": "What is desk research?"
        },
        {
            "text": "Desk research is a way of finding information out about your users without talking to them"
        },
        {
            "text": "Desk research can take the form of:"
        },
        {
            "heading": 2,
            "text": "Caveats of desk research"
        },
        {
            "text": "There is no way of knowing for certain that the data you’re looking at is about your users. You will be making a lot of assumptions at this stage. But the data you find will function as a good starting point for further research. It will also help you create a focus for hypothesis and questions to ask during user research."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "How desk research can help content designers"
        },
        {
            "text": "Content designers collaborate closely with user researchers to understand and design for user needs."
        },
        {
            "text": "As a content designer, doing desk research has helped me to:"
        },
        {
            "text": "An advantage of doing desk research on a new project, is that it helps to embed content design into the team. Approaching content in this way aids teams who are new to content design. And how it includes much more than writing."
        },
        {
            "text": "Desk research provides the perfect opportunity to get a better understanding of the subject matter. One way to do this is through identifying and engaging subject matter experts and stakeholders. Furthermore, you can ask your team members questions and share statistics and trends, allowing you to show the potential scope of a project."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Including existing user research in desk research"
        },
        {
            "text": "Working collaboratively across professions in DfE means we have access to the fantastic work of other teams."
        },
        {
            "text": "The About users of DfE services for schools insights library is full of research from previous projects. The #user_research Slack channel is a welcoming and friendly place to ask questions and get help from user researchers."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Desk research cheat sheet"
        },
        {
            "text": "Here are some ways to find out about potential users whether your service exists yet or not."
        },
        {
            "text": "Download the desk research cheat sheet (.pdf) or save this page for the future."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Desk research without an existing service  "
        },
        {
            "heading": 4,
            "text": "Existing UR"
        },
        {
            "heading": 4,
            "text": "Events that users attend"
        },
        {
            "heading": 4,
            "text": "Search data"
        },
        {
            "heading": 4,
            "text": "Forums and social"
        },
        {
            "heading": 4,
            "text": "Existing guidance and services"
        },
        {
            "heading": 4,
            "text": "Helpline calls"
        },
        {
            "heading": 3,
            "text": "Desk research for an existing service "
        },
        {
            "heading": 4,
            "text": "Content data insights"
        },
        {
            "heading": 4,
            "text": "Google analytics"
        },
        {
            "text": " "
        }
    ]
}