{
    "url": "https://mhclgdigital.blog.gov.uk/2023/12/20/dluhcs-digital-planning-programme-2023-in-review/",
    "title": "DLUHC's Digital Planning Programme: 2023 in review",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Citizen Engagement",
        "Digital Land",
        "Digital Planning",
        "Planning Software",
        "PropTech"
    ],
    "pub_date": "2023-12-20T10:06:52+00:00",
    "content": [
        {
            "text": "As we wrap up the year, it's time to look back through the 2023 highlights of DLUHC’s Digital Planning Programme."
        },
        {
            "text": "Firstly, a huge thank you to all of the local planning authorities (LPAs) and other stakeholders we’ve had the chance to work with this year. We're looking forward to continuing our journey and seeing what’s to come in 2024."
        },
        {
            "text": "If you are new here, you can read our programme overview to get a feel for the work we do and find out more about our newsletter on our website.  "
        },
        {
            "heading": 2,
            "text": "Funding in 2023"
        },
        {
            "text": "In 2023 we awarded 19 councils a total of £5.3M in funding to lead and take part in digital projects that will encourage quicker planning decisions and improve digital planning software, and a further 15 councils £3.2M through Round 3 of the PropTech Innovation Fund which supported LPAs to scale digital solutions which aim to improve citizen engagement within the planning process."
        },
        {
            "text": "In October we launched DLUHC’s Digital Planning Programme 2023 funding rounds, with the Digital Planning Improvement Fund: Round 2, and the PropTech Innovation Fund: Round 4. The deadline for submissions was earlier this month and we’re currently working through a record number of applications.\n"
        },
        {
            "text": "If you applied, we’ll be in touch in early 2024 with more information on the outcome of your submission."
        },
        {
            "heading": 2,
            "text": "Sharing best practice"
        },
        {
            "text": "We brought conversations about data out into the open this year as we announced Paul Downey as the Service Owner for Planning Data. He blogged about the new role and his vision as we build on current data successes. "
        },
        {
            "text": "This year, we’ve published case studies and learnings from previous rounds of the PropTech Innovation Fund. Increasing citizen participation by 119% and saving 280 hours of planning officer time are just two of the outcomes local authorities were able to achieve through their pilot projects.  "
        },
        {
            "text": "You can explore more of our case studies on our website to find out how the adoption of digital tools can reduce planning officer time spent analysing consultation responses; increase engagement with planning in local areas and support more positive conversations around planning."
        },
        {
            "heading": 2,
            "text": "Industry recognition"
        },
        {
            "text": "Back in March we won the Digital Change Project of the Year Award for our collaborative work on Open Digital Planning at the Government Project Delivery Awards, and the Best Use of Digital and Technology at the iESE Public Sector Digital Transformation Awards. "
        },
        {
            "text": "Our PropTech Innovation Fund was also included in the OECD Observatory of Public Sector Innovation’s Global Trends in Government Innovation 2023 report, and we were shortlisted for the UK PropTech 2023 Awards for striving to drive digital change across the industry."
        },
        {
            "text": "PropTech Innovation Fund recipients, Plymouth and South West Devon Joint Local Plan team, also won an accolade at the 2023 Planning Awards for the Use of Digital Technology in Planning and Bolsover District Council received commended at the RTPI awards for Excellence in Digital Planning. "
        },
        {
            "heading": 2,
            "text": "A focus on collaboration"
        },
        {
            "text": "Our work depends on collaboration with local authorities, the planning software market and the PropTech industry. That’s why we’ve spent lots of time on the road, hosting monthly Open Digital Planning Show and Tells, and speaking at events like the at Crown Commercial Service's Public Sector Connect DigiTech Event - 'Digital First, supporting the next generation of public services’, the London PropTech Show, the UKREiiF conference, and London CREtech Conference."
        },
        {
            "text": "It’s also why early in the year DLUHC’s former Housing and Planning Minister, Lucy Frazer MP, visited our Open Digital Planning partner ,Buckinghamshire Council to see Digital Planning software in action and discuss the council’s wider ideas for streamlining the planning process."
        },
        {
            "text": "We’ve had fantastic feedback from our local authority partners, like this comment from Stephen Barnes, a Senior Planner for Digital Projects at Lambeth Council: "
        },
        {
            "text": "Local Plans colleagues also spoke to more than 200 LPAs and 40 planning consultants on their roadshow about plan making reforms and how we’re #DoingPlanningDifferently as part of our vision for faster, simpler, more accessible plans that deliver better outcomes. We gathered lots of insight and shared a LinkedIn article about what we learned."
        },
        {
            "text": "Finally, this year Digital Planning colleagues have been collaborating with New City College students and Version 1 on a social value programme. The programme supports special educational needs and disabilities (SEND) students through a four-session program, centred around design thinking concepts, to nurture creativity, communication, and user-focused design."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "The Levelling-up and Regeneration Bill received Royal Assent to become the Levelling-up and Regeneration Act in October, setting the stage for significant transformative developments for housing and planning in the coming years. "
        },
        {
            "text": "As we move into 2024 we invite you to follow the Digital Planning Programme on LinkedIn and X, and subscribe to our LinkedIn newsletter to see how we’re #DoingPlanningDifferently."
        },
        {
            "text": "On behalf of the entire DLUHC Digital Planning Programme team, happy holidays and new year - see you in 2024! "
        }
    ]
}