{
    "url": "https://cddo.blog.gov.uk/2023/12/20/its-time-to-take-a-look-at-our-standards-and-guidance/",
    "title": "It’s time to take a look at our standards and guidance",
    "authors": [
        "Ben Tate, Head of Strategy and Standards, CDDO",
        "Ben Carpenter, Senior Product Manager, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Government Digital and Data"
    ],
    "pub_date": "2023-12-20T09:12:26+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Our mission"
        },
        {
            "text": "The Transforming Government Services team in the Central Digital and Data Office (CDDO) is redesigning the products and services offered to other government departments to support the delivery of their services. This includes updating existing standards and guidance, so that more services are implemented to a ‘great’ standard."
        },
        {
            "heading": 3,
            "text": "We want more services to be great  "
        },
        {
            "text": "Our core problem statement is that not all government services are as ‘great’ as they could be, or have not been effectively transformed. Analysis of the Top 75 services in government has shown that not all of these services meet the required standard of performance in usability, efficiency or accessibility."
        },
        {
            "text": "We also have a number of other more specific problems that we have been exploring:"
        },
        {
            "heading": 3,
            "text": "What kinds of products and services does CDDO offer?"
        },
        {
            "text": "CDDO leads the Government Digital and Data function. We put the conditions for success in place for HM government to deliver digital transformation at scale by:"
        },
        {
            "text": "To support these responsibilities there is a range of products that we will always offer. There is also a variety of services that we can choose to offer, to support users with our products. Our users are the people leading and delivering digital service transformation across the public sector."
        },
        {
            "text": "The core products that we offer:"
        },
        {
            "text": "The services we offer to help users with our products:"
        },
        {
            "heading": 3,
            "text": "Mapping all of the Government Digital and Data products and services"
        },
        {
            "text": "We mapped out the full landscape of Government Digital and Data products published on the internet and the related services available from CDDO, GDS and other government departments. "
        },
        {
            "text": "Across government we found 18 different publishing platforms or publishers and over 330 topic areas. We documented from the platform level (e.g. the ‘Whitehall’ publishing app) and down as far as the sections or content topics that pieces of guidance sit in (e.g. ‘Design’). "
        },
        {
            "text": "We then audited, at the guide / URL level, everything tagged on GOV.UK as being owned by CDDO. We found over 450 individual pieces of content of which around 180 related specifically to service design and transformation."
        },
        {
            "text": "We then started to document:"
        },
        {
            "text": "The map helped us to draw a line around the products within our scope. It also helped us to spot where the information within products was overlapping or duplicated. We also want to use the map to show progress and change, as our project develops."
        },
        {
            "heading": 3,
            "text": "How do we know if something is ‘good practice’ or not?"
        },
        {
            "text": "With so much content proliferating over the last few years we had to ask ourselves how much of it is still needed. "
        },
        {
            "text": "As an organisation we need to ensure that our products and services continue to represent good practice and add value. The question then becomes ‘how do we identify good practice?’"
        },
        {
            "text": "We took a research and analysis approach to this question and held interviews from across the public, private and third sectors. All of them had a common responsibility to define and publish good practice in their organisation."
        },
        {
            "text": "We created some mini case studies and analysed them to identify commonalities and themes. "
        },
        {
            "text": "We learned that good practice:"
        },
        {
            "heading": 3,
            "text": "Creating a tool to assess our products and services"
        },
        {
            "text": "With these insights we’ve created a tool which we’ve called the ‘good practice framework’. This new framework works as a set of questions that can be directed at either existing or prospective products and services. "
        },
        {
            "text": "The initial set of questions work as a sense check against existing content and builds on the triage process used by a previous team updating the Service Standard and Manual:"
        },
        {
            "text": "These questions give us an indication of whether or not a part of our offer should be kept, moved, rewritten or retired."
        },
        {
            "text": "We then ask another set of questions to assess the risk, impact, confidence and effort (the RICE method) of areas of strategic priority where we want to see cross-government change."
        },
        {
            "text": "We acknowledge that our products, for example our guidance on service delivery, can’t include everything about everything as that would be unmanageable. So a tool like this helps us to focus on the most important and relevant things that apply universally across all of government."
        },
        {
            "heading": 3,
            "text": "Where does good practice come from?"
        },
        {
            "text": "The Government Digital and Data profession has been around for a long time and good practice is now happening all across the public sector. "
        },
        {
            "text": "The growth of our profession offers an opportunity not just to question whether or not CDDO’s products and services are right, and reflective of good practice, but also whether or not the model for creating and disseminating good practice is right."
        },
        {
            "text": "The knowledge that exists within the communities of practice in the public sector is the Government Digital and Data profession’s most valuable asset. It’s essential that CDDO as an organisation knows how to release that value from within the communities. That starts with understanding the blockers to knowledge sharing and collaboration at scale."
        },
        {
            "heading": 3,
            "text": "How we’re going to maintain things in the future"
        },
        {
            "text": "Within CDDO we’ve created a governance group called the Products and Services Board. "
        },
        {
            "text": "The board’s purpose is to ensure that the products and services CDDO provides are managed strategically, held to a consistent standard and support government to meet strategic commitments as outlined in our cross government digital strategy. "
        },
        {
            "text": "It will do this by ensuring CDDO’s products and services are:"
        },
        {
            "text": "The Products and Services Board is one of the steps that CDDO is taking to become a stronger product and service delivery organisation."
        },
        {
            "text": " "
        }
    ]
}