{
    "url": "https://naturalengland.blog.gov.uk/2023/12/20/natural-england-welcomes-governments-commitment-to-nutrient-mitigation/",
    "title": "Natural England welcomes Government's commitment to Nutrient Mitigation",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Development",
        "Environment Act",
        "Nature-based solutions",
        "Nutrient Neutrality"
    ],
    "pub_date": "2023-12-20T15:22:21+00:00",
    "content": [
        {
            "text": "Over the coming months Natural England will continue to expand its Nutrient Mitigation Scheme\nThe Government has reaffirmed its commitment to enabling sustainable development by investing in schemes to reduce nutrient pollution in England’s rivers and estuaries. Read more on GOV.UK."
        },
        {
            "text": "Natural England welcomes the announcement which provides the certainty needed for all providers to continue investment in nutrient mitigation solutions. "
        },
        {
            "text": "Rivers and wetlands are important for nature and our own health and prosperity. They are hugely valued by people and many are protected by UK law. Sadly, the current trend is one of declining health of our rivers. This is why the government’s policy of nutrient neutrality is so important to ensure that new housing doesn’t make the situation worse. Read more on our previous blog."
        },
        {
            "text": "Over the coming months Natural England will continue to expand its Nutrient Mitigation Scheme (NMS) by investing in solutions to enable home building and protect our most important rivers. We will continue to work with land managers interested in becoming a mitigation provider and look to expand the range of options available for securing mitigation. We will also continue to look at opportunities to simplify and speed up the delivery of solutions on the ground. "
        },
        {
            "text": "Additional funding announced from the Department of Levelling Up Housing and Communities (DLUHC) for Local Planning Authorities (LPAs) to boost the supply of mitigation is very welcome. Natural England is working with LPAs to share learning from its own scheme and maximise the power of this new investment. "
        },
        {
            "text": "The NMS will complement locally and privately led mitigation schemes to maximise mitigation provision. So far, Natural England, other providers and developers have collectively generated mitigation to enable around 50,000 homes. This includes mitigation already used to inform planning applications, and proposals agreed in principle by NE and/or LPAs."
        },
        {
            "text": "A key role for Natural England is not only to implement a mitigation scheme, but also to facilitate others to do so. In the new year we plan to share a suite of key evidence, advice and tools to help others to implement robust mitigation projects. "
        },
        {
            "text": "The goal to aim for is one where nutrient neutrality advice is no longer needed by getting our legally protected rivers and wetlands back into good condition. This is a big challenge and we will need all sectors and strong partnerships that draw on all the tools at our disposal to address it. It is welcome news therefore that Government will continue to support not just mitigation provision but also Protected Sites Strategies and other interventions that will tackle water pollution and improve our protected sites. This is good news for nature and for people. "
        }
    ]
}