{
    "url": "https://ace.blog.gov.uk/2023/12/20/navigating-climate-change-challenges-key-findings-from-our-academic-network-net-zero-event/",
    "title": "Navigating climate change challenges – key findings from our academic network net zero event",
    "authors": [
        "Sam Brooks"
    ],
    "categories": [
        "Academia",
        "Net Zero",
        "Ways of working"
    ],
    "pub_date": "2023-12-20T17:16:40+00:00",
    "content": [
        {
            "text": "Introduction "
        },
        {
            "text": "The close of this year’s COP28 climate summit provides an opportunity for us to reflect on our contribution to efforts towards addressing the urgent threat of climate change, and to consider some of the findings of our recent Net Zero event at Newcastle University.  "
        },
        {
            "text": "Net zero emissions can only be attained through well-defined goals and sweeping partnerships across academia, industry and government.  "
        },
        {
            "text": "It was in this spirit that ACE facilitated a rich discussion between key players from across multiple sectors on how to foster such collaboration. Attendees agreed on the vital role of public-private-academic alliances, but that current efforts lack sufficient scale.  "
        },
        {
            "text": "Below, we summarise the key themes, barriers and solutions from this discussion. Although the following represents the views of our participants and not of ACE, this blog provides a valuable cross-section of the views of these communities, while demonstrating the value of ACE as an independent orchestrator of different networks.  "
        },
        {
            "text": " "
        },
        {
            "text": "1. Academics in ACE’s core fields of data, digital and security have a vital role to play in achieving net zero  "
        },
        {
            "text": "Academics in the fields of data, digital and security offer trusted guidance on issues like ethics, skills, and technology deployment for net zero. Their expertise, disseminated through teaching, can equip students with the capabilities necessary for the green transition such as data literacy. "
        },
        {
            "text": "Newcastle University’s National Innovation Centre for Data (NIC-D), which aims to address the data skills gap, is a great example of this in action. In addition, targeted collaboration will enable researchers to more effectively translate insights into real-world impact. "
        },
        {
            "text": " "
        },
        {
            "text": "2. Strategic Clarity Catalyses Innovation  "
        },
        {
            "text": "A crucial challenge mentioned by delegates is the “patchwork” of strategies between sectors, lacking overarching direction. Some also argued that policy changes create uncertainty that hinders long-term planning and risk-taking.  "
        },
        {
            "text": "Participants agreed that there was a need for a clear, overarching, mission-driven strategy, that would incentivise industries, government departments and researchers to align around shared net zero goals. Meanwhile, setting multi-year timelines and spreading spending creates consistency for academia and business, preventing a “trolley dash” at the end of every financial year.  "
        },
        {
            "text": "Adopting clear, long-term, outcomes-focused missions can therefore empower government to go beyond the role of a market fixer and play a more active role in shaping and driving innovation. "
        },
        {
            "text": " "
        },
        {
            "text": "3. Beyond teaching: how to incentivise cross-sector R&D partnerships "
        },
        {
            "text": "Many university staff agreed there was a need for more of university spending to be allocated to R&D activities, along with more time for academics to do research rather than an over-emphasis on teaching time. "
        },
        {
            "text": "Attendees argued that greater public funding could relieve pressures on academia and incentivise external engagement. Furthermore, incentivising business R&D spending in the UK would create more opportunities to leverage academic breakthroughs.  "
        },
        {
            "text": "Therefore, many argued that more incentives like R&D tax credits are needed to catalyse collaboration, IP transfer, and commercialisation between industry and researchers. They also argued that empowering organisations such as UKRI and Innovate UK could increase support to businesses and researchers looking to collaborate, as well as funding for innovative projects that bridge the gap between academia and industry.   "
        },
        {
            "text": " "
        },
        {
            "text": "4. Cutting the Red Tape for Collaboration "
        },
        {
            "text": "Excessive bureaucracy in universities, including paperwork and an obscure contracting system, was cited as a major drag, slowing down and reducing the appetite for collaboration.  "
        },
        {
            "text": "Simplifying and joining up cumbersome contracting and approvals would accelerate progress from proposal to delivery. For example, private sector organisations could be costed directly into research grants. This could help improve cross-sector collaboration by facilitating the integration of commercial expertise, resources, and perspectives into research projects traditionally funded by public or non-profit organisations.  "
        },
        {
            "text": "Upskilling administrators and standardising procedures could further reduce friction. For example, more organisations could aim to obtain ISO 44001, which specifies requirements for the effective identification, development and management of collaborative business relationships within or between organisations. "
        },
        {
            "text": "ACE, itself a public-private-academic partnership, is an example of how reducing bureaucracy can facilitate cross-sector partnerships. By frontloading the onboarding process, building and maintaining an active, diverse and capable community of suppliers, and working in an agile fashion, ACE can rapidly connect private sector suppliers and academics to government challenges. This means that mission-critical work can be scoped, procured and launched within weeks, rather than months. Furthermore, ACE acts as an independent orchestrator, facilitating the formation of valuable, long-term, cross-sector partnerships that outlast the lifecycle of a single commission.  "
        },
        {
            "text": "ACE actively shares its learnings and ways of working with other government departments and with other friendly nations. For example, having learned from ACE, the government of Singapore has set up its own ACE-like capability. "
        },
        {
            "text": " "
        },
        {
            "text": "5. IP Protections as Catalysts for Cooperation "
        },
        {
            "text": "Intellectual property concerns commonly deter open cooperation between companies, government, and academia.  "
        },
        {
            "text": "Disagreements over ownership can disincentivise investment in joint work. Private sector companies may be reluctant to invest resources if they do not have sufficient IP rights to protect their commercial interests. "
        },
        {
            "text": "Restrictions on publication and concerns about confidentiality may also undermine knowledge sharing. Whilst academic success depends on publishing papers in reputable journals, industry partners may be more concerned about protecting proprietary information and seek restrictions on publication. As a result, some argued for new metrics for measuring academic success that focus on collaboration and commercialisation, rather than publication. "
        },
        {
            "text": "To combat these issues, one group proposed the idea of “IP safe spaces” – collaboration environments that allow cooperation between big, small, public, private and academic by clearly and fairly managing IP concerns.  "
        },
        {
            "text": " "
        },
        {
            "text": "6. Breaking through silos "
        },
        {
            "text": "A major theme discussed by all breakout groups was around siloed research, data, and knowledge between sectors, which undermines innovation. Bleeding edge research, net zero innovation and policy development are happening all the time, but aren’t always being communicated or accessed in the right way. These communication barriers need to be overcome if we are to reach our Net Zero targets. "
        },
        {
            "text": "Open collaboration platforms, such as the Data Analytics Facility National Infrastructure (DAFNI), can help partners from different backgrounds integrate diverse data sources to tackle sustainability challenges. Additionally, cross-government visualisation tools, such as those recently developed by DESNZ, also highlight interconnected systems, promote systems thinking approaches and drive unified action. "
        },
        {
            "text": "Funding schemes, fellowships and workforce exchanges were also a popular solution, particularly amongst academic participants. These approaches could help facilitate transfer of knowledge, data and technology, aid policy development, grow interdisciplinary networks, access new research funding, and apply academic research in real-world contexts. "
        },
        {
            "text": " "
        },
        {
            "text": "Conclusion "
        },
        {
            "text": "Collaboration is imperative for tackling today's existential threat of climate change. The scale of emissions reductions required to achieve net zero necessitates innovation, coordination, and combined capabilities across sectors.  "
        },
        {
            "text": "While challenges exist, solutions are within reach if all stakeholders embrace a shared mission. With clear and cross-cutting national strategies, financial incentives, systematic efforts to reduce bureaucracy, and enhanced communication channels across silos, academia's expertise can be fully harnessed through public-private partnerships. Independent ecosystem orchestrators, such as ACE , are absolutely vital for doing so.  "
        }
    ]
}