{
    "url": "https://environmentagency.blog.gov.uk/2023/12/20/new-data-identifies-amount-of-pollution-from-different-sources-in-windermere/",
    "title": "New data identifies amount of pollution from different sources in Windermere",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-12-20T14:05:39+00:00",
    "content": [
        {
            "text": "Andy Brown, Environment, Planning and Engagement Manager at the Environment Agency, and chair of the Love Windermere partnership, explains how new data will help tackle pollution in Windermere and protect the lake for generations to come."
        },
        {
            "text": "Over the last ten years, it has been fantastic to see the way in which people across the country increasingly value the environment around them and have become more determined than ever to do what they can to protect it."
        },
        {
            "text": "To do this effectively though, we need to understand what is damaging the environment, including where pollution is coming from, before we can make plans to tackle it."
        },
        {
            "text": "That’s where science comes in. By making sure that everything we do is driven by accurate data, evidence and scientific knowledge, we can make sure our interventions have the most impact."
        },
        {
            "text": "One of the major sources of pollution to rivers and lakes is excess phosphorus. Phosphorus is an essential nutrient for plants and animals but too much can lead to algal blooms and excessive plant growth. This in turn reduces the amount of oxygen dissolved in water, potentially killing fish and harming aquatic life."
        },
        {
            "text": "The amount of phosphorus in water is a good indicator of pollution from a range of different sources that all need to be tackled if we are going to protect our rivers and lakes for future generations."
        },
        {
            "text": "Scientists at the Environment Agency have quantified the different sources of phosphorus pollution (Science and data – Love Windermere) in Windermere and the impact that it is having in different parts of the lake so that we can be more targeted than ever in our efforts to improve water quality."
        },
        {
            "text": "Lake Windermere has two separate basins – north and south – with different characteristics influenced by the underlying geology. Our modelling has revealed that around 52 % of the phosphorus in Windemere’s north basin comes from sewage and approximately 48 % from runoff from both built up and rural areas. The sewage is from storm overflows, United Utilities and private sewage treatment works, and septic tanks."
        },
        {
            "text": "In the south basin, around 59 % of the phosphorus in Windemere is from sewage and about 41 % from runoff. This is set out in the table below."
        },
        {
            "text": "We have identified that recent improvements to sewage treatment works, driven by the Environment Agency, Ofwat and government as part of the Water Industry National Environment Programme (WINEP), have already led to around a 30% reduction in phosphorus entering the lake since 2020, with future improvements expected to lead to a further reduction of between 4 and 8%."
        },
        {
            "text": "This is really good news, as is the fact that all four of Windermere’s bathing waters have once again been given an ‘excellent’ rating in this year’s bathing water classifications. But much more needs to be done to build on reductions to date."
        },
        {
            "text": "This is particularly important given the predicted impacts of climate change. Increasing temperatures, less rainfall during the summer and more intense rainfall events could lead to more algal blooms as increased amounts of phosphorus enter the watercourses from runoff."
        },
        {
            "text": "To really make a difference, we need to take action to reduce phosphorus from every source.There is a risk that given the current focus on sewage pollution, people will not realise that a lot of the phosphorus entering the lake comes from wide range of different sources."
        },
        {
            "text": "Our data, along with other vital evidence gleaned from a wide range of scientific research such as that gathered by the Freshwater Biological Association and the citizen scientists that they work with, means that we can now start to do this with more confidence than ever before."
        },
        {
            "text": "Along with identifying the sources of pollution in Windermere, the Environment Agency takes its role in protecting the environment very seriously and has an important regulatory role in holding polluters to account."
        },
        {
            "text": "Officers at the Environment Agency care deeply about the environment and work hard to do the right thing. Like any organisation, we recognise that there are times when we could have done better. That is why we have made improvements in the Windermere catchment, including installing sensors that monitor river quality in real time."
        },
        {
            "text": "No one organisation can secure the improvements in Windermere that we all want to see. In recognition of this, ten organisations working in Windermere have come together to create the Love Windermere partnership. The partnership is developing ambitions plans for the future along with taking prompt action where we know it will make a difference."
        },
        {
            "text": "One example of this is a pilot septic tank emptying scheme  in Skelwith Bridge led by the Lake District Foundation, and the excellent Call of Nature advice the Foundation provides. I would urge everyone who owns a septic tank to visit the site and check that their tank is working properly."
        },
        {
            "text": "By working together across organisational boundaries and with local communities who care so passionately, we can continue to reduce the amount of phosphorus in Windermere. We all have a part to play and no action is too small to make a difference."
        },
        {
            "text": "For further information visit Love Windermere"
        },
        {
            "text": "For more information on how we measure bathing water quality go to our Swimfo website - Bathing water quality (data.gov.uk)"
        }
    ]
}