{
    "url": "https://marinedevelopments.blog.gov.uk/2023/12/20/our-hidden-marine-mammals-the-harbour-porpoise/",
    "title": "Our hidden marine mammals - the harbour porpoise",
    "authors": [
        "Charlotte Devaney - MMO Marine Conservation Manager"
    ],
    "categories": [
        "Coastal",
        "Evidence",
        "marine conservation",
        "Science"
    ],
    "pub_date": "2023-12-20T10:47:41+00:00",
    "content": [
        {
            "text": "What is the first animal that springs to mind when you think of a UK marine mammal? "
        },
        {
            "text": "A cousin to dolphins, harbour porpoises might not have been your first answer but there are many reasons to care about these fascinating cetaceans."
        },
        {
            "text": "Harbour porpoises are one of the smallest cetaceans (a group of mammals which includes whales and dolphins) averaging at around 1.4 to 1.9 metres in length. They are also our most common UK cetacean species.  "
        },
        {
            "heading": 4,
            "text": "Shy Puffing Pig  "
        },
        {
            "text": "Usually found in inshore coastal waters as their name suggests, they can be hard to spot because even a slight sea swell can hide them from your view. You might catch a brief glimpse of them moving with a slow forward rolling motion. It’s possible that you might hear them before you see them: in some areas they are known as the Puffing Pig due to the sound they make when breathing out at the surface!  "
        },
        {
            "text": "Unobtrusive in nature, they often move away from boats rather than towards them and are not likely to be seen breaching the surface. They are less social than some other cetacean species, more often found alone or in small groups.  "
        },
        {
            "heading": 4,
            "text": "How to tell them apart from other cetaceans  "
        },
        {
            "text": "As well as being smaller in size than other dolphins you might see in British waters, harbour porpoises are easy to identify because of their small, rounded head and lack of a prominent beak, they also have a distinctively shaped dorsal fin which is small and triangular.  "
        },
        {
            "heading": 4,
            "text": "Diet and lifespan "
        },
        {
            "text": "In the UK, harbour porpoise may live to over 20 years old but they have an average life expectancy of around 12 years. They become sexually mature between ages three and five roughly, and females reproduce every one to two years. "
        },
        {
            "text": "Harbour porpoise have a wide diet, feeding mostly on fish, including sandeels, herring and whiting, as well as on squid and crustaceans. "
        },
        {
            "text": "When hunting for food, harbour porpoise use echolocation by making noise and then using the echo to detect and locate their prey. They are voracious hunters and due to the cooler waters they live in and their fast metabolism they may need to eat almost continuously to meet their high energy needs. "
        },
        {
            "text": "You can listen in and hear some clicks they use to find food online.   "
        },
        {
            "text": "Potential risks to harbour porpoise "
        },
        {
            "text": "One of the major threats to harbour porpoises is being accidentally caught in fishing nets. If they are caught they often drown as they are unable to surface to breathe.  "
        },
        {
            "text": "Due to their smaller size they are vulnerable to predators and have been known to be attacked by bottlenose dolphins (who may see them as a competitor for food) and also grey seals which have been known to attack and feed on harbour porpoises.  "
        },
        {
            "text": "They may also be impacted by additional stress from human disturbance such as noise from shipping and other marine development.  "
        },
        {
            "text": "Marine and chemical pollution are also a threats that can affect their health, fertility and immune systems.  "
        },
        {
            "text": "How you can help inform harbour porpoise protection "
        },
        {
            "text": "We’re currently asking for your evidence and views on the impacts of fishing on harbour porpoise and marine bird marine protected areas (MPAs). "
        },
        {
            "text": "Two MPAs within MMOs area of responsibility protect harbour porpoise:    "
        },
        {
            "text": "Your views and evidence will shape fisheries management decisions to ensure harbour porpoises are protected. "
        },
        {
            "text": "Find out more and take part. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}