{
    "url": "https://insidehmcts.blog.gov.uk/2023/12/20/sharing-our-expertise-on-access-to-justice-on-a-global-stage/",
    "title": "Sharing our expertise on access to justice on a global stage",
    "authors": [
        "Luc Altmann, Head of Insight"
    ],
    "categories": [
        "Court and tribunal reform",
        "General"
    ],
    "pub_date": "2023-12-20T11:45:17+00:00",
    "content": [
        {
            "text": "Earlier in December I represented HMCTS at the 2023 Organization for Economic Cooperation and Development (OECD) Global Roundtable on Equal Access to Justice: Making People-centred Justice Happen. Hosted by the Slovenian Ministry of Justice, attendees from across the world gathered to share knowledge and insight on improving access to justice for their citizens."
        },
        {
            "text": "We’ve been working closely with the OECD since 2018, sharing our experience in justice reform to support the development of the People Centred Justice framework. The framework uses best practice to help countries implement their commitments to the United Nations Sustainable Development Goal (SDG) 16 and provide access to justice for all."
        },
        {
            "text": "Providing access to justice is recognised as a “fundamental right underpinning quality democracies, inclusive growth and equality of opportunity” and I’m really proud that HMCTS is part of this initiative."
        },
        {
            "heading": 2,
            "text": "Measuring and improving access to justice in court services"
        },
        {
            "text": "During the event I delivered a workshop to share a draft toolkit I’ve created based on our recently published access to justice assessments. The aim of the toolkit is to create a practical resource for other OECD members to use to measure access to justice in their own country."
        },
        {
            "text": "The workshop was attended by representatives from the US, South Korea, Spain, Slovenia, Canada, Brazil, Ireland, South Africa, Belgium and France. Organisations including the World Bank, United Nations, European Commission and the Cyber Justice Lab also attended to explore issues including:"
        },
        {
            "text": "We received positive feedback from workshop attendees and found that people were very interested in using the toolkit."
        },
        {
            "text": "Our experience and case studies were critical to that, especially to help with understanding the definition we used, the data we collect, how we analyse it and examples of improvements we’ve made to services. Attendees felt these were processes and ideas that could be replicated by other OECD members, which was really reassuring."
        },
        {
            "text": "I shared our experience of compiling our access to justice assessments and how we’re using the information they’ve uncovered to improve our services so that we break down barriers for our users."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Attending and presenting at the conference was a good opportunity for us to gain more insight from other countries and it was interesting to hear alternative approaches and priorities. I found that other OECD countries are being very proactive in seeking and collecting feedback from court users."
        },
        {
            "text": "They have a big focus on the in-court experience and access to justice and ask for court user views at the end of their case. I’m keen to learn more about this and explore how we can replicate that approach in the UK."
        },
        {
            "text": "Over the coming months we’ll continue to work closely with the OECD and are planning a co-authored publication that sets out good practice for measuring access to justice in court services by early 2024."
        },
        {
            "text": "It’s a hugely rewarding piece of work to be a part of, and I’m really proud that HMCTS - representing the UK - is playing a leading role in such a vital area."
        }
    ]
}