{
    "url": "https://space.blog.gov.uk/2025/06/14/former-space-exploration-head-sue-horne-awarded-obe-in-kings-birthday-honours/",
    "title": "Former Space Exploration Head Sue Horne awarded OBE in King's Birthday Honours",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-06-14T07:00:00+01:00",
    "content": [
        {
            "text": "Sue Horne, former Head of Space Exploration at the UK Space Agency, has been recognised with an OBE in the King's Birthday Honours list for her exceptional contributions to space exploration and Mars science over the past two decades."
        },
        {
            "text": "Sue is one of the several individuals from across the space and astronomy community to be honoured this year, reflecting the wide range of talent and dedication driving the UK’s progress in space science, education and industry."
        },
        {
            "text": "The honour acknowledges Sue's pivotal role in building, shaping and championing the UK's Mars science community, establishing the UK as a global leader in planetary exploration, with a presence on nearly every active Mars mission."
        },
        {
            "text": "Sue, who was first awarded a Member of the Order of the British Empire (MBE) in the 2000 New Year Honours list for her services to space, served at the UK Space Agency until her retirement in March 2024. She led the Exploration team during a defining moment for the UK space sector, overseeing the Agency’s role in Tim Peake’s historic mission to the International Space Station."
        },
        {
            "text": "Sue developed and delivered the strategy for the UK's space exploration efforts, including participation in the European Space Agency Exploration Programme and the ExoMars mission, resulting in British industry leading the build of the Rosalind Franklin Mars Rover."
        },
        {
            "text": "Her work spanned support for scientific instruments developed by industry and academia, investment in future technologies, and funding for research and outreach activities."
        },
        {
            "text": "Dr Paul Bate, CEO of the UK Space Agency, said:"
        },
        {
            "text": "A passionate and articulate advocate for the UK’s space sector, Sue has consistently championed national space initiatives, playing a key role in raising public awareness and support for the country's space ambitions."
        },
        {
            "text": "Beyond her professional achievements, Sue has been a powerful advocate for women in STEM, offering support, mentorship and inspiration in a predominantly male-dominated sector. She has fought successfully to allow female researchers to work part-time during their funding periods, ensuring talented women aren't lost. Through personal mentoring, community career events, and active engagement with the scientific community, Sue has helped ensure a continued pipeline of diverse talent for the UK space sector."
        },
        {
            "text": "Libby Jackson, formerly of the UK Space Agency and now Head of Space at the Science Museum, said:"
        },
        {
            "text": "Sue’s award sits alongside several other space and astronomy honours in this year’s list:"
        },
        {
            "text": "The UK Space Agency congratulates Sue and all those honoured on this well-deserved recognition of their outstanding achievements and lasting impact."
        }
    ]
}