{
    "url": "https://dcmslibraries.blog.gov.uk/2020/03/13/introducing-the-dcms-libraries-team/",
    "title": "Introducing the DCMS Libraries team",
    "authors": [
        "Sheila Bennett"
    ],
    "categories": [
        "How we work"
    ],
    "pub_date": "2020-03-13T13:53:56+00:00",
    "content": [
        {
            "text": "We know that it’s not always clear to people in the libraries sector just what the DCMS Libraries Team does, so here’s a whistle-stop tour! "
        },
        {
            "text": "Sitting in the Culture directorate at the Department for Culture, Media and Sport, our team of seven works full time across a range of library issues. We are all civil servants and the purpose of our team is to inform and implement DCMS policy, support our ministers and act as sponsor for the British Library and The National Archives."
        },
        {
            "heading": 2,
            "text": "Annual Report"
        },
        {
            "text": "You can find out more about what we (and a number of library stakeholders) do in our Annual Reports to Parliament. This is a responsibility we have under the Public Libraries and Museums Act 1964 (specifically section 17)."
        },
        {
            "heading": 2,
            "text": "Ministers"
        },
        {
            "text": "Underpinning everything we do is supporting our Secretary of State (The Rt Hon Lisa Nandy MP) in her duties under the Public Libraries and Museums Act 1964. She has a statutory duty to superintend and promote the improvement of public library services in England. "
        },
        {
            "text": "The Secretary of State is supported in that function by the Minister for Museums, Heritage and Gambling, Baroness Twycross. We assist her in a variety of ways, including preparing briefings to support visits she makes or to inform meetings she has with representatives from across the sector. "
        },
        {
            "text": "We also provide advice to ministers dealing with Parliamentary Questions, correspondence, debates and Freedom of Information (FoI) requests. This often requires us to work to tight timescales. For example, if we receive a Named Day Parliamentary Question we often have to provide a fully cleared response on the same day. "
        },
        {
            "heading": 2,
            "text": "Libraries Strategy"
        },
        {
            "text": "The previous public libraries strategy Libraries Deliver: Ambition was the first ever libraries strategy for public libraries in England. It has been the foundation on which DCMS has built its advocacy and engagement, emphasising a need for government – at both central and local level – to ‘think libraries first’ in providing services and support to local communities; and also seeing libraries as an investment rather than a cost."
        },
        {
            "text": "DCMS is now looking afresh at how the government can most effectively oversee, support and advocate for the sector and is working on a new Government strategy for public libraries in England. In September 2022, Baroness Sanderson was appointed to provide a fresh and impartial perspective on the sector and to make recommendations to help inform future work on a government strategy. See our blogs here, here and here about the work she undertook."
        },
        {
            "text": "Baroness Sanderson’s review was published in January 2024 which included 8 recommendations for government to consider as part of a libraries strategy. "
        },
        {
            "heading": 2,
            "text": "Superintendence"
        },
        {
            "text": "This statutory responsibility, under the Public Libraries and Museums Act 1964, is largely delegated by the Secretary of State to the Libraries Minister. We support the Ministers by investigating any complaints that are made about library services which people think are failing to meet their statutory duty. You can find out more about this in the guidance on Libraries as a Statutory Service. We also publish the Ministerial decision letters about complaints that we have investigated."
        },
        {
            "text": "However, that is only part of our superintendence work. We are really keen to talk to and visit library services who are at an early stage in considering changes (or are in the process of making changes) to their library service provision. This helps us understand what’s happening but also provides opportunities for councils to ask us questions. Sometimes we meet councils because they have contacted us; but other times we pick up the phone to talk to them because we’ve heard they’re planning changes, that a consultation is underway or being planned, or that a new strategy has been published."
        },
        {
            "heading": 2,
            "text": "Policy"
        },
        {
            "text": "DCMS is responsible for public libraries policy. This means that we work within government to promote the value of libraries and what they deliver to decision makers. We talk to a wide range of people in different departments advocating for the strengths of libraries in supporting their agendas – whether that’s health and well-being, business support, skills, or supporting places like rural communities, high streets and towns."
        },
        {
            "text": "Just one example: we worked closely with colleagues in Department for Education, and with specialists in the sector, to ensure that the role that public libraries (including School Library Services) can play in complementing the work that goes on in schools to develop reading for pleasure is recognised; this has been reflected in the Reading Framework (published Sept 2023)."
        },
        {
            "text": "We also work closely with other parts of DCMS to promote the role of public libraries; for example the teams working on loneliness, and civil society. Most recently we worked with a team drawing up an interactive map showing free or low cost activities to help families over the summer period. All public library branches appeared on this. It has not only been made available on GOV.UK, but also via Money Saving Expert’s website."
        },
        {
            "text": "Part of the Secretary of State’s statutory duty is to promote the improvement of the public library service provided by councils in England. To support this, we monitor developments in library services across England and work with Arts Council England (ACE) which is the national development agency for libraries."
        },
        {
            "text": "We are also aiming to better understand why people may not use their library at present, and what would make them reassess this position."
        },
        {
            "heading": 2,
            "text": "Funding"
        },
        {
            "text": "While public libraries are core funded through the Local Government Settlement there are opportunities through fiscal events (budgets and spending reviews) to secure additional investment. Most recently this has included:"
        },
        {
            "heading": 2,
            "text": "Library byelaws"
        },
        {
            "text": "Councils can choose to make byelaws regulating the use of library facilities that they run under the 1964 Act. DCMS has to confirm each set of library byelaws before they can come into effect. Discussions are in train with Libraries Connected about updating the existing model byelaws. We will publish some new guidance to go alongside any revised version."
        },
        {
            "heading": 2,
            "text": "Data"
        },
        {
            "text": "To carry out our statutory responsibilities and our advocacy work we need to have a sound foundation of robust data about public libraries. However we know that this continues to be a significant challenge for the libraries sector. We have previously worked with the sector on a schema for the core dataset which we’ve blogged about in the past. We intend data to be a core part of our future work plan, and to feature in the upcoming government public libraries strategy  We continue to work with ACE and other organisations across the libraries sector to develop practical approaches to achieving this."
        },
        {
            "heading": 2,
            "text": "Public Lending Right"
        },
        {
            "text": "Eligible authors have a legal right to be remunerated for registered books which are borrowed from public libraries in the UK, under legislation called the Public Lending Right Act 1979. The rate of payment is determined in accordance with secondary legislation, the PLR Scheme. This Scheme is administered for us by the British Library. We work with the British Library to run a consultation on a revised rate per loan each year, seeking ministerial approval and amending the Scheme legislation through a Statutory Instrument."
        },
        {
            "heading": 2,
            "text": "Sponsorship"
        },
        {
            "text": "Sponsorship is the activity that promotes and maintains an effective working relationship between departments and public bodies, based on accountability and performance monitoring, to support efficient and effective services to the public. This could include aspects of finance, commercial, legal, operational and organisational management."
        },
        {
            "heading": 2,
            "text": "The British Library"
        },
        {
            "text": "DCMS sponsors the British Library, which is an arm’s length body of the department based in St Pancras, London and Boston Spa, West Yorkshire. As the British Library is primarily funded by the public through what is called Grant-in-Aid from DCMS, our sponsorship role ensures the British Library is accountable in delivering its business plan and objectives as outlined in the framework document with the department. We also have a role in getting the British Library linked into policies and opportunities across government. "
        },
        {
            "text": "For example, we help them put forward funding cases, such as that to build state-of-the-art storage at the British Library’s site in Boston Spa to grow and protect the national collections it holds on behalf of the nation. Or we help them address particular issues such as giving the Library the freedom other sponsored museums and galleries have to borrow money. The British Library Board (Power to Borrow) Act  received Royal Assent in April 2021."
        },
        {
            "heading": 2,
            "text": "The National Archives"
        },
        {
            "text": "DCMS also sponsors The National Archives, which is based in Kew, South West London. The National Archives is a Non-Ministerial Department which acts as the lead Public Record Office for England and Wales. It holds government records and prints legislation. "
        },
        {
            "text": "An important part of sponsoring The National Archives is handling the significant number of Freedom of Information (FOI) cases received and whether to release or withhold government records to the public. The Public Records Act requires central government departments, and certain other public bodies, to identify records of historical value and transfer them for permanent preservation to The National Archives, or to another appointed place of deposit, by the time they are 20 years old. There are particular cases when records are transferred or when the TNA receives an FOI that a DCMS Minister must be consulted. "
        },
        {
            "text": "The DCMS Minister provides a consultation with support from The Advisory Council on National Records and Archives. The Council advises Ministers on government departments’ retention of records under the Freedom of Information Act. It represents the Public Interest in making decisions about whether Departments’ requests to close records rather than make them public are acceptable under the exemptions to release included in the Act. "
        },
        {
            "text": "Akin to our role sponsoring the British Library, we also have a support role in getting The National Archives linked into policies and opportunities across government, from levelling up to net zero. "
        },
        {
            "text": " "
        },
        {
            "text": "Subscribe to the blog, follow us on 'X' (formerly Twitter) or let us know if you’ve got any questions by emailing us on dcms-libraries@dcms.gov.uk "
        }
    ]
}