{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/07/10-million-winter-fund-launched-to-protect-rough-sleepers/",
    "title": "£10 Million Winter Fund Launched to Protect Rough Sleepers",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2024-11-07T17:13:23+00:00",
    "content": [
        {
            "text": "Yesterday we launched an  emergency £10 million fund to support rough sleepers this winter. As the coldest months of the year approach, this funding will go direct to councils with the highest need and support thousands of the most vulnerable people in society."
        },
        {
            "text": "PA Media reported this as an urgent response to a ‘surge’ in rough sleeping, where those at risk will be ‘protected’. This was also covered in the Metro, The Standard and The Independent."
        },
        {
            "text": "A wide range regional outlets welcomed the funding, with Manchester Evening News reporting Greater Manchester received  £500,000. The Liverpool Echo also welcomed the funding, underscoring the urgent need for support in Liverpool, where demand for homelessness services has surged by a third over the past year. The Irish News,  The Star, Kent Online, Express and Star, Shropshire Star and  Northern Echo also reported positively on regional funding for their area."
        },
        {
            "text": "This has been welcomed by regional mayors, including Mayor of London Sadiq Khan, The Mayor of West of England Dan Norris, and the Mayor of South Yorkshire, who praised the DPM for “bringing together the full force of the UK Government to end homelessness.” "
        },
        {
            "text": "The Homelessness Minister, Rushanara Ali spoke to BBC News South Yorkshire and BBC Dorset saying \"it's about trusting local authorities to bolster the partnerships they have with local charities and to be able to provide that support quickly.\""
        },
        {
            "text": "Minister Ali also wrote exclusively for the Big Issue, that she will work across government, with mayors and councils, as well as charities and voluntary organisations, to reverse failures on homelessness."
        },
        {
            "text": "Michael Buchanan from the BBC interviewed the Deputy Prime Minister during a visit to Great Guildford St, a homelessness hostel run by St Mungo’s, in Southwark. There she spoke with Stephen Richards who had been sleeping rough for 6 weeks. The piece ran as second story on BBC Breakfast this morning where Emma Haddad, Chief Executive of St Mungo’s, said she supported the ban on Section 21 ‘no fault’ evictions through the Renters’ Rights Bill, which is a huge driver of homelessness."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said"
        },
        {
            "text": "“Anyone forced to sleep rough on our streets represents a complete failure of the broken system we've inherited. It's a national disgrace, and we can’t keep sticking plasters on it. "
        },
        {
            "text": "“We are approaching the harshest months of the year which is why we are taking immediate action to reach anyone sleeping rough and help them off the streets this winter. "
        },
        {
            "text": " “Bringing together Ministers across government is a crucial step to tackle this crisis at its root and ensure everyone has access to the basic right of safe and secure housing.” "
        }
    ]
}