{
    "url": "https://educationhub.blog.gov.uk/2024/11/07/alternative-student-finance-how-were-making-student-finance-accessible-to-everyone/",
    "title": "Alternative Student Finance – how we’re making student finance accessible to everyone",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2024-11-07T11:50:56+00:00",
    "content": [
        {
            "text": "Some people feel unable to use existing student loans due to their faith. This is most common among some Muslims because their religion prohibits engagement with interest, which is applied to all student loans."
        },
        {
            "text": "We support the goals of every person who meets the requirements and wants to go to university. That’s why we’re developing a new student finance system that doesn’t include interest and is compatible with Islamic finance principles."
        },
        {
            "heading": 3,
            "text": "What is Alternative Student Finance and how will it work?"
        },
        {
            "text": "Alternative Student Finance (ASF) will be one of the first state-backed student loan schemes in the world that is Sharia-compliant. It will mean that those who can’t take out interest-bearing loans for religious reasons can access student finance."
        },
        {
            "text": "ASF will be certified as being Sharia-compliant and will use the Islamic finance principle of Takaful, to provide a form of group based mutual support."
        },
        {
            "text": "Prospective undergraduate students will apply for an ‘alternative payment’ for both their tuition fees and living costs, instead of a traditional student loan."
        },
        {
            "text": "Like existing student loans, applications will be made through Student Finance England."
        },
        {
            "text": "After finishing or leaving their studies, students will repay contributions to a fund that will only be used to help future students access ASF."
        },
        {
            "heading": 3,
            "text": "Does this mean students who use ASF will pay less than those who opt for a student loan?"
        },
        {
            "text": "No. ASF is designed to make sure all students are treated the same. Those who use ASF will pay the same amount towards their studies as those who use the standard student loan system."
        },
        {
            "text": "All payments and contributions made through ASF will mirror those made by students who use regular student finance. This means that students will be able to apply for the same amount of financial support regardless of the system they use."
        },
        {
            "text": "Similarly, the amounts and timings of contributions back to the Takaful fund will also be identical to repayments made for mainstream loans. ASF contributions, like repayments of student loans, will be based solely on what people earn, not the amount of finance received."
        },
        {
            "heading": 3,
            "text": "Who can apply for ASF?"
        },
        {
            "text": "ASF will be open to any student who is eligible for student finance."
        },
        {
            "heading": 3,
            "text": "When will ASF be available?"
        },
        {
            "text": "We are working with the Student Loans Company to plan the timeline and"
        },
        {
            "text": "From the 2026/27 academic year, the Lifelong Learning Entitlement (LLE) will change the post-18 student finance system in England. We aim to introduce ASF as soon as possible after the LLE is introduced, to make sure the ASF product matches mainstream student finance."
        },
        {
            "heading": 3,
            "text": "What can you do in the meantime if you can’t take out a student loan for religious reasons? "
        },
        {
            "text": "Here are some sources of financial support that might be worth considering:"
        },
        {
            "text": "You could also consider a degree apprenticeship, which allows you to study towards an undergraduate or postgraduate degree while you work, without paying for tuition."
        }
    ]
}