{
    "url": "https://sustainableict.blog.gov.uk/2024/11/07/connecting-nature-and-technology-reflections-from-cop16/",
    "title": "Connecting nature and technology – reflections from COP16",
    "authors": [
        "Matt Bradley"
    ],
    "categories": [
        "GDSA",
        "Planetary Impact",
        "Sustainable ICT"
    ],
    "pub_date": "2024-11-07T11:14:16+00:00",
    "content": [
        {
            "text": "Ahead of the start of COP29 Matt Bradley reflects on the achievements from another COP - COP16 – which took place in Colombia recently."
        },
        {
            "text": "COP16 marked the first Biodiversity COP since the adoption of the Kunming-Montreal Global Biodiversity Framework. Nearly two years after COP15 in Montreal, where 196 countries agreed to protect at least 30% of the world’s land and oceans by 2030, COP16 saw the world stage come together in Colombia."
        },
        {
            "text": "It’s important not to confuse COP16 with COP29.  COP29, which gets underway next week in Baku, is part of the United Nations Framework Convention on Climate Change (UNFCCC), and addresses overarching climate policies and emissions, whereas COP16 is part of the Convention on Biological Diversity (CBD), which focuses primarily on the biodiversity crisis."
        },
        {
            "text": "Colombia, renowned for its incredible biodiversity, has committed to conserving 30% of its land and marine areas by 2030. This global initiative aims to protect biodiversity and combat deforestation, with indigenous communities bringing their traditional knowledge and sustainability practices to maintain biodiversity."
        },
        {
            "text": "Home to around ten percent of the planet’s species, Colombia is ideally placed to preserve its natural heritage through policies and actions, making it a leader in global biodiversity conservation."
        },
        {
            "text": "The summit concluded with several significant outcomes, highlighting both advancements and ongoing challenges in global biodiversity conservation efforts. Indigenous Peoples and People of African Descent were formally acknowledged as key stewards in conservation efforts. Additionally, the Cali Fund was established to ensure fair and equitable distribution of benefits to Indigenous Peoples and local communities."
        },
        {
            "text": "However, the summit ended without a consensus on a financing model to implement the Kunming-Montreal Global Biodiversity Framework, which aims to halt and reverse biodiversity loss by 2030."
        },
        {
            "heading": 2,
            "text": "Technology and biodiversity conservation"
        },
        {
            "text": "Technology can play a vital role in preserving biodiversity, despite its unintended consequences. Prior to COP16, Environment Secretary Steve Reed MP emphasised the importance of taking action now to conserve nature. So, how can the technology industry connect with nature?"
        },
        {
            "heading": 2,
            "text": "AI to VR - Exploring the Role of Technology"
        },
        {
            "text": "Well, in lots of ways. Harnessing the power of technology, data, and people can create a sustainable future that addresses pressing climate issues. Big Data and Artificial Intelligence (AI) can analyse large datasets, predict trends, and identify areas needing urgent conservation efforts."
        },
        {
            "text": "Defra is actively working on restoring peatlands across England using advanced technologies, including AI. This initiative is part of the Nature for Climate Peatland Grant Scheme, which aims to restore approximately 35,000 hectares of peatland by 2025."
        },
        {
            "text": "Peatlands are crucial for carbon storage, water quality, and biodiversity. However, many of them are degraded and emit greenhouse gases. Defra’s projects involve rewetting and restoring these landscapes to their natural state, which helps in tackling climate change and enhancing biodiversity."
        },
        {
            "text": "Technology can enhance biodiversity monitoring through remote sensing, satellite imagery, and IoT devices, providing real-time data on ecosystem health and biodiversity changes. The Instant Detect 2.0 project by the Zoological Society of London (ZSL) uses sensors, cameras, and satellite technology to monitor wildlife and detect poaching activities in real-time."
        },
        {
            "text": "Technology can also serve as an educational tool. Virtual reality (VR) and augmented reality (AR) create immersive experiences that educate people about biodiversity and conservation. The Stanford Ocean Acidification Experience, a VR simulation, allows users to experience the effects of ocean acidification on marine ecosystems, significantly improving understanding and retention of information among students."
        },
        {
            "heading": 2,
            "text": "Consider the hidden impact"
        },
        {
            "text": "When using technology, consider where its components come from and where they end up. The energy consumed by the industry and associated greenhouse gas emissions impact biodiversity. The production of IT devices requires the extraction of raw materials like rare earth metals, leading to habitat destruction, soil erosion, and pollution."
        },
        {
            "text": "Installing IT infrastructure can disrupt natural habitats, causing habitat fragmentation and loss, and affecting species reliant on these areas. The rapid turnover of electronic devices leads to significant electronic waste, releasing harmful chemicals into the environment."
        },
        {
            "heading": 2,
            "text": "Playing our part"
        },
        {
            "text": "To address these issues, it’s essential that we adopt sustainable practices in the IT sector. Two key elements are:"
        },
        {
            "text": "For me, there is a clear synergy between biodiversity conservation and technological advancements. By acknowledging and addressing the negative impacts, we can better leverage IT for conservation while minimising its ecological footprint."
        },
        {
            "text": "COP16 has made progress, and its outcomes can be supported and enhanced by IT solutions, fostering a sustainable future for our planet."
        },
        {
            "text": "There’s so much more we can all do though. The Government Digital Sustainability Alliance (GDSA), which I’m a member of, has formed a working group of key technology alliance partners to go beyond carbon in understanding the planetary impacts arising from technology, and to understand how these unintended consequences can be measured, monitored and mitigated. We’re meeting again in the next couple of weeks, and I for one am optimistic about what we might achieve going forward."
        },
        {
            "heading": 6,
            "text": "Matt Bradley is Sustainability Director at Capgemini, one of the founding members of the Government Digital Sustainability Alliance (GDSA). The GDSA seeks to promote, collect, share and demonstrate best practice aligned to Defra’s and UK Government sustainability commitments."
        },
        {
            "heading": 6,
            "text": "If you’re interested in finding out more about what we do or would like to know more about becoming a member of the Alliance, please get in touch."
        },
        {
            "heading": 6,
            "text": "Find out more about our work in our recent GDSA Planetary Impact Video."
        }
    ]
}