{
    "url": "https://nda.blog.gov.uk/discovering-the-secrets-in-the-ground-underneath-western-europes-most-hazardous-building/",
    "title": "Discovering the secrets in the ground underneath Western Europe’s most hazardous building",
    "authors": [
        "John Heneghan"
    ],
    "categories": [
        "Research and development",
        "Uncategorized",
        "Waste management"
    ],
    "pub_date": "2024-11-07T11:25:17+00:00",
    "content": [
        {
            "text": "Sellafield’s legacy waste store, the Magnox Swarf Storage Silo, leaked radioactive liquor into the ground in the 1970s and in 2019 a new leak was discovered. "
        },
        {
            "text": "Our experts are pioneering new ways to help understand and manage what’s going on in the ground below it."
        },
        {
            "text": "Curiosity around what comes back up after you drop a lure into deep water is a human instinct as old as, well, humans. Whether it’s a fish hook, a depth gauge or powerful ‘fishing magnets’, we all want to know more about what lies in the unseen depths below."
        },
        {
            "text": "John Heneghan, contaminated land specialist in Sellafield’s Remediation team, gets to satisfy this curiosity in one of the most challenging, complex environments imaginable: under the ground of the Magnox Swarf Storage Silo, officially the most hazardous building on the Sellafield site."
        },
        {
            "text": "John and his team have been pioneering a new method of extracting water samples from multiple depths under the silo to build a scientific picture of what exactly is moving around in the substrata."
        },
        {
            "text": "Like a Time Team forensic investigation, they create a detailed picture of what’s happened at the scene using a matrix of tiny clues. But instead of a piece of pottery, some ancient seeds or a stone carving, John is looking for radionuclides and other ‘fingerprint’ qualities in water samples such as its electroconductivity or the levels of dissolved oxygen."
        },
        {
            "text": "There’s nothing new in drilling boreholes at Sellafield to collect groundwater samples – we’ve been doing it for decades. It was the older generation of sampling boreholes which confirmed the impact of the first underground leak from the silo in the 1970s. The liquor released then was over 50 times more radioactive than the liquid seeping out now."
        },
        {
            "text": "That’s because the original batch of liquor had been covering the radioactive offcuts from Magnox nuclear fuel rods for years, building up radioactivity like a slow-cooked stew. "
        },
        {
            "text": "Today’s liquor is far more diluted, not only because of the radioactive half-life of the waste put in there in the 1960s, but also because we’re constantly topping up the silo with demineralised water to keep the waste safely submerged. Liquor is seeping out of an unseen, unreachable crack at a rate of 1.7 litres per minute – so that’s the rate we fill at the top."
        },
        {
            "text": "Thankfully, our planet has done a great job in being the first line of protection."
        },
        {
            "text": "Directly underneath the silo is clay, which naturally binds in Caesium. This radioactive isotope accounts for around 95% of the radioactive content of the liquor. "
        },
        {
            "text": "That means that the vast majority of the radioactivity is already locked in the ground under the silo rather than moving around via groundwater."
        },
        {
            "text": "Some radionuclides are more mobile though, which is where John’s team comes in. "
        },
        {
            "text": "The recent technological breakthrough has been in understanding what is happening at different layers in the ground. "
        },
        {
            "text": "Beneath the silo are multiple individual layers of sand, clay and gravel sitting on sandstone bedrock about 45 metres down. These layers have tiered up over millions of years as glaciers tumbling down from the fells or sweeping in from the Irish Sea have brushed their deposits back and forth to build up a geological ‘trifle’."
        },
        {
            "text": "The borehole has up to 6 different sealed tubes positioned at varying heights for samples to be pumped up to the surface to be transferred for laboratory analysis. "
        },
        {
            "text": "The system was developed over 10 years by the internationally-leading Morwick G360 Group at the University of Guelph in Ontario, Canada."
        },
        {
            "text": "Sellafield Ltd commissioned the first trial in the UK before installing it on the Sellafield site in November 2023. This was the first time in the world it had been deployed on a nuclear site. "
        },
        {
            "text": "Sellafield is now collaborating with other nuclear sites such as Savannah River and Hanford in the US to see if it can help there."
        },
        {
            "text": "In all 7 new boreholes were drilled for the new kit by specialist firm GeoSonic Drilling, supported by the i3 consortium. The deepest borehole was 50 metres down – that’s the same height as Nelson’s Column. Drilling deep holes on a congested nuclear site with a history like Sellafield’s is as complicated as you would imagine."
        },
        {
            "text": "Nevertheless, there were some surprises. "
        },
        {
            "text": "It’s all been worth the effort though. In the months since analysis has started on the new pinpointed samples, John and his team have been able to build a far more detailed picture of what’s happening underground."
        },
        {
            "text": "People will be understandably concerned about a leak of radioactive material on the Sellafield site – and it is an issue Sellafield and its regulators the Environment Agency and Office for Nuclear Regulation are taking incredibly seriously. But we are confident that there is no current risk of it harming anyone off-site or entering water supplies, which are sourced miles away, uphill from the Sellafield site (and water can’t flow uphill). "
        },
        {
            "text": "Instead, any contamination will move very slowly underground on the Sellafield site (typically at a rate of around a metre per year for strontium). It is slowly heading towards the sea directly next to Sellafield, where it would be massively diluted and pose no risk to the public."
        },
        {
            "text": "Nevertheless his team are exploring ways to stop the underground movement all together. "
        },
        {
            "text": "What then happens to the contaminated ground under the site is another issue, just like it is for many brownfield industrial locations. Decisions will need to be made on the safest and most sustainable solution. "
        },
        {
            "text": "But rest assured that with experts like John on hand, any decision will be informed by a wealth of factual evidence. "
        }
    ]
}