{
    "url": "https://valuationoffice.blog.gov.uk/2024/11/07/greater-transparency-in-valuation-information/",
    "title": "Greater transparency in valuation information ",
    "authors": [
        "Alan Colston - Chief Valuer and Head of Surveying Profession"
    ],
    "categories": [
        "Business Rates"
    ],
    "pub_date": "2024-11-07T13:59:52+00:00",
    "content": [
        {
            "text": "With the Valuation Office Agency’s (VOA) future approach to sharing valuation information announced, we explore what the changes will mean for our customers.   "
        },
        {
            "text": "Significant reforms to the business rates system are now underway. These will: "
        },
        {
            "text": "An important part of the reforms is increasing transparency – sharing more evidence with ratepayers to explain how we have calculated their rateable value. This, in turn, helps build trust in our valuations. "
        },
        {
            "text": "These changes will happen in phases. We’ve already made improvements to our guidance for customers. "
        },
        {
            "text": "The government’s Business Rates Review Final Report said that greater transparency would come after the introduction of the new duty on ratepayers to provide property information to the VOA.  "
        },
        {
            "text": "The new information duty on ratepayers is expected to be introduced after 1 April 2026. It will be tested with small numbers of customers in phases from that point so we can make sure the system works for all ratepayers.  "
        },
        {
            "text": "The duty will then be formally activated and mandated for everyone by 1 April 2029.  "
        },
        {
            "text": "It will make sure the information we disclose to ratepayers is more timely and complete.  "
        },
        {
            "text": "Changes to the Check, Challenge, Appeal system will also be introduced in April 2029. "
        },
        {
            "text": "Listening to feedback "
        },
        {
            "text": "It’s important that feedback from our customers and stakeholders informs any changes. "
        },
        {
            "text": "We held a consultation last year and have done research with ratepayers and agents. This has given us a range of views on what information is helpful, and what may be more sensitive and not suitable to be disclosed. "
        },
        {
            "text": "We know that some people want greater transparency. But this needs to be balanced with the concerns of others about the confidentiality of their data.  "
        },
        {
            "text": "Ratepayers also told us that they prefer simplified information and don’t want to be overwhelmed with details. "
        },
        {
            "text": "Our phased approach "
        },
        {
            "text": "From 2026, we’ll improve how we share existing information on a property’s valuation.  "
        },
        {
            "text": "For bulk properties, ratepayers registered with our Check, Challenge, Appeal system will be able to request a tailored package of information. This will make it easier for them to understand: "
        },
        {
            "text": "Much of this information is already available. But research has shown we need to improve how we present it. This is particularly the case with information about comparable properties, which helps ratepayers consider the fairness of their rating assessment. "
        },
        {
            "text": "For properties valued using the receipts and expenditure or contractor’s basis methods, we’ll only share information about the ratepayer’s own property. We won’t include ‘comparable’ information or evidence, as this may be commercially or otherwise sensitive.  "
        },
        {
            "text": "Feedback has already told us ratepayers are likely to find these changes helpful.  "
        },
        {
            "text": "We also know that more information is needed to fully understand how we’ve arrived at a property’s rateable value.  "
        },
        {
            "text": "What we will share from 2029 "
        },
        {
            "text": "We’ll be providing more valuation evidence and information in the second phase of these changes, from publication of the draft 2029 rating lists. "
        },
        {
            "text": "For properties valued using local rents, we’ll expand the information to include rental evidence we’ve relied on in our valuations.  "
        },
        {
            "text": "Having listened to your feedback, we also expect to provide more information about the type of transactions. For example, whether it is a: "
        },
        {
            "text": "We’ll continue to explore with agents how best to provide information around the adjustments we make to rental evidence during our valuations.   "
        },
        {
            "text": "More to come "
        },
        {
            "text": "Above I’ve set out the phased approach we’ll be taking to providing more valuation information, but really our work is only getting started. "
        },
        {
            "text": "Further research is already underway. We’d like to learn more about what helps ratepayers understand their valuation and any rental evidence. And what extra information may help people better understand a property’s rateable value. "
        },
        {
            "text": "We’re clear that we want to design and build the service working with ratepayers, agents and other stakeholders. That means we will listen to feedback and take it on board where we can. "
        },
        {
            "text": "These changes will also mean the UK is among those countries who provide a higher level of transparency in valuation data. "
        }
    ]
}