{
    "url": "https://actuaries.blog.gov.uk/2024/11/07/investment-oversight-insight/",
    "title": "Investment oversight insight",
    "authors": [
        "Christophor Ward - Investment Lead"
    ],
    "categories": [
        "Actuary",
        "Investment"
    ],
    "pub_date": "2024-11-07T09:46:56+00:00",
    "content": [
        {
            "text": "Investment governance refers to the framework and processes which guide investment decision making. For actuaries this is often in respect of pension funds and insurers. However, the structures and policies apply more broadly across institutional investors and the work of government where it can be a stakeholder in establishing or reviewing a fund."
        },
        {
            "heading": 2,
            "text": "Investment strategy"
        },
        {
            "text": "Investment experts at the Government Actuary's Department (GAD) work with clients on investment strategy. This work will often use analysis to help support GAD’s recommendations."
        },
        {
            "text": "However, just as important is our work to help clients identify what their goals are, and any requirements or restrictions on how they want to go about achieving those goals."
        },
        {
            "heading": 2,
            "text": "Criteria and rules"
        },
        {
            "text": "In implementing an investment strategy, the pursuit of returns and management of investment risks can lead to a desire to set criteria to encourage, or even try to ensure, a desired outcome. Adding rules can help to ensure that those responsible for investments, such as trustees and investment committees, are thorough, and use rules to ensure consistency and manage exposure to certain risks."
        },
        {
            "text": "However, adding too many rules, albeit with good intention, can also create some risks, often considered to be a check-list mentality. This can include such rules presenting an oversimplified view of what is a complex situation, seemingly limiting flexibility and providing a false sense of security."
        },
        {
            "text": "Having strong investment governance can reduce the need for too many rules and the potential adverse consequences that over-reliance on rules can have."
        },
        {
            "heading": 2,
            "text": "Investment governance"
        },
        {
            "text": "Key elements of investment governance include:"
        },
        {
            "heading": 2,
            "text": "Case study: Power station development"
        },
        {
            "text": "Our story – GAD supports power station development – sets out how we worked with the Department for Energy Security and Net Zero in the development of Sizewell C. We did this by applying our experience of funding models."
        },
        {
            "text": "An important feature of this work included looking over the operational period of a power station, as well as the full period over which its decommissioning is expected to take place."
        },
        {
            "text": "Over that 100+ year period we expect that power generation, the economy and many aspects of day-to-day life will change. The form of these changes could be inconceivable to us currently."
        },
        {
            "text": "We could not confidently work with stakeholders to set a highly prescriptive funding and investment strategy because our understanding and tools are so heavily informed by the world today."
        },
        {
            "text": "Instead, we helped to develop a governance framework which empowers those making funding decisions to set their own investment strategy. This allows flexibility to respond to how the world may develop, which could be in ways that we can’t envisage today."
        },
        {
            "text": "However, such flexibilities also come with controls, such as around the requirement to take independent professional advice, for disclosure and the opportunity for external challenge."
        },
        {
            "text": "Some high-level guard rails have been considered, with opportunities for intervention."
        },
        {
            "heading": 2,
            "text": "How we help the public sector"
        },
        {
            "text": "As actuaries we are professionals at analysing how assets and liabilities interact and setting appropriate funding and investment strategies."
        },
        {
            "text": "We are also experienced at communicating this to our clients so that our advice and recommendations are relevant to the decisions that our clients must make."
        },
        {
            "text": "This happens both in our capacity as advisers, and through roles we have on boards and committees."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}