{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/07/kickstarting-local-nature-recovery/",
    "title": "Kickstarting local nature recovery: a new strategy for the West of England",
    "authors": [
        "Hannah Foster"
    ],
    "categories": [
        "Biodiversity net gain",
        "Community",
        "Land use",
        "Local Nature Recovery Strategies",
        "Nature"
    ],
    "pub_date": "2024-11-07T08:50:37+00:00",
    "content": [
        {
            "text": "We all have a part to play in supporting nature’s recovery, from individuals and businesses to communities and local authorities."
        },
        {
            "text": "Local Nature Recovery Strategies are locally led, evidence-based strategies that will help to prioritise and target action and nature investment in the right place."
        },
        {
            "text": "Today, the first ever Local Nature Recovery Strategy has been published by the West of England Combined Authority in Bristol."
        },
        {
            "text": "In total, 48 responsible authorities are preparing strategies that will cover every place in England."
        },
        {
            "text": "The publication of the first strategy is an important milestone for Defra, as one of our key tools for driving forward nature recovery."
        },
        {
            "text": "We know that local people understand their places better than anyone. We’ve previously explained how Local Nature Recovery Strategies will be used to agree shared priorities for nature recovery, and to propose actions in the locations where they will have the greatest environmental impact."
        },
        {
            "text": "They are designed to help target biodiversity net gain and nature-recovery actions by government and other public bodies, and to help landowners understand where and how they can make changes for nature on their land."
        },
        {
            "text": "As action is taken locally, we will see progress towards our national environmental targets. For example, it will identify opportunities to help fulfil our commitment to restore or create more than 500,000 hectares of wildlife-rich habitat by 2042.  "
        },
        {
            "text": "The West of England Local Nature Recovery Strategy is the first step towards turning this ambition into a reality."
        },
        {
            "text": "From the banks of the Severn Estuary to the beautiful Avon Valley and the rolling hills of the Mendips, this region is already home to some wonderful places for wildlife. This strategy will help to connect, expand and restore these habitats by setting a blueprint for next steps for the area."
        },
        {
            "text": "The West of England Local Nature Recovery Strategy has been developed through close collaboration. It involved local communities, environmental organisations and delivery partners such as Defra group bodies, local authorities and landowners."
        },
        {
            "text": "It also went through a public consultation, to make sure it is a strategy that works for local people and other organisations that will deliver it. You can read more about the development process in this blog post by Natural England."
        },
        {
            "text": "The result is an ambitious and truly collaborative strategy, with a real focus on tangible delivery. It reflects local circumstances, but is also designed to work with national policies and funding opportunities."
        },
        {
            "text": "Lessons learned in the development of West of England’s strategy will benefit other responsible authorities as they get closer to publishing their own strategies. They will be supported throughout by Natural England, the Environment Agency and the Forestry Commission."
        },
        {
            "text": "Alongside their strategy, the West of England Combined Authority has also published a Local Nature Recovery Toolkit to aid their strategy’s delivery – informing and accelerating action for nature across the region."
        },
        {
            "text": "Both the strategy and toolkit have been launched at the West of England Nature Partnership 2024 Conference in Bristol today, which Chair of Natural England Tony Juniper is attending."
        },
        {
            "text": "The publication of the first strategy marks the start of a national rollout of strategies, as more local authorities respond to the urgent need to support nature and improve climate resilience."
        },
        {
            "text": "It’s not too late to input to the Local Nature Recovery Strategy being prepared in your area – take a look at the list of responsible authorities to find out how you can make your voice heard locally."
        },
        {
            "text": "We’ll keep you updated with our progress on this blog. To receive an email notification every time we publish a new blog post, please subscribe."
        }
    ]
}