{
    "url": "https://cddo.blog.gov.uk/2024/11/07/making-leadership-more-visible-senior-civil-service-roles-are-now-on-the-digital-and-data-capability-framework/",
    "title": "Making leadership more visible: Senior Civil Service roles are now on the Digital and Data Capability Framework",
    "authors": [
        "Jodie Keens, Product Manager, CDDO",
        "Sarah Herman, Senior User Researcher, CDDO",
        "Olivia Helliwell, Senior Content Designer, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Cyber security",
        "Data",
        "Digital learning and development",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-11-07T15:23:21+00:00",
    "content": [
        {
            "text": "For the first time, we are expanding the Government Digital and Data Profession Capability Framework to include Senior Civil Service (SCS) roles. This expansion increases visibility of executive leadership and establishes clearer career pathways to a senior role in government."
        },
        {
            "heading": 3,
            "text": "Developing the first SCS roles on the framework "
        },
        {
            "text": "Through an intensive research and design process, we have created role and skill profiles for three SCS roles:"
        },
        {
            "text": "These roles reflect the priorities of departments across government and will be followed by more SCS roles after research, design and development with the relevant subject matter experts. "
        },
        {
            "text": "To ensure we accurately reflect the requirements of these roles, as well as those of a digital and data leader, we thoroughly explored:"
        },
        {
            "text": "These insights led our decision-making, ensuring we were designing the roles and skills to meet user needs."
        },
        {
            "heading": 3,
            "text": "Designing for our users"
        },
        {
            "text": "The framework has a very varied audience, our user groups include those already in the role, those who might want to do the role in the future and those who are unfamiliar with both the role and the profession. It was our challenge to ensure that SCS role holders felt their roles were accurately reflected, that career progression had more visibility and that people unfamiliar with digital and data roles could understand what they do and the value they bring."
        },
        {
            "heading": 3,
            "text": "Developing a complementary skills structure"
        },
        {
            "text": "User research findings led us to design a complementary skills structure that better reflects the scope of skills needed for senior leadership roles. This structure includes:"
        },
        {
            "text": "These leadership skills are specifically designed for SCS roles but sit within the existing Digital and Data Capability Framework. This means users can view and compare skills at all levels, providing clearer visibility of career pathways and progression opportunities."
        },
        {
            "heading": 3,
            "text": "Continuing to grow"
        },
        {
            "text": "With our continuous improvement approach, we are consistently making the framework better. This includes engaging subject matter experts across government to proactively improve roles and skills, as well as making iterative improvements through content design reviews."
        },
        {
            "text": "As a ‘living product’, we encourage colleagues to propose a change to the framework and provide feedback on using the framework to help us evolve.If you have any questions about this work or the Capability Framework, please contact digitaldatacapabilityframework@digital.cabinet-office.gov.uk."
        }
    ]
}