{
    "url": "https://movingon.blog.gov.uk/2024/11/07/rha-and-dvsa-job-shadow-for-national-lorry-week/",
    "title": "RHA and DVSA job shadow for National Lorry Week",
    "authors": [
        "rufusduncan"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-07T11:14:42+00:00",
    "content": [
        {
            "text": "As part of DVSA’s vision to develop better partnerships with industry, we were really pleased to agree to set up some job shadowing opportunities with the Road Haulage Association (RHA) when they first approached us.   "
        },
        {
            "text": "RHA wanted the shadowing to be part of National Lorry Week, which is their annual campaign to champion the industry and lorry drivers. This year, the focus is on skills and training.  "
        },
        {
            "text": "Here at DVSA we know that we contribute to this theme too. Because we are working hard to bring people into the agency and train them to make sure lorries are safe when they are out on the roads.  "
        },
        {
            "text": "Developing a plan "
        },
        {
            "text": "That’s why we felt the RHA’s plan was a great idea. We could send three of our directors out separately with 6 RHA directors and 1 member, then host them at DVSA in return.  "
        },
        {
            "text": "As the RHA participants all have their own haulage firms, it meant that myself and DVSA’s senior leaders could see, with our own eyes, what haulage firms are experiencing day to day and how they manage compliance successfully.   "
        },
        {
            "text": "It also allowed us to open our doors to those haulage bosses, so they could see what we’re working on, and how we work to keep the roads safe using technology and the skills of our colleagues.  "
        },
        {
            "text": "Getting out and about "
        },
        {
            "text": "Most of the shadowing took place during October but we have other visits set up for November.  "
        },
        {
            "text": "Loveday Ryder, DVSA’s Chief Executive, hosted at DVSA’s site on the M25 near Leatherhead, with Tim Wray, Vice Chair of RHA, who is also Managing Director of Multi Modal Logistics.   "
        },
        {
            "text": "Tim was able to see how DVSA targets serial offenders to help keep Britain's roads safe. Tim then hosted Loveday in Felixstowe where she saw the pressures of a container port.  "
        },
        {
            "text": "I had the pleasure of being hosted in Glasgow by Claire Logan, who has recently completed three years as RHA’s Regional Chair for Scotland and Northern Ireland and is Long Lane Deliveries’ Operations Support Manager. Following that first visit, I invited Claire to one of our operational sites, in Bristol. "
        },
        {
            "text": "Richard Hennesey, DVSA’s Director of Services, is set to host Ross Edden, who is an RHA member and is Managing Director of TWE Haulage Ltd in Banbury.   "
        },
        {
            "text": "Adding real value "
        },
        {
            "text": "This was more than a just a presentational exercise.  "
        },
        {
            "text": "I know that we all found the shadowing really insightful and learnt things about the industry and testing and enforcement work respectively, which changed the way we see each other’s roles.  "
        },
        {
            "text": "Tim told us that he didn’t know so much technology is used when targeting non-compliant operators.  "
        },
        {
            "text": "And it was especially inspiring for me, as DVSA’s Director of Enforcement, to see how dedicated Long Lane Deliveries are to safety at every step of their operation.  "
        },
        {
            "text": "This opportunity links directly to the partnership principles set out in our Vision to 2030. It really proves that two perspectives are better than one and a diversity of views can enrich the decisions that we make. "
        }
    ]
}