{
    "url": "https://marinedevelopments.blog.gov.uk/2024/11/07/strategic-renewables-unit-powers-ahead/",
    "title": "Strategic Renewables Unit Powers Ahead!",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-11-07T09:20:09+00:00",
    "content": [
        {
            "text": "Successfully Tackling Underwater Noise"
        },
        {
            "text": "This summer, the SRU, alongside other MMO teams, regulators and industry developers, collaborated to manage noisy activities in the Southern North Sea Special Area of Conservation. By working together, all parties successfully kept noise levels below designated thresholds, which are set to protect noise-sensitive harbour porpoise. This was achieved through developer-led simultaneous operations calls and regulator-led development coordination forums, which due to their success, both will continue into 2025."
        },
        {
            "text": "Setting New Standards for Monitoring"
        },
        {
            "text": "The SRU is working with others to standardise the monitoring of offshore wind farms, aiming to make monitoring requirements clear and data more useable. Through a review of literature and post-consent monitoring data from the past 10 years, the SRU created a list of standardisation recommendations. The SRU organised a workshop hosted by The Crown Estate where the recommendations were presented and discussed with various government departments and Statutory Nature Conservation Bodies (SNCBs). The goal is to ensure future monitoring reports meet the recommended standards, enabling easier data sharing across projects and better access for stakeholders like SNCBs. The next steps will involve reassessing the standards based on workshop feedback, followed by discussions with contractors and developers to facilitate implementation."
        },
        {
            "text": "<12m Fishing Activity in the East"
        },
        {
            "text": "In 2023, the SRU commissioned an evidence report to map under-12m fishing activity in the east marine plan areas using a participatory mapping method. The full report is now available on the MMO evidence register (link). This project supports the SRU’s ongoing work on co-existence, contributes to the evidence base for the East Marine Plan replacement, and provides publicly available data for stakeholders to use in consultations. The report provides an indicative analysis of fishing activity as well as discussing sensitivities of different fishing gears to all phases of offshore wind development."
        },
        {
            "text": "For more information on any of our work, please contact us at SRU@marinemanagement.org.uk."
        }
    ]
}