{
    "url": "https://naturalengland.blog.gov.uk/2024/11/07/working-together-for-nature-collaborating-on-the-first-local-nature-recovery-strategy-in-england/",
    "title": "Working together for nature – collaborating on the first Local Nature Recovery Strategy in England ",
    "authors": [
        "Simon Stonehouse"
    ],
    "categories": [
        "Local Nature Recovery Strategy (LNRS)",
        "Natural England",
        "Nature Recovery",
        "Nature Recovery Network"
    ],
    "pub_date": "2024-11-07T08:50:43+00:00",
    "content": [
        {
            "text": "By Simon Stonehouse, Natural England Wessex Area Team"
        },
        {
            "text": "The Local Nature Recovery Strategy (LNRS) for the West of England has landed.  It’s the first of 48 that will cover the whole of England to be launched."
        },
        {
            "text": "This is a huge milestone.  For the first time Local Authorities, Government agencies and NGOs have worked together and with communities to identify where we should be focusing our efforts to restore nature and all the benefits that brings."
        },
        {
            "text": "WECA and all the partners and people involved deserve credit for their leadership and embracing ‘project LNRS’."
        },
        {
            "text": "Sophie Spencer, Senior Environment Manager at WECA, said:"
        },
        {
            "text": "Reaching this stage sets places up for a greater focus on delivery and giving all parts of society the opportunity to be part of nature’s recovery and the critical infrastructure it provides. There is more from Defra about the national LNRS ambitions."
        },
        {
            "text": "Here, I want to celebrate the power of collaboration; to thank those involved in launching this first Strategy and to encourage those who are approaching this milestone."
        },
        {
            "text": "Collaboration has become a staple ingredient for work in the nature sector. It is intentionally at the heart of LNRS policy, which puts nature planning in the hands of local stakeholders working together.  Collaboration is about partnership but, crucially, places emphasis on an end product.  Creating 48 LNRSs across England needs a bulk delivery collaboration. WECA put their order in early, backed up with resources."
        },
        {
            "text": "That included the smart move of borrowing Stuart Gardner from Bath and Northeast Somerset Council to drive forward the LNRS.  Setting the right tone for a collective and inclusive effort was key.  Stuart immediately understood that the LNRS would only be as good at the quality of engagement and conversation in preparing it, and that was reflected in the clear, tailored communications and the involvement of trusted voices."
        },
        {
            "text": "A guiding principle for LNRS is that to make a real difference we need to reach out well beyond the nature sector, hear many more voices and empower people across sectors and communities to take actions they feel part of.  In that spirit, WECA secured support from established organisations, including National Farmers Union and Country Land and Business Association, to bring in farmers and landholders they work with, and the Natural History Consortium and Bristol Green Capital Partnership for help on engaging communities and business."
        },
        {
            "text": "With new initiatives there will be some doubts or concerns.  Those were listened to and reflected in the overarching message that this needed to be a strategy that was ambitious but grounded in a consensus on what was possible."
        },
        {
            "text": "Much emphasis was placed on local partners and communities building a strategy that grasped the region’s needs and contributed to a national effort to recover nature.  A highlight of the LNRS process for me was seeing several ‘penny-drop’ moments where people understood how their aspirations could align with nature recovery."
        },
        {
            "text": "We’re lucky to have to have healthy habit and passion for local partnership working on nature, particularly through WENP.  Natural England, Environment Agency and Forestry Commission are active partners and I think that helps explain why we were among the trusted partners in LNRS.  I particularly valued the critical friend role that NE could play and the many conversations with WECA on everything from events for farmers and landowners to options for mapping nature opportunities in urban areas."
        },
        {
            "text": "I also hope I navigated a nimble path between representing views of a committed local partner and helping to tie the conversation into the national aspirations for nature recovery.  On that latter point WECA and Defra and its agencies have played their part in working pragmatically to align thinking.  Caitlin Coombs, who led the Forestry Commission’s engagement, reflected that:"
        },
        {
            "text": "Completing the LNRS is just the first phase of collaboration.  Meeting LNRS ambitions can only happen through co-operative action between farmers, NGOs, communities and business and I look forward to seeing that grow, up and down the country."
        }
    ]
}