{
    "url": "https://defrafarming.blog.gov.uk/2023/09/07/apply-now-for-a-calf-housing-grant/",
    "title": "Apply now for a calf housing grant",
    "authors": [
        "Gwyn Jones"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2023-09-07T10:01:05+01:00",
    "content": [
        {
            "text": "I’m pleased to say that you can now take the first step to apply for the Calf Housing for Health and Welfare grant. In this post, I will explain how. I’ve been closely involved in the co-design of this grant, so I will also share the journey we’ve been on to get to this point.  "
        },
        {
            "heading": 2,
            "text": "Grant background"
        },
        {
            "text": "Animal Health and Welfare Infrastructure grants are an opportunity for you, as a farmer, to receive co-funding for large infrastructure projects that help to continually improve the health and welfare of your animals."
        },
        {
            "text": "Grants of between £15,000 and £500,000 are available. "
        },
        {
            "text": "The first of these grants, the Calf Housing for Health and Welfare grant, is available for cattle keepers to co-fund new and upgraded calf housing that improves social contact (rearing calves in small groups) and the ambient environment."
        },
        {
            "text": "This includes adequate ventilation, protection from draughts, and suitable temperature and humidity. "
        },
        {
            "text": "Poor ventilation is an issue for many buildings. Modifying or replacing such a building will greatly increase the health and vigour of the calves reared in it. "
        },
        {
            "text": "This will improve the growth and performance of calves as they go into adult life - bringing a major benefit to your bottom line. "
        },
        {
            "text": "Healthy and thriving calves carry fewer costs — they require fewer vet visits and treatments. They perform better and are more valuable. "
        },
        {
            "text": "Better housing could result in fewer replacements on the farm (eliminating calf losses) and better growth and feed conversion on all calf units, beef and dairy. "
        },
        {
            "heading": 2,
            "text": "How to apply  "
        },
        {
            "text": "Before applying, please read the official guidance on GOV.UK. It explains the eligibility criteria for the grant and the information you will need to supply. "
        },
        {
            "text": "It also sets out the application process:"
        },
        {
            "text": "So, once you’ve read the guidance, use the online checker to determine whether you can apply for the grant. "
        },
        {
            "text": "You have until 30 November 2023 to do this. "
        },
        {
            "text": "The Rural Payments Agency (RPA) will assess all the applications. "
        },
        {
            "text": "If you’re successful, you will be invited to submit an ambient environment assessment.  "
        },
        {
            "text": "To make sure the infrastructure changes funded by the grant reflect the specific health and welfare needs of the calves on your farm, you are required to seek advice form your vet as part of the application process. "
        },
        {
            "text": "One way to get this advice is to apply for an Annual Health and Welfare Review. Available through the Pathway, the Review is a fully-funded visit by your choice of vet. It provides bespoke advice on health and welfare of your animals, as well as access to testing for endemic diseases and conditions "
        },
        {
            "heading": 2,
            "text": "Working together to design a grant that works for farmers  "
        },
        {
            "text": "A group of farmers, vets and those in the industry with expert knowledge in the design of calf housing worked together to design this grant. "
        },
        {
            "text": "Co-design ensured that farmers and their vets could share their expertise and recommendations. "
        },
        {
            "text": "Ensuring that calves grow and are fit and healthy is paramount for future prosperity of their farms.  "
        },
        {
            "text": "Dairy farmers also need to give their beef cross calves the best start in life so that they are sold at maximum value and provide purchasing beef farmers with a healthy and thriving calf.  "
        },
        {
            "text": "Beef farmers and calf-rearers buy and rear many calves from the dairy herd. They will also benefit from the co-funding on offer to either improve or replace existing calf rearing facilities. "
        },
        {
            "text": "It is well known that securing well-ventilated, draught-free housing which is warm enough in the winter and as cool as possible during hot weather is a major challenge.  "
        },
        {
            "text": "However, significant improvements can be made to existing buildings and of course designing and building a purpose-built new calf house offers huge scope in improving existing facilities on many farms. "
        },
        {
            "text": "I hope that you will consider applying.  "
        }
    ]
}