{
    "url": "https://greatbritishnuclear.blog.gov.uk/2023/09/07/delivering-the-ambition-by-changing-the-approach/",
    "title": "Delivering the ambition by changing the approach",
    "authors": [
        "Gwen Parry-Jones"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2023-09-07T16:50:22+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Powering Britain, from Britain, sustainably"
        },
        {
            "text": "As will be broadcast at Nuclear Week in Parliament that starts on 11 September 2023, nuclear power is a clear part of the answer to Britain's future energy needs. As well as being secure and sustainable, it is proven technology, always on, and has the potential to more than just power the grid. It's also energy dense - it produces a lot of energy for the space a site takes up."
        },
        {
            "heading": 2,
            "text": "Changing the approach"
        },
        {
            "text": "Great British Nuclear is going against what had become the nuclear orthodoxy in this country. We will be developing a close partnership with technology suppliers, potentially unlocking billions of pounds of private and public investment and helping to build UK manufacturing capacity and essential nuclear skills."
        },
        {
            "heading": 2,
            "text": "Starting with Small Modular Reactors"
        },
        {
            "text": "We have started our work with the technical selection process for Small Modular Reactors (SMRs). These can potentially be quicker to deploy and less expensive to build than traditional nuclear power plants because they are smaller, have factory based modular manufacturing, and more flexible deployment options."
        },
        {
            "text": "Aiming for a Final Investment Decision by the end of 2029 and power to the grid from the mid-2030s, the process has started already with market intelligence gathering, a vendor selection questionnaire and a planned initial down select in autumn 2023. After that will be detailed negotiations, aiming to make a final decision as soon as possible."
        },
        {
            "heading": 2,
            "text": "Support and partnership"
        },
        {
            "text": "Great British Nuclear will offer an unprecedented level of support; funding for technology development and site-specific design and establishing a comprehensive partnership with the successful bidder or bidders to drive projects forward."
        },
        {
            "text": "This support can include the development of the SMR technology as well as design, engineering, and supporting infrastructure, so we can deliver on our ambition for operational plants in the mid-2030s."
        },
        {
            "heading": 2,
            "text": "From Small Modular Reactors to full nuclear roadmap"
        },
        {
            "text": "The technical selection is looking at current SMR designs that can deliver quickly, but the government is looking well beyond this to how it and Great British Nuclear can support Advanced Modular Reactors (AMRs)."
        },
        {
            "text": "These could both power the grid and potentially help industrial decarbonisation and low-carbon heat. The government is also looking at a comprehensive civil nuclear roadmap by the end of 2023, covering large, Gigawatt scale reactors, the current technology SMRs in the ongoing technical selection programme, and future AMRs."
        },
        {
            "heading": 2,
            "text": "Ambition made real by delivery"
        },
        {
            "text": "Great British Nuclear has been set up to turn this nuclear ambition into reality. It will do this through effective and fast delivery and is underway with the SMR selection process."
        },
        {
            "text": "We have the nuclear expertise, and our Executive Committee members have over 100 years of nuclear experience in this country and abroad between them."
        },
        {
            "text": "We can unlock billions of pounds of private and public investment, right through from design to operation. We can help to get sites ready for development, and work to grow manufacturing capacity and skills capability."
        },
        {
            "text": "You can register for email updates from Great British Nuclear."
        }
    ]
}