{
    "url": "https://dluhcdigital.blog.gov.uk/2023/09/07/future-councils-gathering-feedback-from-the-sector/",
    "title": "Future Councils: We’re gathering feedback from the sector",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Future Councils",
        "Local Digital"
    ],
    "pub_date": "2023-09-07T11:12:12+01:00",
    "content": [
        {
            "text": "Since May 2023, we have been working closely with 8 diverse councils through the pilot of our new programme, Future Councils. "
        },
        {
            "text": "Future Councils aims to understand the recurring barriers faced by councils. We want to understand the experiences of each of the pilot councils and address common blockers when trying to make their organisations more modern and resilient."
        },
        {
            "text": "In this blog post, we want to outline the challenges we’ve identified with the cohort and invite you to share your feedback and experiences. "
        },
        {
            "text": "You can read more about the pilot councils and how we chose them in a blog post published earlier this year, or learn more about our ambitions for Future Councils in this interview with Emily Sullivan, Local Digital's Head of Product, published by UKAuthority."
        },
        {
            "heading": 2,
            "text": "Setting the scene"
        },
        {
            "text": "Risk is needed to make changes and innovate. However, it can be difficult to take risks when economic conditions are tough, the technology landscape is fast-evolving, and citizen needs are ever-changing."
        },
        {
            "text": "The risk of innovation can come with a high cost, not only financially but operationally and/or reputationally. For example, buying or building a new technology solution could support a council to move away from a legacy supplier, however there is a risk of finding it doesn’t work or cannot be effectively implemented."
        },
        {
            "heading": 2,
            "text": "Identifying key challenges"
        },
        {
            "text": "Through the Future Councils pilot, we have summarised the impact of this on councils as a set of challenges. Each of these challenges will need to be overcome in order for a council to become modern and resilient. "
        },
        {
            "text": "The challenges we’ve identified include: "
        },
        {
            "text": "We are working through these challenges by conducting experiments and co-creating case studies with the pilot cohort, to test internally and with the wider sector."
        },
        {
            "heading": 2,
            "text": "Turning the challenges into problem statements"
        },
        {
            "text": "Together with the pilot councils, we have developed the summarised challenges into a series of problem statements. The problem statements give a short, clear explanation of a challenge, summing up what the council wants to change."
        },
        {
            "text": "The next step is to gather feedback on these problem statements from councils beyond the pilot cohort and the wider sector. This will help us to validate the problem statements and identify scalable opportunities to help the sector as a whole."
        },
        {
            "text": "You can read the full problem statements on our website."
        },
        {
            "heading": 2,
            "text": "How to share your feedback"
        },
        {
            "heading": 3,
            "text": "1. Join our Future Councils Roundtable series"
        },
        {
            "text": "This Autumn, we’re inviting councils to join our Future Councils Roundtable series. At four in-person events, we’ll share more of what we’ve learnt through the pilot, and talk through the problem statements in detail. We will then invite councils to share their experience, including whether they face similar challenges, and discuss potential solutions"
        },
        {
            "text": "Find out more and register for one of our Future Councils Roundtable events:"
        },
        {
            "text": "The Roundtable events are open to anyone working in digital and cyber roles in councils, as well as council senior or strategic leaders (CEOs, Directors, Heads of Service, and other senior leaders)."
        },
        {
            "heading": 3,
            "text": "2. Share your feedback online"
        },
        {
            "text": "If you are part of the wider sector, or cannot attend one of our events, you can share your feedback on the problem statements via the forms on our website. "
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "Later in the Autumn, we will share what we’ve heard, as well as how we are using this work to inform what comes next for Future Councils. "
        },
        {
            "text": "To stay up-to-date with the progress of the Future Council programme and future opportunities, follow us on our usual channels: "
        }
    ]
}