{
    "url": "https://greatbritishnuclear.blog.gov.uk/2023/09/07/great-british-nuclear-calls-for-nuclear-talent/",
    "title": "Great British Nuclear calls for nuclear talent",
    "authors": [
        "Chantelle Brown"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2023-09-07T17:15:32+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Great British Nuclear - the start-up has started"
        },
        {
            "text": "A few months after it was set up, Great British Nuclear (GBN) is in start-up mode. It has been busy getting the technology selection process for Small Modular Reactors (SMRs) underway, after an initial market engagement in May 2023, and a vendor selection process which began in July 2023. We are currently on track for an initial down select in autumn 2023, and aiming for a Final Investment Decision by the end of 2029. We are also assisting in the government's consultation plans for autumn 2023, and the development of a Nuclear Power Roadmap to help us to best target GBN's actions over the coming months and years."
        },
        {
            "heading": 2,
            "text": "Setting up the GBN organisation"
        },
        {
            "text": "Beyond this, we are moving at pace to set GBN up as an arm's length body. This includes finalising our processes and structures, and we have appointed technical, legal, and financial advisors for the current activities. Our Interim Board and Executive roles are already in place, supported by a small team made up of experts from across the nuclear industry and government. We will recruit all the permanent roles in due course through a competitive process to enable us to help to deliver the government's policy ambitions."
        },
        {
            "heading": 2,
            "text": "We need your help to take us further"
        },
        {
            "text": "We've been grateful for the ongoing support for GBN from our industry colleagues -- this has been hugely welcome and helpful! But, we now need more help as we move forward."
        },
        {
            "text": "That's why we recently wrote to CEOs of many of the companies and organisations in the nuclear industry, asking if they could consider supporting GBN in the short term by seconding some of their talented professionals into our organisation. We are looking to temporarily fill several very senior and influential interim roles, as well as many other roles to support workstream delivery. Ideally this would be a 6-month flexibly located secondment with the possibility of a 6-month extension."
        },
        {
            "heading": 2,
            "text": "Not for everyone - but a real benefit for those who can"
        },
        {
            "text": "This kind of secondment won't be possible for all, and we fully understand the potential burden as well as the potential benefit that seconding people could represent. We very much hope that the companies we have written to see this as support to the UK national endeavour, as well as great opportunities for their people, giving them a breadth of view and experience that they can bring back to their substantive roles."
        },
        {
            "text": "So, if the possibility of a secondment interests you; and you work in a current nuclear organisation or one that supports the nuclear industry closely, then please contact your HR team to see if such a secondment might work all round and benefit all."
        },
        {
            "heading": 2,
            "text": "Avoiding conflicts of interest"
        },
        {
            "text": "Finally, one important caveat. I am sure you will understand that we need to ensure that any organisation which is either bidding into the current SMR technology selection process (or is a key subcontractor to any organisation that is bidding) is not conflicted. Due to the nature of this SMR campaign, we will not be able to offer a position to anyone currently bidding for work or directly working with any bidders."
        },
        {
            "heading": 2,
            "text": "An opportunity to be part of the excitement"
        },
        {
            "text": "This is a hugely exciting time for our industry, and an opportunity to demonstrate the inter-generational and wide-ranging benefits that nuclear power can bring. So, if a secondment might work for you -- and if it might also work for your organisation as part of your career development and their broadening of their experience base -- then please contact your HR team."
        },
        {
            "text": "I do hope that you can consider supporting us."
        },
        {
            "text": "You can register for email updates from Great British Nuclear."
        }
    ]
}