{
    "url": "https://educationhub.blog.gov.uk/2023/09/how-were-safeguarding-students-and-learners-from-radicalisation/",
    "title": "How we’re safeguarding students and learners from radicalisation  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-09-07T17:08:43+01:00",
    "content": [
        {
            "text": "Education settings play an important role in keeping young people safe from different forms of harm, including from substance abuse, gangs, neglect and sexual exploitation. "
        },
        {
            "text": "All schools and registered childcare providers are required to help prevent the risk of people supporting terrorism or become terrorists. This is known as the Prevent duty.  "
        },
        {
            "text": "The Prevent duty requires specified authorities such as education, health, local authorities, police and criminal justice agencies, such as prisons and probation, to help prevent the risk of people supporting terrorism or becoming terrorists. It is a key part of the Government’s counter-terrorism strategy.   "
        },
        {
            "text": "The education sector plays a vital role in safeguarding students from radicalisation and intervening early to divert them away from extremist influences.  "
        },
        {
            "text": "It’s important to remember that a Prevent referral is not an accusation of criminality and shouldn’t affect someone's education or career prospects. Instead, it helps those around them to work together to ensure they have access to specialist support to keep them and others safe. "
        },
        {
            "text": "Last year, the education sector contributed the highest number of referrals to Prevent - across all sectors where the duty applies - to raise concerns about someone being radicalised. "
        },
        {
            "text": "The Prevent duty guidance has recently been updated. Here we explain everything you need to know.  "
        },
        {
            "heading": 3,
            "text": "Why has the Prevent duty guidance been updated?  "
        },
        {
            "text": "The updated guidance covers a wide range of sectors, not just education settings, and there are no new legal requirements or additional responsibilities for those in the education sector.  "
        },
        {
            "text": "It provides greater consistency, clarity and access to good practice throughout. The guidance will come into effect no earlier than 31 December 2023. "
        },
        {
            "text": "The Prevent guidance helps those who have a statutory obligation, including education settings to take action to help stop individuals being radicalised and turning to terrorism, to understand how they can comply with their duty.  "
        },
        {
            "text": "It explains the policies and training providers should have in place and how to create an environment where ideologies which are used to radicalise people are challenged and not permitted to flourish. "
        },
        {
            "text": "The guidance has been updated after an independent review found there were some areas where we could strengthen the programme and we've worked closely with those sectors impacted, including education, to improve them.  "
        },
        {
            "heading": 3,
            "text": "What support is available for education settings?  "
        },
        {
            "text": "Education settings looking for more information on what the changes to the guidance mean for them can find them here:  "
        }
    ]
}