{
    "url": "https://homeofficemedia.blog.gov.uk/2023/09/07/independent-review-of-prevent-factsheet/",
    "title": "Independent Review of Prevent Factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-09-07T16:25:44+01:00",
    "content": [
        {
            "text": "What is the Independent Review of Prevent?"
        },
        {
            "text": "During the passage of the Counter Terrorism and Border Security Act 2019 on 12 February 2019, the government committed to carrying out an independent review of Prevent."
        },
        {
            "text": "William Shawcross was appointed as the Independent Reviewer of Prevent on 26 January 2021."
        },
        {
            "text": "The Independent Review of Prevent and HM Government’s response was published on Wednesday 8 February 2023."
        },
        {
            "text": "What changes are being made to Prevent following the Independent Review of Prevent?"
        },
        {
            "text": "The Independent Review of Prevent paves the way for a stronger, more transparent, and proportionate approach to stopping people from being radicalised into becoming terrorists or supporting terrorism."
        },
        {
            "text": "To address the disparate terrorist threat, Prevent will move from a local model of delivery to a regional one, driving up Prevent delivery standards nationwide through increased join up between the police and regional partners."
        },
        {
            "text": "Prevent duty guidance will be updated to ensure a consistent referral process across national and local delivery, and those sectors under the duty. Further work is already underway to consider extending the Prevent duty, to broaden the touch points in place for frontline professionals to identify and refer relevant concerns to Prevent."
        },
        {
            "text": "All local authorities in England and Wales will have access to expert Prevent support from the Home Office, enabling resource to be surged into areas to meet radicalisation risks."
        },
        {
            "text": "Prevent will work closely with DLUHC and the Commission for Countering Extremism to develop new training to ensure better understanding of ideology across Prevent teams. It will also review its wider training to ensure it aligns with the findings of the Independent Review."
        },
        {
            "text": "These improvements will ensure Prevent fully aligns with the threats we face and the ideologies underpinning them."
        },
        {
            "text": "When will the government implement the Independent Reviewer’s recommendations? "
        },
        {
            "text": "We intend to implement the majority of these recommendations by February 2024. To ensure transparency, the Home Office will report on implementation of the recommendations a year on from publication."
        },
        {
            "text": "What changes have already been delivered?"
        },
        {
            "text": "Since the publication of the Independent Review of Prevent in February 2023 we have:"
        },
        {
            "text": "Prevent’s delivery model has been adapted from a national to regional delivery model which ensures support for all local authorities across England and Wales. The top twenty areas with the highest threat and risk ratings will also receive multi-year funding, allowing ongoing stability in combatting local radicalisation risks."
        },
        {
            "text": "Ministerial Prevent Oversight Board to provide scrutiny and independent oversight for the programme will begin convening in October. Chaired by the Security Minister and it will oversee implementation of Independent Review of Prevent recommendations and the Prevent Standards and Compliance Unit."
        },
        {
            "text": "Strengthened due diligence checks on Civil Society Organisations to ensure targeted funding goes to those best equipped to disrupt terrorist ideology and so that we do not, under any circumstances, work with or fund those who legitimise extremists."
        },
        {
            "text": "Specialist Intervention Providers have also been recruited to better address the Reviewer’s concerns about the prevalence of antisemitism in Channel cases."
        }
    ]
}