{
    "url": "https://homeofficemedia.blog.gov.uk/2023/09/07/prevent-duty-guidance-factsheet/",
    "title": "Prevent duty guidance factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-09-07T16:21:40+01:00",
    "content": [
        {
            "text": "What is the Prevent duty?"
        },
        {
            "text": "The Prevent duty was established by the Counter-Terrorism and Security Act 2015 and places a duty on specified authorities such as education, health, local authorities, police and criminal justice agencies (prisons and probation) to have ‘due regard to the need to prevent people from becoming terrorists or supporting terrorism."
        },
        {
            "text": "What is the Prevent duty guidance?"
        },
        {
            "text": "The Prevent duty guidance assists statutory partners across education, health, local authorities, police and criminal justice agencies (prisons and probation) to understand how to comply with the Prevent duty."
        },
        {
            "text": "Why is it being updated?"
        },
        {
            "text": "We have refreshed and updated the Prevent duty guidance to reflect several recommendations of the Independent Review of Prevent published in February 2023. This will ensure that Prevent is well-equipped to counter the threats that we face and the ideologies underpinning them."
        },
        {
            "text": "When will the new Prevent duty guidance come into force?"
        },
        {
            "text": "We have laid the required statutory instrument to update the Prevent duty guidance. The updated guidance will come into force on 31 December 2023, subject to the necessary Parliamentary processes. We are working with statutory partners so that those with Prevent responsibilities understand what they need to do by the time the new guidance becomes statutory."
        },
        {
            "text": "What are the key changes in the new guidance? "
        },
        {
            "text": "Key changes to the statutory guidance include:"
        },
        {
            "text": "What other support is available to Prevent duty sectors?"
        },
        {
            "text": "The Home Office offers free GOV.UK Prevent duty training to support those under the duty. Other support, including face-to-face training on ideology, is being piloted and fully rolled out by spring 2024. We expect all frontline staff working for specified authorities to have reasonable and appropriate understanding of extremist and terrorist ideologies, and training is being provided on this."
        },
        {
            "text": "The Prevent duty toolkit for local authorities supports the delivery of the Prevent Duty by local authorities in England and Wales by providing practical information and suggestions for local authorities in undertaking to prevent people from becoming a terrorist or supporting terrorism."
        },
        {
            "text": "For sector specific support in schools and FE please go to Educate Against Hate. Further support for designated safeguarding leads on assessing risk and making Prevent referrals is available on GOV.UK"
        },
        {
            "text": "In higher education you can access training and guidance on GOV.UK and further information is available from the OfS."
        },
        {
            "text": "The DfE Regional Prevent Coordinators run regional networks for Further and Higher Educations leads. They also share information via regional newsletters."
        },
        {
            "text": "The GOV.UK Prevent duty training is available to all healthcare professionals, and details of intercollegiate guidance documents are included in the PDG. In addition, the Royal College of GPs (RCGP) and the Royal College of Psychiatrists (RCPsych) have their own specific training for healthcare professionals within their respective sectors."
        },
        {
            "text": "Delivery of Prevent will vary within each service, institution, or body. For example, some specified authorities may use dedicated Prevent roles, whereas others may deliver Prevent through wider safeguarding duties."
        }
    ]
}