{
    "url": "https://nda.blog.gov.uk/technology-and-innovation-is-shaping-delivery-of-the-nda-mission/",
    "title": "Technology and innovation shaping delivery of the NDA mission",
    "authors": [
        "traceyscott"
    ],
    "categories": [
        "Innovation/savings"
    ],
    "pub_date": "2023-09-07T10:03:05+01:00",
    "content": [
        {
            "text": "Professor Melanie Brownridge is the Nuclear Decommissioning Authority (NDA) Technology and Innovation Director. She studied chemistry to PhD level in the UK and Germany and some of her other achievements include being a visiting professor at University of Leeds, international advisor to IRID (International Institute for Decommissioning in Japan), and a non-executive director on the Board for Nuclear Waste Services. Melanie is also a Member of the UKAEA Programme Advisory Committee and the UK Fusion Technical Advisory Group. In 2020, she was named by Women in Nuclear as ‘Champion of the Year’."
        },
        {
            "text": "The NDA is responsible for decommissioning the UK’s oldest nuclear sites, a significant challenge given we are dealing with some of the most complex and hazardous environments in the world, that require the development of first of a kind engineering and design solutions."
        },
        {
            "text": "It’s for this reason we invest around £100 million each year in research and development – ensuring we can better understand the challenges we face and push the boundaries to explore emerging innovations to deliver sustainable decommissioning more effectively, efficiently, and for less cost to the taxpayer."
        },
        {
            "text": "By utilising technology and innovation, we can create a safer working environment for our employees, return our sites to communities for reuse earlier, support highly skilled jobs, and leave a more sustainable legacy for generations to come."
        },
        {
            "text": "For example, across our sites we are deploying robots in some of our most hazardous environments to monitor radioactivity and retrieve waste - keeping our people safe, saving time and money, and providing the opportunity to reskill our operators to deploy cutting edge techniques and equipment."
        },
        {
            "text": "These are solutions we are developing collaboratively, harnessing knowledge and expertise from across the nuclear industry, our supply chain, academia and other diverse sectors."
        },
        {
            "text": "One of these robots, Lyra, was developed by Dounreay in partnership with researchers at the University of Manchester – it is accelerating the pace of decommissioning and could save us as much as £500 million over 100 deployments – a collaboration recognised by Time magazine as one of the top 200 innovations of 2022."
        },
        {
            "text": "Over the last year we have also expanded our collaboration with the defence sector, leveraging value for money through co-funding competitions to develop technologies, such as advanced robotics, AI and machine learning, drones and remote sensing technologies, which can be deployed in environments unsafe for humans."
        },
        {
            "text": "Internationally, we’re leveraging our expertise, providing export opportunities for UK companies and developing the global experts of the future through our £12 million a world leading alliance with Japan on project LongOps, developing new automation and robotic capabilities with global potential, applicable to both cutting edge fusion research and decommissioning."
        },
        {
            "text": "We are also using innovation to support the government in achieving its energy security goals. Our transport division, Nuclear Transport Solutions received £1 million of government funding to utilise their expertise to design a new transport package for fuel that will be used to support a new generation of nuclear reactors."
        },
        {
            "text": "And finally, we are also investing in the pioneers of the future, sponsoring more than 50 PhD students and three post-doctoral researchers. These partnerships unlock the future talent required to develop the next generation of the nuclear decommissioning workforce and a pipeline of expertise that is being deployed throughout the nuclear industry."
        },
        {
            "text": "We create an environment where innovation can thrive by harnessing diversity of thinking, taking a people-centric approach and creating a culture which recognises the importance of creativity, including making it a key part of our leadership standard."
        },
        {
            "text": "To find out more about our approach to technology and innovation, view our NDA Innovation strategy - GOV.UK (www.gov.uk) here."
        },
        {
            "text": "You can also find out more about our work and how we deliver our research and development strategy here: Nuclear decommissioning: research and development brochures - GOV.UK (www.gov.uk)"
        }
    ]
}