{
    "url": "https://greatbritishnuclear.blog.gov.uk/2023/09/07/we-all-need-to-take-part-to-tackle-the-nuclear-skills-challenge/",
    "title": "We all need to take part to tackle the nuclear skills challenge",
    "authors": [
        "Simon Bowen"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2023-09-07T17:05:05+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Why has the Nuclear Skills Task Force been set up?"
        },
        {
            "text": "If you put two nuclear industry executives in a room, sooner or later they will talk about skills. Or more precisely, the lack of skills to meet the coming nuclear challenge."
        },
        {
            "text": "And this lack of skills is something the government has recognised too, and this was clear to all of us who attended the Skills Conference in late May 2023, where the government announced it was setting up the Nuclear Skills Task Force. I'm both privileged and excited to have been asked to join this task force, because its output will be central to the success of Britain's new nuclear programme and Great British Nuclear."
        },
        {
            "text": "It's already clear that a critical enabler to our skills success, and with it our nuclear success as a country, will be a shift in the way that we attract and retain talent within the sector overall. This isn't something one or two organisations can do; it's a mindset change for us all."
        },
        {
            "heading": 2,
            "text": "What is the aim of Destination Nuclear?"
        },
        {
            "text": "It is fitting that the Nuclear Institute Young Generation Network (NI YGN) team are, as always, ahead of the game. Not only have they recognised the issue, but they have decided to do something about it by setting up Destination Nuclear in collaboration with Next Gen NIC, the Nuclear Skills Strategy Group (NSSG), and Women in Nuclear (WiN)."
        },
        {
            "text": "The Destination Nuclear programme is a sector wide campaign to attract and retain talent.  Its first stage is focused on attracting experienced people to switch to nuclear from other industries, boosting the size of the experienced workforce we can recruit from quickly."
        },
        {
            "text": "The campaign is proceeding at pace but is constrained by the level of funding so far committed by us, the companies and organisations that make up our sector. That amounted to an initial £275,000 committed by the Nuclear Decommissioning Authority (NDA), EDF Energy, Cavendish, the National Nuclear Laboratory (NNL), Defence Nuclear Enterprise (DNE) and Atomic Weapons Establishment (AWE)."
        },
        {
            "text": "Since then, additional funds have been contributed by Jacobs, Rolls Royce, and Assystem. This now brings the total amount of committed funding to around £400,000."
        },
        {
            "text": "These contributions are a clear sign that these industry-leading organisations recognise that without a campaign like this, they will not be able to attract and retain the people they need."
        },
        {
            "heading": 2,
            "text": "Time to think bigger"
        },
        {
            "text": "I strongly agree with NI YGN and this campaign, but I want us to think bigger. Last month, I wrote to a number of industry CEOs to ask that together we turn this from a few industry-leading organisations into a wider, united nuclear sector campaign supported by us all. After all, we all will benefit -- so why not all contribute?"
        },
        {
            "text": "A total of £400,000 has been contributed so far, but to do Destination Nuclear justice it needs at least double that if it is to achieve the level of ambition that we all need it to have."
        },
        {
            "text": "In late August 2023, the creative agency that Destination Nuclear has retained shared their proposals and creative approach for the first stage of the campaign. The high-level messaging and a supporting video were shared at Nuclear Week in Parliament this week (11 - 14 September 2023), showcasing Destination Nuclear, as well as the names of the contributing organisations."
        },
        {
            "heading": 2,
            "text": "How you can support Destination Nuclear"
        },
        {
            "text": "The intention of this campaign is to be a true sector wide collaboration. Together we can make that happen, but only if we do all act together. And the benefits to us each from taking part will be that people who respond to the campaign will be signposted to the organisations who contribute to the campaign."
        },
        {
            "text": "If you want to support Destination Nuclear, get in touch with us to find out more."
        },
        {
            "text": "I'm hugely grateful to the nine organisations who have supported it so far - NDA, EDF, Cavendish, NNL, DNE, AWE, Jacobs, Rolls Royce, and Assystem - but for all our sakes, let's hope we can add your organisation's name to this list too."
        }
    ]
}