{
    "url": "https://sustainableict.blog.gov.uk/2024/08/15/a-warm-welcome-to-our-new-members-and-a-new-vision-for-gdsa/",
    "title": "A warm welcome to our new members and a new vision for GDSA",
    "authors": [
        "Sarah Gartland"
    ],
    "categories": [
        "GDSA",
        "Sustainable ICT"
    ],
    "pub_date": "2024-08-15T08:58:17+01:00",
    "content": [
        {
            "text": "Sarah Gartland welcomes a new cohort of members to the Government Digital Sustainability Alliance (GDSA) family, and shares the new vision. "
        },
        {
            "text": "Following the fantastic summit that we hosted in March, we are delighted to welcome several new members to the GDSA."
        },
        {
            "text": "Things have been busy since the summit. We have continued to develop the aims of our three working groups – focusing on Scope 3 emissions, Circular Economy and Planetary impact - and we’ve been assuring and onboarding new members."
        },
        {
            "text": "I am sure also it didn’t escape your notice that we’ve had a General Election, following which a new Government is now in place."
        },
        {
            "text": "Our new Secretary of State, Steve Reed, has set out five new Defra Priorities, which means we can also now share details of the fantastic new members along with the direction of travel for the GDSA for the remainder of 2024/25, built around a new vision to ‘Foster a culture of transparency and collaboration, raise awareness on the circular economy and scope 3 emissions in Information and Communications Technology (ICT), and develop an education program and assessment method to enable the Government to calculate the planetary impact of ICT services’."
        },
        {
            "text": "- Chris Howes, Chief Digital and Information Officer for Defra, and Senior Responsible Owner for Government Digital Sustainability, had the following message for members, existing and new"
        },
        {
            "text": "“Our future very much depends on us all being more adaptable and sustainable. We need technological solutions to help us face global issues like climate change, this places a greater demand on tech, so it’s important that what we deploy is as sustainable as possible. By acting as one, and leaving our badges at the door, we will work collectively as a force for good, sharing best practice and pooling resources. We are excited to welcome a breath of new experience to the GDSA, I am sure that the additional support will enable us to be brilliant (in Toby Strong's words) and meet our refreshed goals, whilst supporting the Secretary of State deliver his five key priorities, which include a circular economy, decarbonisation and nature recovery, which I know our GDSA working groups are all committed to. "
        },
        {
            "text": "To our new GDSA members – I am confident that your fresh perspective and varied backgrounds will bring value to GDSA as we take it from strength to strength. I encourage you to dive right in and support where you can. Welcome aboard!”"
        },
        {
            "heading": 2,
            "text": "All aboard - meet our new GDSA family"
        },
        {
            "text": "Our original members; Atos, BT, CapGemini, CGI, Dell, DXC, Eviden, HPE, IBM, Kainos, Microsoft, N2S, ServiceNow, Vodafone and Xerox are delighted to be joined by;"
        },
        {
            "text": "This new and diverse cohort of members strengthens the breadth of experience within the GDSA community, and we are all excited to see where this takes us next."
        },
        {
            "heading": 2,
            "text": "Looking ahead – our 2024/25 vision"
        },
        {
            "text": "Talking of which, what does that look like? For the rest of the year, we want to focus on continuing to meet our new vision."
        },
        {
            "text": "Each working group is working on a set of refreshed goals which they will set out to achieve during the course of 2024/25, with support from GDSA colleagues, and wider via the Cross Government Digital Sustainability Steering Group."
        },
        {
            "text": "The objectives are linked to the net zero strategy, align with the aims of the Greening Government Commitments (GGCs) for Digital Sustainability and the secretary of states new priorities; namely creating a road map to move Britain to a zero waste economy. The working groups also incorporated lessons learned from their 23/24 activities into their new objectives."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "The UK Government Digital Sustainability Alliance (GDSA) brings together the Government and its supply chain to drive digital and ICT sustainability. The GDSA chair is Chris Howes, Defra’s Chief Digital and Information Officer (CDIO) and the UK Government’s Senior Responsible Owner for Sustainable ICT. The GDSA is a collaborative group made up of existing or prospective digital and data suppliers to the UK Government, all with expertise and passion in digital sustainability."
        },
        {
            "text": "If you’re interested in finding out more about what we do, please get in touch."
        }
    ]
}