{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/15/another-leap-for-workers-rights-reforms-ministers-host-first-meeting-with-business-leaders-and-unions/",
    "title": "Another leap for workers’ rights reforms: ministers host first meeting with business leaders and unions",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2024-08-15T15:18:55+01:00",
    "content": [
        {
            "text": "The government’s plans to strengthen the rights of working people took another major leap yesterday, as Deputy PM Angela Rayner and Business Secretary Jonathan Reynolds hosted trade unions and business organisations for the first time to progress their mission to Make Work Pay. This marked the beginning of “a new era of partnership” to “wipe the slate clean” and give businesses and workers a bigger voice at the table."
        },
        {
            "text": "The news of the “landmark” meeting was covered by PA Media, with its copy featuring in the Independent and Mail Online, and widely across regional and local media (online and print) including the Evening Standard, Kent Online, Irvine Times, Leigh Journal, Surrey Comet, Irish News, South Wales Argus, Bury Mercury and Ayr Advertiser."
        },
        {
            "text": "The stories highlighted the government’s proposed Employment Rights Bill – the top item on the agenda – which is being introduced within the new administration’s first 100 days in office. The bill will bring about a suite of improvements to workers’ rights, such as banning exploitative zero hours contracts, ending fire and rehire tactics and introducing basic rights from day one of employment like parental leave and protection against unfair dismissal."
        },
        {
            "text": "The BBC online reported the largely welcoming reactions from unions after discussing the proposals with government, including the TUC whose general secretary Paul Nowak spoke of the bill’s potential to set the country’s economy “on a path towards higher growth and better living standards”. The Times (p1 & 2) and Daily Mail (p6) also prominently featured balanced stories on the comments of other business groups and trade unions, who expressed their industries’ needs in the proposed reforms."
        },
        {
            "text": "Speaking on the event, Deputy Prime Minister Angela Rayner said:"
        },
        {
            "text": "“Our plan to Make Work Pay will bring together workers and businesses, both big and small and across different industries, for the good of the economy."
        },
        {
            "text": "“This first-of-its-kind meeting has kicked off a new era of partnership that will bring benefits to everyone across the country striving to build a better life.”"
        },
        {
            "text": "See the full press release here."
        }
    ]
}