{
    "url": "https://nationalscreening.blog.gov.uk/2024/08/15/england-achieves-who-certification-for-eliminating-mother-to-child-transmission-of-hepatitis-b/",
    "title": "England achieves WHO certification for eliminating mother-to-child transmission of hepatitis B",
    "authors": [
        "Tsitsi Muchayingeyi"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-08-15T09:04:34+01:00",
    "content": [
        {
            "text": "Routine antenatal screening and neonatal immunisation have effectively eliminated the transmission of hepatitis B from mothers to children in England."
        },
        {
            "text": "The achievement of the World Health Organisation (WHO) elimination targets for hepatitis B mother to child transmission is detailed in a UK Health Security Agency (UKHSA) report and is to be celebrated."
        },
        {
            "text": "Many healthcare practitioners, including midwives, health visitors, hepatologists, laboratory services, clinical scientists, epidemiologists and immunisation nurses, play critical roles in the end-to-end screening and immunisation pathways. Their commitment to providing high quality care and services to women and their babies at a time when the NHS is facing significant workforce challenges is commendable."
        },
        {
            "text": "Hepatitis B is a virus that is mostly spread through blood. When a hepatitis B infection lasts for more than 6 months it is called chronic hepatitis B. Millions of people worldwide live with chronic hepatitis B. The virus can lead to liver damage, liver cancers and even death. Other outcomes associated with hepatitis B include the need for liver transplants."
        },
        {
            "text": "Adults are much less likely than children or babies to get a chronic infection. This is because adults usually have a fully developed immune system which is better at fighting off the virus.  Pregnant women who have hepatitis B can pass the infection to their baby during birth. This is known as vertical transmission or perinatal transmission."
        },
        {
            "text": "In England, the NHS Infectious Diseases in Pregnancy Screening (IDPS) programme offers and recommends screening to all pregnant women, for hepatitis B (as well as HIV and syphilis) to reduce the risk of vertical transmission and the chance of babies developing the infection. Scotland, Northern Ireland and Wales also offer screening for hepatitis B, HIV and syphilis to all pregnant women. Women who screen positive for hepatitis B are cared for by a specialist multidisciplinary team and antiviral therapy is recommended."
        },
        {
            "text": "Babies born to women who test positive are offered timely hepatitis B vaccination, and hepatitis B immunoglobulin (HBIG) if appropriate, within 24 hours of birth to prevent them developing chronic hepatitis B. This is given as part of a selective neonatal immunisation programme with vaccines at birth, 4 weeks and 12 months. This is in addition to the vaccines at 8, 12 and 16 weeks that are part of the universal immunisation programme introduced in the UK in 2017."
        },
        {
            "text": "Antenatal hepatitis B screening coverage in the year 1 April 2021 to 31 March 2022 remained above 99%, which is above the 2023 WHO target of 90% and the IDPS standard’s achievable threshold of 99%. Coverage for timely hepatitis birth dose vaccination is over 98%, also above the WHO target of 90% and the IDPS standard’s acceptable threshold of 97%, while coverage for timely HBIG is over 96%."
        },
        {
            "text": "Babies born to mothers with hepatitis B infection have testing at 12 months of age to confirm vertical transmission has not occurred and to facilitate prompt referral for further management if it has. Data shows the estimated transmission rate in England has been falling since 2014, when it was 0.95%, to an estimated rate of 0.07% in 2021 to 2022. This is below the WHO target of 2% and is a  key milestone in the WHO strategy for the overall elimination of viral hepatitis as a public health threat by 2030."
        },
        {
            "text": "This success has been achieved thanks to the 3-pronged approach of antenatal screening, selective neonatal immunisation and routine childhood immunisation."
        },
        {
            "text": "It is also a good demonstration that nationally managed screening is not just about testing, but an end to-end pathway that involves many different health professionals and services, often across different settings. No test on its own helps people."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}