{
    "url": "https://mhclgdigital.blog.gov.uk/2024/08/15/from-homes-for-ukraine-to-community-building-my-journey-as-a-business-analyst-fast-streamer/",
    "title": "From Homes for Ukraine to community building: my journey as a business analyst Fast Streamer",
    "authors": [
        "Luke Radford, Business Analyst"
    ],
    "categories": [
        "Careers",
        "Communities of practice"
    ],
    "pub_date": "2024-08-15T10:32:12+01:00",
    "content": [
        {
            "text": "I’m Luke and I’m a business analyst in my first year of the ‘Digital, Data Technology and Cyber’ Fast Stream in MHCLG Digital. I may be new to the Fast Stream, but I have been a civil servant for a long time. Before I joined MHCLG, I spent 15 years working for the Department for Work and Pensions – I was even the telephone voice of Universal Credit for a few years!    "
        },
        {
            "text": "Since joining MHCLG, I have been fortunate to work on the high-profile Homes for Ukraine Sponsorship Scheme as well as being involved in developing a thriving community of practice for business analysts and performance analysts in the department.  "
        },
        {
            "heading": 2,
            "text": "Building a business analysis and performance analysis community of practice in MHCLG "
        },
        {
            "text": "Working on the Homes for Ukraine Sponsorship Scheme enabled me to learn new things, which I was able to then share with MHCLG’s business analysis and performance analysis community of practice, which I’m part of.  "
        },
        {
            "text": "The community is small but perfectly formed, and at the time of writing this, there are around 16 of us (but it has been growing steadily of late). My involvement in it has been a significant focus for me since I joined MHCLG.  "
        },
        {
            "text": "When I first joined, MHCLG had a community of practice for business analysts and performance analysts already, but due to competing priorities, meet-ups were largely unstructured and there was a clear opportunity to grow engagement even further. It was clear that colleagues in the community had a lot of knowledge and experience to share.    "
        },
        {
            "text": "When I became responsible for coordinating the work of the community, my focus was on creating opportunities to share that knowledge and experience, and to build up the community – to grow it to a point where members saw the value and helped drive it forward. The investment of focus has been worth it, and we’ve seen colleagues share techniques, openly discuss challenges, share successes and most importantly, everyone is supporting each other. It’s a wonderful community and just a part of what made my first placement in MHCLG a lot of fun. "
        },
        {
            "heading": 2,
            "text": "Working on the Homes for Ukraine Sponsorship Scheme  "
        },
        {
            "text": "As I mentioned at the start of this post, one of the more high-profile pieces of work I’ve been involved in since joining MHCLG is the Homes for Ukraine Sponsorship Scheme, whose aim is to support Ukrainians and their immediate family members to apply for permission to come to the UK. The scheme enables individuals to volunteer accommodation and provide a route to temporary sanctuary for Ukrainians. My role on this project was to help the department understand its technological delivery options going forward.  "
        },
        {
            "text": "The Homes for Ukraine Sponsorship Scheme was launched very quickly – only a couple of weeks after Russia invaded Ukraine in 2022. MHCLG facilitated the development of the scheme, working closely with the Home Office, devolved authorities, local authorities and Voluntary and Community Sector organisations, to ensure that Ukrainians coming to the UK had safe accommodation and a home away from home.   "
        },
        {
            "text": "To date, a significant number of Ukrainian people have come to the UK as a result of the scheme, which demonstrates the impact the scheme has had on helping keep people safe.  "
        },
        {
            "heading": 2,
            "text": "User-centred and agile ways of working in practice  "
        },
        {
            "text": "So, how were teams able to mobilise and deliver in such a short amount of time?   "
        },
        {
            "text": "From my perspective, the short answer is that MHCLG was able to utilise existing expertise to put together a capable and collaborative team who worked in agile ways, were able to quickly respond to challenges, and who were laser-focused on the goal of designing the scheme. "
        },
        {
            "text": "I’m definitely happiest and perform at my best when I’m in a collaborative and supportive environment. I like it when everyone is free to contribute equally, when challenge is welcome and everyone is pulling in the same direction. Luckily for me, that’s exactly how MHCLG Digital works. There’s a clear collective understanding of the need to work transparently, to uproot issues early, and to iterate and grow from a firm foundation of understanding user needs. Teams are structured in the ways outlined in the GOV.UK Service Manual, and agile principles are applied consistently, bringing a mutual understanding and an ability to proactively respond to events and address challenges.    "
        },
        {
            "heading": 2,
            "text": "Life as a first-time business analyst  "
        },
        {
            "text": "Embarking on my journey as a business analyst has been both thrilling and demanding. Reflecting on my first 10 months, I would summarise the role as primarily about understanding and analysing business needs and processes, identifying and addressing gaps, and ensuring effective collaboration beyond the team. "
        },
        {
            "text": "Attention to detail is crucial for any business analyst. While working on the Homes for Ukraine programme, I frequently conducted gap analyses and delved into the details, seeking out opportunities and ensuring nothing was overlooked. This was built on a solid foundation of understanding our users’ needs, achieved through close collaboration with our user researcher, James Higgins. Conducting validation sessions and creating succinct and clear artefacts, such as data flow diagrams, supported the team’s collective understanding and enabled us to progress our work successfully. "
        },
        {
            "text": "Looking ahead to my next year as a Fast Streamer, I don’t know exactly what my next role will be yet. However, I have thoroughly enjoyed being a business analyst and being part of a wonderful community, so I hope my next role is as good.  "
        }
    ]
}