{
    "url": "https://environmentagency.blog.gov.uk/2024/08/15/going-beneath-the-surface-to-reduce-flood-risk/",
    "title": "Going beneath the surface to reduce flood risk",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2024-08-15T14:47:16+00:00",
    "content": [
        {
            "text": "Sam MacAllister and Tracy Hodsman from our asset performance teams explain how looking beneath the surface can be a key part of ensuring those on dry land have their flood risk reduced."
        },
        {
            "text": "The Environment Agency manages many different structures up and down the country that help reduce flood risk. As part of this management, work is carried out to inspect and maintain these structures to check for any potential issues before they become a problem."
        },
        {
            "text": "But how do you inspect structures that are partly underwater? You bring in the divers."
        },
        {
            "text": "Grand Sluice, Boston"
        },
        {
            "text": "The Grand Sluice in Boston is one such location where the Environment Agency has recently contracted divers to provide services on site. The Grand Sluice was built over 250 years ago to prevent tidal water entering the Lower Witham. It’s been refurbished a number of times during its working life, most recently in the 1980s, and is now due for another upgrade in the next few years."
        },
        {
            "text": "Surveys have been carried out across the sluice to understand its state of repair. It’s important, however, that the EA doesn’t just inspect what is happening above the water line but below it too."
        },
        {
            "text": "By bringing in divers, the EA can get additional surveys looking at parts of the sluice that wouldn’t normally be visible from the land. They can also better understand the River Witham too. All this information will be used to better inform the work on the Grand Sluice before it gets underway next year."
        },
        {
            "text": "Dog in a Doublet Sluices, Peterborough"
        },
        {
            "text": "Divers are also being used at The Dog in a Doublet Sluice in Peterborough. The structure consists of two sluice gates and is situated on the River Nene 5 miles east of Peterborough. The structure, in conjunction with the Whittlesey (Nene) Washes provides protection to Peterborough, the Ortons and the Nene Valley as far as Oundle from the tidal influence of The Wash."
        },
        {
            "text": "The two sluice gates are currently being closely inspected both structurally and electrically as part of a refurbishment project. This work will take around 10 weeks with one gate being inspected while the other remains operational."
        },
        {
            "text": "The divers have assisted with a number of jobs at Dog in a Doublet Sluice. They have helped with installing stop logs which are logs that stop water flow through the gates. They have also been clearing debris from the stop log grooves and detaching the crane hooks used to install the gates."
        },
        {
            "text": "Divers vs technology"
        },
        {
            "text": "With improving technology, it might be easy to assume that the role of divers is obsolete. What can a diver do that an underwater sonar survey cannot?"
        },
        {
            "text": "Sonar surveys, lidar scans and 3d modelling are a key part of the work we do and can help us look at things in different ways. For example, sonar studies and lidar have been used at Grand Sluice to help build a full 3d model of the sluice, river bed and channel sides. This work is then supplemented by the dive surveys. Having a physical specialist in the water allows the EA to learn more about certain details that a sonar can’t provide. A diver can test with their hands whether mortar is in good condition unlike a model, and they can also take samples from structures and investigate crevices that might not be seen remotely."
        },
        {
            "text": "As our examples above show it’s important that we consider the strengths of both man and technology and how they can be used in tandem to help reduce flood risk. These examples are just some of the ways that divers specialist skills can be a real benefit to the management of our assets and we’ll look to build on these in the future."
        },
        {
            "text": "Find out more:"
        },
        {
            "text": "Lower Witham Flood Resilience Project - Information Page - Environment Agency - Citizen Space (environment-agency.gov.uk)"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}