{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/12/21/understanding-the-digital-identity-market-key-insights/",
    "title": "Understanding the digital identity market: key insights ",
    "authors": [
        "Henri McKenzie-Freedman"
    ],
    "categories": [
        "Digital identity",
        "Market insights"
    ],
    "pub_date": "2024-12-21T11:00:00+00:00",
    "content": [
        {
            "text": "Today, we publish the first results from OfDIA’s digital identity market insight research."
        },
        {
            "text": "Our aim is to build an evidence base that can help answer the questions, and inform the actions, of policymakers, regulators and other key stakeholders in the market. "
        },
        {
            "text": "To what extent, for example, is the market developing in a way that provides transparency to users of digital identity solutions, and is building public trust in these products? Are digital identity services becoming more accessible and inclusive? To what extent is the UK market growing in a way that supports competition and enables startups? What is the market’s potential to support employment and growth across the UK?   "
        },
        {
            "text": "We're using a methodology that means the research is repeatable each year, so we can track  trends over time.  "
        },
        {
            "text": "To see the full results, head over to the main GOV.UK site - but we thought we'd bring you some of the highlights."
        },
        {
            "heading": 2,
            "text": "A thriving sector:  270 active firms and over 10,000 jobs "
        },
        {
            "text": "Our findings indicate a strong sectoral foundation for digital identity in the UK, with 270 active firms employing approximately 10,800 people in Digital Identity related roles.  "
        },
        {
            "text": "Employment has grown consistently (average of 11.7% per annum) over the past five years.  "
        },
        {
            "text": "These firms include a healthy mix of both established companies and smaller,  innovative small and medium-sized enterprises (SMEs). Regional clusters have been developing across the UK, with notable growth  in the North West. "
        },
        {
            "heading": 2,
            "text": "A £2bn sector, with potential to double in size by 2030 "
        },
        {
            "text": "In total, the UK digital identity sector generated £2.05 billion in annual revenue in 2023/24, contributing £858 million in GVA. "
        },
        {
            "text": "Large and medium-sized businesses accounted for 91% of this revenue and are expected to grow further. Additionally, small and medium-sized firms demonstrated strong scaling potential as new market opportunities emerge across diverse use cases. "
        },
        {
            "text": "If current trends persist, the sector could double in size by 2030, reaching £4 billion in revenue, driven by increasing demand and ongoing innovation. "
        },
        {
            "text": "Investment rates are a further indicator of a resilient market: UK digital identity firms have raised £826 million in external investment since 2015, with £148m raised across 34 deals in 2023. "
        },
        {
            "text": "The figures highlight a highly productive sector, with  an average revenue per employee of £189,867 and Gross Value Added (GVA) per employee of £79,366—about 42% higher than the average in the wider UK economy. "
        },
        {
            "heading": 2,
            "text": "Financial services, health, public sector and technology sectors are leading customers "
        },
        {
            "text": "Our research demonstrates that the sector serves a wide range of industries, including financial services (85% of providers), health and public sector (58%), and technology sectors (57%).  "
        },
        {
            "text": "70% of providers offer identity or attribute verification services, and over half (52%) support digital identity creation and management. "
        },
        {
            "text": "And key services include document verification (54%), identity management (51%), and biometrics (46%). Over a third (34%) offer solutions aligned to ‘trust services’ (e.g. digital signatures, seals and certificates).  "
        },
        {
            "text": "In all, the research has found over 30 sub-sectors with a use case for digital identity, staging high potential for  future growth. "
        },
        {
            "heading": 2,
            "text": "Towards the full report "
        },
        {
            "text": "Over the next few months, our research partners will be enriching the report with additional data points covering issues such as innovation ecosystem growth, firms’ perceptions of barriers and opportunities for growth, and the expected impact of government legislation.  "
        },
        {
            "text": "As part of this additional research we’ll be capturing the views of consumers, businesses that consume digital identity and digital identity providers – and so if you’re involved with the sector and see a survey pop into your inbox, we’d be very grateful for your response. "
        },
        {
            "text": "We’d also be grateful for any feedback on the methodologies and definitions contained in our interim report – just drop any views in the comments section below. "
        }
    ]
}