{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/12/21/using-a-digital-identity-to-buy-alcohol-safely-and-securely/",
    "title": "Using a digital identity to buy alcohol safely and securely ",
    "authors": [
        "Eleanor Curry"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2024-12-21T11:00:00+00:00",
    "content": [
        {
            "text": "Soon, people will be able to prove their age digitally when they buy alcohol.  "
        },
        {
            "text": "The Home Office’s recent consultation response outlined that government will legislate next year to allow digital identity services to be used as a proof of age for alcohol sales, provided they are certified against government standards and registered on the GOV.UK list. You can read about it in our press notice on GOV.UK. "
        },
        {
            "text": "This change will give people the option of using a digital identity service on their phone or other device to prove they are over 18, saving them the hassle of taking physical documents to bars or shops. The check itself can be quick and easy too, like contactless payments or scanning a QR code. "
        },
        {
            "text": "Even better, using digital identity services can preserve privacy through reducing the amount of information that’s shared.  For example, when you hand over a physical driving license, you’re giving away your name, sex, current address and date of birth (and maybe even a terrible old photo) ... A digital identity might only share that you are the rightful user of the identity, and over or under 18. "
        },
        {
            "heading": 2,
            "text": "Making sure that an ID is genuine "
        },
        {
            "text": "Under current legislation, anyone selling alcohol either on or offline needs to confirm three things when they check an ID document: "
        },
        {
            "text": "1.      Does it show that the person is over 18? "
        },
        {
            "text": "2.      Does it belong to the person presenting it? "
        },
        {
            "text": "3.      Is it a genuine document? "
        },
        {
            "text": "This involves looking at the date of birth to work out and prove the person’s age and comparing a photograph to the person standing in front of them.  They also look for security features like holograms to make sure the documents are real. "
        },
        {
            "text": "We are working with the Home Office to make sure that proving age digitally is at least as secure, and to that end we’re considering three main requirements. "
        },
        {
            "heading": 2,
            "text": "Listed on the register "
        },
        {
            "text": "First, the digital identity must reliably prove that the person is over 18.  "
        },
        {
            "text": "We have created a set of rules and standards for a ‘good’ digital identity service in the UK digital identity and attributes trust framework. Services that have been independently certified against those standards create, hold and share reliable identity and attribute information.   These certified services can be listed on a government register published on GOV.UK to make it easy to see that they’re trustworthy.  "
        },
        {
            "text": "So, only those digital identity services which have been certified against our standards and appear on our register will be able to offer acceptable proof of age for alcohol purchasing. Otherwise, we can’t be sure of the quality of the identity information, and it might pose a threat to the Licencing Act’s core objectives.    "
        },
        {
            "heading": 2,
            "text": "Binding to the person "
        },
        {
            "text": "Second, the digital identity must belong to the person presenting it. "
        },
        {
            "text": "Digitally, this can be done using biometric authentication.  For example, a user can scan their face with their smartphone to access their digital identity.  The scan of their face is bound to the photo on the original document.  This allows them to securely prove that the identity belongs to them.  "
        },
        {
            "text": "By logging into the app in this way, the person can prove that the identity belongs to them. "
        },
        {
            "heading": 2,
            "text": "Programmatic check "
        },
        {
            "text": "Finally, the digital identity must be verified as genuine. "
        },
        {
            "text": "There will need to be a programmatic check of the digital identity. This means that it will need to be checked using technology rather than just relying on the seller looking at an image on a screen.  This check will ask the identity service to confirm that the proof of age is genuine.  "
        },
        {
            "text": "This may involve scanning a QR code or using NFC technology, like we do with contactless payments. These will need to follow standards so that we know they are secure. "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "We will be working with colleagues across government and stakeholders to implement this new approach, including preparing the necessary statutory instruments.   "
        }
    ]
}