{
    "url": "https://defencedigital.blog.gov.uk/2022/06/23/mynavy/",
    "title": "Six months in the life of a MyNavy Platform Product Owner",
    "authors": [
        "Lt Cdr Morgan (Mogsy) Long"
    ],
    "categories": [
        "Navy Digital"
    ],
    "pub_date": "2022-06-23T10:21:22+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The user quote above clearly demonstrates the impact that we are having on our people and what we’ve achieved in the past six months. We’ve taken a great idea, that had initially grown under People & Training through Lt Cdr Rab Burn’s excellent leadership, and scaled it into a tool that 40,000 personnel are using to manage their Service lives across the Royal Navy."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "They can use it to order their uniform; discover opportunities to elevate their careers; report their Covid status; check their educational status and see when their next vaccination is due. And when people are struggling with something – whether it’s mental health, promotion, career, family – it’s one place they can go that will help them find the information, support and contacts they need."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Three targets for my first six months"
        },
        {
            "text": "I became platform product owner for MyNavy in September 2021, shortly after it had moved under the responsibility of Navy Digital. When I took over, I was given three directives. One, MyNavy had to be available to everyone in the Royal Navy. So on top of the Royal Navy and Royal Marines, who already had access, that meant Reserves, Civil Servants working under Navy Command, and the Royal Fleet Auxiliary."
        },
        {
            "text": "Two, it had to be an internal communications platform. The basis of that already existed, but we’ve supercharged it. We’ve built an announcements feature, which can provide targeted messages to different groups or units all the way down to individuals, branches, specs and trades. And we’ve developed the ability to incorporate images, documents and video content, such as the 60-Second Update that’s posted every two weeks."
        },
        {
            "text": "Then three, it had to offer online uniform ordering. If you’re a doctor working in a hospital in Liverpool and your parent unit is in Middlesbrough, getting a new item of uniform means traveling to Middlesbrough, standing in a queue and hoping they’ve got the right item in your size. But there’s a reserve unit in Liverpool, so why can’t you order your uniform on your smartphone and collect it at the reserve unit two miles away the following week? In partnership with the RAF, and with a fixed budget and 12 week delivery timeline, we built a click-and-collect service as a minimum viable product and rolled it out in early December. To date, the Navy’s had over 900 orders processed through it. The response and sentiment across the force is positive, with users only requesting more functionality and greater reach to UK Strategic Command units."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "But that’s not all"
        },
        {
            "text": "On top of delivering these three targets we have also created a Healthcare feature that enables users to see their data, take ownership of their medical status and improve operational readiness. And we’ve increased the number of notifications users receive informing them of actions they need to take in regards to training, competencies or courses.\nWe also completed a review and update of the MyNavy brand, vision and purpose, focusing on why MyNavy exists, how it will be used over the coming years, and how this will benefit users’ lived experience."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Empowering people"
        },
        {
            "text": "At its heart, MyNavy is an empowerment tool, and it was clear to me that the only way it would work was if we took a user-centred approach. Armed forces in general are very good at doing what the strategic business aims require, but less efficient at recognising what the serving people actually need. So we’ve done extensive user testing and research to understand how people are using the system and what for, so we can build the enhancements they want, to make their lives easier."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Something else I’m proud of is the team we’ve built behind MyNavy. It’s a great example of service personnel, civil servants and contractors working in partnership. I never wanted it to be ‘I’m the boss, you work for me’. You never get the optimum output or any kind of team longevity working like that."
        },
        {
            "text": "The result of this mixed team with an empowered product owner is that our digital programme partner, Great State, has been able to build the flexible, responsive operating model MyNavy needed. In turn, that’s allowed us to deliver change based on user feedback on a two-weekly sprint cycle. Everyone across the Navy sees iterative enhancements every two weeks, and that’s really powerful."
        },
        {
            "text": "A great example of this was the third Covid vaccination booster. We knew there was probably going to be one, but we didn’t know when. We spoke to RN and RAF healthcare and told them that, in a few weeks’ time, they were going to need people to be able to submit details of their third vaccination. And we asked if they wanted us to build that functionality. They said yes please, and how fast could we do it? Could they have it in the next six months? We made it our priority and, in partnership with Lt Chris Pascoe and the people data warehouse team, we built it out within three weeks. And as a result, thousands of people have been able to use their phone to submit their vaccination details, and have this data fed through into the right system."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "The importance of being user-driven"
        },
        {
            "text": "When I took over, we were receiving maybe half a dozen emails a week from users. But if we truly wanted to be a user-driven service, we needed a way for people to provide feedback and make suggestions via MyNavy itself. So, in January, we released the ‘Have Your Say’ feature."
        },
        {
            "text": "Since it’s release, we have received submissions identifying problems we didn’t know existed, suggesting really sensible enhancements and modifications to existing services, and recommending new features and functions that we wouldn’t necessarily have identified through our stakeholders. In addition, some of the feedback isn’t about MyNavy. It’s about the supporting policies and processes, so we’re passing that on to the right people."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Looking back, looking forward"
        },
        {
            "text": "Looking back over my first six months with MyNavy, I feel extremely lucky. I’m working in an organisation that encouraged me to step outside my core branch and develop new skills in digital and data, then not only appointed me to a position that required those skills, but also empowered me to use them to deliver change."
        },
        {
            "text": "We now have a platform which receives over 168,000 monthly visits and has been accessed from 27 countries, with 84 per cent of that access coming from smartphones. That adds up to 72 per cent of the Royal Navy using the service in the past 28 days."
        },
        {
            "text": "Of course, this is only the start of the MyNavy journey under Navy Digital. We may have delivered against my three initial directives, and proved our operating model can respond effectively to rapidly changing priorities, but we know there’s a lot more to do."
        }
    ]
}