{
    "url": "https://defrafarming.blog.gov.uk/2022/06/23/the-latest-from-the-fertiliser-taskforce/",
    "title": "The latest from the Fertiliser Taskforce",
    "authors": [
        "Sarah Dyce"
    ],
    "categories": [
        "The Fertiliser Taskforce"
    ],
    "pub_date": "2022-06-23T16:31:47+01:00",
    "content": [
        {
            "text": "The Fertiliser Taskforce is made up of representatives from industry bodies and the UK's devolved administrations."
        },
        {
            "text": "The taskforce addresses the impact of global supply pressures on farming. It seeks to improve market confidence and help provide farmers with the information they need to make business decisions on fertiliser use."
        },
        {
            "text": "You might remember that we blogged about the creation of the taskforce and the first meeting chaired by Minister Prentis last month. "
        },
        {
            "text": "The second meeting of the Fertiliser Taskforce was chaired by Minister Churchill on 18 May. The taskforce reviewed the government’s response to the challenges so far and discussed what further action could be taken."
        },
        {
            "text": "Attendees included The National Farmers’ Union (NFU), The Agricultural Industries Confederation (AIC) and Agriculture and Horticulture Development Board (AHDB)."
        },
        {
            "text": "In this post, I’ll share a summary of the meeting.  "
        },
        {
            "heading": 2,
            "text": "Bringing forward BPS payments  "
        },
        {
            "text": "The taskforce noted the industry's positive reaction to the news that Basic Payment Scheme (BPS) payments are being brought forward."
        },
        {
            "text": "As mentioned in a previous post, manufactured ammonium nitrate and urea (the most used nitrogen fertilisers in the UK) require a significant amount energy to produce. When the gas price spikes, so can the price of fertiliser. Tractor diesel and electricity are also subject to price volatility. "
        },
        {
            "text": "This means that farmers carry an increased risk on their profit and loss account, which creates further pressure on cash flow in the short term.  "
        },
        {
            "text": "For this reason, we decided to change the way we make BPS payments. BPS payments will be made in 2 instalments. Farmers with eligible applications will receive half of their payment from the end of July, and the rest from December.  "
        },
        {
            "heading": 2,
            "text": "New season fertiliser prices  "
        },
        {
            "text": "Everyone agreed farmers must have reliable access to fertilisers this winter and next spring.   "
        },
        {
            "text": "The group welcomed news that there has been some relief on prices. Fertiliser prices peaked after the start of the conflict in Ukraine to over £1000/tonne in some cases for ammonium nitrate.  "
        },
        {
            "text": "Recently our domestic producer, CF Fertilisers, announced a new season price, and both imported and domestic fertiliser prices dropped to more attractive prices. "
        },
        {
            "text": "The taskforce also called for greater transparency in the fertiliser market to help mitigate the effects of price volatility.  "
        },
        {
            "text": "Defra and industry representatives will work on this issue together as a matter of urgency. The role of the agricultural supply chain and trusted bodies will be critical in conveying input price and retail value to farming customers and stakeholders. "
        },
        {
            "text": "We recently expanded our engagement with industry, to help gain a greater understanding of the impacts of the crisis in Ukraine, increased input costs and the situation across farming sectors. This will supplement our existing data with live intelligence. "
        },
        {
            "heading": 2,
            "text": "Sharing analysis "
        },
        {
            "text": "The attendees also appreciated the analysis published by the AHDB, which illustrates the forward market price and margins for key crops, and relative fertiliser inputs.   "
        },
        {
            "text": "We shared AHDB’s analysis in our previous blog post and we will continue to share further insight. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "The next meeting of the taskforce is scheduled for July. Subscribe to the blog for a summary of that session.  "
        }
    ]
}