{
    "url": "https://deframedia.blog.gov.uk/2022/06/23/uk-takes-lead-to-seek-global-action-on-nature-at-cop15-biodiversity-conference/",
    "title": "UK takes lead to seek global action on nature at COP15 biodiversity conference",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-06-23T10:06:39+01:00",
    "content": [
        {
            "text": "There has been straight coverage reporting the COP15 biodiversity conference will be rescheduled to take place in Montreal, Canada in a number of outlets including the Guardian, BBC News Online, Business Green and iNews."
        },
        {
            "text": "The UK Government has welcomed confirmation that COP15 will go ahead this year, making clear that the issue of biodiversity loss cannot be ignored. The UK is seeking to build on momentum following our COP26 presidency, which led to the Glasgow Leaders’ Declaration on Forests and Land Use being agreed, a commitment by 140 leaders representing 90 per cent of the world’s forest to halt and reverse forest loss and land degradation by 2030."
        },
        {
            "text": "At a preliminary meeting in Nairobi this week, the UK will lead calls for greater ambition for nature. The UK-led statement, supported by 46 other high ambition countries, calls on the international community to halt and reverse biodiversity loss globally and adopt the ‘30by30’ target to protect at least 30 per cent of land and ocean by 2030. This will help restore ecosystems, drive species population recovery and halt extinctions by 2050."
        },
        {
            "text": "Lord Zac Goldsmith, International Environment Minister, said:"
        },
        {
            "text": "The UK’s High Ambition Statement in partnership with members of the global community will call on countries to prioritise:"
        },
        {
            "text": "The UK is already leading the way with our commitment to spend at least £3 billion of our £11.6 billion International Climate Finance pledge on protecting and restoring nature, including £500m dedicated to the ocean through the Blue Planet Fund, alongside commitments in the International Development Strategy and the Overseas Development Assistance."
        },
        {
            "text": "More than half of global GDP – $44 trillion – is linked to biodiversity and supports the livelihoods of some of the remotest communities on the planet. This is why the international community must take urgent action to address the emergency facing our planet. The COP15 conference is an important step in establishing a solid foundation to support a prosperous future for people and the planet."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}