{
    "url": "https://educationhub.blog.gov.uk/2022/06/why-is-it-important-to-get-young-women-into-engineering-careers/",
    "title": "Why is it important to get young women into engineering careers?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "STEM"
    ],
    "pub_date": "2022-06-23T17:18:40+01:00",
    "content": [
        {
            "text": "On International Women in Engineering Day we celebrate the enormous contribution that female engineers make to the country, and the world."
        },
        {
            "text": "There are so many exciting engineering opportunities available offering a chance to secure a great career with higher wages."
        },
        {
            "text": "However, figures show that women only makeup 16.5% of the engineering workforce, which is why it’s important that we all play our part in encourage more women and girls to consider a career in engineering. We need more engineers to help us continue to build a dynamic and growing economy."
        },
        {
            "text": "As part of this, we need to address the gender imbalance in STEM subjects and improve girls’ take-up of maths, computing and physics."
        },
        {
            "heading": 3,
            "text": "What progress have you made so far? "
        },
        {
            "text": "We’ve seen some fantastic progress in recent years, with 30% more women and girls doing STEM A levels since 2010, and nearly a 50% increase in the number of women accepted onto undergraduate STEM courses."
        },
        {
            "text": "But there is still more to do to ensure that girls and women are reaching their potential and are equally represented at all levels in engineering and every other sector."
        },
        {
            "heading": 3,
            "text": "How we are supporting more women to get into engineering  "
        },
        {
            "text": "Despite this progress, we recognise there is more we can do. That is why we are building on this through the STEM ambassadors programme, creating a network of Maths Hubs and funding the Simulating Physics Network to attract and hone top talent and improve girls participation in schools."
        },
        {
            "text": "These skills can also be gained through apprenticeships, offering the opportunity to earn while you learn."
        },
        {
            "text": "15% of starts in STEM apprenticeships were by females in 2020/21 and it’s great to see the proportion of women and girls taking up an apprenticeship in STEM is growing but we know there is more to do."
        },
        {
            "text": "We are working with some of the country’s most influential employers through our Apprenticeship Diversity Champions Network to promote best practices in encouraging and retaining more women in STEM-based apprenticeships."
        },
        {
            "text": "The Apprenticeship Network published a report during National Apprenticeship Week 2022 with best practice and hints and tips for employers to improve diversity in apprenticeships."
        },
        {
            "heading": 3,
            "text": "What are the routes available for young women to get into engineering? "
        },
        {
            "text": "In terms of routes into engineering, you can look on Get the Jump while for adults looking to upskill/reskill it’s Skills for Life."
        },
        {
            "text": "There are also 3 new T Levels launching this September in engineering & manufacturing subjects (Design & Development for Engineering & manufacturing; Engineering, Manufacturing, Process and Control; Maintenance, Installation & Repair for Manufacturing & Engineering)."
        },
        {
            "text": "There are also other routes to gain and engineering qualifications such as studying at the Dyson Institute of Engineering and Technology and at one of our Institutes of Technology."
        }
    ]
}