{
    "url": "https://traderemedies.blog.gov.uk/2023/05/03/meanwhile-in-the-real-world/",
    "title": "Meanwhile, in the real world",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Analysis",
        "Investigations",
        "Policy"
    ],
    "pub_date": "2023-05-03T12:27:52+01:00",
    "content": [
        {
            "text": "We are aware that our cases can seem abstract. But they all have real world economic impacts. So we are always keen to monitor changes in trade flows that our recommendations trigger and to evaluate the effects on the UK economy. A good recent example is biodiesel.  "
        },
        {
            "text": "In November 2022 Ministers accepted a TRA recommendation to remove import tariffs on hydrotreated vegetable oil (HVO), a type of biodiesel. As a result, last month saw the first shipment of HVO arrive in the UK from the US.   "
        },
        {
            "text": "As background, there are two main types of biodiesel - HVO and fatty-acid mono-alkyl esters (FAME) - with different uses and costs. We produce FAME in the UK but we don’t produce HVO. The biodiesel measure we inherited from the EU had targeted both HVO and FAME from the US.  "
        },
        {
            "text": "After reviewing the anti-dumping and anti-subsidy tariffs on imports of HVO and the cheaper FAME biodiesel, we found that keeping the measures on FAME would protect UK producers from unfairly dumped and subsidised goods, while removing the measures on HVO would provide better choice for consumers. We think it’s an example of how we are changing trade remedies inherited from the EU to make them work for the UK. "
        },
        {
            "text": "Our analysis found that there is demand for HVO in the UK for use in heating buildings, as it offers a cost-effective and more environmentally friendly alternative to existing heating fuels. The UK and Ireland Fuel Distributors Association (UKIFDA) has said that the industry has already demonstrated across 150 homes and businesses in the UK that HVO can be used as a direct replacement for traditional heating oil, reducing carbon emissions by up to 88%. It hopes to convert as many of the total 1.7 million homes in the UK as possible that use heating oil to HVO.  "
        },
        {
            "text": "The first delivery of HVO from the US since the measure was lifted has now arrived at a terminal in Cardiff. "
        },
        {
            "text": "The TRA’s Investigations Delivery Director John Kirkpatrick commented: “I’m pleased to see the first shipment of HVO arrive free of trade remedy tariffs on these shores. Tailoring existing trade remedy measures to better suit the UK economy – in this case benefiting UK consumers – is part of what the TRA was set up for.”  "
        },
        {
            "text": "At the TRA, we continually monitor the impact of our investigations. We will keep an eye on whether markets develop as we might expect and the benefits we expect materialise. If UK industry has evidence that it is being harmed by unfair trading practices, the TRA will look at it.  "
        },
        {
            "text": "If you would like to know more about how we work with UK businesses as part of our transition reviews, you can do so on our website. "
        }
    ]
}