{
    "url": "https://prisonjobs.blog.gov.uk/2023/05/03/supporting-victims-a-vital-role/",
    "title": "Supporting victims: a vital role",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2023-05-03T13:06:49+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Victims of serious crimes and their families are offered a victim liaison officer, a particular kind of probation services officer. They help victims navigate through the criminal justice journey and access specialist support such as counselling. Victim liaison officers ensure the victim is kept informed and that their voice is heard. "
        },
        {
            "text": "We speak to Linda, a victim liaison officer, working for Kent Probation Service. "
        },
        {
            "text": "Tell us a bit about your role "
        },
        {
            "text": "We work with victims of serious crime and our role is to provide victims with information about the offender in their case. We keep victims informed about how long the offender is going be in the prison system. We keep in contact with victims until an offender finishes their sentence, however long that may be.  "
        },
        {
            "text": "In order to make sure we’re informed about an offender, we liaise with the Prison Service, prison governors and parole boards as well as linking in with psychiatrists and mental health tribunals. "
        },
        {
            "text": "We’re there to give victims information, but it's also about looking at how we can support them. For example, referring them to support networks such as counselling services or arranging referrals to restorative justice so that victims can get some answers from an offender, if that's what they want. "
        },
        {
            "text": "Then at the appropriate time, we talk to them about the offender’s release and what conditions the victim is allowed to request. For example, requesting that the offender does not come back to live near the victim. "
        },
        {
            "text": "Why is this work so important? "
        },
        {
            "text": "It’s important to ensure that the victims and their families have a voice and are supported. In the lead up to a conviction the police will keep the victim updated, then there's the court case and witness care unit, so there can be quite a lot of involvement for the victim with various agencies.  "
        },
        {
            "text": "When that’s over and the offender has been sentenced, a victim or their family might be thinking “now what?” They still need to be kept informed about the offender, feel like they have a voice, and be supported through the justice process. "
        },
        {
            "text": "How did you come to the role? "
        },
        {
            "text": "I left school at 18 and I was going to have a gap year but then life just turned a different corner. I started working as a volunteer within a young offender’s institution and from there I got a part- time job working in an ex-offenders club. "
        },
        {
            "text": "That led to the Probation Service. I was part of an offender management unit and my senior colleague who headed the victim’s unit asked if I could come over and help. That's how I started working with victims. Then I moved to Kent and spent a few years working at the Crown Court as a probation liaison officer before coming back to the victim’s side and applying for my current role of victim liaison officer. "
        },
        {
            "text": "It must be a role that requires a lot of sensitivity "
        },
        {
            "text": "Yes, working with victims of a serious offence, or their families, requires a lot of sensitivity. They’ve been through something traumatic, so sometimes they're okay, but at other times they’re not. It's recognising that, being there for them, and making sure they know what support is available to them - that is key to this role.  "
        },
        {
            "text": "At the stage where an offender is due to be released, that can be a challenging time, because that can trigger those emotions from the original offence. Suddenly their safety net feels like it's changing. But we’re there to give victims a voice and make sure that what they have to say is considered by the agencies involved. "
        },
        {
            "text": "If victims or their loved ones are heard and people feel they've been listened to and actions have been taken, then they can begin living their lives again. "
        },
        {
            "text": " The role must be quite challenging at times too? "
        },
        {
            "text": "Yes, telling people something they don’t want to hear, for instance, that the offender has a release date. There have been times when people have cried or been angry, and there can be emotional pressure on you. But we're always building that relationship with the victim and building trust. Although release may not be something they want to hear, they know it's coming because of the work we've done with them before, and they know that we are supportive of them. "
        },
        {
            "text": "At challenging times I’ve got colleagues to talk to, we're a close -knit team. You can discuss a case with them, and they might say “oh that's quite difficult, how about doing this instead?\". Plus, you can have a chat and a cup of tea, you know?  "
        },
        {
            "text": "We've got systems in place too. We have mentoring and ongoing training, for example being trained on how to work with those who have experienced trauma. "
        },
        {
            "text": "What are the best bits? "
        },
        {
            "text": "I think it's very rewarding when people know they've been listened to, and that they've had a voice in the justice process. "
        },
        {
            "text": "Seeing and helping a victim through their journey is very rewarding too, the journey from not being able to cope with anything to gaining more confidence. We’re helping them to build up a network and take back control of their lives a bit. It can be little steps, like going out by themselves. For us it could seem insignificant, but for them it's a really big step. "
        },
        {
            "text": "What would you say to someone who is considering applying for this kind of role? "
        },
        {
            "text": "It's a really exciting time to be involved in victim work, the role is expanding all the time and becoming so interesting.  "
        },
        {
            "text": "We’re training other staff; we're going out to talk to other agencies and educating other people.  Victim support is becoming more centre stage and that’s how it should be. "
        }
    ]
}