{
    "url": "https://educationhub.blog.gov.uk/2023/05/03/ucas-application-deadlines-2023-when-do-i-need-to-accept-my-university-offer-by/",
    "title": "UCAS application deadlines 2023: When do I need to accept my university offer by?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2023-05-03T12:33:41+01:00",
    "content": [
        {
            "text": "Students across the country who have received university offers will soon need to decide if and where they want to continue their studies."
        },
        {
            "text": "As the deadline for accepting university places approaches, we tell you everything you need to know about UCAS offers, as well as some alternatives to undergraduate degrees – such as degree apprenticeships – that you might not have already considered."
        },
        {
            "heading": 3,
            "text": "When do I have to accept my university offer by? "
        },
        {
            "text": "Most people will receive their last university decision on or before Thursday 18 May. If this applies to you, you’ll need to respond to your offers by Thursday 8 June."
        },
        {
            "text": "If you have applied already but have changed your mind about your choices or not received an offer, you may be eligible to apply for a different course or university through UCAS Extra."
        },
        {
            "text": "For any applications received by 30 June, you’ll receive your last university decision on or before Wednesday 12 July, and you’ll need to respond to your offers by Monday 17 July."
        },
        {
            "text": "Visit this link to login to your account, review your offers and find out what your personal deadline is."
        },
        {
            "heading": 3,
            "text": "How do universities make sure final offers are fair? "
        },
        {
            "text": "In September 2021, when students began studying their GCSE and A level course, Ofqual set out a two-year plan for grading."
        },
        {
            "text": "Last September, Ofqual confirmed a return to pre-pandemic grading in 2023, with protection in place for GCSEs, AS and A levels against the impact of disruption, including from the COVID-19 pandemic."
        },
        {
            "text": "This year, grading will include an allowance for disruption so that overall results will be similar to those of 2019. So where national performance is found to be lower than it was prior to the pandemic, senior examiners will make allowances when setting grade boundaries."
        },
        {
            "text": "Broadly speaking, this means that a student should be just as likely to achieve a particular grade this year as they would have been before the pandemic. You can find more information on the arrangements for 2023 in Ofqual’s student guide."
        },
        {
            "text": "As they do every year, universities are making sure that the way they set entry requirements fairly reflects the grades that students are likely to receive. Admissions teams consider a broad range of information about students, in addition to their predicted grades, personal statement, teacher references and other assessments. There will be lots of options for all students, and grading arrangements will not affect this."
        },
        {
            "heading": 3,
            "text": "How to work out how many UCAS points you have "
        },
        {
            "text": "Some universities and colleges refer to ‘UCAS points’ in their entry requirements. Your qualifications and grades are converted into a numerical value, dependent on the qualification size, and the grade you achieved. Qualifications like VTQs and T Levels can also be converted into UCAS points."
        },
        {
            "text": "To find out how many UCAS points you have, use this calculator."
        },
        {
            "heading": 3,
            "text": "Can I apply for a place through Clearing? "
        },
        {
            "text": "Clearing is when UCAS provides students with the opportunity to apply for university places which haven’t yet been filled, outside of the normal application window."
        },
        {
            "text": "It’s a good option if you’ve changed your mind about what course you want to do, you didn’t previously apply but now wish to, or you haven’t met the entry requirements for the offer you’ve accepted."
        },
        {
            "text": "From 5 July to 17 October 2023, you can apply for a course using Clearing if you’re not already holding an offer from another university or college, and the course still has places."
        },
        {
            "text": "You can use Clearing if:"
        },
        {
            "text": "You can find out more about clearing here: Clearing | UCAS."
        },
        {
            "heading": 3,
            "text": "What other options are there if university isn’t right for me?"
        },
        {
            "text": "It’s important to remember that university isn’t the right choice for everyone. Even if you’ve achieved high grades, you might want to consider alternative routes, like doing an apprenticeship or going straight into work."
        },
        {
            "text": "If you want to get a degree but you’re having second thoughts about studying full-time at university, doing a Level 6 or Level 7 degree apprenticeship could be an interesting option."
        },
        {
            "text": "It allows you to gain a full undergraduate or master’s degree while you work, and you don’t have to take out a loan."
        },
        {
            "text": "There are an exciting range of degree apprenticeships available now, which could jumpstart your career in industries like finance, engineering, journalism and healthcare."
        },
        {
            "text": "We’re making it easier for students to apply for degree apprenticeships on UCAS, alongside other types of degree."
        },
        {
            "text": "From autumn 2023, students will be able to explore apprenticeship opportunities alongside undergraduate courses on UCAS, allowing them to discover and decide between their options in the same place for the first time."
        },
        {
            "text": "Apprenticeships have different deadlines and application processes to university courses. Visit the UCAS website to find and apply to a degree apprenticeship."
        },
        {
            "text": "If you’d like to get some free, impartial advice on possible options, you can get in touch with The National Careers Service by phone, webchat or in person."
        },
        {
            "text": "The Get the Jump homepage also explains the different pathways you could explore, beyond university."
        }
    ]
}