{
    "url": "https://services.blog.gov.uk/2023/05/03/what-happened-in-services-week-2023/",
    "title": "What happened in Services Week 2023",
    "authors": [
        "Kara Kane – Head of Profession for Design, GDS",
        "Marc O’Connor - Senior Service Designer, HMRC",
        "Dani Barge - Strategy and Content Officer, Cabinet Office",
        "Imran Hussain - Community Designer, GDS",
        "Lisa Jeffery – Senior Engagement and Content Lead, Cabinet Office"
    ],
    "categories": [
        "Events",
        "Service community",
        "Service design",
        "Service transformation"
    ],
    "pub_date": "2023-05-03T10:39:20+01:00",
    "content": [
        {
            "text": "A week of talks, case studies and meet-ups led to the success of Services Week 2023, where people interested in designing better services for the public came together to teach, learn and work together on improving government for its users."
        },
        {
            "text": "This cross-organisational public sector event series grows in new ways every year. This year, from Monday 20 to Friday 24 March, we counted 46 sessions run by 20 different public sector organisations. All of these sessions shared different perspectives and made new connections across the boundaries of the public sector. From various NHS organisations to local councils and central government organisations, we co-created value and grew service literacy.  "
        },
        {
            "text": "This year, the theme was designing for uncertain times, and there was plenty to consider. More than 2,000 civil and public servants attended. Lots of sessions were sold out and had over 100 attendees, while other sessions were smaller and more intimate by design. Many sessions were recorded and the video playlist for UK public servants is receiving hundreds of views. The link has been published via the #ServicesWeek channel on UK government Slack and Local gov digital Slack. "
        },
        {
            "heading": 2,
            "text": "What did you think, feel, do? "
        },
        {
            "text": "Here is what some session hosts thought about the week. "
        },
        {
            "heading": 3,
            "text": "Birmingham City Council at Services Week"
        },
        {
            "text": "Kat Sexton, who recently joined Birmingham City Council (BCC) as Head of Function for Product said \"I’m a big fan of Services Week and have loved getting involved in it over the years. It's a great way for central and local government colleagues all over the UK to take a breath, collaborate, share and learn together. Digital and Technology Services is doing some fabulous work in collaboration with service areas across BCC to ensure we are designing truly great services for our users. It was incredible to see my colleagues stepping up to deliver some brilliant talks this year and share our experiences and learning with peers across government agencies.” "
        },
        {
            "heading": 3,
            "text": "Civil servants led their first sessions"
        },
        {
            "text": "Laura Churchill, Lead Content Designer, Defra, co-hosted ‘Content design in uncertain times – a Lean Coffee event’. She said: “This was my first lean coffee event. I was amazed at how many topics we collected and how deep the discussion went on each one. We could have gone on for hours to be honest. Like content therapy!”"
        },
        {
            "text": "Chloe Key, Digital Data and Technology Fast Streamer, HM Revenue and Customs, helped to facilitate the ‘Introduction to service design’ training. She reflected: “This was my first ever Services Week as someone who is quite junior in the profession. Yet, the benefit of the cross-government collaboration is undeniable! It was so great to see so many different roles, and different departments, all bettering their understanding of how to apply a service lens to issues they might encounter!”"
        },
        {
            "text": "Katharine Beer, Senior Interaction Designer, is from the Department for Education, where colleagues hosted several sessions. Said Katharine: “I absolutely loved Services Week 2023 and am so thrilled to have been a part of it. I was lucky enough to take part in a great ‘Introduction to service design’ course, explored ‘Resetting communities of practice’ and ran 3 sessions of my own around topics I am passionate about. I’ve since watched many of the other sessions and benefited from them too. Being part of our cross-government community is one of the most invaluable aspects of my role and is partly why I joined the Civil Service in the first place. To go from eagerly watching the Service Week recordings a few years ago to being part of it myself has been amazing. Thank you to everyone who was involved!”"
        },
        {
            "heading": 3,
            "text": "Justice Digital returned to talk teams"
        },
        {
            "text": "Simon Manby, Senior Product Owner at the Ministry of Justice, told us why they ran a session on multidisciplinary teams and product development in a changing policy landscape: “Services Week is a valuable chance to look across the public sector and see what other teams are doing. The Modernising Lasting Powers of Attorney team at Justice Digital always try to contribute. This time me and my colleague Holly spoke about policy and digital working to achieve common outcomes. We had 100 attendees, it was ace to hear other people’s experiences across this evolving space. There is always someone who has done or is doing the work that you are, and the serendipity of finding them, sharing experience and stopping duplication is the greatest asset of the public sector community, and something we should be proud of, and nurture.” "
        },
        {
            "heading": 3,
            "text": "NHS and CQC brought back lightning talks"
        },
        {
            "text": "Sarah Stokes, Lead User Researcher at the Care Quality Commission and Nick Walton, User Research Officer from NHS Business Services Authority teamed up to run a series of lightning talks on user-centred design topics.  "
        },
        {
            "text": "Sarah said: “It was great to connect people from Care Quality Commission, NHS Business Services Authority, Department for Work and Pensions and Government Digital Service as presenters, and many more from central and local government as attendees!”"
        },
        {
            "text": "Nick reflected: “Services Week is a celebration of the work we do. Co-organising the lightning talks helped strengthen and forge new connections in the cross-government community. It was fantastic to meet new people as part of the overall planning group. It was also the perfect opportunity to reach out to ex-colleagues.”"
        },
        {
            "heading": 3,
            "text": "CDDO and designers worked together"
        },
        {
            "text": "Colleagues from the Central Digital and Data Office (CDDO) who lead the digital, data and technology profession published the Services Week 2023 daily line-up on their blog and were keen to help organise the event. Megan Lee Devlin, Chief Executive of the CDDO explained why Services Week is such an important event: “One of the key aims of the government is to make digital services to the public more efficient and accessible, as set out in our Transforming for a Digital Future Roadmap. Services Week has a vital role to play in enabling civil servants to do just this.”"
        },
        {
            "heading": 2,
            "text": "What next? "
        },
        {
            "text": "We will be looking for volunteers to help with Services Week 2024. If you were inspired by this year’s event, if you’ve volunteered before, or even if you’ve never been before but would still like to be involved, we would love to hear from you. Contact us on the #ServicesWeek channel on the cross-government Slack, or email the Services Week team."
        },
        {
            "text": "There is also a chance for civil servants to share learning from Services Week 2023 sessions wider across government during June and July at Civil Service Live 2023. Email the Central Digital and Data Office for details. "
        },
        {
            "text": " "
        }
    ]
}