{
    "url": "https://defradigital.blog.gov.uk/2023/05/03/what-ive-learned-about-panel-management-in-a-growing-research-team-part-two/",
    "title": "What I’ve learned about panel management in a growing research team – Part Two",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "User centred design",
        "User research"
    ],
    "pub_date": "2023-05-03T07:30:56+01:00",
    "content": [
        {
            "text": "Jason Stockwell continues with his blog about managing user research panels. In the second and final part, he discusses the challenge of constant recruitment, how to bring teams together and the prospect of personal burnout."
        },
        {
            "text": "In the first part of this blog, I explained what happens when a user research project grows suddenly, and quickly, and how this needs to be managed to keep things on track."
        },
        {
            "text": "In this post I’ll be reflecting on the challenge of constant recruitment, how to bring teams together and the prospect of personal burnout."
        },
        {
            "heading": 2,
            "text": "Constant recruitment"
        },
        {
            "text": "When a panel is being used by over 15 researchers working in sprints, constant recruitment is a guarantee. This means a refreshed panel needs recruitment from external sources. As well as this constant replenishing of the panel, the way we request panellist needs updating."
        },
        {
            "heading": 2,
            "text": "Pulling teams together"
        },
        {
            "text": "The team that engages externally goes beyond user researchers. Aligning social research, communications teams, operability colleagues and digital with forums and engagement groups encourages collaboration across the teams."
        },
        {
            "text": "The panel can’t facilitate contact for all of these teams, but with these tools across a unified team we can find more participants to take part in research sessions to grow the panel and share insights across user researchers (and beyond through the wider team)."
        },
        {
            "heading": 2,
            "text": "Changing processes"
        },
        {
            "text": "When we first started on the programme, a panel manager took the recruitment pillar of research operations completely away from user researchers, helping with consent forms, note taking, through to research libraries and compiling insights."
        },
        {
            "text": "This full service is no longer possible, we need to think about what elements in that process are essential and what is desirable."
        },
        {
            "text": "Currently on the programme, we’re working in a more limited way, panel managers cannot attend sessions or support with consent forms, so we have found automation and workarounds within the process to optimise the service needed for user researchers."
        },
        {
            "text": "There are differences in the ways the team access processes, these are based on tech and tools the team have access to. For example, some members of the team do not have Qualtrics access, so consent forms need to be automated to some of the researchers, where others can log in and access their consent forms online."
        },
        {
            "text": "We need to be certain about where we need to follow process, and where we can flex to suit specific researcher’s existing processes."
        },
        {
            "heading": 2,
            "text": "Personal burnout"
        },
        {
            "text": "With the fluctuations in workload over the sprints, and uncertainty on long-term projects, comes stress. Being aware of the peaks and troughs involved with incoming panel requests, and the constant need to support user researchers in sourcing participants for research, these factors all impact personal wellbeing and burnout."
        },
        {
            "text": "Ultimately, the responses you have about taking part in research, is research."
        },
        {
            "text": "This comes on to the next point around saying no. Sometimes it’s impossible to fill research slots. Making this clear up front after the brief can help set expectations and relieve some pressure from research teams."
        }
    ]
}