{
    "url": "https://publicguardian.blog.gov.uk/2024/11/26/giving-gifts-as-an-attorney-or-deputy/",
    "title": "Giving gifts as an attorney or deputy",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Attorneys",
        "Deputies",
        "Gifting",
        "Guidance",
        "LPA",
        "Mental Capacity Act"
    ],
    "pub_date": "2024-11-26T11:51:13+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Understanding your role  "
        },
        {
            "text": "As an attorney or deputy acting on behalf of a loved one, occasions like Christmas, birthdays, or anniversaries can raise questions about giving gifts and presents.  "
        },
        {
            "text": "Gifts can be given on festive occasions as well as life events such as births or weddings as long as the gift meets certain criteria.   "
        },
        {
            "text": "It’s not compulsory for you to give gifts. If you do, it should always be done with the person’s best interests in mind.    "
        },
        {
            "text": "In this blog we cover the key points to consider when giving a gift as an attorney or deputy. For more information read our detailed guidance.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What is a gift? "
        },
        {
            "text": "Deciding whether to make a gift is important as gifts can help convey a person’s wishes and feelings.   "
        },
        {
            "text": "A gift is when an attorney or deputy moves ownership of money, property or possessions from the person to themselves or other people, without full payment in return. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Who can give gifts? "
        },
        {
            "text": "As part of the Mental Capacity Act, the person you are gifting on behalf of should always be consulted before decisions are made and included as much as possible. If they have mental capacity then it is their decision.  "
        },
        {
            "text": "If the person has fluctuating capacity you will want to consult them at the best possible time and support them to make a decision. "
        },
        {
            "text": "If you are an attorney or deputy for property and financial affairs, the decision on whether to make a gift is yours if the person lacks capacity. "
        },
        {
            "text": "You can find more information on how to assess capacity, or how best to involve them in the decision-making process, in chapter 4 of the Mental Capacity Act Code of Practice.  "
        },
        {
            "text": "Remember, an unwise decision doesn’t mean they don’t have capacity to make that decision. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What can be given as a gift? "
        },
        {
            "text": "Gifts can be given on customary occasions such as:  "
        },
        {
            "text": " "
        },
        {
            "text": "Gifts must be reasonable, affordable and in the person’s best interests. When giving a gift you should consider the relationship between the person and who the gift is for and any record of the person’s wishes. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What is considered a ‘reasonable gift’? "
        },
        {
            "text": "When determining if a gift is reasonable, consider the person’s financial situation: "
        },
        {
            "text": "  "
        },
        {
            "heading": 2,
            "text": "What happens if a gift is given without authority? "
        },
        {
            "text": "If you give a gift without proper authority, this may trigger an investigation. This could be resolved in several ways including: "
        },
        {
            "heading": 2,
            "text": "Additional support "
        },
        {
            "text": "For more information on gift giving and when you need to go to the court of protection for approval, refer to our guidance on GOV.UK. "
        },
        {
            "text": "For further questions and support please email our contact centre team via customerservices@publicguardian.gov.uk or 0300 456 0300 "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Deall eich rôl "
        },
        {
            "text": "Fel atwrnai neu ddirprwy sy'n gweithredu ar ran anwylyd, gall achlysuron fel y Nadolig, penblwyddi neu ben-blwyddi priodas godi cwestiynau am roi rhoddion ac anrhegion."
        },
        {
            "text": "Gellir rhoi rhoddion ar adeg gwyliau yn ogystal â digwyddiadau bywyd fel genedigaethau neu briodasau cyn belled â’u bod yn bodloni meini prawf penodol. "
        },
        {
            "text": "Nid yw'n orfodol i chi roi rhoddion. Os gwnewch hynny, dylid ei wneud bob amser gyda budd gorau'r unigolyn mewn golwg.  "
        },
        {
            "text": "Yn y blog hwn rydym yn ymdrin â'r pwyntiau allweddol i'w hystyried wrth roi rhodd fel atwrnai neu ddirprwy. Am fwy o wybodaeth, darllenwch ein canllaw manwl."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Beth yw rhodd?"
        },
        {
            "text": "Mae penderfynu a ddylid gwneud rhodd yn bwysig oherwydd gall rhoddion helpu i gyfleu dymuniadau a theimladau unigolyn."
        },
        {
            "text": "Rhodd yw pan fydd atwrnai neu ddirprwy yn symud perchnogaeth o arian, eiddo neu feddiannau gan yr unigolyn iddynt hwy eu hunain neu i bobl eraill, heb daliad llawn yn gyfnewid am hynny."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Pwy sy'n gallu rhoi rhoddion?"
        },
        {
            "text": "Fel rhan o'r Ddeddf Galluedd Meddyliol, dylid ymgynghori bob amser â'r unigolyn rydych yn rhoi rhodd ar ei ran cyn gwneud penderfyniadau a'u cynnwys cymaint â phosibl yn y broses. Os oes ganddynt alluedd meddyliol yna eu penderfyniad nhw yw hynny."
        },
        {
            "text": "Os yw galluedd yr unigolyn yn amrywio, dylech ymgynghori â nhw ar yr amser gorau posibl a'u cefnogi i wneud penderfyniad."
        },
        {
            "text": "Os ydych chi'n atwrnai neu'n ddirprwy eiddo a materion ariannol, chi sy’n gyfrifol am wneud y penderfyniad ynglŷn â gwneud rhodd os nad oes gan yr unigolyn allu i wneud hynny ei hun."
        },
        {
            "text": "Gallwch ddod o hyd i ragor o wybodaeth am sut i asesu capasiti, neu sut orau i'w cynnwys yn y broses o wneud penderfyniadau, ym mhennod 4 Cod Ymarfer y Ddeddf Galluedd Meddyliol."
        },
        {
            "text": "Cofiwch, nid yw penderfyniad annoeth yn golygu nad oes ganddyn nhw'r gallu i wneud y penderfyniad hwnnw."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Beth ellir ei roi fel rhodd?"
        },
        {
            "text": "Gellir rhoi rhoddion ar achlysuron arferol fel:"
        },
        {
            "text": " "
        },
        {
            "text": "Rhaid i roddion fod yn rhesymol, yn fforddiadwy ac er budd gorau'r unigolyn. Wrth roi rhodd dylech ystyried y berthynas rhwng yr unigolyn a phwy mae’r rhodd ar ei chyfer ac unrhyw gofnod o ddymuniadau'r unigolyn."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Beth sy'n cael ei ystyried yn 'rhodd resymol'?"
        },
        {
            "text": "Wrth benderfynu a yw rhodd yn rhesymol, ystyriwch sefyllfa ariannol yr unigolyn:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Beth sy'n digwydd os rhoddir rhodd heb awdurdod?"
        },
        {
            "text": "Os byddwch yn rhoi rhodd heb awdurdod priodol, gall hyn sbarduno ymchwiliad. Gellir datrys hyn mewn sawl ffordd, gan gynnwys:"
        },
        {
            "heading": 2,
            "text": "Cymorth ychwanegol"
        },
        {
            "text": "Am fwy o wybodaeth am roi rhoddion a phryd y mae angen i chi fynd i'r llys gwarchod i'w gymeradwyo, cyfeiriwch at ein canllawiau ar GOV.UK."
        },
        {
            "text": "Ar gyfer rhagor o gwestiynau a chymorth, anfonwch e-bost at ein tîm canolfan gyswllt yn customerservices@publicguardian.gov.uk neu ffoniwch 0300 456 0300."
        },
        {
            "text": " "
        }
    ]
}