{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/11/26/gse-leadership-values-autumn-masterclass/",
    "title": "GSE Leadership Values: Autumn Masterclass ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Talent & Leadership"
    ],
    "pub_date": "2024-11-26T16:01:10+00:00",
    "content": [
        {
            "text": "The GSE Profession team delivered an in-person GSE masterclass in London on the 17 October 2024, attended by over 70 science and engineering professionals across government. The theme for the event was ‘leading change through a science and engineering lens’. "
        },
        {
            "text": "The GSE leadership values aim to enhance science and engineering skills across the government. Developed in collaboration with GSE members, they support and guide colleagues at all career stages and align with the Civil Service Leadership Statement of ‘inspiring, confident, and empowering’ leaders. "
        },
        {
            "text": "The masterclass offered a unique opportunity to explore how leaders can learn from each other by reflecting on the values during times of change and provided an opportunity to network and build connections with their science and engineering peers across government.What did our attendees think of the Masterclass?“The presenters brought the leadership values to life by using personal experiences and perspectives.”"
        },
        {
            "text": "“The opportunity to engage and network with the speakers and with attendees was great fun and productive.”"
        },
        {
            "text": "“Assigning attendees to different tables for the different sessions was brilliant, I made a lot more connections through this.”"
        },
        {
            "text": "A huge thank you to our speakers Wendy Middleton (DBT), Dr Shabana Haque (DSIT), Dr David Kenyon (Scottish Government), Ben Buchanon (IPO) and chair Cathy Alexander (GO-Science) for their inspiring turbo talks and interactive panel session. The sharing of their experiences and the leadership challenges faced were inspiring for all the attendees. From guidance on risk appetite and building their leadership experiences to balancing being open and honest with external stakeholders, they provided invaluable insight on how they modelled the GSE leadership values in their roles."
        },
        {
            "text": "If you missed this year’s GSE Leadership Values Masterclass, you can find out more about upcoming GSE Leadership events through the GSE profession newsletter or by emailing gse@go-science.gov.uk.Check out our previous blogs for real life examples of the GSE Leadership Values from GSE members across government."
        },
        {
            "text": "GSE Leadership Values: Collaboration"
        },
        {
            "text": "GSE Leadership Values: Integrity"
        },
        {
            "text": "GSE Leadership Values: Decisive"
        },
        {
            "text": "GSE Leadership Values: Inclusive"
        },
        {
            "text": "For more information, visit the GSE Leadership Values, GSE Leadership Values Toolkit, watch the GSE Leadership Values videos, and visit the Blogs for wider GSE learning and development offers."
        }
    ]
}