{
    "url": "https://marinedevelopments.blog.gov.uk/2024/11/26/help-us-improve-the-marine-licensing-service/",
    "title": "Help us improve the Marine Licensing Service",
    "authors": [
        "Andrew Watson, MMO Service Designer"
    ],
    "categories": [
        "Digital",
        "marine licensing"
    ],
    "pub_date": "2024-11-26T09:28:38+00:00",
    "content": [
        {
            "text": "In 2022 the Marine Management Organisation's (MMO) corporate plan set out our commitment to England's marine area and all those who use it for the next three years. This included a new vision for the Marine Licensing Service. In it, we made a commitment to streamlining the service and improving the online application system (known as the Marine Case Management System or MCMS)."
        },
        {
            "text": "We now want to carry out research to learn about your needs and how you use the service. Our aim is to make the Marine Licensing Service a great government digital service."
        },
        {
            "text": "If you'd like to help us, then we warmly welcome you to complete a short survey:"
        },
        {
            "text": "Marine Licensing Service User Survey "
        },
        {
            "text": "We would love to hear from current and potential marine licence applicants from a range of sectors. We're particularly interested in working with customers who find our online application system difficult to use for any reason. This might be because of accessibility needs, digital skills or unfamiliarity with marine licensing. "
        },
        {
            "text": "The survey will help us understand more about you, how you use the Marine Licensing Service, and how you think it could be improved."
        },
        {
            "text": "The survey is anonymous, but if you'd like to get involved with more of our research you'll have the option to provide your contact details too. Any research we do with you will be led by a professional researcher who works outside of the Marine Licensing team. "
        },
        {
            "text": "The survey will take about five minutes to complete. We look forward to hearing from you!"
        }
    ]
}