{
    "url": "https://digitaltrade.blog.gov.uk/2024/11/26/transforming-the-dbt-intranet/",
    "title": "Transforming the DBT Intranet",
    "authors": [
        "Julia Crompton – Service Owner for Employee Experience"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2024-11-26T11:00:28+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Julia Crompton"
        },
        {
            "heading": 3,
            "text": "Identifying the need for change"
        },
        {
            "text": "There is always much emphasis on creating brilliant external digital services in government, but great internal digital services for staff are just as important. They help us all to do our jobs as smoothly and effectively as possible!"
        },
        {
            "text": "Following the merger of the Department for International Trade (DIT) and Department for Business, Energy and Industrial Strategy (BEIS) in February 2023, the Department for Business & Trade’s (DBT’s) intranet and staff directory were in need of some love."
        },
        {
            "text": "The new department was significantly larger with more than 8,000 people. Feedback from colleagues was that it was difficult to find out:"
        },
        {
            "text": "We believed that an easy-to-access intranet with engaging content could reduce confusion and help colleagues to do their jobs better."
        },
        {
            "heading": 3,
            "text": "The process"
        },
        {
            "text": "Six months ago, the Employee Experience team in Digital, Data and Technology (DDaT) started on a journey to define the problems accessing the intranet, combining user research and gathering stakeholder needs. Critical to the success of the work was user-centered design approach throughout."
        },
        {
            "text": "The multi-disciplinary team consisted of user researchers, content designers, interaction designers and software developers. We worked together in harmony to achieve shared objectives, backed by strong delivery and product leadership every step of way."
        },
        {
            "heading": 3,
            "text": "Modernise and redesign"
        },
        {
            "text": "Working with the department's internal communications team as well as wider Corporate Services stakeholders, we identified a need to increase engagement. Other goals were set, including increased engagement specifically with all staff events and the various staff networks (such as diversity and inclusivity groups). We decided to review the design of the homepage, the general styling and the information architecture of the website as a whole."
        },
        {
            "text": "News and events areas needed a more balanced approach and the issue of finding user-relevant content was partially addressed by the introduction of a personalised ‘bookmark’ function. A modernised and redesigned intranet homepage emerged."
        },
        {
            "text": "We had some very positive reactions:"
        },
        {
            "text": "“Love the website – it looks so good! “"
        },
        {
            "text": "“The events page is going to make a huge difference – it’s so user-friendly!”"
        },
        {
            "text": "“Bookmarks feature is great.”"
        },
        {
            "heading": 3,
            "text": "Cutting the clutter - transforming access to HR policies and guidance"
        },
        {
            "text": "The most used intranet content was Human Resources’ policies and guidance pages. However, feedback had shown that HR policies and guidance were hard to find and understand, so we decided to focus on improving discoverability here first."
        },
        {
            "text": "Working together with the HR team, we wanted to fully understand how the HR team dealt with enquiries, and the problems they wanted to solve, so that any new designs would work for them too.  We also viewed the service through the eyes of our end-users – how did they currently navigate to HR information and what were their mental models?"
        },
        {
            "text": "Our main aim was to reduce the number of first-line enquiries that were coming into the HR team. The team told us that that many of these enquiries could have been answered by information available on the Intranet, but for whatever reason, the user couldn’t easily access this."
        },
        {
            "text": "The 3 areas identified for us to focus on were:"
        },
        {
            "text": "As a result of our discovery work, Google Analytics data, user interviews and other testing, we created a landing page with the top HR tasks that users needed to complete. Card-sorting exercises showed our user researchers how users’ mental models worked, by grouping and naming types of content, e.g. from pay to leave and pensions. We listened to the pain points that users had with accessing HR content, and where it worked well. Our content designers ensured that the language used resonated with our users."
        },
        {
            "heading": 3,
            "text": "The new HR intranet landing page"
        },
        {
            "text": "Our Chief Operating Officer was very happy with the redesign “Great work team and great to see recognition from colleagues on the positive impact you are making on DBT.”"
        },
        {
            "heading": 3,
            "text": "Where we have landed"
        },
        {
            "text": "The DBT Intranet has a new, modern look with clearer news section, a new events calendar and the option to bookmark your favourite pages. With the new look came a new name. Research had shown that the former name of ‘Digital Workspace’ was confused with other digital services in DBT so we changed it to ‘The Intranet’ keeping it clear and simple as to its function. The Intranet has now seen more views than ever before (up 10% to 300,000 views in one week)."
        },
        {
            "text": "HR policies and guidance information is now easier to find, and the number of HR team enquiries is reducing (22.4% less first level HR queries than Quarter 1 2024 due to the new HR landing page). Next steps are underway in reviewing the policy content and developing online information that better supports our managers and new joiners."
        },
        {
            "text": "Discovery work around staff communities and networks in DBT is underway, and we are piloting events publication in the new format. A more personalised experience for users is being explored. The future is very exciting - the work is never finished, but we are well on the way to a fit-for-purpose intranet that is engaging, informative and enables collaboration and knowledge for all DBT colleagues."
        }
    ]
}