{
    "url": "https://nationalscreening.blog.gov.uk/2024/11/26/using-oct-eye-scans-in-post-screening-pathway-will-save-tens-of-thousands-of-nhs-hospital-appointments-every-year/",
    "title": "Using OCT eye scans in post screening pathway will save tens of thousands of NHS hospital appointments every year",
    "authors": [
        "Phil Gardner",
        "Kate Jordan"
    ],
    "categories": [
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2024-11-26T14:44:53+00:00",
    "content": [
        {
            "text": "The NHS Diabetic Eye Screening (DES) Programme helps prevent sight loss in people with diabetes by detecting changes to the eyes at a stage when treatment can reduce or prevent damage to sight from diabetic retinopathy."
        },
        {
            "text": "NHS England (NHSE) has now started the phased implementation of advanced optical coherence tomography (OCT) scans into the post-DES treatment and surveillance pathway in England. NHSE expects this change to save tens of thousands of hospital appointments every year."
        },
        {
            "text": "The UK National Screening Committee (UK NSC) makes recommendations on screening and the routine screening pathway. The routine screening pathway ends with the offer of appropriate follow-up testing, treatment or advice for people who receive a positive screening result."
        },
        {
            "text": "However, it is essential all screening programmes also link to high quality post-screening pathways that cover diagnosis, surveillance, and treatment. This ensures people receive timely and effective treatment if they need it."
        },
        {
            "text": "NHSE’s implementation of OCT scans will not affect the routine DES pathway but it will provide many benefits to patients and healthcare professionals in the programme’s post-screening surveillance and treatment pathway."
        },
        {
            "heading": 2,
            "text": "What is OCT and how will it help?"
        },
        {
            "text": "OCT is an additional imaging test that is recommended in NICE guidance on imaging techniques for monitoring diabetic retinopathy and diabetic macular oedema. An OCT scan creates a detailed cross-sectional view through the retina and can identify some features of treatable diabetic eye disease more accurately than a standard 2D digital retinal photograph screening test."
        },
        {
            "text": "Ophthalmology is one of the busiest specialities in the NHS, carrying out more than 500,000 operations every year (6% of the NHS total) and more than 7.5 million outpatient appointments. Offering OCT to people in the digital surveillance pathway in England will enable around 60,000 people with diabetes to receive regular advanced scans outside traditional hospital settings. Once rolled out nationwide by October 2025, this will save an estimated 120,000 hospital ophthalmology appointments per year, freeing up vital hospital capacity for patients who are most in need of treatment."
        },
        {
            "text": "The introduction of OCT into the digital surveillance pathway aligns with the recommendations of the Get It Right First Time report to free up capacity and enable more patients to be seen and treated effectively in a timely way. "
        },
        {
            "text": "For more information, see the NHSE news item Digital eye screening for people with diabetes could save hundreds of thousands of hospital appointments."
        },
        {
            "heading": 2,
            "text": "Evolving programme"
        },
        {
            "text": "Last year, NHSE introduced 24-month screening intervals for people at lower risk of diabetic retinopathy who have had 2 consecutive DES tests showing no signs of disease."
        },
        {
            "text": "The other UK nations had already implemented this change which followed a UK NSC recommendation that had been informed by a large study."
        },
        {
            "text": "See Diabetic eye screening changes for people at lower risk in England."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}