{
    "url": "https://environmentagency.blog.gov.uk/2024/11/26/what-are-this-years-bathing-water-classifications/",
    "title": "What are this year’s bathing water classifications? ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Environment Agency"
    ],
    "pub_date": "2024-11-26T10:27:02+00:00",
    "content": [
        {
            "text": "Today, 26 November, the Environment Agency and Defra published the annual classifications of bathing water sites in England.  "
        },
        {
            "text": "The results follow testing of England’s 450 designated sites throughout the May to September bathing season. 92% of bathing waters in England have met minimum standards, with 85% of bathing waters in England being rated as ‘good’ or ‘excellent’, continuing to show an overall boost in water quality over recent decades. This compares to just 28% being rated as ‘good’ or ‘excellent’ in the 1990s.   "
        },
        {
            "text": "We know just how important bathing waters are for both local communities and the environment, so we wanted to take the chance to answer some questions you may have about this year’s classifications. "
        },
        {
            "text": "How do you classify a bathing water site, and what does it mean? "
        },
        {
            "text": "The EA is responsible for monitoring the water quality of designated bathing water sites. Throughout the bathing season, we take samples of water and test them for two bacteria, E.coli and intestinal enterococci, which can indicate pollution that can pose a risk to bathers’ health.  "
        },
        {
            "text": "The annual classifications look at the test results from the last four years to produce a classification of ‘Excellent’, ‘Good’, ‘Sufficient’ or ‘Poor’. We use  four years’ worth of data because it means we can show trends, compare water quality between bathing waters and inform our decisions on long-term pollution reduction measures.  "
        },
        {
            "text": "The results of these tests are also published on Swimfo, where bathers can check out the latest results to make an informed decision about whether to swim.  "
        },
        {
            "text": "This year’s classifications show that the number of Good and Excellent bathing water sites are up from last year, but overall percentage is down – what does this mean? "
        },
        {
            "text": "This year, 27 new bathing water sites were designated – the biggest ever increase in new designations in a single year. Of these new sites 12 were rivers. "
        },
        {
            "text": "This is important to remember when looking at this year’s classifications, because it is not unexpected for a site that had been newly designated to be ‘Poor’ - after all, up until that point they hadn’t been monitored or managed for bathing. For us to create a plan and work to improve a bathing water site, we first need to understand what’s going on – and that’s what starts in the first year of designation.  "
        },
        {
            "text": "What’s more, rivers face a greater challenge to meet bathing standards than coastal locations. Rivers often have poorer bathing water quality compared to the sea, which benefits from the natural disinfection of salt-water as well as high levels of dispersion of any pollutants. "
        },
        {
            "text": "So, new designations – especially rivers – are more likely to be classified as ‘Poor’ in their first year. If we take a look at only the sites designated before 2024, 95% of sites would meet minimum standards this year,  slightly down from 96% last year. "
        },
        {
            "text": "What factors can affect the water quality of a bathing site? Are you taking action against polluters? "
        },
        {
            "text": "Whilst most bathing water sites are of excellent quality, there are lots of different pollutants that can affect them, such as rainwater run-off from urban and agricultural areas, birds and dogs, misconnections to surface water drains, contaminated groundwater and sewage pollution from water companies.  "
        },
        {
            "text": "Finding solutions to some pollution issues can be very complex, but we are committed to protect the environment and people. It's why we work with everyone from local partners, water companies to environmental organisations to help improve bathing waters wherever we can.  "
        },
        {
            "text": "Whilst we understand and share the public’s concern over storm overflows, our assessment finds that for most sites affected by pollution, sewage is not the only or even main cause.  "
        },
        {
            "text": "However, that’s not to say that sewage isn’t something we take extremely seriously. Significant investment in sewage treatment and networks to reduce storm overflows is planned in the next 5 years.  We’re making huge investments to improve our regulation of the water industry. More people and better technology will help us better regulate on the ground – giving us the best possible intelligence to direct our resources to the right places.   "
        },
        {
            "text": "Where our investigations do find a polluter has broken the law, we work to stop the pollution as quickly as possible and then to take enforcement action where necessary. Since 2015, we have concluded 63 prosecutions against water and sewerage companies securing fines of over £151 million.  "
        },
        {
            "text": "My local bathing water site has been classified as Poor – what happens next? "
        },
        {
            "text": "If a bathing water is classified as Poor, a sign will be displayed the following year advising against bathing. We also create action plans for every bathing water which is classified as Poor or at risk of being so.  "
        },
        {
            "text": "Each bathing water is unique and will be impacted by different pollution sources depending on its surrounding catchment, which is where our team of experts come in. The time taken to investigate the causes of poor water quality, identify actions required to drive improvements and the delivery of actions will also vary between bathing waters.   "
        },
        {
            "text": "Using our action plans, we then work with partners to try to improve these sites. "
        },
        {
            "text": "What should I do if I think there’s a pollution incident at my local bathing water site? "
        },
        {
            "text": "If you’re concerned about a potential pollution incident, report it to us on 0800 80 70 60.  "
        },
        {
            "text": "We also know that there are a lot of data sources out there with water quality information – which is great for transparency and knowledge, but it can be confusing to know where to go to get the best advice on bathing waters!  "
        },
        {
            "text": "Swimfo is the go-to website for people looking for information about bathing water quality.  "
        }
    ]
}