{
    "url": "https://digitaltrade.blog.gov.uk/2021/08/20/becoming-a-software-developer-through-my-dit-apprenticeship/",
    "title": "Becoming a Software Developer through my DIT apprenticeship",
    "authors": [
        "Natasha Boyse, Full-Stack Developer"
    ],
    "categories": [
        "Apprentices",
        "Careers",
        "Digital Services",
        "People and Skills",
        "Technology"
    ],
    "pub_date": "2021-08-20T08:44:24+01:00",
    "content": [
        {
            "heading": 6,
            "text": "An image of Natasha working from home"
        },
        {
            "text": "I have always had a passion for coding and implementing new ways of working. After studying programming in full time education, I wanted to seek a new challenging role and applied for the Software Developer Apprenticeship at the Department for International Trade (DIT)."
        },
        {
            "text": "I had a desire and determination to gain coding and problem-solving skills for a career in technology. So, when I saw an advert in the DIT internal newsletter, I decided to go for it. I wanted to see where the learning process would take me, and I knew my professional development would be supported."
        },
        {
            "heading": 3,
            "text": "Starting my journey in software development"
        },
        {
            "text": "I had previously worked in the Financial Accounts team for a few years. The journey I was about to take was very different. I was quite nervous but also excited to see where I would be at the end of it."
        },
        {
            "text": "At the start of the apprenticeship, I took part in a 3 month long academy programme with Makers, a coding bootcamp in central London. Makers taught the methods you need to quickly learn new coding languages. I was part of a larger group from a variety of companies such as Deliveroo, Home Office and KPMG. The course consisted of many things including:"
        },
        {
            "text": "My qualification involved:"
        },
        {
            "text": "After completing this, I had an intense week-long project to demonstrate the skills I had gained on the placement. The project came with a variety of options. I personally chose to write an application for a quiz manager as I felt this would best challenge and expose my knowledge. I also prepared a presentation showing my sprint planning, diagrams and sketches of the application I was going to make, and an evaluation on how I felt the week went."
        },
        {
            "text": "This took place before an informal assessment interview run by the British Computing Society (BCS) to grade you with a Pass, Merit or Distinction. I achieved a Distinction which made me feel proud of everything I had accomplished in my placement."
        },
        {
            "heading": 3,
            "text": "My team and current projects"
        },
        {
            "heading": 6,
            "text": "A screenshot of an MS teams call of Natasha and the team"
        },
        {
            "text": "During my apprenticeship I was placed with the Live Services team who design and build platforms before they go live. My team were largely responsible for my success. In particular, my previous line manager, Luisella, always encouraged me when I lacked motivation and was a listening ear throughout the process."
        },
        {
            "text": "I have worked on several projects such as the Financial Forecast Tool (FFT) created to assist Finance with efficiently planning spending for the department throughout the financial year. I am now working on the Delegates Management System (DMS) for the UK Defence and Security Exports (UK DSE). This is a reporting tool to collect travel itinerary information of foreign delegates who are attending UK DSE events."
        },
        {
            "text": "I am still working in the Live Services team with colleagues who are all very supportive and friendly. The team are always open to answer the questions I may have and offer advice on where I could advance my studies in future."
        },
        {
            "heading": 3,
            "text": "Reflections from my apprenticeship"
        },
        {
            "text": "I think women are often discouraged or intimidated by the idea of working in a science, technology, engineering and mathematics (STEM) subject. However, DIT offers an inclusive and diverse environment in which you can begin your career. Throughout my apprenticeship I networked with a variety of people with different knowledge and backgrounds. This made the whole experience pleasant and rewarding. I look forward to the projects that I will be involved with in future and am very happy with the profession that the apprenticeship exposed me to."
        },
        {
            "text": "To continue my career within digital data and technology, I am looking to take an agile project management course. I would eventually like to become a senior developer after gaining more experience."
        },
        {
            "heading": 3,
            "text": "Advice for future Developers"
        },
        {
            "text": "I would really recommend that you look into DIT’s apprenticeship programme. More generally, my advice to those looking to start an apprenticeship as a developer would be to:"
        }
    ]
}