{
    "url": "https://lifeathmrc.blog.gov.uk/2021/08/20/hmrc-is-leading-the-way-for-accessible-services/",
    "title": "HMRC is leading the way for accessible services",
    "authors": [
        "Kay Patel"
    ],
    "categories": [
        "General",
        "Guest blog"
    ],
    "pub_date": "2021-08-20T12:02:58+00:00",
    "content": [
        {
            "text": "Digital services have made a significant impact on the lives of many in the UK and transformed the way we interact with businesses and connect with those around us. There are 14.1 million people living with a disability and they too, rely on technology to carry out essential tasks in our ever-changing digital world."
        },
        {
            "text": "We want to make tax easier to pay for everyone, and to do that we need to break down as many barriers as possible, so that everyone can access our services. We do this by taking a user-centred approach, ensuring that our services are designed with all users in mind. We are looking for someone who shares our vision and is passionate to work with us to make our services better for everyone."
        },
        {
            "heading": 2,
            "text": "Accessible digital services are essential in 2021: Reflecting on the present and future"
        },
        {
            "text": "It goes without saying that 2020 changed the way our customers interacted with our services and engaged with us. Technology bridged many gaps that were left when face-to-face services had to be withdrawn. Many customers rely on digital services to meet their tax obligations. Our colleagues across HMRC also rely on technology to provide knowledgeable customer service whether they are working in the office or remotely from home. With so many people still choosing to access services digitally, the need for accessible digital services became more urgent than ever before."
        },
        {
            "text": "HMRC employees worked tirelessly through the pandemic to provide services such as the Coronavirus Job Retention Scheme, the Self-Employment Income Support Scheme and the Eat Out to Help Out scheme. During this time, we  considered the following 5 considerations as we designed our services."
        },
        {
            "text": "It's about understanding all your service user needs and this includes those who have an access need or may have barriers to accessing the service. Be rigorous when testing your service, support model and your own assumptions about your service users."
        },
        {
            "text": "Build capability within your team so that user needs are considered end-to-end and are integrated into every aspect of service design. Each member of the team should understand what accessibility means to our end users - regardless of their specific role."
        },
        {
            "text": "Assuming what your users’ needs and wants are will lead to poor service design that people will not use. Find out why users don’t currently use your digital service to gather user needs and continue to engage with them throughout the lifespan of the service."
        },
        {
            "text": "All government services must now meet the Public Sector Bodies Accessibility Regulations 2018. To make sure you meet these guidelines, carry out automated testing throughout development and do a full accessibility audit before moving to Public Beta."
        },
        {
            "text": "Continue to do user research and usability testing throughout the project, be receptive to feedback that is gathered, reflect on it and continue to refine your service continuously. Even once the service is live, continue to iterate and improve the service according to changing user needs where possible."
        },
        {
            "text": "Accessibility is everyone’s responsibility in our organisation, and we understand that the world we live in and the needs of our users are always changing. As such, we continue to consider these points, but will explore how we can support our users, by creating a tax system fit for the challenges and opportunities of the 21st century."
        },
        {
            "heading": 2,
            "text": "Why work with us"
        },
        {
            "text": "We are a user-centred organisation which runs one of the biggest digital operations in Government. Designing accessible and inclusive digital services is at the heart of everything we do and our vision is to ensure that the way we work is fair and inclusive of all. We understand that digital accessibility is more than putting things online, it’s about creating inclusive support models that support users and creating formats that fulfil the needs of our diverse users."
        },
        {
            "heading": 2,
            "text": "Could it be you?"
        },
        {
            "text": "If you are passionate about helping us make HMRC a leader in digital accessibility and inclusion, check out our vacancy for a Product Manager - Accessibility Lead role in the Digital Inclusion and Accessibility Standards team. Work with us to provide inclusive, accessible and usable services and tools to all our users, both external and internal."
        },
        {
            "text": "As a Product Manager - Accessibility Lead, you will have the unique opportunity to work on some of the largest digital transformation programmes undertaken in Government and other sectors.  You will be responsible for leading the accessibility auditing and assurance capability, working with a range of stakeholders from our product, portfolio, platform and delivery teams."
        },
        {
            "text": " "
        }
    ]
}