{
    "url": "https://aphascience.blog.gov.uk/2021/08/20/mosquitos/",
    "title": "APHA's work on viruses spread by mosquitos",
    "authors": [
        "Luis Hernandez-Triana",
        "Suzanna Bell"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2021-08-20T08:00:02+01:00",
    "content": [
        {
            "text": "Friday 20th August is World Mosquito Day which is observed annually to mark the 1897 British discovery that female mosquitoes can transmit the malaria parasite to humans. In this blog, we hear from Drs. Luis Hernandez-Triana and Suzanna Bell, APHA Discipline Champions and experts in the field of vector borne diseases, as they tell us more about APHA’s work on this specialist area."
        },
        {
            "text": "Vector borne diseases (VBD) are infections transmitted by arthropods, such as mosquitos and ticks, which are on the rise as a result of climate change, globalisation and new introductions of invasive species."
        },
        {
            "text": "APHA has several Discipline Champions, who are specialists in their areas of expertise and at the forefront of animal science, responding to the growing challenges of rapid disease and pest control and outbreaks. They are responsible for developing a strategy that expands and further develops the breadth of skills, testing capability and knowledge within the Agency. This is particularly important for our response to the threat of VBDs of livestock and plants, and our aim to build collaborations with other government and non-government institutions in this important area. As such, we are exploring techniques of vector borne disease detection and surveillance using advanced technology and applying these to support disease monitoring and risk analysis in the UK."
        },
        {
            "heading": 3,
            "text": "West Nile virus"
        },
        {
            "text": "APHA has conducted surveillance for mosquito-borne viruses in birds within the UK for over 15 years with a particular focus on West Nile virus (WNV), a notifiable disease of horses whereby they are infected with the virus from mosquitos who have picked up the virus from birds. APHA is the UK National Reference Laboratory (main testing and advice centre) for mosquito-borne viruses such as WNV and Rift Valley fever virus."
        },
        {
            "text": "If a human is bitten by a mosquito carrying WNV, most people do not experience any symptoms and the infection usually goes away without treatment. Infected horses often do not display any clinical signs; however, some may become uncoordinated, listless, have facial paralysis or find it difficult to stand. In severe cases, WNV can cause death in infected horses."
        },
        {
            "text": "WNV is not present in the UK and is officially-free of WNV. The virus, however, has been spreading throughout Europe in recent years, where it circulates with Usutu and Sindbis virus, highlighting the importance of surveillance to detect cases."
        },
        {
            "heading": 3,
            "text": "Our insectaries"
        },
        {
            "text": "Insectaries to hold mosquitoes were established at APHA in 2014 to study the interactions between the vector and the pathogens. In addition, we have a special high containment insectary housing invasive mosquito species (which could act as potential vectors of pathogens zoonotic for animals and humans) such as Aedes albopictus, Ae. aegypti and Culex quinquefasciatus, allowing APHA scientists to undertake vital research on these particular mosquitos in a safe environment."
        },
        {
            "text": "These specialist laboratories have allowed us to undertake numerous experiments to study the capacity of mosquitoes to transmit several emergent or re-emergent pathogens such as such as Usutu and Zika virus and others which cause diseases such as bovine ephemeral fever, Japanese Encephalitis and Rift Valley fever at temperatures representative for the UK summers."
        },
        {
            "heading": 3,
            "text": "Surveillance"
        },
        {
            "text": "An important component of our VBD work is surveillance. APHA has conducted surveillance for mosquito-borne viruses in wild birds within GB for over 15 years. This is a team effort involving APHA’s regional veterinary laboratories and other organisations such as Public Health England (PHE) and the Zoological Society of London (ZSL)."
        },
        {
            "text": "A recent example of effective VBD surveillance came in 2020 at which time mosquito-borne viruses had not been recorded in the UK. Usutu virus was detected by APHA in wild bird samples received from ZSL in the summer of 2020, leading to successful virus isolation and genetic characterisation."
        },
        {
            "text": "Although Usutu virus is less virulent in humans and horses, it can cause a lethal disease in certain species of birds, particularly blackbirds."
        },
        {
            "text": "A risk assessment was conducted by the Human Animal Infections Risk Surveillance (HAIRS) group, a cross-departmental body of which APHA is a key member, on the potential risk of Usutu in the UK. The risk assessment concluded that the risk to humans is low and is not believed to be a threat to poultry in the UK."
        },
        {
            "heading": 3,
            "text": "Molecular techniques in VBD research"
        },
        {
            "text": "The application of molecular techniques for vector characterisation, such as DNA barcoding, have been established at APHA. This approach has been used for determining host vertebrate DNA within vector bloodmeals and the detection of genetic diversity in arthropods (mosquitoes, blackflies, sandflies, ticks). It has also been used for species identification of exotic ticks."
        },
        {
            "text": "The Arbovirus Group works closely with scientists in the Virology and Pathology Departments at APHA, and collaboratively with teams at The Pirbright Institute and PHE on novel immunochemistry approaches for arbovirus detection and the use of electron microscopy for the visualisation of ticks and mosquitoes."
        },
        {
            "heading": 3,
            "text": "International collaboration"
        },
        {
            "text": "Numerous scientific collaborations have been established with a view to broaden our research capability in this specialist area. Partnerships have been established with the University of Zaragoza and the Centre of Rickettsiosis and Arthropod-Borne Diseases, Logroño (Spain), the Biodiversity Institute of Ontario (Canada) and Centre for Biogenomics (Mexico) to name but a few."
        },
        {
            "text": "These partnerships have been very productive and molecular protocols for increasing testing capacity have been shared between institutions. A highlight is the recent application of an integrated approach for untangling the host-pathogen-vector interactions in sylvan communities in Mexico."
        },
        {
            "text": "Partnerships were also established between APHA and collaborators from Denmark, France, the Netherlands and Sweden on the development of isothermal amplification methods for diagnosis of arthropod-borne diseases of livestock importance. The research led to the establishment of this rapid method to detect African Swine Fever, Bovine Ephemeral Fever, Japanese Encephalitis, Louping Ill, Tick-Borne Disease, Usutu and West Nile. This leaves APHA uniquely placed to rapidly detect important diseases of livestock and wildlife enabling rapid action to manage outbreaks."
        },
        {
            "heading": 3,
            "text": "Looking Ahead"
        },
        {
            "text": "Although working during COVID-19 restrictions has been challenging, it has still been a busy year for us as the APHA Vector Borne Disease Discipline Champions. We are pleased to see the numerous achievements in terms of scientific outputs and public outreach that have been accomplished already."
        },
        {
            "text": "Looking ahead, we will work hard to continually develop the discipline by development of knowledge networks and contacts within APHA and other government and non-government organisations at national and international levels. APHA is helping to lead research and surveillance in this area and continues to contribute to APHA’s aim to safeguard animal (and plant health) for the benefit of people, the environment and the economy."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "You may be interested in reading some of our other related blogs and research papers:"
        }
    ]
}