{
    "url": "https://phescreening.blog.gov.uk/2021/08/20/when-blood-spot-sample-takers-need-to-begin-offering-scid-screening/",
    "title": "When blood spot sample takers need to begin offering SCID screening",
    "authors": [
        "Andrew Anderson",
        "Liz Robinson"
    ],
    "categories": [
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2021-08-20T09:49:13+01:00",
    "content": [
        {
            "text": "We published an article last week to launch parent and professional resources to support the evaluation of screening for severe combined immunodeficiency (SCID) in England."
        },
        {
            "text": "The evaluation, due to launch on 6 September 2021, will help to determine whether screening for SCID works in practice as part of the NHS Newborn Blood Spot (NBS) Screening Programme. Testing for SCID uses the same blood spot as the other 9 NBS conditions. No extra blood spots are needed."
        },
        {
            "text": "The evaluation will initially run for 2 years, covering around two-thirds of the newborn population of England. It will continue to run in a third year while the results are used to make a recommendation on whether or not it should be implemented nationally."
        },
        {
            "text": "This article is written for blood spot takers to support them in offering parents and carers SCID screening as part of the evaluation. Crucially, it is about the dates these conversations need to begin."
        },
        {
            "heading": 2,
            "text": "Start date for conversations"
        },
        {
            "text": "Blood spot takers will hopefully have the date of 6 September 2021 fixed in their minds as the start date when laboratories involved in the SCID screening evaluation will start testing samples for SCID."
        },
        {
            "text": "Parents in SCID screening areas need to be told that there is a slight chance that if their baby’s sample is taken from 27 August 2021 that it may be tested for SCID in addition to the other 9 NBS conditions."
        },
        {
            "text": "Most will not because the sample will reach the laboratory before 6 September 2021. But inevitably some samples will be delayed in transit, which means they could arrive in the laboratory on, or after, the 6 September 2021 and therefore will be tested for SCID. This is why we’re asking blood spot sample takers to make sure that parents and carers are aware when taking consent from 27 August 2021."
        },
        {
            "heading": 2,
            "text": "Don’t delay"
        },
        {
            "text": "Newborn blood spot samples should continue to be taken 5 days after the baby is born in accordance with national NBS sampling guidelines. Samples should not be delayed for SCID screening to start. This is because some of the 9 other conditions are time critical to detect, and need early treatment."
        },
        {
            "heading": 2,
            "text": "Resources for blood spot takers"
        },
        {
            "text": "Health professionals making the offer of SCID screening to parents and carers can now access SCID screening resources to support the evaluation."
        },
        {
            "heading": 3,
            "text": "e-learning"
        },
        {
            "text": "Blood spot takers who offer SCID screening to parents and carers can now access the new SCID e-learning module. The training resource helps health professionals to understand more about the condition and what information and support is available to parents who are offered SCID screening for their babies."
        },
        {
            "heading": 3,
            "text": "Crib sheet"
        },
        {
            "text": "We’ve also produced a handy crib sheet to support conversations with carers or parents. Most blood spot takers will access it digitally, but it can also be printed out locally. Small quantities are orderable from the PHE Screening print ordering portal (search for ‘SCID02’)."
        },
        {
            "heading": 3,
            "text": "SCID information leaflet"
        },
        {
            "text": "The new parent information on SCID should be provided alongside Screening tests for you and your baby (STFYAYB) as appropriate. It has been provided ahead of the evaluation start date so that health professionals can familiarise themselves with the information."
        },
        {
            "heading": 2,
            "text": "Repeat samples"
        },
        {
            "text": "It is important for blood spot takers to record repeat blood spot samples as ‘repeats’ on the blood spot card."
        },
        {
            "text": "Accurately recording ‘repeats’ for babies screened for SCID is especially important because it helps laboratories to track those babies whose parents have moved and whose sample needs testing for SCID."
        },
        {
            "text": "If possible, please also record where the first blood sample was taken."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}