{
    "url": "https://environmentagency.blog.gov.uk/2022/06/24/15-years-of-technological-advances-since-the-2007-floods/",
    "title": "15 years of technological advances since the 2007 floods",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2022-06-24T09:07:06+00:00",
    "content": [
        {
            "text": "June and July 2007. The most severe and widespread inland flooding we have seen since 1947 with more than 55,000 properties flooded, mainly across Yorkshire, the Midlands, Gloucestershire, Herefordshire, Worcestershire, Oxfordshire and Berkshire. Many more lost essential services such as water, electricity and telecommunications. The Ulley reservoir dam near Rotherham in South Yorkshire experienced significant damage leading to evacuations and closure of the M1. Further south and a month later, the M5 was also closed with hundreds stranded in their vehicles overnight. Around 7000 people were rescued from the floods and sadly 13 lives were lost. The damage was estimated at £3bn."
        },
        {
            "text": "The summer 2007 floods were produced by an unusual set of weather conditions, leading to some of the highest levels ever recorded on major rivers such as the River Severn. The unusual conditions also created widespread ‘surface water flooding’ (or pluvial flooding), where water runs overland and along roads before reaching sewers and watercourses, on a scale never seen before. Sir Michael Pitt was commissioned by Government to produce a lessons learned report in 2008 recognising that whilst unprecedented, “the probability of events happening on a similar scale happening in the future is increasing”. His recommendations were based on the principle that we must “start with the needs of those individuals and communities who have suffered flooding or are at risk” … and …. “must make a real difference on the ground improving the quality of people’s lives”. Many of the recommendations focused on the need for scientific and technological improvements to our mapping, forecasting and warning to ensure we were ready to respond to the new challenge of surface water as well as river and coastal flooding."
        },
        {
            "text": "Later that year we had already put in place one of the most far-reaching recommendations, an initial map that helped identify the areas that are at risk of surface water flooding. This was replaced by more up to date mapping in 2010 and 2013 using better data and modelling, working with local authorities and water companies. The Risk of Flooding from Surface Water Flooding map now forms the basis of emergency planning and response to this type of flood, and many spatial planning decisions. We believe this map to be the first national map of its type in the world available to the public and it is now available as Open Data."
        },
        {
            "text": "We have needed to keep pace with the socio-technological revolution. We have seen a step change in our ability to warn people and we now have over 1.6 million users registered on our flood warning service, many of them automatically registered due to a change in legislation as a result of the Pitt review. We now offer warnings by voice call, text and email. And our award-winning Check for Flooding service allows those who aren’t registered to easily access the same information, together with information on rainfall, and river, sea and groundwater levels on any web enabled device. Behind the scenes, our modelling, forecasting and warning systems powering these services are now some of the most advanced in the world, able to assess the risks to defence structures and model overtopping, and we collaborate internationally to share our learning. And our information has become more visual, with increased access to satellite imagery, shared photography and drone footage."
        },
        {
            "text": "Although we have come so far, we continue striving to do better to minimise the devastating impact of flooding. We’re working with Government to share our expertise as they look to bring ‘emergency alerts’ to this country.  And we continue to work with our users to understand how we can make our forecasts and warnings more helpful to inspire action to minimise future impacts when the storms seen in 2007 inevitably come again."
        }
    ]
}