{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/06/24/pride-month-and-social-works-essential-role/",
    "title": "Pride Month and social work's essential role",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Events",
        "LGBTQ+"
    ],
    "pub_date": "2022-06-24T09:49:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Supporting the right to be ourselves"
        },
        {
            "text": "As a lesbian, I always enjoy the visibility that Pride Month brings to those of us who are LGBTQ+ and the support it provides for our communities, families, friends and networks."
        },
        {
            "text": "As a social worker, it reminds me how vital it is for social work practice to protect and promote the human rights of everyone, including LGBTQ+ people. In essence, this means supporting their right to be who they truly are, to feel safe and be treated equally."
        },
        {
            "text": "This still hugely matters, even in these more enlightened times. Many LGBTQ+ people continue to face pervasive discrimination, experience abuse or are subject to neglect throughout their lives. In the 21st Century, let alone the many thousands of years of human civilisation which came before it, no one should feel unable to be open about their identity and what matters to them."
        },
        {
            "text": "The COVID-19 pandemic exacerbated these pre-existing issues of course and brought new challenges for LGBTQ+ people to overcome. Many of us have experienced disrupted social connections, difficulties communicating with partners, family and others and a consequential increase in anxiety and uncertainty."
        },
        {
            "heading": 2,
            "text": "Awareness, acceptance, celebration"
        },
        {
            "text": "For LGBTQ+ people with care and support needs, our profession uses relational practice to support them to connect with their feelings and achieve better physical and mental wellbeing. Part of that involves re-establishing societal connections – an adjustment we are all still making, even as life returns to something approaching normal."
        },
        {
            "text": "These strengths based relational approaches are designed to help LGBTQ+ people safely integrate with their communities and achieve citizenship outcomes which matter to them and to all of us. This is an important point: awareness, acceptance and celebration of our diverse communities makes everyone happier. Pride Month, in this respect, is a much a celebration of inclusion as it is diversity and difference. It is wonderful to be human."
        },
        {
            "text": "Happy Pride everyone."
        }
    ]
}