{
    "url": "https://educationhub.blog.gov.uk/2022/06/24/what-the-schools-bill-means-for-academies/",
    "title": "What the Schools Bill means for academies",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Academies",
        "Schools"
    ],
    "pub_date": "2022-06-24T14:45:08+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Academies are a key part of the school system. They are schools that are Government funded but not controlled by local authorities (councils)."
        },
        {
            "text": "Standalone academies benefit from significant autonomy over how they work while multi-academy trusts are groups of academies that share management and other things."
        },
        {
            "text": "We want schools to be in strong multi-academy trusts because they can bring benefits to the schools they run and therefore children, particularly the most disadvantaged. You can find out more about academies and multi-academy trusts here."
        },
        {
            "text": "The Schools Bill is a piece of legislation going through Parliament at the moment that will help us to raise education standards across the country – you can read more about it here."
        },
        {
            "text": "One of the key things it will do is help to support more schools to join multi-academy trusts and strengthen the system so that parents and schools themselves can better understand the standards expected of academies."
        },
        {
            "text": "Here we answer your questions on what the plans mean for academies and multi-academy trusts and dispel some of the myths we’ve seen circulating on social media and in the press."
        },
        {
            "heading": 3,
            "text": "What will the Schools Bill change as far as academies and multi-academy trusts are concerned? "
        },
        {
            "text": "The current regulatory framework is not fit for a multi-academy trust led system – as the Secretary of State said in his recent speech, ‘the current system is in many ways, held together by rubber bands’."
        },
        {
            "text": "What that means is that the system for regulating trusts hasn’t kept pace with the expansion of the academy system. Every academy has a contract with the Department known as a ‘funding agreement’ – it outlines a set of requirements which academies must follow in order to carry on receiving Government funding.  This means the rules individual academies are bound by are dependent on the terms of their funding agreements at the time they are set up. Because of this, there’s a mixed picture in terms of the rules academies have to follow."
        },
        {
            "text": "That’s why the Schools Bill will bring trust regulation onto a legal footing. It lays the regulatory foundations for moving to a common rulebook, ensuring that the same set of minimum standards can be consistently applied to all academy trusts."
        },
        {
            "text": "This will make it easier for parents and pupils to know and understand what they should expect from their school."
        },
        {
            "heading": 3,
            "text": "Will this take powers and independence away from academies? "
        },
        {
            "text": "One of the key benefits of the academy system is that it empowers teachers and leaders to improve outcomes for pupils by giving them the freedom to make key decisions."
        },
        {
            "text": "The Schools Bill will not take independence from schools or trusts and is not about the Department for Education micro-managing how school and trust leaders run their schools and trusts."
        },
        {
            "text": "We’ve seen misleading posts on social media that suggest the Department wants to dictate academies’ curriculums or even set their hours and terms times, teacher salaries and more."
        },
        {
            "text": "We have no intention of undermining any of the fundamental freedoms academies enjoy."
        },
        {
            "text": "This is about providing clarity and consistency across the sector so the same standards in terms of things like safeguarding and financial management apply across all academies. It means that parents can be clear as to what standards they can expect form their child’s school."
        },
        {
            "text": "Over time should there be any further changes to regulatory requirements, we will always consult with the sector so they have the opportunity to provide views."
        }
    ]
}