{
    "url": "https://prisonjobs.blog.gov.uk/2023/10/17/a-prison-officer-with-a-purpose/",
    "title": "A prison officer with a purpose",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Black History Month",
        "Culture",
        "Personal stories",
        "Prison officer"
    ],
    "pub_date": "2023-10-17T12:57:07+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Growing up as an ethnic minority from a deprived neighbourhood, Leroy didn’t see a place for himself in today’s society. That was until he joined the Prison Service. As a prison officer, Leroy feels he now has a purpose - every day, when he puts on his uniform, he's representing and influencing positive change."
        },
        {
            "text": "Prison officer, Leroy, is part of the furniture now at HMP Leyhill, guiding hundreds of prisoners through their day-to-day life at the category D prison in Gloucestershire. But Leroy admits his life could easily have gone another way. His mother spent time in prison, and he was raised by his grandmother. With his parents absent, Leroy struggled with authority before becoming a bouncer in a Bristol nightclub and then working in the custody suite at Bristol Crown Court."
        },
        {
            "text": "He then moved into the Prison Service two-and-a-half-years ago, becoming the latest person to step into an extraordinary job. These roles – and the people who fulfil them – are at the heart of a new national Ministry of Justice (MoJ) recruitment drive this autumn."
        },
        {
            "text": "Leroy knows he makes an impact every day and is looking forward to a long and varied career."
        },
        {
            "text": "“I don't have a degree – but I feel like I make a difference every day."
        },
        {
            "text": "“I feel proud when I put that uniform on,” he says. “Most of my family have criminal records, with some spending time in prison for violent offences and substance misuse. Growing up that was the reality of my life."
        },
        {
            "text": "“For a long time I was angry at the system, but the job allows me to understand why decisions were made, and I can have peace with my childhood. I am able to understand why members of my family couldn’t come home now."
        },
        {
            "text": "“I want to help prisoners stop reoffending so someone else doesn't have to go through what I did. I see the different agencies and wellbeing teams who are supporting prisoners and I am part of that.”"
        },
        {
            "text": "An extraordinary job"
        },
        {
            "text": "Working within prison or probation is not your average job. From putting out cell fires to helping improve the literacy of prisoners, taking the time to listen or rehabilitating some of the hardest-to-reach members of society, the everyday of this job is extraordinary."
        },
        {
            "text": "No two shifts are the same. Officers have to make on-the-spot and effective decisions to keep themselves and those around them safe and be able to:"
        },
        {
            "text": "Leroy says his background helps him connect with prisoners and build a positive rapport – and he has even had to escort old classmates from prison to court."
        },
        {
            "text": "“I bring a sense of calm,” he says. “I am 6ft 4ins tall and a large build and people might think ‘here comes the muscle’ but you can talk down any conflict situation. I believe that."
        },
        {
            "text": "“When I first started I saw someone I knew inside and I thought ‘I don’t know if I can do this’ but the way I deal with it is by knowing that when they are in my care, I’m professional and they are getting what they are entitled to. There is nothing for them to complain about. Having different types of people in our care it’s important for me to offer a different perspective which allows me to play a vital role in my team."
        },
        {
            "text": "“I wasn’t the best behaved at school and I didn’t have a positive outlook. But I grew up when I became a bouncer and worked in court, I had to liaise with the police and realised some of my opinions were down to my behaviour. I see people in prison saying the same things I thought when I was younger. My mentality was similar."
        },
        {
            "text": "“My family and friends weren’t sure about me becoming a prison officer but when they saw I was the same Leroy and didn’t change because of my job, it took the negatives away."
        },
        {
            "text": "“Prisoners may think staff are robots but with me they know I’m real. It’s not a golden ticket to problem free prisons but it’s part of the puzzle.”"
        },
        {
            "text": "Someone like you."
        },
        {
            "text": "Leroy says there is no typical day on the job – and there’s also no such thing as a typical prison officer. They come from different walks of life, just like the offenders they work with, to form one team in the Prison Service."
        },
        {
            "text": "With no specific qualifications required to become a prison officer, the most important qualities are being able to communicate and be team players."
        },
        {
            "text": "“You need a high work rate and be willing to chip in with different tasks,” Leroy says."
        },
        {
            "text": "“You need to have perseverance and a can-do attitude. I have matured in the job and I feel like I am manager material now.\n"
        },
        {
            "text": "\"Alongside that there are so many different roles to work towards as the opportunities to progress are endless.\""
        }
    ]
}