{
    "url": "https://earlyyears.blog.gov.uk/2023/10/17/calling-all-early-years-applicants/",
    "title": "Calling all early years applicants",
    "authors": [
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Childminder registration",
        "Early years",
        "Nannies"
    ],
    "pub_date": "2023-10-17T14:48:35+01:00",
    "content": [
        {
            "text": "Once you have submitted your application to register with Ofsted, we will give you a call to discuss your application. At this stage we want to make sure everything you have included in your form is correct, to avoid any unnecessary delays later. If you are not available, we will follow up via email with questions about your application and it is important that you respond quickly."
        },
        {
            "text": "If you are thinking of applying to register with Ofsted, here are a few things that we think you should know. They are common things we have found during the first month of telephone calls to applicants."
        },
        {
            "text": "Things to double check before submitting your application: "
        },
        {
            "text": "For childminders and childcare on domestic premises, we need to check everyone over 16 who lives or works on the premises."
        },
        {
            "text": "If we find out about additional people in the home after your application has been submitted, this will cause delays and may lead to us refusing your application. It is our legal duty to complete these checks."
        },
        {
            "text": "If your children live with you and are turning 16 during the process, they will also need to complete an ‘Add Association form’ to be added to the application once they turn 16 and have appropriate ID to complete their DBS application."
        },
        {
            "text": "Sometimes, childminders and daycare applicants have building work being carried out. This must be completed before we can visit and carry out a review of your premises. Premises from which you plan to provide care should be ready immediately following the registration visit."
        },
        {
            "text": "Most providers register on the early years register and on both the compulsory and voluntary parts of the childcare register. But it is completely up to you what type of childcare you want to provide and the ages of children you want to care for. There is information about the different registers and types of providers in our childcare manual."
        },
        {
            "text": "Some organisations may decide to provide childcare as part of their organisational set up but where it is not their main operational function."
        },
        {
            "text": "For example, a hospital that wants to provide an on-site daycare for their staff would not count childcare as their ‘prime purpose’. In this case, the organisation linked to the hospital is accountable for the registration of the daycare. The most senior person in the organisation with direct responsibility for childcare in the hospital must apply, but no other directors or committee members need to be listed on a registration."
        },
        {
            "text": "However, if your organisation’s ‘prime purpose’ is childcare, you should read our guidance about which individuals must complete a form depending on the type of legal entity."
        },
        {
            "text": "Closer to your visit date, an inspector will be in touch to arrange the details and explain what will happen. We will keep you updated with the progress of your application along the way."
        },
        {
            "text": "We are always looking for ways to improve how we engage with the public. We have already received positive feedback on changes we implemented from some of your ideas. We will continue to learn from trends we spot through these calls with applicants to provide an effective and high-quality service. We also have a registration survey for applicants to give you a further chance to tell us what we did well and what we could do better."
        },
        {
            "text": "Additional resources"
        },
        {
            "text": "For more information, you can read our full guidance on what to expect during the application review stage."
        },
        {
            "text": "We’ve also published two blogs over the past few months about the work we have been doing to speed up the registration process for applicants. The most recent blog covered the outcome of our pilot registration programme and how we are now rolling out the changes to all early years applicants looking to register with Ofsted."
        }
    ]
}