{
    "url": "https://defradigital.blog.gov.uk/2023/10/17/how-resources-and-waste-are-using-a-research-panel-to-engage-with-users/",
    "title": "How resources and waste are using a research panel to engage with users",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "User centred design",
        "User research"
    ],
    "pub_date": "2023-10-17T14:00:16+01:00",
    "content": [
        {
            "text": "In Recycle Week, Jason Stockwell reflects on the user research process taking place under the Extended Producer Responsibility (EPR) scheme for packaging, which will see packaging producers paying the full cost of disposing of packaging waste, money which in turn will be granted to local authorities to cover recycling and disposal costs."
        },
        {
            "text": "We’ve been talking about panels on programmes for a while now; I’ve written two blogs previously, one about how to use research panels, and a two-parter exploring why research panels are important. And my colleague Will wrote more recently about how being customer-centric is helping us to design the new service for packaging producers."
        },
        {
            "text": "We recently noticed something significant about our panel; that engagement was decreasing. We were in a lucky position where 1 in 5 participants would get involved in research, this changed to 1 in 15. Was there one reason for this? Not quite."
        },
        {
            "text": "Participants told us that they would speak to us in research sessions and then have no idea where that research went. So they were contributing, but not seeing the results of that. And we get that, it’s hard to see change, especially with such long-term objectives and timelines that keep shifting; being on a user research panel is frustrating if you can’t see what your work is contributing to."
        },
        {
            "text": "Our team got together to understand the participant experience. Service design, but for participants getting involved in research. Here are the elements we’re currently doing, and what we’ve implemented as a result of this work!"
        },
        {
            "heading": 2,
            "text": "How people discover the panel"
        },
        {
            "text": "We weight a lot of our time to this front end of participant recruitment. Getting more people involved that haven’t been involved before. We would reach out to trade associations, message people on LinkedIn and find lists, or the top 50 coffee roasters in the UK to reach out to, but how did we know what was effective?"
        },
        {
            "text": "If we don’t know what’s working how do we know where to spend time?"
        },
        {
            "text": "We needed better attribution of where participants came from and how they ended up on the panel, not only to track sources but to know where we could spend time better."
        },
        {
            "heading": 2,
            "text": "Updates through the panel"
        },
        {
            "text": "We reviewed the participant journey, from getting involved in a user research session through to joining and exiting and panel, and without engagements from the programme, they don’t know what they are getting involved in."
        },
        {
            "text": "Now, the panel snippets get updates on recent research rounds and the upcoming related sessions that might be relevant to them so they can contribute."
        },
        {
            "text": "This typically looks like a research review “you said, we did” piece. It doesn’t need to be a big update, but it’s worth letting people know what user research is, what the panel does and what people have signed up to. It’s also a social proofing exercise so you feel like part of something bigger about changes in resources and waste."
        },
        {
            "heading": 2,
            "text": "Sharing insights from the user research"
        },
        {
            "text": "The team are really good at sharing insights from research amongst themselves, we’re getting better at sharing insights at a programme level. Where we fall short is sharing insights from user research to the participants themselves."
        },
        {
            "text": "It’s not a secret what we’re trying to do here; the work on EPR is very public and the industry know they can approach Defra about getting involved."
        },
        {
            "text": "The team have great long-term ideas about inviting participants to playbacks from the latest round of UR and having 1-2-1 feedback sessions to see how we can improve on sessions. We started with user research feedback in its most simple form. Reaching out to the participants that took part, thanking them for contributing and showing how their work has made a difference to the digital system we are building."
        },
        {
            "heading": 2,
            "text": "Spreadsheets of engagement"
        },
        {
            "text": "Most user researchers on the programme already have a sheet of demographics of the participants they have interacted with, we track on the panel every interaction, reaching out to participants, where they came from, what research they have done in the past and what research they are interested in."
        },
        {
            "text": "So, we know what feedback they are also interested in, and can give them updates based on their past involvement."
        },
        {
            "text": "We also know what gaps we have, and we can be transparent about that, enabling us to source more participants to get involved in some of those areas. Small producers, packaging importers and skip companies are all seldom heard from, and we know where we can find some of these participants, but using this community also supports with developing those lesser-known areas."
        }
    ]
}