{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/10/06/autumn-vaccinations-and-the-role-of-social-work/",
    "title": "Autumn vaccinations and the role of social work",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Communities",
        "Coronavirus",
        "Society"
    ],
    "pub_date": "2022-10-06T14:41:16+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our support continues and always will"
        },
        {
            "text": "Social workers are frequently misrepresented, in some areas of the media, as removers of liberty, curtailers of freedoms and, like bailiffs, only there to take something away."
        },
        {
            "text": "Our purpose and determination is to do exactly the opposite and, most of the time, we succeed, always with the person’s best interests at heart. During the darkest days of lockdown, we adapted our practice to help keep individuals, families and communities connected, supported and safe."
        },
        {
            "text": "At its best, social work supports people to cope with difficult circumstances, drawing on their own strengths and assets, as we work alongside them to create and sustain better, happier lives."
        },
        {
            "text": "Lockdowns may have ended but out duty of care goes on - and that includes encouraging colleagues and those we serve to make sure they remain fully vaccinated against COVID-19 and a potentially resurgent flu virus."
        },
        {
            "text": "Although winter infections, like flu, have not been as severe in the last couple of years, Australia and other territories have recently been experiencing spikes in cases and increases in the prevalence of severe illness."
        },
        {
            "heading": 2,
            "text": "Risks remain"
        },
        {
            "text": "Having just returned from visiting family in Australia, I was able to see the impact flu has had on people and the health and care staff supporting them. There are wider systemic challenges too, as services strive to keep going for those in need. These increasing pressures are perhaps not surprising. As society reopens, with the exception of clinical and care settings, there are no restrictions on movement in public or private spaces."
        },
        {
            "text": "Given that we work with older adults and those living with dementia, learning disabilities, autism, mental ill health and other cognitive issues, we have an important role in reassuring those who are anxious or possibly unsure about the continuing necessity of vaccinations."
        },
        {
            "text": "For some, it will understandably seem counterintuitive, when they look around and see a world which has largely returned to normal. The reality is more nuanced of course. Risks remain and we must continue to help individuals and families navigate around them."
        },
        {
            "text": "I would also add, our duty of care extends to colleagues and others with whom we interact on a professional basis. Keeping ourselves fit and healthy is as important as our efforts to do the same for others."
        },
        {
            "heading": 2,
            "text": "Vaccination for the nation"
        },
        {
            "text": "I therefore urge you to encourage all you care for – and work with – to book COVID-19 booster and flu vaccinations without delay, if they are eligible. To assist the unsure or undecided, you can also make full use of these free campaign materials. These resources include advice, guidance and answers to frequently asked questions."
        },
        {
            "text": "Those of you who are social workers in adult social care know, as well as I, we are here to make life less complicated and give those we serve the space and time to make clear, positive and well informed decisions. Clearing the obstacles to getting safely vaccinated is just one way we can help our communities – and our amazing health and care colleagues – have a safe, secure and healthy winter."
        }
    ]
}