{
    "url": "https://insolvencyservice.blog.gov.uk/2022/10/06/celebrating-customer-service-at-the-insolvency-service/",
    "title": "Celebrating customer service at the Insolvency Service",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "customer service"
    ],
    "pub_date": "2022-10-06T13:44:54+00:00",
    "content": [
        {
            "text": "This week is National Customer Service Week, a week-long campaign to raise awareness of customer service and the vital role it plays in successful business practice and the growth of the UK economy."
        },
        {
            "text": "Organised by the Institute of Customer Service, National Customer Service Week provided the Insolvency Service an excellent opportunity to reflect on how we serve our customers, recognise our achievements, and show our commitment to excellent customer service."
        },
        {
            "heading": 2,
            "text": "Delivering the right help at the right time"
        },
        {
            "text": "Each day of this year’s National Customer Service Week has a theme, covering human-tech interface; service with respect; professionalisation of service; effective strategy and leadership; and recognition"
        },
        {
            "text": "The Insolvency Service produced a daily blog throughout National Customer Service Week, sharing with colleagues about how we’re delivering against each of the themes or where there are areas for improvement."
        },
        {
            "text": "We also sat down with Ashleigh Finnigan, the Insolvency Service’s Customer Services Operational Delivery Lead, to get Ashleigh’s thoughts about what excellent customer services means to the agency."
        },
        {
            "text": "The customer service team is the first point of contact for many of the agency’s customers across a wide range of channels, including telephone, email, and online."
        },
        {
            "text": "“We are right on the front-line and often the first people in the agency our customers speak to,” said Ashleigh. “So, to put it simply: our primary aim is to provide an exemplary service to all our customers."
        },
        {
            "text": "“Excellent customer service means providing the right help and support to our customers at the right time, while meeting our customers’ expectations."
        },
        {
            "text": "“We want to keep our customers at the heart of everything we do and provide a service our customers can not only trust but helps relieve some of the pressures they are going through.”"
        },
        {
            "heading": 2,
            "text": "Providing an exemplary service for our customers "
        },
        {
            "text": "The Insolvency Service recognises that it is of fundamental importance that where possible, our customers can easily access guidance and resources, and receive all the information and support they need with as minimal interactions as possible."
        },
        {
            "text": "Ashleigh said that the agency is often contacted by people who are unfortunately facing financial difficulties, whether they have been made redundant and looking to make claims for payments or struggling to pay their debts."
        },
        {
            "text": "“Our role in customer services is to ensure we guide them efficiently through our processes,” said Ashleigh."
        },
        {
            "text": "“It’s important that we break down the barriers for our customers to ensure they receive the right support they are entitled to. The work the customer service team does plays a key role in supporting a wide range of vulnerable customers and we take enormous pride in being able to support everyone we speak to.”"
        },
        {
            "heading": 2,
            "text": "Continuous improvement – at the heart of everything we do"
        },
        {
            "text": "And the Insolvency Service recognises that delivering excellent customer services is constantly evolving. New situations arise, customer demographics change, and the agency must be agile to respond so that our customers are always supported."
        },
        {
            "text": "“Continuous improvement is at the heart of everything we do,” said Ashleigh. “We continually work on improving our practices and improve accessibility to make it as easy as possible for customers to contact us.”"
        },
        {
            "text": "Over the past 12 months the Insolvency Service has introduced new innovations that enable the agency to capture all the information it needs from customers to progress their queries and prevent delays."
        },
        {
            "text": "During National Customer Service Week the Insolvency Service launched the ‘Amend a redundancy claim: holiday pay accrued’ form'."
        },
        {
            "text": "“The new online form will allow people, who have previously made a claim for redundancy pay, to easily provide updated information regarding their applications using an online form,” said Ashleigh. “No longer will our customers have to download and submit a word document or call the Insolvency Service’s helpline."
        },
        {
            "text": "“The new form will also make the process much simpler for customers and the updated information will go directly to the right team, reducing the turn-around time for it to be actioned."
        },
        {
            "text": "“The new holiday claim accrued amendment form is the first form to be developed with Government Digital Service using the new GOV.UK Forms – something we’re extremely proud to be at the forefront of excellent customer service delivered by government.”"
        },
        {
            "text": "Ashleigh added: “We continually review our guidance on GOV.UK to ensure it's accessible and can be easily understood by as many people as possible. Our customers also provided constructive feedback and we use this insight to make further changes to our customer services that we hope everyone will benefit from.”"
        },
        {
            "text": "Our customers also have a role to play in helping the agency provide excellent customer services. The next time you contact one of the team, please include your reference number so we can quickly identify you or provide up-to-date contact details."
        },
        {
            "heading": 2,
            "text": "Further information"
        }
    ]
}