{
    "url": "https://digitaltrade.blog.gov.uk/2022/10/06/darlington-economic-campus-join-a-cross-government-community/",
    "title": "Darlington Economic Campus: join a cross-government community",
    "authors": [
        "Kathy Gribbin, Project Support Officer",
        "Elaine Roberts, Project Support Officer"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-10-06T12:00:27+01:00",
    "content": [
        {
            "heading": 2,
            "text": "A cross-government community "
        },
        {
            "text": "In March 2021 the then Chancellor of the Exchequer, Rishi Sunak, announced the creation of a new economic hub in Darlington. Just over one year later in July 2022, we celebrated the 100th person joining the DIT team in the Darlington Economic Campus (DEC).  "
        },
        {
            "text": "Several departments make up DEC, including the Department for International Trade (DIT), HM Treasury, Department for Levelling Up, Housing and Communities (DLUHC), Office for National Statistics (ONS), Department for Business, Energy & Industrial Strategy (BEIS), Department for Culture, Media and Sport (DCMS) and the Competition and Markets Authority (CMA). The Department for Education (DfE) is included in DEC, however it is currently housed in a different building."
        },
        {
            "text": "DEC has a strong vision. This includes making government, policy making and delivery stronger through a diverse workforce which is more representative of the public we serve. We do this by recruiting exceptional people to work in a dynamic environment and being a force for good in our community by engaging with schools and local businesses. At DEC we come together as 8 organisations to break down silos and deliver on levelling up and greater prosperity for the UK. "
        },
        {
            "text": "In the DIT Digital, Data and Technology (DDaT) team, we often collaborate with the government departments (OGDs) across the campus, and feel that there is a Darlington identity we are all part of. We have a great culture, both from the diversity of nationalities that make up Darlington DIT, and the Northern generosity and spirit that we embody. Over the next few years, we look forward to expanding our small DDaT Darlington team further.  "
        },
        {
            "heading": 2,
            "text": "Darlington culture"
        },
        {
            "text": "We can safely say that the culture at DEC is unique! We have a variety of regular team events including a weekly coffee club. We visit independent coffee houses in Darlington (the Star Wars themed one is a favourite), and enjoy team lunches in the local marketplace (street food stalls are popular). Our events usually involve drinking coffee and eating baked goods! We have also held an online Christmas event, a jubilee afternoon tea and a summer picnic in a local rugby club. "
        },
        {
            "text": "We run regular ‘lunch and learn’ sessions which have covered a variety of topics, from career paths to Bitcoin to policy skills and even railways. We also have 3 paid volunteering days at DIT, so we use these to get involved with local volunteering opportunities as a team. These range from litter picking to helping with painting and general maintenance at local care homes and sheltered housing complexes. We also conduct outreach sessions to local schools and colleges - Kathy (pictured below) recently represented DDaT at Yarm School.  "
        },
        {
            "heading": 2,
            "text": "Enjoying the new environment"
        },
        {
            "text": "In our new office, we are encouraged to think differently about our ways of working. There are individual desks available, but a lot of collaboration space too. We constantly review our ways of working to ensure that we are making the best use of space and feel supported to collaborate with colleagues. It has been exciting as an employee to take part in the landing process and provide feedback in the early stages that has had a real impact.  "
        },
        {
            "text": "We have our own induction that is specific to Darlington. It doesn’t just cover the office building, but it is also an introduction to the town and local area. We have many colleagues here who have relocated from elsewhere in the UK or from abroad, so it makes sense to have a rounded and welcoming induction process.  "
        },
        {
            "text": "Within one hours drive of Darlington in each direction, you can get to the Yorkshire coast, Northumberland, the Lake District and the Yorkshire Dales. We are spoilt for choice with stunning landscapes and day trips. Darlington itself has affordable housing and there are lovely villages surrounding it, with an easy commute if you don’t want to live right in the heart of the town. With good schools and lots of green space, Darlington is an easy town to move across as traffic congestion is only at peak travel times. There are also good cycle-to-work pathways for those who enjoy cycling to the office. "
        },
        {
            "heading": 2,
            "text": "One DIT"
        },
        {
            "text": "As part of the move to Feethams House and creation of DEC, work is being undertaken to build a ‘One DIT’ identity to ensure we feel part of DIT as a global organisation.  "
        },
        {
            "text": "We have several senior leaders based here: Jo Crellin, Director General for Trading Systems, Pauline Crellin, Director for Trade Advocacy and World Events and Chaz Walia, Deputy Director for the Export Support Service. We also have regular ministerial visits, as well as visits from senior leaders across the organisations represented in the DEC. This helps us to feel connected to Westminster, and many of our London-based colleagues are keen to come to Darlington and work collaboratively. They also discover the beautiful countryside, miles of beaches and fresh air in the area at the same time! "
        },
        {
            "text": "In summary, DIT Darlington is full of friendly people where you can develop your Civil Service career without moving to London. The Darlington culture is unique yet welcoming, and we regularly celebrate with our lovely colleagues. With the other benefits mentioned above, why wouldn’t you want to come and work here?  "
        }
    ]
}