{
    "url": "https://educationhub.blog.gov.uk/2022/10/06/everything-you-need-to-know-about-phonics-in-schools/",
    "title": "Everything you need to know about phonics in schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-10-06T13:46:06+01:00",
    "content": [
        {
            "text": "You may have heard about phonics teaching in schools and wondered what it means – as for many people phonics wasn’t a prominent part of their time in school."
        },
        {
            "text": "Phonics is an effective way of teaching children to read. By ensuring high quality phonics teaching, we want to improve literacy levels and give all children a solid base to build on as they progress through school."
        },
        {
            "text": "Here’s everything you need to know about this important approach."
        },
        {
            "heading": 3,
            "text": "What is phonics?"
        },
        {
            "text": "Through phonics children are taught how to:"
        },
        {
            "heading": 3,
            "text": "Why is phonics important? "
        },
        {
            "text": "Once pupils can decode using phonics, they are able to focus on their wider reading skills and develop a love of reading."
        },
        {
            "text": "Research shows that when phonics is taught in a structured way – starting with the easiest sounds and progressing through to the most complex – it is the most effective way of teaching young children to read."
        },
        {
            "text": "It is particularly helpful for children aged 5 to 7. Almost all children who receive good teaching of phonics will learn the skills they need to tackle new words."
        },
        {
            "text": "They can then go on to read any kind of text fluently and confidently, and to read for enjoyment."
        },
        {
            "text": "Children who have been taught phonics also tend to read more accurately than those taught using other methods, such as ‘look and say’. This includes children who find learning to read difficult, for example those who have dyslexia."
        },
        {
            "heading": 3,
            "text": "What is the phonics screening check? "
        },
        {
            "text": "By the end of year 1 most children should be able to decode simple words and so it is an appropriate time to check whether this knowledge has been acquired."
        },
        {
            "text": "The phonics screening check is a quick and easy check of your child’s phonics knowledge. It helps schools confirm whether students have made the expected progress."
        },
        {
            "text": "The check is carried out by teachers during one pre-set week in June of each year and parents are informed of their child’s result by the end of the summer term. It is intended to be a light-touch assessment and has been designed so that it is appropriate for young children."
        },
        {
            "text": "Children read a list of 40 words to a teacher they know in familiar surroundings and teachers record whether their response to each of the words is correct."
        },
        {
            "heading": 3,
            "text": "What if my child does not meet the standard in the screening check?"
        },
        {
            "text": "Your school should tell you about your child’s progress in phonics and how they have done in the screening check in the last half-term of year 1."
        },
        {
            "text": "If your child has found the check difficult, your child’s school should also tell you what support they have put in place to help them improve."
        },
        {
            "text": "You might like to ask how you can support your child to take the next step in reading."
        },
        {
            "text": "Children who have not met the standard in year 1 will retake the check in year 2."
        },
        {
            "text": "All children are individuals and develop at different rates. The screening check ensures that teachers understand which children need extra help with phonic decoding."
        }
    ]
}