{
    "url": "https://ukhsa.blog.gov.uk/2022/10/06/get-vaccinated-and-boost-your-winter-protection/",
    "title": "Get vaccinated and boost your winter protection",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "immunisations"
    ],
    "pub_date": "2022-10-06T16:13:07+01:00",
    "content": [
        {
            "text": "This winter, both COVID-19 and flu may circulate at high levels, potentially at the same time."
        },
        {
            "text": "Ahead of what could be a difficult season, millions of people are being offered vaccination to help protect them over the coming months."
        },
        {
            "text": "There is evidence to show that if you get flu and COVID-19 at the same time you are at higher risk of becoming seriously unwell. As this is the first winter since COVID-19 emerged without restrictions in place, the best way to protect yourself from getting unwell from either is to get vaccinated."
        },
        {
            "text": "We are urging all eligible people to get vaccinated as soon as possible to boost their protection against these viruses, which also helps to protect others and the NHS."
        },
        {
            "heading": 3,
            "text": "Why do we get vaccinated annually for flu?"
        },
        {
            "text": "Every year, the flu season is different. Different strains of flu circulate and the numbers of people who get flu vary. This means we need slightly different vaccines each year."
        },
        {
            "text": "To design the vaccine for each new season, scientists look at the success of the previous year’s vaccine, data from previous flu seasons and surveillance from around the world showing which strains are making people sick."
        },
        {
            "text": "All this information is used to decide which strains go into the next vaccine, giving the best chance of a high level of protection."
        },
        {
            "text": "Flu is unpleasant for most people but it can have serious consequences for some, particularly those with certain health conditions. It can cause serious illness and in some circumstances be life threatening."
        },
        {
            "text": "There was record uptake of the flu jab in people aged 65 and over in 2021/22 (82%), though there was lower uptake among people in clinical risk groups and pregnant women and these groups are particularly encouraged to come forward this year."
        },
        {
            "heading": 3,
            "text": "Why is it particularly important to get vaccinated for flu this winter?"
        },
        {
            "text": "More people are expected to get unwell with flu this year as less natural immunity has been built up over the last couple of winters when flu was stopped from circulating widely due to COVID-19 measures."
        },
        {
            "text": "Also in the southern hemisphere countries such as Australia experienced flu circulating earlier than usual in their winter season."
        },
        {
            "text": "Young children in particular are unlikely to have built up any natural immunity to flu, which is why it’s important that they take the vaccine this year. It’s being offered to children in the form of a quick and painless nasal spray."
        },
        {
            "text": "In addition to the predicted flu wave, we have early indication that COVID-19 rates are beginning to rise ahead of winter, increasing the threat to people’s health in a so-called ‘twindemic’ scenario."
        },
        {
            "heading": 3,
            "text": "Who is eligible for the flu vaccine?"
        },
        {
            "text": "The annual flu vaccine is being offered to:"
        },
        {
            "text": "*If you’re in this age group and have a long-term health condition that puts you at risk from flu, you do not have to wait until mid-October."
        },
        {
            "text": "There are several types of flu vaccine. The Joint Committee on Vaccination and Immunisation (JCVI) reviews the latest evidence on influenza vaccines every year and recommends the type of vaccine to be offered to patients."
        },
        {
            "text": "Recommended vaccines vary according to age.  You will be offered one that is most effective for you. Children aged 2 to 17 years old are offered a quick and painless nasal spray vaccine."
        },
        {
            "heading": 3,
            "text": "Why do some people need a booster against COVID-19?"
        },
        {
            "text": "COVID-19 vaccination has been given incrementally following evidence that while the vaccines are highly effective, immunity wanes over time."
        },
        {
            "text": "Booster doses significantly increase immunity and in those who are most vulnerable to the worst effects of COVID-19, getting a booster will reduce the numbers of people who require hospitalisation or die."
        },
        {
            "text": "We are all aware that COVID-19 can cause serious illness and that it is more dangerous in certain groups, such as the elderly and those with suppressed immune systems."
        },
        {
            "text": "Since cases generally rise across the winter months, it’s really important that all those eligible get boosted to up their immunity levels."
        },
        {
            "heading": 3,
            "text": "Who is eligible for the COVID-19 booster?"
        },
        {
            "text": "The booster is being offered to:"
        },
        {
            "text": "If you are in one of these groups, you should be offered an appointment between September and December."
        },
        {
            "text": "Those at highest risk will be called first. It should be at least three months after your last dose of COVID-19 vaccine. The vaccines on offer give a very high level of protection against the virus and greatly reduce the chances of an individual becoming seriously unwell and requiring hospitalisation."
        },
        {
            "text": "Most people will receive the next generation combination version of the booster vaccine, which includes a half dose of the previous vaccine combined with a half dose against the Omicron variant."
        },
        {
            "text": "For a very small number of people another vaccine product may be advised by their doctor."
        },
        {
            "heading": 3,
            "text": "How do I get vaccinated?"
        },
        {
            "text": "Some people who are eligible for both will be offered their flu and COVID-19 vaccines in one appointment, but most people will get them separately."
        },
        {
            "text": "Those eligible for the flu vaccine can book an appointment with their GP or at a pharmacy which offers the vaccine on the NHS. You may receive an invitation to get the vaccine but you do not need to wait for this to book your appointment. If you are pregnant you will be able to get the vaccine from some maternity services or your GP."
        },
        {
            "text": "Children eligible for the flu vaccine will receive the nasal spray. Those eligible who have not yet started primary school will get the vaccine at their GP practice. For those children in primary school, they will receive the vaccine at school once parents have signed and returned a consent form."
        },
        {
            "text": "The national booking service for COVID-19 vaccination is now open for autumn boosters. People aged over 65, those who are immunosuppressed, people who are pregnant and front-line health and social care workers are now able to book an appointment."
        },
        {
            "text": "Everyone who is eligible for the free flu vaccine will be able to get it."
        },
        {
            "text": "GP surgeries and pharmacies get the flu vaccine in batches throughout the flu season. If you cannot get an appointment straight away, ask if you can book one for when more vaccines are available."
        },
        {
            "text": "Visit nhs.uk/wintervaccinations for more information on who is eligible and how to book."
        }
    ]
}