{
    "url": "https://teaching.blog.gov.uk/2022/10/06/improving-wellbeing-support-for-pupils-through-senior-mental-health-lead-training/",
    "title": "Improving wellbeing support for pupils through senior mental health lead training",
    "authors": [
        "Charlotte Reed"
    ],
    "categories": [
        "Professional Development",
        "Pupil wellbeing and behaviour",
        "Uncategorized"
    ],
    "pub_date": "2022-10-06T14:39:09+01:00",
    "content": [
        {
            "text": "Charlotte Reed is phase lead at Bosmere Junior School in Hampshire. She tells us about her experience of senior mental health lead training and how it’s helped her identify how the school can further support its staff and pupils with their mental health and wellbeing."
        },
        {
            "text": "Our school has always been proactive in supporting pupils’ mental health and wellbeing, so we welcomed the opportunity to formalise our practice through the DfE’s senior mental health lead training."
        },
        {
            "text": "The training has helped our school to see where we already had appropriate support in place, but also where further work was needed. As soon as I completed the first training session, I did an audit of our current practice, to identify which aspects of our whole school approach could be improved."
        },
        {
            "text": "The eight points below are the quick and relatively simple fixes I incorporated into our mental health strategic plan:"
        },
        {
            "text": "By pulling together everything we were already doing as a school community, and making a few small, but impactful changes, I was able to make sure that we are fully covering the eight aspects of a whole school approach to mental health and wellbeing. The school now has an improved support offer, and the training has been hugely helpful in identifying areas where more work is needed over the next year."
        },
        {
            "text": " "
        }
    ]
}