{
    "url": "https://naturalengland.blog.gov.uk/2022/10/06/international-geodiversity-day-a-world-first/",
    "title": "International Geodiversity Day – a world first",
    "authors": [
        "Jonathan Larwood"
    ],
    "categories": [
        "Geology",
        "Natural England"
    ],
    "pub_date": "2022-10-06T09:03:47+01:00",
    "content": [
        {
            "text": "By Jonathan Larwood, Principle Adviser – Geodiversity, Natural England"
        },
        {
            "text": "The world’s first International Geodiversity Day will be celebrated on the 6th October.  This annual event was established by UNESCO in November 2021 following a proposal from 109 international and national scientific and conservation organisations, including Natural England.  It is a global celebration, bringing people together to raise awareness of geodiversity and its value to us all."
        },
        {
            "text": "What is geodiversity?"
        },
        {
            "text": "Geodiversity defines the world around us.   It is the mix of rocks, fossils, minerals, landforms, and soils, and the natural processes that continually shape them.  Geodiversity directly influences our natural environment, our landscapes, and where and how we live.  It is a key component of nature and critical to successful nature recovery whether enhancing sites designated for nature conservation, increasing landscape resilience to climate change, reinforcing the diversity of our landscape, or helping us enjoy and connect with nature."
        },
        {
            "text": "Consider for a moment England’s landscape and how it changes as we travel through it.  Moving from the white cliffs and chalk downs of the south-east, following the limestone escarpment and honey-coloured villages of the Cotswolds Hills northwards, climbing the distinctive hills of the Peak District – limestones of the White Peak and sandstones of the Dark Peak - and crossing Hadrian’s Wall, part built on the dramatic igneous Whin Sill that cuts across the north-east.  All reflect our underlying geodiversity and the simple fact that England is among the most geodiverse places in the world.  What better reason for us to celebrate?"
        },
        {
            "text": "Our geodiversity inheritance"
        },
        {
            "text": "The value of our geodiversity has long been acknowledged.  The thinking that led to the 1949 National Parks and Access to the Countryside Act recognised our geodiversity as a foundation to geological science, a resource of ‘international fame’ in which we should have ‘pride’ and one that we should protect.  As testimony to this foresight today 1,150 Sites of Special Scientific Interest (approximately 30% of the total) are now designated (by Natural England) for their geodiversity – a geodiversity site series widely regarded as the best in the world."
        },
        {
            "text": "Geodiversity SSSIs come in all shapes and sizes ranging from active and disused quarries to eroding and changing coasts and rivers, to complex cave systems and the rocky landscapes of our uplands.  They all have one thing in common, they tell a story of environmental change, the evolution and extinction of life over millions of years, and help us understand the dynamic and ever-changing nature of the world around us."
        },
        {
            "text": "England’s international geodiversity"
        },
        {
            "text": "Many of our geodiversity SSSIs have international scientific significance.  They are reference sections which have defined moments in time such as the ancient Silurian rocks of Shropshire’s Wenlock Edge, which have lent their name to the globally used ‘Wenlock Stage’ of geological time, or the eroding south coast of the Isle of Wight, Europe’s richest source of Lower Cretaceous dinosaurs."
        },
        {
            "text": "It is both the global significance of England’s geodiversity and Natural England and Defra’s investment over many years in its protection and conservation, that has underpinned the establishment of the UNESCO Jurassic Coast World Heritage Site and three UNESCO Global Geoparks: the North Pennines AONB, the English Riviera, and most recently the Black Country UNESCO Global Geopark."
        },
        {
            "text": "The Jurassic Coast World Heritage Site is England’s only natural World Heritage Site, a 95 mile stretch of coast from Orcombe Point in Exmouth to Old Harry Rocks, near Studland.   Protected by 13 geodiversity SSSIs the Jurassic Coast encompasses a near complete Mesozoic sequence, some 185 million years of time.  It is particularly noted for its Jurassic fossils around Lyme Regis, first made famous by the collector Mary Anning."
        },
        {
            "text": "UNESCO Global Geoparks combine sites and landscapes of international geological significance with a holistic approach to protection, education, and sustainable development.  They are locally driven and connect an area’s geodiversity to its communities and their cultural history and traditions. Recent research has shown that the UK UNESCO Global Geoparks generated £8.7 million in income, largely through sustainable geotourism."
        },
        {
            "text": "Our Geoparks all reflect our immense geodiversity.  The North Pennines AONB Geopark’s distinctive drystone walls and villages and the industrial heritage of the Pennine Orefield all connect to the Geopark’s 500 million years of geodiversity.  The English Riviera Geopark, centred around Torbay, takes visitors back 400 million years to the tropical marine Devonian (a name derived from the rocks of Devon) spectacularly exposed along its coast and rolling hills. The Black Country, our most recent Geopark, is centred round the geological resources of the Industrial Revolution – coal, iron ore, and limestone – which has defined the landscape and history of the area."
        },
        {
            "text": "Celebrating International Geodiversity Day"
        },
        {
            "text": "Events the world over are being organised.  Here Natural England is joining the Black Country UNESCO Global Geopark on a canal journey through the limestone hills of Dudley, connecting the Wren’s Nest National Nature Reserve (our first geological NNR) to the Saltwells National Nature Reserve (our most recent geological NNR).  A journey celebrating the link between geodiversity, landscapes, and the local communities of Dudley, celebrating 70 years of NNRs, and joining in the global celebration of geodiversity."
        },
        {
            "text": " "
        }
    ]
}