{
    "url": "https://space.blog.gov.uk/2022/10/06/the-night-sky-in-october-3/",
    "title": "The night sky in October",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-10-06T12:43:47+01:00",
    "content": [
        {
            "text": "September brought that first icy night under the stars since March, and it’s always a mixed experience!"
        },
        {
            "text": "While it’s a reminder that the days are getting shorter, darker and colder, it’s always countered by the excitement of seeing some of the most beautiful sights in the night sky - as well as having more hours of darkness in which to see them!"
        },
        {
            "text": "This October brings a host of exciting astronomical events, including a partial solar eclipse, two meteor showers and the return of some familiar sights in the spectacular autumn constellations."
        },
        {
            "heading": 3,
            "text": "Partial Solar Eclipse"
        },
        {
            "text": "Shortly after 10am (UK time) on the morning of 25 October, the Moon’s path around Earth takes it almost directly between the Sun and our planet, significantly reducing the amount of light reaching us."
        },
        {
            "text": "In the north of the UK around a third of the Sun’s disc will be eclipsed by the Moon, with the south of the UK experiencing an eclipse of around 20%."
        },
        {
            "text": "Warning: It is not safe to look directly at the sun, or point optical equipment, such as cameras, binoculars and telescopes at it. Even when partially eclipsed, eyes and equipment can be damaged instantly. Specially made filters and glasses are available, through which you can safely observe and photograph the sun, but these must be checked carefully first, to ensure they are not scratched or damaged."
        },
        {
            "text": " "
        },
        {
            "text": "To observe the Moon obscuring the Sun you’ll need an appropriate safety filter, and an unobstructed view to the south-east. The point of greatest eclipse will take place shortly before 11am, around an hour after the event begins. The Moon will then gradually move away, uncovering the Sun over the following hour."
        },
        {
            "text": "We will have to wait until April 2024 for the next partial solar eclipse in the UK, so here’s hoping for clear skies, and good luck if you are hoping to observe this partial eclipse!"
        },
        {
            "heading": 3,
            "text": "October night skies"
        },
        {
            "text": "Jupiter is currently the brightest object in the night sky (apart from the Moon), and it is a helpful guide to finding the autumnal constellations of Pegasus, Aquarius and Pisces."
        },
        {
            "text": "Looking east, bright red-giant star Aldebaran marks the eye of Taurus the Bull. More than 40 times the size of our Sun, Aldebaran gets its name from the Arabic for ‘Follower’, as the star follows the white-blue stars of the Pleiades star cluster across the night sky."
        },
        {
            "text": "Mars sits a little to the left of Aldebaran, red-hued and getting brighter over the next couple of months as Earth and the red planet approach their closest point to each other in their orbits around the Sun."
        },
        {
            "text": "High in the south-west lie the bright stars Vega (of constellation Lyra the Harp), Deneb (Cygnus the Swan) and Altair (Aquila the Eagle), while those with a low southerly horizon may be able to spot Formalhaut."
        },
        {
            "text": "Images of this star taken by the Hubble Space Telescope show large discs of dust surrounding Formalhaut, and scientists are still working to establish whether points of light within this disc could be a planet, or the remnants of some massive planetary collision."
        },
        {
            "text": "Finally, for those with darker skies away from the glow of streetlights, see if you can make out the faint glow of the Andromeda Galaxy rising in the east as darkness falls. Those with binoculars or a telescope may also be able to hunt for the Triangulum Galaxy that sits nearby."
        },
        {
            "text": "Meteor showers this month"
        },
        {
            "text": "The Draconids meteor shower peaks around 8-9 October and will see fragments of debris from Comet Giacobini-Zinner entering our atmosphere."
        },
        {
            "text": "The full Moon’s light may outshine some of the fainter meteors, so try to find a spot with a clear horizon facing away from the Moon for the best chance to see these meteors. They’re among the slower meteors to streak across the sky, travelling at ‘just’ 21 kilometres (13 miles) per second!"
        },
        {
            "text": "By contrast, the fragments from Halley’s Comet that make up the Orionids meteor shower will enter our atmosphere at around 66 kilometres (40 miles) per second. This meteor shower is active all month and peaks in the relatively moonless nights around 21-22 October."
        },
        {
            "text": "Halley’s Comet last passed through our inner solar system in 1986, and its debris trail is responsible for both this month’s Orionids and the Eta Aquariids meteor shower that we see each May."
        },
        {
            "text": "Space Exploration"
        },
        {
            "text": "NASA’s DART mission (Double Asteroid Redirection Test) appears to have been a success, with the refrigerator-sized spacecraft intentionally smashing into one of a pair of asteroids."
        },
        {
            "text": "The mission is designed to test whether we can alter the course of an Earth-bound asteroid by colliding a spacecraft with it."
        },
        {
            "text": "Ground and space-based telescopes will now observe the asteroids to see if the orbit of the smaller asteroid (Dimorphos) around the larger body (Didymos) has been affected.  The European Space Agency’s HERA mission will launch in 2024 to study these asteroids and the aftermath of the impact in more detail."
        },
        {
            "text": "You can find the remarkable final images from this mission here.  At the time of writing, Google paid tribute to the mission with a fun effect when you do a google search for “NASA DART mission”!"
        },
        {
            "text": "Artemis-1: NASA’s ‘test run’ of the technology that will return humans to the Moon has experienced further delays as a result of the hurricane that passed through Florida recently. NASA will now target the launch window in mid-November."
        },
        {
            "text": "Interestingly, SpaceX’s Starship, the tallest and most powerful launch vehicle ever built, is reportedly scheduled for its first orbital flight around the same time, so it could be an exciting month for the future of space exploration!"
        }
    ]
}