{
    "url": "https://food.blog.gov.uk/2024/04/05/a-look-back-at-the-path-safe-biosurveillance-conference-2024/",
    "title": "A look back at the PATH-SAFE Biosurveillance Conference 2024",
    "authors": [
        "Rachel Baird, PATH-SAFE Senior Project Manager"
    ],
    "categories": [
        "Foodborne disease",
        "Our mission",
        "Partners",
        "Science"
    ],
    "pub_date": "2024-04-05T08:48:04+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Rachel Baird, PATH-SAFE Senior Project Manager, reflects on the PATH-SAFE Biosurveillance Conference 2024, hosted in London. "
        },
        {
            "text": "At the end of February, the Pathogen Surveillance in Agriculture Food and Environment (PATH-SAFE) team hosted a two-day conference to facilitate knowledge exchange within the biosurveillance community, by showcasing the innovative work that has been undertaken within the PATH-SAFE programme, and other related biosurveillance programmes. The event also created an opportunity for people within the community to connect and expand their professional networks."
        },
        {
            "text": "We’d like to say a huge thank you to everyone who joined us in person or online over the two days. With over 140 delegates from across government, industry, and academia, attending in person over the two days, and a further 65 delegates joining online each day, there was a real buzz of energy and collaboration throughout the conference."
        },
        {
            "text": "More than 25 speakers took to the stage to share updates on their projects or programmes, sharing their research findings or progress on initiatives. This included the teams delivering PATH-SAFE; a cross-government programme that has brought together more than 50 partners to collaboratively pilot a national surveillance programme for foodborne diseases and antimicrobial resistance, funded by the HM Treasury Shared Outcomes Fund (SOF)."
        },
        {
            "heading": 2,
            "text": "Feedback from our delegates"
        },
        {
            "text": "“So impressive to see what the programme has brokered between all the departments and researchers. PATH-SAFE is the lynchpin making this all work, otherwise people would largely be back in their silos or not doing the work at all.”"
        },
        {
            "text": "“PATH-SAFE is an excellent program, great outcomes generated so far and looking forward to seeing what this next year brings.”"
        },
        {
            "text": "“It was great to have the chance to see results of the whole programme and interact with researchers from the different workstreams.”"
        },
        {
            "text": "“It was wonderful to see all the PATH-SAFE projects together in one place - it really struck me as a substantial body of work!”"
        },
        {
            "text": "We were also able to share with attendees, on account of some very fortuitous timing, the wonderful news that HM Treasury approved our bid for 24/25 SOF continuation funding. This additional year of funding will allow PATH-SAFE to build on what has been achieved so far, taking the pilot approach towards ‘real-world’ deployment, and thus enabling the delivery of improved outcomes and impacts. This will be achieved by not only taking forward the tools and knowledge developed so far, but also continuing to utilise the interdisciplinary, One Health, four nations collaboration that has been established by the programme."
        },
        {
            "heading": 2,
            "text": "Presentations from the PATH-SAFE Biosurveillance Conference 2024"
        },
        {
            "text": "On day one, the project teams presented their PATH-SAFE whole genome sequence data system development and knowledge gap-addressing projects (including new findings on antimicrobial resistance, AMR)."
        },
        {
            "text": "The final session provided information on biosurveillance programmes, strategies and initiatives from across government with speakers from the Animal and Plant Health Agency (APHA), UK Health Security Agency (UKHSA) and Cabinet Office."
        },
        {
            "text": "The second day of the conference focused on how PATH-SAFE projects are enhancing existing biosurveillance activities and developing novel methods, including wastewater testing and remote diagnostics for foodborne pathogen detection. The day was rounded off with a look at reflections and lessons learned during the programme to date."
        },
        {
            "text": "Presentation recordings, slides and posters are available on the PATH-SAFE conference webpage."
        },
        {
            "text": "Those interested in learning more about the PATH-SAFE programme can find more resources, including our previous webinars, on the PATH-SAFE webpage."
        },
        {
            "heading": 1,
            "text": "Golwg yn ôl ar Gynhadledd Bio-wyliadwriaeth PATH-SAFE 2024"
        },
        {
            "text": "Mae Rachel Baird, Uwch-reolwr Prosiect PATH-SAFE, yn myfyrio ar Gynhadledd Bio-wyliadwriaeth PATH-SAFE 2024, a gynhaliwyd yn Llundain. "
        },
        {
            "text": "Ddiwedd mis Chwefror, cynhaliodd y tîm Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE) gynhadledd ddeuddydd i gyfnewid gwybodaeth o fewn y gymuned bio-wyliadwriaeth, trwy arddangos gwaith arloesol y rhaglen PATH-SAFE, a rhaglenni bio-wyliadwriaeth cysylltiedig eraill. Roedd y digwyddiad hefyd yn gyfle i ymgysylltu a meithrin rhwydweithiau proffesiynol o fewn y gymuned."
        },
        {
            "text": "Hoffem ddiolch yn fawr iawn i bawb a ymunodd â ni yn y gynhadledd neu ar-lein dros y deuddydd. Gyda mwy na 140 o gynrychiolwyr o bob rhan o’r llywodraeth, y diwydiant, a’r byd academaidd yn bresennol, a 65 o gynadleddwyr pellach yn ymuno ar-lein bob dydd, roedd digon o fwrlwm a chydweithio drwy gydol y gynhadledd."
        },
        {
            "text": "Roedd dros 25 o siaradwyr yn rhoi diweddariadau ar eu prosiectau neu raglenni, gan rannu canfyddiadau eu gwaith ymchwil neu gynnydd eu mentrau. Roedd hyn yn cynnwys y timau sy’n cyflwyno PATH-SAFE; rhaglen draws-lywodraethol sydd wedi dod â mwy na 50 o bartneriaid ynghyd i dreialu rhaglen wyliadwriaeth genedlaethol ar gyfer clefydau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd, a ariennir gan Gronfa Canlyniadau a Rennir Trysorlys EF (SOF)."
        },
        {
            "heading": 2,
            "text": "Adborth gan ein cynadleddwyr"
        },
        {
            "text": "“Roedd gweld y gwaith sydd wedi digwydd rhwng yr holl adrannau ac ymchwilwyr wedi creu cryn argraff arna’ i. PATH-SAFE yw’r sylfaen sy’n galluogi hyn, fel arall, ni fyddai llawer o’r gwaith hwn yn digwydd, os o gwbl.”"
        },
        {
            "text": "“Mae PATH-SAFE yn rhaglen ragorol, sydd wedi cael canlyniadau gwych hyd yn hyn, ac rwy’n edrych ymlaen at weld beth fydd yn digwydd yn ystod y flwyddyn nesaf.”"
        },
        {
            "text": "“Roedd yn wych cael y cyfle i weld canlyniadau’r rhaglen gyfan a rhyngweithio ag ymchwilwyr o’r gwahanol ffrydiau gwaith.”"
        },
        {
            "text": "“Roedd yn hyfryd gweld yr holl brosiectau PATH-SAFE gyda’i gilydd mewn un lle – roedd yn fy nharo fel corff sylweddol o waith!”"
        },
        {
            "text": "Cafodd y cynrychiolwyr hefyd wybod, oherwydd amseru lwcus iawn, y newyddion gwych bod Trysorlys EF wedi cymeradwyo ein cais am gyllid parhad drwy’r Gronfa Canlyniadau a Rennir (SOF) ar gyfer 24/25. Bydd y flwyddyn ychwanegol hon o gyllid yn galluogi PATH-SAFE i adeiladu ar yr hyn a gyflawnwyd hyd yn hyn, gan symud o’r dull peilot tuag at ei ddefnyddio yn y ‘byd go iawn’, gan arwain at ganlyniadau ac effeithiau gwell. Cyflawnir hyn nid yn unig drwy fwrw ymlaen â’r adnoddau a’r wybodaeth a ddatblygwyd hyd yma, ond hefyd drwy barhau i gydweithio’n rhyngddisgyblaethol, gan ddilyn egwyddorion ‘un iechyd, pedair gwlad’."
        },
        {
            "heading": 2,
            "text": "Cyflwyniadau"
        },
        {
            "text": "Ar y diwrnod cyntaf, cyflwynodd y timau eu prosiect ar ddatblygu system ddata PATH-SAFE ar gyfer dilyniannu genomau cyfan a’r prosiect er mwyn mynd i’r afael â bylchau mewn gwybodaeth (gan gynnwys canfyddiadau newydd ar ymwrthedd gwrthficrobaidd, neu ‘AMR’). Roedd y sesiwn olaf yn darparu gwybodaeth am raglenni bio-wyliadwriaeth, strategaethau a mentrau o bob rhan o’r llywodraeth, gyda siaradwyr o’r Asiantaeth Iechyd Anifeiliaid a Phlanhigion (APHA), Asiantaeth Diogelwch Iechyd y DU (UKHSA) a Swyddfa’r Cabinet."
        },
        {
            "text": "Roedd ail ddiwrnod y gynhadledd yn canolbwyntio ar sut mae prosiectau PATH-SAFE yn gwella gweithgareddau bio-wyliadwriaeth presennol ac yn datblygu dulliau newydd, gan gynnwys profi dŵr gwastraff a diagnosteg o bell ar gyfer canfod pathogenau a gludir gan fwyd. Daeth y diwrnod i ben gydag ystyriaeth o’r gwersi a ddysgwyd yn ystod y rhaglen hyd yma."
        },
        {
            "text": "Mae sleidiau, posteri a recordiadau o’r cyflwyniadau ar gael ar dudalen we’r gynhadledd PATH-SAFE."
        },
        {
            "text": "Gall y rhai sydd â diddordeb mewn dysgu mwy am y rhaglen PATH-SAFE ddod o hyd i ragor o adnoddau, gan gynnwys ein gweminarau blaenorol, ar dudalen we PATH-SAFE."
        }
    ]
}