{
    "url": "https://mhclgmedia.blog.gov.uk/2024/04/05/new-regime-to-drive-up-decent-standards-for-social-housing-residents/",
    "title": "New regime to drive up decent standards for social housing residents",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-04-05T11:43:10+01:00",
    "content": [
        {
            "text": "This week we announced the new inspection regime for social housing which will be enforced by the Regulator of Social Housing."
        },
        {
            "text": "Minister for Social Housing, Baroness Scott wrote for the Big Issue, setting out the biggest change to social housing rules in a decade. New powers for the Regulator mean they can now routinely inspect social landlords and hold them to account. Where providers fall short the Regulator can take action through a range of potential sanctions, including appointing new management or unlimited fines."
        },
        {
            "text": "The Minister also outlines how the Government took immediate action following the tragic death of two-year-old Awaab Ishak after exposure to mould in his Rochdale home."
        },
        {
            "text": "Writing in the Big Issue, Minister for Social Housing Baroness Scott said:"
        },
        {
            "text": "Outlets including Inside Housing, Social Housing, Housing Digital, and Local Government Chronicle report that the Regulator has written to social housing providers about the new standards that come into effect this week. This includes the need for social landlords to have an up-to-date record on the condition of all their homes. They must set clear timelines for the completion of repairs and communicate them clearly to tenants, alongside ensuring they provide tenants with information about their rights and how to make complaints."
        },
        {
            "text": "Coverage also includes the Chief Executive of the Regulator, Fiona MacGregor, welcoming the new powers which will “hold landlords to account for delivering the outcomes of our new consumer standards and drive improvement across the social housing sector, for the benefit of tenants”. Social housing campaigner, Kwajo Tweneboa, has expressed his hope that the change in legislation will result in a “more proactive stance in scrutinising [social housing] providers.”"
        },
        {
            "text": "Elsewhere, the Deputy Chief Executive of the Regulator, Jonathan Walkers, recently had an exclusive interview with Housing Today saying the Regulator will require social housing providers to prepare performance improvement plans and can now issue unlimited fines to those who fail to meet the standards."
        }
    ]
}