{
    "url": "https://stratcommand.blog.gov.uk/2024/04/05/raf-rugby-union-in-gibraltar/",
    "title": "RAF Rugby Union - For the love of the scrum",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases",
        "Training"
    ],
    "pub_date": "2024-04-05T10:19:49+01:00",
    "content": [
        {
            "text": "As the Rugby Union Inter-Services Championship draws closer, anticipation builds, with players working hard at an intensive week-long training camp in Gibraltar."
        },
        {
            "text": " "
        },
        {
            "text": "In preparation for April’s Inter-Services Championships in Plymouth against the Royal Navy Masters, thirty two players from the Royal Air Force Rugby Union (RAFRU) Masters, nicknamed ‘Vultures’, participated in daily training sessions ahead of Friday’s match against local side ‘Gibraltar Barbarians’ in Europa Park."
        },
        {
            "text": "Once the players arrived in Gibraltar, they got straight into the thick of it and took part in daily strength and conditioning sessions, rehearsed game running patterns and utilised sea recovery sessions."
        },
        {
            "text": "On a cold, wet and windy bank holiday Friday, the players took to Europa Park where they battled it out, ending the game with a victory for the RAF Vultures."
        },
        {
            "text": " "
        },
        {
            "text": "Although many of the players had been to Gibraltar before, it was the first time for some, so when the players had some downtime, they took the opportunity to see the sights of Gibraltar."
        },
        {
            "text": " "
        },
        {
            "text": "RAF Vultures Team Manager, Sergeant Gaz Charnock said: “Being part of the RAF Vultures victory over the Gibraltar Barbarians at Europa Park on Friday night fills me with immense pride."
        },
        {
            "text": "This win wasn't just about the scoreboard; it was a testament to the unwavering determination of our players, the tireless efforts of our coaching team, Player Support Group, and the synergy that binds us together as a unit."
        },
        {
            "text": "In the face of adversity, our team displayed resilience, adaptability, and a hunger for success that will propel us forward as we approach our first inter-service fixture against the Royal Navy at Devonport Services on Friday 19 April."
        },
        {
            "text": "This victory isn't just a step forward; it's a testament to the countless hours of hard work and preparation put in by every member of our squad. Together, we stand ready to conquer any challenge that comes our way.”"
        },
        {
            "text": " "
        }
    ]
}