{
    "url": "https://deframedia.blog.gov.uk/2024/06/04/new-evidence-asian-hornets-overwintering-in-uk/",
    "title": "New evidence Asian hornets overwintering in UK",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2024-06-04T11:44:09+01:00",
    "content": [
        {
            "text": "There has been widespread coverage this morning across BBC Breakfast, the Times, the Telegraph, the Guardian and the Daily Mail focused on new evidence Asian hornets have overwintered in the UK. Genetic analysis conducted by Fera Science Ltd on samples collected by APHA’s National Bee Unit, found that three Asian hornet queens trapped last month in Sussex are the offspring of a nest that was destroyed in the area, in November 2023."
        },
        {
            "text": "Whilst this is the first evidence of Asian hornets overwintering in the UK, it is not considered to be strong evidence of an established population."
        },
        {
            "text": "For a species to be considered as established, there should be evidence of a reproducing population having been present in the wild for a significant number of generations and which is considered to be viable in the long term without any human intervention."
        },
        {
            "text": "2023 saw a record number of Asian hornets found in the UK and last month, the UK’s Chief Plant Health Officer Professor Nicola Spence issued a new warning urging UK beekeepers and the public to be increasingly vigilant to the presence of Asian hornet and report any sightings as we move into the peak summer season."
        },
        {
            "text": "Last year, the Animal and Plant Health Agency’s National Bee Unit attended every credible sighting, locating and destroying 72 nests in 56 locations with the majority of nests found in Kent. The National Bee Unit continues to stand ready to respond quickly and effectively to any further possible sightings."
        },
        {
            "text": "What to do if you spot an Asian hornet"
        },
        {
            "text": "If you suspect you have seen an Asian hornet you should report this using the iPhone and Android app ‘Asian Hornet Watch’ or by using our online report form. Alternatively, e-mail alertnonnative@ceh.ac.uk. Please include a photograph if you can safely obtain one."
        },
        {
            "text": "Identification guides and more information are available and if you keep bees you should keep up to date with the latest situation on the gov.uk sightings page and on BeeBase."
        },
        {
            "text": "It is important to take care not to approach or disturb a nest. Asian hornets are not generally aggressive towards people but an exception to this is when they perceive a threat to their nest."
        }
    ]
}