{
    "url": "https://healthmedia.blog.gov.uk/2023/09/01/media-fact-sheet-raac-in-the-nhs/",
    "title": "Media fact sheet: RAAC in the NHS",
    "authors": [
        "laurenmartens"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-09-01T18:30:43+01:00",
    "content": [
        {
            "text": "This fact sheet sets out our position on the presence of reinforced autoclaved aerated concrete (RAAC) in the NHS. RAAC is a lightweight form of precast concrete, frequently used in public sector buildings in the UK from the mid-1950s to the mid-1990s."
        },
        {
            "text": "A Department of Health and Social Care spokesperson said:"
        },
        {
            "text": "“The NHS has a mitigation plan in place for hospital buildings with confirmed RAAC, backed with significant additional funding of £698 million from 2021 to 2025, for trusts to put in place necessary remediation and failsafe measures. We remain committed to eradicating RAAC from the NHS estate entirely by 2035."
        },
        {
            "text": "“Additionally, we have announced that the seven most affected NHS hospitals will be replaced by 2030 through our New Hospital Programme."
        },
        {
            "text": "“The technical advice received from the NHS is that the current approach to monitoring and mitigation remains appropriate.”"
        },
        {
            "text": "Q&A:"
        },
        {
            "text": "How many sites are affected? "
        },
        {
            "text": "What kind of mitigations are in place?"
        },
        {
            "text": "Why is your approach different to schools?"
        },
        {
            "text": "Has the guidance changed?"
        },
        {
            "text": "How can you be sure you’ve identified all instances of RAAC - could there be cases you don’t know about?"
        },
        {
            "text": "What about other parts of the health estate – for example, GPs/primary care services?"
        }
    ]
}