{
    "url": "https://nda.blog.gov.uk/oldbury-wetland-restoration-project/",
    "title": "Oldbury wetland restoration project",
    "authors": [
        "karolinakasperek"
    ],
    "categories": [
        "Research and development"
    ],
    "pub_date": "2023-09-01T09:39:57+01:00",
    "content": [
        {
            "heading": 3,
            "text": "The background of Magnox Oldbury site’s silt lagoons"
        },
        {
            "text": "When Oldbury site was an operational power station, cooling water was needed and taken from the River Severn. However, silt from the river could accumulate in front of the cooling water inlets, risking blocking them. To ensure the unimpeded flow of cooling water into the site this silt was periodically dredged and deposited on land into three lagoons."
        },
        {
            "text": "Lagoons one & two have been out of operation for the longest periods of time, and as a result are now dried out. Lagoon one has been capped with soil, and returned to farmland, and Lagoon two was allowed to be reclaimed by nature, and is now a dry, but diverse habitat. Lagoon three has been left untouched."
        },
        {
            "text": "The map below shows the three lagoons around Oldbury site."
        },
        {
            "heading": 3,
            "text": "The value of Lagoon three"
        },
        {
            "text": "When the lagoons were operational significant bird assemblies used them as high tide roosts. High-tide roosts are important for the conservation of water birds, providing areas for ‘loafing’ and energy conservation at periods of high tide.  A good high-tide roost should be close to the estuary, safe from predation and be large enough for communal flocking."
        },
        {
            "text": "The Severn estuary forms one of the most important inter-tidal zones in Britain, providing internationally important feeding grounds for over-wintering and migratory waders and wildfowl."
        },
        {
            "text": "This made Oldbury’s Lagoon three a very valuable habitat for the surrounding environment and wildlife. providing multiple valuable Ecosystem services to the surrounding area."
        },
        {
            "text": "Ecosystem Services can be defined as the direct and indirect contributions that habitats (natural, semi-natural or artificial) provide to support human societies, wellbeing, and quality of life."
        },
        {
            "heading": 3,
            "text": "Lagoon three today"
        },
        {
            "text": "Since dredging into lagoon three has stopped, it has been slowly drying out, and therefore the habitat has been slowly changing and losing its value to key estuarine birds on the Severn estuary, as well as the public."
        },
        {
            "text": "We want to maximise the value of this land to both the public and the local environment. To re-create the high-tide roost, areas of standing water or wet silt would need to be created, and on-going management of the site would be required. If we do not regenerate the Lagoon three wetland habitat, it will naturally deteriorate into scrubland/woodland and will cease to be the valuable wetland habitat that it once was."
        },
        {
            "heading": 3,
            "text": "The wider context"
        },
        {
            "text": "Wetlands support over 40% of the world’s species and they form a very important part of the UK’s natural habitat. However, the UK has lost 75% of its wetlands since the industrial revolution. The Government’s 25-year environment plan includes restoring 500,00 hectares of wildlife-rich habitat outside the protected site network focussing on priority habitat. The west of England aims to create 5,108 hectares of wildlife rich habitat outside of the existing protected sites."
        },
        {
            "text": "Restoring Lagoon three back to a wetland would support the ‘String of Pearls’ concept - the creation and expansion of a series of wetlands along the Severn estuary SPA/Ramsar in South Gloucestershire and Bristol.  The restoration of Lagoon three would improve the spatial connectivity of this network of high-tide roosts."
        },
        {
            "heading": 3,
            "text": "The opportunity at lagoon three"
        },
        {
            "text": "Although lagoon three no longer boasts a high tide roost, a significant array of flora and fauna thrive in the area. Depending upon when you visit you could spot otters, owls, dragonflies, bats, starling murmuration’s and much more. Any proposed habitat enhancement scheme will assess the needs and significance of all these species."
        },
        {
            "text": "Extensive research has been undertaken to assess the relative risks and opportunities associated with improving the lagoon three habitat including. These concluded that  the best ecological options for the future of Lagoon three all incorporate the creation of shallow water for roosting birds fringed with bare silt and reeds; a wetland."
        },
        {
            "text": "No strategic constraints were identified which would prohibit pursuing the creation of an improved habitat that incorporates a wetland.  The creation of such a habitat would support the decommissioning of Oldbury site by increasing the biodiversity value of the estate, by supporting our net zero ambitions and by creating a resource for our local community."
        },
        {
            "text": "Preliminary enabling work is being undertaken to investigate the ease of re-wetting Lagoon three, this will help to inform the design of habitats that could be supported."
        },
        {
            "text": "Similar habitats have been created on post-industrial sites in other parts of the UK, benefiting wildlife and providing attractive visitor experiences."
        }
    ]
}