{
    "url": "https://educationinspection.blog.gov.uk/2023/09/01/our-approach-to-inspecting-the-curriculum-in-alternative-provision/",
    "title": "Our approach to inspecting the curriculum in alternative provision",
    "authors": [
        "Steve Shaw, senior His Majesty’s Inspector for SEND and AP"
    ],
    "categories": [
        "Alternative provision (AP)",
        "deep dives",
        "inspection",
        "SEND"
    ],
    "pub_date": "2023-09-01T09:30:40+01:00",
    "content": [
        {
            "text": "Alternative provider (AP) settings provide education for pupils with complex needs that can’t typically be met in mainstream schools. APs rightly differ from mainstream schools – they serve different purposes and have different objectives. When we inspect an AP, we know that we will see different curriculum approaches that reflect the specific needs of the pupils. And we know that we may see some very challenging behaviour."
        },
        {
            "text": "Inspecting AP"
        },
        {
            "text": "When we inspect an AP, we see a variety of approaches depending on the setting’s core objectives. These range from short-term behaviour intervention packages to longer term and even permanent, full-time placements."
        },
        {
            "text": "Even though an AP does not always look and sound like a mainstream school, we use the same inspection handbook (the education inspection framework (EIF)) to inspect it, to allow for comparability. The EIF is designed to be flexible and enables inspectors to take into account the specific context of individual settings."
        },
        {
            "text": "This blog will explore how we use the EIF’s flexibilities to understand what makes an AP’s curriculum tick."
        },
        {
            "text": "The EIF deliberately focuses on the quality of education and the importance of a high-quality curriculum. Our expectations of APs in this regard are no different to a mainstream school. We have high expectations for all pupils, and that includes those in AP."
        },
        {
            "text": "We are currently seeing significant attention on the AP sector. This includes:"
        },
        {
            "text": "So, how do we go about inspecting an AP’s curriculum, when its complexity and diversity can make it look and feel very different to a mainstream school’s curriculum?"
        },
        {
            "text": "Understanding the AP’s core work and objectives"
        },
        {
            "text": "Our first step when inspecting an AP’s curriculum is to understand its core work and objectives."
        },
        {
            "text": "Through the EIF, we recognise that APs are likely to have different objectives to mainstream schools, and, depending on the needs of their pupils, even to other APs. We know that an AP will focus on delivering the work that is central to achieving the AP’s core objectives, such as specific improvements in pupils’ attitudes, behaviour or attendance."
        },
        {
            "text": "Understanding the AP’s core work and objectives is an essential part of the initial phone call between the lead inspector (LI) and the headteacher. During this call, the LI will ask the headteacher to describe and explain the AP’s core work and objectives. This is so that the LI can understand how the AP is set up to meet its pupils’ needs."
        },
        {
            "text": "This conversation will necessarily involve a discussion about the AP’s curriculum."
        },
        {
            "text": "Exploring an AP’s curriculum: what might a good or outstanding curriculum look like?"
        },
        {
            "text": "We have high aspirations for all pupils attending AP, and we expect APs to share those aspirations. This should be reflected in their curriculum."
        },
        {
            "text": "But we know APs face a number of challenges when designing a curriculum, including:"
        },
        {
            "text": "The LI will want to understand the AP’s curriculum design and implementation in the context of the AP’s core work. They will ask the headteacher to talk through the curriculum in the call following notification. This is an opportunity for the headteacher to help us get under the bonnet of the AP’s curriculum – to describe how it connects with the AP’s core work and objectives. We want to ‘get’ what the AP is all about. This will include:"
        },
        {
            "text": "Agreeing the deep dives and arranging other inspection activities"
        },
        {
            "text": "Once the LI understands the curriculum, they will agree the areas for deep dives with leaders. The areas are likely to include national curriculum subjects and reading. They may include a curriculum area specific to the AP – one linked to its core work and objectives. They may be related to the four broad areas of SEND. Or they could be a combination of all of these. To allow for the necessary flexibility, there is no fixed number of deep dives in specialist settings and AP, but we generally aim to complete four in larger settings."
        },
        {
            "text": "Because APs are complex, the LI will work closely with leaders to build an inspection plan that best enables the inspectors to explore and evaluate the curriculum."
        },
        {
            "text": "We know that some pupils might be reluctant to speak with inspectors, while others will be eager to do so. We will talk to leaders about how best to communicate with, and meet, pupils."
        },
        {
            "text": "Commissioning agreements and exploring the curriculum"
        },
        {
            "text": "As part of our curriculum discussions, we will look at commissioning agreements for pupils. We take the DfE’s alternative provision statutory guidance as the basis for what commissioning agreements should consist of and set out to achieve."
        },
        {
            "text": "Inspectors are likely to sit down with leaders to look at a few commissioning agreements and related documentation. This will be a professional dialogue, where we ask leaders to walk us through a few ‘live’ placements. We often hear from AP leaders about their tailor-made and bespoke curriculum. This meeting is an opportunity for leaders to shine a light on their curriculum in action, and to showcase how they support their pupils."
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "Through the EIF, we focus on the quality of education – because we want all schools to have high aspirations for all of their pupils. AP is no different."
        },
        {
            "text": "But we know that every AP is unique. And we know that, to inspect APs fairly and effectively, our inspectors should work collaboratively with leaders to understand their setting."
        },
        {
            "text": "We will continue to provide ample opportunities for leaders to demonstrate how their curriculum supports individual pupils to reach their potential and, at the right time, move on to a positive, meaningful and successful next step."
        },
        {
            "text": "We will also be hosting a webinar on our inspections of AP later in the autumn term as part of our series aimed at schools."
        }
    ]
}