{
    "url": "https://prisonjobs.blog.gov.uk/2023/09/01/spotlight-the-prison-officer-online-assessment-centre/",
    "title": "Spotlight: the prison officer online assessment centre",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Prison officer"
    ],
    "pub_date": "2023-09-01T16:42:41+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Applying to be a prison officer? Read this handy guide to our online assessment centre process so you know what to expect."
        },
        {
            "text": "The online assessment centre (OAC) is a key stage of the application process to be a prison officer. While you don’t need specific experience, qualifications or education, the OAC assesses whether you have the necessary abilities, behaviours and strengths needed for the role. As it’s online, you can complete it from the comfort of your own home and all you’ll need is a laptop/PC with a webcam."
        },
        {
            "text": "Accessing the OAC"
        },
        {
            "text": "Once you’ve successfully completed the first 2 stages of the prison officer application process – online application and scenario-based test – you’ll receive an email inviting you to book onto your OAC. You’ll then be sent a link to join your confirmed session."
        },
        {
            "text": "What to expect on the day"
        },
        {
            "text": "Your OAC will take about two and a half hours to complete."
        },
        {
            "text": "An insight into the assessments"
        },
        {
            "text": "You will need to be fluent in spoken and written English."
        },
        {
            "text": "1.     Interview"
        },
        {
            "text": "To see if you could be a prison officer, you will be asked questions about:"
        },
        {
            "text": "2.     Role play\nThis will look at how you would handle a situation that is based on real challenges you could face as a prison officer. You will be asked to take on the role of a prison officer interacting with a prisoner."
        },
        {
            "text": "3.     Written test "
        },
        {
            "text": "You will be asked to consider 2 situations you might face when working with prisoners, and write your response. "
        },
        {
            "text": "What if you don’t pass your OAC?"
        }
    ]
}