{
    "url": "https://environmentagency.blog.gov.uk/2023/09/01/wendling-beck-environment-project-building-financial-and-environmental-resilience-for-farmers/",
    "title": "Wendling Beck Environment Project – building financial and environmental resilience for farmers.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Uncategorized"
    ],
    "pub_date": "2023-09-01T12:35:02+00:00",
    "content": [
        {
            "text": "By Andy Slaney, Green Finance Specialist, Environment Agency"
        },
        {
            "text": "The Wendling Beck Environment Project is a habitat creation, nature restoration and regenerative farming project, spanning almost 2,000 acres near Dereham in Norfolk, UK."
        },
        {
            "text": "The project is leading the way in transforming land use and management by creating and restoring habitats at scale, delivering improvements for nature and people and providing opportunities for access, education and investment. Wendling Beck is a partnership project between landowners, local authorities, environmental charities and Anglian Water."
        },
        {
            "text": "It was one of 27 projects supported by the Natural Environment Investment Readiness Fund (NEIRF) last year – a Defra fund of up to £10 million, delivered by the Environment Agency, which provides grants to develop a pipeline of nature projects that can attract and repay private sector investment."
        },
        {
            "text": "Two years on from the announcement of this funding, I wanted to take some time to reflect on the development of this project, and why we invested in it in the first place."
        },
        {
            "text": "Innovative funding "
        },
        {
            "text": "To create financial resilience alongside increased environmental resilience, Wendling Beck is using new innovative payments from ecosystem service markets to supplement traditional farm income. The project expects to see total revenues between £60 - £90 Million over a minimum of 30 years and will create 1000 acres of species-rich grassland, 200 acres of lowland heath, 135 acres of floodplain restoration, 240 acres of woodland, 50km of new hedgerows and 5km of river restoration."
        },
        {
            "text": "A detailed finance model has been developed which anticipates market demand, credit sales, capital works and long-term management, monitoring and governance costs. Overall, the partners predict that returns will be greater than the opportunity costs of arable farming."
        },
        {
            "text": "To access payments for these new ecosystems the project has extensively measured the baseline condition of natural capital to be able to quantitively demonstrate the improvements being made. The ability to predict and subsequently verify these improvements enables the project to access new ecosystem service markets related to biodiversity net gain (BNG), and carbon credits."
        },
        {
            "text": "We worked with Wendling Beck to help develop the legal, governance and financial structures through designing an operating company that enabled the landowners to work together to facilitate ecosystem service transactions and distribution of the revenue generated. This revenue, alongside payments from the new Environmental Land Management (ELMs) scheme and more traditional farm income has made improving the natural environment a viable approach."
        },
        {
            "text": "The project demonstrates a step-change in how nature-friendly, low-carbon agricultural practices can enhance revenue for existing farm businesses over the next 30 years. The finance model accounts for revenue from ecosystem services but also the regenerative production of blackcurrants, a new livestock enterprise and farm shop, demonstrating that nature-positive practices need not sacrifice food production."
        },
        {
            "text": "Environmental and socio-economic impacts: "
        },
        {
            "text": "Wendling Beck will restore almost 2,000 acres of land and sequester and store an estimated 250,000+ tonnes of carbon in the process, whilst also restoring 5km of local rivers, all through nature-based solutions. The project will help species that have declined and disappeared over time recover, restore habitats to support native species such as turtle dove and help reverse biodiversity loss."
        },
        {
            "text": "There will also be a significant carbon reduction from reducing the use of synthetic fertilisers, fossil fuels and agro-chemicals. From 2020 to 2022, nitrogen and chemical inputs were halved and synthetic phosphate application has stopped. Importantly, this is an exemplar project, and will demonstrate how other landowners can take similar nature-positive, net-zero measures whilst diversifying income streams by leveraging private finance."
        },
        {
            "text": "Landscape restoration is expected to benefit local communities’ wellbeing, allowing people to come closer to nature and its benefits for health. A new cycle path allows all ability access, whilst a planned learning centre and environmental hub will support young people to learn about nature. The project will also help build resilience to local flooding."
        },
        {
            "text": "Moving forward: "
        },
        {
            "text": "Wendling Beck is an exciting approach to financing landscape-scale restoration, coupled with regenerative low carbon agriculture practices. It demonstrates how nature-positive farm subsidies (ELMs), compliance markets such as BNG and carbon credits, and voluntary markets such as carbon, can be used by landowners to benefit nature and continue to be financially viable."
        },
        {
            "text": "Collaboration has been an essential element: working with local authorities, environmental NGOs, utility companies, and research institutions has enabled the project to engage in a holistic approach and develop the various structures and mechanisms to monetise the ecosystem services, implement quality nature restoration and provide robust monitoring, measurement and data capture."
        },
        {
            "text": "Partnerships with the University of East Anglia and Norfolk County Council will see increased opportunities for learning. Over 15,000 school children will have access to the project annually, through the Gressenhall Museum."
        },
        {
            "text": "For more information about the types of projects we fund, visit Innovative nature projects awarded funding to drive private investment - GOV.UK (www.gov.uk)"
        }
    ]
}