{
    "url": "https://cddo.blog.gov.uk/2023/09/01/what-makes-a-service-great/",
    "title": "What makes a service ‘Great’?",
    "authors": [
        "James Peart, Top 75 Product lead, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-09-01T09:44:41+01:00",
    "content": [
        {
            "text": "In last year’s roadmap for digital and data, government committed to getting 50 of the Top 75 services to a ‘great’ standard by 2025. "
        },
        {
            "text": "Over the last year, we at the Central Digital and Data Office (CDDO) have worked with service teams across government to baseline all 75 services in order to understand their current performance and what improvements are needed to get them to ‘great’. This started with agreeing on a clear definition of what a ‘great’ service looks like and establishing a common framework for assessing service performance. "
        },
        {
            "heading": 2,
            "text": "One size does not fit all "
        },
        {
            "text": "Crafting a framework for assessing service performance across such a diverse range of services has been no easy task. The ‘Top 75’ list includes a range of services, including signing up to vote, applying for a passport and recording MOT results. It caters to a wide array of citizens' needs, but also services that assist civil servants day to day such as the Civil Service Learning Platform."
        },
        {
            "text": "Recognising this diversity, and after engaging with teams across government, we devised six distinct service types, each with its own set of benchmarks:"
        },
        {
            "heading": 2,
            "text": "A great service is usable, efficient and accessible "
        },
        {
            "text": "When we started exploring how to define a ‘great’ service, it was clear that there are no silver-bullet criteria for determining if a service is great or not. "
        },
        {
            "text": "Instead, we honed in on three key elements:"
        },
        {
            "text": "Underlying each of these elements are specific criteria that allow us to rate services as 'great,' 'good,' or 'requires improvement.' The thresholds vary based on the service type. "
        },
        {
            "text": "A user-friendly service is one where the majority of users are able to start and complete their whole service journey online (but we’d always expect the service to offer a great offline route too), and receives excellent user feedback too.  An efficient service has relatively low costs and processing each user’s journey is done in the most streamlined manner possible, saving users’ time and taxpayers’ money. A compliant service also meets accessibility standards so that everyone can access the service digitally. "
        },
        {
            "text": "A service earns a ‘great’ label only if it meets the standards across all three elements. "
        },
        {
            "heading": 2,
            "text": "Context is everything "
        },
        {
            "text": "Those three elements provide the quantitative rating, but numbers can only reveal part of the story. "
        },
        {
            "text": "We know that service provision is complex and involves a huge range of factors. To account for this, we overlay the quantitative rating with a qualitative review. This involves delving deep into each service through validation sessions, supported by additional performance indicators, independent assurance, and insights from the service teams themselves."
        },
        {
            "text": "By embracing context, we better ensure a fair assessment that truly reflects the service's performance and its unique circumstances."
        },
        {
            "text": "An example of this is where a service is collecting a penalty. In these scenarios, user satisfaction data collected after the penalty has been paid is more likely to be low regardless of how well the service worked. That’s human nature, as users may be unhappy at having to pay, which will be reflected in the user satisfaction survey. Taking into account other research about how users feel about the rest of the user journey gives us the confidence to adjust the scores."
        },
        {
            "text": "The contextual overlay allows us to reassess the quantitative score, and check that it is a fair and accurate reflection of the service's performance. "
        },
        {
            "heading": 2,
            "text": "Looking ahead to 2025"
        },
        {
            "text": "We’re using the Great Framework as a mechanism to support services. It’s helped CDDO and service teams identify areas services can make big and small changes to improve usability for users, efficiency for government, and accessibility for all. The data and insights collected have been used to make the case for change with data driven evidence, which in time will lead to measurable improvements in services. In time, we want this work to set the standard for great services across government, including those beyond the Top 75 "
        },
        {
            "text": "We’ve now got a view of service performance across the Top 75 and are working with service teams to ensure they each progress towards the ‘great’ standard by 2025. It is an ambitious aim, but one we’re very excited about working towards. "
        },
        {
            "text": " "
        }
    ]
}