{
    "url": "https://space.blog.gov.uk/2025/06/08/working-on-white-mars/",
    "title": "Working on White Mars",
    "authors": [
        "Dr Nina Purvis"
    ],
    "categories": [
        "Careers",
        "European Space Agency"
    ],
    "pub_date": "2025-06-08T08:57:00+01:00",
    "content": [
        {
            "text": "Each year the European Space Agency (ESA) selects one medical doctor with research experience, a space background, and Search & Rescue (SAR) training, to spend 13 months living and working at Concordia Station in Antarctica - also known as “White Mars” - performing biomedical research projects to help shape medical considerations for future missions to Mars.  "
        },
        {
            "text": "This year’s ESA MD is Dr Nina Purvis, a British surgical resident doctor in the NHS. "
        },
        {
            "text": "From my bedroom window as I write this, I can see a swathe of white, together with some outbuildings that make up part of Concordia Station here in Antarctica.  "
        },
        {
            "text": "Concordia Station is run by the French and Italian Polar institutes and is a multicultural and multidisciplinary research base. "
        },
        {
            "text": "Originally built as an ice core drilling site, it is now one of the only autonomous all-year-round research stations on the Antarctic continent hosting a core winterover crew of 13 scientists and technicians. Projects include astrophysics, meteorology, glaciochemistry and more. "
        },
        {
            "text": "The nickname “White Mars” becomes obvious. The extreme environment includes living atop a glacier at an altitude of 3200 metres where we experience chronic hypobaric hypoxia, months of both complete darkness and constant sunlight, low humidity, temperatures plummeting to -100°C, and total winter isolation and autonomy without any possible transport access or medevac options. "
        },
        {
            "text": "This makes it one of the harshest places to live on Earth – it is commonly said that it is more remote than living on the International Space Station.  "
        },
        {
            "heading": 2,
            "text": "My journey to White Mars"
        },
        {
            "text": "Before pursuing a career as a medical doctor, I studied and worked as a physicist, earning an integrated Master’s degree in Astrophysics, a PhD in Medical Physics, and completing a Postdoctoral Fellowship in Radiogenomics at the renowned Memorial Sloan Kettering Cancer Center in New York City. "
        },
        {
            "text": "During my medical studies, I also completed a second Master’s degree in Space Physiology & Health, further cementing my clinical and research expertise at the intersection of medicine, physics, and space exploration. "
        },
        {
            "text": "I'm from Northumberland, England, and was the first in my family to attend university. "
        },
        {
            "heading": 2,
            "text": "Researching extremes"
        },
        {
            "text": "In Antarctica, I’m conducting biomedical research on myself and my 12 crewmates, who are mirroring the conditions faced by astronauts, to investigate how isolated, confined, and extreme environments impact human physiology and psychology.  "
        },
        {
            "text": "Projects this year include investigating: exercise tolerance, cognition and learning, psychological well-being, glucose tolerance, stress, microbes on the skin and station surfaces, time perception, attention and concentration, immunity, and the microbiome.  "
        },
        {
            "text": "Each year there are different projects run by research teams across Europe, selected in calls by ESA (see here for future calls: https://scispace.esa.int/). "
        },
        {
            "text": "As well as space medicine research, I’m also the Search and Rescue Doctor for the crew, on-call 24/7 to handle any emergency from hypothermia to traumatic injury. Along with the crew rescue team, I carry out monthly exercise drills and ensure equipment is ready to go. "
        },
        {
            "text": "Concordia is a dangerous place for technicians and scientists to work, especially outside.  "
        },
        {
            "text": "I also spend my spare time on STEM outreach - giving talks to schools, universities and professional interest groups about my career path and experience on “White Mars”.  "
        },
        {
            "text": "Two astronauts selected during ESA’s most recent call, UK ESA reserve astronaut Dr Meganne Christian and Austrian ESA reserve astronaut Dr Carmen Possnig, both spent winterovers at Concordia Station in recent years.  "
        },
        {
            "text": "I hope my research will contribute to their future missions by ensuring we understand what happens to the human body and mind in extreme environments, helping create countermeasures so astronauts can perform their jobs safely and well!"
        }
    ]
}