{
    "url": "https://planninginspectorate.blog.gov.uk/2023/10/10/a-new-home-for-national-infrastructure-planning/",
    "title": "A new home for National Infrastructure Planning",
    "authors": [
        "Oliver Blower"
    ],
    "categories": [
        "Applications",
        "nationally significant infrastructure projects",
        "Service improvement"
    ],
    "pub_date": "2023-10-10T16:42:06+01:00",
    "content": [
        {
            "text": "Oliver Blower is leading the improvements to the Inspectorate’s Applications Service. In this post he explains the developments being made to the online service for nationally significant infrastructure projects (NSIPs)."
        },
        {
            "heading": 2,
            "text": "What is the Applications service and what are we improving?"
        },
        {
            "text": "The Applications service is one of the three main services offered by the Inspectorate (the other two are Appeals and Examinations). It primarily includes our work to examine and make recommendations on nationally significant infrastructure project applications."
        },
        {
            "text": "These are the largest and most complex cases we handle at the Inspectorate. They include projects such as large offshore windfarms, solar arrays, large road alterations and rail projects."
        },
        {
            "text": "As part of our work to make regime improvements in line with the government’s NSIP reform action plan, we are modernising the National Infrastructure Planning website – an essential online hub for information and engagement about NSIPs."
        },
        {
            "text": "The goal is to make it easier and more intuitive for people to take part in the NSIP process."
        },
        {
            "heading": 2,
            "text": "Phased approach"
        },
        {
            "text": "If you’ve been following our updates, then you may have heard about earlier phases of this work (see links at the foot of this post)."
        },
        {
            "text": "We've adopted a staged method, subtly updating specific website components, while maintaining legacy pages as gateways to these new additions."
        },
        {
            "heading": 2,
            "text": "New features overview"
        },
        {
            "text": "So far, several new features have been integrated into the service:"
        },
        {
            "text": "These features are currently operational for 19 national infrastructure projects and can be accessed via the legacy project overview pages."
        },
        {
            "heading": 2,
            "text": "Unified project information page"
        },
        {
            "text": "We are pleased to inform that yesterday we successfully launched the first project information page! This consolidates the above features into a single page (as depicted in the image below). This integration enables users to navigate the platform consistently throughout a project's duration without transitioning between the legacy and updated site."
        },
        {
            "text": "The Rampion 2 Offshore Windfarm project served as the initial test case for this integration. Plans are in place to extend this to all projects in the subsequent months."
        },
        {
            "text": "Moreover, this page has been designed to communicate efficiently with our backend system to relay real-time updates to users."
        },
        {
            "heading": 2,
            "text": "Accessibility focus"
        },
        {
            "text": "Accessibility remains a priority in our redesign. The interface has been developed with considerations for screen reader users and ensures ease of interaction for all users, regardless of their familiarity with the application process."
        },
        {
            "heading": 2,
            "text": "Future developments"
        },
        {
            "text": "While the project information page has been updated, many users still access projects through the legacy homepage or project search. Our upcoming focus includes updates to:"
        },
        {
            "text": "These sections are currently undergoing design or development and are expected to be launched at the beginning of next year. We are also dedicated to refining the already launched sections based on feedback."
        },
        {
            "heading": 2,
            "text": "Your feedback helps to improve the service"
        },
        {
            "text": "Each new page provides a button at the top for giving feedback. If you use the site, we encourage you to share your feedback so that we can continuously improve the service."
        },
        {
            "heading": 2,
            "text": "Previous posts"
        }
    ]
}