{
    "url": "https://forestrycommission.blog.gov.uk/2023/10/10/behind-the-scenes-at-the-forestry-commission-managing-ips-typographus-five-years-on/",
    "title": "‘Behind the Scenes’ at the Forestry Commission: Managing Ips typographus….. five years on",
    "authors": [
        "Fred Toft"
    ],
    "categories": [
        "Tree health"
    ],
    "pub_date": "2023-10-10T18:06:31+01:00",
    "content": [
        {
            "text": "Ips typographus aka the eight-toothed spruce bark beetle is a serious pest of spruce trees in Europe. It was first identified in the UK in 2018, on Norway spruce in a Kent woodland."
        },
        {
            "text": "Since that discovery, the Forestry Commission, along with colleagues from the Plant Health Service, have been working at pace, surveying, gathering evidence, and investigating hundreds of sites, covering approximately 1,370 hectares (13.7 square miles). This helps understand the conditions needed for its establishment, while taking robust action to reduce the risk of spread and bringing infected sites under active management. Ips typographus is currently subject to eradication measures in the south of England."
        },
        {
            "heading": 2,
            "text": "The Impact"
        },
        {
            "text": "Although the beetle poses no threat to human health, it can have a serious impact on our spruce trees. They bore into wood where they attract mates and lay eggs, while adult beetles can fly up to 4km in search of suitable host material such as damaged, stressed, and dying spruce."
        },
        {
            "text": "Under the right environmental conditions, not yet seen in the UK, beetle numbers can increase enough to result in attacks on healthy trees. This means if the beetle was left uncontrolled and was to establish in Great Britain, it has the potential to cause significant economic and environmental damage to our forestry and timber industries."
        },
        {
            "heading": 2,
            "text": "The Science"
        },
        {
            "text": "A team of entomologists (insect scientists) from Forest Research play a leading role in the response, they are ready and waiting at the Alice Holt Forest Research station in Hampshire for any potential findings. Samples of bark panels are rushed inside the biosecure quarantine laboratory to identify any beetles that might be inside. The beetles are examined under microscope to confirm if they are Ips typographus by counting the teeth-like structures on their wing cases and other features such as their antennae."
        },
        {
            "text": "Once Ips typographus is confirmed to be breeding at a site it is labelled an “eradication site” and Forest Research (FR) scientists along with Forestry Commission (FC) colleagues will visit to assess the severity of the infestation. There are currently 44 eradication sites (found since 2018) in the southeast of England, and a 10km grid summary map provides an overview of the confirmed outbreak areas."
        },
        {
            "text": "Sanitation felling to remove unhealthy spruce must be undertaken at eradications sites and eventually the removal of all spruce (in a defined area). Traps are added to monitor and “soak up” any beetles left in harvesting residue or from overwintering in the soil or leaf litter and are present at each eradication site for three years. The number of Ips typographus caught each fortnight are counted to monitor the efficacy of eradication actions. The approach is effective, with Ips typographus now officially declared eradicated from the first outbreak site found in 2018."
        },
        {
            "text": "Our scientists also monitor for potential new eradication sites using a network of traps named “Wider Environment” or WE. These are at their highest density in Kent and East Sussex but extend as far north as Kielder Forest in Northumberland and as far west as Devon. There is also a GB wide trapping programme through the Forest Trapping Network, and trapping at points of entry such as ports. Any findings are reported back to the outbreak planning team to help decide where to concentrate efforts to find any new breeding populations. In 2022 1,605 WE trap catch samples were processed by FR entomologists."
        },
        {
            "text": "Although it had always been previously thought that the most likely pathway for the beetle to reach the UK was via imported wood or wood packaging a new hypothesis that the beetle was naturally dispersing across the channel was suggested after the first WE traps in 2019 caught Ips typographus, but ground surveys in 2019 & 2020 failed to find any evidence of breeding populations in the UK. A Defra-funded study testing this hypothesis was conducted by scientists at FR and the Université libre de Bruxelles, and its results supported the hypothesis of natural dispersal across the channel."
        },
        {
            "text": "This work is now being expanded using computer modelling in collaboration with the University of Cambridge and the Met Office to understand how weather patterns and winds can influence the beetle’s dispersal from the continent. All the outbreak sites are believed to be a result of incursions of the beetle from the continent, and there is no evidence of spread from breeding within England."
        },
        {
            "text": "Another Defra-funded study has been examining the attractiveness of Sitka spruce as a host, and the beetle’s breeding success on cut Sitka spruce material. So far results show that cut Sitka Spruce material appears to be equally attractive as Norway Spruce, and the beetles can use it effectively as a host for breeding. However, the defensive capabilities of live, standing trees will be different to cut logs, so further work is underway to investigate breeding success on live Sitka Spruce."
        },
        {
            "heading": 2,
            "text": "The Control"
        },
        {
            "text": "As part of our robust response, we have been overseeing integrated eradication and surveillance programs to detect the pest early and prevent it from becoming established in the UK. We have employed ground and aerial surveillance techniques, targeting spruce trees displaying signs of deteriorating health that are vulnerable to infestation. Since 2021 we have inspected over 500 sites for signs and symptoms of Ips typographus. Susceptible trees are examined closely, and where necessary, they are felled and inspected on the ground for signs of infestation."
        },
        {
            "text": "Aerial surveillance planning is informed using WE traps to identify areas of high trap counts for helicopter surveillance of declining spruce needing further investigation. We also combine historic and current target site data with pest & disease data from Statutory Plant Health Notices (SPHN) helping build an awareness of the regional situation and enhance in-flight assessment. This is used for target on-ground inspections at sites where symptoms observed from the air match those likely to have a higher chance of Ips typographus being the causal agent."
        },
        {
            "text": "The control effort continues from a policy perspective too. In July 2022, following identification of several outbreak sites in Kent, East Sussex, and West Sussex, an extended demarcation area (DMA) was introduced to cover parts of Hampshire and combat further spread. Alongside this a visual guide is available on the movement restrictions of spruce trees originating within the DMA. It is now a requirement for anyone felling or moving spruce trees within the extended DMA to inform the Forestry Commission in writing before any work, to date we have undertaken over 250 of these inspections in addition to general ground surveillance."
        },
        {
            "text": "Our overriding objective with Ips typographus is to eradicate it from the UK and we have taken tough measures to ensure that discovered breeding establishments do not get a chance to develop and spread. This has led to the unfortunate but necessary step of instructing affected landowners to remove and destroy infested and neighbouring spruce trees. By promptly eliminating the affected trees, we aim to break the lifecycle of the pest and prevent its establishment. While this action may be difficult, it reflects our commitment to eradicating outbreaks and protecting spruce-based forestry across the UK."
        },
        {
            "text": "Over the course of the recent outbreaks, FC, FR, and Defra work to ensure that spruce harvested proactively or in response to an infestation is maximised for its use and revenue. This is achieved by taking a risk-based approach by assessing the infected material, trying to minimise the amount that requires chipping and maximise the amount that can be removed as roundwood, while adhering to strict biosecurity protocols. With this approach, we are not only addressing the immediate threat posed by this pest, but we are also ensuring the long-term vitality of our forests for future generations."
        },
        {
            "text": "We continue to learn from our operational response to outbreaks and from our increasing scientific understanding of the pest, to help direct our policies ensuring they are risk based and proportionate. This learning also enables us to overcome the challenges Ips typographus presents, such as identifying where the pest may arrive and establish, understanding the economic and environmental risks associated with establishment and recognising the different needs of landowners."
        },
        {
            "text": "We are also looking to the future and how we continue to manage the ongoing incursions of this pest from the continent and prevent establishment. In the long term we are encouraging land owners to proactively remove spruce from the DMA where it is at most risk of Ips typographus infestation, and replant with non-susceptible tree species."
        },
        {
            "heading": 2,
            "text": "Support for Landowners"
        },
        {
            "text": "Elliot Carpenter is our Ips typographus Woodland Officer providing advice and guidance to stakeholders on the management of spruce within the Ips typographus DMA. He is seeking to increase awareness of the risks, the requirements and processes associated with spruce trees and the pest, and to help people access the information and support where they need it."
        },
        {
            "text": "He explained:"
        },
        {
            "text": "Elliot is also secretary for the ‘Ips typographus Industry Group’, a forum for government and forestry sector representatives involved in the management of the pest and spruce, primarily within the DMA, but also looking further across the country. Representatives from FC, FR, Defra, Confor, harvesting contractors, forestry & land agents, woodland managers, and timber/wood processors meet to share understanding of the situation surrounding the pest and to work together on issues affecting the sector."
        },
        {
            "text": "The group connects those at the frontline of tackling this issue with policy makers, ensuring policy and grant support is informed by the situation on the ground. Input from the group has already led to improved guidance and communications materials, market development, as well as informing policy and grants."
        },
        {
            "text": "If you own or manage spruce within the Ips typographus DMA, grants are available through the Tree Health Pilot scheme to manage or fell trees, restock woodland and maintain newly planted trees. Landowners can receive funding for felling (80% net cost) and infrastructure (40% net cost) where the sale of timber does not cover their operational costs. Felling spruce can remove the risk of Ips typographus infestation as it reduces the opportunity for colonisation. It may sometimes be required as a condition of an SPHN to ensure that infested trees and susceptible spruce are destroyed."
        },
        {
            "text": "Predicted climate change means that healthy spruce may not remain so over future years, therefore early felling could reduce the risk of these areas becoming future outbreak sites. As of 2 October 2023, we have had 44 applications to the Tree Health Pilot for Ips typographus on spruce; 29 reactive and 15 proactive, with 92.35 hectares of woodland replanted."
        },
        {
            "text": "Proactive management has enabled a range of landowners to remove the risk, and so eliminate the potential extra costs and obligations arision from an SPHN. The actions these landowners are taking, not only de-risk the issue on their own land holding but reduce the risk for surrounding landowners. Case studies are available showing the journey and experiences of different landowner and holding types."
        },
        {
            "text": "Your local Woodland Officer can also help with advice on managing your woodland, the support available and the regulatory processes involved. If you are based in the Southeast and London, contact southeast.fce@forestrycommission.gov.uk."
        },
        {
            "heading": 2,
            "text": "Biosecurity"
        },
        {
            "text": "Pests such as Ips typographus can be spread through infested bark and vegetation. If you harvest spruce, ensure machinery is cleaned and free of debris & vegetation before it leaves a woodland site. We have worked closely with the industry to develop specific biosecurity guidance when visiting or working in woodlands to help reduce the risk of introducing and spreading tree pests and diseases. We can all do our bit by taking some simple steps to help limit the spread:"
        }
    ]
}