{
    "url": "https://naturalengland.blog.gov.uk/2023/10/10/black-history-month-2023-saluting-our-sisters/",
    "title": "Black History Month 2023: Saluting Our Sisters",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Education",
        "Mental health and wellbeing",
        "Natural England",
        "Uncategorized"
    ],
    "pub_date": "2023-10-10T11:20:14+01:00",
    "content": [
        {
            "text": "October is Black History Month, and across the Defra Group we are celebrating the twin themes of ‘Eliminating prejudice is everyone’s business’ and ‘Saluting Our Sisters’- honouring the achievements of Black women."
        },
        {
            "text": "Black History Month is a time to celebrate the contributions of Black people to the UK and highlights those unsung heroes making the world a better place for others. Such as Yvonne Witter, chair of Peak District Mosaic, who has been instrumental in engaging the black community with the Peak District. Or Dominique Palmer, a climate justice activist featured in the Forbes 100 UK Environmentalists List. Palmer’s campaigning work has focused on climate change issues that intersect with social issues, much like Nobel Prize Winner, Wangari Maathi, whose Green Belt movement started to support women and to conserve the environment."
        },
        {
            "text": "These women are part of a legacy that we are celebrating this month, a legacy that stretches back hundreds of years."
        },
        {
            "text": "Mary Seacole, the British Jamaican nurse is best known for her tireless work in the Crimean war and for the discrimination she faced and overcame. However, less in focus is her extensive knowledge of medicinal herbs and plants which she was able to use to treat the sick. Yet, now in 2023 we can celebrate"
        },
        {
            "text": "Professor Nox Makunga – an award-winning botanist and science communicator at Stellenbosch University in South Africa, who specialises in the study of medicinal plants and their use in a non-destructive and sustainable way. Makunga, like Seacole had to overcome challenges, she was the only Black female scientist working in her department, but her research into Dodonaea viscosa or the sand olive plant is focusing on the potentially life changing anti-cancer properties found in the plant."
        },
        {
            "text": "As we move from science to literature, we celebrate a host of black female writers that focus on the healing nature of gardens; how we connect with nature and our heritage; and climate change. Jamaica Kincaid, the Antiguan born novelist and professor of African American studies at Harvard University, is a prolific gardener and gardening writer.  ‘My Garden Book’ and her memoir ‘Among Flowers’ have her gardening adventures and life’s lessons learnt from her garden in Vermont as the subject; a similar topic covered by Trinidadian writer and psychotherapist Marchelle Farrell in ‘Uprooting’ where she learns to love her garden in Somerset and find a home in England. The Southwest of England is also the subject of Elizabeth Jane Burnett’s ‘The Grassling’, a stunning book that is part poetry, part memoir, and part nature writing that focuses on her relationship with her father, wild swimming, and her intimate relationship with the Devon countryside."
        },
        {
            "text": "Finally, we come to 25-year-old Mikaela Loach’s’ ‘It's Not That Radical: Climate Action to Transform Our World’ where she ‘reframes the climate change debate, arguing that it requires racial equality – a pathway to a better world for everyone…"
        },
        {
            "text": "As we celebrate these women, we recognise that we have come far, but there is still much work to do. As part of our commitment to anti racism and a more inclusive workforce, Natural England have signed up to a joint route map launched to boost ethnic diversity in the environment sector."
        },
        {
            "text": "For Black History Month this year we are encouraging staff to take part in the 5-day challenge built by the Race Equality Matters Community. The challenge is to spend 5 minutes on an activity that encourages reflecting on and taking action to drive Race Equality for 5 days. You can find out more here: https://www.raceequalitymatters.com/5-day-challenge/."
        },
        {
            "text": "Will you join us?"
        },
        {
            "text": " "
        },
        {
            "heading": 5,
            "text": "Michelle Mangal,"
        },
        {
            "heading": 5,
            "text": "Team Leader, National Operations, National Nature Reserves"
        },
        {
            "heading": 5,
            "text": "Natural England"
        },
        {
            "text": " "
        }
    ]
}