{
    "url": "https://food.blog.gov.uk/2023/10/10/chief-executives-message-to-stakeholders-food-fraud-working-group/",
    "title": "Chief Executive’s message to stakeholders - Food Fraud Working Group",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2023-10-10T10:25:14+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Earlier this year I wrote to you about a criminal investigation being carried out by the FSA’s National Food Crime Unit (NFCU) into suspected meat fraud."
        },
        {
            "text": "Since then, we have been working with representatives of the food industry, through our Food Fraud Working Group, to identify where we can strengthen the food system to protect against criminal activity."
        },
        {
            "text": "There are three lines of defence for making sure that food is safe and authentic – food businesses, local authorities, and regulators. But there are ongoing risks from criminals who want to break the rules, so we must continue to improve the system to make this more difficult."
        },
        {
            "text": "The Food Fraud Working Group agreed that strong and clear whistleblowing arrangements are an important part of the protections against food fraud. With different telephone numbers being run by industry and government, it’s not always clear where whistleblowers should report their concerns. So, the FSA has launched a new whistleblower hotline where people can report suspected food fraud."
        },
        {
            "text": "The new number for Food Crime Confidential is 0800 028 11 80."
        },
        {
            "text": "All members of the working group have agreed to help promote or otherwise support this hotline within the food industry in England, Wales and Northern Ireland. The FSA will provide communications material in a range of languages to help them."
        },
        {
            "text": "We’re strengthening the role that third-party assurance schemes play in passing on information to regulators. The FSA has historically worked with FSA-approved schemes. Building on our experience of information sharing with schemes like Red Tractor, we're now going to be working closely with a much broader range of assurance schemes that have agreed to share important data with us to help prevent food fraud. Initially, they will share the details of food manufacturing businesses that have been removed from their schemes, and we're working with them and their members to explore further intelligence sharing in the future."
        },
        {
            "text": "The working group has also helped the FSA to improve the way we share intelligence-based alerts to better warn businesses about potential food fraud. We have now refined the format of the FSA’s alerts to help businesses check their supply chains, without jeopardising the integrity of any criminal investigations underway."
        },
        {
            "text": "We expect our food to be safe and what it says it is, but there will always be risks from rogue actors within the food system. This is highlighted in new research published today by the FSA which shows that food crime in the UK costs up to £2 billion per year. The Cost of Food Crime report shows us how the cost of food fraud is shared by consumers, businesses and regulators alike. We’ve also published the What Works to Prevent Food Fraud report which sets out the ways in which we can further strengthen our lines of defence."
        },
        {
            "text": "If you have any questions or comments on these reports, or on food crime more generally please comment below."
        },
        {
            "text": "You can report a food crime to the FSA on our new number 0800 028 11 80, or on our dedicated Report a food crime webpage."
        },
        {
            "heading": 1,
            "text": "Diweddariad gan yr Asiantaeth Safonau Bwyd i randdeiliaid ynghylch y gweithgor twyll bwyd"
        },
        {
            "text": "Ysgrifennais atoch yn gynharach eleni ynglŷn ag ymchwiliad troseddol sy’n cael ei gynnal gan Uned Genedlaethol Troseddau Bwyd (NFCU) yr Asiantaeth Safonau Bwyd (ASB) i amheuaeth o dwyll cig. Gallwch ddarllen ein datganiad gwreiddiol yma. Ers hynny, rydym wedi bod yn gweithio gyda chynrychiolwyr o’r diwydiant bwyd, drwy ein Gweithgor Twyll Bwyd, i nodi lle y gallwn gryfhau’r system fwyd i ddiogelu rhag gweithgarwch troseddol."
        },
        {
            "text": "Mae tair llinell amddiffyn ar gyfer sicrhau bod bwyd yn ddiogel ac yn ddilys – busnesau bwyd, awdurdodau lleol, a rheoleiddwyr. Ond mae risgiau parhaus gan droseddwyr sydd am dorri’r rheolau, felly mae’n rhaid i ni barhau i wella’r system i wneud hyn yn anoddach iddynt."
        },
        {
            "text": "Cytunodd y Gweithgor Twyll Bwyd fod trefniadau chwythu’r chwiban cryf a chlir yn rhan bwysig o’r mesurau diogelu yn erbyn twyll bwyd. Gan fod y diwydiant a’r llywodraeth yn cynnal gwahanol rifau ffôn, nid yw bob amser yn glir i ble y dylai chwythwyr chwiban droi er mwyn adrodd eu pryderon. Felly, mae’r ASB wedi lansio llinell gymorth newydd i chwythwyr chwiban lle gall pobl adrodd am dwyll bwyd a amheuir. Y rhif newydd yw 0800 028 11 80.  Mae holl aelodau’r gweithgor wedi cytuno i helpu i hyrwyddo neu gefnogi’r llinell gymorth hon o fewn y diwydiant bwyd yng Nghymru, Lloegr a Gogledd Iwerddon. Bydd yr ASB yn darparu deunydd cyfathrebu mewn amrywiaeth o ieithoedd i’w helpu."
        },
        {
            "text": "Rydym yn cryfhau’r rhan y mae cynlluniau sicrwydd trydydd parti yn ei chwarae wrth drosglwyddo gwybodaeth i reoleiddwyr. Yn hanesyddol, mae’r ASB wedi gweithio gyda chynlluniau a gymeradwyir gan yr ASB. Gan adeiladu ar ein profiad o rannu gwybodaeth gyda chynlluniau fel y Tractor Coch, rydyn ni nawr yn mynd i fod yn gweithio’n agos gydag amrediad ehangach o lawer o gynlluniau sicrwydd sydd wedi cytuno i rannu data pwysig gyda ni i helpu i atal twyll bwyd. I ddechrau, byddant yn rhannu manylion busnesau gweithgynhyrchu bwyd sydd wedi cael eu tynnu oddi ar eu cynlluniau, ac rydym yn gweithio gyda nhw a’u haelodau i archwilio trefniadau ar gyfer rhannu cudd-wybodaeth bellach yn y dyfodol."
        },
        {
            "text": "Mae’r gweithgor hefyd wedi helpu’r ASB i wella’r ffordd y mae’n rhannu rhybuddion sy’n seiliedig ar gudd-wybodaeth er mwyn rhybuddio busnesau’n well am dwyll bwyd posib. Rydym bellach wedi mireinio fformat rhybuddion yr ASB i helpu busnesau i wirio eu cadwyni cyflenwi, a hynny heb beryglu uniondeb unrhyw ymchwiliadau troseddol sydd ar y gweill."
        },
        {
            "text": "Rydym yn disgwyl i’n bwyd fod yn ddiogel ac iddo gyd-fynd â’r hyn sydd ar y label, ond bydd unigolion twyllodrus o fewn y system fwyd bob amser yn peri risg i hyn. Amlygir hyn mewn ymchwil newydd a gyhoeddwyd heddiw gan yr ASB sy’n dangos bod troseddau bwyd yn y DU yn costio hyd at £2 biliwn y flwyddyn. Mae’r adroddiad Cost Troseddau Bwyd yn dangos i ni sut mae cost twyll bwyd yn cael ei rhannu gan ddefnyddwyr, busnesau a rheoleiddwyr fel ei gilydd. Rydym hefyd wedi cyhoeddi’r adroddiad Beth Sy’n Gweithio i Atal Twyll Bwyd (What Works to Prevent Food Fraud) sy’n amlinellu sut y gallwn gryfhau ein llinellau amddiffyn ymhellach."
        },
        {
            "text": "Os oes gennych unrhyw gwestiynau neu sylwadau ar yr adroddiadau hyn, neu ar droseddau bwyd yn fwy cyffredinol rhowch sylwadau isod."
        },
        {
            "text": "Gallwch roi gwybod i’r ASB am drosedd bwyd ar ein rhif newydd, sef 0800 028 11 80, neu ar ein tudalen we bwrpasol."
        }
    ]
}