{
    "url": "https://socialcare.blog.gov.uk/2023/10/10/choice-and-control-in-the-adult-social-care-sector/",
    "title": "Choice and control in the adult social care sector",
    "authors": [
        "Dr Laura Griffith"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-10-10T11:48:57+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A consensus on care"
        },
        {
            "text": "In the last ten years, landmark legislation and policy frameworks in all nations have sought to create social care systems which are more person-centred and support individuals to have more choice and control."
        },
        {
            "text": "In England, the adult social care white paper, People at the heart of care, wants to see more people having ‘choice, control and support to live independent lives’. Meanwhile, in Wales, personalised care is one of ten national design principles to drive improvement in health and care."
        },
        {
            "text": "In Northern Ireland, a recent consultation on adult social care reforms highlighted the public interest in choice and control being at the heart of any future reforms. Lastly, in Scotland, proposals for a National Care Service are underpinned by a desire to place the person at the heart of decision making."
        },
        {
            "heading": 2,
            "text": "IMPACT – what happened"
        },
        {
            "text": "IMPACT, the UK-wide centre for implementing evidence in adult social care, set up a series of networks across the UK to help make choice and control a reality. The networks met over six months in 2022, to address the barriers to supporting more people to have choice and control, practical solutions, and national and local actions which could facilitate greater progress."
        },
        {
            "text": "For example, in East Sussex and Devon, the two networks focused on designing together a user-friendly, flexible and supportive approach to implementing Individual Service Funds. In Swansea, a group of adults with learning disabilities who had set up a formal user-led co-operative to pool their direct payments and collectively decide how to support their care needs wanted to facilitate the creation of other co-ops across Wales, as well as expand their membership."
        },
        {
            "heading": 2,
            "text": "Making choice and control work"
        },
        {
            "text": "What can stop choice and control working well are barriers created by misunderstandings and lack of awareness about policies and support options. Someone in the networks asked: “How do you choose if you don’t know what the choice is?”."
        },
        {
            "text": "Network members felt people should be supported to take risks, but risk averse attitudes – from the person, their family, support provider or social worker – can often stop this happening. Sharing risks, taking positive risks and working together can all be positive but sometimes there can be tension between what the person wants and what their family might want."
        },
        {
            "heading": 2,
            "text": "Making change happen"
        },
        {
            "text": "What will be familiar to anyone trying to change a system is coming up against rigid systems and processes – the networks found that seeking early engagement from colleagues in procurement, finance and legal services can be helpful in designing more flexible approaches."
        },
        {
            "text": "Trying to overcome practical challenges can often be where a good idea succeeds or fails – the location and availability of services was vitally important – very rural locations meant choices were limited. Some people found they only heard about services through word of mouth, and the information about options was scarce."
        },
        {
            "text": "Getting the funding right is vital and often highlights the disconnect between social care and health – health services paid directly for some services rather than putting it into the budget so individuals could choose."
        },
        {
            "text": "To find out more about IMPACT’s work with local networks, the evidence behind making choice and control work, and ideas about best practice in this area, head over to the Choice and Control page of the IMPACT website."
        }
    ]
}