{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/10/10/diag-presents-national-biology-week/",
    "title": "DIAG presents National Biology Week",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "GSE Opportunities"
    ],
    "pub_date": "2023-10-10T16:11:55+01:00",
    "content": [
        {
            "text": "\nThe 16 to 20 October marks the Royal Society of Biology’s (RSB) National Biology Week, which aims to celebrate and raise the profile of the innovative work that bio-scientists across the world are doing every day to overcome some of our most pressing global issues. "
        },
        {
            "text": "From APHA, DEFRA and MHRA, to the Cabinet and the Home Office, the Civil Service employs biologists in all corners of its networks, where they carry out important and ground-breaking work to help us all in our everyday lives. "
        },
        {
            "text": "The GSE Diversity and Inclusivity Action Group (DIAG) works to embed equity, diversity and inclusivity across GSE, and in celebration of the RSB’s National Biology Week, we are running a programme of events to highlight the diversity of biology-based roles available within the Civil Service. During this week, we want to explore the variety of Civil Service projects that employ biological sciences, shedding light on the interesting and diverse range of career pathways that led our biologists to where they are now."
        },
        {
            "text": "The appointment of Professor Dame Angela McLean DBE FRS as the new Government Chief Scientific Adviser (GCSA) earlier this year marked a key milestone, with Dame Angela being the first woman to the hold the GCSA position. Given Dame Angela’s outstanding career in the field of biological sciences, the Diversity Inclusion Action Group (DIAG) were keen to mark this year’s Royal Society of Biology’s National Biology Week (16-20 October 2023) and highlight the successes of biologists across the wider Civil Service through a series of events scheduled throughout the week. "
        },
        {
            "heading": 3,
            "text": "What’s on: "
        },
        {
            "text": "Monday 16 October: Start National Biology Week by watching a very special introduction by our Head of Profession, Professor Dame Angela McLean, as she talks about her career, the biologists who inspire her and the advice she would give to young people today.    "
        },
        {
            "text": "Tuesday 17 October, 12:00-13:00: In Conversation with Dr Clare Benton: Badgers, TB and PhDs... (Open to all Civil Servants)"
        },
        {
            "text": "Clare has worked for the National Wildlife Management Centre in the Animal and Plant Health Agency for 14 years in a variety of roles related to badgers and bovine TB, from full-time fieldworker to now leading a team.  APHA also helped her study part-time for a PhD, which she completed in 2017. In this talk, Clare will be talking about her career, badgers and why she likes biology. "
        },
        {
            "text": "Thursday 19 October, 12:00-13:00: In Conversation with Dr David Kenyon: DNA, Diagnostics and Dyslexia (Open to all Civil Servants) "
        },
        {
            "text": "David is Head of Chemistry, Molecular Biology and Wildlife at SASA, a division of the Scottish Government, and current chair of the Disability Working Group. A plant pathologist by background, David will talk about his career helping to protect UK crops from disease and getting distracted by the potential of molecular tools to tell us what bees eat and how to solve wildlife crime.  "
        },
        {
            "text": "Thursday 19 October, 18:00-19:00: “What’s it like to be a biologist in government” (Open to public) "
        },
        {
            "text": "To celebrate National Biology Week, we will be hosting a panel event on biological careers within the Civil Service on Thursday 19 October at 6pm on Zoom. This interactive session is aimed at secondary school--aged children upwards and will give an insight into the wide range of careers there are within the Civil Service.   "
        },
        {
            "text": "Our speakers include Dr Charlotte Cook – Foresight Project Advisor, Government Office for Science "
        },
        {
            "text": "‘Charlotte embarked on her biology journey with a passion for the subject but uncertain about her direction. She explored various aspects during her biology degree and while there, she developed a passion for infectious diseases. After completing her postdoctoral studies, Charlotte took on a new challenge in 2023 by joining the Civil Service as a Foresight Project Officer in the Government Office for Science. In this role, she leverages her diverse skill set to identify and assess chronic risks, particularly all things biological.’ "
        },
        {
            "text": "Elizabeth Gray – Private Secretary to Professor Jennifer Rubin, Chief Scientific Adviser at Home Office and Director General at the Science, Technology, Analysis and Research (STAR) Group "
        },
        {
            "text": "‘Liz studied Microbiology at Imperial College London followed by an MSc in Veterinary Epidemiology at the Royal Veterinary College and London School of Hygiene and Tropical Medicine. She now works in the Home Office Chief Scientific Advisor's Office, which has enabled her to provide advice on her background subjects, such as on TB and Avian Influenza, while working on high-profile and high-priority issue’ "
        },
        {
            "text": "Dr Izzy Webb – Head of Engineering Biology and Technology Strategy, DSIT "
        },
        {
            "text": "‘Prior to Izzy’s role as Head of Engineering Biology and Tech Strategy, Izzy worked in the Business Secretary’s Office, leading on R&D policy, and has worked in the Prime Minister’s Policy Unit leading on technology policy. Izzy joined the Civil Service as a Generalist on the Civil Service Fast Stream where she held roles in various policy departments, including BEIS and Defra.’  "
        },
        {
            "text": "Dr Megan Rafter – Senior Portfolio Manager, Research Strategy and Programmes: Rules of Life at the Biotechnology and Biological Sciences Research Council "
        },
        {
            "text": "‘Megan was interested in science from a young age but didn’t realise she could pursue it until she attended a chemistry camp at the University of Bristol during secondary school. In 2020, she joined the Biotechnology and Biological Sciences Research Council (BBSRC) and now works as a Senior Portfolio Manager. In this role, she develops and manages programmes of strategic bioscience research investment.’ "
        },
        {
            "text": "If you are aware of any local schools, colleges or universities that may be interested in this event, please share the link to register. "
        },
        {
            "heading": 3,
            "text": "Would you like to be involved with future events? "
        },
        {
            "text": "The Diversity and Inclusivity Action Group is a volunteer-led group chaired by Evelyn Toalster (Intellectual Property Office) and has members from across the GSE. DIAG is always looking for new members from GSE to be involved and progress its aim of making the profession as diverse and inclusive as it can be. Within DIAG there are four working groups focussing on those with disabilities, minority ethnic groups, social mobility, and women.  "
        },
        {
            "text": "For more information on these working groups, please visit the GSE homepage, or to join DIAG, please email the GSE profession team: gse@go-science.gov.uk. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}