{
    "url": "https://nda.blog.gov.uk/engineering-the-future/",
    "title": "Engineering the future",
    "authors": [
        "Daniel Gilmore"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-10T15:02:45+01:00",
    "content": [
        {
            "text": "For chartered engineer Daniel Gilmore, working life is made up of “what ifs”."
        },
        {
            "text": "Daniel, a chartered engineer, is one of our subject matter experts in finite element analysis."
        },
        {
            "text": "Sellafield Ltd is almost unique in having its own team, working as part of our design engineering capability, who can be called on to look into the future and predict how our structures will perform in extreme situations."
        },
        {
            "text": "As the business works to clean up the Sellafield site in West Cumbria, it is creating facilities to deal with the waste and stores which will keep that waste safe and secure for decades to come."
        },
        {
            "text": "Given the nature of what we do, those facilities and stores have to be able to stand up to anything the next century might throw at them."
        },
        {
            "text": "When Daniel joined Sellafield 7 years ago as an engineering graduate, he didn’t have any aspirations to take on this role."
        },
        {
            "text": "Daniel is based at our offices in Warrington but will be at the Sellafield site soon, looking at the defunct heat exchanger still stood in the Calder Hall former power station."
        },
        {
            "text": "The 400-tonne monster is set to be craned out of the building, and it’s Daniel’s job to make sure the 70-year-old piece of kit will be able to take the pressures of being lifted."
        },
        {
            "text": "He also recently worked on one of our soon-to-be-built stores on the Sellafield site. These facilities will be where our waste will go until a permanent place can be found for it, so could be expected to last for decades."
        },
        {
            "text": "Using his skills Daniel was able to show that the stores didn’t need the foundations specified in the original design. Working with the design team he was able to come up with new solutions that used less concrete but maintained safety, making the building more sustainable and cheaper to build."
        },
        {
            "text": "For details of our current engineering vacancies, visit our Sellafield Ltd careers website"
        }
    ]
}