{
    "url": "https://educationhub.blog.gov.uk/2023/10/10/how-were-helping-look-after-the-mental-health-of-children-and-young-people/",
    "title": "How we’re helping look after the mental health of children and young people",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Mental Health"
    ],
    "pub_date": "2023-10-10T14:10:57+01:00",
    "content": [
        {
            "text": "Schools and colleges play an important role in promoting and supporting the positive mental health and wellbeing of pupils and students.  "
        },
        {
            "text": "To help those working with children understand the bigger picture when it comes to children’s wellbeing, we’ve published our State of the Nation report, which focuses on trends in mental health and wellbeing in academic year 2021/22. You can read more about the report on Gov.uk.  "
        },
        {
            "text": "A range of mental health and wellbeing support is available for pupils, students and teaching staff, from grants to train senior mental health leads in schools to online support for university students. Here’s what you need to know.   "
        },
        {
            "heading": 3,
            "text": "Grants for senior mental health leads in schools   "
        },
        {
            "text": "We are supporting schools and colleges to provide learning environments that promote mental wellbeing, identify individuals’ needs and offer appropriate targeted support to children and young people.  "
        },
        {
            "text": "14,000 schools and colleges have now claimed a grant to train a senior mental health lead, helping them to develop their approach to mental health and wellbeing. Schools and colleges are encouraged to claim a grant now and book training this academic year.   "
        },
        {
            "text": "Settings that have previously claimed a grant and their senior mental health lead has now left, can now apply for a second  grant, worth up to £1,200 to train their replacement.   "
        },
        {
            "text": "You can find out more about who’s eligible and how to apply on Gov.uk.   "
        },
        {
            "heading": 3,
            "text": "What else are we doing to help schools and colleges support good mental health?  "
        },
        {
            "text": "To expand access to early mental health support in schools and colleges, we are also increasing the number of Mental Health Support Teams (MHSTs). These offer support in schools and colleges, including for common mental wellbeing issues such as anxiety and low mood.   "
        },
        {
            "text": "They also support a setting to develop their approach to mental health and wellbeing, and to liaise with specialist services in the community where needed, and we’re extending the coverage of the support available to at least 50 percent of pupils and students in England by March 2025.  "
        },
        {
            "text": "You can find out more about what schools and colleges have to say about being supported by an MHST on Gov.uk.   "
        },
        {
            "text": "We are also developing an online hub with a wide range of practical and evidence-informed resources for mental health leads, and an interactive online toolkit to help schools and colleges to identify options and develop their targeted support offer for pupils and students with Social, Emotional and Mental Health (SEMH) needs. These will be available later this year.  "
        },
        {
            "heading": 3,
            "text": "What about teaching about mental health in school?  "
        },
        {
            "text": "We want to support all children and young people to be happy, healthy and safe. This is why, as of September 2020, our Relationships, Sex and Health Education (RSHE) curriculum has a strong focus on mental health and wellbeing.  "
        },
        {
            "text": "Pupils are taught how to recognise the early signs of mental wellbeing concerns, including common types of mental ill health (e.g., anxiety and depression), in themselves and others.  "
        },
        {
            "text": "They are also taught where and how to seek support, including who they can speak to in school if they are worried about their own or someone else’s mental wellbeing or ability to control their emotions (including issues arising online).  "
        },
        {
            "text": "These mental health resources have been put together so that children and young people, parents, carers, and school and college staff can get the advice and help they need.  "
        },
        {
            "heading": 3,
            "text": "What are you doing to help children with mental health issues continue to attend school?  "
        },
        {
            "text": "We know that some pupils, such as some of those with social, emotional or mental health needs, may face greater barriers to attendance than others.  "
        },
        {
            "text": "In addition to the existing advice on the holistic approach to promoting wellbeing, funding for training and the roll out of mental health support teams, we have published attendance guidance titled ‘working together to improve school attendance’.    "
        },
        {
            "text": "This aims to ensure all pupils receive the support they need to remove these barriers, including those with mental health and wellbeing related challenges,  "
        },
        {
            "text": "This makes clear the expectations on schools where a child experiences a mental health issue that is affecting attendance, including that they work with parents and carers at an early stage so that children receive the individual support that they need to keep them coming to school.  "
        },
        {
            "heading": 3,
            "text": "What about older students – like those at university? Is there any additional support available for them too?  "
        },
        {
            "text": "Yes. We recognise that university students face unique challenges with their mental health and wellbeing, which is why we’ve asked the Office for Students to allocate £15 million this year towards student mental health.  "
        },
        {
            "text": "As part of this, there is continued support for Student Space, an online platform providing mental health and wellbeing resources and dedicated one-to-one text and web chat support.   "
        },
        {
            "text": "We also asking universities to join the University Mental Health Charter Programme, which will help them to make cultural change so that all aspects of university life promote and support mental health. We’ve set a target for all universities to sign up to the Charter Programme by September 2024.   "
        },
        {
            "text": "Our first ever Student Support Champion, Professor Edward Peck, has also been speaking to bereaved parents to understand where improvements can be made, and is chairing a new Higher Education Mental Health Implementation Taskforce to deliver better practice in mental health support across the higher education sector.  "
        },
        {
            "text": "We will also be commissioning an independent organisation to carry out a national review of university student suicides, to ensure lessons are learnt from these tragic events, and help prevent lives being lost.  "
        }
    ]
}