{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/10/10/mental-health-the-merits-of-a-multi-disciplinary-approach/",
    "title": "Mental health: the merits of a multi-disciplinary approach",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Mental health",
        "Our profession"
    ],
    "pub_date": "2023-10-10T15:07:04+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Collegiate and effective"
        },
        {
            "text": "Dr Gill Robinson: Barnet was internationally renowned for having established the first mental health crisis team (CIS) in 1970. I joined the team in the 1990’s, and the expectation was that l would train as an approved social worker. Like all practitioners, l took my turn working in the CIS team. It was interdisciplinary, consisting of a social worker, mental health nurse and trainee psychiatrist."
        },
        {
            "text": "We would see patients mostly in the community, A&E and occasionally police stations. Tension was an integral part of how we worked, negotiating our different viewpoints often brought about more thoughtful, creative and less restrictive interventions."
        },
        {
            "text": "My contributions were respected and carried weight. Each week, there were CIS multi-disciplinary meetings, where issues relating to its processing of clinical cases were discussed and reviewed. There were high levels of staff satisfaction in CIS's generally. These findings chimed with my own experience, having significantly sharpened my own thinking and practice."
        },
        {
            "text": "Fast forward to modern day Barnet and the picture is a very different one. Since local authorities' decision to dis-aggregate, l have witnessed the steady departure of many experienced MHSW colleagues, leaving inexperienced social workers  overwhelm and lack of clarity about their role, isolated and stressed, without the benefit of working alongside other disciplines in mental health. The centralised approved mental health professional (AMHP) service remains co-located and continues to work alongside the mental health trust."
        },
        {
            "heading": 2,
            "text": "Agility and resilience"
        },
        {
            "text": "Most regard AMHP work as stressful and emotionally challenging. Clare Parkinson and Paul Thompson, in their important paper on training approved social workers, identify the importance of developing reflective practitioners. Not only do AMHPs require competence in technical expertise of their application of the law, procedures, interpersonal and collaborative skills, but they also require an ‘agility of mind’."
        },
        {
            "text": "This agility can help them make-sense of ‘uncertain, unique or conflicting situations’. As such, the role requires a mixture of ‘competence and artistry’. However, to sustain this way of working requires time, knowledge, skill, demonstrated by thoughtful, committed and well-contained professionals, if real and lasting change with clients is to be achieved."
        },
        {
            "text": "Yet the message within organisations is often split, urging practitioners to use strength based, person centred and trauma informed approaches. This often jars against the pressure from managers to end their work with service users and close cases with an expectation of volume throughput, due to long waiting lists and fewer resources. This places the practitioner under constant pressure to act and pushes them toward considering more coercive interventions, more likely to result in higher referrals for formal Mental Health Act (MHA) assessments."
        },
        {
            "text": "To bridge some of these gaps, and with Barnet’s longstanding spirit of innovation and cross-disciplinary collaboration in mind, myself and colleagues in the Trust have, together, established a more joined up approach."
        },
        {
            "heading": 2,
            "text": "Thoughtful forums"
        },
        {
            "text": "The idea was for “cause for concern’ (CfC) meetings to be convened, for all new non-urgent referrals for MHA assessment, consisting of a core membership: chair, AMHP lead, crisis team manager and other professionals involved in the case, such as the such as the social worker, responsible clinician, GP and others."
        },
        {
            "text": "CfC’s are a space for bringing professionals together and 'act to pause’, a term borrowed from medical care. This is in recognition that health care interventions when done badly, can harm patients potentially causing more trauma and unnecessary suffering. Ironically, the function of working intensively can often in effect lead to eliminating space for ‘thinking and digesting experience’."
        },
        {
            "text": "The CfC space, when chaired well, can effectively advance learning about the patient before leaping into action. Our results have been impressive. In the short time we have been working in this way, it has resulted in at least 40 people not being subjected to assessment and coercive intervention."
        },
        {
            "text": "Put simply, by coming together in this manner allows the interdisciplinary group to think together about the patient, thus allowing our professional resources to work better. Such a space provides the opportunity to explore our differences, listen and alter the habitual way we go about the work."
        },
        {
            "text": "It also helps us to change how we see ourselves in our care-giving role and to have the space to change our minds, to bear uncertainty, and take a ‘risk sensible’ approach, which begins to think more about the risk/benefits of a inpatient admission."
        },
        {
            "text": "When this happens our relationship to our care giving is more likely to be enriched, and not only does the workforce benefit, but so do those we are there to help."
        }
    ]
}