{
    "url": "https://defraenvironment.blog.gov.uk/2023/10/10/off-site-bng-what-can-you-do-after-30-years/",
    "title": "Off-site BNG: what can you do after 30 years?",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Land Use"
    ],
    "pub_date": "2023-10-10T14:40:55+01:00",
    "content": [
        {
            "text": "If you’re planning to sell off-site biodiversity units for mandatory Biodiversity Net Gain (BNG) you will need to commit to managing the habitat for 30 years. The habitat works will need to be legally secured through either a s106 agreement or a Conservation Covenant."
        },
        {
            "text": "What happens when you reach the end of the 30 years? Landowners can make their own choices, but there will likely be a range of financial incentives to encourage them to keep the land under sympathetic management and contribute to vital nature recovery in England if they choose to.  Read on to understand some of the possible scenarios."
        },
        {
            "text": "Keeping the land in BNG"
        },
        {
            "text": "Selling units into the off-site BNG market could be just the first step towards a long-term alternative income source. We hope that landowners will see the benefit of keeping the land in BNG, in an alternative nature market or other conservation agreement where this works for their business."
        },
        {
            "text": "At the end of your agreement, you could agree to enhance the habitat further and sell those benefits as biodiversity units. To re-enter the site into the off-site BNG market, you would have to re-baseline it at the 30-year mark using the metric, work out the enhancements you want to make and then follow the usual BNG process of legally secure the habitat and registering the units."
        },
        {
            "text": "You may not need to wait until the end of the 30-year agreement to begin this process. Where planned BNG habitat enhancements have been achieved before 30 years, an updated legal agreement can be set which provides new goals, and which covers the remaining time on the initial agreement plus another 30 years. For this to be permissible, we would expect verification of the achievement of the first planned enhancement in terms of quantity, habitat type and condition by the enforcing body."
        },
        {
            "text": "Other nature markets"
        },
        {
            "text": "Opportunities for nature markets are growing, including voluntary carbon credits and biodiversity credits, boosted by demand from investors and corporates seeking to account for their carbon and biodiversity impacts. You may be able to sell the benefits to these markets after your legal agreement has ended by undertaking further habitat creation or enhancement."
        },
        {
            "text": "Using the land for other purposes"
        },
        {
            "text": "After the 30-year period is complete, the land does not need to be kept for further biodiversity improvements, however the availability of different income streams to further maintain or enhance the habitat may make this the most attractive option.  You would need to consider the process and implications of undoing the habitat works."
        },
        {
            "text": "Consider if you have continuing legal obligations on the land"
        },
        {
            "text": "It is worth noting that the end of your S106 or conservation covenant may not mark the end of all legal obligations regarding retention of biodiversity. Where landowners have stacked a BNG project with other environmental schemes, the legal agreements for these other schemes may outlast BNG and require that habitats continue to be managed."
        },
        {
            "text": "Biodiversity sites could also accrue additional protections over 30 years as their conservation value grows. Government has no intention to designate BNG sites by default."
        },
        {
            "text": "If you are thinking about woodland creation, however, then this is considered to be a permanent land use change."
        },
        {
            "text": "Specific considerations for woodland creation"
        },
        {
            "text": "A newly created broadleaved woodland is likely to achieve ‘poor’ or ‘moderate’ condition during a 30-year BNG agreement, because of the time that trees take to grow. At the end of this agreement a new baseline can be calculated, allowing a new management plan to be drawn up to generate additional biodiversity value and more BNG units to sell in a new 30-year BNG agreement. In addition, woodlands can offer more than one income stream. A woodland with a BNG agreement could also produce wood products throughout its lifetime, such as through thinning which fells out some trees to make room for remaining trees to grow to full size."
        },
        {
            "text": "Once land has been converted to woodland, a Felling License is required to fell the trees; the Forestry Commission generally issues felling licenses with a requirement to restock, which means that woodlands, once created, are permanent."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}