{
    "url": "https://nationalscreening.blog.gov.uk/2023/10/10/our-friends-in-the-north-uk-nsc-hosts-annual-nordic-screening-network-meeting/",
    "title": "Our friends in the north: UK NSC hosts annual Nordic Screening Network meeting",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-10-10T11:17:58+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) hosted the annual meeting of the Nordic Screening Network, welcoming screening colleagues from Denmark, Iceland, the Netherlands, Norway and Sweden to London."
        },
        {
            "text": "Delegates from the 6 countries discussed and compared current screening practice, challenges and future developments."
        },
        {
            "text": "The meeting provided a great opportunity for us to look into similarities and differences in screening policy and practice, learn from each other and strengthen international lines of contact."
        },
        {
            "text": "A packed agenda covered a wide variety of topics, including:"
        },
        {
            "text": "Our excellent presenters gave an overview of each topic before delegates from each country contributed observations, experiences and questions."
        },
        {
            "text": "Many thanks to the presenters and everyone who helped organise and facilitate discussions on the day. It was an excellent learning opportunity for us all and underlined the importance of international collaboration for continually improving screening policy and practice."
        },
        {
            "text": "Iceland was suggested as the potential host country for next year’s meeting – Skál to The Land of Fire and Ice!"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}