{
    "url": "https://teaching.blog.gov.uk/2023/10/10/supporting-mental-health-and-wellbeing-at-our-school/",
    "title": "Supporting mental health and wellbeing at our school",
    "authors": [
        "Emma Scelsi"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "Teacher mental health",
        "Teacher wellbeing"
    ],
    "pub_date": "2023-10-10T15:30:11+01:00",
    "content": [
        {
            "text": "As the senior mental health lead at St Vincent’s Primary School in London, Emma Scelsi tells us about her schools’ approach to supporting pupils with their mental health and wellbeing. "
        },
        {
            "text": "Our school "
        },
        {
            "text": "In today's fast-paced world, the mental health and well-being of students and staff play a crucial role in creating a positive and nurturing educational environment. At our school, we have made significant strides in promoting mental health awareness and support. As the mental health lead, supported by our head teacher, Marie Tuohy and the senior leadership team, our school have placed mental health and well-being at the forefront of our community. Through our commitment and the helpful training we received from the Department for Education, we have been able to implement an effective whole school approach, ensuring that every member of our community feels supported and empowered. "
        },
        {
            "text": "We believe that by supporting the mental health and well-being of our pupils and staff, we equip them with the tools to overcome life's challenges and provide them with the necessary emotional support needed to succeed academically. "
        },
        {
            "text": "Choosing the Right Training "
        },
        {
            "text": "Recognising the need to enhance our existing mental health support framework, we chose a course which provided a flexible online delivery over two days, catering to our busy schedule. The training not only expanded our understanding of the senior mental health lead role but also equipped us with valuable tools and resources to maximise our effectiveness. "
        },
        {
            "text": "Implementing a Whole School Approach "
        },
        {
            "text": "St Vincent's already fostered a culture where positive mental health was considered everyone's responsibility. However, the training helped us realise that something was missing. Using the eight principles of an effective whole school approach, we undertook a thorough review of our existing support systems and developed an action plan to ensure mental health became an integral part of our school's fabric. The training emphasised the significance of collaborating with external services, families, and the wider community to enhance the impact of our support. By integrating mental health and well-being practices into the curriculum, we successfully aligned our efforts with our educational goals, enriching the overall learning experience. "
        },
        {
            "text": "Empowering Partnerships and Networking "
        },
        {
            "text": "Through the training, we had the opportunity to network with other mental health leads from different schools. This exchange of knowledge helped us identify areas for improvement and allowed us to involve children, governors, and parents as partners in our journey. Furthermore, the training emphasised the importance of measuring the impact of interventions and provided us with practical tools and strategies to monitor both short and long-term outcomes effectively.  "
        },
        {
            "text": "We wholeheartedly recommend attending senior mental health lead training, regardless of whether you are new to the role or have been serving in it for some time. The training enables you to develop a comprehensive whole school approach, bringing together existing and new initiatives into a coherent plan. By implementing the strategies learned, you can empower your school community to support the mental health and well-being of pupils and staff, fostering an environment where individuals thrive both emotionally and academically. "
        },
        {
            "text": "By attending the senior mental health lead training, we were able to build on our existing foundations and create a robust framework to support our students and staff. We urge other educational institutions to embrace this training opportunity and work towards implementing a whole school approach that fosters a positive and inclusive environment for all, helping to nurture future generations of confident and successful individuals. "
        },
        {
            "text": "Find out more about Senior Mental Health Lead training for your school.  "
        }
    ]
}