{
    "url": "https://ipo.blog.gov.uk/2023/10/10/transformation-ii-spotlight-on-trade-marks-designs-and-tribunals/",
    "title": "Transformation II: spotlight on trade marks, designs and tribunals",
    "authors": [
        "christinawatts"
    ],
    "categories": [
        "Design",
        "Patents",
        "Trade marks",
        "Transformation"
    ],
    "pub_date": "2023-10-10T14:37:04+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Background"
        },
        {
            "text": "It’s been more than two years since we started the first phase of our five-year ‘One IPO Transformation’ programme, the biggest modernisation of digital services that the Intellectual Property Office has ever seen.  "
        },
        {
            "text": "We spoke to IPO Transformation lead, Natasha Chick, for an update. "
        },
        {
            "heading": 3,
            "text": "Natasha, tell us about the story so far "
        },
        {
            "text": "Our ambition is to maintain our position as an exemplar among IP offices. To further this aim, our transformation programme will introduce brand new digital services both internally for our staff and externally for our customers that will upgrade and future-proof our services. "
        },
        {
            "text": "We’re at a really exciting point in the programme. We're preparing to pilot the new digital patents service with a small number of customers before making it available to everyone next spring. "
        },
        {
            "text": "While better technology is, of course, a big part of this, it’s not the whole picture. We’ve also been looking at how we could change IP legislation and our policies to do things in a more modern and innovative way.  "
        },
        {
            "text": "This is why we have been consulting on proposed changes, to make sure we're listening to the needs of our customers.   "
        },
        {
            "text": "Our first Transformation Consultation concluded on 1 August 2023. Questions focused largely on patents, because our new digital patent services will be the first to launch, early in 2024.  "
        },
        {
            "heading": 3,
            "text": "The IPO has recently launched a second consultation. What is the focus, and who do you want to hear from?"
        },
        {
            "text": "In our second consultation, Transformation II, questions centre more on trade marks, designs and tribunals. New digital services for those areas will follow in 2025. There are some questions with a patent focus in there too. "
        },
        {
            "text": "We would really love our customers and members of the IP community to get in touch and tell us how we can improve our digital services in these areas. "
        },
        {
            "text": "You can respond to our Transformation II Consultation here "
        },
        {
            "heading": 3,
            "text": "What questions does the latest consultation cover? "
        },
        {
            "heading": 4,
            "text": "Mediation"
        },
        {
            "text": "Tribunals is one of the main areas we’re improving. We want to help people resolve any IP disputes as quickly and efficiently as possible. To help achieve that we'd really like to know how we can improve mediation within our tribunal services. "
        },
        {
            "heading": 4,
            "text": "Series trade marks "
        },
        {
            "text": "Currently the IPO allows people to register a series of trade marks. This means that applicants can apply for up to six trade marks at a reduced fee, as long as they are very similar to each other. A good example would be applying for the same logo in different colours.  "
        },
        {
            "text": "While this sounds good in principle, in practice we’re finding that series marks have high objection rates, suggesting that they’re not always being used correctly. We’re also not clear that series marks give people any additional protection than a single trade mark. As a result, the UK Government is proposing to either change or abolish series marks. We’d like to know views on the legal and practical benefits of series marks for trade marks, and how we could reform them. "
        },
        {
            "heading": 4,
            "text": "Inventors’ addresses "
        },
        {
            "text": "The government is considering not publishing full addresses for UK patent inventors online. Instead, we’d only publish the applicant’s full address and the address for service, so we would like to hear feedback on that.  "
        },
        {
            "heading": 4,
            "text": "Online inspection service"
        },
        {
            "text": "We also want to know if having an online inspection service for trade mark and design documents makes accessing information relating to IP rights easier for customers.  "
        },
        {
            "text": "There are some questions in there about time periods for Supplementary Protection Certificates (SPCs) too.  "
        },
        {
            "heading": 3,
            "text": "Consultation details at a glance"
        },
        {
            "text": "When did the Transformation Consultation II launch?: 22 August 2023"
        },
        {
            "text": "When does it close?: 31 October 2023 at 11.59pm"
        },
        {
            "text": "Who do we want to hear from?: IP attorneys, legal practitioners, businesses, representative organisations – anyone who uses our services."
        },
        {
            "heading": 3,
            "text": "Find out more "
        }
    ]
}