{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/07/celebrating-the-power-of-community-with-the-data-science-community-showcase/",
    "title": "Celebrating the power of community with the Data Science Community Showcase",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Capability & Skills",
        "Collaborating & Networking"
    ],
    "pub_date": "2023-11-07T16:52:16+00:00",
    "content": [
        {
            "text": "The Cross-Government and Public Sector Data Science Community provides regular opportunities for people in the public sector, with an interest in data science, to connect with their peers, learn new skills and collaborate.  "
        },
        {
            "text": "This autumn, we are hosting the first Data Science Community Showcase to celebrate the successes of our community, as well as those of other networks and communities supporting government analysts. It’s an opportunity to expand your network, showcase your work and hear from colleagues in government who use data science for the public good. Civil servants can event count attendance of any Showcase Sessions towards their One Big Thing data training. "
        },
        {
            "text": "It’s also an opportunity for us to reach new audiences and engage people who don’t necessarily have the role of 'data scientist'. That’s why we’re reaching out to our colleagues in the GSE profession, to let you know you are welcome in our Community. "
        },
        {
            "text": "The Showcase takes place online from 28 to 30 November, featuring content curated by the Data Science Community and our partners, focused on three content strands. "
        },
        {
            "text": "Day one: Your career in data science "
        },
        {
            "text": "We explore skills-building and career progression in data science following the success of our career panel events throughout 2023. This day is great for people looking to develop data science skills and understand career options in data science. "
        },
        {
            "text": "Day two: The Data Science Toolshed "
        },
        {
            "text": "We explore the wide range of tools for analysis developed by our colleagues across the public sector and highlight the importance of coding in the open and building code to share. This day is great for analysts who use Python and R, as well as package developers and data engineers. "
        },
        {
            "text": "Day three: Making an impact with data science "
        },
        {
            "text": "We shift our focus to the context in which we do data science, addressing questions that are important not only for data scientists, but also for policymakers, scientists and anyone in government whose work is impacted by data. These questions include how policymakers and data scientists can support each other and how data science improves the lives of the public.  "
        },
        {
            "text": "Our Community is for everyone "
        },
        {
            "text": "This year, we have focused on broadening the reach of our Community activities and making the Community more inclusive. Engaging with a wider range of sectors and organisations in our programme, means more opportunities to grow your network, understand the data science landscape, and collaborate rather than duplicate. "
        },
        {
            "text": "By teaming up with partner networks and communities with shared goals, we aim to deliver a Showcase that highlights the many areas of the public sector that are underpinned by data science. We are delighted to be working with the Data Cymru, the RAP Network, the NHS-R Community, the Emerging Technology (EmTech) Community, and our own sub-communities. "
        },
        {
            "text": "The Showcase sessions are now open for booking on Eventbrite, and you can read more about the Showcase on our website. "
        }
    ]
}