{
    "url": "https://environmentagency.blog.gov.uk/2023/11/07/creating-the-countrys-largest-fish-pass/",
    "title": "Creating the country’s largest fish pass",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-07T10:50:07+00:00",
    "content": [
        {
            "text": "By Simon Ward, Fisheries Technical Specialist"
        },
        {
            "text": "Creating a passage for fish to traverse the mighty River Trent in Nottinghamshire – one of the premier coarse fishing rivers in the UK - has been a vision of mine since the late 1970s. But it took until January 2022 for that vision to begin to take shape with the start in construction of the Colwick (Holme Sluices) fish pass."
        },
        {
            "text": "This £10m project is part of the Environment Agency (EA)’s work to improve fish passage across the country. These projects are vital for ensuring the free movement of all fish species, including threatened species such as eels and salmon, through our river networks. There are all sorts of issues for salmon – including exploitation at sea, predation and disease – but we’re fixing one here on the Trent."
        },
        {
            "text": "Salmon and other migratory species such as lamprey and eels used to be plentiful in the River Trent - the third longest river in the country - and they used the river to swim up and down en route to their spawning grounds."
        },
        {
            "text": "But the decline of migratory fish in the Trent catchment dates back to the Industrial Revolution, when large weirs were first built to open up the river for trade. Some fish were able to overcome these barriers – whether by leaping over or wriggling through what were often imperfect constructions of stone or wood, but not all of them."
        },
        {
            "text": "We were surprised to see salmon returning to the River Trent in the early 1980s as they hadn’t been seen in the river for many decades. We were even more surprised by the amount of salmon and other fish that were reaching the EA’s Holme Sluices - the largest barrier to the natural migration of fish in the Midlands - and getting stuck there.  We figured that something needed to be done, but at the time we didn’t have the resources or funding."
        },
        {
            "text": "Holme Sluices is a major flood risk management structure that was built in the 1950s as part of a large-scale flood defence scheme and helps to protect Nottingham from flooding.  It spans the full width of the River Trent and maintains different upstream and downstream water levels, leaving fish unable to pass through."
        },
        {
            "text": "We knew that installing a fish pass would be a significant step in restoring the Trent catchment to its former glory as a habitat for coarse and migratory fish and that it would become easier for salmon and other fish to reach their spawning and feeding grounds."
        },
        {
            "text": "But Holme Sluices is not the only barrier to fish migration within the Trent catchment: we are hoping that as the Colwick fish pass is the first scheme in the ambitious Trent Gateway Partnership it will serve as a catalyst for other projects.  The partnership was created by the EA and 30 local partners to restore the River Trent and reconnect the communities and wildlife within it."
        },
        {
            "text": "The partnership aims to remove all barriers to fish migration along the River Trent and to create a healthy watercourse that not only reduces flood risk and provides better wildlife habitats, but also engages local communities about the natural and social history of the river."
        },
        {
            "text": "We first began conducting feasibility studies for the fish pass back in 2013 but it took until 2016 for the project to begin in earnest.  As the EA has a duty to improve water courses and develop, maintain and enhance fisheries, we were able to secure funding for the project."
        },
        {
            "text": "However, planning for the country’s largest, most complex and most expensive fish pass has taken time. The sheer scale of the project and its location constraints made it exceptional: there is no other fish pass like it in the country."
        },
        {
            "text": "We needed to make sure that diverting water through the fish pass must not lower the flow through either the canoe slalom course at the adjoining Holme Pierrepont National Watersports Centre or the turbines of a local hydropower operation.  We also needed to allow for maintenance access to the Holme Sluices."
        },
        {
            "text": "Then there were the factors relating to the migrating fish themselves: different species need varying flow rates depending on their anatomy and swimming ability. For this we had to increase the level of modelling we did to get it right to make sure the flows through the fish pass were suitable for all fish."
        },
        {
            "text": "Such planning and precision have paid off.  Construction has gone relatively smoothly, and we have been lucky with the weather and the river levels during this period.  There has only been one weekend when the River Trent flooded into the channel and then we had to remove the water before continuing with construction."
        },
        {
            "text": "The Colwick fish pass measures 210 metres long, six metres deep and 6.5 metres wide.  It’s divided into 20 ascending chambers into which water will flow through narrow slots. Fish of all species swimming upstream to lay their eggs in the gravel riverbeds of Trent tributaries such as the Dove and the Derwent will be able to pass through these slots and rest in the chamber above before continuing."
        },
        {
            "text": "The improvements to the spawning will increase manyfold because we can get fish past Nottingham very quickly. If the fish have  more energy when they reach the spawning grounds, they can produce more eggs and the spawning will be more efficient, more productive."
        },
        {
            "text": "The project also includes an eel pass to help support the critically endangered European Eel as well as a public viewing platform so people can stand above the water as the fish make their way through the pass beneath them."
        },
        {
            "text": "Work has also now started on the design and installation of interpretation boards for the viewing platform.  These highly visual panels designed by a renowned UK artist will inform and advise visitors of the local wildlife in and around the river."
        },
        {
            "text": "The direct environmental benefits of the fish pass will be huge. They include helping 60km of river to reach good status for fish, as well as 60km of new spawning habitat immediately upstream of the barrier. The fish pass will also aid interconnectivity with numerous other fish passage schemes previously constructed upstream by the Environment Agency."
        },
        {
            "text": "And our Trent Gateway plans will open up even more of the river for fish: 410km of main river plus many smaller tributaries for all species.  It will give fish access to additional spawning habitat upstream, with the potential to increase the number of fish species in the River Trent."
        },
        {
            "text": "Another hope for the Colwick fish pass is to promote public awareness of what fish passes provide, along with educational and engagement opportunities, and to attract more visits by anglers to the area, thereby providing a boost to the local economy."
        },
        {
            "text": "While undoing the negative impacts on our rivers of more than 200 years of industrial development, flood management and power generation will take time, every weir removed or fish pass installed – whether it’s on a huge-scale scheme like this one at Colwick or other smaller projects taking place around the country – is a step in the right direction."
        },
        {
            "text": "Further details about the project are available here: https://consult.environment-agency.gov.uk/east-midlands/holme-sluices-fish-pass"
        }
    ]
}