{
    "url": "https://kingsawards.blog.gov.uk/2023/11/07/feritech-global-ltd-celebrate-their-success-with-a-kings-award-for-enterprise/",
    "title": "Feritech Global Ltd celebrate their success with a King's Award for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-11-07T13:05:05+00:00",
    "content": [
        {
            "text": "Established in 2015, Feritech Global Ltd is a solution provider specialising in designing and building products that are used in extreme marine environments."
        },
        {
            "text": "Feritech Global built its reputation by carrying out marine geotechnical surveys. This typically involves going out into deep oceans and sending down specialised equipment to take soil and rock samples from the seabed for analysis."
        },
        {
            "text": "This is vital information for clients who want to build installations out at sea, such as wind turbines, oil pipelines, or undersea cables."
        },
        {
            "text": "Our equipment is designed and built in Cornwall. We design and manufacture advanced engineering products to solve the complex engineering problems faced in subsea exploration."
        },
        {
            "text": "We offer sales and rental of equipment for offshore engineering as well as provide engineering teams to project manage and deliver geotechnical surveying and engineering operations for offshore projects around the world."
        },
        {
            "text": "Having gained a reputation for tackling very challenging projects in harsh environments, this created demand for our advanced engineering skills across a range of different areas, including aerospace and telecoms."
        },
        {
            "text": "In 2023, we were proud to receive a King’s Award for Enterprise for our performance in International Trade. Our award was for Outstanding Short Term Growth in overseas sales over three years. In the period under review, we demonstrated overseas earnings growth of 1,210%. (This was despite the global impact of the pandemic.)"
        },
        {
            "text": " "
        },
        {
            "text": "Which international markets do you already export to?  "
        },
        {
            "text": "Feritech has customers in more than 40 countries around the world, covering Europe, Asia, Africa and the Americas."
        },
        {
            "text": "We have an increasing network of international sales distributors, with representatives in China, Singapore, Colombia, Germany and Spain."
        },
        {
            "text": "We have recently signed sales distributor agreements covering United Arab Emirates, Saudi Arabia, Iraq, Israel, Lebanon, Qatar, Bahrain, Egypt, Libya, Greece, Cyprus and Turkey."
        },
        {
            "text": "Our business is now starting to penetrate the USA and we see that as a major growth opportunity in the next five years."
        },
        {
            "text": " "
        },
        {
            "text": "Could you tell us about your export story? When did you begin to export?  "
        },
        {
            "text": "The market that we operate in is a global one, so we have always had an international outlook. Since Day One, over 90% of our sales have been in export."
        },
        {
            "text": "Our founders, Rob and Gemma Ferris, worked extensively in Africa during the early part of their careers. They worked in the offshore marine survey industry and could see that many of the products on the market could be improved. So, they set up Feritech with an ambition to create and deliver products that would shake up the global market."
        },
        {
            "text": "That desire to innovate is still at the heart of the Feritech approach. This is combined with a desire to deliver products that are more effective, easier and safer to operate, and offer operational cost savings to the customer."
        },
        {
            "text": "All Feritech equipment is designed and built in Cornwall, and we send teams all over the world to help manage projects on behalf of our clients. Our international clients include famous names like Total, Vattenfall, Alcatel Submarine Networks, Glencore, Ocean Infinity and Bauer, amongst others."
        },
        {
            "text": "We build strong partnerships across the supply chain, often working in collaboration with others. An example is a 15 month survey for TOTAL off the West Africa coast, where we were a subcontractor to Ocean Infinity. Our ability to work seamlessly with partners is a real competitive strength."
        },
        {
            "text": " "
        },
        {
            "text": "What is the value of your exports and how has this grown your business?"
        },
        {
            "text": "Exports are the driving force of our business, accounting for at least 90% of our sales and profits."
        },
        {
            "text": "It was the success of our export business that enabled us to attract the investment needed to design and build our own £3 million Innovation Centre in Cornwall. This dedicated manufacturing facility, which was opened by HRH the Duke of Kent in 2022, is one of the most advanced centres of its kind in the country."
        },
        {
            "text": "Our Innovation Centre offers a full range of advanced engineering services on one site, including product design, precision machining, large scale fabrication, hydraulics, embedded software, electronics and 3D printing. This enables faster project turnaround for customers, consolidating our competitive edge as well as enabling expansion into new trade sectors."
        },
        {
            "text": "We now have a superb platform to support further export growth over the coming 10 years, with the ability to take on ground-breaking technical innovations. For example, we are  designing an autonomous subsea vehicle to carry out geotechnical surveys - a world first that will completely revolutionise our industry."
        },
        {
            "text": " "
        },
        {
            "text": "Is there a surprising fact about your exports? "
        },
        {
            "text": "Feritech equipment could soon be ‘exported’ into space!"
        },
        {
            "text": "AeroSpace Cornwall has supported Feritech with the innovative development of wireless communications, for situations where a cable is not reliable enough and radio cannot transmit.  In addition, AeroSpace Cornwall has also supported Feritech to achieve the  AS9100 accreditation, the widely adopted and standardized quality management system for the aerospace industry. This will enable the company to expand its business further within the aerospace sector."
        },
        {
            "text": " "
        },
        {
            "text": "What do exports mean for your business? "
        },
        {
            "text": "Exports are the cornerstone of our business. Our export success has enabled us to:"
        },
        {
            "text": "Receiving a King’s Award for Enterprise has also brought us in touch with a new network of contacts – both suppliers and potential customers and collaborators. We have every intention of building on that opportunity as quickly as possible."
        },
        {
            "text": " "
        },
        {
            "text": "What advice would you give to other businesses exporting?  "
        },
        {
            "text": "Think creatively and think big. However daunting the competition may seem, there are always ways to either improve on existing products or to create innovative new products."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about Feritech Global Ltd: https://www.feritech.com/"
        },
        {
            "text": "Find out more about The King's Awards for Enterprise: https://www.gov.uk/kings-awards-for-enterprise"
        }
    ]
}