{
    "url": "https://defralanduse.blog.gov.uk/2023/11/07/incorporating-local-nature-recovery-strategies-when-planning-for-biodiversity-net-gain/",
    "title": "Incorporating Local Nature Recovery Strategies when planning for Biodiversity Net Gain",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "BNG",
        "Local Nature Recovery Strategies"
    ],
    "pub_date": "2023-11-07T09:43:28+00:00",
    "content": [
        {
            "text": "How can BNG help to deliver on the nature recovery opportunities identified in a Local Nature Recovery Strategies (LNRSs)?"
        },
        {
            "text": "We’ve summarised how the policies will join up to support developers, landowners, and local authorities in contributing to nature recovery. This blog is also relevant to ecologists and associated advisors on both supply and demand sides of the off-site BNG market."
        },
        {
            "text": "LNRSs and BNG both aim to reverse the decline of biodiversity in England."
        },
        {
            "text": "What’s an LNRS?"
        },
        {
            "text": "Each LNRS will agree priorities for nature recovery and propose actions in the locations where it would make a particular contribution to achieving those priorities."
        },
        {
            "text": "The Secretary of State for Environment, Food and Rural Affairs has appointed 48 responsible authorities to lead on preparing a LNRS for their area. Together these cover the whole of England with no gaps or overlaps. The delivery of proposals within the LNRS will be encouraged through a combination of:"
        },
        {
            "text": "What’s BNG?"
        },
        {
            "text": "From January 2024, most major developments will need to deliver BNG. This will mean providing a 10% net gain for biodiversity. This will be achieved by delivering habitat onsite or, if that is not possible, through buying off-site biodiversity units."
        },
        {
            "text": "How do they interact?"
        },
        {
            "text": "LNRS can support a strategic approach to off-site BNG delivery, agreeing evidence-based locations to expand and connect existing habitat and provide wider environmental benefits. This will support BNG in creating locally driven, joined-up outcomes for nature."
        },
        {
            "text": "LNRS plays a role in BNG by determining the ‘strategic significance’ multiplier within the biodiversity metric. This mechanism means that there is an incentive for developers to align with the LNRS in their area when choosing the location of off-site BNG units."
        },
        {
            "text": "Understanding the link between the two policies is essential for practitioners involved in BNG delivery. Getting to grips with LNRS is beneficial whether you are a"
        },
        {
            "text": "Considerations for local planning authorities "
        },
        {
            "text": "All local planning authorities will either be leading or supporting the preparation of their relevant LNRS. You should refer to statutory guidance on what an LNRS should contain and regulations on the procedure to be followed in their preparation and publication."
        },
        {
            "text": "Even if your local authority isn’t leading LNRS preparation, your involvement is essential, as reflected by the powers given to ‘supporting authority’, set out in regulations. Engaging early will help make sure your LNRS takes account of your area’s priorities and plans. This is important because recent amendments to the Levelling Up and Regeneration Act will mean that all local planning authorities will have a duty to take account of their relevant LNRS. This duty applies generally, and to specific elements of the LNRS, including the mapped proposals."
        },
        {
            "text": "While your LNRS is being prepared, it is important to clearly signal which alternative strategy landowners and developers should refer to when planning for BNG, for example your draft LNRS (where available), existing biodiversity action plans, local plans and neighbourhood plans. You can refer to the metric user guide for a full list of possible alternative strategies."
        },
        {
            "text": "Considerations for landowners and developers "
        },
        {
            "text": "As a land manager, when creating or enhancing the habitat in a location identified in your LNRS, you will be able to create 1.15x more units than you would otherwise have created. This is known as the ‘strategic significance multiplier’. This multiplier only applies if you deliver the habitat specified, and in the location identified, in the LNRS."
        },
        {
            "text": "This means it is important for both landowners and developers to refer to the LNRS when preparing for BNG requirements. You can find out which  you are in, and which local authority is leading its preparation. Where possible, you should get involved in LNRS preparation to help inform the priorities and specific mapped proposals. LNRSs are designed to  encourage and reward landowners for taking strategic actions for nature on their land, but it will not require them to do so. Where available on LNRS local websites, we recommend signing up for regular updates, so that you are informed on when to get involved. This will also ensure you know when the final LNRS is ready for you to use when making decisions. In the interim period before LNRSs are published, you can use an alternative strategy identified by your local planning authority."
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "We are aware many practitioners are keen for more technical information about how LNRS and BNG work together. To support we will be setting up a webinar on this theme early 2024. In the meantime, please see two commonly asked technical questions below."
        },
        {
            "text": "LNRS will map irreplaceable habitats as “areas already of particular importance for biodiversity”. This means that they will be part of the core sites on which LNRS will base the connection and expansion of England’s ecological networks."
        },
        {
            "text": "It is important that irreplaceable habitats are exempted from BNG, as set out in our blog on BNG and irreplaceable habitats. However, LNRS can guide delivery of BNG and other funding sources, in locations to support protection or improved resilience of irreplaceable habitats. For example, creating habitat to buffer the site from pollution sources, or enhance the site’s connectivity."
        },
        {
            "text": "Action to create conditions allowing irreplaceable habitats to establish over time is also important for nature recovery and will be encouraged through LNRS’s role in guiding delivery of nature funding."
        },
        {
            "text": "The biodiversity metric allows local planning authorities (LPAs) to apply either the LPA boundary or National Character Area boundary to incentivise local delivery of off-site compensation. Planning policy can be used to set additional local requirements, further reducing the risk of compensation being delivered far from development sites. We are aware that this has been of interest to LPAs responsible for larger areas."
        },
        {
            "text": "LNRS will identify a pipeline of projects, which should create more opportunities for developers to deliver off-site BNG compensation close to development sites. The LNRS preparation process may also identify relevant issues and solutions to inform local policy setting. However, the LNRS policy framework has not been designed to guide creation of a spatial zoning product suitable for the spatial risk multiplier in the biodiversity metric."
        }
    ]
}