{
    "url": "https://space.blog.gov.uk/2023/11/07/meteors-and-peak-a-boo-venus-the-night-sky-in-november/",
    "title": "Meteors and peak-a-boo Venus: the night sky in November",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-11-07T11:19:09+00:00",
    "content": [
        {
            "text": "The nights of November are a great chance to see Jupiter at its brightest, as well as meteors and a host of wonderful stars and constellations. There’s also a chance to see the Moon eclipse Venus!"
        },
        {
            "heading": 2,
            "text": "The Moon and Planets"
        },
        {
            "text": "The month starts with Jupiter, the largest planet in our Solar System, reaching ‘opposition’ – its closest point to Earth as the two planets orbit around the Sun.  This means the gas giant is at its brightest in our night sky, blazing significantly brighter than the stars around it."
        },
        {
            "text": "It currently lies on the borders of the constellations Cetus, Aries, Pisces, and Taurus (see the star-map below to find it), rising in the east as darkness falls and setting just before dawn."
        },
        {
            "text": "Venus rises in the early hours of the morning, and remains visible in the south-east until it is lost in the glare of the rising Sun."
        },
        {
            "text": "On the morning of 9 November, a 15% illuminated crescent Moon will pass in front of Venus, eclipsing it at around 9.45am."
        },
        {
            "text": "While it will be a real treat for those with binoculars or a telescope, it is possible to see Venus during the day with the naked eye, so look closely at the Moon on this morning and see if you can spot it!"
        },
        {
            "text": "Although starting to dim somewhat now, Saturn is still shining in the south as darkness falls and will sit just above a 50% illuminated Moon on the evening of 20 November."
        },
        {
            "heading": 2,
            "text": "Meteor showers"
        },
        {
            "text": "With the new Moon bringing darker skies around the 13 November, the combination of the Taurids and Leonids meteor showers in the middle of this month provide a good chance to see meteors streak across our sky."
        },
        {
            "text": "The Taurids meteor shower is expected to peak around 12-13 November, as Earth passes through the fragments of rock and ice left behind from Comet Encke, a 5km (3 mile) wide object that orbits the Sun every 3 years."
        },
        {
            "text": "The more spread-out fragments of this comet mean this shower only produces a sprinkling of meteors, but their relatively slow speed – 27km (17 miles) per second - can make them easier to spot as they blaze across the night sky."
        },
        {
            "text": "The Leonids meteor shower is active for much of the month and peaks around 17-18 November when the fragments of Comet Tempel-Tuttle enter Earth’s atmosphere at over 70km (45 miles) per second."
        },
        {
            "heading": 2,
            "text": "November’s night sky"
        },
        {
            "text": "Winter is coming, and the night sky at this time of year is full of remarkable sights.  Here are just a few to look out for:"
        },
        {
            "text": "The constellation of Ursa Major (the Great Bear) appears to stand on the northern horizon after dark this month.  Look out for the distinctive brighter stars that make up the bear’s back and tail - a pattern of stars (or ‘asterism) known as the Plough, Sickle or Big Dipper."
        },
        {
            "text": "The constellation of Andromeda hosts the most distant object visible with the naked eye, the Andromeda Galaxy, an island of around a trillion stars that lies around 2.5 million light years away.  Get as far away from any ground-light as you can and give your eyes time to adapt to the dark for the best chance to see this fuzzy, glowing patch of light."
        },
        {
            "text": "The Andromeda Galaxy is travelling towards our Milky Way at around 300km (185 miles) per second, and the two are expected to collide in around four billion years."
        },
        {
            "text": "The unmistakable Pleiades Star Cluster is visible rising in the east after dark – look for a small cluster of stars to the left of bright Jupiter."
        },
        {
            "text": "While this cluster goes by the name of the ‘Seven Sisters’ from Greek mythology because of its more visible members, it actually contains around 1,000 stars, drifting through space together around 440 light years from us."
        },
        {
            "text": "The constellations of Perseus and Cassiopeia lie within the dense band of stars that make up the spiral arms of our Milky Way Galaxy, giving this patch of sky a beautiful glow from darker skies."
        },
        {
            "text": "Between the two constellations lies the (somewhat unimaginatively named) ‘Double Cluster’, two clusters of several thousand stars around 7,500 light years away."
        },
        {
            "text": "The constellation of Auriga contains a number of so called ‘open clusters’ of stars, each containing dozens to several hundred stars.  They’re faint, but visible with the naked eye from darker skies, and a real treat for anyone looking with binoculars or a telescope."
        },
        {
            "text": "Those looking up after around 9:00pm will start to see the constellations of Gemini and Orion peeking above the east horizon.  These host many fascinating stars and deep-sky objects, but more on those in the coming months!"
        },
        {
            "text": "Has this inspired you to spend a night under the stars?  Consider contacting your local astronomical society to see when they meet.  There are dozens around the UK with dedicated astronomy nights, where people gather together to view the night sky, with many enthusiasts bringing binoculars and telescopes that you can look through."
        }
    ]
}