{
    "url": "https://teaching.blog.gov.uk/2023/11/07/top-tips-and-ideas-for-encouraging-strong-attendance/",
    "title": "Top tips and ideas for encouraging strong attendance",
    "authors": [
        "Sarah Cox"
    ],
    "categories": [
        "Attendance"
    ],
    "pub_date": "2023-11-07T10:12:44+00:00",
    "content": [
        {
            "text": "Sarah Cox, headteacher of Willows Primary Academy in Grimsby (part of DELTA Academies Trust) tells us about the many successful initiatives they use to tackle attendance challenges at school, and how her school has been selected to lead a DfE attendance hub as a result of their hard work."
        },
        {
            "text": "Attendance hub"
        },
        {
            "text": "We are so pleased to have been recognised for our hard work on attendance as a school, and hence selected to lead a DfE attendance hub. The attendance hub enables schools with strong attendance practice to share their approaches with senior leaders in other similar schools to help them to improve. Hubs also facilitate an ongoing professional dialogue about attendance amongst school leaders on a peer support basis."
        },
        {
            "text": "I am also happy to have the opportunity to share our top attendance tips with other schools across the country here, in this blog."
        },
        {
            "text": "Breakfast"
        },
        {
            "text": "In this new academic year, we are taking a range of actions to ensure that we have as many pupils coming into school as possible. To kick off, we’re offering free breakfast to all our pupils in the first week of term. We want pupils to be  ready to learn and not feeling hungry, but we also want to show our commitment to their well-being and attendance from day one."
        },
        {
            "text": "Attendance cards"
        },
        {
            "text": "Something we will continue to do, following on from the previous academic year, is giving all pupils attendance cards in the first week. They get a stamp in their card for every morning and afternoon session that they are in school. They also get extra stamps for punctuality. At the end of the week, pupils get a number of entries into prize draw depending on how many stamps they have received in their card. We find this to be a very motivating incentive for the pupils – they really look forward to a prize draw at the end of the week!"
        },
        {
            "text": "A warm welcome"
        },
        {
            "text": "We will also continue to make a big effort to make sure that all staff are on the school gate to greet pupils and parents in the mornings. We really want to make sure that our school is a warming and welcoming environment, to make sure that families are not anxious about coming in."
        },
        {
            "text": "Home visits "
        },
        {
            "text": "Before the summer holidays, we looked at pupils who had not been coming to school as regularly. This made it easier to monitor attendance in the first week of term. If the same pupils did not come in, , we made it a priority to call parents and make home visits to make sure that they are okay. Staff that conduct home visits are carefully selected to build relationships with children and families to promote strong relationships and, in turn, good attendance."
        },
        {
            "text": "Attendance calendar "
        },
        {
            "text": "Last year we also pulled together a full year attendance calendar, to map out our key attendance activities for teachers, pupils and parents. This calendar includes our attendance assemblies, parents evenings, workshops for families, and the dates in the school year where, as a team, we will look at our data to see how we are doing. We found this very helpful and we will be producing a calendar for this academic year."
        },
        {
            "text": "School culture "
        },
        {
            "text": "Ultimately, we have tried to create a warm, welcoming and inclusive school where parents and pupils feel valued, and where they want to attend. Developing a supportive school culture with high expectations for attendance has been key."
        },
        {
            "text": "If you want to find out more about what we do, we have developed a set of attendance resources for our hub which you can find on our website: Attendance Hub - Willows Academy"
        }
    ]
}