{
    "url": "https://socialcareinspection.blog.gov.uk/2023/01/06/getting-ready-to-regulate-supported-accommodation/",
    "title": "Getting ready to regulate supported accommodation",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care experienced",
        "children looked after",
        "looked after children",
        "social care professionals",
        "supported accommodation"
    ],
    "pub_date": "2023-01-06T09:25:13+00:00",
    "content": [
        {
            "text": "Yvette Stanley, our national director for regulation and social care, provides an update on our plans to regulate supported accommodation."
        },
        {
            "text": "We’re fast approaching the time when we can accept applications to register as supported accommodation providers. This is a whole new area of work for Ofsted, providing important regulatory safeguards for children. Over the last year, we’ve been busy getting ready – recruiting inspectors, developing our registration guidance (due to be published soon), and planning ahead for beginning inspections in 2024."
        },
        {
            "text": "In November, we hosted two webinars for potential providers (including many local authorities) to share our current thinking about Ofsted’s regulation and inspection arrangements for supported accommodation. More than 1,500 people joined the live events and the recording has had over 500 views so far. (You can view the recording here.)"
        },
        {
            "text": "These kind of events are not only a good way of sharing information with a wide audience, but the questions you ask at them also help us to sharpen our thinking and clarify our messages."
        },
        {
            "text": "Since we held the webinars, the government has launched its consultation on the quality standards and guidance for supported accommodation for children in care and care leavers aged 16 and 17. I hope that everyone with an interest in the care system takes the time to respond to the government’s proposals."
        },
        {
            "text": "The Department for Education (DFE) consultation will be open until Monday 16 January 2023."
        },
        {
            "heading": 2,
            "text": "Understanding the shape and size of supported accommodation "
        },
        {
            "text": "We carried out a survey of local authorities earlier in 2022 to help us understand the size and nature of the supported accommodation sector. From the responses to that survey, we estimated that there were around 1,100 supported accommodation providers. We also estimated that there are as many as 7,000 looked after children and care leavers aged 16 to 17 living in this type of provision."
        },
        {
            "text": "To have a better understanding of how diverse supported accommodation is, we sent a voluntary survey to providers of supported accommodation in October 2022. We received more than 400 submissions, which was encouraging. Although this did not give us a complete picture of the entire sector, the providers who did respond were accommodating around 70% of the estimated number of 16-17-year-olds living in supported accommodation. This coverage gives us strong evidence on the size and scope of this provision and will help us to manage the demand when we begin receiving applications in April."
        },
        {
            "heading": 2,
            "text": "Main findings from autumn’s survey"
        },
        {
            "heading": 4,
            "text": "Most providers had a small number of settings"
        },
        {
            "text": "There were around 4,200 settings split across the 400 providers who supplied us with information. Over 60% of providers were operating five or fewer settings, and just over a third of providers had only one or two settings. Only five providers were operating more than 100 settings."
        },
        {
            "heading": 4,
            "text": "There was a variety of types of accommodation"
        },
        {
            "text": " We asked providers to tell us about the different types of provision they offered, with reference to the proposed categories of supported accommodation (as set out in the current DfE consultation)."
        },
        {
            "text": "The most common setting type was ‘single occupancy’ (over 40%). Most other settings (30%) were shared or group accommodation specifically for 16- to 17-year-olds and care leavers. The remaining settings were either supported lodgings-type provision in private homes or shared accommodation that could also accommodate non-care-experienced residents aged 18 years or older."
        },
        {
            "heading": 4,
            "text": "Most residents were 16- to 17-year-olds or care leavers"
        },
        {
            "text": "Around 40% of the residents were aged 16 to 17, 35% were care leavers aged 18 years or older, and the rest were non-care-leavers aged 18 years or older."
        },
        {
            "heading": 4,
            "text": "There was a variety of supported accommodation across all geographical regions"
        },
        {
            "text": "Each of Ofsted’s regions were represented in the survey responses. All had at least 300 settings and all had at least 50 different providers operating in them (except the South West region which had fewer). The split of accommodation types varied slightly between regions. For example, there was a higher proportion of group accommodation settings specifically for 16-17-year-old children in care and care leavers in London and the East of England. The North East, Yorkshire and the Humber region had a higher proportion of ‘single occupancy’ settings."
        },
        {
            "heading": 2,
            "text": "Regulation of supported accommodation is absolutely essential"
        },
        {
            "text": "As you’d expect, we’ve been working closely with the DfE as it has been developing its proposals. It’s essential that the legal framework equips us to be a responsible and effective regulator. We are very aware of the challenges and pressures that commissioners are facing in finding places for children in care and care leavers to live. We also know that children need a nurturing and safe home environment as they approach adulthood."
        },
        {
            "text": "We are committed to getting the regulatory balance right. To enable us to do so, the law must give us the powers to intervene effectively on behalf of children when children are not being cared for or supported properly. The standards and regulations must allow us to act flexibly and proportionally in this hugely varied and dynamic sector, while retaining high expectations of quality for all types of provision. Regulating and inspecting at the provider-level, for example, is one example of a proportionate system that provides a level of assurance across the provider’s total provision. We can also respond to concerns at a setting-level when that becomes necessary."
        },
        {
            "text": "We agreed to regulate and inspect supported accommodation just over 12 months ago. His Majesty’s Chief Inspector observed then that children’s experiences of supported accommodated were too often unacceptably poor. Standards need to rise urgently. Regulation is an important step in the right direction. But it’s only a small step - and only part of the solution."
        },
        {
            "text": "Government data recently confirmed that, in March 2022, the number of looked after children in semi-independent accommodation rose by more than a quarter in 2021-22. Over the same period, the number of children in unregulated placements increased by 23%. That number now equates to nearly 1 in 10 of looked after children."
        },
        {
            "text": "I strongly believe that regulation will improve standards. But it may lead, at least in the short-term, to further difficulties. Our oversight is likely to shed light on the uncomfortable reality - that too many children are currently living without the right kind of everyday safeguards that they should expect from a system that is there to protect and care for them."
        },
        {
            "text": "While it may be true that supported accommodation is right for some children, it’s hard to believe that it’s the right option for as many as 7,000 children in care. Few would argue that the lack of suitable care provision across England is not one of the main drivers for the growing reliance on unregulated, semi-independent provision."
        },
        {
            "text": "It’s crucial that we continue to use our insights to share truths, however uncomfortable, to leaders and decision-makers in all parts of the system. We will use our powers responsibly and proportionately but, as you’d expect, our first priority will always be children. All of us who have a role in assuring this system (including providers, local authorities, the DfE and Ofsted) will need to oversee these changes with great care. We must share our insights on the impact, and respond appropriately and swiftly to the challenges that emerge along the way."
        },
        {
            "text": "At Ofsted, we endeavour to be a force for improvement in the next phase of this journey. We will highlight and celebrate good and outstanding practice but, where we see shortfalls, we will report without fear or favour, and take the necessary action. We will also share our insights on any systemic challenges to assist policy and decision-makers in continuing to improve the experiences of all children in care and care leavers."
        },
        {
            "text": " "
        }
    ]
}