{
    "url": "https://planninginspectorate.blog.gov.uk/2023/01/06/how-were-delivering-equality-diversity-and-inclusion/",
    "title": "How we’re delivering equality, diversity and inclusion",
    "authors": [
        "Georgia Smith"
    ],
    "categories": [
        "Diversity and Inclusion",
        "People"
    ],
    "pub_date": "2023-01-06T12:13:10+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Georgia Smith, Lead HR Business Partner at the Planning Inspectorate reflects on the recent release of Inspectorate diversity statistics."
        },
        {
            "text": "Former HR Business Partner, Gail Larkin, blogged about why we need to prioritise equality, diversity and inclusion (ED&I) at the Planning Inspectorate. Since then, we’ve been making progress towards the ED&I priorities outlined in that post (and mentioned below)."
        },
        {
            "text": "Like every organisation across the Civil Service, the Inspectorate is committed to being an inclusive employer. We make decisions and recommendations that impact a whole range of customers, and it’s critical our organisation reflects the diversity of those customers. We recognise the importance of this in ensuring we are an accountable, trusted public service."
        },
        {
            "text": "As a public sector organisation, we also have obligations under the Public Sector Equality Duty to:"
        },
        {
            "heading": 2,
            "text": "Our ED&I priorities 2020 to 2025"
        },
        {
            "text": "Our annual diversity statistical release provides the details on where we are now as an organisation."
        },
        {
            "heading": 2,
            "text": "What have we done so far this year to progress our ED&I priorities?"
        },
        {
            "text": "At the Planning Inspectorate, we have carried out diversity and inclusion activities in the last year to improve in our five priority areas:"
        },
        {
            "heading": 2,
            "text": "What’s planned for the next 12 months?"
        },
        {
            "text": "There is still so much to do to drive the diversity and inclusion agenda forward. We have undertaken a lot of activity in the last year, but we know that becoming a diverse and inclusive organisation is a continuous process where we push ourselves further and continue to learn and adapt."
        },
        {
            "text": "For the coming year, we are:"
        }
    ]
}