{
    "url": "https://design102.blog.gov.uk/2023/01/06/improve-your-writing-with-this-simple-abc/",
    "title": "Improve your writing with this simple ABC",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Advice",
        "Copywriting",
        "Team"
    ],
    "pub_date": "2023-01-06T12:01:26+00:00",
    "content": [
        {
            "text": "Writing for government is a complicated affair, often involving style guides, stakeholders and personal preferences. At Design102, working on projects for most government departments means that we see the common issues – and understand how small changes can bring big improvements."
        },
        {
            "text": "We’ve poured our knowledge into a comprehensive style guide that we update every year, guiding our work and recommendations. But we can’t expect everyone to find the nuances of nouns or the particulars of punctuation very riveting. That’s why we’ve created this handy ABC to cover the three most common issues in government writing."
        },
        {
            "text": "In this post, we’ll take you through the best practice for using:"
        },
        {
            "text": "Following these tips will ensure your writing is clearer, more focused and more effective – because it will give you more time to refine the bigger stuff."
        },
        {
            "text": "Bookmark this page and refer back to it the next time you’re putting together a document or report. You can also email hello@design102.co.uk if you’d like a PDF version to keep on your desktop."
        },
        {
            "heading": 2,
            "text": "Abbreviations"
        },
        {
            "text": "From arm’s length bodies to zero-emission vehicles, government work uses many terms that can be tempting to abbreviate. But while the initials ALB and ZEV can save space, they aren’t always helpful for your audience."
        },
        {
            "text": "Every audience is different, and people may have certain needs or difficulties that mean even terms like UK, VAT and MP aren’t obvious. Research and testing will help you to ensure that people understand the words and abbreviations you’re using."
        },
        {
            "text": "The number of abbreviations you use is also important. Introducing too many can cause confusion and you shouldn’t always expect your audience to remember them. You can simplify your writing by limiting the number of abbreviations you use – for reports or long documents, we recommend using no more than 10."
        },
        {
            "text": "You should consider which terms are most useful to abbreviate, which are usually:"
        },
        {
            "text": "And trust your common sense. UNESCO is much more widely understood than the full title: ‘United Nations Educational, Scientific and Cultural Organization’."
        },
        {
            "text": "Our job is about opening communication up, not adding more barriers. Working in government communications means that we know our DCMS from our Defra – but we shouldn’t expect everyone else to!"
        },
        {
            "heading": 2,
            "text": "Bullet points"
        },
        {
            "text": "Bullet points are a useful way to make your information easier to digest, particularly for people with additional needs or a lower reading age. Simplify complex lists and break information into manageable chunks like we’ve shown here."
        },
        {
            "text": "Bullet points can:"
        },
        {
            "text": "When using bullet points, you should:"
        },
        {
            "text": "Bullet points are especially useful when you have limited space or need to convey information at a glance, such as on a poster or banner. You can also use them in social media posts to highlight the most important messages."
        },
        {
            "heading": 2,
            "text": "Capital letters"
        },
        {
            "text": "Our third tip for keeping government communication simple involves capital letters. Proper nouns and names do need a capital letter – but using them unnecessarily can make a document very hard to read."
        },
        {
            "text": "Do your ‘Programme Objectives’ really need to be written in this way? Can your ‘SECTION TITLE’ just be a ‘Section title’? And are you using general terms like ‘Communications Team’ that can be lowercase instead?"
        },
        {
            "text": "In government work, you should capitalise:"
        },
        {
            "text": "But you don’t need to capitalise:"
        },
        {
            "text": "In general, you should always write in sentence case, like this. And remember the golden rule: if in doubt, and you can understand it without, don’t use capital letters."
        },
        {
            "text": "Using this ABC means you’ll be able to focus on spotting errors and making your writing sound compelling, rather than getting bogged down by common but easily fixable issues."
        },
        {
            "text": "We’d love to help. Email us at hello@design102.co.uk for a copy of our full style guide or to talk about any copy questions you have."
        },
        {
            "text": "If you’d like to know more about Design102 or to see more examples of our work, please contact us or view the Design102 website."
        },
        {
            "text": " "
        }
    ]
}