{
    "url": "https://ruralpayments.blog.gov.uk/2023/01/06/introducing-you-to-15/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2023-01-06T11:28:36+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Hi, I’m Elise and I’m an Organisational Capability Advisor within the RPA based in our Exeter office."
        },
        {
            "text": "I’ve worked at RPA since 2017, starting as a temporary staff member processing applications to the Basic Payments Scheme. I then went to work on the Future Farming Programme, before starting in my current role which is my favourite yet."
        },
        {
            "text": "My team is responsible for helping to bring great people into RPA, to enable and support any work that develops our people and to ensure there are opportunities for all to progress within RPA and beyond. My primary responsibility within this is to increase awareness in communities of RPA as an employer and creating new methods and channels for attracting people to RPA. I help to develop targeted marketing programmes and share advice on the experience of candidates to break down barriers faced by those in under-represented groups, supporting RPA’s commitment to equality, diversity and inclusion."
        },
        {
            "text": "In a typical day I’ll be working with external partners and networks, exploring the opportunities for outreach, designing new resources or new programmes for career entry and the development of our existing people. What I enjoy most about this role is feeling like we’re bringing opportunities to those who are facing disadvantage, opening doors to future opportunities by making the Civil Service more visible and accessible."
        },
        {
            "text": "A piece of work I’ve been especially proud of achieving since starting this role is helping to develop the first Chartered Management Degree Apprentice in Environmental Sustainability with the University of Cumbria. Through this we are helping to lay the roadmap for sustainability leadership to support climate action and Net Zero commitments."
        },
        {
            "text": "The work of my team helps our customers by ensuring we influence the recruitment and development of our people to deliver the changes and services we need to ensure we provide a fantastic and empathetic service for our customers. We also help to create an environment where a more diverse range of views can be shared and voices heard, so the best ideas for our customers can be brought forward, and our people feel motivated and inspired to work."
        },
        {
            "text": "I’d love RPA to support our farmers further by developing our people’s understanding of the farming community as a whole, something my team, along with others, are working on. RPA has already introduced training and tools such as our Farming Calendar and Customer Excellence Training and promoting volunteering within our local communities. I hope to build on this by sharing knowledge and developing connections with land-based colleges, so everyone in the RPA, regardless of their background can better understand the challenges our customers face and the inspiring work they do."
        },
        {
            "text": "Whilst I grew up in the Dartmoor National Park and knew many people in the farming community, I know if I’d an even better knowledge of the farming community in my earlier roles in the RPA, it would have really helped me!"
        },
        {
            "text": "Outside of work I love doing wild and sea swimming at the local beaches around Exeter, baking new recipes, renovating my first home and enjoying local walks in the parks and countryside in Devon with my Lurcher Luna, and my new cocker spaniel Albus!"
        }
    ]
}