{
    "url": "https://digitalpeople.blog.gov.uk/2023/01/06/using-robots-to-teach-basic-programming-with-north-east-school-students/",
    "title": "Using robots to teach basic programming with North-East school students.",
    "authors": [
        "Chloe Thompson, Head of Delivery Management, HMRC"
    ],
    "categories": [
        "Community",
        "Digital data and technology",
        "Diversity and Inclusion",
        "People and Skills",
        "Skills and Learning",
        "Training and progression",
        "Women in Tech",
        "Working at HMRC"
    ],
    "pub_date": "2023-01-06T08:00:57+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "My name is Chloe Thompson, Head of (Agile) Delivery Management and I’m a self-confessed career civil servant. I’ve been in HMRC since leaving sixth form at 17 and have worked in various departments before finally finding a job I love, working on digital services."
        },
        {
            "text": "I would never have thought I would work in tech. I was very much arts and design focussed when I was younger but, as I’ve found, you don’t have to be ‘techie’ to work in tech. It’s why I have been so motivated to get into the classroom to tell students about tech careers. Imagine being at school and hearing that someone from the tax office was coming to teach you about code – might not sound like the most exciting session? But what if I said a group of digital professionals from one of the UK’s largest IT estates was going to run a session with sphere shaped robots that you had to get round a track (albeit made of masking tape) using iPads?"
        },
        {
            "heading": 3,
            "text": "Interactive Tech Teaching"
        },
        {
            "text": "Having run school sessions pre-covid, we knew that PowerPoint presentations aren’t the way to light a fire in students to start a career in tech. We wanted to make the sessions interactive while still teaching the students about tech skills and roles."
        },
        {
            "text": "We’ve run three sessions since June 2022. I led the sessions, representing HMRC’s Digital department and our award-winning Women in Tech network. I formed the Women in Tech network back in 2018 and it’s been such a strong passion of mine. "
        },
        {
            "text": "In one of the sessions, we were working with mixed classes of thirty, 13–14-year-olds. The girls were very reserved, but I wanted them to have a go and could see how quickly they were picking up the programming and enjoying the session as they successfully navigated the robot around the track. One girl was a real star and picked up coding so naturally, despite having never done it before!"
        },
        {
            "text": "Several HMRC colleagues have been involved and without them, the sessions wouldn’t have been possible. I have to give a particular mention to Dave and Graham who ran the sessions on the hottest day of the year – 36 degrees in Newcastle!"
        },
        {
            "text": "We ran sessions on estimation, prioritisation and user research to showcase some of the things we do in tech – it’s not all about coding! I always thought you had to be technical to work in tech, when in fact that’s not the case. Of course we have specialist roles such as software developers, but a lot of our roles like Delivery Managers, User Researchers, Designers, Product Managers... are about people, collaboration, and communication!"
        },
        {
            "heading": 3,
            "text": "Feedback and Next Steps"
        },
        {
            "text": "We’ve had fantastic feedback from students and teachers following the events – here’s a couple of the comments we received:"
        },
        {
            "text": "We’ve been really excited by the engagement and are looking forward to running further sessions in our community. If you are based in the North East and know a school who might like to learn more about digital careers, please get in touch. I’d particularly like to run sessions with under-10’s so we can start planting the seeds for children to consider a tech career when the time comes!"
        }
    ]
}