{
    "url": "https://mhclgdigital.blog.gov.uk/2018/06/11/high-digital-ambitions-for-our-policy-department/",
    "title": "High digital ambitions for our policy department",
    "authors": [
        "Paul Maltby"
    ],
    "categories": [
        "Digital land",
        "Digital land services",
        "Digital policy",
        "Local Digital",
        "Local Digital"
    ],
    "pub_date": "2018-06-11T13:07:02+01:00",
    "content": [
        {
            "text": "Things are changing over here in the Ministry for Housing Communities and Local Government (MHCLG)."
        },
        {
            "text": "The 2017 autumn budget positioned housing as the government's main domestic policy priority and to support a department growing in its responsibilities, it was recognised that we needed to do more to keep our digital and technology capabilities up to date as part of a wider improvement in our corporate services."
        },
        {
            "text": "Unlike many of the other big Whitehall departments, our core department has very few public facing transactional services ('applying for a thing'). Instead, our focus is mainly on policy work and system stewardship, and the delivery of our large programmes relies on the hard work of colleagues in local government, arms-length bodies like Homes England and partners in the private sector."
        },
        {
            "text": "Most of the major advances in digital across government over the last decade have focused on those direct transactional services, so in MHCLG we have the ambition to meet our minister's objectives by providing excellent digital services and being Whitehall's leading digital policy department."
        },
        {
            "heading": 3,
            "text": "So what does that mean?"
        },
        {
            "text": "Top of the list is a serious upgrade of the department's office IT. Not only does our old system figure strongly in day-to-day complaints from colleagues, but it also impacts on our ability to work in a modern way. In practice this means not relying on attachments and tracked changes in documents rather than collaborating in them, or carrying bundles of papers rather than having the information we need at our fingertips."
        },
        {
            "text": "Our new internal digital teams also means we have the skills and processes necessary to help the department improve its business applications and other technology choices."
        },
        {
            "text": "But our ambitions stretch beyond just a high quality internal service. Our department is engaged with some of the nation's most pressing issues and we want to better support these externally-facing policy outcomes using digital skills."
        },
        {
            "text": "On housing that means helping achieve more homes for people by encouraging the diversification of the housing market through supporting digital and data 'PropTech' entrepreneurs. There is a wealth of data collected across the public sector that could be used to help drive innovation, but too often that data is hard to find and build digital products upon."
        },
        {
            "heading": 3,
            "text": "Embracing a new way of working"
        },
        {
            "text": "We will be working with innovators in these sectors to help modernise the planning system, help housing developers in their search for plots to develop and help improve the home buying and selling process."
        },
        {
            "text": "And for local government, we will be working alongside our colleagues who are striving to make the change from a sector weighed down by frustrating, poor quality technology systems towards new digital services driven by citizen and user needs - comprised of more modular, flexible technology components."
        },
        {
            "text": "This team is getting started with a roadshow in June and July. We’ll share our starter plans and workshop how best to meet local needs. You can read more and register here."
        },
        {
            "text": "In order for our new team to be successful we will need to embrace a way of working that is outward looking, quick to iterate and which collaborates widely with individuals and organisations across the sectors we deal with."
        },
        {
            "text": "As a team that purposefully mixes both digital and policy skills sets we will be actively embracing the OneTeamGovernment principles and outlook on reform within government, including working in the open - for instance via this blog - wherever we can."
        },
        {
            "text": "Sign up for MHCLG email alerts to keep updated on this blog."
        },
        {
            "text": " "
        }
    ]
}