{
    "url": "https://civilservice.blog.gov.uk/2022/03/01/diversity-leads-to-better-decision-making/",
    "title": "Diversity leads to better decision-making",
    "authors": [
        "Kate Davies, Senior Security Advisor, Department for International Trade"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-03-01T09:24:16+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Government Security Function’s mission is to defend the UK government from security threats whilst protecting the public. To do this effectively, they’re driving up diversity of thought in every area of their work. "
        },
        {
            "text": "The Government Security Function is made up of 11,500 people across government who come from a wide variety of backgrounds, but we realise we always need to do more to promote diversity. Beyond looking for diversity as we recruit, we want diverse, talented individuals working across every area of security, from cyber policy and insider threat, to guarding, vetting and much more. "
        },
        {
            "text": "Diversity - nothing new"
        },
        {
            "text": "The importance of diversity in our decision-making machine is not new, nor is it unique to the Civil Service. Far from it. From the wide-ranging examples across education, healthcare and foreign policy, we’ve long heard that government decision-makers should reflect the population they serve. "
        },
        {
            "text": "To put it simply, the more we hear from those with different backgrounds and lived experiences, the wider variety of different - and equally valid - viewpoints we hear. The difficulty has always been in how to make this happen in a workforce that has historically lacked diversity; a particular problem for the Government Security Function."
        },
        {
            "text": "So what’s the Government Security Profession team doing?"
        },
        {
            "text": "The profession team has launched a variety of interventions to improve representation at senior levels. We’ve invested heavily in recruitment processes to improve representation at entry level to our apprenticeship and graduate schemes. However, this isn’t just about improving representation - how do we bring that diversity of thought into every element of our work across the Government Security Function?"
        },
        {
            "text": "The Challenge Forum"
        },
        {
            "text": "In 2021, the Security Profession team launched the Government Security Challenge Forum, with an aim of bringing diversity of thought to work happening across the Security Function. The forum was formed by inviting applications from across the function from those who were currently underrepresented in government security."
        },
        {
            "text": "Demographically diverse"
        },
        {
            "text": "Although the group is demographically diverse, the Government Security Profession team also ensured members had a background in a variety of security specialisms, were across all grades (EO to SCS), and were based all over the Civil Service; members are from 12 different departments and based in seven regions in the UK. Many come from outside the Civil Service and have had non-security careers previously. Membership is large, but participation is deliberately agile and fluid."
        },
        {
            "text": "In a nutshell, the Challenge Forum exists in order to provide a mechanism for meaningful challenge for all new work created within the Security Function. An axe blow to groupthink, it’s intended that security teams can bring work to the Challenge Forum in its early stages, throughout development and beyond, to ensure that the work has considered all aspects of equality, diversity and inclusion, so it meets the needs of all of us across government. "
        },
        {
            "text": "Mini Challenge Forum"
        },
        {
            "text": "In medium-sized groups, we hear about new work from across the function, present challenge and discuss next steps; and in smaller groups or mentoring circles, we provide mutual support, reflect on learning and recent challenges, and in some cases, create a mini Challenge Forum to practice thinking critically about a piece of work and presenting challenge and feedback in an effective way. "
        },
        {
            "text": "Challenge can take the micro form - such as using a better font for the visually impaired - or macro - using tools such as ‘6 Strategic Questions’ to ask if the owners of the work are even trying to solve the right problem. Owners may come away with some tweaks to their proposals, some guided actions on how to better land their proposals with the workforce, or a major rewrite having picked proposals apart with their new knowledge from Challenge Forum members."
        },
        {
            "text": "Early days"
        },
        {
            "text": "The forum is still in its early days but we’ve received really positive feedback from those who have used it. The group has supported the National Security Culture, Diversity and Inclusion team, providing valuable feedback on how to make their Mission Critical Toolkit more accessible for those with visual impairments. "
        },
        {
            "text": "More inclusive language"
        },
        {
            "text": "They’ve advised the GSG Personnel Security Policy team on more inclusive language that can be used within their policies. They’ve also been consulted on the development of new vetting guidance, bringing their diverse experiences to the table when sharing what needs to be included. This helps ensure the process doesn’t deter those from underrepresented groups from applying for roles in the Civil Service."
        },
        {
            "text": "Ultimately, we should be measured not only by the inroads that the Challenge Forum is making. But also by the fact we work in a function that supports and celebrates the existence of the Challenge Forum. What better way to demonstrate our commitment to creating A Modern Civil Service which is more Skilled, Innovative and Ambitious?"
        },
        {
            "text": "If you think the Challenge Forum could help bring diversity of thought to your work, contact gsp@cabinetoffice.gov.uk. "
        }
    ]
}