{
    "url": "https://forestrycommission.blog.gov.uk/2022/03/01/making-space-for-nature-to-benefit-water/",
    "title": "Making space for nature – to benefit water",
    "authors": [
        "Neil Jarvis"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-03-01T17:56:49+00:00",
    "content": [
        {
            "text": "Land management is in transition and the farming community is being asked to consider sustainability, net carbon balance, biodiversity: the number of schemes and incentives can be overwhelming. So how can farmers and landowners square the circle of farm income and environmental benefits?"
        },
        {
            "text": "Let’s keep it simple by considering just one possible option with multiple benefits – woodlands for water, which means planting trees to improve water quality or for natural flood management."
        },
        {
            "heading": 2,
            "text": "The reality of water quality"
        },
        {
            "text": "Water quality has improved since Defra and the Environment Agency produced their Farming Rules for Water in 2018, which farmers and landowners have taken to heart and implemented. However, field research done by the University of East Anglia and others shows that agricultural products are still finding their way into fresh water, posing health threats for people and wildlife."
        },
        {
            "text": "Nitrogen (N) and Phosphate (P) fertilisers and organic manure are essential to sustain agricultural yields. The timing of the application of fertilisers can help to avoid N and P loss due to rainfall, but inevitably large amounts of agricultural applications can, and still are, leaching into watercourses."
        },
        {
            "text": "In a nutshell, planting a new woodland across slopes or beside a river can help to intercept run-off and greatly reduce pollution from entering nearby waterways. The N and P in overland water flows, and seepage through the soil is slowed, captured and used by trees."
        },
        {
            "text": "Woodland shelterbelts can also act as a physical barrier to spray drift, reducing the amount of pesticide entering watercourses. A shelterbelt is typically located on the upwind edge of a field, although if you want to tackle ammonia pollution from the air, it’s best to plant downwind from a livestock or poultry unit."
        },
        {
            "text": "Strips of woodland along the riverside can also provide an effective buffer zone, by reducing, and in most cases, preventing pollutants from adjacent fields from entering nearby watercourses. You might hear this being referred to as riparian planting and it can help to prevent flooding, by slowing flood flows, reducing sediment and bankside erosion, and increasing underground water storage."
        },
        {
            "text": "Tree roots and the roughness of a woodland floor also hold back soil – preventing erosion and sedimentation of ditches, which in turn reduces expensive ditch maintenance costs. Ditches are then able to cope with storm events and can alleviate local flooding – often responsible for ruining crops."
        },
        {
            "text": "A woodland’s soils, leaf litter, and tree roots all improve soil structure and rainfall infiltration – further contributing to natural flood management. Woodland will act like a sponge by soaking up, storing, and intercepting water, helping to slow storm water in a flood and reducing a river’s peak flow. If created with careful planning, new woodland can help to minimise flood damage in smaller catchments for downstream communities."
        },
        {
            "text": "Planting blocks of trees, known as windbreaks, can also help with drought management – moisture levels in soil are retained by limiting surface runoff, and the wind shadow will also reduce the amount of water that evaporates."
        },
        {
            "text": "There is grant support available to assist you with your water goals: you could receive additional Forestry Commission grant contributions up to £2,500/ha for improving water quality, flood management and creating woodland along rivers on your land through the England Woodland Creation Offer."
        },
        {
            "heading": 2,
            "text": "The proof is in the ‘planting’"
        },
        {
            "text": "The evidence is well documented:"
        },
        {
            "text": "Nature also benefits from the dappled shade provided by riparian tree planting, keeping rivers cool by as much as to 2 – 3 °C to help maintain oxygen levels in the water – benefiting aquatic wildlife and plants."
        },
        {
            "heading": 2,
            "text": "The wider benefits of woodland creation"
        },
        {
            "text": "Water quality improvement and flood management are not the only advantages of well-managed woodlands. Woodland creation in the right place can benefit your land, the local community, biodiversity and the wider environment. Planting trees can help manage soil – keeping more of it in your fields and allowing less of it to get into rivers. This could lead to more sustainable yields, provide shelter for livestock, and create vital wildlife corridors."
        },
        {
            "text": "Trees capture carbon in the form of CO2 from the atmosphere and can improve the net carbon balance of your land holding. Planted at a reasonable scale they can provide you with an income from timber and woodfuel, which can also be achieved through active woodland management in the woods you already have. Find out more about the far-reaching benefits of woodland creation in the Plant your future, the case for trees brochure."
        },
        {
            "heading": 2,
            "text": "Why plant now"
        },
        {
            "text": "Financial support is available through Forestry Commission grants and via partners and other woodland creation organisations. Our flagship scheme, the England Woodland Creation Offer covers:"
        }
    ]
}