{
    "url": "https://gds.blog.gov.uk/2022/03/01/podcast-improving-navigation-on-gov-uk/",
    "title": "Podcast: Improving navigation on GOV.UK",
    "authors": [
        "The GDS Team"
    ],
    "categories": [
        "GOV.UK",
        "Podcast",
        "Transformation",
        "User research"
    ],
    "pub_date": "2022-03-01T12:03:39+00:00",
    "content": [
        {
            "text": "In this month’s episode of the Government Digital Service (GDS) Podcast, we explain why we updated the GOV.UK homepage and its menu bars, and how we went about it."
        },
        {
            "text": "Sam Dub, Senior Product Manager, and Jenn Phillips-Bacher, Content Strategist, join us on this episode to share how their multi-disciplinary team has approached the never-ending user need to find information easily."
        },
        {
            "heading": 2,
            "text": "Continuing to work in the open"
        },
        {
            "text": "While there's been lots of developments on GOV.UK, the way most people browse it has remained largely unchanged after 2014, so it was worth investigating whether improvements would help users find what they came to the site for. We’ve previously shared what the discovery process unearthed, and what our next steps were going to be."
        },
        {
            "text": "True to the design principle of working in the open to make things better, we also provided an update on how our ideas for the menu bars were progressing, including changes to our initial ideas. We followed this up with a similar piece tracking the changes to the GOV.UK homepage, highlighting the positive implications for accessibility."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "heading": 2,
            "text": "Subscribe to our podcast"
        },
        {
            "text": "You can subscribe to the GDS Podcast on Spotify, Apple Podcasts and all other major podcast platforms. You can read a transcript of the podcast on Podbean."
        },
        {
            "text": "Do you enjoy the GDS Podcast? Help us to make it even better by completing our short, anonymous survey."
        }
    ]
}