{
    "url": "https://actuaries.blog.gov.uk/2023/10/18/improving-governments-financial-risk-management/",
    "title": "Improving government’s financial risk management",
    "authors": [
        "Aidan Smith - Chief Actuary"
    ],
    "categories": [
        "Finance",
        "Modelling",
        "Risk management"
    ],
    "pub_date": "2023-10-18T14:54:27+01:00",
    "content": [
        {
            "text": "A new unit, bringing together expertise from UK Government Investments (UKGI) and the Government Actuary's Department (GAD) to improve contingent liability management across government, was set up 2-and-a-half years ago."
        },
        {
            "text": "As I return to GAD after a rewarding secondment to this new team, I reflect on the difference it is making and the value of GAD’s support to it."
        },
        {
            "heading": 2,
            "text": "The importance of contingent liabilities"
        },
        {
            "text": "Contingent liabilities are commitments to future expenditure which depend on events. As an example, government might indemnify another party by committing to cover that party’s costs if something happens, often as part of a procurement contract. Or it might guarantee a loan issued by another party if the borrower defaults."
        },
        {
            "text": "Contingent liabilities are an important policy tool and can be instrumental in achieving the government’s objectives. However, there are several features of contingent liabilities which give rise to financial risks to be managed, such as:"
        },
        {
            "heading": 2,
            "text": "The role of the Contingent Liability Central Capability"
        },
        {
            "text": "There are existing processes in place to appraise and monitor departments’ use of contingent liabilities. These include a framework for HM Treasury approval of new items and disclosure requirements for departments’ annual reports."
        },
        {
            "text": "However, HM Treasury felt departments could benefit from greater availability of actuarial and credit risk expertise to support them in managing such interventions."
        },
        {
            "text": "Further, improved tracking and analysis of past outcomes could help departments to better learn from experience across government when designing new indemnities and guarantees. This analysis could also help HM Treasury to better understand government’s financial risks."
        },
        {
            "text": "The Contingent Liability Central Capability (CLCC) was formed as an analytical and advisory unit within UKGI. Its aim is to strengthen contingent liability expertise within government and improve how government manages its portfolio of risk from contingent liabilities."
        },
        {
            "text": "The CLCC helps departments to better design new contingent liabilities, to achieve the relevant policy aim while minimising financial risk. It reports on the government’s portfolio of contingent liabilities, taking a holistic view of government’s risk and facilitating cross-government learnings. It also helps departments connect with expertise elsewhere in government and improve their own management of contingent liabilities."
        },
        {
            "heading": 2,
            "text": "GAD's support to the CLCC"
        },
        {
            "heading": 3,
            "text": "Actuarial expertise"
        },
        {
            "text": "GAD provides the CLCC’s actuarial expertise on a secondment basis. I joined UKGI on secondment in February 2021 to support the establishment and initial growth of this new team. I was the first member of the new team, initially working with a set-up team to define the CLCC’s remit and recruit the expertise required to deliver it."
        },
        {
            "text": "The CLCC now comprises a diverse team of around 20 specialists, including actuaries on secondment from GAD, credit risk experts, analysts and policy professionals."
        },
        {
            "heading": 3,
            "text": "Strategic direction"
        },
        {
            "text": "GAD has provided input to the CLCC’s strategic direction since its inception during HM Treasury’s Balance Sheet Review. GAD worked closely with UKGI and HM Treasury during the formation of the CLCC. The Deputy Government Actuary continues to provide strategic guidance as a member of the contingent liabilities sub-committee of UKGI’s Board."
        },
        {
            "heading": 3,
            "text": "Collaborative working"
        },
        {
            "text": "GAD is well placed to provide any analysis and support which departments might require on insurance arrangements, financial modelling or pension schemes. GAD stays in regular contact with CLCC and HM Treasury on current issues, helping to signpost departments to the expertise available within government."
        },
        {
            "heading": 3,
            "text": "Peer review"
        },
        {
            "text": "GAD supports the CLCC in delivering quality analysis by providing technical peer review where required. As an example, GAD has reviewed the processes applied by the CLCC when advising on new policies and when consolidating data received from departments."
        },
        {
            "heading": 2,
            "text": "The CLCC’s achievements"
        },
        {
            "text": "Considering that it's not yet 3 years since the finalisation of the Balance Sheet Review in November 2020, the CLCC’s growth and achievements are impressive."
        },
        {
            "text": "In its first year alone, the CLCC advised on more than 50 cases of policy development involving contingent liabilities."
        },
        {
            "text": "It has built a strong presence, establishing a network of contingent liability practitioners across government. It is collecting new data on contingent liabilities which is being analysed to report on a cross-government portfolio basis later in the year."
        },
        {
            "text": "Personally, I have benefitted immeasurably from my secondment. From a leadership perspective, I have played a role in building a new, cross-government expert unit which is making significant improvements in financial transparency and risk management."
        },
        {
            "text": "From a technical perspective, my role has given me a cross-government understanding of insurance, pension and financial guarantee interventions. It has also given me better connections to the finance and policy professions in HM Treasury and other departments."
        },
        {
            "text": "I look forward to supporting the CLCC’s future development and successes as part of this partnership between UKGI and GAD."
        },
        {
            "text": "If you would like to find out more about the work which GAD undertakes in this area, contact us at enquiries@gad.gov.uk. For further information about the CLCC go to www.ukgi.org.uk/what-we-do/contingent-liabilities/."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}