{
    "url": "https://homeofficemedia.blog.gov.uk/2023/10/18/media-fact-sheet-nitrous-oxide-ban/",
    "title": "MEDIA FACT SHEET: NITROUS OXIDE BAN",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-10-18T09:00:56+01:00",
    "content": [
        {
            "text": "What is nitrous oxide? "
        },
        {
            "text": "Nitrous oxide is a colourless gas, also known as ‘laughing gas’. It can be misused for its psychoactive effects – or to ‘get a high’ – by inhalation. "
        },
        {
            "text": " "
        },
        {
            "text": "What changes to the law have been made? "
        },
        {
            "text": "We have updated the law to make possession of nitrous oxide illegal if it is, or is likely to be, wrongfully inhaled, by classifying it as a Class C drug under the Misuse of Drugs Act 1971. "
        },
        {
            "text": "It is now a criminal offence to be found in possession of the drug where its intended use is to be inhaled ‘to get high’.  "
        },
        {
            "text": "In technical terms, “wrongful inhalation” means inhalation for anything other than for medical or dental purposes. "
        },
        {
            "text": "It was already illegal to produce, supply, import or export nitrous oxide to be consumed for its psychoactive effects and it will remain so. "
        },
        {
            "text": "There is also a requirement on legitimate producers and suppliers of nitrous oxide to not be reckless as to whether someone is buying their product for wrongful inhalation, with no legitimate reason. Turning a blind eye will also be committing an offence.  "
        },
        {
            "text": "Those found in unlawful possession will face either an unlimited fine, a visible community punishment or a caution - which would appear on their criminal record.  "
        },
        {
            "text": "Repeat serious offenders may face a prison sentence of up to two years, an unlimited fine, or both."
        },
        {
            "text": "The penalty for supply or production will double, to up to 14 years in prison, an unlimited fine, or both. "
        },
        {
            "text": " "
        },
        {
            "text": "Why have we made these changes? "
        },
        {
            "text": "We have been growing increasingly concerned about the misuse of nitrous oxide and its impact on society. "
        },
        {
            "text": "Heavy nitrous oxide use can result in serious health harms such as neurological damage and even death due to the risk of falling unconscious and/or suffocating from the lack of oxygen. "
        },
        {
            "text": "There have been numerous reports of anti-social behaviour in connection with the abuse of the drug which causes harm to local communities and to the environment.  "
        },
        {
            "text": "This includes group gatherings to abuse the drug in public spaces, such as children’s parks or high streets, and subsequent littering of the discarded canisters.  "
        },
        {
            "text": "There have also been deaths connected to drug driving incidents. "
        },
        {
            "text": "In 2020/21, nitrous oxide was the third most used drug among 16- to 59-year-olds in England and Wales according to NHS data.  "
        },
        {
            "text": "An Office for National Statistics ONS report suggested that equates to around 230,000 young people who inhaled this harmful substance in England and Wales in the year ending June 2022. "
        },
        {
            "text": " "
        },
        {
            "text": "Didn’t the Advisory Council on the Misuse of Drugs (ACMD) recommend against making it a Class C drug as there was not enough evidence of health harms? "
        },
        {
            "text": "The ACMD did highlight anecdotal reports of an increase in both social and neurological harms, including the risk of neurological harm it presents to users when consumed in extreme volumes. "
        },
        {
            "text": "The government is entitled and expected to take a broader view and consider other relevant factors.  "
        },
        {
            "text": "We know that visible drug use is one of the biggest issues of anti-social behaviour people are concerned about in their local areas and it is clear the harms of nitrous oxide misuse are being felt by communities. "
        },
        {
            "text": "There is still more evidence to collect about the full extent of the harms of nitrous oxide, so we have gone further than the ACMD advice, taking action to keep people safe and crack down on anti-social behaviour. "
        },
        {
            "text": " "
        },
        {
            "text": "What is a legitimate use of nitrous oxide? "
        },
        {
            "text": "There are a broad range of legitimate uses of nitrous oxide, for example pain relief in medical settings, including dentistry.  "
        },
        {
            "text": "It is also used legitimately in industry, for manufacturing and technical processes, such as food packaging, but also in catering, as a whipped cream propellant.  "
        },
        {
            "text": "Hobbyists also use it in activities such as motorsport drag racing and model rocketry. "
        },
        {
            "text": " "
        },
        {
            "text": "How will people prove they are lawfully possessing or consuming nitrous oxide? "
        },
        {
            "text": "This will be a matter for police to investigate using their own discretion on a case-by-case basis.  "
        },
        {
            "text": "If in possession of nitrous oxide, it will be for individuals to demonstrate that they possess the drug for legitimate purposes. "
        },
        {
            "text": " "
        },
        {
            "text": "Will people need a licence to lawfully possess, produce or supply nitrous oxide? "
        },
        {
            "text": "Licences to use nitrous oxide will not be required, as this would place an undue burden on a large number of industries and individuals who use it for legitimate purposes.  "
        },
        {
            "text": "Those using nitrous oxide for legitimate medical use (as per all medical products) will continue to need a medical licence but there is no change to existing processes and licences.   "
        },
        {
            "text": "Please find further guidance here: Apply for a licence to market a medicine in the UK – GOV.UK (www.gov.uk)  "
        },
        {
            "text": " "
        },
        {
            "text": "What size canisters are illegal to possess without legitimate reason? "
        },
        {
            "text": "All sizes of nitrous oxide canisters are illegal if the supplier or owner does not have a legitimate use. "
        },
        {
            "text": " "
        },
        {
            "text": "What should you do if you see someone inhaling nitrous oxide? "
        },
        {
            "text": "You can report anti-social behaviour by contacting your local neighbourhood policing team via https://www.police.uk/ "
        },
        {
            "text": "Call 101 to contact the police and report a crime that is not an emergency. "
        },
        {
            "text": "You can also contact Crimestoppers to report a crime anonymously. They will pass the information about the crime to the police at www.crimestoppers-uk.org "
        },
        {
            "text": "Telephone: 0800 555 111 "
        },
        {
            "text": " "
        },
        {
            "text": "How should people dispose of canisters? "
        },
        {
            "text": "Check and see your council’s guidelines on nitrous oxide canister disposal: https://www.gov.uk/find-local-council "
        },
        {
            "text": " "
        },
        {
            "text": "What should people struggling with drug addiction do? "
        },
        {
            "text": "You should speak to your GP or phone 111 for advice on healthcare matters. "
        },
        {
            "text": "FRANK, the Government’s free national drugs information and advice service, provides information on nitrous oxide.  "
        },
        {
            "text": "It outlines the harms associated with nitrous oxide, such as dizziness, vitamin B deficiency and nerve damage that can result from heavy long-term use.  "
        },
        {
            "text": "It has been recently updated to reflect new and emerging patterns of use, such as the use of larger canisters. "
        },
        {
            "text": "You can call the Frank drugs helpline on 0300 123 6600 or find your local service here: Find drug and alcohol support near you | FRANK (talktofrank.com) "
        },
        {
            "text": " "
        },
        {
            "text": "Will the ban discourage people experiencing harms from seeking help? "
        },
        {
            "text": "Access to drug treatment is strictly confidential unless a person is a risk to themselves or others, for example: if someone presents as a suicide risk, if there are safeguarding concerns, or there is a risk of serious crime. "
        },
        {
            "text": " "
        },
        {
            "text": "What are you doing to tackle illegal supply of nitrous oxide? "
        },
        {
            "text": "The government is determined to crack down on the organised criminals behind illicit drugs supply. "
        },
        {
            "text": "Through our 10-year Drug Strategy, we have stepped up our response, attacking all stages of the supply chain to make the UK a significantly harder place for organised crime groups to operate in.  "
        },
        {
            "text": "As part of our ‘supply attack plan’, we are tackling the supply of drugs upstream, securing the border, and disrupting the highest harm organised crime groups. "
        },
        {
            "text": "The sale of illegal drugs online is listed as a priority harm in the Online Safety Act. "
        },
        {
            "text": "This ground-breaking piece of legislation compels tech companies to consider the risks associated with all elements of their services and take action to keep users safe.  "
        },
        {
            "text": "All companies in scope of the Online Safety Act will need to take action to prevent illegal content on their platforms and sites. "
        }
    ]
}