{
    "url": "https://valuationoffice.blog.gov.uk/2023/10/18/why-we-request-rent-lease-or-ownership-details/",
    "title": "Why we request rent, lease or ownership details",
    "authors": [
        "Meurig Morgan - Rent and lease details Product Owner"
    ],
    "categories": [
        "Business Rates"
    ],
    "pub_date": "2023-10-18T13:23:36+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Have you received a letter requesting rent, lease or ownership information about your property? "
        },
        {
            "text": "At the Valuation Office Agency (VOA), we are responsible for valuing all non-domestic properties in England and Wales. Non-domestic properties are properties that are not solely used as private homes. This includes properties such as: "
        },
        {
            "text": "The information you provide is used to set rateable values for all non-domestic properties. Rateable values represent the rent a property could have been let for on a set date. "
        },
        {
            "text": "These valuations are then used by your local council to calculate business rates. "
        },
        {
            "text": "Even if you do not pay business rates, you still need to share your property information. This is because all relevant properties are legally required to have a valuation.  "
        },
        {
            "text": "Why we need this information  "
        },
        {
            "text": "We regularly update rateable values to reflect changes in the property market. This is called a ‘revaluation’ and you can read more about the latest one in our article. "
        },
        {
            "text": "We continuously collect rent, lease, and ownership information so that we understand the latest trends in the different sectors of the property market. This knowledge helps us to carry out revaluations accurately and effectively.  "
        },
        {
            "text": "Providing your property information helps to make sure that rateable values are accurate and everyone pays the right amount of business rates. "
        },
        {
            "text": "It also means that your council gets the correct amount of money from taxpayers to fund local services. "
        },
        {
            "text": "When we ask for information  "
        },
        {
            "text": "We will ask for rent, lease, or ownership information if we believe your details have changed. For example, if a property is due to renew its rent or lease, or you have recently built or occupied the property.  "
        },
        {
            "text": "If your property has an open-ended lease or is freehold, we will ask you to confirm your details around every 3 years.  "
        },
        {
            "text": "How to share your information  "
        },
        {
            "text": "You only need to share your details with us if we have asked you to. You need to do this even if you no longer own or rent the property. "
        },
        {
            "text": "You can complete the rent, lease, or ownership details form online. In most cases, it takes around 30 minutes to complete. "
        },
        {
            "text": "If you do not send the information within 56 days of getting the letter, you may have to pay a penalty. "
        },
        {
            "text": "We will not share your information with anyone else unless it is lawful to do so.  "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Ydych chi wedi cael llythyr yn gofyn am wybodaeth rhent, prydles, neu berchnogaeth yn ymwneud â'ch eiddo?"
        },
        {
            "text": "Yn Asiantaeth y Swyddfa Brisio (VOA), rydym yn gyfrifol am brisio pob eiddo annomestig yng Nghymru a Lloegr. Mae eiddo annomestig yn eiddo nad ydynt yn cael eu defnyddio fel cartrefi preifat yn unig. Mae hyn yn cynnwys eiddo megis:"
        },
        {
            "text": "Mae’r wybodaeth rydych yn ei darparu yn cael ei defnyddio i osod gwerthoedd ardrethol ar gyfer pob eiddo annomestig. Mae gwerthoedd ardrethol yn cynrychioli’r rhent y gallai eiddo fod wedi’i ennill pe bai ar osod ar ddyddiad penodol."
        },
        {
            "text": "Yna, bydd y prisiadau hyn yn cael eu defnyddio gan eich cyngor lleol i gyfrifo ardrethi busnes."
        },
        {
            "text": "Hyd yn oed os nad ydych yn talu ardrethi busnes, mae angen i chi rannu gwybodaeth am eich eiddo. Mae hyn oherwydd ei bod yn ofynnol yn gyfreithiol i bob eiddo perthnasol gael ei brisio."
        },
        {
            "text": "Pam mae angen yr wybodaeth hon arnom "
        },
        {
            "text": "Rydym yn diweddaru gwerthoedd ardrethol yn rheolaidd i adlewyrchu newidiadau yn y farchnad eiddo. Yr enw ar hyn yw ‘ailbrisiad’ a gallwch ddarllen rhagor am yr un diweddaraf yn yr erthygl hon."
        },
        {
            "text": "Rydym yn casglu gwybodaeth am rent, prydles a pherchnogaeth yn barhaus fel ein bod yn deall y tueddiadau diweddaraf yng ngwahanol sectorau’r farchnad eiddo. Mae’r ddealltwriaeth hon yn ein helpu i gynnal ailbrisiadau yn gywir ac yn effeithiol."
        },
        {
            "text": "Mae darparu gwybodaeth am eich eiddo yn helpu i sicrhau bod gwerthoedd ardrethol yn gywir, a bod pawb yn talu’r swm cywir o ardrethi busnes."
        },
        {
            "text": "Mae hefyd yn golygu bod eich cyngor yn cael y swm cywir o arian gan drethdalwyr i ariannu gwasanaethau lleol."
        },
        {
            "text": "Pryd byddwn yn gofyn am wybodaeth "
        },
        {
            "text": "Byddwn yn gofyn am wybodaeth rhent, prydles neu berchnogaeth os ydym o’r farn bod eich manylion wedi newid. Er enghraifft, os oes disgwyl adnewyddu rhent neu brydles eiddo yn fuan, neu os ydych wedi adeiladu neu feddiannu’r eiddo yn ddiweddar."
        },
        {
            "text": "Os oes gan eich eiddo brydles benagored neu ei fod yn rhydd-ddaliol, byddwn yn gofyn i chi gadarnhau eich manylion tua phob 3 blynedd."
        },
        {
            "text": "Sut i rannu eich gwybodaeth "
        },
        {
            "text": "Dim ond os ydym wedi gofyn i chi rannu’ch manylion gyda ni y bydd angen i chi wneud hynny. Mae’n rhaid i chi wneud hyn hyd yn oed os nad ydych yn berchen ar yr eiddo nac yn ei rentu mwyach."
        },
        {
            "text": "Gallwch lenwi’r ffurflen manylion rhent, prydles neu berchnogaeth ar-lein. Yn y rhan fwyaf o achosion, mae’n cymryd tua 30 munud i’w llenwi."
        },
        {
            "text": "Os na fyddwch yn anfon yr wybodaeth cyn pen 56 diwrnod ar ôl cael y llythyr, efallai y bydd yn rhaid i chi dalu cosb."
        },
        {
            "text": "Ni fyddwn yn rhannu eich gwybodaeth gydag unrhyw un arall oni bai ei bod yn gyfreithlon i ni wneud hynny."
        }
    ]
}