{
    "url": "https://deframedia.blog.gov.uk/2021/06/09/coverage-of-the-england-woodland-creation-offer/",
    "title": "Coverage of the England Woodland Creation Offer",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-06-09T11:42:04+01:00",
    "content": [
        {
            "text": "There is widespread positive coverage of the Forestry Commission’s proactive announcement of the England Woodland Creation Offer – a new multimillion tree planting grant scheme which provides greater financial incentives for landowners and farmers to plant and manage trees."
        },
        {
            "text": "The Guardian, Daily Mail and BBC Radio 4 Today Programme covered the announcement, with positive pieces that outline the details of the scheme, noting that landowners will be paid thousands of pounds in bonuses for creating new woodlands that boost wildlife, increase public access and reduce flooding."
        },
        {
            "text": "Stakeholders have welcomed the announcement are quoted in the coverage. The CLA said the payments were significantly better than before and provided a much-needed impetus to tree planting in England. The Woodland Trust says this is the first time funding has been available that combines the manifold benefits of trees. The NFU also welcomed the flexibility of the new scheme, which they said must work alongside productive farming."
        },
        {
            "text": "Farming Today and Farming UK both covered the scheme opening and Forestry Commission Chair Sir William Worsley was featured on Farming Today, speaking about how the new scheme is a serious option for farmers and landowners, and will help us meet the government’s ambitious tree planting targets by ensuring the right tree is planted in the right place, for the right reason."
        },
        {
            "text": "Forestry Commission Chair Sir William Worsley said:"
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "Today’s announcement follows the publication of the England Trees Action Plan. This was announced through the Environment Secretary’s recent speech from Delamere Forest where he outlined plans to treble tree planting rates in England during this Parliament, funded through an expected £500 million from the Nature for Climate Fund. Also recently announced, the Tree Health Pilot is taking action against pests and diseases which attack our trees, woods and forests."
        },
        {
            "text": "Apply for the England Woodland Creation Offer here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}