{
    "url": "https://civilservice.blog.gov.uk/2021/06/09/disability-and-diversity-in-leadership/",
    "title": "Disability and Diversity in Leadership",
    "authors": [
        "Sarah Healey, DCMS Permanent Secretary and CS Disability Champion"
    ],
    "categories": [
        "A great place to work",
        "Better policymaking",
        "Civil Service Leaders"
    ],
    "pub_date": "2021-06-09T07:57:42+00:00",
    "content": [
        {
            "text": "DCMS Permanent Secretary and CS Disability Champion Sarah Healey reflects on the success of this new programme."
        },
        {
            "text": "As the Civil Service Disability Champion, one of my priorities is to ensure we continue to provide opportunities for disabled colleagues to progress in their careers and invest in talent. "
        },
        {
            "text": "I am really encouraged to see the yearly rise in disabled participants applying for the flagship accelerated development schemes that the Civil Service offers, such as the Future Leaders Scheme (FLS), Senior Leaders Scheme (SLS) and the High Potential Development Scheme (HPDS). "
        },
        {
            "text": "I am particularly encouraged to see successful FLS applicants subsequently joining the bespoke DELTA (Disability Empowers Leadership Talent) programme."
        },
        {
            "text": "DELTA, launched in 2019, is a development programme for those on the Future Leaders Scheme with a disability and/or long-term health condition. DELTA aims to accelerate the development of high potential disabled colleagues and contributes to creating a more diverse and robust pipeline for senior roles. "
        },
        {
            "text": "DELTA helps to build networks across the Civil Service and supports disabled employees in their development of the skills and behaviours needed within the Senior Civil Service."
        },
        {
            "text": "Delighted"
        },
        {
            "text": "I was delighted to join the inaugural DELTA graduation event last month. It was great to hear participants share their experiences of the programme and reflect on their personal successes and achievements. It was particularly encouraging to hear how committed the cohort is to the wider inclusion agenda and being actively involved in driving change."
        },
        {
            "text": "Sharing stories of success is a great way of demonstrating what can be achieved by participating in programmes like DELTA and why they are so important. Below, Ollie Ringguth shares with us their experience of being on the DELTA programme and what it meant for them."
        },
        {
            "text": "Ollie’s Story"
        },
        {
            "text": "Ollie Ringguth, Security Advisor to Competition Markets Authority, Charity Commission and The National Security Archives. Ollie is a participant in the Future Leaders Scheme and DELTA 2019."
        },
        {
            "text": "What does DELTA mean to you? "
        },
        {
            "text": "When I joined the programme, I thought it was just about supporting disabled people into the Senior Civil Service. The reality is that it is so much more of a community beyond my expectations. I’ve learned so much about the challenges my colleagues face. I’ve also come to know and appreciate some really inspiring people."
        },
        {
            "text": "What's unique about this scheme, compared to your experience of FLS? "
        },
        {
            "text": "Whilst the Future Leadership Scheme has been great; the modules and Action Learning Sets were really helpful in thinking about yourself in the work context. DELTA, for me, was much more holistic in that it helped me to think about my disabilities in a much wider context. It also helped me understand (and accept) the impact they were having on my whole (as opposed to just work) life. The DELTA community has been second to none."
        },
        {
            "text": "How did DELTA support your development?"
        },
        {
            "text": "For me the development benefits have been far wider than the Future Leadership Scheme, it has helped me to understand my disability better and as a result be more open about it. This has helped in my personal and professional lives."
        },
        {
            "text": "Has DELTA changed the way you approach leadership?"
        },
        {
            "text": "The insight that I’ve received into what disability means for others, has been second to none. It has challenged a lot of my preconceptions and helped me (I hope) to be more considerate and thoughtful of the needs of those I work with."
        },
        {
            "text": "What's been the best part of DELTA?"
        },
        {
            "text": "The DELTA community – without a doubt!"
        },
        {
            "text": "Most challenging part of DELTA so far? "
        },
        {
            "text": "Facing up to my condition and realising that I wasn’t always managing it in the most effective way. Coming to terms with that has really helped me to get into better habits."
        },
        {
            "text": "Tell us the most interesting thing you’ve learned since joining DELTA?"
        },
        {
            "text": "Understanding other’s experiences – especially around mental health. It is an area I didn’t know a lot about and some of the insights have been really illuminating."
        },
        {
            "text": "How has DELTA shown consideration of your development needs? "
        },
        {
            "text": "The coaching was great, my coach really listened to me, where I was and what was holding me back."
        },
        {
            "text": "More information"
        },
        {
            "text": "Sharing insights from participants has immense value; they show the difference it can have on both a personal and professional level. Thanks to Ollie for sharing their story and I am pleased the experience was so positive. "
        },
        {
            "text": "I hope that it encourages you to think about your development, not just about applying for a talent programme but also in your development conversations with your manager. Please take the opportunity to reflect on what you have achieved to date and also look forward to what you want to achieve in the months ahead."
        },
        {
            "text": "If you would like more information about DELTA specifically, you can contact the creator of DELTA and Programme Lead Charlotte Hart: charlotte.hart@cabinetoffice.gov.uk."
        }
    ]
}