{
    "url": "https://insidehmcts.blog.gov.uk/2021/06/09/remote-hearings-their-role-in-extending-access-to-justice/",
    "title": "Remote hearings: their role in extending access to justice",
    "authors": [
        "Rosemary Rand"
    ],
    "categories": [
        "Court and tribunal reform"
    ],
    "pub_date": "2021-06-09T15:15:52+01:00",
    "content": [
        {
            "text": "When the impacts of COVID-19 first hit the UK, we had to respond quickly and ramped up the use of remote hearings, working with the judiciary and legal professionals. This meant cases continued during the height of national lockdown. From mid-May to end of December 2020, audio or video remote hearings accounted for just over half of all hearings."
        },
        {
            "text": "Before the COVID-19 pandemic began, we had started to test the use of video technology for live participation in hearings, as part of the video hearings project within the HMCTS Reform programme. A proof of concept was followed by a pilot in the tax tribunal, where all participants joined online.  Now, 15 months on from the start of the pandemic, it seems timely to look at how video hearings work and how they provide an alternative to attending a hearing in person."
        },
        {
            "text": "Why hold video hearings?"
        },
        {
            "text": "Video has been used in courts historically to enable certain participants to join a hearing remotely, including vulnerable witnesses. There are some clear benefits to having the option to attend a hearing remotely, compared with being physically present at a court or tribunal building.  One is that a video hearing can reduce the need for participants to travel. This can be better for them, and better for the environment."
        },
        {
            "text": "Not having to be physically present in a court building can also reduce stress. For some of our most vulnerable users, making it possible for them to attend their hearing from their own home is important.  For others, remote participation can remove the worry of being in the same room as other participants in the hearing, who they may be in conflict with."
        },
        {
            "text": "The option of having participants join by video means that courtrooms can be used more effectively and may reduce the need for hearings to be postponed at short notice, for instance if a participant is no longer able to travel to the court."
        },
        {
            "text": "However, attending a hearing remotely will not always be appropriate and the option to hold a video hearing will always be at the discretion of a judge, who will decide if it’s appropriate and in the interests of justice to do so. Before a video hearing takes place, a judge will consider the details of the case, the nature and complexity of the hearing and any information given that might affect the hearing taking place by video."
        },
        {
            "text": "How are video hearings run?"
        },
        {
            "text": "Video hearings can take place with all participants joining from different locations (a fully remote hearing) or with some participants remote and some in court (a hybrid hearing). This will depend on the decision taken by a judge."
        },
        {
            "text": "Since the start of the pandemic, we have increased the number of physical courtrooms capable of holding video-enabled hearings by 750. Approximately 2,300 rooms on our estate were equipped with video hardware pre-COVID. Cloud Video Platform (CVP), which was already in use in HMCTS, was rolled out as an emergency measure. This ensured hearings could still continue despite COVID restrictions."
        },
        {
            "text": "While CVP and other systems such as Microsoft Teams have created confidence that remote hearings can work, a video conference is not the same as a hearing.  This is why HMCTS has developed a Video Hearing service which is specifically designed to meet the needs of the judiciary and of court and tribunal users. The Video Hearings service supports users in advance of their hearing, so they know what to expect on the day and the interface for the hearing itself is designed to replicate the formality and gravitas of court and tribunal proceedings."
        },
        {
            "text": "We will introduce the Video Hearings service, replacing CVP and other video conferencing solutions, as part of our Reform programme.  The Video Hearings service is currently being used in tax, property and employment tribunals and is being tested in civil and family hearings. As the service is rolled out further, we will work closely with the judiciary, court users and our staff to make the transition as smooth as possible."
        },
        {
            "text": "The future of video hearings"
        },
        {
            "text": "As restrictions ease, we expect that video hearings will continue to be an integral part of a 21st century justice system, used in those hearings where the judge considers it appropriate. We will continue to monitor the impact on users and work closely with the judiciary."
        },
        {
            "text": "In May this year we released a survey and we will be looking at the results shortly. We know that there will be a range of views about remote hearings and we will continue to evaluate the technology, engage with our stakeholders and listen to feedback."
        },
        {
            "text": "Find out more about what to expect when joining a hearing by video."
        }
    ]
}