{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/06/09/silver-linings-mind-wellbeing-index-2020-21/",
    "title": "Silver Linings: Mind Wellbeing Index 2020/21",
    "authors": [
        "Adam Land"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2021-06-09T12:18:27+01:00",
    "content": [
        {
            "text": "The Competition and Markets Authority has been awarded a “Silver” rating by the mental health charity Mind in its 2020/21 Workplace Wellbeing Index. "
        },
        {
            "text": " "
        },
        {
            "text": "This is a wonderful achievement, and I’m very proud of the work we’ve been doing to support good mental health and wellbeing at the CMA. Not only is this a great award to receive, but it shows that the work we’ve been doing in this area is on the right path. "
        },
        {
            "text": " "
        },
        {
            "text": "So, you may be wondering what the Mind Workplace Wellbeing Index is? Or what it means for an organisation to be awarded a “Silver” rating?"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Wellbeing and mental health at the CMA "
        },
        {
            "text": "Back in 2016, we launched our Wellbeing and Mental Health network, and ran the first of our “Tea and Talk” sessions. These are open sessions where CMA colleagues can share their lived experiences of mental health difficulties, while sharing the techniques they use to manage their mental wellbeing."
        },
        {
            "text": "Over the past 5 years, we’ve received strong support from our CEO and Board to embed wellbeing issues into the CMA’s operations."
        },
        {
            "text": "As part of this, the CMA has signed up to various external schemes, including last year, the Mental Health at Work commitment. When we signed up to this commitment, one outstanding action was for us to benchmark our work on mental health against other similar organisations, so that we could discover what we were doing well, and areas where we can progress further."
        },
        {
            "text": "We chose the Mind index for this purpose, so that we could benefit from a strong set of comparator organisations, as well as benefitting from Mind’s expertise in workplace wellbeing."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "Getting a silver award indicates that we have gone beyond making a start towards improving employee wellbeing and that our work around mental health is now having a real impact."
        },
        {
            "text": "In total 144 organisations across the UK took part, which only emphasises the great achievement we have made as an organisation to be awarded a silver rating and in our first year of participation!"
        },
        {
            "text": "According to the Index report, 85% of people who responded feel that the CMA encourages openness and discussion about mental health. It also showed that over half of the respondents felt that working at the CMA had built their understanding of how to look after their own mental health."
        },
        {
            "text": "The results show we’ve come a long way and we will continue to build on the work we have been doing to ensure our staff can work in a safe and supportive environment at the CMA."
        },
        {
            "text": "You can find out more about the Wellbeing Index and the 2020/21 awards on Mind's Workplace Wellbeing Index page."
        }
    ]
}