{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/06/09/social-care-wres-in-praise-of-the-phase/",
    "title": "Social Care WRES: In praise of the phase!",
    "authors": [
        "Barbara Murray"
    ],
    "categories": [
        "Communities",
        "Consultation and engagement",
        "Society"
    ],
    "pub_date": "2021-06-09T15:30:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A new beginning for racial equality in social care"
        },
        {
            "text": "The social care workforce race and equality standard (SCWRES) officially launched on 1 April 2021 across 18 local authorities (LAs), the first phase of a timely and crucial programme committed to improve anti-racist and anti-discriminatory practices throughout the sector."
        },
        {
            "text": "It’s been a pleasure to celebrate the many achievements of this first phase with the main drivers of this project, our Chief Social Workers for adults and children’s services (past and present), Lyn Romeo, Fran Leddra, Mark Harvey and Isabelle Trowler. Likewise, the many colleagues, mentors and stakeholders who have joined us on this essential journey have been the most positive of collaborators."
        },
        {
            "text": "All 18 sites have now been allocated a SCWRES lead and the majority will have had a first meeting to talk through data collection, the support needed, and the outcomes they are aiming towards."
        },
        {
            "text": "Several LAs have logic models in place as aide memoires for their action plans. These models – or road maps – are graphic depictions of the shared relationships between resources, activities and outputs, and I am sure will help keep minds and actions focussed. We have a lot of work ahead of us, but this level of detail is testimony to the passion, drive, and commitment of LAs involved in this first phase."
        },
        {
            "heading": 2,
            "text": "Advisory group assembled"
        },
        {
            "text": "I’m also very pleased we’ve been able to announce the recruitment and induction of the SCWRES Advisory Group. We couldn’t do this in person of course, given persisting coronavirus restrictions, but our very first online meeting, earlier this month, was nonetheless a very friendly and positive affair."
        },
        {
            "text": "This assembly of experienced leaders and sector professionals will support programme leads with the strategic elements of the roll out and help them embed the SCWRES with social care providers, not just their own organisations."
        },
        {
            "text": "With any sector spanning initiative like this, it’s important to have frequent reviews to determine if the programme is having the planned impact. We are currently working with Kings College London on a mid-point evaluation to test progress of the roll out and get a sense of how the SCWRES is being received across the 18 localities."
        },
        {
            "text": "For now though, the signs are good, as our returning Joint Chief Social Worker for Adults, Lyn Romeo, observed during that first advisory group meeting:"
        },
        {
            "text": "The best is yet to come!"
        }
    ]
}