{
    "url": "https://mhclgdigital.blog.gov.uk/2025/09/23/digital-planning-transformation-gains-momentum/",
    "title": "Digital planning transformation gains momentum  ",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2025-09-23T10:57:57+01:00",
    "content": [
        {
            "text": "Open Digital Planning is becoming a powerful force for change in local government. This supportive community, backed by MHCLG’s Digital Planning programme, brings together authorities committed to modernising their planning services and making essential data publicly available.  "
        },
        {
            "text": "The network is continuing to grow, with 24 new planning authorities joining this month, through the Digital Planning Improvement Fund. "
        },
        {
            "text": "Each council is receiving £50,000 to transform how it delivers planning services, strengthen its digital capabilities and become part of the collaborative community that’s already making real improvements for residents, developers and stakeholders.  "
        },
        {
            "heading": 2,
            "text": "A community-driven approach "
        },
        {
            "text": "Open Digital Planning (ODP) offers much more than funding – it provides a supportive network where authorities support and learn from each other. Members benefit from peer-to-peer learning opportunities, digital and data training and comprehensive guidance through the ODP Hub. Regular in-person events, like the recent lively gathering in Gloucester (see picture above), help build valuable connections across the planning and Geographic Information System (GIS) community.  "
        },
        {
            "heading": 2,
            "text": "Getting a baseline "
        },
        {
            "text": "After joining the fund, new authorities begin their digital transformation journey with the Digital Planning Maturity Assessment – a tool that helps teams understand their digital strengths and identify areas to improve. "
        },
        {
            "text": "Castle Point Borough Council found the assessment particularly valuable:  "
        },
        {
            "heading": 2,
            "text": "Making planning data available for everyone "
        },
        {
            "text": "Each authority creates a tailored action plan and commits to making 4 crucial planning datasets available on the national Planning Data Platform: conservation areas, listed buildings, Tree Preservation Orders and Article 4 Directions.  "
        },
        {
            "text": "This transforms how residents, businesses and other stakeholders access vital planning information, moving from fragmented, hard-to-find data to standardised, searchable and always up-to-date information. When planning data is published in consistent formats, it enables better decision-making, reduces uncertainty and opens doors for innovation in the planning sector. "
        },
        {
            "heading": 2,
            "text": "Learning and growing together "
        },
        {
            "text": "Creating lasting connections and shared learning is a cornerstone of being part of Open Digital Planning. Community managers from the Digital Planning programme organise regular training and monthly show-and-tell sessions, giving authorities space to share successes, tackle challenges together and learn from each other's innovations.  "
        },
        {
            "text": "The collaborative approach is transforming how authorities work, as Lee West, from the London Borough of Waltham Forest recently noted:  "
        },
        {
            "heading": 2,
            "text": "Join the Digital Planning Improvement Fund "
        },
        {
            "text": "Local planning authorities who haven’t yet joined the fund can apply to join the next cohort. Applications close at midday on 30 October 2025.  Check your eligibility and get ready to join our growing community.  "
        },
        {
            "text": "The 24 authorities starting their digital journey this month are:  "
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        },
        {
            "text": "We're heading to DigiGov Expo 2025 on 24 and 25 September at the ExCeL London. Digital Planning will be part of the MHCLG Digital pod in the Government Village along with colleagues from AI, Data and Local Digital teams. "
        },
        {
            "text": "Our Head of Digital Delivery Baljit Rakhra will be joining a panel session on 'Building the Government Digital and Digital Civil Service' in the GovTech theatre on 25 September, while MHCLG's AI Director Tom Smith is speaking about 'Maximising the Benefits of AI in 2025', and Katie Owen, Service Owner in Local Digital, will join a panel discussing 'Local Resilience: Implementing Cyber Assessment Framework' on 24 September.  "
        }
    ]
}