{
    "url": "https://space.blog.gov.uk/2025/09/23/iadc-new-associate-member-announcement/",
    "title": "IADC New Associate Member Announcement",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Space sustainability"
    ],
    "pub_date": "2025-09-23T15:11:18+01:00",
    "content": [
        {
            "text": "The UK Space Agency, as the current Chair of the Inter-Agency Space Debris Coordination Committee (IADC), is pleased to announce that the Australian Space Agency (ASA) and Agencia Espacial Española (AEE, Spanish Space Agency) have become Associate Members of the Committee."
        },
        {
            "text": "The IADC, which is over 30 years old, is a group of 13 Member Space Agencies who perform coordinated research on space debris topics. The research performed by the Committee focuses on a range of topics from developing new approaches to shield spacecraft from natural and human-related debris impacts to forecasting the evolution of space debris environment. The output from this research has guided the development of the Committee’s most well-known product, the IADC Space Debris Mitigation Guidelines, which has informed the regulatory approach across the globe on how to mitigate the human impact on the space environment."
        },
        {
            "text": "The ASA and AEE join the New Zealand Space Agency as Associate Members of the Committee. The establishment of the Associate Member status in 2024 was intended to encourage interaction with a broader range of Space Agencies, fostering collaboration and raising awareness of the Committee’s research activities and guidelines."
        },
        {
            "text": "Andrew Ratcliffe, Chief Engineer at the UK Space Agency and the current Chair of the IADC said:"
        },
        {
            "text": "Enrico Palermo, Head of the Australian Space Agency said:"
        },
        {
            "text": "Juan Carlos Cortes, Director of the Spanish Space Agency said:"
        },
        {
            "text": "The UK Space Agency’s leading role within the IADC and other international forums such as UNCOPUOS is part of a broader set of Space Sustainability and In-Orbit Servicing, Assembly & Manufacturing (ISAM) activities led by the Agency and the Department for Science, Innovation and Technology Space Directorate. This includes regulation and standards, research, space observation and monitoring capabilities, and technology development for Active Debris Removal (ADR) and ISAM purposes."
        }
    ]
}