{
    "url": "https://healthmedia.blog.gov.uk/2025/09/23/paracetamol-and-pregnancy-what-you-need-to-know/",
    "title": "Paracetamol and pregnancy - what you need to know",
    "authors": [
        "harrisonbarnard"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-09-23T20:01:40+01:00",
    "content": [
        {
            "text": "THE FACTS"
        },
        {
            "text": "Q&A"
        },
        {
            "text": "Is paracetamol safe to use during pregnancy? "
        },
        {
            "text": "Yes. Current evidence supports the safe use of paracetamol during pregnancy when used as directed.  This advice has been consistent for many years. "
        },
        {
            "text": "The MHRA regularly reviews the safety of paracetamol during pregnancy to ensure that the benefits to the paint and unborn baby outweigh any risks. "
        },
        {
            "text": "Paracetamol is recommended by NHS guidance as the first-choice painkiller for pregnant women, to be used at the lowest dose and for the shortest duration. If pain does not resolve then patients are advised to seek advice from their healthcare professional. "
        },
        {
            "text": "Should pregnant women stop taking paracetamol? "
        },
        {
            "text": "No. Pregnant women should continue to follow current medical guidance. Paracetamol remains a recommended painkiller during pregnancy when used as directed. Women with concerns should speak to their healthcare professional rather than stopping medication without medical advice. "
        },
        {
            "text": "Will the MHRA review its guidance following the US announcement? "
        },
        {
            "text": "No."
        },
        {
            "text": "The MHRA carefully monitors new evidence on the safety of medicines and takes action when evidence shows a potential risk to patients."
        },
        {
            "text": "In the case of paracetamol use in pregnancy, recent studies, including the one published in August, have not established a direct relationship between paracetamol use during pregnancy and an increased risk of autism."
        },
        {
            "text": "Does the MHRA only act when a causal link is proven? "
        },
        {
            "text": "No. The MHRA carefully monitors new evidence on the safety of medicines and takes regulatory action when of evidence shows a potential risk to patients, which exceeds the potential benefits."
        },
        {
            "text": "It continuously monitors emerging data and will introduce safety measures when warranted to protect public health. "
        },
        {
            "text": "How does the MHRA monitor medicine safety in pregnancy? "
        },
        {
            "text": "The MHRA has comprehensive systems including the Yellow Card Scheme for reporting suspected side effects, analysis of healthcare databases, and review of international evidence. MHRA works closely with healthcare professionals and regularly update guidance when new evidence emerges. "
        }
    ]
}