{
    "url": "https://ipo.blog.gov.uk/2025/09/23/whats-changing-new-ipo-accounts/",
    "title": "What’s changing - new IPO accounts ",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "IPO",
        "Patents",
        "Transformation"
    ],
    "pub_date": "2025-09-23T14:18:29+01:00",
    "content": [
        {
            "text": "There's not long to wait for our One IPO Patent Service to launch. We're publishing a series of blogs to help ensure you're ready and raring to go when we go live. Last week's blog explored our future patents services and what services will be changing when it launches (if you missed it, you can read it here)."
        },
        {
            "text": "The biggest single change you can expect is the all-new IPO accounts. So, why will you now need an account, how do they work and what are the key features?  "
        },
        {
            "heading": 3,
            "text": "Why we’re introducing accounts "
        },
        {
            "text": "Your IPO account will be your gateway to the One IPO service and give you greater access to your UK patents than ever before.  "
        },
        {
            "text": "The new account offers a more modern and secure alternative to post or email updates. Rather than contacting the IPO to check your application status, you'll simply log in to view real-time information yourself. You'll also be able to make changes to your patent details instantly - such as updating applicant names or addresses - instead of sending us forms and waiting for us to process them. It's similar to managing an online shopping account, but for your UK patents, giving you complete control over your information whenever you need it.  "
        },
        {
            "text": "There are many benefits of the account, including: "
        },
        {
            "heading": 3,
            "text": "How accounts work "
        },
        {
            "text": "Anyone can create an IPO account, whether you’re a lone inventor or working for a big patent attorney firm. Each individual will have their own account and login details, but your account can be linked to an organisation.  "
        },
        {
            "text": "Each organisation will have one or more account administrators. Those administrators will be able to invite people to link their account to the organisation. Once an account is linked to an organisation, they can view and manage any patents that the organisation owns or represents. "
        },
        {
            "heading": 3,
            "text": "Logging in   "
        },
        {
            "text": "Once your account is set up, you’ll be able to login using your account email, password and multi-factor authentication (MFA). MFA means that when you login you’ll be asked for a code we send to you. We will send a code via SMS or to an authenticator app of your choice. "
        },
        {
            "heading": 3,
            "text": "Managing access   "
        },
        {
            "text": "There are two types of user account that an organisation can have – Standard and Administrator.   "
        },
        {
            "text": "Standard users can do anything an Administrator can do, except for adding/ removing users and access groups. This means that everyone in the organisation has access to view and edit patents by default.  "
        },
        {
            "text": "However, Administrators can set up access groups, which could be for specific teams, clients or office locations. This means they can restrict access to certain patents that are added to the group and choose who can access the group. This will mean that people in the group will only have access to patents selected by their administrator.  "
        },
        {
            "text": "There’s currently no ‘view only’ option in the account, but it’s something we could look into as we make future improvements. "
        },
        {
            "heading": 3,
            "text": "Correspondence and notifications  "
        },
        {
            "text": "Whenever you apply for or make changes to patents, you’ll get an email confirmation. If your account is linked to an organisation, an email will also be sent to a central email address which is set by your account administrator. You can only assign one central email address for your organisation.  "
        },
        {
            "text": "When there’s an important update on your patent, like your examination report is ready or your patent is due for renewal, we’ll send an email to both the individual who filed the patent and the central email address for your organisation. If you have documents to view in your account, like filing receipts or examination reports, we’ll provide a link to them in the email. You’ll have to be logged in to your account to view and download the correspondence. This is to increase security and prevent sensitive documents being intercepted over email.  "
        }
    ]
}