{
    "url": "https://deframedia.blog.gov.uk/2022/07/26/100-million-for-frequently-flooded-communities/",
    "title": "£100 million for frequently flooded communities",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-07-26T16:10:14+01:00",
    "content": [
        {
            "text": "There has been positive coverage today of our announcement that communities suffering repeated flooding will benefit from a new ring-fenced £100 million allowance designed to better protect their properties."
        },
        {
            "text": "Publications including The Daily Express, Shropshire Star, Coventry Telegraph, Manchester Evening News, My London, Business Green and Agriland carry news of the allowance, which will improve access to public funding for repeatedly flooded communities, which are often smaller areas requiring more complex flood schemes."
        },
        {
            "text": "The funding will be targeted at eligible communities where 10 or more properties have flooded twice or more in the last 10 years, helping to both accelerate existing projects and deliver new ones. It is anticipated around 80 schemes will receive support over the next four years."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "Sir James Bevan, Chief Executive of the Environment Agency, said:"
        },
        {
            "text": "Communities will be selected through the Environment Agency’s annual refresh of the £5.2 billion capital programme – which sets out the latest information on each project in the programme and the amount of grant-in-aid allocated to that project in that year."
        },
        {
            "text": "The latest investment builds on the Environment Agency’s successful delivery of the government’s previous £2.6 billion investment between 2015 and 2021, better protecting more than 314,000 homes, exceeding its original target."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}