{
    "url": "https://deframedia.blog.gov.uk/2022/07/26/environment-agency-issues-warning-on-salmon-stocks/",
    "title": "Environment Agency issues warning on salmon stocks",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "marine",
        "Weekly stories"
    ],
    "pub_date": "2022-07-26T15:06:23+01:00",
    "content": [
        {
            "text": "Yesterday (25 July 2022), the Environment Agency published the latest annual salmon stock assessment, warning that action is needed if stocks are to stabilise and recover."
        },
        {
            "text": "The latest stock assessment report from the Centre for Environment, Fisheries and Aquaculture Science, the Environment Agency and Natural Resources Wales received widespread national media coverage in titles such as the Guardian, Daily Telegraph, Independent, the Sun, the Times and iNews."
        },
        {
            "text": "The announcement received coverage across regional outlets including the Shropshire Star, Morning Advertiser and Kent Online. Trade and specialist titles such as Perspective magazine and Food Ingredients First also covered the report."
        },
        {
            "text": "In 2020, 20 salmon rivers (48%) were thought to be ‘at risk’, meaning salmon stock are no longer at sustainable levels. In the latest report, this has now risen to 31 rivers (74%), with rivers in the South West, North West and Wales considered to be the most affected."
        },
        {
            "text": "Commenting on the report, Kevin Austin, Deputy Director for Agriculture, Fisheries and the Natural Environment for the Environment Agency, said:"
        },
        {
            "text": "Many factors are impacting on salmon numbers at freshwater and marine sites. In particular, climate change leading to rising sea and river temperatures and overfishing are impacting on salmon stocks globally."
        },
        {
            "text": "The Environment Agency, Defra and key partner organisations continue to deliver on the Salmon Five Point Approach and North Atlantic Salmon Conservation Organization implementation plan to co-ordinate effort and drive forward actions that will benefit all aspects of the salmon life cycle. The priorities of the Salmon Five Point Approach are:"
        },
        {
            "text": "The Salmon Five Point Approach has been jointly developed and committed to by a wide range of partners including the UK Government, Atlantic Salmon Trust, Angling Trust, River Trusts, Wild Trout Trust and the Institute of Fisheries Management."
        }
    ]
}