{
    "url": "https://hmlandregistry.blog.gov.uk/2022/07/26/handy-new-checklist-for-lease-extensions-surrender-and-regrants/",
    "title": "Handy new checklist for lease extensions (surrender and regrants)",
    "authors": [
        "Richard Connolly, Process Lead"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-07-26T12:16:42+01:00",
    "content": [
        {
            "text": "HM Land Registry has published a handy new checklist for use when handling lease extension applications that take effect as surrender and regrants."
        },
        {
            "text": "It comes as part of a wide-ranging and determined effort to drive down the number of requests for information (requisitions) we have to send, which cause delays in the registration process and mean extra work for conveyancers."
        },
        {
            "text": "During the course of a lease there can be times when the landlord and tenant want to change one or more aspects of what was originally agreed. Where such variations mean the existing lease cannot simply be extended by deed – for example, land is added or removed, or the term extended or reduced – that lease is deemed to have been surrendered and a completely new one created. This is a surrender and regrant application and follows the usual requirements for registering a dispositionary first lease."
        },
        {
            "text": "We received 35,000 surrender and regrant applications in 2021/22 – an average of 138 a day – and around 70% of these required at least one requisition."
        },
        {
            "text": "We recognise this can be a complex and often misunderstood area of land registration, so we’ve created the checklist to help – you’ll find it attached to Practice Guide 28 as a supplement. The checklist pulls together the key elements to consider into a single at-a-glance reference with helpful links to further information across our practice guides."
        },
        {
            "heading": 2,
            "text": "Four key areas"
        },
        {
            "text": "The checklist focuses on the four key areas that give rise to the most requisitions:"
        },
        {
            "text": "Applications are often lodged incorrectly as an update to an existing register. As they are surrender and regrants, in each case we create a new register, which means applications must be submitted as a dispositionary first lease by choosing ‘Lease Extension’ in the portal. (If you are using third-party software (Business Gateway) and unsure how to do this please contact your software supplier.)"
        },
        {
            "text": "As well as this, common issues that lead us to raise requisitions include, but are not limited to:"
        },
        {
            "text": "We anticipate that, in most cases, a simple checklist will help eliminate many such errors and omissions, speeding up the registration process to provide a more efficient, consistent and accurate service for all of our customers. We believe doing what we can to improve the quality of applications will help us achieve these aims while better protecting the integrity of the register."
        }
    ]
}