{
    "url": "https://ruralpayments.blog.gov.uk/2022/07/26/the-rural-payments-agency-podcast-episode-3-transcript/",
    "title": "The Rural Payments Agency Podcast: Episode 3 Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "RPA podcast",
        "Rural Payments service",
        "Social Media"
    ],
    "pub_date": "2022-07-26T11:53:58+01:00",
    "content": [
        {
            "text": "Executive Summary"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "****Intro music to fade****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Hello and welcome to the third episode of The Rural Payments Agency podcast. Today, we’ll be understanding why it’s crucial to keep your personal information up to date in the Rural Payments Service and hear some great tips on how to update your details. We’ll also take a look at the importance of ‘setting permissions’ in the Rural Payments Service, and what this means for your business. We’re in the peak season for agricultural shows, so we’ll be talking shows and events, and later in the episode we’ll provide a roundup of the very latest information and updates, and answer some of your questions."
        },
        {
            "text": "But first today, getting information out to farmers, land managers and agents is critical throughout the year. The Rural Payments Agency uses the data held in the Rural Payments Service to send out prompts, reminders, and other helpful material, so it’s vital that farming businesses keep their details up to date. I’m now joined by Daneka Rodgers, Senior Business Analyst at the RPA, to explore this further and understand why this is so important – both for the RPA and farmers, land managers and agents across the country. Daneka, welcome to The RPA Podcast."
        },
        {
            "text": "Daneka: Thanks James, it’s great to be here."
        },
        {
            "text": "James: Daneka, you were involved in the recent RPA campaign to encourage farmers and land managers to check their personal details. And the timing of this was particularly important following the BPS advanced payments announcement in May."
        },
        {
            "text": "Daneka: It was, we recently contacted around 86,000 farmers and agents but a number of the emails that we sent were never actually received because the email addresses held by us were incorrect. In some cases, businesses hadn’t entered an email address at all which means that we need to send them a paper copy, which then obviously takes more time. The advance in BPS payments was a prompt, but it’s vital we hold the correct personal and payment information for farmers and land managers all year round."
        },
        {
            "text": " "
        },
        {
            "text": "James: And many may have someone acting on their behalf, so permissions are also a big consideration?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: Permissions are really important James, they allow a person to act on behalf of your business – if you decide that works best for you – and that gives you time to focus on the important work of farming. This can include submitting claims and applications on your behalf or amending your details to save you time."
        },
        {
            "text": " "
        },
        {
            "text": "James: And I’m sure that’s a popular option as we know there are lots of factors impacting on how people are running their businesses."
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: It is, and we want to make sure we are able to give farmers our full support by making the process of submitting applications and claims, and sending and receiving correspondence, as easy as possible."
        },
        {
            "text": " "
        },
        {
            "text": "James: I know you and the Customer Engagement team issued a blog on this in June but it’s a really important subject, so can we take a few minutes to talk through how our listeners can ensure their permission levels, and personal and business details are up to date?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: Of course. This is really important and the key message I’d like to highlight is a simple one really; taking a few minutes to check your details and get everything in place now will save time in the long run especially down the line when you need to contact us. It’s really important to sign into the Rural Payments service regularly, as we use ‘pop up’ alerts to share important information with you, such as any upcoming downtime to help us improve the service, as well as application and claim reminders."
        },
        {
            "text": " "
        },
        {
            "text": "James: So, starting with permissions…I’m sure this will be of interest to many farmers who haven’t had the opportunity to explore this before, so can you talk us through the process please Daneka?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: Sure, the Rural Payments service allows you to add people to your business. Once a person has been added to your business, you can allocate them ‘permissions’, which will allow them to take certain actions on behalf of you and your business. Using permissions can give you greater flexibility which you may find helpful especially at busy times."
        },
        {
            "text": " "
        },
        {
            "text": "James: And why are these permissions so important?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: Well, each permission level affects what you, and the people associated with your business, can do. So it’s important to check you have the right permissions set up in your account, because this can affect who can apply for payments, submit applications and make claims on behalf of you and your business. You can check and confirm permissions by going to the ‘Business overview’ section in the Rural Payments service and clicking on ‘Give access to this business’."
        },
        {
            "text": " "
        },
        {
            "text": "James: So, Business Permissions allow a person to act on behalf of your business, and the higher the permission allocated, the more actions they can take on your behalf?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: That’s right. For example, providing a person with ‘Make Legal Changes’ permissions will allow them to change business contact details, confirm business details, and also make bank account detail changes. A person with ‘Full’ Business Permissions can act on behalf of a business in its entirety, including adding and removing people from that business, allocating their permissions. I’d encourage all your listeners to look at the information available in the Rural Payments service, where you can find full details about what each Business Permission will allow a person to do before they allocate them."
        },
        {
            "text": " "
        },
        {
            "text": "James: Thanks Daneka, and are there any other permissions we need to be aware of?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: There are; other permissions are split up into the relevant schemes such as BPS – the Basic Payment Scheme -  or CS - Countryside Stewardship. Underneath each permission level in the Rural Payments service, there are details of what a person with that authority can do. It’s important to allocate the relevant level of permission to the people within your business to ensure that each person has access to the relevant screens and information within the service."
        },
        {
            "text": " "
        },
        {
            "text": "James: And does this apply across all schemes?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: Well, there aren’t any specific Environmental Stewardship – so ES - scheme permissions in the Rural Payments service. Instead, we use the ‘business level permissions’ to determine if someone has been permitted to talk to us on behalf of a business about Environmental Stewardship. So, if you want to allow someone to talk to us on your behalf about this scheme, you need to link them to your business and set them with ‘Make Legal Changes’ or ‘Full’ business permissions. Alternatively, if that’s not an option for you, you can send us a completed ‘es21: Agent authorisation form’, which can be found on gov.uk, to inform us who will be managing Environmental Stewardship agreements and claims for that business."
        },
        {
            "text": " "
        },
        {
            "text": "James: Thanks Daneka, that’s been really helpful. I’d now like to move onto updating of personal details. Why is this such a focus for the RPA?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: I can’t stress enough how important it is to make sure that your personal and business contact details are up to date in the Rural Payment Service. This is so the RPA can reach you with any important information and updates; and confirming that we have all the right information for you will help us contact you quickly when we need to send you important information."
        },
        {
            "text": " "
        },
        {
            "text": "James: So what are the key pieces of information and how can our listeners access their details to see if the data is correct?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: Well, we’re asking everyone to check that three pieces of information in particular are correct for their business and for themselves. These are postal address, email address and a telephone number. You can check the personal information we hold for you in the Rural Payments Service by clicking on ‘view and amend personal details’ when you log in. And you can check the business details we hold by logging into the service, selecting your business and clicking on ‘View and amend business details’."
        },
        {
            "text": " "
        },
        {
            "text": "James: Great, that all sounds quite straightforward Daneka and are there any other details we need to be aware of?"
        },
        {
            "text": " "
        },
        {
            "text": "Daneka: I think we’ve covered the key points, but I would just add that if you need to send us an email, please remember to put the relevant title in the subject header of that e-mail, and this will potentially speed up the process and help us make sure your email reaches the right department quickly. Also, if possible, please reply to the original request from us when emailing documents, but if you can’t respond to the original request, please make sure you include the name of the scheme and what the email is about in the subject line…oh, and please also put your name and your Single Business Identifier – your SBI - in the body of the email."
        },
        {
            "text": " "
        },
        {
            "text": "James: Great, thanks for joining us today Daneka – that really has been super helpful. Next we’ll be talking shows and events with friend of the podcast, Katie Yon."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: In episode one of The RPA Podcast, Katie Yon, Senior Stakeholder Manager & Shows and Events Lead at the RPA, talked us through what we could expect to see delivered during 2022. And I’m pleased to say Katie joins us again today to discuss how the RPA’s shows and events schedule is adding real value to those who use the RPA’s services, as well adding significant benefit to RPA colleagues who attend the shows. Katie, it’s great to welcome you back to the podcast."
        },
        {
            "text": "Katie: Hi James, thank you for having me back."
        },
        {
            "text": "James: So Katie, before we talk about the shows, can you tell us a little about your role?"
        },
        {
            "text": "Katie: Yes of course. So I’m a stakeholder relations specialist, with about six years-experience now working within stakeholder management. And as you’ve said, my role is Senior Stakeholder Manager & Shows and Events Lead, and the two roles tie in very nicely. It’s all about engaging from the business out into the industry and also listening to what’s being said to us."
        },
        {
            "text": "James: And you mentioned shows are a big part of this, so how many shows and events do the RPA attend each year?"
        },
        {
            "text": "Katie: Wow, well we seem to be attending more shows each year which is fantastic. We’re being asked to attend more, we’re being recommended to attend more. So, our programme for this year is 36 shows and that’s not including the presentations that we might offer to our industry partners."
        },
        {
            "text": "James: And why is attending shows such an important part of the RPA’s programme?"
        },
        {
            "text": "Katie: I really feel passionately about how important it is. For the vast majority of our partners, visiting the RPA stand at one of our events is the only face to face contact they might have with us. Attending these events provides us with the insight into how our customers and stakeholders feel about our future and existing schemes. Which given where we are at the moment in the farming landscape that is incredibly important. We gain insight into how our customer engagement strategies are landing with the industry. It provides the opportunity to promote existing and future schemes to customers. We provide a high quality, joined up customer service across all our schemes. I think that’s really important for me and my team to make sure that we’ve got a wide breadth of knowledge and we can answer as many customer queries as we possibly can. We’re continually refreshing our approach with farmers and land managers as we use the insight gained to influence delivery and inform the development of future schemes. We also have a lot of Ministers and MPs visit the RPA stand when attending events. They see our first-hand engagement efforts and that group is one that’s keen for us to go to a number of other shows as well. I think meeting customers at events provides us with a really unique way of gathering feedback which does influence the way we write guidance and design our processes."
        },
        {
            "text": "James: RPA and Defra often attend the shows together, so this adds I guess, further benefits for attendees, but there’s also a benefit for colleagues across RPA attending as well."
        },
        {
            "text": "Katie: Yes, of course. So RPA and Defra Future Farming colleagues have been successfully co-locating at shows for about the last eighteen months now. We often have Forestry Commission and Catchment Sensitive Farming colleagues join us too. This really gives a joined-up approach, and it offers customers the opportunity to talk through a range of issues to a number of delivery bodies in one place. If we’re talking about RPA staff and the benefits of that, we promote the programme that we deliver as part of our learning and development for colleagues. I just feel this is such an excellent opportunity, for all grades, to attend and come and be supported by members of my shows and events team, which gives staff the chance to have the face-to-face interaction and hear from the industry. And again, that’s really important for our staff because it makes their day job really come to life and why we do what we do."
        },
        {
            "text": "James: When you’re about to attend a show and you’re planning a show, what are your main aims and objectives?"
        },
        {
            "text": "Katie: Meeting customers at events provides this unique feedback which influences why we do so many things – policy, guidance, internal processes. Having this early insight into how the industry is feeling allows us to feed that back into the agency and it’s given quite a high profile within RPA, on how our shows and events are going, and what kind of things are coming up with the industry and where we maybe need to do a little bit more."
        },
        {
            "text": "James: And you’ve touched on the insights you and the team receive when attending the shows but what information is available on the RPA stand and can visitors discuss any issues they might have with RPA colleagues at the show?"
        },
        {
            "text": "Katie: Yes, absolutely, and we will always do what we can to help and take away things we might not be able to answer on the day. So RPA is primarily there to field queries from farmers and agents across all current and future schemes – specifically the Sustainable Farming Incentive, Farming Investment Fund grants and CS. At the stand itself, we have a range of leaflets, lots of great literature on CS and the different elements of the scheme, woodland and also SFI. We also have the opportunity for customers to have a quick watch of the SFI ‘How to apply’ video. So, lots of good, interesting things on the stand as well. What I’ve found is most customer queries have focused on what the future holds, in terms of current an new schemes and what support was going to be available once BPS reduces. This is obviously a really wide-reaching feeling within the industry. Many of the farmers were interested in grant support and when future rounds would be open for applying. And this is all in a really tough time with people’s concerns being on rising costs and food production."
        },
        {
            "text": "James: It sounds like you’ve got a wealth of information of the stand and of course you’re right in the middle of the peak show season, so how many have you attended so far this year?"
        },
        {
            "text": "Katie: We absolutely are in the peak season. The shows are thick and fast at the moment. It’s been a busy but great programme. We have attended 22 shows so far this year, spanning the country, from the Devon County Show right up to the Northumberland Show. Last week we were at the Great Yorkshire show which had an incredible turnout and just a really great event."
        },
        {
            "text": "James: You mentioned earlier as well that if you’re lucky, you may even bump into a Minister or even the Secretary of State on the RPA stand…"
        },
        {
            "text": "Katie: Yes, that’s right. We have had the Secretary of State come and visit our stand quite a lot recently, and it’s excellent."
        },
        {
            "text": "James: It certainly raises the profile of all the issues that RPA are looking to communicate with their stakeholders. And where can our listeners find you in the weeks and months ahead?"
        },
        {
            "text": "Katie: So, in terms of what’s next for over the summer, we have the New Forest Show in Berkshire, and that’s on the 26th, 27th and 28th July, and we will be there for all three days. Then we have the National Sheep Association in Worcestershire on 27th July. We then kind of tail off a little bit for August – August is an incredibly busy month in the farming community, so we take that time to reorganise and reset, and then we gear up again for September. For anyone that is listening and that has Twitter, if you can follow the RPA, you’ll see updates from me on where we’re going to be and, also nearer to the event, I’ll pop stand information number and things, so it’s always easy for our customers to find us."
        },
        {
            "text": "James: And finally Katie, looking beyond this year, what are your plans, what are your hopes for 2023?"
        },
        {
            "text": "Katie: I think James, in 2023, we’re going to be looking to expand our programme even further. We’ve mentioned before lots of requests are coming into us, and our attendance at these events is proving quite valuable. So next year we are hoping to also be part of the Royal Cheshire County Show and the Organic Food and Farming Conference, just to name a few."
        },
        {
            "text": "James: Great, thanks again Katie, that’s been really helpful today, and I’m always amazed at just how many shows and events are in the RPA’s calendar. And I’m sure our listeners will be looking out for you and the team at the RPA stand at shows during the rest of the year."
        },
        {
            "text": "Katie: Thank you James and yes, we would love to see people coming by to our stand and having a good chat with us."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: In recent weeks we’ve received a number of questions from farmers and land managers on a wide range of subjects and we wanted to touch on some of the more frequently asked questions today. So, I’m pleased to welcome back Sandy Kapila, the RPA’s Customer Director, to The RPA Podcast, to discuss the very latest updates. Sandy, thanks for joining us."
        },
        {
            "text": "Sandy: Thanks James."
        },
        {
            "text": "James: Sandy, you won’t be surprised to hear that the Sustainable Farming Incentive scheme is front of mind for many farmers, so what’s the latest?"
        },
        {
            "text": "Sandy: So James, just before we get down to an update, I thought it would be useful just to give you and people listening a bit of an insight or context setting around what SFI is. So, at its core, SFI’s around incentivising and rewarding sustainable actions that support food production and enhance environmental outcomes. And I think it’s important to remember that SFI is part of a wider environmental land management approach, which was a key aspect of the agricultural transition, which also includes Landscape Recovery and Local Nature Recovery. The full set of standards we’re expecting to be ready by 2025, and that is essentially focusing on improving water quality, biodiversity, climate change mitigation and animal health and welfare. But like anything we’ve talked about, the incremental nature of the agricultural transition period, we’ve started simply, focusing on actions and standards to essentially improve soil health, to recognise the importance of moorland and to improve animal health and welfare. The standards have been designed working with farmers, and I think that’s really important for people to understand, and actually as I said, we’ll introduce new ones over the next few years. We get a lot of questions around eligibility, so who is eligible to apply for SFI. So initially it’s open to farmers claiming BPS, and I think that’s an important aspect of the consideration. I know a lot of farmers that undertake a lot of the actions that sit within the standards but actually can’t be bothered with the paperwork. And actually what I’m hoping we will see, as and when we deliver SFI, and SFI matures as a scheme, that they’ll look to embrace the scheme and be rewarded for the things in most cases they are doing already. So, it is open to everyone, those that are in existing environmental schemes – at the moment that’s predominantly Countryside Stewardship and Environmental Stewardship – can apply but they’ll need to call the RPA and actually we will support them through the application process. I think that’s really, really important for people to understand. I think that one of the things that also comes across in terms of questions is ‘can I apply for SFI if I’m in CS or I’m in ES?’. And actually, an element of that is around yes you can, but actually we won’t be able to be providing funding for the same actions. So actually if you’re doing something in one scheme, we’re not going to be able to reward you for doing the same actions in another scheme. So actually you can complement the two schemes but essentially they have to be delivering different actions. One of the things that we’ve often heard as well from farmers is the inflexibility around the application windows, so it’s really good to see that for SFI, there are no application windows. Farmers can apply when it suits them best, and actually that’s really helpful in the way that it adds a degree of flexibility. And obviously we’ll issue quarterly payments once the agreements have started. We’ve opened up a new service to apply, and actually what’s really interesting about the approach that we’ve taken, it includes some automated checks, and actually these checks are making it simpler and more straightforward. We’ve been working with farmers to learn from their experience of using the service and actually we’ve been able to introduce some measures that have improved that experience. So actually everything is working quite nicely, everything that farmers need to know about the scheme and application process is available on rpa.gov.uk, and I’d encourage farmers to get involved."
        },
        {
            "text": "James: SFI applications opened on 30th June, so are you pleased with the initial response?"
        },
        {
            "text": "Sandy: So I think the initial feedback from farmers has been really good. But you know, as with any rollout, there will always be learning for us to consider. Farmers are applying and that’s really great to see. They are telling us that the process has been easy to follow. The upfront checks have made things simpler for us, and what we’ve been able to do is process applications quicker. Our aim is to get agreement offers out within two months, but in truth, some of the applications are being processed a lot quicker than that. Which I think is really helpful, and if you compare that to the existing schemes we currently have which can take up to four-to-five months plus, I think getting things out quicker is a really great improvement that we’ve made. And actually, as I’ve said before, the link between the start of the agreement offer, and the payment is really, really important. So, payments will be flowing on a quarterly basis, as soon as the agreement has started. But we know this is a really busy time for farmers and actually again, the advantage of having a rolling window means that farmers can apply when they’re ready to apply, which I think is really, really helpful."
        },
        {
            "text": "James: Yes, and you touched on something earlier I just want to focus on, and that’s some in the farming community have raised concerns about compliance, enforcement and regulation, particularly of SFI, but I understand there will be greater flexibility when it comes to visits and monitoring?"
        },
        {
            "text": "Sandy: Yes, so this is a new approach for us. When I speak to farmers, I talk a lot about the link between the policy prescriptions and our ability to apply flex. So in the SFI standards we’ve described some minimum actions which will help to deliver the aims of the standards but actually we’re really focused on trusting farmers to do the how, and actually working with them in terms of the outcomes we want to achieve. As I’ve said before, many of the actions that sit within the standards farmers do already. One of the key things in there will be a move away from applying penalties. Where we find something that isn’t in accordance with the agreement, we’ll work with the farmer to figure out how we can remedy the situation collectively. But I think there’s an important thing to make clear here; we have a number of considerations that we need to balance in the delivery of our schemes. Obviously a desire to work with farmers to deliver environmental outcomes is high on our agenda, but we also have an obligation to protect taxpayers’ money to ensure that it is prudently spent. But like out approach to our new service, there will be learning that we will need to consider as and when we rollout our particular visits."
        },
        {
            "text": "James: And when will our listeners hear more about this in the coming weeks?"
        },
        {
            "text": "Sandy: So, we are looking to provide some more information. We’re going to do a blog on it, we’re going to do some case studies on farmers that have had existing visits and how it felt for them. And actually I’m going to go out on a few visits myself and just speak to farmers and get first-hand how they felt their experiences were. And I’ll give you a good example; so I was in Hastings a couple of weeks ago, speaking to a room of farmers. One farmer, at the end, came up to me and said how grateful he was around the support that he received from one of our field officers at a recent visit. So, it’s beginning to land, it’s beginning to have the outcomes that we wanted. So actually I think a positive step."
        },
        {
            "text": "James: Great, and I understand RPA will be publishing a blog on this towards the end of July with further information as well. Moving onto the Basic Payment Scheme Sandy…The BPS advance payments announcement in May was welcomed by all parties, particularly at a time when we’ve got rising prices and cash flow challenges, and I understand payments have already started to flow through the system?"
        },
        {
            "text": "Sandy: Yes, as you’ve mentioned, I think the announcement was well-received by farmers across the country. I think the RPA in particular knows the importance of cash flow to rural businesses. And certainly we understand the impact that these BPS advances will make given the challenging times that we’re facing. We announced on 19th July that payments had begun to be issued. I expect the majority of farmers to receive their payment by the end of July. There will be a small number of claims that will require additional processing, and what we’ll do is we’ll be in touch with farmers who are affected but we’ll continue to release BPS advances across August, once this further work has been completed. Payments will broadly be around 50% of the value of the claim, but there will be some variances as there always are. What we’ll do is when we issue the balance payments from December, we’ll make the appropriate adjustments. Importantly, for both advances and balance payments, farmers will get a remittance advice and that’s something that they’re used to getting before, and actually claim statements will be issued after the balance payments have been made from December. I think, every year we sit on payments that we’ve issued, and actually this is a call for action for those people that haven’t provided us with their updated contact details. It’s always interesting to see money sitting with the RPA when it should be in farmers’ banks accounts because they haven’t provided us with their up-to-date banking details. More details about how farmers can update their details with us can be found on rpa.gov.uk."
        },
        {
            "text": "James: Yes, and as Daneka mentioned earlier, this is a critical time for updating personal details. We’ve also received a number of queries around the Lump Sum Exit Scheme and, in particular, around the giving up of land. So please can you clarify the process for our listeners Sandy?"
        },
        {
            "text": "Sandy: Yes, I was really pleased to speak to farmers who told me they were interested in the scheme, and, as farmers may be aware, the application process for the lump sum closes at the end of September. But there are a number of actions that farmers will need to undertake around their land.  You can sell it, you can rent it out for a minimum of five years, you can surrender your tenancy, or you can plant trees under a woodland creation scheme. A lot of those actions need to be completed by 31 May 2024, but also farmers can retain up to five hectares of their land and still receive their lump sum payment. Most of the information around some of the schemes are available on rpa.gov.uk. But I think this is an important consideration for farmers as and when they think about their future business and how they want to progress and how they want to bring others on into the industry."
        },
        {
            "text": "James: We’ve talked about on-going payments in the form of SFI and BPS, and I also wanted to touch on one-off payments and a couple of the recently announced grants; so first of all, the Slurry Infrastructure grant…further details were announced in June…"
        },
        {
            "text": "Sandy: So, the first round of the new Slurry Infrastructure grants, which are worth around £13 million, will open up later this autumn. The key focus of them is to help livestock farmers in England to upgrade their slurry storage and nutrient management systems and essentially, in so doing, help reduce water and air pollution from slurry. More information again is available on the gov.uk pages, and I think farmers will need to search for “Slurry Infrastructure grant”. I think the important thing with all of these schemes as and when we move across the agricultural transition period, that they have been co-designed with farmers, and actually I think that’s really, really important. But actually not just farmers but industry and environmental experts. The application process is again similar to what farmers are used to applying for. So, it’s a two-stage process, starting with an online eligibility checker, which will open in the autumn, followed by a full application process over the winter. So there will be multiple opportunities to apply for a grant. So if you’re not successful in the first round, there will be other rounds over the next couple of years or so. And actually we’ll produce, publish more detail on the grant over the summer ahead of applications opening in the autumn."
        },
        {
            "text": "James: Great, that’s good to hear, and the other grant announced in early June was an element of the Farming Investment Fund, and this is all about adding value…"
        },
        {
            "text": "Sandy: Yes, so Secretary of State announced a new £30 million fund in June. It applies to England only but offers grants focused on supporting farmers and growers to process, diversify and add value to their eligible agricultural products after they are harvested or reared. Importantly it offers grants of between £25,000 and £300,000 for up to 40% of eligible project costs. So essentially what that means is farmers can buy new premises or equipment for the preparation or processing of agricultural produce. Turning milk into cheese or yoghurt for instance, processing meat into sausages, and potatoes into crisps or chips; or equipment such as vending machines and display facilities for selling food directly to customers. Although the online checker closed on 21 July, there will be a scoring mechanism and actually if your score is high enough, you’ll be invited to submit a full application, which will need to be sent with supporting documents into the Agency by email. Successful projects will be provided with details about how to do this when the scheme opens for applications later in the year, and you’ll have until 31 January 2024 to submit the full application. If you need planning permission, then this must be approved and submitted with your full application. And I know there are instances of where that is a really difficultly at the moment with local authorities, so actually what I would urge farmers to do is get in touch with us if they have planning permission consideration challenges and we can discuss with them about the things that we can do."
        },
        {
            "text": " "
        },
        {
            "text": "James: Thanks Sandy, that’s good advice, and  finally, some of our listeners may be interested to know the RPA’s Annual Report and accounts were published earlier this month, so where can they find out more?"
        },
        {
            "text": "Sandy: So, I think the Annual Report and Accounts is always an interesting product. I used to coordinate its publication a number of years ago and actually what we’re finding now is actually it’s a better read, it’s more engaging and I think that’s really, really important. And actually, it reflects what we’ve been able to undertake over the last year or so, in a way that actually is more engaging than we’ve been able to do in the past. It has been a challenging year for many people and actually as and when we come out of the pandemic and move into an element of normality, I think it’s been good to be able to reflect on the progress that the Agency has made, and our focus on delivering for agricultural and rural communities to create a better place to live. So, the Annual Report and Accounts is available on gov.uk, it highlights some of our ambitions that were published in our five-year strategy in February 2021. In particular focusing on the things that we are doing to listen, learn and do better. Focusing on how we want to build partnerships with farmers, how we’re working closely with industry stakeholder groups and associations, how we’re focusing on improving the services that we currently provide. So it’s a good read, but I would say that, I’ve read it, but you can read it by finding it on gov.uk."
        },
        {
            "text": "James: Fantastic Sandy. As always, it’s been great talking to you, and we’ll look forward to catching up again with you soon on The RPA Podcast."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "So, that’s all we’ve got time for today. Thank you to Daneka, Katie and Sandy, and thank you once again for listening. We’ve covered a range of your questions today but we’re always happy to receive more, so if you’d like us to cover a particular topic or issue with our subject experts, please get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on Twitter - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the fourth RPA Podcast as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": " "
        },
        {
            "text": "****Close music to fade****"
        }
    ]
}