{
    "url": "https://educationhub.blog.gov.uk/2022/07/were-backing-adults-across-the-country-to-boost-their-skills/",
    "title": "We’re backing adults across the country to boost their skills",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Skills"
    ],
    "pub_date": "2022-07-26T10:04:01+01:00",
    "content": [
        {
            "text": "Making sure more adults can gain the skills they need to secure good jobs with higher wages is a key priority for the government. Levelling up skills supports our economy to grow, as well as benefiting both workers and employers."
        },
        {
            "text": "That’s why we introduced our Free Courses for Jobs offer in April 2021. The scheme is proving popular, with data pointing to over 20,000 people having enrolled on courses by May this year, taking advantage of the opportunity to get in-demand skills for free."
        },
        {
            "text": "Moreover, nine in ten people surveyed say they believe it will help them progress in their careers, while the vast majority (97%) say they are enjoying their course."
        },
        {
            "heading": 3,
            "text": "What are the Free Courses for Jobs?"
        },
        {
            "text": "Free Courses for Jobs offers adults aged 19 or over access to over 400 qualifications free of charge. It’s aimed at people without a full qualification at Level 3, such as A Levels, diplomas or an advanced technical certificate, or those who are unemployed or earning low wages."
        },
        {
            "text": "Courses are available in subjects ranging from engineering and construction to adult care and digital, allowing adults to access better job opportunities and boost their earning potential."
        },
        {
            "text": "The scheme also benefits employers, who can support their existing staff to upskill or reskill into a higher-level role in their business without needing to fund the training."
        },
        {
            "text": "Research shows that Free Courses for Jobs has increased uptake of these key qualifications, meaning more adults are making the most of this opportunity to boost their skills free of charge."
        },
        {
            "heading": 3,
            "text": "Why should I do a course?"
        },
        {
            "text": "The courses are completely free and have the potential to boost your career opportunities as well as your salary."
        },
        {
            "text": "Matthew Huggins took a free Computer Science course through the Free Course for Jobs scheme at Vision West Nottinghamshire College in Mansfield."
        },
        {
            "text": "Matthew had been in and out of retail work for years. He was furloughed in 2020 and applied for over 70 jobs without any luck, eventually finding part-time employment through an agency."
        },
        {
            "text": "Matthew decided that something needed to change and signed up for the course. He hadn’t been in any sort of education for 16 years but found the experience extremely enjoyable and rewarding."
        },
        {
            "text": "Matthew also gained invaluable digital skills, building a website from scratch and managing a sales campaign for T-shirts through social media platforms like Facebook, LinkedIn and Instagram."
        },
        {
            "text": "Matthew earned a distinction on the course and came away with a certificate whilst still being able to work and earn money on the side. He has since secured job interviews at BBC Radio Nottinghamshire, Talk Radio and Nottinghamshire Police."
        },
        {
            "text": "Matthew said:"
        },
        {
            "heading": 3,
            "text": "How do I apply for a course? "
        },
        {
            "text": "If you are 19 or over and do not already have a level 3 qualification or higher, you can access a free level 3 qualification through Free Courses for Jobs. That’s equivalent to A Levels, a diploma or an advanced technical certificate."
        },
        {
            "text": "If you already have a level 3 qualification or higher, but you earn below the National Living Wage annually (£18,525 from April 2022) or are unemployed, you can also access these qualifications for free. This is regardless of any qualifications you already have."
        },
        {
            "text": "In some areas there may be a slightly different low wage threshold. Check with your local training provider to find out the low wage threshold in your area."
        },
        {
            "text": "Some of these qualifications are available to study online or part-time."
        },
        {
            "text": "You may be able to get help to pay for childcare, travel and other costs."
        }
    ]
}