{
    "url": "https://deframedia.blog.gov.uk/2024/12/17/coverage-following-announcement-that-water-companies-must-double-compensation-for-service-failures/",
    "title": "Coverage following announcement that water companies must double compensation for service failures",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-12-17T12:46:05+00:00",
    "content": [
        {
            "text": "There has been widespread coverage of the Government announcement that water companies will be forced to double the compensation paid to customers for service failures."
        },
        {
            "text": "The Guaranteed Standards Scheme (GSS) will see new, improved, and compulsory payments in the event of issues like water supply outages, sewer flooding or low water pressure."
        },
        {
            "text": "Outlets including the FT, Sun, Express, Independent, Evening Standard and Mirror reported on the shake-up of the current rules, which were last updated almost a quarter of a century ago."
        },
        {
            "text": "Issues like low water pressure could see payments of up to £250, compared to just £25 currently available, and payments for internal flooding from sewers could rise to £2,000 or more, compared to the existing £1,000."
        },
        {
            "text": "The changes will also expand the eligibility to provide payment for a broader range of circumstances, including Boil Notices and when meters are not properly installed or regularly read."
        },
        {
            "text": "The changes apply to household and business customers and follows an eight-week public consultation with an average of 84% water customers agreeing with the proposals, and 70% of businesses. The increased compensation package will come into effect next year."
        },
        {
            "text": "Secretary of State for Environment, Food and Rural Affairs, Steve Reed, said:  "
        },
        {
            "text": "Mike Keil, Chief Executive of the Consumer Council for Water (CCW), commented: "
        }
    ]
}