{
    "url": "https://mhclgmedia.blog.gov.uk/2024/12/17/english-devolution-white-paper-launch/",
    "title": "English Devolution White Paper launch",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Devolution",
        "Local government"
    ],
    "pub_date": "2024-12-17T16:40:24+00:00",
    "content": [
        {
            "text": "Following the publication of the English Devolution White Paper there has been speculative media coverage that proposals around local government reorganisation including that this could potentially delay local elections in some areas with smaller district councils being replaced by larger authorities."
        },
        {
            "text": "In comments referenced in the coverage however, Minister of State for Local Government and English Devolution Jim McMahon explains that the changes will in fact rebuild “local community power”, and councils should focus on how to “give local people a voice”. He also explains that any delays to local elections will be temporary."
        },
        {
            "text": "In subsequent broadcast interviews Deputy Prime Minister Angela Rayner said:"
        },
        {
            "text": "“We are asking councils to come forward as quickly as possible, and if they're near enough to a deal and they say… we just need a few more months, and then we can put that system in place. If they came to us and said, that's where we're at, then we may look at… postponing, but it wouldn't be for longer than a couple of months or a year. So, it's about making sure that actually local authorities are able to deliver for people in their local area.”"
        },
        {
            "text": "As set out in the White Paper, the government wants to see stronger community arrangements, with reorganisation of the way councils engage at a neighbourhood or area level. It also wants to rewire the relationship between town and parish councils and principal Local Authorities, strengthening expectations on engagement and community voice.    "
        },
        {
            "text": "There has been other widespread and extensive coverage across national and regional media of the publication of the English Devolution White Paper."
        },
        {
            "text": " The Mirror and The Independent both report that the proposed changes represent the “biggest shake-up” of local government in decades. The Yorkshire Post notes the Deputy Prime Minister’s commitment to make devolution the “default in our constitution” rather than something directed at the “whim” of Whitehall, and adds the proposed changes have broadly been welcomed by campaign groups."
        },
        {
            "text": "The Times, Telegraph and Mail report that the creation of new Mayors could lead to higher Council Tax, with Mayors able to add a mayoral precept on top of existing bills. However, there will be a cap on increases in the precepts, and in areas where a precept already exists, the additional charge faced by households has been modest – in the Liverpool City Region, it is just £19 of the £2,420 Band D bill. The changes will allow Mayors to invest the extra resources in meeting local priorities."
        }
    ]
}