{
    "url": "https://marinescience.blog.gov.uk/2024/12/17/shark-plan-conserving-sri-lankan-sharks-rays-and-chimaeras-through-the-ocean-country-partnership-programme/",
    "title": "Shark Plan: Conserving Sri Lankan sharks, rays and chimaeras through the Ocean Country Partnership Programme",
    "authors": [
        "Sophy McCully Phillips"
    ],
    "categories": [
        "biodiversity",
        "Fisheries",
        "International",
        "OCPP"
    ],
    "pub_date": "2024-12-17T11:47:58+00:00",
    "content": [
        {
            "text": "The Centre for Environment, Fisheries and Aquaculture Science (Cefas) collaboration with Sri Lanka on shark, ray and chimaera conservation through the Ocean Country Partnership Programme (OCPP) was furthered in mid-November with a UK visit from the Sri Lankan Director General and Director of Quality Control from the Department of Fisheries and Aquatic Resources (DFAR) and two Directors of Blue Resources Trust (BRT), a marine conservation non-profit organisation based in Sri Lanka. Through the OCPP, Cefas have been working with these organisations to safeguard shark and ray populations through in-country workshops and training of frontline fisheries staff in species identification and data collection (see previous blog here)."
        },
        {
            "text": "The focus of this visit was on the development of an updated National Plan of Action (NPOA) for Sharks and Rays as well as a knowledge exchange on current Shark and Ray management and data collection, involving colleagues from the Department for Environment, Food and Rural Affairs (Defra), the Marine Management Organisation (MMO), the Save Our Seas Foundation and the UK-based non-profit organisation The Shark Trust. This collaboration aligns with the key challenges within the OCPP of tackling marine biodiversity and sustainable seafood."
        },
        {
            "text": "National Plan of Action for Sharks[1]"
        },
        {
            "text": "In 1999 the United Nations Food and Agriculture Organisation (FAO) adopted an International Plan of Action for the Conservation and Management of Sharks (IPOA-Sharks). This called upon States with directed shark fisheries or those with regular shark bycatch to develop National Plans of Action (NPOA) “to ensure the conservation and management of sharks and their long-term sustainable use” (FAO, 1999). Plans should be reviewed and updated at least every four years, although globally adoption and compliance to this voluntary measure has been poor, with <12% of annual retained shark catch from countries with current (less than or equal to four years old) NPOAs (Gilman et al., 2024)."
        },
        {
            "text": "Sri Lanka is home to at least 105 species of sharks, rays and chimaeras and fisheries for these species are substantial, with national and international trade an important source of income. Accordingly, Sri Lanka’s compliance with IPOA-Sharks has been commendable with the first Sri Lankan NPOA adopted in 2013, followed by a revision in 2018 and a proposed revision to be published in 2025. This latest revision is being supported by the OCPP and was the focus of the visit kicking off with a knowledge sharing in London with the Defra Marine Species Conservation Team. The scale of the number of fishing vessels (>50,000), landing sites (>900) and sharks landed in Sri Lanka is a far cry from that of the UK and evidences the importance of a NPOA to conserve sustainable shark populations for the future.  The importance of international legislation and marrying that with national measures was discussed and will form an important pillar of the NPOA."
        },
        {
            "text": "A workshop held in Plymouth continued discussions on delivery against existing UK and Sri Lankan NPOAs, where objectives had been met, those falling short, challenges and identifying key areas for future development. The Sri Lankan colleagues presented results from their questionnaires which canvassed feedback from 89 stakeholders on the existing NPOA, their awareness, thoughts on issues to address and improvements for the revision. Encouragingly, 61% of the respondents believed that sharks require additional management measures than are currently in place, evidencing the willingness to engage in their protection for biodiversity maintenance, food security and future income."
        },
        {
            "text": "“Sharks and rays are the second most threatened vertebrate group on our planet due to population declines driven by overfishing. We face a similar situation in Sri Lanka, compounded by the desire for economic growth and the need for food security. We look forward to the revised NPOA implemented by the DFAR in Sri Lanka as it has the potential to establish a foundation with which to encourage a shift towards sustainable fisheries that would benefit future generations of fishers while protecting biodiversity” Daniel Fernando (co-founder and Director of BRT)."
        },
        {
            "text": "[1] The term “sharks” is taken to include all species of sharks, skates, rays and chimaeras (Class Chondrichthyes)."
        },
        {
            "text": "Data Collection"
        },
        {
            "text": "The importance of robust data collection and flows between departments and organisations working in fisheries in support of compliance with national and international obligations (such as the Convention on International Trade in Endangered Species of Wild Fauna and Flora: CITES) was central to discussions on the second day of the visit at Cefas, Lowestoft. Demonstrations of UK data flows from baseline fishers catch recording all the way through to stock assessments, negotiations and management measures were given and parallel discussions held regarding data flows in Sri Lanka. This was substantiated with a visit to Brixham fish market one evening where a Cefas onshore fisheries sampler gave a demonstration of how they collect data which feed into this system, by sub-sampling the landed catch to providing data on length, weight, sex and maturity of fish (including shark species)."
        },
        {
            "text": "The use of technology in supporting legal compliance and also as a tool in future research developments was a topic of mutual interest, with Vessel Monitoring Systems (VMS) used by both the UK and Sri Lanka to monitor fishing activity albeit at different resolutions. Demonstrations of Remote Electronic Monitoring (REM) to monitor catches were well received with an interest in the potential development of Artificial Intelligence in processing footage. A visit to the electronics lab at Cefas, Lowestoft cemented plans to deploy a deep-water camera system in the waters around Sri Lanka as part of OCPP, to assist in the identification of deep-water shark species inhabiting these waters – a key knowledge gap to fill as part of the NPOA development.   "
        },
        {
            "text": "Next steps"
        },
        {
            "text": "During the week-long visit some clear outcomes in terms of the next steps in NPOA development were agreed and Cefas will continue to work alongside DFAR and BRT on this in the coming year. More in-country visits are planned to continue the roll-out of training frontline fisheries staff (as described in this previous blog) in the identification of prohibited shark and ray species led by the global expert Dr. Rima Jabado as well as planned deployments of the deep-water camera. Both activities will directly align with supporting the Sri Lankan NPOA (both present and future) and in safeguarding sharks in this region."
        },
        {
            "text": "On the visit, Director General Mr Kahawatta and Director of Quality Control, Mrs Herath from the DFAR remarked, “Our visit to the UK was an invaluable experience, providing us with insights into advanced fisheries management practices including shark management and the importance of collaboration in marine resource conservation. We are grateful for the opportunity to exchange knowledge and for the support extended throughout this initiative.”"
        },
        {
            "text": "The Ocean Country Partnership Programme (OCPP) is a technical assistance and capacity building programme that provides tailored support to countries to manage the marine environment more sustainably, including by strengthening marine science expertise, developing science-based policy and management tools and creating educational resources for coastal communities. The OCPP delivers work under three thematic areas: biodiversity, marine pollution, and sustainable seafood and is delivered by Cefas, the Marine Management Organisation (MMO) and the Joint Nature Conservation Committee (JNCC) on behalf of Defra. Funding is provided through the UK government Official Development Assistance (ODA) programme."
        },
        {
            "text": "Special thanks to all colleagues who made this visit possible: Cefas’ Joanna Murray, Joanna Ford, Thomas Catchpole, Rebecca Lamb, Jon Elson, James Bell, Oliver Hogg, Danny Jones, Allen Searle, Jack Smith, Lauren Popham, Matt Brown, Angharad Elliman and Jacky Read; Lara Turtle, Jack Collier and Edward Kirby from Defra; Jamie Johnson from the MMO; Ali Hood and Jack Renwick from the Shark Trust; Sarah Fowler from the Save Our Seas Foundation; and to our visitors, Director General Mr Kahawatta and Director of Quality Control Mrs Herath from DFAR and Daniel Fernando and Akshay Tanna from BRT.  "
        },
        {
            "text": "References"
        },
        {
            "text": "FAO. 1999. International Plan of Action for reducing incidental catch of seabirds in longline fisheries. International Plan of Action for the conservation and management of sharks. International Plan of Action for the management of fishing capacity. Rome, FAO. 26pp."
        },
        {
            "text": "Gilman, E., Chaloupka, M., Taylor, N., Nelson, L., Friedman, K. and Murua, H., 2024. Global governance guard rails for sharks: Progress towards implementing the United Nations international plan of action. Fish and Fisheries, 25(1), pp.1-17."
        }
    ]
}