{
    "url": "https://educationhub.blog.gov.uk/2024/12/17/the-childrens-wellbeing-bill-what-parents-need-to-know/",
    "title": "The Children's Wellbeing and Schools Bill: what parents need to know  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "Curriculum",
        "Home Learning Environment",
        "Home schooling",
        "School places",
        "Schools",
        "Teacher pay",
        "Teacher recruitment"
    ],
    "pub_date": "2024-12-17T00:01:00+00:00",
    "content": [
        {
            "text": "The new Children’s Wellbeing and Schools Bill - sometimes referred to as the Children's Wellbeing Bill - introduces a wide variety of measures to help children and families, from school reform and home education to safeguarding. "
        },
        {
            "text": "But how will this impact your family? Find out here. "
        },
        {
            "heading": 2,
            "text": "What is the Children’s Wellbeing and Schools Bill? "
        },
        {
            "text": "A bill is a proposal for new laws that is presented for debate before Parliament. The laws proposed under the Children’s Wellbeing and Schools Bill will make important changes to protect children and improve education.  "
        },
        {
            "text": "The Bill focuses on making sure no child falls through gaps between different services and that families can get help when they need it. It also makes the changes needed to ensure every child can get a great education at a good school in their area.   "
        },
        {
            "heading": 2,
            "text": "How will it affect school education?  "
        },
        {
            "text": "The Bill introduces several key changes to improve your child's education.  "
        },
        {
            "text": "Teacher training "
        },
        {
            "text": "The department recognises that high quality teaching is the factor within school that makes the biggest difference to a child’s education, giving them the knowledge and skills to succeed throughout life. "
        },
        {
            "text": "That is why we are making sure new teachers are qualified and trained to a high level. As part of the Bill, new teachers in state primary and secondary schools will need to have qualified teacher status, or be working towards it.  The requirement will come into effect from 1st September 2026, which gives schools time to prepare. "
        },
        {
            "text": "Pay and conditions "
        },
        {
            "text": "To make sure schools can continue to attract and retain the best teachers, the Bill sets out that all teachers will be part of the same core pay and conditions framework – whether they work in a maintained school or an academy. "
        },
        {
            "text": "We want to ensure there is a unified core offer of terms and conditions across the school system, but we also recognise the importance of flexibility within that framework to enable the recruitment and retention of the best teachers. "
        },
        {
            "text": "Most academies already follow the existing framework and want this change. But before requiring academies to comply with the framework we will ask the School Teachers’ Review Body to consider additional flexibilities within the statutory framework to make it most effective for all schools.  This will be no earlier than September 2026. "
        },
        {
            "text": "Many 16-19 academies have pay and conditions arrangements that are different to the school sector and bringing them in line with schools would be disruptive. They are therefore excluded, but can still choose to follow the framework voluntarily.  "
        },
        {
            "text": "One strengthened curriculum for all "
        },
        {
            "text": "We’ve commissioned an independent review to advise on the curriculum and assessment system for 5- to 19-year-olds, to make sure it meets the needs of every child and young person. The Curriculum and Assessment Review is now well underway and is due to publish its recommendations in autumn 2025. "
        },
        {
            "text": "Every child should have a consistent core education with an excellent foundation in reading, writing and maths, and support to develop essential digital, speaking, and creative skills. But more than half of children attend academies, which do not have to follow the national curriculum."
        },
        {
            "text": "The Bill will require all state-funded schools – including academies – to teach the national curriculum. This means parents can be assured that their child is getting the benefits of the reformed curriculum – no matter what type of school they attend. "
        },
        {
            "text": "We will bring the measure into force once a reformed curriculum has been developed following the advice of the Curriculum and Assessment Review, when it will be rolled out to academies alongside other schools. "
        },
        {
            "text": "School places "
        },
        {
            "text": "Councils and schools are going to work together better to make sure there are enough school places in the local area and that children without a place can get one quickly.   "
        },
        {
            "text": "Councils will be given the opportunity to open all types of school, not just academies, so they can meet the needs of local parents. Schools and local authorities will also work together when it comes to school admissions and place planning. For example, they will have greater powers to direct the admission of an individual child into both maintained schools and academies, when a place is needed for that child.  "
        },
        {
            "text": "Flexibility to act on failing schools "
        },
        {
            "text": "We will also introduce greater flexibility for us to intervene in failing schools, changing the current duty to issue academy orders to a discretionary power. This will allow us to identity the right approach for each school.   "
        },
        {
            "text": "Currently the Secretary of State has to issue an academy order to all maintained schools that are judged by Ofsted to be in a category causing concern - schools requiring special measures or requiring significant improvement. That means they are converted into sponsored academies. However, this forced academisation has not always been effective and can be highly disruptive for pupils, staff and parents.     "
        },
        {
            "text": "Repealing the duty to issue academy orders will allow the Secretary of State the flexibility to determine what the most appropriate action is to drive school improvement in each individual case. Academisation may not always be necessary and we can support school improvement through other means, including through new Regional Improvement for Standards and Excellence (RISE) teams.   "
        },
        {
            "heading": 2,
            "text": "What about home education?  "
        },
        {
            "text": "If you already home educate your child, or are thinking about it, there will be some important changes in the Bill.  "
        },
        {
            "text": "Parents know their children best and it is right that they have a say in the best education for their child, including home education.  But whilst many home educators do a good job, this is not the case for all. It is vital all home education is suitable and safe and that no child falls through the cracks.    "
        },
        {
            "text": "That’s why we are introducing compulsory Children Not in School registers in every local authority in England, so local authorities can identify all children not in school in their area and ensure that all children are receiving a suitable education."
        },
        {
            "text": "Parents will no longer have an automatic right to home educate if their child is subject to a child protection investigation or under a child protection plan. For all children, if a local authority deem the education and/or home environment unsuitable, local authorities will now have the power to intervene and require school attendance.  "
        },
        {
            "text": "There are many reasons why parents choose to home educate, including where their child has special educational needs. As long as they are providing a good, safe education they can continue to do so. The measures will ensure that the most vulnerable children cannot be withdrawn from school until it is confirmed that this would be in their best interests, and that the education to be provided outside of school is suitable.   "
        },
        {
            "heading": 2,
            "text": "But how will the Bill actually help protect children?  "
        },
        {
            "text": "The Bill introduces a series of safety measures that are new, with a focus on a joined-up system to stop vulnerable children falling through cracks in services. "
        },
        {
            "text": "Single unique identifier number "
        },
        {
            "text": "We are piloting using a single unique identifier number for children across services – similar to how the NHS number works for adult social care – to test how this can improve information sharing to better protect children’s safety. "
        },
        {
            "text": "A consistent identifier will allow those responsible for the safeguarding and welfare of children to better join relevant data and identify children who will benefit from additional support. "
        },
        {
            "text": "Keeping children safe is the key driver of this change, and existing data protection laws already make clear that safeguarding must be prioritised when deciding whether to share information. This new law will mean more confidence for those responsible for requesting and providing sensitive information – speeding up the process and providing a clear legal basis for sharing information on the grounds of safeguarding and promotion of welfare. "
        },
        {
            "text": "Strengthening the role of education in safeguarding "
        },
        {
            "text": "Teachers and educators are often the first to spot warnings of abuse or neglect, and last year, schools were the second largest referrer of cases into children’s social care. But currently the law doesn’t require all nurseries, schools or colleges to be included in safeguarding arrangements. This means opportunities to protect children can be missed. "
        },
        {
            "text": "We are placing a duty on the safeguarding partners for local authorities, police and health to give educators a greater role enabling them to influence decision-making at every level. "
        },
        {
            "text": "This change will see better join-up between children’s social care, police, and health services with education, to better safeguard and promote the welfare of all children in local areas.   "
        },
        {
            "text": "Supporting families to stay together "
        },
        {
            "text": "While there will always be cases where children need to go into the care system, with earlier intervention, families can often be supported to stay together.   "
        },
        {
            "text": "Children who stay with their extended family network have better outcomes than those who are put into care, which is why we are making it a requirement for local authorities to offer all parents of children who are at risk of entering the care system the chance to attend ‘family group decision making’ meetings. These meetings will give all families an opportunity to come together and make a plan, working alongside professionals, prioritising the wellbeing of the child. "
        },
        {
            "text": "Where safe and appropriate, keeping children with their families is the aim.   "
        },
        {
            "heading": 2,
            "text": "What extra support will be available?  "
        },
        {
            "text": "The government is doubling investment in Family Help services to £500m next year. This means more support will be available for families dealing with challenges like mental health issues.  "
        },
        {
            "text": "We will also provide help to keep families together where possible, prioritising family members who step in to care for children before they go into care. "
        }
    ]
}