{
    "url": "https://environmentagency.blog.gov.uk/2024/12/17/transforming-our-understanding-of-flood-and-coastal-erosion-risk-in-england/",
    "title": "Transforming our understanding of flood and coastal erosion risk in England",
    "authors": [
        "defrablogs",
        "Julie Foley, Director of Flood Risk Strategy & National Adaptation at the Environment Agency"
    ],
    "categories": [
        "Flood",
        "Flood Planning"
    ],
    "pub_date": "2024-12-17T10:00:00+00:00",
    "content": [
        {
            "text": "Julie Foley, Director of Flood Risk Strategy and Adaptation"
        },
        {
            "text": "Understanding of flood and coastal erosion risk is vital to ensuring that policy makers, practitioners and communities are ready to adapt to a changing climate. "
        },
        {
            "text": "The Environment Agency is required to update our understanding of current and future flood and coastal erosion risk as part of our statutory roles under the 2010 Flood and Water Management Act. This information is important to a wide range of users from policy makers and practitioners to planners and developers, emergency responders and members of the public."
        },
        {
            "text": "We have been transforming how we understand current and future risk by improving two key evidence tools - the National Flood Risk Assessment (NaFRA) and the National Coastal Erosion Risk Map (NCERM). Both draw on the best available data from the Environment Agency and local authorities as well as improved modelling methodologies and advancements in computing."
        },
        {
            "text": "The new NaFRA provides a single picture of current and future flood risk from rivers, the sea and surface water for England. The new NCERM provides the most up to date national picture of current and future coastal erosion risk for England. NCERM  also accounts for the latest Shoreline Management Plans (SMPs) which set out a long term approach to managing flood and coastal erosion risk around the coast."
        },
        {
            "text": "We will continue to see the impacts of a changing climate leading to more frequent and severe flooding and storms. For the first time, both NaFRA and NCERM are able to account for the latest UK Climate Projections. Our estimates of future risk due to climate change are based on the potential for risk to increase rather than a prediction. In other words, we assess future flood risk based on today’s infrastructure in tomorrow’s climate."
        },
        {
            "text": "How is our assessment of flood risk changing?"
        },
        {
            "text": "Today we have published the ‘National assessment of flood and coastal erosion risk in England 2024’ report on GOV.UK. This report summarises the national and regional findings from the new NaFRA and the new NCERM."
        },
        {
            "text": "The new NaFRA shows that around 6.3 million properties in England are in areas at risk of flooding from one or a combination of sources: rivers, the sea and surface water. "
        },
        {
            "text": "Around 4.6 million of those properties are in areas at risk of flooding from surface water. Surface water flooding happens when there is so much rainwater that it overwhelms drainage systems causing surface water runoff also known as flash flooding. This is a 43% increase on our previous assessment. These changes are almost entirely due to significant improvements in our data, modelling and use of technology."
        },
        {
            "text": "Whilst the total number of properties in areas at risk from flooding from rivers and the sea is not increasing, there is a 88% increase in the number of properties in areas at the highest levels of risk. This is where an area has a greater than 1 in 30 chance of flooding in any given year.  There are a variety of reasons for the changes in risk. The most notable being improved data and modelling methods for assessing the likely frequency of flooding."
        },
        {
            "text": "An innovation with the new NaFRA is that we now have information on the chance of flooding to different depths which enables us to better understand the impacts and possible hazards. Our experience from past floods shows that depths of just 30 centimetres of flood water can be enough to move a car during a heavy rainfall event."
        },
        {
            "text": "Over two fifths of properties in areas at high risk from rivers and the sea are likely to flood to depths of 30 centimetres or higher. In contrast, 1 in 6 of properties in areas at high risk of flooding from surface water are likely to flood to the same depths. The typical impacts from surface water flooding are therefore likely to occur at shallower levels than flooding events from rivers and the sea.  "
        },
        {
            "text": "With climate change the total number of properties in areas at risk from rivers and the sea or surface water could increase to around 8 million by the mid-century. In other words, 1 in 4 properties in England could be in areas at risk of flooding from rivers and the sea or surface water by the mid-century. "
        },
        {
            "text": "How is our assessment of coastal erosion risk changing?"
        },
        {
            "text": "The new NCERM shows that 3,500 properties are in areas at risk of coastal erosion in the period up to 2055. This increases to about 10,100 properties in the period up to 2105."
        },
        {
            "text": "In the worst case, where the SMPs are not delivered and no future investment is made to manage coastal erosion, the numbers of properties in areas at risk increases significantly. The total number of properties in areas at erosion risk would be 9 times greater in the period up to 2055, reaching up to 32,800 properties. "
        },
        {
            "text": "The new NCERM shows that coastal erosion risk will increase with climate change. This is mainly due to the effects of sea level rise on erosion rates. Even with SMPs delivered there could be 19,700 properties in areas at risk of erosion in the period up to the end of the century. "
        },
        {
            "text": "How are we making the new information available?"
        },
        {
            "text": "At the end of January 2025 we will publish all the new NaFRA and NCERM data as open access on GOV.UK. We will also update our digital services on GOV.UK, including ‘Check your long term flood risk’ to help our customers understand what this new information means for them at a local level. We will be able to show users information on potential flood depths as well as future flood risk taking into account climate change. In spring 2025 we will update our ‘Flood map for planning’ digital service to assist planners and developers towards the most appropriate sites for development."
        }
    ]
}