{
    "url": "https://accessibility.blog.gov.uk/2024/12/17/what-gds-has-found-from-public-sector-accessibility-monitoring/",
    "title": "What GDS has found from public sector accessibility monitoring",
    "authors": [
        "Chris Heathcote, Product Manager, Accessibility Monitoring"
    ],
    "categories": [
        "Accessibility Regulations"
    ],
    "pub_date": "2024-12-17T15:58:35+00:00",
    "content": [
        {
            "text": "Government Digital Service (GDS) monitors the accessibility of public sector websites and mobile apps. We’ve published a report on our accessibility monitoring today outlining what we have found from the last 3 years."
        },
        {
            "text": "Public sector websites and mobile apps have to be accessible by law. Having accessible websites and mobile applications (apps) is vital for 16.1 million disabled people in the UK, but it also means that sites work better for everyone and on all devices."
        },
        {
            "heading": 2,
            "text": "What we’ve found"
        },
        {
            "text": "We’ve monitored 1,203 public sector websites and 21 mobile apps between January 2022 and September 2024. We’ve tested the main website of public sector organisations, but now we’ve started to look at secondary websites, such as recruitment sites."
        },
        {
            "text": "The main accessibility issues we found during monitoring were: "
        },
        {
            "heading": 2,
            "text": "Keep going"
        },
        {
            "text": "85% of websites and mobile apps we monitored had published an accessibility statement. We found that many accessibility statements are now out-of-date and have not been reviewed in the last 12 months, which may mean users are more likely to encounter problems with the website or app. It’s important that organisations check and update their statements to reflect changes to their websites or apps."
        },
        {
            "text": "Thank you to the public sector teams we have monitored, who have fixed a majority of the accessibility issues that we found. It is good to see teams across the public sector working to make their websites and apps accessible."
        }
    ]
}