{
    "url": "https://nda.blog.gov.uk/apprenticeship-week-dont-be-afraid-to-take-the-leap/",
    "title": "Apprenticeship Week: don't be afraid to take the leap",
    "authors": [
        "Dawson Tanner"
    ],
    "categories": [
        "Skills",
        "Waste management"
    ],
    "pub_date": "2022-02-09T14:22:07+00:00",
    "content": [
        {
            "text": "Name: Dawson Tanner"
        },
        {
            "text": "Apprenticeship: Quality Control Technician"
        },
        {
            "text": "Area of the Business: Quality"
        },
        {
            "heading": 3,
            "text": "How have you progressed on your apprenticeship journey so far?"
        },
        {
            "text": "I have completed multiple tasks set by my mentor and their team and learnt to develop my own personal skills to another level by being given the training necessary such as:"
        },
        {
            "text": "I have had multiple overviews of the different sections that operate within the business. I have found myself becoming an all-round better human due to me being constantly in contact with the team, showed the correct standards and culture."
        },
        {
            "heading": 3,
            "text": " What are the benefits of completing an apprenticeship?"
        },
        {
            "text": "The benefits of completing apprenticeship are that you do not only gain a qualification, but you gain the skills and knowledge to further excel your desired career path."
        },
        {
            "text": "You gain a wider scope for networking with different sections of the business due to being involved with most of them. You develop the correct culture and characteristics that the company desires."
        },
        {
            "heading": 3,
            "text": " What do you enjoy about working at Nuclear Waste Services?"
        },
        {
            "text": "I enjoy the vast amount of opportunity to progress your career further, together with the open and honest feedback and communication. I feel valued."
        },
        {
            "heading": 3,
            "text": "What are your aspirations for the future?"
        },
        {
            "text": "My aspirations for the future are to confidently complete my apprenticeship. I will also hopefully secure a full-time job within Nuclear Waste Services, move into the Quality Control section of the business, succeed in completing a weld-inspection course. I'm keen to help the business in any ways suitable."
        },
        {
            "heading": 3,
            "text": "What advice would you give to other individuals who may be considering applying for an apprenticeship? "
        },
        {
            "text": "Don’t be afraid to take the leap and go for it."
        },
        {
            "text": "Personally, I was employed in a well paid job prior to starting with the organisation but soon came to realise that I couldn’t progress any further, so I decided to take a large pay decrease in order to gain a qualification, experience and knowledge. You must see the bigger picture. It was short-term loss for a long-term gain."
        }
    ]
}