{
    "url": "https://nda.blog.gov.uk/apprenticeship-week-it-can-only-help-improve-your-future/",
    "title": "Apprenticeship Week: it can only help improve your future",
    "authors": [
        "Lewis Gribbin"
    ],
    "categories": [
        "Skills"
    ],
    "pub_date": "2022-02-09T14:17:37+00:00",
    "content": [
        {
            "text": "Name: Lewis Gribbin"
        },
        {
            "text": "Apprenticeship: Procurement and Commercial Supply"
        },
        {
            "text": "Area of the Business: Procurement"
        },
        {
            "heading": 3,
            "text": "How have you progressed on your apprenticeship journey so far?"
        },
        {
            "text": "I feel I have progressed a long way in the short time I have been here, I have been able to learn from a lot of different people within the procurement department. I have been given responsibility which has also helped me fit in."
        },
        {
            "heading": 3,
            "text": "What are the benefits of completing an apprenticeship?"
        },
        {
            "text": "The benefits of completing an apprenticeship are that you get to learn on the job and you are also able to earn a qualification whilst doing this. Another benefit is that once you have finished your qualification and apprenticeship you are then able to move up within the company."
        },
        {
            "heading": 3,
            "text": "What do you enjoy about working at Nuclear Waste Services?"
        },
        {
            "text": "The main thing I enjoy about working at Nuclear Waste Services is the atmosphere within the company was so welcoming. Everyone I’ve spoken to and dealt with has been really friendly and offering advice and help whenever its required."
        },
        {
            "heading": 3,
            "text": "What are your aspirations for the future?"
        },
        {
            "text": "My aspirations for the future are to earn my CIPS level 4 (Chartered Institute of Procurement & Supply qualification) and then hopefully progress further within the business once my apprenticeship is complete. I would also like to progress and earn my level 5 and 6 CIPS qualifications in the future."
        },
        {
            "heading": 3,
            "text": "What advice would you give to other individuals who may be considering applying for an apprenticeship?"
        },
        {
            "text": "The main advice I would give is to go for it as it can only help you improve your future."
        }
    ]
}