{
    "url": "https://nda.blog.gov.uk/apprenticeship-week-learning-from-others-in-the-workplace/",
    "title": "Apprenticeship Week: learning from others in the workplace",
    "authors": [
        "Sarah Clarke"
    ],
    "categories": [
        "Skills",
        "Waste management"
    ],
    "pub_date": "2022-02-09T14:23:22+00:00",
    "content": [
        {
            "text": "Name: Sarah Clarke"
        },
        {
            "text": "Apprenticeship: Health, Safety, and Environment technician"
        },
        {
            "text": "Area of the Business: Health and Safety"
        },
        {
            "heading": 3,
            "text": "How have you progressed on your apprenticeship journey so far?"
        },
        {
            "text": "I have progressed smoothly into my apprenticeship so far due to the support given."
        },
        {
            "heading": 3,
            "text": "What are the benefits of completing an apprenticeship?"
        },
        {
            "text": "One benefit would be that you can get both practical, real work experience whilst still getting the qualifications you need for the job. Another benefit is that it allows you to imagine yourself in the role you aspire to achieve, as you are working in the company alongside people doing the role or similar roles. One other benefit would be that you can gain knowledge and experience from other people in the workplace which will help you determine if the career is something that you want to pursue."
        },
        {
            "heading": 3,
            "text": "What do you enjoy about working at Nuclear Waste Services?"
        },
        {
            "text": "One reason I enjoy working at Nuclear Waste Services is the atmosphere and people. It always offers support and a healthy working environment. Another reason why I enjoy working here is because of the environment. The site is home to protected wildlife which is cared for and considered shown when construction is taking place. This is important because it benefits the environment side of my apprenticeship."
        },
        {
            "heading": 3,
            "text": "What are your aspirations for the future?"
        },
        {
            "text": "I’m currently unclear about my aspirations for the future, however, they would probably be to continue with health and safety and try securing a job within Nuclear Waste Services after my apprenticeship."
        },
        {
            "heading": 3,
            "text": "What advice would you give to other individuals who may be considering applying for an apprenticeship? "
        },
        {
            "text": "One piece of advice would be do as much research on the company before and during the apprenticeship. Another would be to organise as much as possible and ask any questions that you want answers for"
        }
    ]
}