{
    "url": "https://dvladigital.blog.gov.uk/2022/02/09/celebrating-a-year-of-digital-voices-at-dvla/",
    "title": "Celebrating a year of Digital Voices at DVLA",
    "authors": [
        "Lucy Whitaker"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2022-02-09T12:35:11+01:00",
    "content": [
        {
            "text": "We’re celebrating the first anniversary of our Digital Voices advocacy group. We support DVLA’s Centre of Digital Excellence initiatives by promoting diversity, development and digital career opportunities to both staff and external candidates."
        },
        {
            "text": "We believe strongly in opportunities for all, and we want to lead the way in digital diversity. This means encouraging inclusivity across DVLA by providing all staff with opportunities to progress and learn new skills."
        },
        {
            "text": "As a member and nominated leader of the group, it’s been amazing to watch us grow over the past year. I’m excited to share with you our story so far, and our plans for the future!"
        },
        {
            "heading": 2,
            "text": "The story so far…"
        },
        {
            "text": "Our group was born on 12 January 2021 with the help of stakeholders from across DVLA, including our Human Resources, Recruitment, and Capability and Talent colleagues. It was wonderful to see the agency united behind our goal to promote diversity and inclusion within digital careers."
        },
        {
            "text": "To launch Digital Voices, we invited staff to join us for a virtual meetup session, where we showcased inspiring role models within our digital teams and outlined our vision for the group. Since then, we’ve grown to have more than 89 members from across the agency. And, I’m pleased to say, we’re still going strong!"
        },
        {
            "heading": 2,
            "text": "So what do we get up to?"
        },
        {
            "text": "We support colleagues who want to build their confidence, knowledge, and skills, as well as those seeking a new career path. Despite working remotely, we’ve managed to connect with our members through our weekly emails and monthly newsletters, providing staff with the latest digital career opportunities. We also love to showcase success stories from the wonderfully talented people across the agency, working in these roles - and, yes, there are many!"
        },
        {
            "text": "Our monthly newsletter also highlights the learning and development opportunities DVLA has to offer. Members can join us at our monthly digital drop-in sessions or our quarterly digital meetups, which offer colleagues a chance to meet new faces, connect and network."
        },
        {
            "text": "Supporting staff wishing to begin a career in digital is just as important. We provide mentoring to those looking for a career change, and we’ve recently launched our ‘Think Digital’ webpages for staff to learn more about digital careers or a particular IT profession. We hope to make similar pages available to the public in the future."
        },
        {
            "heading": 2,
            "text": "Celebrating digital diversity"
        },
        {
            "text": "We strongly believe that digital careers should be accessible to those wishing to apply for them. That’s why we encourage our members to share DVLA’s many opportunities with family and friends and host a range of activities to promote digital careers throughout the year."
        },
        {
            "text": "Last year, we attended virtual events such as the Women in Tech Festival, and took part in celebrations, such as Ada Lovelace Day and International Women in Engineering Day. I’m also incredibly proud to say that we’ve been nominated for Diversity and Inclusion awards at both Women in Tech Excellence 2021 and the UK Women in IT Awards 2021."
        },
        {
            "text": "Our group also joined up with the BAME Youth Forum to help graduates from minority ethnic backgrounds get into IT. Following several applications, we successfully recruited a graduate to our Software Development Engineer in Test academy scheme last year. Making a difference is what Digital Voices is all about, so it’s fantastic to see the positive impact our members have on the agency and our community at large."
        },
        {
            "heading": 2,
            "text": "Looking forward…"
        },
        {
            "text": "In the coming years, DVLA will continue to evolve our services, making it easier for customers to do business with us online. That’s why attracting new talent, as well as retaining and developing existing talent, is so important for us and our customers."
        },
        {
            "text": "We’re currently looking for members to join our steering group to shape the future of Digital Voices at DVLA. We’re also celebrating National Apprenticeship Week between 7 and 13 February by hosting online sessions for people to learn about our upcoming development schemes, and how to apply for IT roles within the Civil Service."
        },
        {
            "text": "If this is something you’d like to get involved with, why not join us at DVLA? Keep an eye out on Civil Service Jobs for all the latest career opportunities. You can also visit our Reed.com site or learn more about digital careers at DVLA."
        }
    ]
}