{
    "url": "https://apprenticeships.blog.gov.uk/2022/02/09/my-apprenticeship-helped-me-find-what-i-want-to-do-for-the-rest-of-my-life/",
    "title": "My apprenticeship helped me find what I want to do for the rest of my life",
    "authors": [
        "Saskia Navaratnam"
    ],
    "categories": [
        "Apprentice panel",
        "Apprentices"
    ],
    "pub_date": "2022-02-09T14:41:28+00:00",
    "content": [
        {
            "text": "Saskia is a level 3 advanced engineering apprentice and a new member of the Institute’s apprentice panel, whose role is to ensure that the views of apprentices are represented across the work and governance of the Institute.   "
        },
        {
            "text": "Read on to find out how her apprenticeship has helped her, as well as what advice she would give someone considering an apprenticeship or just starting out on their journey.  "
        },
        {
            "heading": 2,
            "text": "Starting out  "
        },
        {
            "text": "Currently, I’m in my second year of a three-year advanced engineering apprenticeship with Royal Mail, and so far, I’m loving it!  "
        },
        {
            "text": "At one stage, I was completing a criminology with law degree. But law wasn’t the career I’d dreamt of as a child, so I decided to make a change. I really wanted to be an engineer.   "
        },
        {
            "text": "I had never considered an apprenticeship, but due to my GCSE and A level subject choices, entering the engineering sector via the university route wasn’t an option. I began to look at alternatives, found an apprenticeship, and here we are! "
        },
        {
            "text": "I’m training to become a maintenance engineer for the Royal Mail. My apprenticeship consists of a period of residential training and study at college in Blackburn learning the basics of engineering, after which I work in my base mail centre, learning on the job whilst completing college assignments. My time in Blackburn is spent with other first-year apprentices, so it’s great for networking. "
        },
        {
            "text": "A typical day for me will begin with the maintenance of our postal machines, which includes cleaning, checks, inspections, and testing to ensure the machines can run to the best of their ability when they are used.  "
        },
        {
            "text": "After doing the maintenance, I’ll begin doing my college work.  "
        },
        {
            "heading": 2,
            "text": "Finding my passion "
        },
        {
            "text": "I enjoy fixing things and improving their performance.  "
        },
        {
            "text": "When I was younger, I would take every opportunity I could in the house to do something – whether it be fixing the disc drive on a PC or changing fuses in microwaves and the fuse box. When my grandmother’s 40-year-old sewing machine stopped working, I spent time investigating it.  "
        },
        {
            "text": "I realised that no amount of books or paperwork could satisfy me as much as getting something up and running again! That was the moment my life changed, and I am thankful for it because I’ve found something I’m extremely passionate about – something I can see myself doing for the rest of my life!"
        },
        {
            "text": "The best moment for me so far was the first time I was able to solve a complex fault on my own! Although I’m aware I don’t know everything yet and I still require help with some things, this was extremely encouraging, as I could see the improvements I’d made and show that my training was coming to fruition.  "
        },
        {
            "text": "My confidence has been steadily growing since then and I’ve been able to solve more problems on my own and improve myself daily.  "
        },
        {
            "heading": 2,
            "text": "Joining the apprentice panel   "
        },
        {
            "text": "I recently joined the Institute’s apprentice panel. The panel provides a space that allows the voices of apprentices to be heard, so that those voices can help shape and drive apprenticeships in the future.  "
        },
        {
            "text": "My goals on the panel are to help provide a larger platform for apprenticeships as a viable career starter/changer and, more intrinsically, to make a push for more women and BME in engineering.   "
        },
        {
            "heading": 2,
            "text": "What my apprenticeship has done for me and my advice  "
        },
        {
            "text": "My apprenticeship has provided me with the building blocks I need to create a steady foundation for my growing knowledge and confidence. It’s allowed me to pursue my dream career path and opened more doors than I could ever have imagined. "
        },
        {
            "text": "Doing an apprenticeship has provided me with an income and an education at the same time. I started this apprenticeship at 24 years old, so it was important for me to be able to earn whilst I learn. It has also provided me with the opportunity to gain the qualifications and experience to pursue many different roles within engineering, and the confidence to do so. "
        },
        {
            "text": "There are many different companies offering the same or similar apprenticeship schemes but completely different experiences! The roles you’ll be fulfilling within each company are likely to vary from each other, and although one may not sound appealing to you, there are many others that you may prefer! "
        },
        {
            "text": "If you are thinking about doing an apprenticeship, I would advise you to look through the Institute’s website to gain a better understanding of what’s available and what an apprenticeship could do for you. "
        },
        {
            "text": "There are no ceilings on your potential as long as you’re willing to put in the effort! Open yourself up to as many opportunities as you can and keep going. Reach out to others in similar positions to yourself and never be afraid of asking for support – it’s the best way to learn and a great way to network too. "
        }
    ]
}