{
    "url": "https://mojdigital.blog.gov.uk/2022/02/09/my-coding-journey/",
    "title": "My Coding Journey",
    "authors": [
        "Neneh Bojang"
    ],
    "categories": [
        "National Apprenticeship Week"
    ],
    "pub_date": "2022-02-09T16:13:58+01:00",
    "content": [
        {
            "text": "Prior to embarking on my apprenticeship journey, I was working in the Fire and Security sector. The sector was good, but I was looking for a more challenging role, a role that will push me outside my comfort zone as well as further enhance my learning."
        },
        {
            "text": "I first came across coding whilst studying for my undergraduate degree at university. However, due to the degree being heavily concentrated on Electrical and Electronic modules I was unable to pursue it further. For that reason, I utilised my free time during the pandemic to transition into tech. I started taking coding courses on Freecodecamp, Udemy, Codecademy, Codewars and YouTube to start off the journey. In addition to this, I enrolled onto Udacity’s fronted-end nanodegree program in an attempt to take my learning a step further."
        },
        {
            "text": "I came across the MoJ x Makers apprenticeship program through ‘Coding Black Females’. The application process was unique in the sense that I applied through Coding black females then proceeded to Makers academy. Whilst at Markers, I had to complete a 15-hour ruby exercise, a coding challenge, followed with an interview and a final interview with MoJ (still sweating from the application process!). After successfully completing this I was then offered a position."
        },
        {
            "heading": 3,
            "text": "Bootcamp"
        },
        {
            "text": "The bootcamp was intense! Makers ultimate goal was to make you learn ‘How to learn funny right’ the concept is if you know how to learn you can learn anything. Every week I was learning a new concept - something to look forward to each time. No two days were essentially the same and the bootcamp involved a lot of pair programming which was insightful seeing how other people approached a problem as well as their style of working. Moreover, ‘Friday challenges’ were also a part of the programme which were designed to test your knowledge of the week as well as independently because the week is mostly spent pairing."
        },
        {
            "heading": 3,
            "text": "MoJ "
        },
        {
            "text": "Before Makers I spent a month at MoJ which allowed me to get to know my team, find out what projects they were working on and be part of the team. Currently back at LAA to do my placement, thus far, it’s been excellent in terms of learning and working alongside senior developers. I am constantly learning new ways of doing things and supported if I run into any issues. Nevertheless, I work with a wonderful team who are extremely supportive and always willing to go out of their way to help me understand things."
        },
        {
            "text": "I strongly believe anyone can do it if you have the passion for problem solving or want to try something different - out of your comfort zone. I will definitely say, ‘give it a go. You will never know until you try!’ Most importantly, what I have taken away from Makers is “It’s not hard, it's new”."
        },
        {
            "text": " "
        }
    ]
}