{
    "url": "https://insolvencyservice.blog.gov.uk/2022/02/09/national-apprenticeship-week-2022-jamess-story/",
    "title": "National Apprenticeship Week 2022: James's story",
    "authors": [
        "James Smith"
    ],
    "categories": [
        "Apprenticeships",
        "People",
        "Working for the Insolvency Service"
    ],
    "pub_date": "2022-02-09T09:53:39+00:00",
    "content": [
        {
            "text": "When I was weighing up my options about what to do after I left school, I decided going to university was not right for me. I was happy to find employment but, although it started off in the right direction, I was never fulfilled by my job.  "
        },
        {
            "text": "I tried asking for more responsibilities from my previous employer, but it didn’t pan out. Rather than sit back, I wanted to use my abilities and increase my skills. "
        },
        {
            "heading": 2,
            "text": "My apprenticeship "
        },
        {
            "text": "When the opportunity of an apprenticeship came up at the Insolvency Service, I jumped at the chance.  "
        },
        {
            "text": "I recently completed my Level 3 Apprenticeship in Operational Delivery and I am very pleased to say the Insolvency Service has been very accommodating throughout.  "
        },
        {
            "text": "I was able to dedicate 20 percent of my weekly hours towards extra training and self-driven study. I am also a member of three different Civil Service-wide Operational Delivery network and study groups. "
        },
        {
            "heading": 2,
            "text": "My day to day role"
        },
        {
            "text": "As an Investigation Support Officer in the Investigation and Enforcement Services, I provided administrative support to a large group of investigators. Together, we looked at director misconduct and we consider whether to pursue legal action against dishonest and negligent individuals."
        },
        {
            "text": "Compared to my previous job, I have a genuine purpose in the Insolvency Service. I understand the impact of my role and how it enables my colleagues to assist those in financial distress. Many insolvent companies leave their creditors to fend for themselves financially. We strive to maximise the returns to these innocents, helping them to regain as much of their investments as possible."
        },
        {
            "text": "I understand my work also helps deliver against the Insolvency Service’s objective to tackle financial misconduct and meet the agency’s new five-year strategy. "
        },
        {
            "heading": 2,
            "text": "Shadowing and collaborating"
        },
        {
            "text": "I have also been given the opportunity to shadow senior colleagues and really get to understand how important decisions are made.  "
        },
        {
            "text": "A recent case I worked on, centred around a director who was involved in the asset stripping of companies, required me to collaborate with four investigators.  "
        },
        {
            "text": "It was a great experience for me. My opinions were listened to, I had equal status in the team, and I was encouraged to try new things, such as negotiating letter deadlines with an accountant. The lead investigator was grateful and assured me that my efforts contributed to a successful disqualification. "
        },
        {
            "heading": 2,
            "text": "A focus on people"
        },
        {
            "text": "I never knew that I could get so much out of a steady job. The Insolvency Service offers benefits such as flexible working arrangements and access to an online library of self-development modules, called Civil Service Learning."
        },
        {
            "text": "There is a choice of pension schemes and they were explained to me thoroughly when I joined. It will be quite some time before I’m ready to retire but it’s still good to know that preparations are in place."
        },
        {
            "text": "The Insolvency Service has a strong focus on its people and offers a variety of People Networks which you’re encouraged to join. I’m also a member of a network called the Coffee Roulette. This is a group that pairs you with a new colleague each month for a fifteen-to-thirty-minute chat. Every person that I have been paired with has been friendly and motivating."
        },
        {
            "heading": 2,
            "text": "Benefits of flexible working"
        },
        {
            "text": "My previous jobs involved working in retail. It was often difficult trying to plan a decent night out when I never knew which weekends I would be free."
        },
        {
            "text": "Thanks to the flexi-hours system, if I work longer hours one day, I can use those hours to finish earlier another day. This is great for when I want to go to the gym after work. Or when I suddenly remember that I promised to visit my cousin - who lives a few hours away - tomorrow."
        },
        {
            "heading": 2,
            "text": "A supportive team"
        },
        {
            "text": "I can’t end the blog without mentioning my team in the Investigation and Enforcement Services. Despite the restrictions brought about by the pandemic, we maintained regular group discussions each week through online video chats. I have learned with them, confided in them, and developed thanks to them."
        },
        {
            "heading": 2,
            "text": "My journey continues"
        },
        {
            "text": "My professional skills and confidence have improved greatly since I joined last year. I have recently been successful in a temporary cover opportunity to HR Policy and look forward to seeing what the next few months bring. I can proudly say that I am glad to be working for the Insolvency Service. "
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}