{
    "url": "https://deframedia.blog.gov.uk/2022/02/09/natural-england-outlines-new-guidance-for-land-managers-under-the-countryside-code/",
    "title": "Natural England outlines new guidance for land managers under the Countryside Code",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-02-09T14:32:13+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been widespread coverage of in the Telegraph, Times, Daily Mail, Daily Express, BBC Radio Cornwall and BBC Radio Devon of Natural England’s updated guidance under the Countryside Code for land managers."
        },
        {
            "text": "The refreshed advice, which was created following a process of consultation with stakeholders including the Country Landowners Association (CLA) and Health and Safety Executive (HSE), is a reminder of land managers rights and responsibilities on public land."
        },
        {
            "text": "The new guidance sets out advice on how land managers can make their land  more accessible including using clear signage, keeping rights of way accessible, and alternatives to stiles."
        },
        {
            "text": "Stiles can prevent some people from accessing and enjoying the countryside, including those with mobility issues and certain disabilities. Natural England fully recognises alternatives to stiles are not always practical and stiles are very much part of the fabric of the English countryside. The refreshed land managers code is for guidance only and is consistent with the 25 Year Environment Plan, as well as the approach taken by Highway Authorities."
        },
        {
            "text": "The new code also provides guidance for land managers on how to report anti-social behaviour and better protect livestock."
        },
        {
            "text": "This updated guidance follows an update for the public launched last year in response to a surge in people enjoying the great outdoors during the pandemic. The Countryside Code guidance now applies to all green spaces including coastal walkways and parks in urban spaces, and the public are encouraged to ‘be nice, share the space’ when spending time in the countryside."
        },
        {
            "text": "Marian Spain, Chief Executive of Natural England, said: "
        },
        {
            "text": "Lord Benyon, Minister for Rural Affairs, said: "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}