{
    "url": "https://teaching.blog.gov.uk/2022/02/09/supporting-students-with-anxiety-about-transitioning-from-secondary-school-to-college/",
    "title": "Supporting students with anxiety about transitioning from secondary school to college",
    "authors": [
        "Rebecca Cross"
    ],
    "categories": [
        "Attendance",
        "COVID-19 support",
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2022-02-09T10:28:57+00:00",
    "content": [
        {
            "text": "Rebecca Cross, Head of Worsley College and Kimberley Cash, Vice Principal at Salford City College Group, talk us through the activities and support they put in place over summer to support students transitioning to further education, securing strong attendance rates throughout the autumn term."
        },
        {
            "text": "We know that the transition from school to college can be an exciting but daunting experience for many students, and this has been even more evident after this difficult year. Therefore, prioritising transition support for students and helping to quell their anxieties when making the jump has never have been so important."
        },
        {
            "text": "We had to act quickly to adapt our support offer as, due to Covid-19 restrictions, our options to run preparation activity were limited. To reduce the risk of young people becoming ‘Not in Education, Employment, or Training’ (NEET) across the City of Salford and lessen individuals’ anxieties, it was critical that our college senior leadership team thought innovatively."
        },
        {
            "text": "Engaging young people at risk of becoming NEET "
        },
        {
            "text": "Over the summer term, we worked closely with the local council and secondary schools across Salford to identify prospective students at risk of becoming NEET. We put in place a data sharing agreement with the local council, enabling schools to share information with us about students that had applied to our college. Identifying the young people who may be vulnerable or in need of tailored support was a top priority."
        },
        {
            "text": "Outreach"
        },
        {
            "text": "We visited five main local secondary schools over the summer term, as well as Alternative Provision Centres, and met virtually with students identified as risk of NEET. Upon visiting the schools, we conducted a questionnaire with prospective students, where they indicated how they were feeling about starting college. This also gave them the opportunity to share anything that they felt we should know before they started their time at college, including whether they are, or have previously, struggled with their mental health."
        },
        {
            "text": "Following this, we met with those prospective students and their parents/carers in our colleges to show them around and discuss anything that may impact on their learning journey. Meeting with parents meant we built that important relationship early."
        },
        {
            "text": "Furthermore, being aware of any specialised needs helped us to put in place appropriate support mechanisms, both academic and pastoral, for the rest of the academic year. Relationships were also built with the social care agencies involved to ensure the best possible outcome for the student."
        },
        {
            "text": "Relationship building"
        },
        {
            "text": "Working with the pastoral and learning support teams, we set up meetings over the summer, initially online, to help these prospective students establish a relationship with key support staff."
        },
        {
            "text": "Also, before the term started, several students attended small curriculum taster sessions in college, where they met with teachers in their chosen area. This key contact relationship has been extended into the academic year, helping them to continue to feel supported after the immediate transition period."
        },
        {
            "text": "The impact"
        },
        {
            "text": "We have been able to identify a clear link between our support activity and multiple students who are maintaining strong attendance levels during their first term with us."
        },
        {
            "text": "For example, we have a student who previously had very low attendance levels at school. However, after participating in different forms of our activity, she seems to have adapted to college life very well. We found that her confidence levels particularly increased whilst participating in the team building activities. Currently, despite having some health issues, the student maintains an 95% attendance level."
        },
        {
            "text": "We also have another looked after an attendee with special educational needs, previously identified at being at risk of becoming NEET, maintaining a very good (98%) attendance level. Both her and her foster carer have confirmed that they associate this great start with her taking part in our activities over summer, whilst establishing great relationships with our dedicated support staff, which is fantastic to hear."
        },
        {
            "text": "It is clear the work so far has helped to reduce some of those initial anxieties around college life during the first term so far. We look forward to continuing our transitions work and helping students to feel safe and supported throughout the duration of their time here."
        },
        {
            "text": " "
        },
        {
            "text": "Get support to improve and maintain attendance"
        },
        {
            "text": "Find out more in the Behavioural Insights Team’s how-to guide for increasing attendance with parent messages. For general information and guidance on how schools, trusts and local authorities can maintain high levels of school attendance, you can read our guidance on school attendance, as well as our attendance best practice framework."
        }
    ]
}