{
    "url": "https://marinedevelopments.blog.gov.uk/2025/08/28/american-lobster-reported-along-the-sussex-coast/",
    "title": "American Lobster reported along the Sussex Coast",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Coastal",
        "Evidence",
        "marine conservation"
    ],
    "pub_date": "2025-08-28T15:31:28+01:00",
    "content": [
        {
            "text": "We have had another recent report of a non-native lobster (American lobster - Homarus americanus) brought up in a pot on the Sussex coast near Shoreham. This also follows previous sightings of Atlantic blue crab (Callinectes sapidus) in Brighton.  "
        },
        {
            "text": "In response we ask anyone who catches suspected non-native lobsters to keep the animals (regardless of size) and report the matter to the MMO office at Shoreham on 01273 424849, or take them to a local fish merchant who can alert us to them. "
        },
        {
            "text": "Improved recording and reporting of non-native species like the American lobster is important to help understand current distribution and potential implications if this particular species were to become established. Identification of caught individuals will be confirmed and may be sent for further genetic testing.  "
        },
        {
            "text": "Information on how to distinguish American lobsters from our native European lobster can be found here: ID_Homarus_americanus_American_lobster_final_1214-1.pdf "
        },
        {
            "text": "For details on how to deal with the lobsters once landed please visit the Cefas website. "
        },
        {
            "text": "The MMO appreciates the co-operation of all involved from capture to retail sale in this matter. "
        },
        {
            "text": "Useful links: "
        },
        {
            "text": "ID_Homarus_americanus_American_lobster_final_1214-1.pdf "
        },
        {
            "text": "American lobster prevention » NNSS "
        },
        {
            "text": "Campaign to Retain and Report American Lobsters - Cefas (Centre for Environment, Fisheries and Aquaculture Science) "
        },
        {
            "text": "Spotting and reporting Invasive Non-Native marine species – Marine Development Blog "
        },
        {
            "text": "Non-native crabs and lobsters along Sussex Coast - GOV.UK "
        }
    ]
}