{
    "url": "https://insidehmcts.blog.gov.uk/2025/08/28/behind-the-scenes-at-bristol-crown-court-keeping-justice-moving/",
    "title": "Behind the scenes at Bristol Crown Court: Keeping justice moving",
    "authors": [
        "Sandy Roveri, Head of Legal Operations, South West England"
    ],
    "categories": [
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2025-08-28T13:01:18+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Every morning at Bristol Crown Court, long before anyone enters the courtroom, a dedicated team of operational colleagues are already hard at work. These people make justice possible – the jury managers, ushers, listing officers, delivery managers and court support staff who help ensure that trials run smoothly, jurors feel supported and each day in court serves justice. "
        },
        {
            "heading": 2,
            "text": "The support network"
        },
        {
            "text": "Luke and Beverley from the support team handle an enormous range of tasks daily. They begin around 9am with a team meeting to allocate responsibilities. Beverley, with over 20 years' experience, describes the variety: \"We could be dealing with room bookings, media registers, legal aid, special procedures, booking interpreters for all the hearings, face-to-face and phone enquiries.\"  "
        },
        {
            "text": "Luke highlights the customer service element: \"We deal with a really wide range of people, families of defendants and so on, so that general customer service element is key. "
        },
        {
            "text": "“Court support staff also conduct witness visits, showing victims and witnesses around the court before their hearings. Sometimes it's easy going, sometimes it's not. Sometimes they're scared or crying.\"  "
        },
        {
            "text": "For Ella, a listing officer at Bristol, each day begins with \"a big scheduling mission\". Working one to two days ahead, she creates daily lists that determine which cases will be heard in which courtrooms, when juries will be sent out and how to make best use of resources. "
        },
        {
            "text": "\"It feels like a jigsaw and you're trying to fit it all together,\" Ella explains. \"We have quite big lists here, so it's a lot of courtrooms and a lot of work. The work feels ‘live on air’ – constantly changing. It's all very meticulous.” "
        },
        {
            "heading": 2,
            "text": "Keeping courtrooms running"
        },
        {
            "text": "Alice, a jury manager, also arrives early. She’s responsible for one of the most complex logistical challenges – ensuring the right number of jurors are available for every trial. "
        },
        {
            "text": "Alice and her team, who won an award for their work supporting jurors’ wellbeing, predict how many trials will run, ensure they have the right number of jurors (typically 12 per trial plus around nine ‘buffer’ jurors) then constantly monitor and adjust as circumstances change.  "
        },
        {
            "text": "\"Up to six weeks before, we can increase or decrease our numbers, but after that point, we make do with what we've got,\" she says, before highlighting the value of her work. “I make sure we are running at the best capacity we can, which is important. The more people I have, the more people I can get onto trials to deliver justice.” "
        },
        {
            "text": "While Alice manages the numbers, it's the ushers who provide the human face of the court for jurors and the public. Sylvia, who has been an usher at the court for almost 20 years, begins each day by setting up her courtroom, ensuring everything is tidy and ready. "
        },
        {
            "text": "Before long, Sylvia opens the courtroom doors and the day begins. Being an usher is a skilled role and has a direct impact on how smoothly a court runs. "
        },
        {
            "text": "\"You learn to be a people person,\" says Sylvia. \"You've got to build up rapport because you're with judges, jurors and court staff for weeks.” "
        },
        {
            "text": "Maintaining discretion and neutrality is key when it comes to case content. Despite this, court ushers remain alert to jurors' emotional needs, watching for signs of distress and providing appropriate support without crossing professional boundaries. "
        },
        {
            "heading": 2,
            "text": "The bigger picture"
        },
        {
            "text": "Rachael, a delivery manager with 27 years' experience across HMCTS, oversees one of three teams that keep the court functioning. \"My role is predominantly managing people and any changes happening within the courtrooms,\" she explains. \"I manage all the court clerks and the ushers to ensure they’re able to do their roles effectively and that we’re adhering to the correct processes.\"  "
        },
        {
            "text": "Her commitment to accuracy is evident: \"I'm really passionate about getting it right. We are the biggest Crown Court in the South West and I want us to be what people and other courts aspire to be.\"  "
        },
        {
            "text": "Rachael emphasises the importance of their mission: \"Everyone that walks through our doors is potentially vulnerable. If you get it wrong, there are real-life implications. It's important what we do.\" "
        },
        {
            "text": "For these dedicated operational colleagues, our work is about more than just keeping the courts running – it’s about serving justice and supporting the people who make that possible.  "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Y tu ôl i’r llenni yn Llys y Goron Bryste: Cyfiawnder yn parhau i fynd yn ei flaen"
        },
        {
            "text": "Pob bore yn Llys y Goron Bryste, ymhell cyn i unrhyw un ddod i mewn i’r llys, mae tîm ymroddedig o gydweithwyr gweithredol eisoes yn brysur yn gweithio. Mae’r bobl hyn yn gwneud cyfiawnder yn bosibl – y rheolwyr rheithgor, tywyswyr, swyddogion rhestru, rheolwyr cyflawni a staff cefnogi’r llys sy’n helpu i sicrhau bod treialon yn rhedeg yn esmwyth, rheithwyr yn teimlo eu bod yn cael eu cefnogi a phob diwrnod yn y llys yn gwasanaethu cyfiawnder."
        },
        {
            "heading": 2,
            "text": "Y rhwydwaith cymorth"
        },
        {
            "text": "Mae Luke a Beverley o’r tîm cymorth yn delio gydag ystod enfawr o dasgau dyddiol.  Maent yn dechrau tua 9am gyda chyfarfod tîm i ddyrannu cyfrifoldebau. Mae Beverley, gyda dros 20 mlynedd o brofiad, yn disgrifio’r amrywiaeth: “Gallem fod yn delio gyda threfnu ystafelloedd, cofrestrau’r cyfryngau, cymorth cyfreithiol, gweithdrefnau arbennig, trefnu cyfieithwyr ar gyfer yr holl wrandawiadau, ymholiadau wyneb yn wyneb a dros y ffôn.”"
        },
        {
            "text": "Mae Luke yn amlygu’r elfen gwasanaeth cwsmer: “Rydym yn delio gydag ystod eang iawn o bobl, teuluoedd diffynyddion ac yn y blaen, felly mae’r elfen gwasanaeth cwsmer cyffredinol yn allweddol."
        },
        {
            "text": "“Mae staff cefnogi’r llys hefyd yn cynnal ymweliadau tyst, yn mynd â dioddefwyr a thystion o amgylch y llys cyn eu gwrandawiadau. Weithiau mae’n ymlaciol, weithiau ddim.  Weithiau maent yn ofnus neu’n crio.”"
        },
        {
            "text": "I Ella, swyddog rhestru ym Mryste, mae pob diwrnod yn dechrau gyda “thasg trefnu mawr”. Gan weithio diwrnod neu ddau ymlaen, mae’n creu rhestrau dyddiol sy’n penderfynu pa achosion fydd yn cael eu gwrando ym mha lys, pryd fydd ynadon yn cael eu hanfon allan a sut i wneud y defnydd gorau o adnoddau."
        },
        {
            "text": "“Mae’n teimlo fel jig-so ac rydym yn ceisio rhoi’r cyfan at ei gilydd,” eglura Ella. “Mae gennym restrau eithaf hir yma, felly mae’n llawer o lysoedd a llawer o waith.  Mae’r gwaith yn teimlo fel ‘darllediad byw’ – yn newid yn gyson. Mae’r cyfan yn fanwl iawn.”"
        },
        {
            "heading": 2,
            "text": "Cynnal y llysoedd  "
        },
        {
            "text": "Mae Alice, rheolwr rheithgor, hefyd yn cyrraedd yn gynnar. Mae hi’n gyfrifol am un o’r heriau logistaidd mwyaf cymhleth – sicrhau bod y nifer cywir o reithwyr ar gael i bob treial."
        },
        {
            "text": "Mae Alice a’i thîm, wnaeth ennill gwobr am eu gwaith yn cefnogi lles y rheithwyr, yn edrych sawl treial fydd yn rhedeg, sicrhau bod ganddynt y nifer cywir o reithwyr (12 fesul treial yn nodweddiadol ynghyd â naw rheithiwr ‘byffer’) yna monitro ac addasu’n gyson wrth i amgylchiadau newid. "
        },
        {
            "text": "“Hyd at chwech wythnos cynt, gallwn gynyddu neu leihau ein niferoedd, ond ar ôl y pwynt hwnnw, rydym yn bwrw ymlaen gyda’r hyn sydd gennym” meddai, cyn amlygu gwerth ei gwaith. “Rwy’n gwneud yn siŵr ein bod yn rhedeg gyda’r capasiti gorau gallwn, sy’n bwysig. Po fwyaf o bobl sydd gennyf, po fwyaf o bobl gallaf eu rhoi ar dreialon i sicrhau cyfiawnder.”"
        },
        {
            "text": "Er mai Alice sy’n rheoli’r niferoedd, y tywyswyr sy’n darparu wyneb gyhoeddus y llys i reithwyr a’r cyhoedd. Mae Sylvia, sydd wedi bod yn dywysydd yn y llys ers bron i 20 mlynedd, yn dechrau pob diwrnod drwy drefnu’r llys, gan sicrhau bod popeth yn drefnus ac yn barod."
        },
        {
            "text": "Cyn bo hir, mae Sylvia yn agor drysau’r llys ac mae’r diwrnod yn dechrau. Mae bod yn dywysydd yn rôl fedrus ac mae'n cael effaith uniongyrchol ar ba mor esmwyth y mae llys yn rhedeg."
        },
        {
            "text": "“Rydych yn dysgu bod yn berson pobl,” meddai Sylvia. “Rydych yn gorfod datblygu perthynas oherwydd eich bod gyda’r barnwyr, rheithwyr a staff y llys am wythnosau.”"
        },
        {
            "text": "Mae cynnal disgresiwn a didueddrwydd yn allweddol pan ddaw i gynnwys achos. Er gwaethaf hyn, mae tywyswyr llys yn parhau’n effro i anghenion emosiynol rheithwyr, gan gadw golwg am arwyddion o ofid a darparu cefnogaeth briodol heb groesi ffiniau proffesiynol."
        },
        {
            "heading": 2,
            "text": "Y darlun mwy"
        },
        {
            "text": "Mae Rachael, rheolwr cyflawni gyda 27 mlynedd o brofiad ar draws GLlTEF, yn goruchwylio un o dri thîm sy’n rhedeg y llys. “Mae fy rôl yn bennaf yn rheoli pobl ac unrhyw newidiadau sy’n digwydd o fewn y llysoedd,” eglurodd. “Rwy’n rheoli holl glercod y llys a’r tywyswyr i sicrhau eu bod yn gallu gwneud eu swydd yn effeithiol a’n bod yn cydymffurfio â’r prosesau cywir.”"
        },
        {
            "text": "Mae ei hymrwymiad i gywirdeb yn amlwg: “Rwy’n teimlo’n angerddol iawn am wneud pethau’n gywir. Ni yw’r Llys y Goron mwyaf yn Ne-orllewin Lloegr ac rwyf eisiau iddo fod yr hyn mae pobl a llysoedd eraill yn dyheu i fod.”"
        },
        {
            "text": "Mae Rachael yn pwysleisio pwysigrwydd eu bwriad: “Mae pawb sy’n cerdded trwy ein drysau o bosibl yn agored i niwed. Os ydych yn cael pethau’n anghywir, mae yna oblygiadau bywyd gwirioneddol. Mae’n bwysig beth rydym yn ei wneud.”"
        },
        {
            "text": "I’r cydweithwyr gweithredol ymroddedig hyn, mae ein gwaith yn ymwneud â mwy na rhedeg y llysoedd yn unig – mae’n ymwneud â sicrhau cyfiawnder a chefnogi’r bobl sy’n gwneud hynny’n bosibl."
        }
    ]
}