{
    "url": "https://mhclgmedia.blog.gov.uk/2025/08/28/coverage-of-the-rogue-landlord-report/",
    "title": "Coverage of the Rogue Landlord report",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-08-28T16:35:31+01:00",
    "content": [
        {
            "text": "There has been media coverage today on a new report called the ‘Rogue Landlord’ published by law firm, Duncan Lewis. The report has detailed various ways tenants are being exploited by landlords through dangerous hazards in residences, abuse, and threats of eviction."
        },
        {
            "text": "Key statistics in the report show that more than one in five tenants have been threatened with eviction in the last 12 months and one in 15 renters have been harassed and one in 18 have received verbal threats or abuse in the past year."
        },
        {
            "text": "This exploitation of tenants is completely unacceptable, and we’re determined to stamp out these practices. Through provisions in the Renters’ Rights Bill, we’re giving councils the powers they need to crack down on rogue landlords, and we will go further to strengthen enforcement by giving authorities the power to keep revenue from financial penalties imposed on landlords who flout the rules, so it can be used to fund future enforcement efforts."
        },
        {
            "text": "We’re also extending Awaab’s Law to the private rented sector and introducing a Decent Homes Standard (DHS) for the first time, making sure all rental properties are secure, hazard-free, and meet modern expectations. The landmark Renters’ Rights Bill, which is progressing through Parliament, will set out the legal framework for these standards and give councils the tools they need to enforce them effectively."
        },
        {
            "text": "An MHCLG spokesperson said:"
        },
        {
            "text": "“These findings are extremely concerning, and some of the very serious activity referenced is illegal and should be reported to the police."
        },
        {
            "text": "“We are cracking down on rogue landlords who make tenants' lives a misery, delivering long overdue reform to the private rented sector."
        },
        {
            "text": "“Our Renters’ Rights Bill will protect renters by banning section 21 ‘no fault’ evictions and giving councils stronger powers to crack down on landlords who break the rules - including criminal prosecution."
        },
        {
            "text": "“This is alongside tackling the blight of poor-quality homes by extending Awaab’s Law to the private rented sector and introducing a Decent Homes Standard for privately rented homes for the first time. ”"
        }
    ]
}