{
    "url": "https://mattersoftesting.blog.gov.uk/how-were-tackling-mot-fraud/",
    "title": "How we’re tackling MOT fraud",
    "authors": [
        "Ian Bain"
    ],
    "categories": [
        "Features",
        "MOT testing service"
    ],
    "pub_date": "2025-08-28T12:04:35+01:00",
    "content": [
        {
            "text": "The MOT test sits at the heart of DVSA's mission to keep Britain's roads safer for everyone. "
        },
        {
            "text": "This vital safety check makes sure that over 32 million vehicles tested every year meet the roadworthiness standards that protect drivers, passengers and pedestrians across the country, helping us see only 2% of road incidents being caused by mechanical failings.  "
        },
        {
            "text": "However, despite the clear benefits of the MOT service we do still detect high volumes of fraudulent activity from businesses and individuals who simply don't care about the safety of vehicles they're supposed to be checking.  "
        },
        {
            "heading": 3,
            "text": "What we’ve found  "
        },
        {
            "text": "As professionals in this industry, you understand better than most the critical importance of the MOT as a roadworthiness safety net for vehicles three years or older."
        },
        {
            "text": "As our methods of detection have become more sophisticated, our teams are successfully routing out the bad apples in the industry."
        },
        {
            "text": "As you can see from our latest stats, there has been a steady increase in the number of prosecutions – which will be for serious MOT fraud."
        },
        {
            "text": "Year  Number of successful prosecutions for malpractice in MOT  2024 to 2025  32 2023 to 2024 29 2022 to 2023  18 2021 to 2022 20 "
        },
        {
            "text": "In addition to that we will stop testing at around 300 garages a year (cessations) for not testing correctly – much of which will also include elements of fraud.  "
        },
        {
            "text": "A concerning number of instances where we’ve been required to take action were due to ghost MOTs, which we consider one of the most serious offences an MOT tester can commit. This is when a fraudulent MOT tester provides an MOT pass certificate for a vehicle that they have not seen. "
        },
        {
            "heading": 3,
            "text": "What is DVSA doing to tackle increased malpractice?"
        },
        {
            "text": "Our advances in technology are helping us to identify non-compliance in the industry. For example, we use AI to identify potentially fraudulent activity on MTS. When a fraudulent MOT is being conducted, there are certain hallmarks that the system will flag to us, which can then be looked into by one of our intelligence operators.  "
        },
        {
            "text": "In instances where a tester attempts to conduct a ‘ghost’ MOT, we can utilise ANPR cameras to check if the vehicle was in the area of the garage when the test was being conducted. "
        },
        {
            "text": "When we compare this data with MOT test records, inconsistencies quickly become apparent, particularly in cases where vehicles are being issued pass certificates when they’ve never entered the garage.  "
        },
        {
            "text": "When conducting site visits and investigations, our colleagues are on a truth-finding mission. Their primary purpose is to promote road safety and provide information, education and support to garages when its needed.  "
        },
        {
            "text": "But they also have a responsibility to investigate and act against those who choose to operate outside the rules. "
        },
        {
            "text": "You can find out more about how we conduct MOT site visits by reading our blog: Improving MOT site reviews – here’s what you need to know  – Matters of Testing "
        },
        {
            "text": "Our current “photos of vehicles at MOT” trial to help stamp out ‘ghost’ MOT fraud, combined with our tracking capabilities, create a comprehensive picture of testing activities. We expect this technological capability to continue developing, providing even more sophisticated ways to ensure compliance to protect legitimate testers and businesses. "
        },
        {
            "text": "Find out more: How we’re combating fraud and error within the MOT – Matters of Testing "
        },
        {
            "heading": 3,
            "text": "Highlighting the consequences"
        },
        {
            "text": "The case of Neil Gabbott at Swansey MOT Centre in Chorley demonstrates both the brazen nature of some fraud and our determination to prosecute offenders. Gabbott issued 10 fraudulent MOT certificates for vehicles across the UK, from Scotland to Southampton, seeking quick profits by avoiding proper inspections.  "
        },
        {
            "text": "During a formal interview, Gabbott admitted to issuing fraudulent certificates. The consequences were swift and severe: the testing station was shut down within 24 hours, Gabbott was immediately suspended from testing duties, and he faced court proceedings that resulted in a 12-month community order with 200 hours of unpaid work, plus £2,000 in costs and a £114 victim surcharge. "
        },
        {
            "heading": 3,
            "text": "What this means"
        },
        {
            "text": "Our record-breaking prosecution numbers reflect DVSA's commitment to protecting the reputation of law-abiding MOT testers, integrity of the MOT system and Britain's road safety.  "
        },
        {
            "text": "While we're fortunate that the vast majority of our 67,000 MOT testers do follow the rules and are trustworthy professionals, we will not allow the dangerous few to undermine public safety and your reputations, for their own selfish personal gain.  "
        },
        {
            "text": "MOT fraud doesn't just threaten individual motorists; it jeopardises the public’s confidence in the system. Faulty vehicles that should be repaired slip through unchecked, and the risk of incidents increases dramatically, endangering all road users.  "
        },
        {
            "text": "As ever, we would love to hear from you so please leave us a comment below with any feedback.  "
        }
    ]
}