{
    "url": "https://marinedevelopments.blog.gov.uk/2025/08/28/south-west-marine-ecosystems-2024-marine-planning-contribution/",
    "title": "South West Marine Ecosystems 2024 – Marine Planning Contribution",
    "authors": [
        "Ellie Hoad, Coastal Marine Planner (South West)",
        "Mae van Loaf, Coastal Marine Planner (South West)",
        "Amy Hodgson, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-08-28T09:09:07+01:00",
    "content": [
        {
            "text": "Ellie and Mae, Coastal Planners for the South West Marine Plan areas have recently contributed to the marine planning section of the South West Marine Ecosystems (SWME) 2024 report, published in July. This annual report provides a comprehensive overview of the state of the south west seas, drawing on contributions from a wide range of stakeholders including academics, regulators, and marine users."
        },
        {
            "text": "The marine planning section of the SWME report advocates for marine planning and aims to increase its visibility among public audiences who may not be familiar with marine plans or their value. It also seeks to highlight the challenges and opportunities that marine planning presents, particularly in managing a busy and diverse marine environment."
        },
        {
            "text": "The Marine Planning team have been involved from the very beginning of the yearly SWME process, which begins in the autumn. Initial discussions and scoping took place in autumn 2024, where Ellie and Mae began collaborating with the SWME steering group to shape the direction of the marine planning content to ensure it aligned with the broader themes of the report. This early engagement helped establish a clear and coordinated plan, creating a collaborative approach for working together throughout the year."
        },
        {
            "text": "Throughout the year Ellie and Mae participated in regular steering group meetings which played a key role in coordinating the SWME webinar, annual conference, and report series. These meetings also facilitated ongoing discussions around the development of SWME, including the evolution of the management section."
        },
        {
            "text": "Final edits were completed in summer 2024, in collaboration with internal MMO teams including the Strategic Renewables Unit and Marine and Wildlife Licensing, culminating in the publication of the state of the seas report in July.The inclusion of the Marine Planning section means it is now embedded within a broader management narrative and provides another opportunity to highlight the benefits of marine planning to regional and local stakeholders."
        },
        {
            "text": "From a marine planning perspective, the section serves to outline recent developments in the South West Marine Plans and share relevant evidence projects from 2024. It also encourages collaboration with researchers and academics by showcasing MMO’s evidence needs and processes, with the long-term goal of ensuring that SWME data can be used within the MMO’s reporting systems. This includes upskilling contributors to better understand how their research can support marine planning and policy."
        },
        {
            "text": "Find out more about South West Marine Ecosystems and read the 2024 State of the South West Seas report here."
        }
    ]
}