{
    "url": "https://earlyyears.blog.gov.uk/2025/08/28/understanding-outcome-summaries/",
    "title": "Understanding outcome summaries",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2025-08-28T12:36:00+01:00",
    "content": [
        {
            "text": "We want to make sure children have the best start in life. As part of this, we regulate early years providers to make sure they’re providing safe and secure environments for children to develop and learn in. This means making sure that they meet the requirements for registration, as set out in the early years foundation stage (EYFS) statutory framework. Sometimes, we need to take action to make sure a provider is meeting those requirements."
        },
        {
            "text": "If we receive a concern or notification about a setting, we will risk assess that information to determine our next steps. We may carry out a regulatory visit or set up a telephone call with the setting. Sometimes, we record the information to discuss at the next visit. Following this, we or the provider may need to take action in order for the provider to meet requirements."
        },
        {
            "heading": 2,
            "text": "What is an outcome summary and when do we publish one?    "
        },
        {
            "text": "We’ll always publish an outcome summary if we looked into a concern or notification and we or the provider then took action due to a breach of requirements. This applies to all providers registered on the Early Years Register."
        },
        {
            "text": "An outcome summary contains:"
        },
        {
            "text": "We will update an existing outcome summary if we take additional enforcement action at a later date. We will also do so to show when a provider has met the actions raised."
        },
        {
            "text": "In some situations, providers can object to, or appeal, the action taken against them. In these cases, we still publish an outcome summary and this will state that the provider has the right to challenge our decision."
        },
        {
            "text": "We publish outcome summaries on a provider’s page on our reports website. We keep them there for 5 years, so that current and prospective parents can read about the concerns raised about a setting and the action we’ve taken to rectify them."
        },
        {
            "heading": 2,
            "text": "When we will not publish an outcome summary"
        },
        {
            "text": "There are some situations in which we will not publish an outcome summary. These include when:"
        },
        {
            "heading": 2,
            "text": "Raising a concern about an outcome summary"
        },
        {
            "text": "If you have a concern about us publishing an outcome summary or want to raise a complaint, you can do this by following our complaints procedure."
        },
        {
            "text": "To make sure parents continue to receive up-to-date information, we will not delay publishing an outcome summary if some action is still in progress. However, if the outcome changes once we have completed our work, we will update the existing outcome summary."
        },
        {
            "heading": 2,
            "text": "Where you can find out more"
        },
        {
            "text": "You can read our guidance on outcome summaries, which sets out more detail on the principles for publishing an outcome summary."
        },
        {
            "text": "You can also find out more about the enforcement action we can take in the early years and childcare enforcement policy. "
        }
    ]
}