{
    "url": "https://ukhsa.blog.gov.uk/2021/09/02/a-welcome-return-to-school-for-students-in-england/",
    "title": "A welcome return to school for students in England",
    "authors": [
        "Catherine Falconer"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Giving children and young people the best start in life"
    ],
    "pub_date": "2021-09-02T11:31:06+01:00",
    "content": [
        {
            "text": "As students are welcomed into the new academic year, we know how important schools and colleges are to their health and wellbeing."
        },
        {
            "text": "There are significant risks associated with missed education, for children and young people’s health, wellbeing, attainment and life chances. Whilst the risk of severe illness from COVID-19 infection in children and young people has remained low throughout the pandemic, the vast majority of children and young people who get COVID-19 only have very mild symptoms and some will have no symptoms at all."
        },
        {
            "text": "As staff and secondary school and college students will be taking lateral flow device (LFD) tests as they return in Autumn, it is likely that an initial increase in cases will be recorded.  This should not cause concern about the risk of COVID-19 in schools as these infections are most likely to have been acquired outside of the school setting."
        },
        {
            "text": "We will continue to closely monitor the surveillance data on schools. Keeping community infection rates low will remain crucial for keeping children safe and schools open safely. We urge people to stay cautious to ensure we can protect the education, health and wellbeing of children and young people in the year ahead."
        },
        {
            "heading": 2,
            "text": "Guidance for schools for the autumn term"
        },
        {
            "text": "PHE has worked closely with the Department for Education (DfE) to advise on measures to help reduce the transmission of COVID-19 in schools and a huge amount of work has been undertaken by schools and health and social care to implement them."
        },
        {
            "text": "The principles of COVID-19 measures in schools and colleges are to protect face-to-face education, minimise disruption to education experiences and ensure the response to COVID–19 is proportionate to risk. From the Autumn term, control measures will include:"
        },
        {
            "text": "In addition, students should remember the following important advice:"
        },
        {
            "heading": 2,
            "text": "What happens when a student tests positive for COVID-19?"
        },
        {
            "text": "In the Autumn term, a positive case of COVID-19 and their contacts will be followed up by NHS Test and Trace."
        },
        {
            "text": "Contacts of a confirmed case of COVID-19 in England aged under 18 years and 6 months and/or those fully vaccinated do not need to self-isolate as outlined in the Stay at Home guidance  for households with possible COVID-19 infection."
        },
        {
            "text": "All contacts should take a PCR test whilst they continue attending school or college as normal."
        },
        {
            "heading": 2,
            "text": "Managing positive cases"
        },
        {
            "text": "Plans are in place for managing suspected, confirmed or sustained transmission of COVID-19 in schools. Local support networks - comprised of local authorities, Directors of Public Health, Health Protection Teams and Regional Partnership Teams - will provide support to schools where necessary. Schools can also continue to contact the DfE’s School Helpline on 0800 046 8687 for help and advice."
        },
        {
            "text": "DfE’s operational guidance for schools and contingency framework for managing COVID-19 in education and childcare settings are published online."
        },
        {
            "heading": 2,
            "text": "The impact of COVID-19 vaccination"
        },
        {
            "text": "If you are 16 or 17-years of age, you can now join the millions who have received their vaccine. Ensuring you are vaccinated before the new term starts will reduce the risk of infection and disruption to your education. You will be contacted by the NHS and invited to a local NHS service such as a local GP surgery.  Walk-in COVID-19 vaccination sites are also offering the COVID-19 vaccine to 16 & 17-year-olds. You can find locations of walk-in COVID-19 vaccination sites online."
        },
        {
            "text": "COVID-19 vaccination is also available to children of 12-15 years of age who are vulnerable or who live with someone vulnerable. Further information is provided in the COVID-19 Vaccination Programme.  "
        },
        {
            "text": "Reassuringly, by the end of June the Schools Infection Survey study showed that almost 93% of staff had one dose of a COVID-19 vaccine and over 70% had received a second dose, playing a key role in reducing the risk of COVID-19 in schools."
        }
    ]
}