{
    "url": "https://forestrycommission.blog.gov.uk/2021/09/02/is-your-forest-fit-for-the-future/",
    "title": "Is your forest fit for the future?",
    "authors": [
        "Emily Fensom"
    ],
    "categories": [
        "Climate change and resilience"
    ],
    "pub_date": "2021-09-02T08:00:48+01:00",
    "content": [
        {
            "text": "The evidence to support climate change continues to grow. Last month the Met Office published ‘The State of the UK Climate’ (2020) which assessed the current situation in the UK. Data collated over the past 12 months, as well as the most recent decade were compared to long term climate records. The report confirmed that the UK’s climate is already changing. 2020 was warmer, wetter and sunnier than average and for the first time, 2020 fell into the top 10 years on record for temperature, rainfall and sunshine."
        },
        {
            "text": "According to the IPCC Working Group I report ‘Climate Change 2021: the Physical Science Basis’ published a few weeks later, changes in the Earth’s climate are being observed by scientists in every region and across the climate system. Many of the changes are unprecedented and some impacts such as continued sea-level rise are irreversible over hundreds to thousands of years."
        },
        {
            "text": "The report has been described by IPCC Working Group I Co-Chair Valérie Masson-Delmotte as a “reality check”. It highlights that unless there are immediate, fast acting and large-scale cutbacks in greenhouse emissions, restricting warming to around 1.5°C or even 2°C will not be possible. So what effect will this have on forestry, woodlands and trees?"
        },
        {
            "text": "Well despite the success of current actions, we are still locked-in to a level of climatic change, anticipating weather extremes in the decades to follow. Climate change poses a direct risk to commercial forestry, particularly through increased frequency and severity of drought events, and threats to tree health from pests and diseases. Although some northern areas may become more suitable for tree growth in the future, hotter, drier conditions in the south and east are likely to limit yield for some species."
        },
        {
            "text": "Wildfire, erosion, pressures to intensify production and interaction with other land-uses also threaten commercial forestry. The Independent Assessment of UK Climate Risk led by the Climate Change Committee expects these risks to become more severe in the future. Woodland adaptation planning needs to encourage species diversification, enhanced genetic adaptability and use of drought-resistant provenances. Action is required now to establish climate-resilient species due to long lead times in the forestry sector."
        },
        {
            "text": "We need to better understand what future climate projections may mean for our forests and woodlands. The problem isn’t information. The difficulty lies in translating the facts and figures into an understanding of what our local ecology may look like in 50 years’ time."
        },
        {
            "text": "Last year, Forest Research launched the Climate Matching Tool (CMT) to support forest owners and managers in planning and planting forests that are resilient to both the current and future climates. The Climate Matching Tool allows us to picture what conditions our forests and woodlands are likely to encounter in the future. It does this by matching your chosen location with areas of Europe and the Pacific Northwest which have a similar current climate to our future climate projection in the UK. Take a look at the Climate Matching Tool here: https://climatematch.org.uk/ to explore what the climate of your site may be like in the future."
        },
        {
            "text": "By 2070 – 2080, sites in the south and east of England may have a similar climate to that which we see today in the north and west of France. We would encourage all forest owners and managers to use the CMT to look at their own sites. Looking beyond our borders can help us to anticipate not just future species and genetic suitability, but also the challenges we face from a changing climate."
        },
        {
            "text": "Forests across Europe provide a chilling example as they are already suffering from unprecedented rates of climate change. They illustrate the effect that increasing temperatures can have on tree/pest relationships. This can create ecological, social and commercial problems, particularly with plantation monocultures outside of their ideal climatic range."
        },
        {
            "text": "For example, over the last decade areas in Eastern France and the Czech Republic have seen their spruce forests decimated by a ruthless cycle of eight-toothed European spruce bark-beetle (Ips typographus) outbreaks, killing already drought-stressed trees. The bark beetle population explosion originated from a series of exceptional wind events (almost certainly related to climate change), causing a glut of windblown timber which led to excellent breeding conditions for the beetles."
        },
        {
            "text": "The situation was enhanced by a series of long, warm summers which allowed multiple generations of the beetle to emerge each season.  At the same time, species such as Norway spruce were becoming increasingly drought-stressed by those same long, hot summers and were more susceptible to attack from secondary pests."
        },
        {
            "text": "As well as the obvious effect large-scale felling has on forest ecology, it can also have social and economic implications. Initially there is a surplus of timber, but because a larger cut has been taken than would make commercial sense, there is now a shortage of timber. This is undoubtedly exacerbated by COVID restrictions as timber prices have rocketed and supply has dwindled. None of this helps long-term forestry planning. Dramatic events warn us of the scale of the impacts that we may soon encounter in the UK."
        },
        {
            "text": "Adapting our woodlands and the forestry sector to climate change is perceived as challenging because of long planning horizons and uncertainty. However, we can see the direction of travel and there are some actions that we must take now and over the coming decade to ensure that our trees, woods, and forests continue to provide the goods and services future generations need. Management options to increase resilience of forests should promote a proactive approach, increasing stand diversity and structure in order to adapt to the threat from pests and diseases."
        }
    ]
}