{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/09/02/making-public-policy-more-inclusive/",
    "title": "Making public policy more inclusive",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2021-09-02T12:00:02+01:00",
    "content": [
        {
            "text": "People who work in the public sector are often driven by extraordinary purpose. Policymakers say they are driven by a sense of public duty and do their job because they want to help others. So they need little convincing on the importance of delivering public services that provide citizens with high value. But in practice the path to delivering services that are inclusive can be fraught with challenges."
        },
        {
            "text": "Policymakers value good evidence and use it to underpin the delivery of public services that are meaningful to citizens. They regularly work with experts like analysts, economists, statisticians. But even though policymakers and ministers alike think a holistic evidence base - that includes citizen insight - is a persuasive way to inform ministerial decisions, they rarely include it."
        },
        {
            "text": "This is problematic because if we want a public service or policy to be inclusive, we must fairly understand the needs of people that will use it and how they will respond to the intervention. If policymakers don’t do this, then some groups of citizens might be treated differently from the original policy intent, which ultimately delivers less public value - and just isn’t fair."
        },
        {
            "text": "“How can we ensure that we’re reaching out to not just the people using our system but to those who want to use our system and can’t?” Senior policymaker, large department "
        },
        {
            "heading": 2,
            "text": "Talk directly to people who use your policy or service"
        },
        {
            "text": "The policymakers that we spoke to highlighted two common pitfalls: only talking to a section of citizens, and only talking to stakeholders who represent particular groups or interests."
        },
        {
            "text": "Policymakers sometimes use evidence that does not fairly represent the views of every type of person that will use a policy or service. The problem with this approach is that it requires policymakers to fill in the blanks using assumptions based on their own frame of reference. This risks unconsciously excluding those whose background and experiences differ from their own."
        },
        {
            "text": "“If 90% of individuals say that this is a terrible idea, but that represents 5 people, or maybe it represents 1 million people, but it’s a million men talking about a gender pay gap policy - you shouldn’t listen to them” Senior policymaker, small department"
        },
        {
            "text": "When policymakers describe how they understand citizens, they often talk about working with stakeholders, not people who use a policy or service, like citizens. They don’t consistently understand the difference. Although stakeholder representatives are invaluable for gauging the temperature on an issue, it is rare that they will be able to articulate the day-to-day experience of using a public service as well as the individuals themselves."
        },
        {
            "text": "\"Policymakers talk about people, rather than with people\" Public opinion professional "
        },
        {
            "heading": 2,
            "text": "Build confidence in working with the public"
        },
        {
            "text": "Many policymakers are keen to work with the public but lack the confidence to do so. They are unsure how to deal with citizens who are unsatisfied and are worried about raising expectations. They are not confident or effective at talking to diverse groups of people, who's background and culture differs from their own."
        },
        {
            "text": "“[There’s] discomfort to be that close and personal with members of the public who were going to tell them stories about services ...if policymakers don’t hide behind barriers of language and are not scared, they can have fabulous conversations with the public\" Public opinion professional"
        },
        {
            "text": "To work with the public effectively, policymakers need support and buy-in from senior leaders and ministers."
        },
        {
            "heading": 2,
            "text": "Practical ways to boost the inclusivity of public services"
        },
        {
            "text": "Policymakers have a limited time to affect change. This small window of opportunity is driven by the pace of politics. For citizen insight to be incorporated into the policymaking process we need to provide policymakers with enabling infrastructure to work in this way. Otherwise it will simply be too slow, difficult or expensive for them to articulate the needs of citizens to decision makers."
        },
        {
            "text": "Policymakers experience some common practical barriers in understanding the needs of citizens and how they will respond to initiatives..."
        },
        {
            "text": "Fast track finance, commercial and HR processes - policymakers say that getting access to professional experts, like researchers and designers, is difficult because by the time they have got access to funding and been through commercial and HR processes, it is often too late to mobilise a multidisciplinary team and the policy process is likely to have moved on but with poorer quality of policy advice."
        },
        {
            "text": "“It can take 6 months or more to actually commission and deliver primary research... This is especially frustrating if you have got a new and very dynamic policy and things change on a day-to-day basis almost” Policymaker in a large department"
        },
        {
            "text": "Build research infrastructure - policymakers need fast access to existing evidence about people who use public services. This might include research banks, and ways to share data like a common taxonomy and sharing agreements between public organisations."
        },
        {
            "text": "\"Organisations aren’t incentivised or funded to share privately-stored data about users. This leads to users repeatedly proving the same thing to government\" GDS Discovery, 2020"
        },
        {
            "text": "Policymakers need to be able to quickly conduct new research about citizens too. Establishing citizen research panels or structures like citizen assemblies, makes it much easier for policymakers to work with citizens."
        },
        {
            "text": "Understand the history - policymakers need evidence on the history of the policy area and how it has affected citizens. Without this they can't understand what came before and how that applies to the present, which could lead to failed policy and service ideas, not good ones, being repeated. Policymakers are not practiced at using historical information because there is a lack of institutional memory and systems for accessing, searching, understanding, applying and sharing it. Most policymakers don’t have access to historian experts, with a few exceptions like FCDO."
        },
        {
            "text": "“...an institutional ignorance and thoughtlessness towards the issue of race and the history of the Windrush generation. What I have found ...is a generation whose history was institutionally forgotten” Wendy Williams, Windrush Review, 2020"
        },
        {
            "text": "Policymakers need infrastructure that helps them understand which policies have worked and not worked in the past. These can provide ‘policy patterns’ based around how government works with different groups of citizens that can be re-used, iterated and improved by policymakers from all public organisations."
        },
        {
            "text": "Ensure policy teams mirror the diversity of the communities they serve - policy teams are often not diverse and do not reflect the types of citizens they are making policy and services for, so have limited understanding of their lives. Policymakers who draw on their own frame of reference risk unconsciously excluding those whose background and experiences differ from their own. This could potentially result in bias in the evidence base and to some citizens being treated less favourably than others."
        },
        {
            "text": "“Not enough diversity in terms of race, age, socio-economic background, disability. The lived experience of the civil service is far too homogeneous. If we’re all people who haven’t had that diversity of experience and exposure, you’re not going to reflect the realities of people’s lives” Senior policymaker, large department"
        },
        {
            "text": "Policy teams whose profile reflects that of the community they serve have better instincts for delivering inclusive public services."
        }
    ]
}