{
    "url": "https://defrafarming.blog.gov.uk/2021/09/02/measuring-success-the-role-of-self-assessment/",
    "title": "Measuring success: the role of self-assessment",
    "authors": [
        "Alice Groom"
    ],
    "categories": [
        "environmental land management schemes",
        "Guest post"
    ],
    "pub_date": "2021-09-02T11:56:06+01:00",
    "content": [
        {
            "text": "This is a guest post written by Alice Groom, a Senior Policy Officer at the RSPB."
        },
        {
            "text": "Farmers can play a critical role in tackling the nature and climate crises, but do they also have an important role in assessing the health of the natural environment too? This is the question the Royal Society for the Protection of Birds (RSPB) posed as part of a Defra-funded test and trial."
        },
        {
            "text": "Monitoring and evaluation programmes help determine whether an agri-environment scheme is working. They provide us with data to identify how we can improve the way the schemes work. But these studies are usually conducted by field researchers and ecologists. The RSPB-led test and trial sought to understand whether farmers could help through the self-assessment of their own agri-environment agreements."
        },
        {
            "text": "We worked with farmers from across 2 different landscapes which cover quite different farming and habitat types."
        },
        {
            "text": "In the Norfolk and Suffolk Broads, we worked with farmers who have livestock farms on grazing marsh and wetland, providing habitat for breeding waders and wintering waterfowl."
        },
        {
            "text": "In the Cambridgeshire Fens, most farmers involved had large arable farms, providing a different range of habitats for wildlife. This includes seed and flower rich margins and feeding grounds for internationally important populations of wintering waterfowl such as Whooper and Bewick swans."
        },
        {
            "text": "Farmers were at the heart of the trial, co-designing the metrics they would eventually trial on their farms. The key test was ensuring these metrics were ecologically robust, whilst being time efficient and simple enough to use without specialist knowledge or equipment."
        },
        {
            "text": "Collectively we designed two sets of metrics, one to assess habitats in spring or summer and the other for autumn or winter."
        },
        {
            "text": "The COVID-19 pandemic forced us all to think on our feet and adapt the self-assessment monitoring protocol to keep everyone safe. So, instead of the planned adviser visits to verify the farmers self-assessment, the farmers used a camera."
        },
        {
            "text": "This helped us to expand what we learned – allowing us to determine whether photographs could provide a cheaper alternative to adviser visits to help verify results. By winter our advisers were able to get back out on farms – so we could test both approaches side by side."
        },
        {
            "text": "The results are in! They show that there was very little difference between the farmers’ own assessment and that of the adviser.  This test has shown that for the habitats assessed, self-assessment does appear effective at validating the delivery of wildlife public goods."
        },
        {
            "text": "This is a really important finding, particularly as we see a greater interest in moving to more outcomes or results-based approaches."
        },
        {
            "text": "Feedback from the farmers also demonstrated that self-assessment increased their knowledge and confidence in the management and assessment of their agri-environment options. But also, that they enjoyed the experience."
        },
        {
            "text": "We felt these were significant findings and pointed to the wider benefits of adopting this approach in environmental land management schemes."
        },
        {
            "text": "Alongside a formal monitoring and evaluation programme, self-assessment could provide a means of enabling farmers to verify public goods delivery and move away from an approach to evidence and record keeping that many find time consuming and punitive."
        },
        {
            "text": "We were able to explore the farmers views on the current approach to inspections and evidence keeping. Overall, the perception was very negative. The farmers felt that the current system is too focussed on quantity rather than quality of delivery; a perception that inspectors were there to find fault; and a feeling that current penalties are disproportionate and punitive."
        },
        {
            "text": "However, the participants felt that inspections were still an important part of environmental land management to assess value for money, but the guiding principles of any future inspection regime should be based upon assessing the quality of delivery and supporting improvement."
        },
        {
            "text": "Most farmers stated that public funding will be important to their farm business as Basic Payment Scheme (BPS)  is phased out. Some would consider shifting the focus of their farm business further towards the delivery of public goods if it made good business sense."
        },
        {
            "text": "The future environmental schemes therefore have the potential to play an important role to deliver public goods and ensure that nature-friendly farming pays. This could break down the barriers that have deterred many farmers from participating in agri-environment schemes to date."
        },
        {
            "text": " "
        },
        {
            "text": "Subscribe to the Future Farming Blog for the latest updates on tests and trials."
        }
    ]
}