{
    "url": "https://socialcare.blog.gov.uk/2021/09/02/social-care-recruitment-and-the-covid-19-pandemic/",
    "title": "Social care recruitment and the COVID-19 pandemic",
    "authors": [
        "Bernadette Mossman"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Dementia",
        "Guidance",
        "Information sharing"
    ],
    "pub_date": "2021-09-02T14:53:10+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Finding the safest path through"
        },
        {
            "text": "The COVID-19 pandemic has certainly presented challenges for all of us working in the social care sector. From the pressures of minimising the spread of the virus among vulnerable people in care homes, to increased work pressures on staff, and difficulties in maintaining effective support for home carers, the sector has really struggled to navigate its way through the pandemic."
        },
        {
            "text": "As the effects of the pandemic have begun to die down, one issue to rear its head recently has been recruitment. The challenges I’ve just mentioned have all contributed to difficulties recruiting the skilled staff we need to help us continue to provide effective care."
        },
        {
            "text": "Now that COVID-19 vaccination as a condition of deployment (VCOD) is soon to be introduced, it has become more important than ever to inform and support existing staff and recruit new colleagues with the same awareness and understanding."
        },
        {
            "text": "We’re currently within the 16 week grace period before regulations around vaccines come fully into force. On 11 November, it will become mandatory in England for anyone working in adult care homes to demonstrate they’ve had both doses of the vaccine, unless they have a medical exemption. This has been put in place to maximise protection for colleagues and vulnerable residents and – by extension – the wider community around our care homes."
        },
        {
            "heading": 2,
            "text": "What have we been doing?"
        },
        {
            "text": "At Vida Healthcare we’ve been educating staff through our ‘team talk’ app to reduce fears around the vaccine and encourage take up. This has included hosting walk-in vaccination clinics, sharing government guidance. During the first round of vaccinations we also held Q&A sessions with pharmacists and GPs."
        },
        {
            "text": "Thanks to our efforts, 94% of our care staff have now had the jab and we continue to encourage the remaining few to get vaccinated."
        },
        {
            "text": "In addition, we’ve been driving recruitment forward by hiring nurses from overseas. This has proved extremely successful so far and has really helped us continue to provide high quality care for our residents."
        },
        {
            "text": "We must address the root of the issues around recruitment and understand the reasons people encounter barriers or perceived disincentives to working in social care."
        },
        {
            "heading": 2,
            "text": "What more can be done?"
        },
        {
            "text": "Care providers must not only consider innovative methods of recruitment, including campaigns and the effective use of assets such as social media, but also look at how to best protect current and future staff members from mental and physical ill health."
        },
        {
            "text": "Investing in the careers of social care staff should also attract more people to the sector, as they begin to understand and appreciate the opportunities available."
        },
        {
            "text": "At Vida, we’ve launched our very own training platform, Vida Academy, which offers a range of courses, including a mentorship programme for staff to support new starters, house managers development programme, student placements, and a reinvigorated Care Certificate offer. The Academy promotes lifelong learning across the organisation and establishes staff as dementia ambassadors."
        },
        {
            "text": "We’re currently recruiting for various roles including care assistants (day and night), kitchen assistants, nurses, and wellbeing coordinators. We’re also looking for staff to work in our new state-of-the-art care home, Vida Court, which is due to open 30 September."
        },
        {
            "text": "If you’re interested in joining our team, please visit our site to find out more."
        }
    ]
}