{
    "url": "https://environmentagency.blog.gov.uk/2021/09/02/yorkshire-climate-cafes-help-communities-prepare-homes-to-withstand-future-floods/",
    "title": "Yorkshire ‘climate cafes’ help communities prepare homes to withstand future floods",
    "authors": [
        "Phil Foxley"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2021-09-02T13:30:18+00:00",
    "content": [
        {
            "text": "Climate café events in Hull and York will offer local residents advice on how to physically adapt and prepare their homes for increased flood risk and more frequent extreme weather. Yorkshire Flood Resilience has announced the two events in September as a way of engaging with communities to share advice about practical ways to prepare for flooding by adapting their properties."
        },
        {
            "text": "The climate emergency is a global challenge. In Europe this summer, we have seen record breaking temperatures and devastating life-threatening flooding. Closer to home, the UK will be addressing the climate emergency at the international COP26 conference in Glasgow this year and the impact of more extreme weather that climate change brings is already a very local and personal issue."
        },
        {
            "text": "Flooding happens. More extreme weather from climate change will make flooding more frequent.  Flooding can be distressing but the time and cost of clearing up the damage can be greatly reduced by modifying the buildings we live and work in."
        },
        {
            "text": "Here in the Environment Agency we’re working with local groups to share advice about adapting properties at risk to better withstand floods."
        },
        {
            "text": "There are practical things that everyone can do:"
        },
        {
            "text": "Yorkshire Flood Resilience is hosting the climate cafes with University of Hull’s Energy and Environment Institute and experts from a range of partner organisations, as well as members of the public who have been directly affected by flooding."
        },
        {
            "text": "The events will focus on the increasing risk of flooding, and the significant disruption and damage it can cause, as well as highlighting the role that property flood resilience measures can play in minimising the risk of homes and businesses flooding."
        },
        {
            "text": "Further information about the events can be found on their website. Yorkshire Flood Resilience is one of three Pathfinders around the country trying out."
        }
    ]
}