{
    "url": "https://insidegovuk.blog.gov.uk/2023/12/08/changing-the-gov-uk-proposition-supporting-our-strategy-for-growth/",
    "title": "Changing the GOV.UK proposition: supporting our strategy for growth",
    "authors": [
        "Robert Rockstroh, GOV.UK Policy & Strategy Manager, Government Digital Service (GDS)"
    ],
    "categories": [
        "Vision and plans",
        "What we're working on"
    ],
    "pub_date": "2023-12-08T14:19:14+00:00",
    "content": [
        {
            "text": "GOV.UK is designed to help people access information and services quickly and easily, without needing to understand the structure of government. The GOV.UK proposition supports publishers within government by outlining what information and services belong on GOV.UK. This helps reinforce GOV.UK’s role as the single, trusted home of government information."
        },
        {
            "text": "The proposition takes the form of an overarching document which defines what should, and what should not, go on GOV.UK. We’ve blogged in the past about changes we’ve made to the proposition in response to changing needs - and now we’re iterating it again. Here’s what we’re doing and why."
        },
        {
            "heading": 2,
            "text": "Why we’re updating the proposition"
        },
        {
            "text": "As user needs and departmental requirements evolve, so must GOV.UK. The GOV.UK proposition is reviewed and updated regularly in order to ensure it is aligned with the GOV.UK strategy. These changes can range from factual corrections or clarifications to substantial additions or alterations depending on our work and goals."
        },
        {
            "heading": 2,
            "text": "The GOV.UK strategy for growth"
        },
        {
            "text": "In June we unveiled the GOV.UK strategy for growth, which is a blueprint to expand the GOV.UK offer beyond traditional web experiences to new channels and platforms. The strategy's aim is to reach people wherever and whenever they need government information, embracing new technologies to meet evolving user expectations."
        },
        {
            "text": "For example, we want to develop our presence on social channels, such as YouTube, create new content types, and expand our use of existing formats such as video. Improving the user experience around specific, targeted journeys, and reducing the complexity of our publishing tools, are also among our goals, which we have already started delivering on with the most significant update to our homepage in years."
        },
        {
            "text": "In support of the strategy, a review of the GOV.UK proposition was undertaken, resulting in a number of changes to align with the evolving multi-channel offer."
        },
        {
            "heading": 2,
            "text": "The new changes"
        },
        {
            "text": "We’ve made 5 changes to the proposition, which are as follows:"
        },
        {
            "heading": 2,
            "text": "Our next steps"
        },
        {
            "text": "We’ll review the GOV.UK proposition regularly to ensure it continues to align with the GOV.UK strategy."
        },
        {
            "text": "We are always happy to receive feedback on changes to the proposition. For suggestions or to get involved in the development of the proposition, email govuk-enquiries@digital.cabinet-office.gov.uk."
        }
    ]
}