{
    "url": "https://marinescience.blog.gov.uk/2023/12/08/expanding-the-concept-of-blue-carbon-cefas-science-on-coastal-ecosystems-and-their-role-in-tackling-climate-change/",
    "title": "Expanding the concept of 'blue carbon’: Cefas science on coastal ecosystems and their role in tackling climate change",
    "authors": [
        "Ruth Parker",
        "Michelle Devlin",
        "Julie Bremner"
    ],
    "categories": [
        "adaptation",
        "blue carbon",
        "Climate Change",
        "Deep-sea",
        "marine protected areas",
        "mNCEA",
        "Monitoring",
        "Socio Economics"
    ],
    "pub_date": "2023-12-08T09:57:51+00:00",
    "content": [
        {
            "text": "The importance of mangroves and other blue carbon ecosystems in mitigating the impacts of climate change is once again high on the agenda at this year’s Nature, Land-use, and Oceans Day at the UN Climate Change Conference COP28 in Dubai. Globally, it is recognised that ‘traditional’ blue carbon habitats, such as mangroves, salt marshes and seagrasses lock up large quantities of carbon that would otherwise be released into the atmosphere, further contributing to climate change. New research suggests that other coastal ecosystems, such as marine sediments (including intertidal and subtidal), macroalgae (kelp forests) and plankton could also provide an important source of marine ‘blue carbon’ not yet fully considered in the fight against climate change."
        },
        {
            "text": "Blue carbon habitats in the UK "
        },
        {
            "text": "In the UK, blue carbon habitats typically refer to saltmarsh, seagrass, seafloor sediments, kelp forests, and mangroves found in the British Isles and UK Overseas Territories. As well as capturing and storing organic ‘blue carbon’, these habitats offer a range of benefits, such as providing nursery grounds for a variety of fish species, filtering contaminants and nutrients to improve water quality, and creating a buffer to help protect against sea level rise, flooding, and coastal erosion. Unfortunately, like many blue carbon habitats globally, UK blue carbon habitats are also now seriously degraded. Land use change, dredging, construction, sea level rises due to climate change, and trawling have had impacts on the UK’s coastal and marine ecosystems. Since the mid-1800s the UK has lost 85% of its saltmarsh, resulting in loss of habitat and the release of carbon dioxide into the atmosphere."
        },
        {
            "text": "Evidence suggests that the management, protection, and restoration of blue carbon habitats, through mechanisms such as Marine Protected Areas (MPAs), could play an important role in mitigating and adapting to the impacts of climate change and supporting the UK’s Net Zero commitments. However, while the science in identifying and measuring carbon stocks in terrestrial carbon habitats, such as forests, much less is known about the blue carbon stored in coastal and marine ecosystems and therefore to what extent their management and protection could contribute to nature-based solutions for climate change mitigation."
        },
        {
            "text": "Filling the knowledge gaps"
        },
        {
            "text": "To bridge the knowledge gaps, Cefas is working through the UK Blue Carbon Evidence Partnership (UKBCEP) to bring together science and policy experts from across Defra (Department for Environment, Food and Rural Affairs), the Department for Energy Security and Net Zero, the Scottish Government, the Welsh Government and the Department of Agriculture, Environment and Rural Affairs (DAERA- Northern Ireland) to tackle the barriers in managing, protecting, and enhancing blue carbon habitats in the UK. In a recent report, priority areas to address included:"
        },
        {
            "text": "At the EU level, Cefas is also providing policy and technical advice to the Joint Action on blue carbon which aims to facilitate the exchange of knowledge and innovative research on blue carbon ecosystems across Europe, including the Outermost Regions and Overseas Territories, and is a partner in several EU Horizon Projects investigating blue carbon across European seas (e.g. www.marbefes.eu, www.futuremares.eu)."
        },
        {
            "text": "Seabed carbon"
        },
        {
            "text": "One area in which Cefas is driving forward blue carbon research is on understanding the shelf seabed and how it processes and stores carbon in the long-term. Offshore shelf sediments cover around 9% of our oceans and store large amounts of carbon, however, they are not yet fully recognised as having the potential to contribute to climate change mitigation, and are therefore not protected for this purpose, by international agreements. In the UK, carbon storage and sequestration of the English shelf seabed has been shown to be important for climate regulation, and the existing Marine Protected Area (MPA) network  currently stores a third of all the carbon stored in seabed across the UK."
        },
        {
            "text": " "
        },
        {
            "text": "Under Defra funded carbon management research projects and the marine Natural Capital Economic Assessment Programme (mNCEA), Cefas has been collecting new observations (raw data on seabed carbon stock, sequestration, and condition) in the North Sea shelf sediments. The research also includes developing and testing a blue carbon ‘toolbox’ of methods to help scientists understand where carbon stocks may be at risk due to their vulnerability and when management of carbon in seabed sediments may contribute to climate change mitigation.  We are also assessing the impact of trawling on the relationship between biodiversity and seabed carbon storage, and will use predictive models to explore how different marine management approaches could impact the potential of the seabed to store or emit carbon."
        },
        {
            "text": "Cefas has also been exploring how carbon sequestration acts as a climate regulation service, to understand the potential economic and societal costs if this carbon storage or sequestration service was degraded. For example, a recent paper estimated that damage caused by human activities and climate change over a 25-year period could cost the UK economy up to £10 billion in damages,  due to coastal erosion and loss of key ecosystem services.  A follow up paper explored the need for new accounting guidance and governance frameworks to manage carbon in shelf seas.  A key aim of the mNCEA work is to develop a nationally standardised way of measuring, monitoring, (and hence valuing) carbon stored in the seabed and to develop technical guidance that will build a consistent evidence base to support policymakers and better develop strategies aimed at activity management, including the use of MPAs, to aid their protection and recovery."
        },
        {
            "text": "Seagrasses"
        },
        {
            "text": "Seagrasses are recognised as a highly important coastal habitat for combatting climate change. Some species are up to 35 times more efficient at absorbing carbon than rainforests of the same area, and despite only covering 0.2% of the ocean floor, seagrasses store up to 10% of the ocean’s carbon. Unfortunately, in the UK, seagrasses are threatened by disease, pollution, and physical disturbance from activities such as the anchoring, launching and mooring of leisure boats. While it is estimated that 44% of the UK’s seagrasses have been lost since 1936 alone, efforts to replant and restore seagrasses, such as England’s largest seagrass restoration project have increased with pace."
        },
        {
            "text": "To contribute to the understanding of seagrasses, Cefas has been working with Defra to look at how satellites could provide detailed maps of the condition of seagrass, saltmarsh and mud habitats, a key component of the ‘natural capital’ concept, and use them to understand the impacts of linking land and river management decisions on coastal ecosystems. We have also been exploring how  to harness the power of computer science and colour physics to better survey seagrass and saltmarshes and describe their presence around our coasts and to monitor changes. This has included working with imagery from remotely piloted aircraft (‘drones’), using machine learning and looking at how we can transfer methods used in mobile phone cameras to improve the quality of vegetation imagery."
        },
        {
            "text": "Protecting blue carbon globally"
        },
        {
            "text": "As negotiators seek to reduce greenhouse gas emissions to tackle climate change during COP28, protecting and restoring blue carbon habitats will be one of several important ‘nature-based’ approaches that can help reduce carbon, support adaptation and resilience of coastal communities, and provide jobs and economic benefits. However, there will always be trade-offs. As the concept of ‘blue carbon’ develops and our understanding of blue carbon habitats expands, Cefas will continue to work with UK and global partners to provide evidence- driven solutions to help policy makers and practitioners make the right choices for people and the marine environment and a sustainable future."
        }
    ]
}