{
    "url": "https://actuaries.blog.gov.uk/2023/12/08/inflationary-benefits-inflationary-risks/",
    "title": "Inflationary benefits, inflationary risks",
    "authors": [
        "Christophor Ward - Actuary"
    ],
    "categories": [
        "Analysis",
        "Inflation"
    ],
    "pub_date": "2023-12-08T13:39:27+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is inflation?"
        },
        {
            "text": "Inflation measures the change in prices of goods and services over time."
        },
        {
            "text": "The Bank of England is given a target by the government to maintain annual inflation at 2% (using CPI). The Bank of England’s main tool for achieving this is the base interest rate."
        },
        {
            "text": "The commonly accepted economic theory suggests that raising the base rate encourages saving and discourages spending, therefore reducing the rate of inflation."
        },
        {
            "text": "The general consensus is that a stable level of low inflation is a desirable outcome for most developed economies."
        },
        {
            "text": "This is because people and businesses can be confident when committing to future expenditure, in particular large capital investments. That helps the economy to grow which in turn creates jobs and  prosperity."
        },
        {
            "heading": 2,
            "text": "What’s happened over 2023?"
        },
        {
            "text": "This year has seen high levels of inflation continue to persist from the previous year. Inflation started off the year at its highest level since the early 1980s."
        },
        {
            "text": "Food and energy prices have been highly inflated in a large part due to the ongoing war in Ukraine pushing up grain prices. Russia’s restrictions of the supply of natural gas and oil has pushed up energy prices."
        },
        {
            "text": "The UK also experienced high wage growth inflation over the year as workers look to maintain the purchasing power of their earnings amidst a cost-of-living crisis."
        },
        {
            "text": "Globally there have been supply chain bottlenecks such as microchip shortages which have all kept prices high. Although the rate of inflation has started to decrease over the last few months, prices are still rising, but not as quickly."
        },
        {
            "heading": 2,
            "text": "What is the outlook for inflation?"
        },
        {
            "text": "The general consensus in the market is that inflation will decrease over the rest of 2023 and 2024. It is expected to head towards the Bank of England’s target rate of 2%, as shown by the Office for Budget Responsibility’s (OBR) projection below."
        },
        {
            "text": "There does however remain considerable uncertainty around the size and speed of the fall, similar to what we saw when inflation was increasing since late 2021. At that time market commentators were consistently underestimating the pace and size of inflation increases."
        },
        {
            "text": "This shows the challenges with financial forecasting given the complex dependancies in the numerous factors that directly and indirectly affect inflation."
        },
        {
            "text": "Elsewhere in the world, the US has seen inflation fall more quickly than in the UK and the eurozone."
        },
        {
            "text": "This is thought to be because of the war in Ukraine having a larger impact on Europe and the UK than it does in the US."
        },
        {
            "text": "Meanwhile, China is experiencing deflation which can be just as concerning for governments as high inflation is."
        },
        {
            "heading": 2,
            "text": "What is deflation?"
        },
        {
            "text": "Deflation occurs when the prices of goods and services become cheaper over time, it can be easier to think of it as negative inflation. While deflation may initially sound attractive (we’d all like to pay less for the goods and services we buy), it can cause significant disturbances across financial markets."
        },
        {
            "text": "One problem with deflation is that consumer spending can reduce as people delay purchases in the expectation that they will be cheaper in the future."
        },
        {
            "text": "This then impacts businesses with falls to revenue and they then also look to delay capital investments. This in turn contributes to lower economic growth and creates more deflationary pressure on the economy."
        },
        {
            "text": "Interest rates typically cannot go below zero, so consumers and businesses have to spend a higher proportion of their wealth on paying-off debt. This then leaves less money available for investments and spending, creating further deflationary pressures."
        },
        {
            "text": "A short period of deflation may not concern a government too much. Many businesses would look further ahead with their business planning and forecast expenditure. However, a key element that can exacerbate inflation and deflation is consumer and business confidence in the ability of the central bank and government to maintain a low and stable level of inflation."
        },
        {
            "text": "If the Bank of England is too aggressive with its interest rate rises, the UK could enter a period of deflation. This could mean equities will suffer as investors sell off shares that will not offer satisfactory returns due to earnings being depressed. High quality bonds may see some benefit with low levels of deflation."
        },
        {
            "text": "However, if deflation is high then bonds may become unfeasible by the issuers and defaults could rise."
        },
        {
            "text": "Japan has previously seen a sustained period of deflation over most of the past 25 years and the Bank of Japan had to deploy many measures in attempts to combat it."
        },
        {
            "text": "The cyclical nature of the deflationary environment proved difficult to break, with consumers and businesses holding on to cash rather than spending or investing. This reduced the effectiveness of Japan’s fiscal measures and the Bank’s loose monetary policy."
        },
        {
            "text": "Fiscal measures included increasing public spending and reducing tax rates. The Bank of Japan contributed by increasing the money supply by purchasing debt. However, the banks were reluctant to lend any of this extra money due to a credit crunch, again contributing to deflationary pressure."
        },
        {
            "heading": 2,
            "text": "Inflation volatility"
        },
        {
            "text": "For the time being UK inflation appears to be falling as price shocks over the last few years fall out of the way that inflation is calculated and as the Bank of England has increased the base rate."
        },
        {
            "text": "The base rate can be a blunt tool for controlling inflation. There can be a lag between a base rate change and when the impacts then come through with changing spending habits. This impacts demand for goods and services and their pricing, often taking months to follow a base rate change."
        },
        {
            "text": "This is expected to lead to periods of under and over correction of inflation relative to the target level. There will be further challenges as other factors will continue to have an effect on prices, such as:\nreducing dependence on Russian energy an apparent western desire to reduce dependence on the east for manufacturing geopolitical tensions"
        },
        {
            "text": "All of these will most likely lead to inflation in the UK being different from expected as we move ahead into the next few years."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}