{
    "url": "https://space.blog.gov.uk/2023/12/08/meteor-showers-and-winter-stars-the-night-sky-in-december/",
    "title": "Meteor showers and winter stars: the night sky in December",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-12-08T12:44:04+00:00",
    "content": [
        {
            "text": "The solstice on 21 December marks the start of astronomical winter."
        },
        {
            "text": "The Sun will be at its lowest in the sky, bringing the shortest day and longest night of the year with over 16 hours of darkness."
        },
        {
            "text": "Thankfully this provides plenty of opportunity for stargazing and the winter night sky is full of spectacular sights."
        },
        {
            "text": "The next few weeks also host two of the most prolific meteor showers in the calendar, with the Geminids in December and the peak of the Quadrantids in early January."
        },
        {
            "heading": 2,
            "text": "Meteor Showers"
        },
        {
            "text": "The Geminids meteor shower will be visible all month but is expected to peak around 13 and 14 December, and often produces over 100 meteors an hour."
        },
        {
            "text": "More meteors are likely to be visible after midnight, where tiny fragments of rock and dust left behind the 6km (3.5 mile)-wide rocky asteroid known as 3200-Phaethon will hit our atmosphere at 35km (20 miles) per second."
        },
        {
            "text": "This asteroid’s orbit means that every year and a half, it travels in from beyond the orbit of Mars passing close to the Sun, heating up as it does so, and leaving a trail of dust and fragments of rock that Earth passes through every year on its own journey around the Sun."
        },
        {
            "text": "The Quadrantids is expected to peak around 3 – 4 January. It’s known for producing blue-ish meteors with occasional bright fireballs, so wrap up warm and see if you can spot these meteors blazing through our atmosphere at up to 70km (45 miles) per second!"
        },
        {
            "heading": 2,
            "text": "Winter Stars (part one)"
        },
        {
            "text": "There are some remarkable stars in the winter night skies.  The shoulders of Orion (see framed between the trees in the centre of the photo at the top) are the red-hued Betelgeuse and bluer-hued Bellatrix."
        },
        {
            "text": "Betelgeuse is a red super-giant star that lies around 500 light years is so large that if it was placed at the centre of our Solar System, it would engulf the planets Mercury, Venus, Earth and Mars."
        },
        {
            "text": "Blue-giant Bellatrix is about half that distance away and ‘only’ six times larger than our Sun.  Its life is expected to be significantly shorter than that of our star which at around 4.5 billion years old, is believed to be around half-way through its life.  Bellatrix is believed to be at a similar stage but having only existed for around 25 million years."
        },
        {
            "text": "To the lower-right of Orion lies another blue-giant star.  Rigel is star-system of at least four stars that lie over 850 light years away, but the largest star of the four is understood to be just eight million years old and over 70 times as large as our Sun."
        },
        {
            "text": "Between Bellatrix and the Pleiades star cluster lies the red-giant Aldebaran.  The eye of the constellation of Taurus the Bull is over 40 times larger than our Sun and lies around 65 light years away."
        },
        {
            "text": "While usually the 14 brightest star in our night sky, the motion of the stars around our galaxy brought Aldebaran to just 20 light years away around 300,000 years ago, making it the brightest star in our night sky."
        },
        {
            "text": "Come back next month for the second part of our tour of the remarkable winter stars!"
        },
        {
            "heading": 2,
            "text": "The Moon and Planets"
        },
        {
            "text": "This month, the full Moon appears on 26 December with the Moon lying between the constellations of Auriga and Gemini."
        },
        {
            "text": "Saturn is still visible low in the south-west as darkness falls while Jupiter is much brighter, and higher in the south-east.  Look out just after sunset on 22 December to see an 80%-illuminated Moon just to the left of gas giant Jupiter."
        },
        {
            "text": "Venus rises at around 5:00am and is unmistakably bright, blazing in the south-east and easy to spot until it becomes lost in the glare of sunrise."
        },
        {
            "heading": 2,
            "text": "Also this month…"
        },
        {
            "text": "You might see some headlines this month about one of the most striking stars, Betelgeuse, disappearing from the night sky."
        },
        {
            "text": "Following research that suggests this star may reach the end its life in the next 100,000 years or so, social media is often awash with speculation about whether this red super-giant in the constellation of Orion is about to go supernova."
        },
        {
            "text": "This, however, is different.  On 12 December stargazers in a narrow band around our planet (including southern Europe), will see Betelgeuse be occulted for several seconds by Asteroid 319 Leona, a 70km (45 mile) wide object that orbits the Sun in the asteroid belt between the orbits of Mars and Jupiter."
        },
        {
            "text": "Unfortunately, this perfect alignment of Betelgeuse and Asteroid Leona will not be visible to UK stargazers but it should produce some interesting photos from elsewhere, and astronomers will be using the event to significantly increase our understanding of both objects."
        }
    ]
}