{
    "url": "https://prisonjobs.blog.gov.uk/2023/12/08/nicolas-return-to-the-probation-service/",
    "title": "Nicola's return to the Probation Service",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2023-12-08T10:14:35+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Nicola's return to the Probation Service"
        },
        {
            "text": "The Probation Service is encouraging qualified probation officers who have left the Service to consider returning and to check out the flexible working and great benefits on offer to those working in these important roles."
        },
        {
            "text": "We spoke to Nicola who returned to the Probation Service after a few years out, working for a charity and caring for her young daughter."
        },
        {
            "heading": 3,
            "text": "Tell us a bit about your career journey in the Probation Service"
        },
        {
            "text": "I’d been out of university a year when I first started training as a probation officer. I always wanted to do something like that and it was between probation and social work, I think back in the day they were quite similar."
        },
        {
            "text": "it's funny because this is the only “proper job” I ever had I guess, and I ended up being here for 15 years and becoming a senior probation officer."
        },
        {
            "text": "Why did you make the decision to leave?"
        },
        {
            "text": "It wasn't like a conscious decision that I wanted to leave probation, I wasn’t even looking. It was more that another opportunity came up that was quite interesting, working as a CEO of a small local charity."
        },
        {
            "text": "So there was nothing really that that made me want to leave. it was more like trying something else."
        },
        {
            "text": "The charity was working with victims of domestic abuse, and actually we were contracted to work with female offenders, so I still very much had a close link with probation all of that time. I think that probably helped with leaving and then coming back, because it felt like I never completely severed all ties."
        },
        {
            "text": "So although you were out of the Probation Service for a few years you were actually driven by the same kind of values and job satisfaction outside of the Service too"
        },
        {
            "text": "Yes, I want to help and support people and that's always at the back of my mind, no matter what I'm doing job wise. You know, I probably wouldn't fit in very well in a corporate world!"
        },
        {
            "text": "And what led you to come back?"
        },
        {
            "text": "Being a CEO was quite full on and there's just no way that I could do that kind of job part time so after maternity leave with my little girl I just made a personal decision that I didn’t want to work full time at the moment, it was quite a simple decision really. And I was still a qualified probation officer, so here I am!"
        },
        {
            "text": "I think I always suspected that I might come back. To be honest. You know, I didn't leave in a way that was like, oh, thank goodness I'm out. I'm never going back.. It was more like, oh, I'll just try this out. And you know, I can always go back."
        },
        {
            "text": "Was it straightforward to return?"
        },
        {
            "text": "Yes, I still had a few people that I knew, working in my old team, so I just put the feelers out and then just at the right time, there was an advert that came out for a permanent post. And the role was advertised as full or part time."
        },
        {
            "text": "So now I work “half time” - I do a long Monday so I can do evening appointments if I need to and then two short days, Tuesdays and Thursdays."
        },
        {
            "text": "Have you noticed any changes to the Probation Service in the time you’ve been away? "
        },
        {
            "text": "I think the main changes are on the administrative side of things, just getting to grips with new processes and that kind of stuff, how you used to record this and now you record it that way etc."
        },
        {
            "text": "But I think when you strip it back to the main work, sat in front of offenders, it’s the same really. And you know how to do that."
        },
        {
            "text": "And are you finding that it is still the same kinds of things that are the most rewarding, or the most challenging?"
        },
        {
            "text": "I like the face to face stuff. That's probably what everyone would say. No one likes the admin and sitting in front of their computer screen."
        },
        {
            "text": "I was doing less of the face to face when I was here last because of being in a senior probation officer position and I quite like doing more of that now, as a practitioner."
        },
        {
            "text": "And re the challenges, yes, I suppose you always have the slightly trickier cases, but I don’t mind that really."
        },
        {
            "text": "The Probation Service is working hard at the moment to recruit colleagues within probation teams that can support at all levels, can you talk a bit about the support you get and team working? "
        },
        {
            "text": "Yes, that’s really important. It's a job that's got lots of different aspects to it. So you've got to use all of the people around you and all of their skills."
        },
        {
            "text": "We share advice and best practice throughout the day. That happens all the time and that's really important."
        },
        {
            "text": "All probation officers go through ebbs and flows, people feel stressed and all the rest of it, and you rely on your colleagues. And that’s been pretty good, I think your colleagues are what keeps you going."
        },
        {
            "text": "What would you say to those ex-probation officers who are considering returning to the Probation Service?"
        },
        {
            "text": "I’d say if you enjoyed the job, then you probably will still enjoy the job!!"
        },
        {
            "text": " "
        },
        {
            "text": "The Probation Service is currently recruiting for qualified probation officers across several regions. If you are interested in applying then please visit our vacancy pages here."
        }
    ]
}