{
    "url": "https://moderncivilservice.blog.gov.uk/2023/12/08/the-1-atlantic-square-model-to-building-an-inclusive-office-community/",
    "title": "The '1 Atlantic Square Model' to building an inclusive office community",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Government Reform",
        "Innovation",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2023-12-08T12:00:56+00:00",
    "content": [
        {
            "heading": 6,
            "text": "A guest blog from the Glasgow Community Management team."
        },
        {
            "text": "Building and nurturing a thriving, inclusive community in offices, campuses and hubs across the UK is an essential part of attracting and retaining local talent, while creating an inspiring and collaborative environment supports the delivery of Government’s most ambitious projects. The team at Cabinet Office’s second HQ in Glasgow, Scotland told us, \"We are trying to create a place where people want to come to work\". So how did they do it?"
        },
        {
            "heading": 2,
            "text": "A Modern Civil Service in action"
        },
        {
            "text": "In June 2021, we committed to our vision of A Modern Civil Service which is skilled, innovative and ambitious. Since then, we have made progress on that vision and one of the great examples of reform in action is the establishment of more than 12,000 Cabinet Office roles across the various hubs, campuses and offices around the UK. This ambition — to deliver a Skilled Civil Service that is inclusive and representative of the communities we serve and that provides a thriving presence across the country — is one of our five missions. "
        },
        {
            "text": "Cabinet Office’s second headquarters in Glasgow is just one of the many locations that has grown significantly since early 2022. It started with less than 100 people and this has now increased more than five-fold, with over 500 people now based at the Glasgow office. Over the last 18 months, Glasgow has made significant strides, proving its ambition to put Scotland’s skills and experience at the heart of UK Government’s policy-making and corporate services, and to support UK civil servants based in Scotland."
        },
        {
            "heading": 3,
            "text": "Collaboration is key"
        },
        {
            "text": "On a recent visit, Cabinet Office’s Executive Committee met with staff to discuss the impact and positive difference made by Government presence to communities at a local level, the value this represents to the UK overall, and how the Atlantic Square approach to community building could be replicated in other locations."
        },
        {
            "text": "While the office has a clear purpose which is shared by those who work there, the team told us that it is important for the community to have the room it needs to grow organically, harnessing the natural passion and enthusiasm of those who work there. Fraser Ellis, Commercial Standards and Continuous Improvement Analyst, has been there right from the start and shared his experience of the new office:"
        },
        {
            "text": "“When we moved into Atlantic Square we started the Second HQ Champions, an earlier version of our Community Management Team, to help deliver our priorities around community and collaboration internally. Over the 18 months since then, we have evolved our approach and collaborate with HMRC on our Modern Civil Service breakfast meetup every month and, more recently, the Civil Service Careers Fair at colleges and universities across the country. It has been challenging to find what works, but with each month we’re seeing a flourishing community emerge across 1 Atlantic Square and beyond.\""
        },
        {
            "text": "An example of this is when the team restarted the Modern Civil Service breakfasts started as an informal, friendly and inclusive monthly opportunity for civil servants to discuss how they can improve public services. Each meetup, colleagues from HMRC, Cabinet Office, Scotland Office and Home Office discuss how they can work together to improve communications, share data and build communities. This December, the office will be welcoming colleagues from the Scottish Government, DWP and HMCTS to join the discussion."
        },
        {
            "heading": 3,
            "text": "Let’s get quizzical"
        },
        {
            "text": "A recent Children in Need Christmas Quiz and Bake-off showcased the sense of community in the Glasgow office and how it can make a direct impact for nearby communities. Gordon Rae, Engagement Manager, Government People Group, organised the Children in Need quiz and spoke about his experience since joining:"
        },
        {
            "text": "“I was really keen to get involved in the local network. The two stand out events for me were the Coffee Socials and the Civil Service breakfast. These events introduced me to a peer network in Glasgow, and led to me joining the Community Management Team. I have hosted two quizzes so far; the first coincided with the launch of our Ministerial Suite which enables Ministers to conduct business as usual work from the office. The second was in conjunction with the bake-off where I held a quiz for Children in Need, raising over £100.\""
        },
        {
            "heading": 3,
            "text": "Building a community within a community"
        },
        {
            "text": "Building on the core vision and mission of the Glasgow office, the team have brought a vibrant sense of community which continues to evolve as new colleagues with new ideas from an increasingly diverse background become part of it. The main challenge, as is often the case, is capacity. All of these activities and events, be it social or community outreach, are driven by volunteers and need to be balanced with the requirements of the team’s regular roles. The Community Management Team supports each other by covering events when those last minute meetings or deadlines come forward. "
        },
        {
            "text": "We hope that casting a light on this passionate, grassroots activity highlights how to create an inclusive, inspiring and, most importantly, enjoyable working environment — and we hope that it will provide inspiration to everyone wherever you are based! The Glasgow team is excited about helping other offices, hubs and sites across the UK to build their own sense of community, and sharing hints and tips to make it happen. They’d love to hear from you, so please drop them an email. "
        }
    ]
}