{
    "url": "https://forestrycommission.blog.gov.uk/2023/12/08/why-woodland-management-is-key-to-nature-recovery/",
    "title": "Why woodland management is key to nature recovery",
    "authors": [
        "Kate Tobin"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2023-12-08T09:00:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Our cultural heritage for managing woodlands"
        },
        {
            "text": "Walking through English woodlands, we are surrounded by a story of human endeavour and hope in the face of an unknown future. A forester plans and plants for several generations ahead and this need to predict future markets has led to a range of interesting legacies in our woodlands today."
        },
        {
            "text": "We are surrounded by a wonderful canopy of oaks because they were planted to support wooden ship building, or by overstood oak coppice because the regrowth gave the perfect curve for the keel of a wooden clinker-built fishing boat. While iconic bluebell carpets under hazel coppice are there because we were confident that we would need an endless supply of hazel hurdles for fencing in our sheep. Even our much-loved hedgerows with their beautiful spreading trees are there due to a bureaucratic legacy. In the sixteenth century leases often required the tenant to plant several oak, ash and elm trees for timber every year, leading to the regular punctuation along our skyline today, now sadly depleted by Dutch elm disease and ash dieback. The foresters who planted millions of softwoods for pit props after the First World War could not foresee the collapse of the mining industry many decades later, but they did successfully predict our need for timber for building, fencing, sawn wood and paper."
        },
        {
            "heading": 3,
            "text": "Managing our woodlands and forests today"
        },
        {
            "text": "Our woodlands today, and the foresters who manage them, are providing society with an essential resource. The UK imports a staggering 81% of our timber and wood, making us very vulnerable to fluctuating supplies and prices in an increasingly unstable world. Our domestic production is growing slowly, with Scotland providing over half our output and England providing less than a quarter. Around half the woodlands in England are managed, usually for timber, wildlife, recreation or a combination of those objectives."
        },
        {
            "text": "The UK Forestry Standard (UKFS) ensures that, whatever the primary purpose, consideration and protection are always given to wildlife, water, soils, climate, historic environment and people – and where possible, enhancements are made. In October 2023, a new edition of the UKFS has been published to raise the baseline of good practice further, supporting improvements to natural processes for water and reducing the maximum proportion of a single tree species in new woodlands from 75% to 65%. There are also requirements for more action on deer management to allow our woodlands to establish and regenerate."
        },
        {
            "text": "By considering the following 12 biodiversity factors, as set out in the UK Forestry Standard, during the creation and management of woodlands, we can deliver a thriving environment for woodland associated wildlife:"
        },
        {
            "heading": 3,
            "text": "Woodland wildlife is in decline"
        },
        {
            "text": "Despite an increase in native broadleaved woodlands since the 1970s, the UK’s recent State of Nature Report 2023 records that woodland wildlife has declined in abundance and diversity over the same timeframe. Woodland loss and fragmentation are an important factor, as well as loss of ecological condition and lack of management."
        },
        {
            "text": "In 2020, Forest Research published the first systematic Woodland Ecological Condition assessment. An impressive field survey that established the condition of plots across the country using 15 indicators, including deadwood, veteran trees, open space, plant species and structural complexity. The results show that in Great Britain, only 7% of native woodland stands are in favourable condition with the rest falling below that standard due to a range of factors."
        },
        {
            "text": "Deer and grey squirrel pressure are major factors, with populations of both at an all-time high. Deer damage ground flora and suppress natural regeneration of trees by browsing, which removes the shrub layer where birds nest and insects flourish. Grey squirrels can change the composition of woodland by damaging particular tree species, and of course, by spreading the squirrel pox virus to which the native red squirrels have no immunity. Lack of deadwood is another key reason for poor woodland condition, with the majority of stands containing insufficient levels of standing and fallen deadwood. Deadwood is a vital part of a healthy ecosystem supporting a wide range of insects, fungi and plants, which in turn support a range of birds and mammals. The survey also identified that lack of effective management – creating light, structure and encouraging regeneration – is a key limiting factor to achieving favourable ecological condition."
        },
        {
            "heading": 3,
            "text": "Managing woodlands to improve biodiversity and wider benefits"
        },
        {
            "text": "Managing woodlands well requires managing light levels to create a diverse structure within your woodland, with diversity of plant species on the ground, at shrub height and in the canopy. This can be achieved by harvesting trees sustainably, encouraging regrowth and regeneration, and providing plenty of open space as well as edge habitat where bramble and shrubs grade into high forest. This diversity in plant species and structure supports the food chain of insects, birds and mammals within the woodland by providing a range of food sources and shelter, with niches for nesting, roosting and hibernating."
        },
        {
            "text": "Improving the ecological condition in woodlands also provides nature-based solutions to other environmental problems. Recent research from the University of East Anglia has highlighted the importance of a woodland canopy to wild bees, one of the most significant species in pollinating our food crops."
        },
        {
            "text": "Managing land in systems that are close to nature results in the greatest diversity of species and more abundant wildlife. Predicting future change, especially in terms of climate and taking proactive measures to allow habitats to become more resilient is an important consideration, which is addressed in the government’s Tree Health Resilience Strategy."
        },
        {
            "text": "For woodland wildlife, this starts with protecting, buffering, connecting and carefully managing our ancient woodlands, which now only cover 2.5% of England. By good management of these irreplaceable habitats and restoring natural processes and functions between them, as set out in our policy document Keepers of Time, we offer wildlife the best chance to expand populations and move in response to environmental change."
        },
        {
            "heading": 3,
            "text": "Harvesting trees with nature in mind"
        },
        {
            "text": "Across the wider landscape, regenerative farming (farming with nature and soils in mind) can produce a harvest alongside nature recovery, often through greater integration of trees and crops. Similarly, forestry can produce a crop of commercially valuable trees, when they are integrated within a design that enables the development of natural woodland ecosystems as a framework or foundation stone. Woodlands that were planted in the past using limited tree species or that have never been thinned (by removing some trees so that others can grow bigger and straighter) can rapidly improve for wildlife if we harvest timber in ways that restore natural ecological features."
        },
        {
            "text": "Modern forestry operates over large areas, harvesting trees carefully which brings light to the woodland floor, promoting growth of flora, shrubs and trees that then grow with minimal disturbance until the next thinning cycle. Woodland management can not only boost species abundance, but it can also lead to private investment opportunities to help fund much larger areas of nature recovery, reducing our reliance on government grants. A combination of best practice, targeted management, restoration of native woodlands and bespoke support for species recovery can help us reach our UK targets of halting the decline in species by 2030, reducing the risk of species extinction and restoration of 500,000 hectares of wildlife-rich habitats by 2042 (Environmental Improvement Plan 2023)."
        },
        {
            "heading": 3,
            "text": "How to manage woodland for wildlife and wider benefits"
        },
        {
            "text": "Good techniques for managing woodland for wildlife, as well as tools to work out what species you might find in your woodland and how to assess its ecological condition, can be found in the Woodland Wildlife Toolkit."
        },
        {
            "text": "To understand how managing woodland for wildlife can contribute to nature-based solutions to wider environmental problems, visit Forest Research’s Climate Change Hub."
        },
        {
            "text": "Find more information and helpful resources on our Woodland Management Matters page."
        }
    ]
}