{
    "url": "https://insidedvla.blog.gov.uk/2026/01/28/a-look-back-at-dvla-and-amazon-web-services-awss-knowledge-sharing-event/",
    "title": "A look back at DVLA and Amazon Web Services (AWS)’s knowledge-sharing event",
    "authors": [
        "Simon Cromwell"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2026-01-28T15:04:09+00:00",
    "content": [
        {
            "text": "At DVLA, we’re always looking for ways to improve our digital services. We recently brought together Welsh Local Government and public sector colleagues to share how Amazon Web Services (AWS) is supporting our digital transformation."
        },
        {
            "text": "We also talked about investing in people through digital skills training and career development. It was a great opportunity to share what we’ve learnt over the years with others who have the same mission: delivering better and faster public services."
        },
        {
            "text": "I was proud to speak at an event full of insightful discussions and practical takeaways. In this blog, I’ll share some of what we learnt during the day - the positive impact of cloud technology, the importance of giving back to the community, and how to develop digital talent."
        },
        {
            "text": "It kicked off with Tom Brewer, Head of DVLA’s IT Service Creation, who took us back to 2015."
        },
        {
            "heading": 2,
            "text": "Taking control: how cloud technology transformed our IT services"
        },
        {
            "text": "Tom shared a turning point from 2015, when DVLA reduced our need to hire outside IT companies by developing our own digital skills and capabilities. Alongside our legacy platforms and other serverless systems, we've used the AWS cloud platform to deliver digital public services quicker and more efficiently ourselves."
        },
        {
            "text": "Today, our platform handles 5 billion online interactions a year - things like renewing a driving licence or answering automated enquiries. Shared standards and automation mean less hands-on work, faster results, and simple tools for everyone to use."
        },
        {
            "text": "The impact? Tasks that once took months now take minutes, and we produce more than 500,000 software builds every year."
        },
        {
            "text": "It was fantastic to see attendees consider how these solutions can be adapted to speed up and simplify services across the public sector."
        },
        {
            "heading": 2,
            "text": "Investing in people and giving back to our communities"
        },
        {
            "text": "Next, I shared how we’re developing our people and giving back to our community through outreach activities."
        },
        {
            "text": "I spoke through examples like our volunteer-led Science, Technology, Engineering and Maths (STEM) programme, which inspires young people to build their digital skills. Another great example is our Digital Voices advocacy group, which promotes digital development and career opportunities for colleagues of all backgrounds."
        },
        {
            "text": "My presentation also mentioned our support of the Digital Inclusion Scheme and the UK government’s ‘IT Reuse for Good’ charter. Through this, we’ve donated more than 1,600 laptops to schools and charities across Wales, enabling young people to have access to the technology they need to succeed."
        },
        {
            "text": "These initiatives sparked excellent discussions on how building a strong employer reputation, with the backing of senior leaders, can help to support local communities and attract the next generation of talent to the public sector."
        },
        {
            "text": "This led us on nicely to the final talk, where our Capability and Talent Lead, Craig James, shared how we’re helping to develop our people through our Centre of Digital Excellence (CoDE) development programme."
        },
        {
            "text": "CoDE offers 18 schemes and has helped more than 200 people start their digital careers, regardless of whether they have a background in technology. People often arrive from other professions bringing transferable skills that work brilliantly in technical roles. In some of our teams, half the staff are CoDE graduates!"
        },
        {
            "text": "So, what did our attendees gain from this discussion? Investing in people is just as important as investing in technology, and if they help their own teams grow, they can bring success to their organisations."
        },
        {
            "heading": 2,
            "text": "Working together for better public services"
        },
        {
            "text": "What truly made the day special were the conversations we shared with attendees. Every organisation has unique circumstances, but a lot of common themes came up - embracing new technology, balancing competing priorities, and the ongoing mission to attract and develop digital talent."
        },
        {
            "text": "Our experience has taught us that success doesn't happen overnight - it takes persistent effort, meaningful investment in people, and the courage to embrace change."
        },
        {
            "text": "I’d like to thank AWS for organising this event with us, and everyone who attended. Seeing everyone sharing their knowledge, experiences and ideas reminded us why events like this are so powerful!"
        },
        {
            "text": "Interested in joining us on our digital journey? Learn more about DVLA’s digital professions and read our collection of digital blogs."
        }
    ]
}