{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/28/coverage-of-leasehold-announcement/",
    "title": "Coverage of leasehold announcement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2026-01-28T15:42:57+00:00",
    "content": [
        {
            "text": "There has been significant and widespread media coverage of a major shake-up of the outdated leasehold system, announced by the government yesterday."
        },
        {
            "text": "Over 5 million leaseholders and future homeowners will benefit from stronger control, powers and protections, through the draft Commonhold and Leasehold Reform Bill, which will fundamentally rewire homeownership across England and Wales."
        },
        {
            "text": "As part of the reforms, ground rents are set to be capped at £250 a year, reducing to a peppercorn after 40 years, while new leasehold flats will be banned."
        },
        {
            "text": "The announcement has received widespread national press coverage, with online pieces in The Times, GB News, Metro, Guardian and Bloomberg published directly in the aftermath of the morning announcement."
        },
        {
            "text": "The Housing Secretary Steve Reed also highlighted the positive effects the bill will have on leaseholders – helping millions of people save money and give them more control over their home, on yesterday’s the morning broadcast round. He spoke to Times Radio, Sky News, ITN, BBC Breakfast, GB News and ITV’s Good Morning Britain. While later in the day the Housing Minister Matthew Pennycook spoke to Radio 4’s PM programme about the reforms."
        },
        {
            "text": "There has been further coverage in today’s papers in The Financial Times, Guardian, The Sun, The Mirror and The I, while the announcement is continuing to get pick up and analysis online including social media explainers from Sky News and The I’s Vicky Spratt."
        }
    ]
}