{
    "url": "https://insidegovuk.blog.gov.uk/2026/01/28/how-people-used-gov-uk-in-2025/",
    "title": "How people used GOV.UK in 2025",
    "authors": [
        "Paul Cronk, Senior Performance Analyst, GOV.UK",
        "Dhaval Vadgama, Data Analyst, GOV.UK",
        "Tina Mermiri, Head of Performance Data, GOV.UK Products and Services",
        "Sophie Watson, Social Media and Community Manager, GOV.UK"
    ],
    "categories": [
        "Content",
        "Data",
        "User insights"
    ],
    "pub_date": "2026-01-28T12:28:19+00:00",
    "content": [
        {
            "text": "GOV.UK had a milestone year in 2025 as the shift to a multi-channel experience of interacting with government, that meets users where they are, gathered real momentum. Last year saw the public beta launch of the GOV.UK app, the development of the official GOV.UK social media channels, and the continued improvement and iteration of the GOV.UK website."
        },
        {
            "text": "But what were users looking at and doing across GOV.UK throughout the last 12 months?"
        },
        {
            "text": "Using tools such as Google Analytics, data from the GOV.UK website search engine, and social media insights, teams in the Government Digital Service (GDS) can identify notable trends. This data helps us to understand how we can develop GOV.UK to ensure it continues to meet people’s needs and work well for everyone."
        },
        {
            "text": "In this blog post we’ll share insights about how people used GOV.UK’s channels during 2025 – from finding out about a digital permission to travel to the UK on the website, and engaging with social media posts raising awareness of the second national test of the Emergency Alerts service, to tailoring their experience on the homepage of the GOV.UK app."
        },
        {
            "heading": 2,
            "text": "What we saw on the GOV.UK website"
        },
        {
            "heading": 3,
            "text": "Millions of visits in 2025, with mobile at the forefront"
        },
        {
            "text": "Overall in 2025, the GOV.UK website had 1 billion visits and 2.3 billion page views, with an average of 85 million visits every month. We collect this data only from users who consent to Google Analytics cookies – meaning full numbers are likely to be higher than this."
        },
        {
            "text": "By December 2025, more than half of monthly visits were on mobile at 61% (622 million), followed by desktop at 38% (388 million) and tablet at 1% (12 million). A very small number of users access the website with smart TVs and game consoles. The proportion of visits made via mobiles has increased hugely since GOV.UK was released in 2012, when 13% of visits came this way."
        },
        {
            "text": "External search engines, such as Google and Bing, remain the biggest source of traffic to the GOV.UK website, with around two-thirds of visits originating in this way. The GOV.UK website has however seen a noticeable increase in traffic from AI websites such as Claude.ai, ChatGPT.com, Perplexity.ai and Gemini.google.com. ChatGPT.com is the most common referrer of these sites."
        },
        {
            "text": "GOV.UK website pages with the highest-rising traffic in 2025 included information about the electronic travel authorisation (ETA), a digital permission to travel to the UK which continued to be rolled out during the year. Visits to Get an ETA to visit the UK reached more than 9.8 million. There were also peaks in traffic to pages, and in related searches, on a range of political announcements, news stories and events. The Budget took place on 26 November 2025. There were 190,000 visits across 5 key Budget pages from 22 to 30 November, making it the third busiest Budget since 2020 on the GOV.UK website."
        },
        {
            "heading": 3,
            "text": "International incidents and weather events"
        },
        {
            "text": "Every year sees peaks in activity on the GOV.UK website’s travel advice pages, as people seek essential guidance relating to overseas conflicts, natural disasters and health warnings."
        },
        {
            "text": "In 2025, tensions between India and Pakistan in early May saw weekly visits to the nations’ travel advice pages rise from 1,500 to 54,000 (India) and 1,000 to 24,000 (Pakistan). In October, weekly visits to Jamaica’s travel advice increased from 600 to 22,000 when the island was impacted by Hurricane Melissa, while in October and November, weekly visits to Tanzania’s travel advice rose from 900 to 22,000, coinciding with post-election unrest in the country."
        },
        {
            "text": "Weather events in the UK bring users to the GOV.UK website too. Storm Éowyn, in January 2025, was the UK’s most powerful windstorm for over a decade, according to the Met Office, with a red weather warning issued including all of Northern Ireland and Scotland’s Central Belt. We saw website traffic on search terms that contained the word “storm eowyn”, which took users to a press release that received 2,000 visits and saw a 19% click-through rate."
        },
        {
            "heading": 2,
            "text": "A strong start for the GOV.UK app"
        },
        {
            "text": "The first version of the GOV.UK app was released by GDS in July 2025, starting with features that enable people to have a more customised and persistent GOV.UK experience, ahead of introducing new tools and functionality. By the end of December 2025, there had been 316,000 downloads of the app, more than double the number of downloads seen by early October."
        },
        {
            "text": "The ability to customise the GOV.UK app is proving popular – 85% of users have done this, through choosing favourite topics or adding their local authority to their homepage."
        },
        {
            "text": "Benefits, Driving and transport and Money and tax were the most popular topics users engaged with from July to the end of December, though not always in the same order, while Universal Credit and apprenticeships were among the most searched-for terms in the app."
        },
        {
            "text": "Return users are increasing with time, showing that the app is already a valuable route for accessing government services and information more quickly. They accounted for 46% of all app users by the end of December, with more of them taking advantage of navigation shortcuts, like Pages You’ve Viewed and Previous Searches (36%). Growth also continues among new users, some of which was driven by the introduction of activity promoting the app on the GOV.UK website in October, including a prominent link on the website’s homepage."
        },
        {
            "heading": 2,
            "text": "GOV.UK’s most‑viewed social media posts"
        },
        {
            "text": "GOV.UK now reaches people across 5 official social media channels –Instagram, Facebook, Threads, X and YouTube – sharing timely, trustworthy information and guidance. These channels provide an entry point to GOV.UK in places central to users’ digital lives, and are a vital part of our role in delivering a multi-channel experience. "
        },
        {
            "text": "The numbers from 2025 show just how widely that content travelled. Instagram posts were viewed 2.4 million times, with the GCSE results day grading conversion table leading the way at 360,000 views."
        },
        {
            "text": "Facebook saw an impressive 9 million views overall, driven by the Emergency Alerts test reminder, which alone was viewed 1.9 million times. Threads generated more than 3 million views, with the year’s bank holidays post topping the list at 461,000 views."
        },
        {
            "text": "On X, GOV.UK content reached 19.8 million views, and its most-seen post –changes to the National Living Wage – attracted 2.3 million views. YouTube added a further 179,900 views, with the Emergency Alerts System test video drawing in 27,700 of them."
        }
    ]
}