{
    "url": "https://competitionandmarkets.blog.gov.uk/2026/01/28/improving-the-way-google-delivers-search-services-in-the-uk/",
    "title": "Improving the way Google delivers search services in the UK",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "Digital Markets Unit"
    ],
    "pub_date": "2026-01-28T10:00:54+00:00",
    "content": [
        {
            "text": "The digital markets competition regime allows the CMA to design proportionate, targeted interventions to address specific issues. Our strategy is purposeful and pragmatic – rooted in real world context, leveraging the unique design of the UK regime to deliver tangible benefits for the UK economy. Throughout, the CMA is applying its ‘4Ps’ - proportionality, pace, predictability and process – to ensure we avoid hampering innovation or creating uncertainty for businesses and investors."
        },
        {
            "text": "Today we’re proposing a package of measures to improve how Google delivers search services in the UK. Our goal is to support innovation and growth, ensure people benefit from a high-quality digital experience, deliver fairer outcomes for content publishers and help businesses and consumers make active, informed choices. This is an important milestone, as these are the first set of conduct requirements under the digital markets competition regime."
        },
        {
            "heading": 2,
            "text": "Why Google’s search services matter"
        },
        {
            "text": "Google handles more than 90% of general search queries in the UK. Millions of people rely on it as a gateway to the internet, and over 200,000 UK firms spent more than £10 billion on Google search advertising last year. Search is central to the economy and everyday life – and increasingly relies on AI-generated responses – so it is essential that competition works well."
        },
        {
            "heading": 2,
            "text": "Our proposed measures"
        },
        {
            "text": "In June 2025, we set out a roadmap of potential measures. We are now consulting on the detailed design of those we have prioritised, focusing on 4 areas:"
        },
        {
            "heading": 3,
            "text": "1. Publisher content"
        },
        {
            "text": "We want publishers to have greater choice, transparency and attribution in how their content is used in Google’s AI features, such as AI Overviews. We propose that Google should:"
        },
        {
            "text": "These measures will give publishers – including news and other content producers – stronger bargaining power and support the long-term sustainability of trusted information online. They will also help people verify sources in AI-generated results and build trust in what they see."
        },
        {
            "heading": 3,
            "text": "2. Fair ranking"
        },
        {
            "text": "We want Google’s approach to ranking search results – including AI-generated results – to be fair and transparent for businesses. Our proposals would require Google to:"
        },
        {
            "heading": 3,
            "text": "3. Choice screens"
        },
        {
            "text": "We want it to be easier for people to choose and switch their search service. We propose that Google should:"
        },
        {
            "heading": 3,
            "text": "4. Data portability"
        },
        {
            "text": "We want people and businesses to be able to make better use of their search data."
        },
        {
            "text": "We propose that Google should place its existing data portability tool on a legal footing. This will ensure that people can continue to transfer search data between services or use third-party tools alongside Google’s products."
        },
        {
            "text": "This measure will give certainty to innovative start-up and scale-up businesses so they can invest and innovate in new data-driven services. Businesses could also help people use their own search data to get discounts, rewards, useful insights, or other benefits."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We are inviting views on these proposed requirements and, after reviewing responses, will confirm any measures to be imposed on Google."
        },
        {
            "text": "We also continue to assess the other measures in our June 2025 roadmap. Those not identified as early priorities remain deprioritised. In relation to publishers, we will wait for 12 months to see the impact of our initial measures before deciding whether to take further action in ensuring they receive fair and reasonable terms for their content. Other potential measures relate to action in other jurisdictions, including the US (where a final remedies judgment in an important case was made in December) and the EU (where, amongst other things, Google’s compliance with a requirement about self-preferencing is being investigated). We are assessing what these developments mean for the UK."
        },
        {
            "text": "Future decisions will be guided by the CMA’s prioritisation principles and government’s Strategic Steer."
        }
    ]
}