{
    "url": "https://ofsi.blog.gov.uk/2026/01/28/ofsi-and-partners-clamp-down-on-the-abuse-of-cryptoassets/",
    "title": "OFSI and partners clamp down on the abuse of cryptoassets",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2026-01-28T11:59:31+00:00",
    "content": [
        {
            "text": "Sanctions enablers are increasingly turning to cryptoassets to move and hide illicit funds, including those linked to sanctions evasion. But every transaction leaves a trace. By working together, UK agencies are following those traces to identify, investigate and disrupt criminal activity."
        },
        {
            "text": "The Office of Financial Sanctions Implementation (OFSI) is working closely with UK law enforcement and regulatory partners to tackle the abuse of cryptoassets and associated money laundering activities."
        },
        {
            "text": "Recently, OFSI joined forces with the Crypto Cash Fusion Cell (CCFC) to target criminal funds linked to sanctions offences. The CCFC is a pilot, multiagency initiative that brings together the National Crime Agency, the Metropolitan Police Service, His Majesty’s Revenue and Customs, the Financial Conduct Authority, City of London Police and OFSI. The aim is to improve how the UK enforcement and regulatory community identifies, understands and responds to criminal abuse of cryptoassets."
        },
        {
            "text": "OFSI shared detailed intelligence with the CCFC to enable joint working against specific, prioritised targets. This led to action against potential breaches of financial sanctions involving cryptoassets by UK-based individuals. The collaboration, which involves law enforcement, regulators and private sector partners such as blockchain analytics provider Elliptic, is enhancing our understanding of the threat and supporting joint learning across partners. During a short, focussed, analytical operation, UK law enforcement, government agencies and the private sector worked side-by-side sharing intelligence in real time and rapidly turning data into operational outcomes."
        },
        {
            "text": "The message for the sector is clear: the use of cryptoassets to evade sanctions is treated no differently to the exploitation of traditional currencies. OFSI stands ready to investigate and pursue sanctions offences involving cryptoassets, alongside partners from across government, law enforcement and industry, as our intelligence continues to be developed. OFSI’s collaboration with the CCFC marks an important step forward on working operationally against the abuse of cryptoassets."
        },
        {
            "text": "To find out more about OFSI’s work on clamping down on the abuse of cryptoassets, read OFSI’s Threat Assessment Report on sanctions compliance in the Cryptoassets sector"
        }
    ]
}