{
    "url": "https://environmentagency.blog.gov.uk/2026/01/28/time-to-adapt-helping-coastal-communities-prepare-for-a-changing-coast/",
    "title": "Time to Adapt: Helping Coastal Communities Prepare for a Changing Coast",
    "authors": [
        "Julie Foley, Director of Flood Risk Strategy & National Adaptation at the Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2026-01-28T11:12:07+00:00",
    "content": [
        {
            "text": "From seaside towns to quiet rural stretches, England’s coastline is one of the country’s most valued assets. It is home to thriving communities, beautiful landscapes and vital infrastructure that we all rely on. But the coast is also one of the places where the impacts of climate change are being felt most clearly."
        },
        {
            "text": "Coastlines naturally change over time, but rising sea levels and more frequent storms are accelerating erosion and putting increasing numbers of people at risk. For some communities, these pressures are not a distant concern — they are being experienced right now."
        },
        {
            "text": "The National Coastal Erosion Risk Map developed by the Environment Agency shows that around 3,500 homes could be at risk of erosion by 2055, even with today’s coastal defences in place. Without the long-term actions set out in Shoreline Management Plans, that number could rise to 32,800."
        },
        {
            "text": "Even with plans implemented, by 2100, nearly 20,000 properties may still face erosion risk. Worryingly, one in six of these homes are in the country’s most deprived areas, meaning the impacts of coastal change fall disproportionately on those with the fewest resources."
        },
        {
            "text": "That is why the Environment Agency and Defra are launching a major new initiative — the £30m Coastal Adaptation Pilots — to help coastal communities plan ahead and prepare for a safer, more resilient future."
        },
        {
            "text": "Why we need to plan ahead"
        },
        {
            "text": "We need to manage coastal change and not just resist it. That is why since 2022, the Environment Agency has managed the Coastal Transition Accelerator Programme (CTAP), working in partnership with communities such as East Riding of Yorkshire and North Norfolk. These projects have supported some of the most vulnerable communities to adapt and transition away from parts of the coast that cannot be defended in the long term."
        },
        {
            "text": "Through CTAP, projects have:"
        },
        {
            "text": "The lessons from these projects are clear: planning early, rather than reacting in an emergency, reduces uncertainty, avoids disruption and saves money in the long run."
        },
        {
            "text": "The new Coastal Adaptation Pilots will build on these strong foundations, testing more advanced and innovative ideas while extending support to more communities at risk from coastal erosion."
        },
        {
            "text": "Introducing the £30m Coastal Adaptation Pilots"
        },
        {
            "text": "The Coastal Adaptation Pilots will run from 2026 to 2029, supported by up to £30 million of government funding. The pilots will focus on three key aims: supporting the places facing the greatest erosion risk, testing practical solutions that communities can benefit from now, and building the evidence needed to shape future national policy and long-term funding."
        },
        {
            "text": "To do this, the funding is split into two strands, reflecting the fact that different communities are at different stages of readiness when it comes to coastal adaptation."
        },
        {
            "text": "Up to £18 million will be invested in advanced coastal adaptation in East Riding of Yorkshire, Suffolk and Norfolk— areas that face some of the highest levels of coastal erosion risk in the country."
        },
        {
            "text": "These places are well placed to act quickly. They have experienced teams, strong relationships with their communities and a solid evidence base built up over many years of monitoring and evaluation. This means they can hit the ground running, delivering practical, value-for-money actions over the next three years. In some locations, this could include selective property purchase where there is both community support and a clear benefit to the public purse."
        },
        {
            "text": "Alongside this, up to £12 million will support coastal adaptation readiness across England. This funding will be allocated through Regional Flood and Coastal Committees (RFCCs), based on the number of homes at highest risk of erosion in each area."
        },
        {
            "text": "This strand will help fund smaller, early-stage actions that can make a real difference on the ground. That could mean relocating or adapting community buildings and car parks, making minor changes to public infrastructure, creating temporary safe spaces for communities or nature in erosion zones, or testing new approaches such as early warning systems."
        },
        {
            "text": "All projects will be aligned with the strategic long term management approaches in the Shoreline Management Plans."
        },
        {
            "text": "The lessons from these pilots will directly inform future coastal policy, helping create sustainable long‑term funding models and ensuring the latest science and evidence are fully reflected in local planning."
        },
        {
            "text": "What happens next"
        },
        {
            "text": "Over the coming months, the Environment Agency will work closely with East Riding of Yorkshire, East Suffolk, Great Yarmouth and North Norfolk councils and the RFCCs to refine plans and prepare for delivery from 2026."
        },
        {
            "text": "By combining advanced adaptation with practical readiness actions, the Coastal Adaptation Pilots will help more communities take earlier, more confident steps towards a safer and more resilient future on our changing coast. Together, they will help coastal communities move from reacting to erosion impacts to planning ahead for a changing climate."
        }
    ]
}