{
    "url": "https://gdsgeospatial.blog.gov.uk/2026/01/28/towards-a-comprehensive-national-underground-asset-register-integrated-into-the-existing-ecosystem/",
    "title": "Towards a comprehensive National Underground Asset Register, integrated into the existing ecosystem ",
    "authors": [
        "Mehul Doshi, Head of Strategy - National Underground Asset Register"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2026-01-28T15:08:38+00:00",
    "content": [
        {
            "text": "The goal of the National Underground Asset Register (NUAR) is to make street works safer and more efficient by bringing together underground asset data in a standard form, securely accessible in one place. "
        },
        {
            "text": "Informed by extensive consultation, we are designing regulations that ensure that the data in the register is consistent and comprehensive. "
        },
        {
            "text": "We’re also ensuring that the register is ready for integration into existing processes designed to support safety, and working on proposals to ensure that anyone who needs access to the data to support safe working can do so, subject to strict access and security controls. "
        },
        {
            "heading": 2,
            "text": "Listening to the views of the sector "
        },
        {
            "text": "Last year, we asked for public feedback on the first set of proposals to put parts of the Data (Use and Access) Act 2025 into action for NUAR. These new proposals will update current requirements and add new ones for asset owners, making sure they keep records of important information about their underground apparatus in a consistent way. "
        },
        {
            "text": "We received 103 responses from a broad range of groups, including councils, devolved governments, utilities, contractors, trade bodies, and professionals. GDS would like to thank everyone who contributed. We have analysed the responses and are working to make  sure that our regulations align with the input received. We will issue a response to the consultation once our regulations are finalised so we can provide clarity around the final legislative frameworks. "
        },
        {
            "heading": 2,
            "text": "A comprehensive register "
        },
        {
            "text": "The regulations will require undertakers to enter specified information about their apparatus into NUAR and keep this up to date as it changes. This will ensure a comprehensive and current record of information about these apparatuses to support street works in England, Wales, and Northern Ireland. "
        },
        {
            "text": "Ordnance Survey, the service operator for NUAR, will continue to support asset owners to bring their data onto the service and adopt NUAR into their working practices. Recently, Openreach, the UK’s largest broadband network provider, joined NUAR meaning that over 80% of known underground assets are now mapped in the service. "
        },
        {
            "heading": 2,
            "text": "Integrating with the ecosystem "
        },
        {
            "text": "We recognise the importance of existing safe digging processes and practices and the expertise that exists across the sector to support them. Access to accurate and up to date information is only one aspect of safe digging. Effective communication between the parties planning and carrying out works is vital. The owners and operators of assets hold the definitive view of the risks posed by works in the vicinity of those assets.  "
        },
        {
            "text": "Asset owners can already provide detailed guidance and targeted instructions to users of NUAR, but one area where we are strengthening integration is through Notification of Works. This will notify an asset owner, or a third-party service provider nominated to act on their behalf, when an enquiry is made near their assets. This will enable asset owners to carry out risk assessments and provide targeted guidance on safe working practices where needed and ensures that those existing processes are still followed. "
        },
        {
            "text": "This approach, based on collaboration and open standards, will support sustainable integration into a broad and diverse ecosystem made up of many asset owners, stakeholders and service providers, providing flexibility and room for growth and improvement. Please read this blog by Ordnance Survey if you would like to understand more about the Notifcation of Works roll out plan."
        },
        {
            "heading": 2,
            "text": "Added flexibility and scope for innovation "
        },
        {
            "text": "As well as that targeted integration with the safe dig ecosystem, we’re also exploring options for even more flexible and widespread integration of NUAR data by developing secure Application Programming Interfaces (APIs) to allow different systems to share information automatically. This will encourage flexibility, innovation and support the development of value-added services. "
        },
        {
            "text": "Security remains of paramount importance in the development of APIs of course, and the secure-by-design approach that has been applied to the NUAR service to date continues in this space. The same strict security controls that apply to access to and usage of the NUAR platform will be applied to any future usage of APIs. We’ve also done a lot of work on how we could provide different levels of detail via different APIs in the future. Not all users and use cases require a full level of detail of course. In fact, too much detail can be confusing and distracting in some cases, and we always seek to provide exactly the right amount of information for a given purpose. "
        },
        {
            "text": "A secure sandbox environment for testing access will be created using synthetic data, allowing authorised asset owners, public sector bodies, service providers and innovators to experiment with APIs in a safe environment and to provide feedback for their further development and future deployment. We’re excited to test use cases established through the Discovery project and see further innovations the market can come up with. Insights from the consultation and sandbox testing will inform subsequent regulations and service iterations.  "
        },
        {
            "heading": 2,
            "text": "Expanding access to NUAR to deliver benefit for everyone "
        },
        {
            "text": "We are dedicated to working collaboratively with the underground asset sector to ensure that NUAR continues to meet industry needs. Engagement with stakeholders has highlighted that secure, broadened access to NUAR will deliver substantial economic, safety, and operational advantages.  "
        },
        {
            "text": "It has the potential to generate £28 million of benefits annually by reducing accidental asset strikes and improving efficiency for asset owners and data consumers. Wider access will enhance public safety, support emergency response, and empower communities with better information for land use and development. NUAR further streamlines data sharing, eliminates the need for multiple systems, and fosters innovation through new tools and services enabled by APIs. "
        },
        {
            "text": "Our plans for the next two years include extending NUAR access to new user groups and for additional use cases. This will be done in a phased manner, prioritising the areas of greatest benefit to safe excavation. "
        },
        {
            "text": "A public consultation on proposals is planned for spring 2026, with secondary legislation required to enable expansion of access. "
        },
        {
            "text": "The proposed expansions may include allowing access to: "
        },
        {
            "text": "Any extension of access will be developed in close cooperation with security stakeholders to ensure robust safeguards are in place. Ordnance Survey will lead the design and development of enhanced services and functionality to accommodate diverse user needs while maintaining strong security standards. "
        },
        {
            "text": "Regulations for extending access are proposed to be fully implemented by April 2028, ensuring all enhancements are established before asset owners are directly charged for the operation of NUAR. "
        },
        {
            "text": "Our initial priorities for expansion are: "
        },
        {
            "text": "We will aim to implement the proposed interventions as soon as feasible to maximise the value NUAR delivers across the street works community and beyond. In doing so we are committed to maintaining high standards of data security and quality. "
        },
        {
            "heading": 2,
            "text": "Comprehensive; Integrated; Flexible; Purposeful – and Secure "
        },
        {
            "text": "To summarise, we have set out plans for the next steps and future direction of NUAR as a statutory register, as always driven by consultation and collaboration. These include: "
        },
        {
            "text": "Our plans will allow NUAR to more effectively integrate into the wider landscape and create the potential for an ecosystem of innovative services to develop around NUAR, while maintaining a security-first approach. "
        },
        {
            "text": "Please reach out to geospatial@dsit.gov.uk  if you have any comments on this blog or the items it covers. "
        },
        {
            "text": "You can also sign up to get an email notification every time we publish a new blog post. More information about NUAR can be found on gov.uk or follow us on LinkedIn.  "
        }
    ]
}