{
    "url": "https://environmentagency.blog.gov.uk/2021/07/14/bio-diversity-is-buzzing-at-denver/",
    "title": "Bio diversity is buzzing at Denver!",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Our staff"
    ],
    "pub_date": "2021-07-14T10:02:22+00:00",
    "content": [
        {
            "text": "By Ben Di Giulio, a floods and coastal risk management officer for Norfolk. "
        },
        {
            "text": "I'm in the very fortunate position to say I thoroughly enjoy my job and get great satisfaction from it. I'm a Floods and Coastal Risk Management (FCRM) officer co-managing the Environment Agency’s flagship flood defence the Denver complex in west Norfolk."
        },
        {
            "text": "A big part of managing the Denver complex is the amount of land it physically takes up which is in the hundreds of acres. At the heart of everything I do is biodiversity and how we can continually educate ourselves to do more and be better."
        },
        {
            "text": "Our most recent addition to the complex is bee hives. Around two years ago I began to develop a deep interest in bees and their decline. After quite a bit of research I noted we had the opportunity at Denver to really help the bee population; it was just a case of figuring out what we could incorporate to do more."
        },
        {
            "text": "Firstly, we successfully secured some funding to purchase and install some on-site bee habitats. These mimic a hollowed out tree and provide a safe and ideal environment for a colony of native bees to become established undisturbed."
        },
        {
            "text": "Once they arrived I was keen to learn even more, gaining knowledge and working towards the goal of ultimately becoming a beekeeper. This was finally realised a few months back when I established the knowledge and confidence to build my first National beehive and transfer a colony of Norfolk bees into it. Coming from a farming background, I’m quite used to the husbandry involved with keeping various livestock. However, I can honestly say there’s nothing even close to the experience of keeping bees. It’s quite involved, complex and there’s a lot of science to it, but it’s an extremely rewarding process."
        },
        {
            "text": "So far, I can take great satisfaction in reporting that the bees are growing and doubling each week. The queen is laying lots of eggs, it’s a healthy colony and I’ve increased the complex bee population by around 3,000 bees."
        },
        {
            "text": "We also have a booming bat population and thanks to our hard work closely monitoring invasive species, native water birds have made a huge comeback to the area. We now have nesting Great Crested Grebes once more, nesting swans, Moorhens, coots and even the odd bittern."
        },
        {
            "text": "Every day I’m learning and trying to do more, looking for opportunities to help the Denver complex be a flagship for the Environment Agency, in terms of increased habitat and biodiversity."
        },
        {
            "text": "I’d really like to take this opportunity to give a big thanks to my line manager, Rupert Wilson, who without his encouragement and support towards my ideas none of this would have been possible."
        },
        {
            "text": "Make changes to your garden during bees needs week, read how here: https://www.bumblebeeconservation.org/bees-needs/."
        },
        {
            "text": "Follow the Environment Agency on Twitter, and sign up for email alerts."
        }
    ]
}