{
    "url": "https://securityprofession.blog.gov.uk/2021/07/14/my-journey-as-a-level-4-cyber-security-apprentice/",
    "title": "My Journey As A Level 4 Cyber Security Apprentice",
    "authors": [
        "Government Security Profession"
    ],
    "categories": [
        "Apprenticeships",
        "Job",
        "jobs",
        "Professionals",
        "Training and qualifications"
    ],
    "pub_date": "2021-07-14T09:56:52+01:00",
    "content": [
        {
            "text": "I have recently finished my level 4 Cyber Security Technologist apprenticeship at HMRC where I currently work as an analyst. "
        },
        {
            "text": "My Application"
        },
        {
            "text": "I started this apprenticeship, a year after leaving sixth form, as I knew I didn’t want to go to University, but wasn’t exactly sure what I wanted to do."
        },
        {
            "text": "Seeing the advert for the level 4 apprenticeship piqued my interest straight away and the more I read through it, the more I knew I wanted to apply."
        },
        {
            "text": "After applying, I was asked to complete a one-sided video interview, which was a first for me as I was just sitting in my room talking to my computer with no one on the other side. Soon after, I heard I passed the video interview and was invited to an assessment centre. "
        },
        {
            "text": "The assessment centre consisted of various tasks including a presentation, team exercise and a formal interview. Although the experience was new and challenging, I left feeling confident in my display of abilities. "
        },
        {
            "text": "I had passed the assessment and was assigned to a Government department, however it took a few months for all the pre-employment and security checks to finish before I could actually start with HMRC."
        },
        {
            "text": "The Apprenticeship"
        },
        {
            "text": "Throughout my journey, I have had direct exposure to many technical aspects through working on a variety of technical security teams within the Cyber Command Centre. "
        },
        {
            "text": "These include Incident Management, where I have worked on live incoming Cyber Security alerts and the Vulnerability Management team where I have located vulnerabilities present throughout the estate. Also, I have worked on the Threat Intelligence team, where I used external threat sources in order to identify threats to HMRC. As a Cyber Apprentice, there was always interesting work to be done."
        },
        {
            "text": "On every team placement, I have always been treated as just a member of the team, even though I was an apprentice, I did the same work everyone else did on the team and was able to fully contribute to the department. Throughout my journey I have always been supported by both team and non-team members."
        },
        {
            "text": "The courses that I have attended as an apprentice have been great, as the rest of my cohort and myself travel down to London for a week and get in depth training on Cyber related areas. Through these courses, I have gained qualifications, and learned about Networking, Cyber Security, Cryptography, Open Source Intelligence and Information Security Standards and more."
        },
        {
            "text": "I have had the opportunities to attend many Cyber Security events where I have learned about new trends, been given the opportunity to network and interact with apprentices from other Government departments and been given insight into many professionals’ experiences."
        },
        {
            "text": "On the apprenticeship I was also given the opportunity to be involved with the recruitment of Cyber Apprentices where I was an assessor at the assessment centres. This was a great experience as I got to learn about the recruitment process and how candidates are selected."
        },
        {
            "text": "While on this apprenticeship I have faced a few challenges, mainly with Covid-19, as this put several of my apprenticeship courses on hold and ended up cancelling my last course. However, we were able to overcome these challenges and complete the courses online and it didn’t affect the overall completion of my apprenticeship."
        },
        {
            "text": "To anyone thinking about joining the scheme or looking to get into Cyber Security, this is a great opportunity and apprenticeship where you will develop a variety of different skills and experience using several differing security tools. "
        },
        {
            "text": "This apprenticeship has allowed me to develop my Cyber Skills and given me experience working in a highly active Security Operations Centre dealing with monitoring, incident responses and real Cyber Security alerts - I’m excited about my future in this industry."
        }
    ]
}