{
    "url": "https://civilservicelocal.blog.gov.uk/2021/07/14/profession-pathway-programme/",
    "title": "Profession Pathway Programme",
    "authors": [
        "dianecoates"
    ],
    "categories": [
        "North West England"
    ],
    "pub_date": "2021-07-14T11:34:28+00:00",
    "content": [
        {
            "text": "We hope you have heard about the exciting pilot activity happening in the Northwest, but just in case, here is all you need to know in one place!"
        },
        {
            "text": "The Profession Pathway Programme has been in development since October 2020, it aims to create clear career pathways outside of London and showcase what the professions have to offer.  In doing that we are committed to giving civil servants the best opportunities for growth and development and helping motivated people to access professions and give a great quality of life to those living in the Northwest."
        },
        {
            "text": "We started with the policy profession and we seek to create a blueprint for success that can be replicated across other localities and other professions.  We are already in conversations with the digital profession to start testing if the current level of success we are seeing in policy can easily be transferred to another profession, so we are very excited at the rapid growth of the programme and that's why we wanted to tell you more in this blog."
        },
        {
            "text": "This programme is divided into various different elements and is designed to meet the needs of current policy professionals who wish to progress to more senior grades as well as those who are not currently in policy but are interested in learning more and potentially apply for policy roles in the future.  "
        },
        {
            "text": "You don’t have to want to secure promotion for the pathway to work for you, growth and development opportunities exist for all, and wanting to learn more about a profession and/or secure sideways moves is just as important."
        },
        {
            "text": "Exciting offers are flooding in and we are at a pivotal stage in the pathway that means we can share with you some of the opportunities that we are working on and you can start to discuss these with your managers at your development conversations.  We are also keen to hear from any departments that feel they would like to get involved in the programme and can help us extend this offer. "
        },
        {
            "text": "What will the pathway offer?"
        }
    ]
}