{
    "url": "https://defrafarming.blog.gov.uk/2021/07/14/regulation-workshops-what-we-did-next/",
    "title": "Regulation workshops: what we did next ",
    "authors": [
        "Karen Steele"
    ],
    "categories": [
        "Conversations we're having",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2021-07-14T12:08:20+01:00",
    "content": [
        {
            "text": "We want a regulatory system for farming that maintains our high standards of animal health and welfare and takes care of our natural environment. Our regulatory system needs to work for those who interact with it. It needs to be fair, clear, efficient and effective."
        },
        {
            "text": "We want farmers and land managers to be involved in this work for a number of reasons. It's important that the rules not only make sense, but that they work in practice. Working together in this way gives us a clear sense of the support people need to comply with the rules. It also ensures that the rules are achieving the intended outcomes."
        },
        {
            "text": "That’s why we’re taking a co-design approach to improving the way regulation and enforcement work."
        },
        {
            "text": "We ran some co-design workshops in November with farmers and other experts to help us explore how the regulatory system needs to change. We wrote about that work here on the blog."
        },
        {
            "text": "After those workshops, we began planning the next phase of our co-design work on regulation. I’d like to share our progress in this post."
        },
        {
            "heading": 3,
            "text": "Making guidance clearer"
        },
        {
            "text": "One insight from our initial workshops was that clear, accessible advice and guidance is really important."
        },
        {
            "text": "We’ve started to improve the guidance about farming regulation on GOV.UK to make it easier to understand and digest. You will soon be able to see the changes on Nitrate Vulnerable Zones (NVZ) and salmonella on GOV.UK. We'll post an update when they're live."
        },
        {
            "heading": 3,
            "text": "Improving regulatory outcomes – 2 areas of focus"
        },
        {
            "text": "We’ve identified 2 areas where we want to explore how regulation works in more depth – nutrient management and livestock traceability."
        },
        {
            "text": "We plan to work closely with farmers, regulators and other experts to co-design and test some different approaches in these 2 areas. We’ll then take what we learn and apply it to reform the whole regulatory system."
        },
        {
            "text": "These are areas that have been identified by users as unfair (in reference to the harsh penalties handed out for relatively low-impact breaches), inefficient or ineffective in addressing actual impacts of harm caused. Some processes and guidance in these areas are overly complicated, onerous or costly."
        },
        {
            "text": "For example, building slurry structures can be expensive, complex and involves planning permission. Nutrient management guidance can be complicated and disjointed. Farmers told us that following nutrient management guidance and livestock processes is heavily administrative and burdensome."
        },
        {
            "heading": 4,
            "text": "Nutrient management"
        },
        {
            "text": "Nutrient management is the process of managing the storage, use and application of organic and in-organic nutrients (Nitrogen, Phosphorous and Potassium) to support food production and avoid loss of nutrients to the environment."
        },
        {
            "text": "Productive and sustainable farms manage nutrients effectively. Good planning and effective management can reduce production costs, as nutrients are not over-applied and can often be recycled."
        },
        {
            "text": "Good management also protects the environment from loss of excess nutrient which can contaminate the air, soil and waterways. Livestock owners need to manage slurry and need enough storage so they don’t have to spread it at inappropriate times."
        },
        {
            "text": "We want to make sure that regulation in this space is fit for purpose; that it effectively targets and responds to activity or poor practices that are causing, or have potential to cause, harm to the environment."
        },
        {
            "text": "We know that water quality and air quality are being affected by pollution from agriculture and there is significant scope for improvement and that we can do more to help people get the basics right."
        },
        {
            "text": "For example, data tells us that agriculture is the dominant source (about 70%) of nitrate in our water environment. Nitrogen-rich fertilisers applied to soil contribute 90% of Nitrous Oxide emissions from agriculture. Agricultural emissions also account for 88% of the UK’s total ammonia emissions (2016), of which 23% comes from inorganic fertiliser application, 25% from manure and slurry application and 9% from manure and slurry storage."
        },
        {
            "text": "To improve in this area, we want to co-design and test new ways of tackling agricultural nutrient loss to the environment and explore more effective ways to regulate the storage and application of nutrients."
        },
        {
            "heading": 4,
            "text": "Livestock traceability"
        },
        {
            "text": "Data management and record keeping of livestock are important for avoiding and managing disease outbreaks and supporting trade. As it stands, it is hard for farmers, inspectors, and other stakeholders to do this with ease. Many report that processes are burdensome and mistakes are easily made. This can result in harsh penalties which feel unfair."
        },
        {
            "text": "Within Defra, we have already started to look at improving data systems to help mitigate this problem as part of the Livestock Information Programme. We want to make sure our regulatory system supports those changes appropriately, so we have a simpler, fairer system that supports livestock owners to meet standards needed to trade."
        },
        {
            "text": "We want to take an improved approach to regulating livestock traceability that reduces the administrative toll on farmers and allows us to respond effectively prevent and contain disease outbreaks."
        },
        {
            "text": "We are already looking at various options to improve risk selection of farms, inspection processes and penalty structures, as well as considering potential legislative change, to improve the system - not just for the longer term but also to make things better right now."
        },
        {
            "text": "We want to work with livestock keepers and others in the system to work out what a more flexible, balanced system could look like and how we can develop it together."
        },
        {
            "heading": 3,
            "text": "Work with us"
        },
        {
            "text": "We want to work with farmers and other users and experts to:"
        },
        {
            "text": "If you are interested in taking part in co-design work on these questions, we would love to hear from you. Please email ffcpcodesign@defra.gov.uk or add a comment below."
        },
        {
            "text": "You can read more about the changes we made to cross compliance in a blog post by Andy King."
        },
        {
            "text": "For more information on what changes are happening in this space and our future plans, including improved inspection approaches we're testing with the Environment Agency in the coming year,  subscribe to the Future Farming Blog."
        }
    ]
}