{
    "url": "https://ipo.blog.gov.uk/2021/07/14/renewals-launch-of-our-first-one-ipo-service/",
    "title": "Renewals: launch of our first ‘One IPO’ service",
    "authors": [
        "Peter Slater"
    ],
    "categories": [
        "Design",
        "Patents",
        "Renewals",
        "Trade marks"
    ],
    "pub_date": "2021-07-14T10:04:28+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Renewals: launch of our first ‘One IPO’ service "
        },
        {
            "text": "We have marked an important milestone for UKIPO. After trialling our new digital Renewals service for 18 months with a limited group of customers, we have opened it up for everyone to use. In this blog, Peter Slater, Project Lead, reflects on the launch of the new service, and how it sets the stage for IPO’s digital future."
        },
        {
            "heading": 3,
            "text": "What is the renewals service?"
        },
        {
            "text": "To keep a patent, trade mark or design registered with IPO it has to be renewed after a certain number of years. We recognised that the existing service was outdated and difficult to manage, both for customers and ourselves, and needed updating. We implemented a newly-designed, simple and intuitive Renewals service to help businesses and individuals maintain their IP rights easily, to avoid losing them."
        },
        {
            "heading": 3,
            "text": "What did we achieve with the new service?"
        },
        {
            "heading": 4,
            "text": "1.A quicker, more efficient service"
        },
        {
            "text": "The most basic requirement of any digital service is that it makes things quicker, easier and more convenient. The new service reduces the time a renewal takes to process from five days to five minutes. The new service also introduces automated email responses for correspondence, receipts and certificates . A significant improvement on letters and postage stamps!"
        },
        {
            "heading": 4,
            "text": "2. A single service for all renewals"
        },
        {
            "text": "Until recently we had a separate renewals process for patents, trade marks and designs. Now, for the first time, customers can renew their patents, trade marks and designs through one system– a true ‘One IPO’ service."
        },
        {
            "text": "To make the most of this, the service now allows customers to renew up to 1,500 intellectual property (IP) rights in a single transaction. The renewals can be made up of any combination of patents, trade marks and designs."
        },
        {
            "heading": 4,
            "text": "3.Designs can be renewed online for the first time"
        },
        {
            "text": "The biggest request we get from our customers is for better digital services. We feel that in 2021, our customers should expect more choices when renewing their design rights. As part of our new service customers can renew designs online for the first time, as well as via our traditional paper forms. The service also includes online checks and validation to reduce errors and speed up the process."
        },
        {
            "heading": 3,
            "text": "What have we learned?"
        },
        {
            "text": "Overall, the service has had an overwhelmingly positive reception. Satisfaction rating from customers has been averaging between 94% to 96% against approximately 550,000 renewals in 2020."
        },
        {
            "text": "Customers particularly value how intuitive the new service is. We have received  feedback such as: “It’s fantastic, “well done, love it, super-easy”, “I love your service” and “...you've got the very best service of all countries in the world keep up the good work!\""
        },
        {
            "text": "The team working on the project also won the bronze award for this service at the Civil Service Operational Delivery Profession Awards."
        },
        {
            "text": "It’s not all been plain sailing though, we’ve worked through some challenges with the service. In January we ran into some issues which caused errors or delays in the processing of some renewal payments. We pulled together an incident team to help resolve this issue as quickly as possible for our customers. I’m happy to report that these issues have now been resolved."
        },
        {
            "text": "What we’ve learned from this is the value of testing new services with a representative group of users reflecting different needs. It helps to iron out any challenges early on and ensure that the focus remains on the customer\non a smaller scale before opening it up to all customers."
        },
        {
            "text": "In this way we have been able to minimise the disruption caused by any teething issues. We’ve also seen the value of having a common system across all IP rights, which makes it quicker and easier for customers to complete all of their renewals with one service."
        },
        {
            "heading": 3,
            "text": "What does this mean for future IPO services?"
        },
        {
            "text": "The Renewals service sets the scene for what we want to achieve with our future digital services. At the same time that we opened up the service to all customers, we also launched our One IPO Transformation Programme. We are planning to make all of our services easier and more efficient for our customers to use, in the same way that our Renewals service upgrade has."
        },
        {
            "text": "The ‘One IPO’ Programme is about having a single system across the board for all IPO services – whether you want to protect, research or use your IP. As with the Renewals service, that also means one system for patents, trade marks and designs."
        },
        {
            "text": "The similarities don’t end there. We will be working with ‘agile’ principles, like we did with Renewals. This means that our approach will be led by customer needs – each part of the ‘One IPO’ service will start by asking customers what they need from it. As the name suggests, ‘agile’ is also about moving quickly, and responding when we identify problems. We’ll be taking note of customer feedback and will be open to changing our approach and adapting when needed."
        },
        {
            "heading": 3,
            "text": "Final reflections"
        },
        {
            "text": "Introducing a new Renewals service isn’t always going to be seamless, but initial feedback has proved that we are more than capable of delivering on our promise of radically improved digital services. We will continue this journey as we deliver our transformation programme and hope you can join us on our new, improved pathway to more efficient services."
        },
        {
            "text": "If you’d like to be updated about our transformation programme, or take part in user testing, please email transformation@ipo.gov.uk."
        }
    ]
}