{
    "url": "https://queensawards.blog.gov.uk/2021/07/14/thinking-of-applying-for-the-promoting-opportunity-through-social-mobility-category/",
    "title": "Thinking of applying for the Promoting Opportunity category?",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Promoting opportunity",
        "social mobility"
    ],
    "pub_date": "2021-07-14T11:43:52+01:00",
    "content": [
        {
            "text": "The Queen’s Awards are the most prestigious awards for business, celebrating the outstanding achievements of organisations across the UK. The Promoting Opportunity category was refocused last year to make the category easier to apply for and understand."
        },
        {
            "text": "The updated category recognises organisations that have supported people from socially disadvantaged backgrounds in improving their job skills and their chances of finding work. It was refocused last year to gives applicants a better understanding of the application process, enabling those whose organisations’ core aim is to provide opportunities for others, and also those with a social mobility intervention or programme, to be celebrated."
        },
        {
            "text": "The application form has also been refreshed to make it easier for organisations to provide evidence on the impacts and benefits of their interventions – it branches out into 2 separate sections after the initial eligibility questions, allowing organisations whose core aim is social mobility to answer questions specifically for them and those who instead have a specific programme or initiative to answer questions tailored for them."
        },
        {
            "text": "We here at the Queen’s Awards for Enterprise are often asked who is eligible to apply for this Award. Do take a look at the eligibility criteria here  https://www.gov.uk/queens-awards-for-enterprise/eligibility and if you are an organisation that supports socially disadvantaged individuals from the list below, you may be eligible to apply :"
        },
        {
            "text": "Below are some examples of organisations who could submit an application."
        },
        {
            "text": "It may be that you are a high street business that has created a social mobility programme to recruit and train ex-offenders, providing a job and a new start. Your business may work directly with ex-offenders, providing them with work experience and work-based training which leads to a permanent role at the end of the programme."
        },
        {
            "text": "You could be a social enterprise company working with young people aged 16-24 from ethnically diverse communities that works closely with community organisation and recruits staff from the BAME community, partnering with local employers to create 'real' opportunities to access work placements. You create a pathway for young people, developing their skills, connecting with employers and accessing meaningful work experience."
        },
        {
            "text": "You may be a charity that exists to help survivors of domestic abuse to enter employment by providing job related training and individual mentoring schemes , interview skill workshops, work placements and a fund to enable participants to buy interview clothes."
        },
        {
            "text": "Applications are open now and close on 6 September 2022. Visit our website to apply now."
        },
        {
            "text": "We look forward to receiving your application."
        },
        {
            "text": "Subscribe to updates from this blog, or follow us on Twitter and LinkedIn."
        }
    ]
}