{
    "url": "https://educationhub.blog.gov.uk/2023/09/15/everything-you-need-to-know-about-nasuwts-action-short-of-strike-action/",
    "title": "Everything you need to know about NASUWT’s Action Short of Strike Action ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-09-15T16:09:01+01:00",
    "content": [
        {
            "text": "The National Association of Schoolmasters/Union of Women Teachers (NASUWT) has announced it will be taking Action Short of Strike Action from Monday 18 September 2023.  "
        },
        {
            "text": "This doesn’t mean that teachers are going on strike again.  "
        },
        {
            "text": "Earlier this year, schoolteachers in England, including members of NASUWT, accepted a fully funded 6.5% pay award. All other school unions have called off industrial action. "
        },
        {
            "text": "Here we set out what industrial action NASUWT is taking and what it means for schools and sixth form colleges. "
        },
        {
            "heading": 3,
            "text": "What is Action Short of Strike Action (ASOSA) and does this mean schools are closing again? "
        },
        {
            "text": "No. ASOSA will only affect some schools and sixth form colleges in England. ASOSA is not the same as a strike, but participating teachers could refuse to complete tasks which they believe to be outside of their contracts, such as lesson planning, or covering for other staff except in unforeseen circumstances.  "
        },
        {
            "text": "While ASOSA is not intended to close schools and colleges, it may cause some disruption depending on the school or sixth form college’s particular circumstances, especially if they have a high number of staff who are NASUWT members. "
        },
        {
            "text": "In the event of industrial action, school or college leaders will take all reasonable steps to minimise disruption. This could include reviewing timetabling or making changes to how they operate.  "
        },
        {
            "text": "ASOSA will only affect schools and sixth form colleges where there are NASUWT members who have a mandate for ASOSA. "
        },
        {
            "heading": 3,
            "text": "When is NASUWT taking industrial action? "
        },
        {
            "text": "NASUWT will begin its ASOSA on Monday 18 September 2023."
        },
        {
            "text": "NASUWT has not announced an end date to the industrial action but its current mandates end in January 2024 in schools, and December 2023 in sixth form colleges. "
        },
        {
            "heading": 3,
            "text": "What are you doing to improve teacher workload and wellbeing? "
        },
        {
            "text": "We want to ensure teaching remains an attractive career. "
        },
        {
            "text": "To help, we will convene a Workload Reduction Taskforce to explore how we can go further to support school and trust leaders to minimise workload.  We are also setting an ambition to reduce teacher and leader workload by five hours per week. "
        },
        {
            "text": "We also know that flexible working opportunities can help to recruit, retain and motivate teachers and leaders and help promote staff wellbeing. "
        },
        {
            "text": "Last month, we appointed seven Flexible Working Ambassador multi-academy trusts and schools to offer practical advice to school leaders on implementing flexible working and we are currently in the process of recruiting more. "
        },
        {
            "text": "This is part of a wider programme, funded by the department, to help embed flexible working in schools and trusts. "
        },
        {
            "text": "The Sixth Form College Association is engaging with unions on pay and workload issues within their discussions on behalf of the sector. "
        },
        {
            "heading": 3,
            "text": "How will this impact settings which are already affected by RAAC? "
        },
        {
            "text": "Teachers will still need to continue to fulfil their contractual obligations and carry out their key work in supporting children. You can read about how the government is supporting schools where RAAC has been identified in this update.  "
        }
    ]
}