{
    "url": "https://ukhsa.blog.gov.uk/2023/09/15/syphilis-get-tested-get-treated/",
    "title": "Syphilis: get tested, get treated",
    "authors": [
        "Katy Sinka"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-09-15T14:37:35+01:00",
    "content": [
        {
            "text": "“You don’t really hear much about syphilis these days, very much the MySpace of STDs [sexually transmitted diseases]” is a line from Tom Wambsgans, a character in HBO’s hit show ‘Succession’."
        },
        {
            "text": "Unfortunately, the latest data on syphilis shows otherwise. Infectious syphilis diagnoses increased to 8,692 in 2022, up 15.2% compared to 2021 (7,543) and 8.1% compared to 2019 –this is the largest annual number of cases reported since 1948. This is a significant rise in cases."
        },
        {
            "text": "Many people may think that sexual transmitted infections (STIs) generally are not serious, but syphilis can cause irreversible long term health effects."
        },
        {
            "text": "This blog covers the risk factors for syphilis, its signs and symptoms, and how it can be prevented."
        },
        {
            "heading": 2,
            "text": "How do people catch syphilis?"
        },
        {
            "text": "The most common way to acquire syphilis is through sexual activity, including oral sex, with a partner who has syphilis. It is important to remember that sexual partners may not know they have syphilis, given that some people can have syphilis and not show any symptoms."
        },
        {
            "text": "The more people you have condomless sex with, the more chance you have of getting sexually transmitted infections like syphilis. Having unprotected oral, vaginal or anal sex makes the risk greater."
        },
        {
            "text": "It's also possible for syphilis to be passed on to an unborn baby during pregnancy (known as congenital syphilis)."
        },
        {
            "text": "Syphilis can affect anyone, but the largest number of cases in England are in men. Gay, bisexual and other men-who-have-sex-with-men have higher rates of syphilis than people of other genders or sexual orientations."
        },
        {
            "text": "By practising safer sex – using condoms for all types of penetrative sex and being tested for STIs before having sex with someone new – people can greatly reduce their risk of acquiring or transmitting syphilis."
        },
        {
            "heading": 2,
            "text": "What are the symptoms?"
        },
        {
            "text": "Syphilis is sometimes described as ‘The Great Pretender’ given the early symptoms of syphilis can be mild, may come and go and can be easily mistaken as signs of other health conditions."
        },
        {
            "text": "Many people associate STIs with specific symptoms such as discharge or burning while peeing, but it would be very unusual for syphilis to cause either of these symptoms."
        },
        {
            "text": "Syphilis typically follows a progression of stages that can last for weeks, or even years:"
        },
        {
            "text": "The initial stage of syphilis often presents as an ulcer at the location where the infection entered the body. The ulcer could be on the genitals, around the anus or inside the rectum, vagina, or mouth. The ulcer usually develops about three to four weeks after someone has acquired syphilis and could last for several weeks. Glands in your neck, groin or armpits may swell."
        },
        {
            "text": "Because the ulcer can be inside the rectum, vagina or mouth, we know people can sometimes fail to notice it. After a few weeks the ulcer can go away, even without treatment. However, the person still has syphilis and may be at risk of transmitting the infection to sexual partners and of longer-term complications."
        },
        {
            "text": "The next stage of infection is characterised by general symptoms such as a fever, headaches and night sweats among others. At this stage, people may develop a rash over their body, sometimes including the palms of the hands and soles of the feet. Other symptoms to look out for are patchy hair loss, white patches in your mouth, and unexpected weight loss."
        },
        {
            "text": "If left untreated, syphilis can lead people to more serious health complications including potentially irreversible and life-threatening problems with your brain, heart, bones, eyes or nerves."
        },
        {
            "text": "Reassuringly though, syphilis is easy to diagnose using a blood test or sometimes a swab from an ulcer or rash. It is also easily cured with antibiotics."
        },
        {
            "heading": 2,
            "text": "How can I get tested?"
        },
        {
            "text": "Anyone who thinks they may have syphilis should get a syphilis test as soon as possible."
        },
        {
            "text": "You can have STIs without knowing, so regular check-ups – particularly if you are having sex with multiple people, and/or having condomless sex – are a good idea."
        },
        {
            "text": "It is recommended that gay, bisexual and other men-who-have-sex-with-men (GBMSM) should have tests for HIV and STIs annually or every three months, if having condomless sex with new or casual partners. Annual tests are recommended for other sexually active individuals with new partners."
        },
        {
            "text": "Testing is free and confidential, and you should get tested even if you are not showing any symptoms."
        },
        {
            "text": "Depending on where you live you could get a discreetly packaged, letterbox friendly STI self-sampling kit sent free of charge to your home, or attend your local sexual health clinic to request an STI test. No one else, including your GP, will be told about your visit."
        },
        {
            "heading": 2,
            "text": "What is the treatment?"
        },
        {
            "text": "Syphilis is easy to treat and cure with antibiotics, but untreated syphilis will not go away on its own."
        },
        {
            "text": "The antibiotics are usually given by a single injection or a short course of tablets."
        },
        {
            "text": "Always take your doctor or nurse's advice when it comes to taking antibiotics. Remember never share antibiotics or keep for later use."
        },
        {
            "text": "You need to avoid any sexual contact – anal, vaginal or oral – until at least two weeks after your treatment has finished. This will make sure the infection does not return or spread."
        },
        {
            "text": "People you’ve had sex with also need to get checked. This can be handled confidentially - a clinic can let them know if you don’t want to. If they know, they can be treated."
        },
        {
            "text": "While testing and treatment is available, given the very serious long-term health problems that syphilis can lead to if left unchecked, it’s important to get tested and practice safer sex to protect ourselves from catching STIs in the first place."
        }
    ]
}