{
    "url": "https://rpc.blog.gov.uk/2023/09/15/the-increase-in-the-cost-of-regulation-on-business-and-the-end-of-the-bit/",
    "title": "The increase in the cost of regulation on business and the end of the BIT",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2023-09-15T06:27:04+01:00",
    "content": [
        {
            "text": "The Business Impact Target (BIT) was introduced in 2015 in the Small Business, Enterprise and Employment Act as a way to reduce the cumulative costs of regulation on business. As a result, at the start of each parliament, the Government sets a target for the total regulatory burden on business of new regulation over the life of that parliament and the RPC confirms the Government’s estimates of regulatory costs, so that progress against the BIT can be reported each year[1]."
        },
        {
            "text": "However, as we have previously commented, the BIT has not reduced regulatory costs in recent years (in fact they have increased substantially) and the Government has failed to meet the targets it has set itself. During the 2017-2019 parliament, the Government aimed to reduce regulatory costs by £9bn, in fact, those costs rose by £7.8bn; while in the current (2019-2024) parliament, the Government set a holding target of no increase in regulatory costs, however costs have increased by £14.3bn in the first 3 years. At the same time, important policy areas (that have had significant regulatory costs attached) have been exempt and not included in the BIT figures. Perhaps most significantly, having a target (and missing it) appears to have had little consequence for decisions about regulation by ministers."
        },
        {
            "heading": 2,
            "text": "Regulatory costs during the final BIT period"
        },
        {
            "text": "The Government has decided to abolish the BIT (see below) and not publish a summary of the cost of regulation introduced since the last BIT report (which covered the year to 16 December 2022). We have, however, continued to verify the costs of new regulation and we believe it is of interest to stakeholders for us to publish a summary of the impacts up to abolition of the BIT (29 August 2023)."
        },
        {
            "text": "Between 17 December 2022 and 29 August 2023, we published formal opinions on 14 qualifying measures. These had a verified total impact of £2.9 billion[2]. Adding this to the total from the January 2023 BIT report gives an estimated increase in the regulatory burden on business for this parliament (up to the removal of the BIT) of around £17.2 billion, against the Government’s target of no increase in the BIT. Figure 1 shows the individual verified BIT scores."
        },
        {
            "text": "Figure 1. Verified BIT scores (£m) of qualifying regulatory provisions on which the RPC has published opinions since the 2021-22 BIT report"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The review of the Better Regulation Framework and abolition of the BIT"
        },
        {
            "text": "The requirement to verify the BIT has meant that the RPC’s review of impact assessments has been at the end of the policy-making process – typically after ministers have chosen a preferred policy approach. As a result, our opinions on the quality of the evidence in IAs have been too late to effectively inform regulatory policy choices."
        },
        {
            "text": "Therefore, and following its review of the Better Regulation Framework, the Government decided to abolish the BIT through a provision in the Retained EU Law (Revocation and Reform) Act 2023.  This took effect from 29 August 2023 and the requirement to calculate and verify the BIT is, therefore, no longer in force."
        },
        {
            "text": "The RPC supports the move to earlier independent review of impact assessments to allow us to comment on the evidence supporting the different policy options. We hope that the renewed focus on identifying non-regulatory alternative policy options with lower impacts on business, will mean that the Government regulates only where there is a clear case to do so and in a that way keeps regulatory burdens to a minimum."
        },
        {
            "text": "--"
        },
        {
            "text": "[1] Our most recent Independent Verification Body (IVB) report is here and the Government’s BIT report on which it comments is here."
        },
        {
            "text": "[2] Note: This is a sum of the verified impacts in RPC opinions published by 29 August and not included in BIT reports. It has not been subject to the detailed checking that would have supported a definitive government BIT figure for this period and cannot be directly compared with official BIT figures."
        }
    ]
}