{
    "url": "https://nationalscreening.blog.gov.uk/2023/09/15/uk-nsc-announces-new-screening-seminars/",
    "title": "UK NSC announces new screening seminars",
    "authors": [
        "Andrew Anderson"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-09-15T09:36:01+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) today launches a programme of online seminars for stakeholders."
        },
        {
            "text": "The UK NSC is the body which advises ministers and the NHS in the 4 UK countries about all aspects of screening and supports implementation of screening programmes."
        },
        {
            "text": "The seminars are part of the committee’s wide ranging stakeholder engagement and one of the many ways it keeps interested parties informed about its work."
        },
        {
            "text": "There are currently 3 seminars available, all of which last 1.5 hours. Each seminar is standalone so you can book your place on one, or all of them. All seminars are held virtually via Microsoft Teams and are free."
        },
        {
            "text": "We expect awareness of our seminars to increase over time and as we add more on a wider range of screening topics. In the meantime, please help us by sharing details of events with your colleagues."
        },
        {
            "heading": 2,
            "text": "Upcoming events"
        },
        {
            "heading": 3,
            "text": "Developing a clinical pathway for modelling of targeted lung cancer screening – Tuesday 31 October 2023 (11am to 1.30pm GMT)"
        },
        {
            "text": "The seminar looks at the process the UK NSC followed as it developed a clinical pathway for lung cancer screening. It will describe how UK NSC involved stakeholders to inform its approach and how the modelling stakeholders collaborated to inform discussions on the approach to use in the model."
        },
        {
            "heading": 3,
            "text": "Planning and implementing an in-service evaluation – Monday 13 November 2023 (10.30am to 12pm GMT)"
        },
        {
            "text": "Our second session will look at the process of planning and running an in-service evaluation (ISE). Presenters will draw from the real-world context of the ISE of screening for severe combined immunodeficiency (SCID) as part of the NHS Newborn Blood Spot Screening Programme in England."
        },
        {
            "heading": 3,
            "text": "Polygenic scores – Tuesday 6 February 2024 (2.30pm to 4pm GMT)"
        },
        {
            "text": "Polygenic scores are calculated by looking at genetic variants across the genome to determine an overall risk of developing a disease. This seminar will be based on the paper Realistic expectations are key to realising the benefits of polygenic scores."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}