{
    "url": "https://food.blog.gov.uk/2023/07/04/chief-executives-message-to-stakeholders-regulated-products-and-supporting-innovation/",
    "title": "Chief Executive’s message to stakeholders - Regulated products and supporting innovation",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-07-04T15:10:59+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "One of the new roles that the Food Standards Agency (FSA), alongside Food Standards Scotland (FSS), took on after Brexit was making recommendations to Ministers on whether to authorise certain food and feed products, known as regulated products, for sale on the GB market. Products go through our risk analysis process before they are approved for sale, allowing us to protect the health of consumers."
        },
        {
            "text": "This work supports innovation and economic growth. Consumers are looking for innovative products that meet their needs – whether that is taste, variety or more nutritious or sustainable foods. Regulation must be agile and responsive enough to help businesses bring new products to market more quickly, including those with the potential to bring health and environmental benefits."
        },
        {
            "text": "Last month the FSA, with FSS, launched a new way for businesses to make applications for regulated products. This will make it easier for applicants, particularly small businesses, to navigate the authorisation process and submit good-quality applications for their products."
        },
        {
            "text": "There are currently more than 430 applications at various stages of assessment, of which around 100 relate to CBD products. We are making steady progress, but there are challenges ahead. At our most recent FSA Board meeting, we highlighted the potential impact of FSA resource constraints on the service."
        },
        {
            "text": "We’re determined to do what we can by introducing further changes and efficiencies that we hope will help us do more within existing resources. We’re also thinking creatively about longer-term reform, with plans to review and modernise the inherited legislation from the EU to streamline the authorisation approach."
        },
        {
            "text": "If you have any thoughts or questions on how regulation can help to deliver innovation, please do let us know in the comments section below."
        },
        {
            "heading": 1,
            "text": "Cynhyrchion rheoleiddiedig: cefnogi arloesedd a thwf economaidd"
        },
        {
            "text": "Ar ôl ymadael â’r UE, un o rolau newydd yr Asiantaeth Safonau Bwyd (ASB) a Safonau Bwyd yr Alban oedd gwneud argymhellion i Weinidogion o ran a ddylid awdurdodi rhai cynhyrchion bwyd a bwyd anifeiliaid, a elwir yn gynhyrchion rheoleiddiedig, i’w gwerthu ar farchnad Prydain Fawr. Mae cynhyrchion yn mynd trwy ein proses dadansoddi risg cyn iddynt gael eu cymeradwyo i’w gwerthu, sy’n sicrhau ein bod yn diogelu iechyd defnyddwyr."
        },
        {
            "text": "Mae’r gwaith hwn yn cefnogi arloesedd a thwf economaidd. Mae defnyddwyr yn chwilio am gynhyrchion arloesol sy’n diwallu eu hanghenion – boed hynny o ran blas, amrywiaeth neu fwyd sy’n fwy maethlon neu gynaliadwy. Rhaid i’r broses reoleiddio fod yn ddigon hyblyg ac ymatebol i helpu busnesau i ddod â chynhyrchion newydd i’r farchnad yn gyflymach, gan gynnwys y rhai a allai gynnig manteision iachusol ac amgylcheddol."
        },
        {
            "text": "Fis diwethaf lansiodd yr ASB a Safonau Bwyd yr Alban ffordd newydd i fusnesau wneud ceisiadau am gynhyrchion rheoleiddiedig. Bydd hyn yn ei gwneud yn haws i ymgeiswyr, yn enwedig busnesau bach, lywio’r broses awdurdodi a chyflwyno ceisiadau o ansawdd da am eu cynhyrchion."
        },
        {
            "text": "Ar hyn o bryd mae mwy na 430 o geisiadau ar wahanol gamau asesu, ac mae tua 100 ohonynt yn ymwneud â chynhyrchion CBD. Rydym yn gwneud cynnydd cyson, ond mae heriau o’n blaenau. Yng nghyfarfod Bwrdd diweddaraf yr ASB, gwnaethom dynnu sylw at effaith bosib cyfyngiadau adnoddau’r ASB ar y gwasanaeth."
        },
        {
            "text": "Rydym yn benderfynol o wneud ein gorau glas drwy gyflwyno arbedion effeithlonrwydd a newidiadau pellach a fydd, gobeithio, yn ein helpu i wneud mwy gyda’n hadnoddau presennol. Rydym hefyd yn meddwl yn greadigol am ddiwygio yn y tymor hirach, gyda chynlluniau i adolygu a moderneiddio’r ddeddfwriaeth a etifeddwyd gan yr UE i symleiddio’r dull awdurdodi."
        },
        {
            "text": "Os oes gennych unrhyw syniadau neu gwestiynau am sut y gall rheoleiddio helpu i arwain at arloesedd, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}