{
    "url": "https://naturalengland.blog.gov.uk/2023/07/04/farmers-key-to-success-of-magical-new-sssi/",
    "title": "Farmers key to success of magical new SSSI",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Farming",
        "Landscapes",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species",
        "Site of Special Scientific Interest",
        "Species recovery",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2023-07-04T16:20:11+01:00",
    "content": [
        {
            "text": "Blog by Tony Juniper CBE, Chair"
        },
        {
            "text": "The landscape that runs west from St Ives in Cornwall down toward St Just close to Lands End was until recently one of the most special places in England to remain unprotected. The complex mosaic of heathlands, grasslands, valley mires and granite tors holds an unusual assemblage of rare species including mosses and lichens, plants such as the Coral Necklace, as well as invertebrates such as Perkin’s Mining Bee and Grayling butterfly and birds such as Dartford Warbler. The habitats that support these and a host of other species are blended into a farmed landscape rich in history with field boundaries in use today traced back to the Bronze Age. The Natural England Board last week agreed that the area should be protected through being confirmed as a Site of Special Scientific Interest (SSSI)."
        },
        {
            "text": "The decision to give legal protection to West Penwith Moors and Downs (Halow ha Gonyow Pennwydh West) highlights the extraordinary value of the place for Nature, and also for people and culture, with recognition of the central role farming has played – and will continue to play - in shaping this magical landscape."
        },
        {
            "text": "The inclusion of this part of England in the SSSI network presents examples of the issues raised as we work to implement England’s contribution to Government’s legally binding environmental targets published in December 2022.  Tackling species decline, recovering semi-natural habitats and improving water quality are the central components of this policy and essential to tackle the Nature crisis. More than two thirds of England is managed for agriculture and, with domestic production a key aspect of national food security, hitting these targets will need to be based on strategies that continue to enable farming."
        },
        {
            "text": "Listening to farmers and local community representatives during the process of notifying West Penwith Moors and Downs, it has brought into sharp focus that we just can’t expect to make progress unless we engage and involve local communities.  We can’t expect to effect changes by regulation and rules alone, we will need to support people through the changes – and that includes the significant funding needed to assist with the transition of food producing businesses to the sustainable farming needed to maintain key features of the new SSSI long into the future."
        },
        {
            "text": "From a scientific point of view the Nature on West Penwith Moors and Downs is of international importance and it will be a source of pride to many that it is now officially recognised as a SSSI. This will ensure that it is protected for generations to come and can add to the already undeniable appeal of this part of Britain to local people and visitors alike. It also gives the same level of protection to West Penwith that is afforded to all other such stunning examples of lowland heathland, including Purbeck Heaths in Dorset and the New Forest."
        },
        {
            "text": "The SSSI system is sometimes viewed as an attempt to preserve a site and its wildlife at a moment in time, avoiding any future change. Although that may once have been true, we’re now in an era of Nature recovery rather than preservation. Hanging on to what we have during much of the 20th Century has worked to an extent, but severe declines in many species mean that we’re now working on a much larger scale, with many more partners, to try to flatten out that trajectory and move it from decline and toward recovery. Recovering Nature means there will be a need to change land management significantly in some areas, and this will come at a cost, particularly during the transition."
        },
        {
            "text": "Natural England’s Cornwall team have been working with local farmers and other occupiers over the last decade to pull together the science and evidence needed to underpin the designation, and to understand how this will work in practice. The process involved in SSSI designations can sometimes cause people living and working on the land anxiety about the future, and that has certainly been the case at West Penwith where so many people’s livelihoods are tied to land-based businesses."
        },
        {
            "text": "At the Board meeting in St Ives we heard concerns expressed by a number of people who objected to SSSI status and were worried that their current farming practices might no longer be possible, undermining their businesses. These objections followed the original decision to notify the SSSI taken by Natural England back in October 2022.  The Natural England Board’s job is to take into consideration representations made over the last six months and any new evidence and decide whether this decision is correct or needs to be changed in any way. The Board’s view, after hearing all the evidence presented, was that West Penwith Moors and Downs merited SSSI status and we approved the original plan but with some adjustments to parts of the boundary."
        },
        {
            "text": "Now that the science has been fully scrutinised and the SSSI confirmed, Natural England will use all of the tools currently at its disposal to give the land managers the support they need to ensure that successful, sustainable farming and Nature recovery go hand in hand. That will mean maintaining our conversations with farmers and working to restore the trust that some of them felt had diminished as a result of the SSSI process."
        },
        {
            "text": "We very much understand the need for positive incentives for farmers operating on SSSIs. At present, scheme payments don’t go far enough to reward farmers and we are advising Defra on ways they can address that and improve the offer to help farmers like those at West Penwith to move their businesses to maintain the SSSI interest.  I am strongly of the view that those who manage SSSIs need to be properly incentivised for their efforts."
        },
        {
            "text": "Achieving that will strengthen society’s relationship with farmers and give them the confidence to commit their business to Nature recovery. What we heard at our Board meeting was that farmers and their representatives take their role as environmental custodians very seriously, and they are concerned at the speed they are being asked to adapt long-established farming practices and the extent to which they are being supported in that process."
        },
        {
            "text": "I would like to reassure farmers that the designation does not mean sudden changes to agriculture on Penwith. In most of the SSSI land there will be no significant impact on management. In a minority (around 10 per cent of land) we will work with farmers to help them gradually reduce the amount of lime, fertiliser and pesticide run-off into the precious valley mires. We have introduced a five-year transition period to give people time to move towards a lower-input approach and consider entering into Countryside Stewardship agreements which can reward them for farming in a more Nature-friendly way. I have asked the Natural England Board to return to St Ives next year to enable us to hear again from local people on their experiences of supporting the new SSSI."
        },
        {
            "text": "Conferring on West Penwith the status its rich Nature needs to secure its future amounts to a significant proportion of Cornwall and England’s contributions to our national environmental goals, underlining just how important farmed landscapes are to Nature recovery. I do hope that, as we move from notification of West Penwith toward the transitions that will sustain its future, relationships with land managers will prove as strong as the sense of history that dwells there, and that farming and Nature will thrive together here for many more generations to come. It may take time, but I look forward to the day when all members of the local Cornish community see the SSSI as a vital part of maintaining the special Nature of this stunning part of the world."
        },
        {
            "text": "-ends-"
        }
    ]
}