{
    "url": "https://dluhcdigital.blog.gov.uk/2023/07/04/local-authorities-join-our-research-panel-and-improve-our-funding-service/",
    "title": "Local authorities: join our research panel and improve our funding service",
    "authors": [
        "Anisha Kanabar"
    ],
    "categories": [
        "Funding service design"
    ],
    "pub_date": "2023-07-04T09:15:14+01:00",
    "content": [
        {
            "text": "Here at the Department for Levelling Up, Housing and Communities (DLUHC), we're modernising how we deliver digital services. The Funding Service Design team is a multi-disciplinary group working hard to transform the delivery of funding to local authorities, charities, community groups, and others across the UK. "
        },
        {
            "text": "The Funding Service Design team is improving the experience for organisations accessing government funding, to deliver a service that puts their needs right at the heart of the process. By designing solutions together with these users, collaboratively, we can improve both the funding process and the overall outcomes of funded programmes. This is the essence of user-centred design (UCD) which is specified as best practice for the design of all government digital services."
        },
        {
            "text": "Already, we have developed a suite of user-centred services – each designed to deliver funding efficiently, flexibly and consistently. They include:"
        },
        {
            "heading": 3,
            "text": "Involving users in the design process"
        },
        {
            "text": "We actively involve our users in the design process from the very beginning because we know it’s the people who use our services that are best able to improve them. Getting users involved at the beginning avoids any guesswork and ensures that we are creating services that serve the people who will be using them."
        },
        {
            "heading": 3,
            "text": "We want to hear from you"
        },
        {
            "text": "This is where you can potentially help us. We’re inviting local authorities to continue this exciting journey with us. We want to hear from people in local authorities who submit data to DLUHC to:"
        },
        {
            "text": "If this is you, your insights and experience are invaluable to us, and we’d love you to join our research panel."
        },
        {
            "heading": 3,
            "text": "What you can expect from our user research sessions"
        },
        {
            "text": "If you choose to get involved, you can expect to be part of regular sessions during which we’ll discuss your experiences, challenges and needs. You’ll also be invited to co-design solutions with us and contribute to how they’re designed. These fortnightly sessions will be facilitated virtually through Microsoft Teams, will last about an hour, and be scheduled to suit your availability."
        },
        {
            "text": "Getting involved lets you voice your thoughts, share ideas, and helps guide the design and development of our services to ensure they’re fit for purpose and serving the needs of local authorities."
        },
        {
            "text": "Grant recipients previously part of this process have been incredibly insightful and engaged, sharing wonderful feedback about our team and services, such as: “We are crying with joy and happiness because this is easier” and “This is excellent - I could easily navigate through that”."
        },
        {
            "text": "If you'd like to help co-design the future of DLUHC’s Funding Service, we'd love to hear from you. Please email us at fsdresearch@levellingup.gov.uk to get involved."
        }
    ]
}