{
    "url": "https://securityprofession.blog.gov.uk/2023/07/04/off-mute-women-in-cyber-podcast-episode-3/",
    "title": "Off Mute - Women in Cyber Podcast Episode 3",
    "authors": [
        "Angela Fisher"
    ],
    "categories": [
        "Government Security",
        "Guest blog",
        "Security and Diversity",
        "Women and security"
    ],
    "pub_date": "2023-07-04T09:00:13+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Lele, the Head of Governance Risk and Compliance (GRC) at the Home Office."
        },
        {
            "text": "In the third episode of Off Mute - a women in cyber podcast, Sophie speaks to Lele about  getting started in cyber security, the public versus private sector, career changes, governance risk and compliance (GRC) as a whole, and the experiences of women in cybersecurity."
        },
        {
            "text": "Lele explains how governance risk and compliance GRC fits into the wider cyber landscape and paints a picture as to what it entails. They also discuss experiences of women in cybersecurity, including the challenges of motherhood, the importance of having a female boss, and navigating gender dynamics in the workplace. Lele encourages women to support and mentor each other, promoting diversity and inclusion in the industry."
        },
        {
            "text": "From career advice to sector comparisons, the significance of GRC, and the experiences of women in cybersecurity, this episode offers valuable insights for both newcomers and seasoned professionals in the field."
        },
        {
            "text": "To read the Off Mute Episode 3 Transcript click here"
        },
        {
            "heading": 3,
            "text": "The creators"
        },
        {
            "text": "Off Mute was created by three fast streamers (Sam, Sophie and Isabella). They are at the start of their careers in cyber security on the Digital, Data and Technology and cyber stream. Their aim is to inspire others and highlight the accessibility of the profession and its necessity in the modern world."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}