{
    "url": "https://ipa.blog.gov.uk/2023/07/04/one-year-in-a-year-in-numbers/",
    "title": "One year in: a year in numbers",
    "authors": [
        "Karina Singh"
    ],
    "categories": [
        "IPA Project Profession and Standards",
        "IPA Strategy and Policy",
        "Project Delivery Profession"
    ],
    "pub_date": "2023-07-04T18:26:37+01:00",
    "content": [
        {
            "text": "This year marks a decade since the establishment of the Project Delivery profession and function. Alongside this, it is my first anniversary as Head of Profession for Project Delivery across the government."
        },
        {
            "text": "Here‘s my reflection on this year, in numbers."
        },
        {
            "heading": 4,
            "text": "130 Leadership programme graduates"
        },
        {
            "text": "I firmly believe we have the best leadership training programmes for Project Delivery in the world. Last week, it was a great pleasure to present graduation certificates to almost 100 colleagues at Cranfield University for successfully completing the Project Leadership Programme (PLP), and 30 colleagues at Oxford University for passing the Major Projects Leadership Academy (MPLA)."
        },
        {
            "text": "Since its launch ten years ago, over 2000 colleagues have progressed through PLP and over 1000 through the MPLA. These two recently refreshed programmes are designed to equip senior leaders, of whatever background, with the skills, tools and networks to deliver the most complex, risky and novel programmes across government."
        },
        {
            "text": "This year we piloted, and will shortly launch, a programme aimed at our 8000 emerging project delivery leaders, as well: Managing Projects and Leading Workstreams."
        },
        {
            "heading": 4,
            "text": "76 New Fast Streamers"
        },
        {
            "text": "In the last fortnight, I also met the new 76-strong cohort of the Project Delivery Fast Stream (graduate scheme), who will be joining us this autumn. It was fantastic to see the diversity in the room, as well as the newcomers’ awe and excitement at the range of projects and programmes they could be involved in across the government."
        },
        {
            "heading": 4,
            "text": "1 Project Delivery Functional Strategy"
        },
        {
            "text": "In March, we launched the first-ever Project Delivery Functional Strategy (insert link), setting out our 5 ambitions and 28 actions to take project delivery to the next level of maturity. This was developed with input from over 70 key stakeholders across the sector."
        },
        {
            "heading": 4,
            "text": "1 Project Council"
        },
        {
            "text": "We have also created the Project Council, bringing together the 20 most senior project delivery professionals across the government. The councils aim is to focus activity to create better outcomes."
        },
        {
            "heading": 4,
            "text": "400 Accredited professionals"
        },
        {
            "text": "By rolling out the accreditation standard, we have consolidated our work in previous years to create a clear career planning and training framework for project delivery. The accreditation standard of Foundation, Practitioner, Senior Practitioner and Master Practitioner helps colleagues and job-holders to manage their careers more effectively, be clear on role expectations, and make recruitment and deployment easier and more transparent. We are pleased that over 400 people have already been accredited, setting us off well towards our ambition of having 2000 people accredited by the end of 2025."
        },
        {
            "heading": 4,
            "text": "7800 Government Project Delivery Hub Members"
        },
        {
            "text": "Through the creation of the Government Project Delivery Hub, we have made it easier for public servants to deliver better, by developing a one-stop-shop for all our guides, toolkits and training materials. The Hub is a place where members of the project delivery community across the government can learn, inspire and connect."
        },
        {
            "heading": 4,
            "text": "158 Guides, Toolkits, Training materials & Collections"
        },
        {
            "text": "For the first time via the Government Project Delivery Hub, we have brought all our relevant materials together, easily searchable and accessible. We have developed and published materials to move the profession forward and address gaps in our collective knowledge. These include the Government Project Delivery Framework, the Project Set Up toolkit, and a Portfolio Management Approach for Government."
        },
        {
            "heading": 4,
            "text": "10 Project Delivery Award winners"
        },
        {
            "text": "From 352 fantastic nominations, we recently recognised the achievements of 22 shortlisted project teams and people, and celebrated the incredible 10 winners at the Government Project Delivery Awards."
        },
        {
            "heading": 4,
            "text": "1 Year"
        },
        {
            "text": "It’s been one very fulfilling and busy year, working closely with a great team of 35 here in the IPA, and my 70 fellow Heads of Profession in departments – who have been with us every step of the way."
        },
        {
            "text": "This year, we have been going from strength to strength, building on the work of my predecessors, all proud members of the Black Swan Club."
        },
        {
            "text": "We have lots of exciting things planned for next year – but more on that later."
        }
    ]
}