{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/07/04/the-other-tour-de-france-defence-medics-take-on-cycling-challenge/",
    "title": "The other Tour De France: Defence medics take on cycling challenge",
    "authors": [
        "sophiebellamy"
    ],
    "categories": [
        "Personnel"
    ],
    "pub_date": "2023-07-04T12:52:18+01:00",
    "content": [
        {
            "text": "Colleagues from Defence Medical Services (DMS) took part in an Adventurous Training (AT) epic last month when they cycled through Normandy, France."
        },
        {
            "text": "AT is an important part of the military experience; it broadens the mind, and encourages teamwork, while testing the body."
        },
        {
            "text": "A four-person DMS cycling team, with an equal gender split, took on long stretches of the French coastline on 11-16 Jun 2023 as part of an AT package that also raised money for an official service charity."
        },
        {
            "text": "With Briton Adam Yates wearing the famous Tour de France yellow jersey, at the time of writing, there is no better time to be talking all things two-wheeled."
        },
        {
            "text": "Comprised of Surgeon Rear Admiral Fleur Marshal, Leading Naval Nurse Chloe Dymond, and Surgeon Captains Dickie Heames and Christopher Streets, the squad made their way across 225 miles of quaint scenery."
        },
        {
            "text": "A far cry then, from the destruction of 79 years ago, where Allied forces made landfall and liberated this part of France from the enemy."
        },
        {
            "text": "With the recent passing of the last French survivor of D-Day, we are reminded of the immense courage required of these men."
        },
        {
            "text": "The cycling quartet took some time out to visit the British Normandy Memorial and reflect on the sacrifices our forebears made to give us the way of life we perhaps take for granted."
        },
        {
            "text": "Such a detour was especially poignant, given that our medical personnel treated thousands of wounded, from both sides, on the beaches and in the countryside during the campaign."
        },
        {
            "text": "The bike ride, which not only developed the mental and physical stamina of the team, helped foster social bonds and gave the individuals a real sense of perspective."
        },
        {
            "text": "It also raised over £1,500 for the Royal Navy and Royal Marines Charity."
        },
        {
            "text": "So it is clear that this trip, which took our intrepid crew from Portsmouth to Caen, and back again (obviously with ferries involved!), had benefits that will reach far and wide."
        },
        {
            "text": "Although doubtless gruelling at points, the fantastic four, fuelled by French pastries along the way, made it home for a well-earned rest."
        },
        {
            "text": "To find out more about AT and where it can take you, please follow this link: https://discovermybenefits.mod.gov.uk/army/army-service-benefits/army-service-benefits-adventurous-training."
        },
        {
            "text": " "
        }
    ]
}