{
    "url": "https://sustainableict.blog.gov.uk/2023/07/04/welcome-to-the-government-digital-sustainability-alliance/",
    "title": "Welcome to the Government Digital Sustainability Alliance",
    "authors": [
        "adamturner"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-04T15:16:17+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Who are GDSA?"
        },
        {
            "text": "The UK Government Digital Sustainability Alliance (GDSA) brings together the government policy owner for Digital Sustainability, the Department for Environment, Food and Rural Affairs (Defra), current and prospective government suppliers and supply chain to drive the meeting of sustainability commitments."
        },
        {
            "heading": 2,
            "text": "Why do we Exist?"
        },
        {
            "text": "As a global leader in sustainable information communications technology (ICT), Defra announced the GDSA at COP27 to ensure government’s digital infrastructure and associated supply chains are rationalised, responsible, resilient, and free of slavery/exploitation, creating environmental, social and economic benefits for all."
        },
        {
            "heading": 2,
            "text": "What is the Purpose of GDSA?"
        },
        {
            "text": "The overall main purpose of GDSA is promoting and progressing knowledge, and capabilities to deliver sustainable digital data and technology across UK Government and their suppliers.\nGDSA collects, shares, and demonstrates best practice aligned to Defra and the UK Government’s sustainability commitments. GDSA feeds recommendations into updates and the creation of policy and strategy.\nGDSA is a collaborative working group from existing or prospective digital and data suppliers to the UK Government working in partnership with members that includes businesses of all sizes."
        },
        {
            "heading": 2,
            "text": "Current Members"
        },
        {
            "heading": 2,
            "text": "GDSA Process Flow and Structure"
        },
        {
            "text": "GDSA are made up of 4 main Working Groups: Circular economy, Scope 3 Emissions, Ecological Footprint and Supporting Success (see below for more details). These groups then feed in the Steering Board – a board in which decisions surrounding GDSA are made. The alliance feeds into wider Government governance (STAR, CDIO/CTO Sustainability Group and ad hoc x-government engagement) as outcomes from the Steering Board inform government policy and approach."
        },
        {
            "heading": 2,
            "text": "Working Groups"
        },
        {
            "text": "The Working Groups are made up of members who identify problem statements within their focus areas to work towards. Their aim is to deliver tangible products within their supporting area. The four Working Groups are as follows:"
        },
        {
            "text": "Circular Economy"
        },
        {
            "text": "What is the Circular Economy?"
        },
        {
            "text": "Circular economy is a solution model framework that involves leasing, sharing, reusing, repairing, recycling and refurbishing existing materials. The idea is to abandon the linear economic method of take, make and dispose method in order to use the circular economic model of make, use, recycle. It is focused on creating durable, reusable and recyclable goods."
        },
        {
            "text": "Image source: Biomimicry In Design Blog (September 2020)"
        },
        {
            "text": " "
        },
        {
            "text": "Key Focuses of Working Group:"
        },
        {
            "text": "Scope 3 Emissions "
        },
        {
            "text": "What are Scope 3 Emissions?"
        },
        {
            "text": "Scope 3 emissions are the emissions produced as a result of activities from assesses that are not\ncontrolled or owned by the reporting organisation. However, these are emissions that indirectly affect\nthe value chain of that organisation."
        },
        {
            "text": " "
        },
        {
            "text": "Image source: Oliver Wyman Forum"
        },
        {
            "text": " "
        },
        {
            "text": "Key Focuses of Working Group:"
        },
        {
            "text": "Ecological Footprint"
        },
        {
            "text": "What is Ecological Footprint?"
        },
        {
            "text": "Ecological footprint measures and tracks an individual or populations use of productive surface areas. These areas are needed to deliver on the human demand on the Earth’s ecosystem. It looks at the impact of biological productive land and water that are required to produce the goods consumed and to assimilate the wastes generated."
        },
        {
            "text": "Key Focuses of Working Group: "
        },
        {
            "text": " "
        },
        {
            "text": "Source: Earth Overshoot Day"
        },
        {
            "text": "Supporting Success "
        },
        {
            "text": "The supporting success group act as a support network for the other three Working Groups. They are broken down into three sub-groups: Workflow, Planning and Strategy, and Comms and Branding. This ensures the group are looking at the long term GDSA strategy but also shaping the direction of the alliance. They also overall take on actions to make the other Working Groups successful and to support their outcomes."
        },
        {
            "text": "Become a Member of GDSA "
        },
        {
            "text": "*Membership is currently paused until December 2023 *"
        },
        {
            "text": "GDSA was announced globally by Chris Howes at COP 27 where the first cohorts officially signed the charter #teamGDSA. This year, at our GDSA COP 28 UK event, we are focusing on delivery, launching our new website, and showcasing outputs from our working groups. GDSA will be open to new members after this event."
        },
        {
            "text": "For any enquiries, please contact SustainableICT@defra.gov.uk"
        }
    ]
}