{
    "url": "https://foresightprojects.blog.gov.uk/2022/03/23/genomics-beyond-human-health/",
    "title": "Genomics Beyond (human) Health",
    "authors": [
        "Melissa Jackson"
    ],
    "categories": [
        "Foresight projects"
    ],
    "pub_date": "2022-03-23T16:09:59+00:00",
    "content": [
        {
            "text": "Genomic science isn’t just restricted to human genomes - yeasts, bacteria, plants, (other) animals, and viruses also possess genomes. Advances in genomic science will potentially yield solutions to many of the key challenges we are facing today, and those we will face in the future, whether that’s in food production and conservation, or environmental monitoring and biofuels."
        },
        {
            "text": "Genomics in agriculture\nGenomics is already informing selective breeding processes for crop cultivars and animals breeds. Genomic Estimated Breeding Values (GEBVs) allow producers to better understand their crops or livestock, and to selectively breed them in a process known as genomic selection. Genomes can also be improved through genome editing (for example via CRISPR), or by adding genes from other species, thereby creating genetically modified organisms (GMOs). Plant genome modifications are one of the oldest applications of genomic science and continue to benefit from our evolving understanding of genomics. Future applications could focus on developing crop drought resilience or increased nutritional content."
        },
        {
            "text": "Food standards and safety\nGenomics could also play a role in upholding food quality standards by improving our ability to monitor food ingredients and help to enforce food labelling requirements. DNA-based techniques can identify undeclared or mislabelled ingredients in foods, due to their accuracy, sensitivity, and the ease of testing under various conditions. They can also identify sources of foodborne illness caused by contamination with pathogens from non-food sources. As genomic technologies become more accessible, we can expect to see the use of genomics in this way increase over the coming years."
        },
        {
            "text": "Environmental monitoring and conservation\nGenomic sequencing also offers new opportunities for identifying species and combating illegal trade. For example, seized products, such as ivory, can be sequenced and linked back to their place of origin. This could allow enforcement agencies to focus their investigations on specific areas and help to prevent further wildlife loss. Genomics can also be used to monitor the local environment, for example by detecting bacteria associated by pollution of wastewater."
        },
        {
            "text": "Genomic modelling can help to predict how plants, animals, and other wildlife may change in response to climate change – studying how the genome of a species adapts across climatic gradients may provide an insight into how much genetic change may be caused by different climate change scenarios. Genomics could be used to estimate species vulnerability or future migration patterns or identify potential interventions."
        },
        {
            "text": "Synthetic biology\nMeanwhile, synthetic biology focuses on the creation or modification of organic material (such as entire genomes) to create new biological parts, devices, or systems, or to redesign those already found in nature. Progress made in the interface between synthetic biology and genomics is rapid, with entirely synthetic genomes of strains of yeast potentially expected by 2025, fruit flies by 2035 and humans by 2045 (1). The techniques underpinning synthetic genomics may also be used to create biosensors, biofuels, and even new forms of life. It may also be possible to use genetic engineering for de-extinction purposes, or to restore the genomic diversity of a species."
        },
        {
            "text": "Such wide-ranging manipulation with the fundamental code of life raises questions from philosophical, religious, and secular perspectives. Do we have the right to make these changes over nature? Who decides how this power is used? Who can use it or control it? Which forms of life should or can we save, or which ones should we bring back from extinction?"
        },
        {
            "text": "Our report, ‘Genomics Beyond Health’ looks in more detail at these areas. It introduces genomics to non-specialist audiences, explores how the science is developing and considers where it might lead in the future. The report also considers how genomics might impact sectors like criminal justice, education, and sport, and why people should think about the genomic future in their own sector. Find out more here."
        },
        {
            "text": " "
        },
        {
            "text": "Sources:"
        },
        {
            "text": "1: Ellis, T (2019) What is synthetic genomics anyway? The Biochemist. DOI: 10.1042/BIO04103006"
        }
    ]
}