{
    "url": "https://gdsgeospatial.blog.gov.uk/2022/03/23/her-land-her-power-how-geospatial-tech-secures-womens-land-rights/",
    "title": "Her Land, Her Power: How geospatial tech secures women’s land rights",
    "authors": [
        "Amy Coughenour Betancourt, Chief Executive Officer, Cadasta"
    ],
    "categories": [
        "International",
        "Land",
        "Technology"
    ],
    "pub_date": "2022-03-23T11:07:36+00:00",
    "content": [
        {
            "text": "Amy Coughenour Betancourt is the Chief Executive Officer of Cadasta, an award-winning non-profit organisation that develops and promotes the use of simple digital tools and technology to help partners share critical land and resource rights information. Amy has a wealth of experience, working in resilience, food security and rural development. She currently serves on the board of Interaction, the premier alliance of international NGOs working in humanitarian assistance and development. She is also on the Washington Capital Area Executive Board of How Women Lead, a national organisation of top executive women focusing on leadership, philanthropy and investment."
        },
        {
            "text": "In this blog, Amy discusses how the lives of women in countries where land ownership goes undocumented or unregistered, are negatively impacted, socially and economically.  If gender-equal land ownership is a vital part of achieving gender equality, what can we do to ensure women’s land rights? And what role can geospatial technology play?"
        },
        {
            "text": "An estimated 70 percent of the land in the developing world is undocumented, making 1 billion people vulnerable and specifically affecting a staggering 1 in 5 women globally."
        },
        {
            "text": "Land rights are the foundation of stability and prosperity. Land ownership insecurity–the fear of losing your home or the land on which you live and farm–is often linked to a lack of legally recognized land ownership documents to prove or defend land claims. "
        },
        {
            "text": "Even when accounting for legal and cultural differences across countries, women are disproportionately disadvantaged when it comes to land access and property rights. "
        },
        {
            "text": "We know from evidence that when women do have secure land ownership, the entire household benefits. Women increase their decision-making power, agricultural productivity, income, health and education spending, and investments in climate-resilient land practices. Conversely, land ownership insecurity limits women’s economic and social status and makes them and their families more vulnerable to poverty, eviction, conflict, land grabs, hunger and climate change.  "
        },
        {
            "text": "The Sustainable Development Goals 1 (No Poverty), and 5 (Gender Equality), call for reforms to give women equal rights to economic resources, including access to ownership and control over land and other forms of property, financial services, inheritance and natural resources."
        },
        {
            "text": "Of the 5.8 million people registered on Cadasta’s Platform in 3,556 communities across 44 countries across 20.6 million hectares of land, 53% of them are women and girls.  This is done through community and government engagement to change mindsets and practices, which complement the introduction of geospatial tools to achieve gender parity in the data."
        },
        {
            "text": "Another essential tool for strengthening women’s land rights is ensuring that women’s names are on formal land documents. From the outset, Cadasta Foundation helps partners develop clear localised gender inclusion strategies closing the gap between the law and the implementation of women’s rights."
        },
        {
            "heading": 2,
            "text": "In Her Name - Ampol Satyavathi’s story."
        },
        {
            "text": "Getting her name on a land title was a life-changing experience for Ampol Satyavathi, a local vendor in a small fishing village near Konark near the coast of the Bay of Bengal, in the Puri district in the state of Odisha, India. For 38 years, she lived in this informal community with no secure title to her home or land. Through a partnership with Tata Trusts and the state’s Jaga Mission, named the “world’s largest slum land settlement programme”and a winner of UN habitat award, her dream of owning her own place became a reality. “I now have the document that proves that this is my home and my business,” she said. “I feel more secure and am hopeful that this will help my business grow.”"
        },
        {
            "text": "Amy Coughenour Betancourt with Ampol Satyavathi, showing her land ownership documents. Image Credit: Cadasta Foundation "
        },
        {
            "text": "Facilitated by the use of geospatial technology and digital survey tools, the entire community has not only received land rights documents, but has also been upgraded with improved roads, markets, water, sanitation and lighting."
        },
        {
            "text": "For Ampol and her community, geospatial technology, participatory community mapping exercises and the resulting land rights have made a huge difference, not only for her, but also for her children. “The young people were the ones who proposed the road extension, the play area for the children and the fish storage area.” Empowering themselves through the collection and use of geospatial data not only secured Ampol’s land, it also set a course for the future of the whole community."
        },
        {
            "heading": 2,
            "text": "Mapping from the Ground Up"
        },
        {
            "text": "Considering women’s rights and participation every step of the way, Cadasta provides the technology and the geospatial tools which will help document women’s use of and claims to land. Making geospatial technology accessible allows the visualisation and understanding of data in new ways, which will further enable them to make decisions that will improve their lives. "
        },
        {
            "text": "The technology and geospatial mapping tools and workflows we provide, including digital survey data collection, support full community engagement and empowerment. Cadasta’s tools are taught to partners who then train community mappers and data collectors, including women and young people, within the community. Women data collectors help break down gender barriers during interviews with other women and model the power of women’s digital literacy for the rest of the community."
        },
        {
            "text": "Leveraging geospatial technology as a tool to lead efforts around gender equality, climate change action, land tenure and to create more sustainable communities brings wider benefits. Cadasta demonstrates the art of the possible – what real-world progress looks like on the ground. We mirror and reflect to global stakeholders what local partners can do to lead their own development with enterprise-level technology, technical support and targeted investments."
        },
        {
            "text": "In the context of Women's History Month this month, I issue a challenge to governments, multilaterals, businesses and philanthropists: If you care about women’s equality, then put your money where we know it will pay off today and over generations. Invest in lifting up women through land rights and access to enabling technology, including geospatial, to empower economic, social and environmental transformation across the globe."
        },
        {
            "heading": 2,
            "text": "About Cadasta"
        },
        {
            "text": "Founded in 2015, Cadasta is an award-winning non-profit global technology and services platform enabling vulnerable communities to affordably and easily document, map and secure inclusive land and resource rights for a more sustainable and equitable planet.  "
        },
        {
            "text": "By creating an accessible digital record of land, property and resource rights, and building local capacity, Cadasta helps empower individuals, communities, organisations, governments and businesses with the information they need to make data-driven decisions and put vulnerable communities and their needs on the map. Find out more about Cadasta's work."
        },
        {
            "text": "The Geospatial Commission is keen to reflect and make available a wide range of views and approaches, including those that may stimulate debate. The Geospatial Commission does not necessarily endorse the content provided by guest contributors."
        },
        {
            "text": "Sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}