{
    "url": "https://ukhsa.blog.gov.uk/2022/03/23/londons-communities-remain-vulnerable-to-covid-19-without-full-vaccine-protection/",
    "title": "London’s communities remain vulnerable to COVID-19 without full vaccine protection",
    "authors": [
        "Kevin Fenton"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-03-23T15:28:30+01:00",
    "content": [
        {
            "text": "Guest blog by Professor Kevin Fenton, London Regional Director of Public Health, Office for Health Improvement and Disparities"
        },
        {
            "text": "After more than two years of the COVID-19 pandemic, all corners of our lives have been impacted by the virus whether it’s our health, work, education, or social lives. But we learned very early on that some communities felt the consequences of COVID-19 harder than others, and although the picture has improved, that’s still as true today as it was two years ago."
        },
        {
            "text": "Thanks largely to the huge success of the vaccination programme, we can feel more confident in our ability to live more safely with COVID-19. The vaccine has been given all over the world and here in England, is estimated to have prevented around 157,300 people requiring hospital treatment. But it offers the best protection to those who have taken it and completed their vaccination course – first, second, third if required, and booster doses, and not all Londoners have yet done so."
        },
        {
            "text": "Recent analysis undertaken by ONS has revealed the ongoing disparities in vaccine uptake in adults aged 18 and over in London. Sadly, ethnicity and deprivation continue to be important and complex factors influencing whether Londoners are vaccinated or not. When adding in age, we see even greater disparities."
        },
        {
            "text": "Here’s what the data showed."
        },
        {
            "heading": 3,
            "text": "Some communities in London remain vulnerable "
        },
        {
            "text": "There is a clear ethnic disparity amongst unvaccinated adults in London. The highest proportion of unvaccinated Londoners were Black Caribbean (43.5%), followed by Black African (32%) and Mixed ethnicity (31.8%) Londoners. These are all statistically significantly higher than the proportion of unvaccinated White British and Indian Londoners."
        },
        {
            "text": "If we look at different age groups within each ethnicity, the proportion of Londoners who were still unvaccinated is highest in the younger age groups, ranging from 29.1% unvaccinated for those aged 18-29, to 6.6% unvaccinated in those aged 70 and over."
        },
        {
            "text": "In every ethnic group, the youngest adults aged 18-29 had the biggest proportion of Londoners still unvaccinated. Black Caribbean Londoners aged 18-29 years had the biggest proportion of unvaccinated adults (66.6%), followed by Black Caribbeans aged 30-39 years (63.2%)."
        },
        {
            "heading": 3,
            "text": "Deprivation continues to drive inequality"
        },
        {
            "text": "The new data also shows that deprivation continues to drive London’s disparities in vaccine uptake. It’s not unexpected that the proportion of unvaccinated adults in London is higher in the most deprived than in the least deprived groups. We see this when looking at London as a whole, and within different ethnic groups."
        },
        {
            "text": "Worryingly, at every level of deprivation, Black Caribbean and Black African or Mixed ethnicity Londoners are again, the least likely to be vaccinated."
        },
        {
            "text": "But what is more troubling is that despite being in the most affluent group, some of London’s communities were up to twice as likely to be unvaccinated than the most deprived Londoners in other ethnic groups."
        },
        {
            "text": "We see this when comparing the most affluent Black Caribbean and Black African Londoners to the most deprived Bangladeshi, Chinese, Indian, Pakistani and White British Londoners."
        },
        {
            "heading": 3,
            "text": "Live with COVID safely by getting vaccinated"
        },
        {
            "text": "This new data set clearly lays out the ongoing disparities between those in London who have had the vaccine, and not had the vaccine."
        },
        {
            "text": "There are around eight to nine million of us living in London. We are a large and immensely diverse city, so there isn’t a single, simple explanation for why your ethnicity, age and socioeconomic status might be factors influencing your vaccination status."
        },
        {
            "text": "We know that for many Londoners, the story is deep-rooted and complex. It’s about trust and confidence, questions and concerns about safety, dealing with myths and misinformation, challenges in accessing health services, prior infection with COVID-19, and cultural competency of services and authorities."
        },
        {
            "text": "Too many Londoners remain defenceless to the harms of COVID-19 by not having the full protection that the vaccine offers."
        },
        {
            "text": "Gaps in vaccine protection mean that London, and especially some communities within the city, could remain more vulnerable to serious outbreaks of COVID-19 and any potential future variants, which could be more severe."
        },
        {
            "text": "The last thing we want to see is some communities being hit repeatedly harder by this virus through continued reinfection, whether it’s missing work or school, being admitted to hospital, or experiencing the debilitating effects of Long Covid."
        },
        {
            "text": "Despite lower levels of vaccine uptake we are continuing to see people taking up their vaccine offers every day. We have made great strides throughout the pandemic to engage with London’s diverse communities and the messages and outreach programmes are working but we have more to do."
        },
        {
            "text": "For example, the interactive London Informed events saw participants posing questions to expert panels, which included representatives from the local community, and a summer health festival co-designed with young Londoners."
        },
        {
            "text": "It’s important that we continue to build on the legacy of what we’ve learned from the vaccination programme to engage with our communities in new and meaningful ways to improve health and wellbeing, address inequalities and apply lessons to other immunisations, prevention and health services."
        },
        {
            "text": "As we learn to live with this virus, please give yourself the best chance of doing so safely by having your full vaccination course and the booster. The vaccines are safe, they are effective, and they have stopped countless infections leading to people requiring hospital treatment, so get vaccinated now."
        }
    ]
}