{
    "url": "https://nda.blog.gov.uk/neurodiversity-celebration-week-autistic-adult-in-the-workplace/",
    "title": "Neurodiversity Celebration Week: Autistic adult in the workplace",
    "authors": [
        "clarefuller"
    ],
    "categories": [
        "diversity",
        "Safety and Wellbeing"
    ],
    "pub_date": "2022-03-23T16:47:21+00:00",
    "content": [
        {
            "text": "By Terri Hargreaves, Diversity and Inclusion Advisor, Sellafield"
        },
        {
            "text": "Since I received my official diagnosis in 2017, I have joined the Sellafield Ltd Nuclear Autism Support Network (NASN), and regularly contributed blogs which have focused on autism, mental health, and other topics that have interested me."
        },
        {
            "text": "This year, the NDA group's Enable Network has asked for people to contribute blogs for Neurodiversity Celebration Week, so in addition to making sure I had uploaded my previous blogs onto my NDA Hub profile for people to read at their leisure, I have also written this new blog which briefly outlines what I experience as the strengths and challenges of being an autistic adult."
        },
        {
            "text": "Autism is subtle and pervasive, there isn’t a single aspect of myself that isn’t affected by or the results of being autistic. I could literally write a book on this alone, but I’ll attempt to keep it brief by focusing on two main areas."
        },
        {
            "text": "Sensory differences"
        },
        {
            "text": "Many autistic individuals, and neurodiverse people in general, experience sensory differences, whereby they can be hyper-(over-) or hypo-(under-) sensitive to certain sensory input as a result of their brain’s interpretation of the information being provided by their senses."
        },
        {
            "text": "For me, I tend to be hypersensitive to visual, audio, and textural input, meaning that these things can cause me pain and discomfort."
        },
        {
            "text": "When it comes to the visual and audio, it’s not necessarily the brightness or volume that I’m sensitive to, although these things are factors. It can be the complexity or amount of noises present that causes me difficulties, and the pattern or contrast of colours."
        },
        {
            "text": "I have trouble filtering out unimportant noises; my brain seems to assume that I need to be aware and reacting to every noise my ears can pick up, which results in me looking like a meerkat and being very distracted. I try to minimise this using a few coping strategies, like finding a desk to use that is either in a corner or in one of the pods scattered around the open-plan office, wearing my Loop noise reduction earplugs (other brands are available, but these are the ones that work best for me), or even using headphones to play music or listen to a podcast on low, which gives my brain something to focus on rather than have it trying to alert me to every other noise in the surrounding area."
        },
        {
            "text": "As for the visual sensitivity, I always have sunglasses in my bag, car and any other place I can reasonably have them, but I also had a colorimetry test done at a local optician which has resulted in me having a pair of glasses with lenses the filter out parts of the light spectrum."
        },
        {
            "text": "My sensory to textures has the most affect on the clothes I chose to wear, as most commonly accepted ‘office wear’ is made from materials which I simply cannot tolerate on my skin. It makes more sense to me to wear what I am comfortable in so that I can concentrate more on my work, so if you see someone at work that isn’t quite dressed as you might expect them to be, don’t assume it’s for a negative reason (e.g. the person not bothering to make an effort), they might be managing their sensory differences."
        },
        {
            "text": "Social impairments"
        },
        {
            "text": "A core component of autism is impairments with the understanding and use of social communication and interactions. The best way I can explain this is that it’s like everyone else seems to have the various ‘unwritten’ rules of social interactions pre-installed in their brains, for autistic people this isn’t the case, and we have difficulty trying to figure them out by ourselves."
        },
        {
            "text": "For me, working with new people is hard for me because I don’t know what the ‘rules’ are for interacting with them; are they light-hearted and joke and tease as a form of acceptance, or are the jokes their way of expressing dislike? Even once I’ve become familiar with a person, I find it very hard to contribute to group conversations; I can usually follow them well enough, and enjoy some of the funnier stories being told, but I have trouble telling when I am expected to contribute, or when I can interject and add something to the conversation."
        },
        {
            "text": "This often results in me sitting at the side-lines of a conversation without being fully part of it; and once I realise this my mind tends to spiral down the path of ‘everyone must think you’re weird for not talking/saying the wrong thing at the wrong time, they’re just putting up with you because they have to’, then it’s only a matter of time before I find a way to remove myself from the situation entirely."
        },
        {
            "text": "This can give people the impression that I am antisocial, or ‘boring’, because I don’t interact socially often. It means that all too often I get inside my own head and convince myself that my presence anywhere is merely tolerated and that I’m never truly part of a team because I don’t know how to interact with them."
        },
        {
            "text": "Like many autistic individuals, it can take me a while to find my version of ‘comfortable’ in any given situation, and until I do I struggle with social interactions. In effect, when meeting me for the first time people are likely to be meeting my autism first, and my personality will be along shortly."
        },
        {
            "text": "I have found that even the things that I find challenging due to being autistic have proven to be strengths in the right environment and when surrounded by people who understand neurodiversity."
        }
    ]
}