{
    "url": "https://civilservice.blog.gov.uk/2022/03/23/time-to-reflect/",
    "title": "Time to Reflect",
    "authors": [
        "Adam Land, Senior Director at the Competition and Markets Authority"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-03-23T09:15:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "With life beginning to return to normal, approximately 6 million people globally have been bereaved since the pandemic, with many left unable to grieve their loss properly. Adam Land uses his final blog in our bereavement series to talk about the benefits of reflection."
        },
        {
            "text": "Wednesday 23 March is the ‘National Day of Reflection’. It was launched last year on the anniversary of the UK’s first lockdown as a landmark day to remember family, friends, neighbours and colleagues we've lost, and to support people bereaved during the pandemic. Millions took part in a minute’s commemorative silence. "
        },
        {
            "text": "An important part of the grieving process is taking time out for reflection. This allows us to remember, often with sadness, the person dearly missed. It also allows us,  given the passage of time, to take an opportunity to be grateful for our lives shared together. Reflection and remembrance can be a unifying and comforting experience. "
        },
        {
            "heading": 4,
            "text": "Walk to Remember"
        },
        {
            "text": "The same year that my daughter Eloise passed away, Matt Lewis, a teammate of mine, lost his wife, Claire, suddenly to sepsis. That year, Matt and I, along with colleagues at the Competition and Markets Authority, held a Walk to Remember. We wanted to commemorate our loved ones, raise funds for charities tackling the causes of their deaths and share our loss with our wonderful colleagues and friends who supported us through such a difficult period."
        },
        {
            "text": "Moving and cathartic"
        },
        {
            "text": "More than 50 colleagues took part in the first walk in 2018 in London and Edinburgh, which we repeated the following year, and again in a ‘hybrid’ way during 2021. I found the walks were a moving and cathartic experience, as they allowed me to take time to remember Eloise, with a tapestry of happy, loving family memories. This helped me with my own grieving process, as well as providing the opportunity to support colleagues through their own experience of loss."
        },
        {
            "heading": 3,
            "text": "“It's also ok to say you’re struggling”"
        },
        {
            "heading": 4,
            "text": "Matt Lewis, Assistant Director in the Remedies, Business and Financial Analysis team  "
        },
        {
            "text": "Some people still find it hard to talk about grief, but I warm to conversations about Claire. Reflecting on any happy thoughts and memories about those we’ve lost is really comforting. Equally, it’s also ok to say you’re struggling as this allows us to identify our shared feelings and discuss how to try to feel better. Making time for one another is so helpful."
        },
        {
            "text": "Commemoration"
        },
        {
            "text": "As part of the Civil Service’s work on bereavement and loss, we’ve worked with the Charity for Civil Servants to study ways in which colleagues and departments might come together to reflect on loss. "
        },
        {
            "text": "This includes commemorative ideas, such as holding our Walk to Remember to fundraise for a cause close to the bereaved or their loved one. It also includes online platforms such as MuchLoved to share photos, reflections, commemoration books and albums, and suggestions for events like National Grief Awareness Week which takes place every December. The Civil Service also recognises colleagues who died in service through naming awards or wellbeing spaces in their honour or holding a memorial service."
        },
        {
            "heading": 4,
            "text": "Restricted remembrance"
        },
        {
            "text": "Many people, including myself, who have experienced loss over the past two years have had very different experiences of death and funerals. We’ve not always been able to be with our loved ones at the end (or towards the end) of their life, and the usual rituals around funerals and remembrance were restricted in many cases. "
        },
        {
            "text": "People have found new and different ways to commemorate and mark the importance of their loved ones and what they meant to them. Alternative methods of commemoration can include planting a tree, holding a vigil, starting a new family tradition or putting a plaque on a bench that overlooks a beautiful view in their memory, where people can sit and take time to reflect. "
        },
        {
            "text": "Adam Land: I want to thank everyone who has contributed to the blog posts in this series by sharing a personal story. I also want to thank the many volunteers who lead on fantastic work across the Civil Service, running Bereavement Networks and hosting Grief Cafes to support colleagues through loss."
        },
        {
            "heading": 4,
            "text": "National Day of Reflection"
        },
        {
            "text": "You can find out more about the Day of Reflection by visiting the National Day of Reflection website or watching this short film that highlights the day."
        },
        {
            "heading": 4,
            "text": "A Modern Civil Service"
        },
        {
            "text": "A Modern Civil Service is one that is inclusive and responsive to colleagues. Understanding that events including bereavement and loss are part and parcel of life, recognising this in the workplace, offering support to colleagues, and taking the time to reflect can have a positive impact on the grieving process. "
        },
        {
            "heading": 4,
            "text": "More information"
        },
        {
            "text": "Civil Service HR has produced a series of useful resources, including a Guide for Managers to support staff navigating bereavement and loss. "
        },
        {
            "text": "Visit the Learning Platform for Government to access these resources. "
        },
        {
            "text": "Charity for Civil Servants"
        },
        {
            "text": "You can find a wealth of resources on the charity’s website and financial advice, including help with funeral expenses."
        }
    ]
}