{
    "url": "https://ukhsa.blog.gov.uk/2022/03/23/what-is-tb-and-what-are-we-doing-to-combat-it/",
    "title": "What is TB and what are we doing to combat it?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-03-23T13:42:45+01:00",
    "content": [
        {
            "text": "Tuberculosis (TB) is a bacterial infection spread through inhaling small droplets from the coughs or sneezes of an infected person. It mainly affects the lungs, but it can affect any part of the body, including lymph nodes (glands), bones and the brain causing meningitis."
        },
        {
            "text": "Typical symptoms of TB include a persistent cough that lasts more than 3 weeks, unexplained weight loss, night sweats, high temperature, tiredness and fatigue, loss of appetite and depending on site of disease, swellings of lymph nodes in the neck or back pain if TB affects the spine."
        },
        {
            "text": "It is a potentially serious condition, but it can be cured if it's diagnosed early and treated promptly with the right combination of specific antibiotics. The minimum length of treatment for non – drug resistant TB is a minimum of six months and much longer if treating a person with drug -resistant TB."
        },
        {
            "heading": 2,
            "text": "What is the situation with TB in England?"
        },
        {
            "text": "In England the story of TB prevention, detection and control has been a success, with the incidence of TB falling significantly since 2011, when it was among the highest in western Europe with almost 9,000 cases recorded in that year."
        },
        {
            "text": "However, in 2019 we saw that decline stop and instead, cases increased by 2.4%."
        },
        {
            "text": "In 2020, cases fell again, but we know that the COVID-19 pandemic interrupted services and impacted on diagnoses."
        },
        {
            "text": "Right now, cases numbers are just over  4,000 per year in England with the highest rates concentrated in large urban areas. For example, London accounted for 35.5% (1,464 out of 4,125) of cases, in 2020."
        },
        {
            "heading": 2,
            "text": "Who is most at risk?"
        },
        {
            "text": "Although almost anyone can get TB, the most at risk include those who live in, come from, or have spent time in a country or area with high levels of TB. Around three in every four TB cases in the UK affect people born outside of the UK."
        },
        {
            "text": "Other at-risk groups are:"
        },
        {
            "text": "One way that we work to detect cases quickly, get people on the right treatment early and reduce the spread is through pre-entry screening for individuals from a high incidence country who wish to migrate to England.  We also have free TB testing and treatment for people who are at risk but who might not have symptoms (this is known as latent TB infection) - which can be accessed via a GP."
        },
        {
            "text": "Contact your GP if you think you could be at risk."
        },
        {
            "heading": 2,
            "text": "What are we doing to drive down TB cases?"
        },
        {
            "text": "To enable the UK to meet its commitment to the World Health Organization (WHO) End TB by 2035 Strategy, UKHSA and NHS England have launched a 5-year action plan."
        },
        {
            "text": "This will build on the improvements in the prevention, detection and control of TB in England over the past 10 years and focus on 5 key priority areas to provide partners with the tools to reduce TB incidence in all our communities."
        },
        {
            "text": "The 5 priority areas are:"
        },
        {
            "text": "It is expected that missed and delayed diagnoses, late presentation of symptoms and delayed treatment will have increased the pool of undetected and unreported TB in the community, potentially leading to an increase in TB cases in the short term."
        },
        {
            "text": "Prevent and protect susceptible people in England from acquiring TB infection and developing active disease. This will include increasing latent tuberculosis infection testing and offering the BCG vaccine to all those eligible within 4 weeks of birth."
        },
        {
            "text": " Improve early detection of TB by identifying, investigating and acting on the components that contribute to patient delay."
        },
        {
            "text": "Prepare and respond to emerging threats from TB transmission clusters, outbreaks and incidents and drug resistant TB. This includes the rollout of the new National TB Surveillance System and the routine provision of whole genome sequencing data to TB services."
        },
        {
            "text": "Develop and maintain the healthcare workforce to ensure workforce capacity to detect, case manage and control TB."
        },
        {
            "text": "Read more information on the five year plan here and get more information on TB here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}