{
    "url": "https://mhclgdigital.blog.gov.uk/2025/06/18/creating-a-reusable-svelte-component-library-to-help-developers-build-data-rich-digital-products-faster/",
    "title": "Creating a reusable Svelte component library to help developers build data-rich digital products faster ",
    "authors": [
        "Andrew Hillman, Lead Data Visualisation Frontend Developer",
        "Tim Kershaw, Lead Data Visualisation Frontend Developer"
    ],
    "categories": [
        "Design",
        "Technology"
    ],
    "pub_date": "2025-06-18T09:24:57+01:00",
    "content": [
        {
            "text": "In recent weeks, our product development team has been building a Svelte component library to provide frontend developers with reusable Svelte 5 implementations of GOV.UK Design System components, as well as other custom components specifically tailored for data-rich digital products and services in government. "
        },
        {
            "text": "The full component library is due to launch this autumn but you can try it out right now or follow our progress on GitHub. "
        },
        {
            "text": "In this blog, we talk about the problem we’re solving, what we’ve done so far, and how this open-source library could help other frontend development teams across government with similar user needs. "
        },
        {
            "heading": 2,
            "text": "The problem "
        },
        {
            "text": "Imagine being a frontend developer who must create hundreds of bespoke web pages about local authorities that are easy for a citizen audience to find, understand and use. Imagine that these web pages are generated by datasets which are frequently updated as new data comes in.  "
        },
        {
            "text": "This is one of many challenges that product development teams like ours face.  "
        },
        {
            "text": "Across government, there is often a need to find clear and effective ways to communicate stories that otherwise remain hidden in large datasets. We found that, currently, there is no standardised solution to doing this while meeting the Government Service Standard. This results in duplication of effort and lack of consistency. "
        },
        {
            "heading": 2,
            "text": "Our solution: a component library "
        },
        {
            "text": "To address this problem, we’re developing a reusable component library. This project builds on successful innovations at the Office for National Statistics (ONS), which helped create a suite of products for the 2021 Census.  Users of our library – frontend developers – will be able to combine responsive components with their own data to build products fast.   The component library aims to: "
        },
        {
            "text": "An important part of this solution was the choice of frontend framework – Svelte. "
        },
        {
            "heading": 2,
            "text": "Why Svelte? "
        },
        {
            "text": "We chose Svelte as the foundation for our component library because of its exceptional benefits for government data-led digital services: "
        },
        {
            "heading": 2,
            "text": "The components we’re building "
        },
        {
            "text": "To date, we’ve developed the standard and familiar user interface components that form the basis of a GOV.UK web page, drawing inspiration from existing design systems. This includes elements such as the page header and footer, breadcrumbs, buttons, links, different ways of presenting text and more. "
        },
        {
            "text": "We’ve also made a good start on the most common data visualisation types: charts, maps and advanced table components. These are being developed with great care by data visualisation specialists to ensure maximum ease of use and comprehension.  "
        },
        {
            "text": "These components will continuously be added to and iteratively improved. They will allow frontend developers to quickly build visually rich products that: "
        },
        {
            "heading": 2,
            "text": "Accessibility "
        },
        {
            "text": "We take accessibility seriously, and carefully develop all our components to meet the highest standards. We will have our components audited before moving to Beta, with the aim that all components meet WCAG 2.2 AA standards.  "
        },
        {
            "text": "Accessibility for data visualisation is a particular challenge where we’re working especially hard to be best in class. "
        },
        {
            "heading": 2,
            "text": "User testing "
        },
        {
            "text": "Our user research team is testing the components on future users. We learn and iterate. "
        },
        {
            "heading": 2,
            "text": "Want to be involved? "
        },
        {
            "text": "We're actively developing the component library for use on multiple products due to be launched later this year.  "
        },
        {
            "text": "Once those products are published, we intend to iterate the library before inviting the wider government digital community to use it for their own projects.  "
        },
        {
            "text": "In the meantime, we're keen to collaborate with other teams in government.   We’d love to hear from you if:"
        },
        {
            "text": "Contact our project lead Andrew Hillman, lead data visualisation frontend developer. "
        },
        {
            "text": "The brilliant team of developers and designers delivering this work also includes: Camilla Jones, Duncan Bradley, Glenn Herbert, Ibrahim Haizel, Miles Hinchliffe and Mike Lister. "
        }
    ]
}