{
    "url": "https://mojdigital.blog.gov.uk/2025/06/18/delivering-transformation-at-scale-what-we-have-learned-from-evolve/",
    "title": "Delivering Transformation at Scale: What we have learned from Evolve",
    "authors": [
        "Emma Porter",
        "Rob Ashworth"
    ],
    "categories": [
        "Digital Transformation",
        "Our services",
        "Technology"
    ],
    "pub_date": "2025-06-18T09:28:18+01:00",
    "content": [
        {
            "text": "At Justice Digital, we are working to make sure every colleague across the Ministry of Justice (MoJ) has the technology they need to do their job, whether they are in a prison, probation site, courtroom, contact centre or working from home."
        },
        {
            "text": "For the last few years, we’ve been part of a major digital transformation programme called EVOLVE. This portfolio is more than just tech upgrades, it's about replacing outdated legacy contracts, reducing costs, improving flexibility, and building modern digital foundations across the department."
        },
        {
            "text": "We have learned a huge amount about leading large-scale change in government. In this blog, we wanted to share what we’ve delivered, what has made a difference, and what it really takes to land change at this scale."
        },
        {
            "heading": 2,
            "text": "What is EVOLVE?"
        },
        {
            "text": "EVOLVE is a portfolio of nine complex workplace technology projects. It was created to move us away from large, inflexible, outsourced IT contracts, and towards a more sustainable, cost-effective and user-centred model."
        },
        {
            "text": "It includes:"
        },
        {
            "text": "It’s a shift that touches almost every part of the MoJ and HMCTS. Crucially, it's not a \"lift and shift\", we are building new ways of working, not replicating the old."
        },
        {
            "heading": 2,
            "text": "What we have delivered"
        },
        {
            "text": "Here are some of the big milestones we are proud of:"
        },
        {
            "text": "Laptops for frontline teams"
        },
        {
            "text": "We have upgraded over 34,000 users to MoJ Official, the new technology platform."
        },
        {
            "text": "We are issuing over 2,500 laptops to HMCTS users who didn’t previously have one, enabling flexible, secure working on the move or in the courtroom. These are being deployed ahead of any desktop removals so staff can adjust and continue working smoothly."
        },
        {
            "text": "Responsible tech decommissioning"
        },
        {
            "text": "We have implemented a new process that securely wipes, assesses and  where possible recycles or reuses old equipment through our supplier. This reduces waste, supports sustainability, and means public money isn’t being spent on kit that’s no longer needed."
        },
        {
            "text": "Hybrid working by default"
        },
        {
            "text": "Our teams have delivered dual monitor “hot desk” setups and streamlined support processes to enable true hybrid working. This means colleagues can confidently work across MoJ sites with the same access and performance they would expect from a permanent desktop setup."
        },
        {
            "heading": 2,
            "text": "What we have learned"
        },
        {
            "text": "1. This isn’t just about tech – it’s about people"
        },
        {
            "text": "The impact of COVID changed how people work. And while we’ve adapted tech, behaviours have been slower to catch up. Getting people back into offices, encouraging face-to-face collaboration, or even using the kit effectively all take sustained effort and engagement."
        },
        {
            "text": "We learned that you can’t simply deliver hardware or switch systems and expect instant adoption. You have to bring people with you – explaining the why, listening to their concerns, and showing them the value, explaining the benefits and what’s in it for them."
        },
        {
            "text": "2. Flexibility must come with value for money"
        },
        {
            "text": "The Evolve portfolio has helped us create a much smarter workplace footprint, supporting device rationalisation, flexibility and driving better value. Maintaining this balance is crucial in today's financial climate. Through upgraded devices and efficiency initiatives will save money and improve productivity."
        },
        {
            "text": "3. Delivery at scale needs negotiation and trust"
        },
        {
            "text": "We joked in a recent session that the secret to transformation is turning “impossible” into “done” sometimes through in-depth negotiation and honestly, there’s some truth in that. When delivering change that affects thousands of people and dozens of stakeholder groups, the process is rarely linear."
        },
        {
            "text": "It takes trust, persistence, and being open to changing your approach. Sometimes you need to slow down and consult more deeply. Sometimes you need to move fast to unlock momentum. It’s a constant balance."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We’re still working hard to land the final pieces of EVOLVE and make sure the benefits are not just delivered, but sustained. That includes:"
        },
        {
            "text": "We are also thinking about how we package up what we’ve learned potentially as a future blog or internal playbook on managing change in large, complex systems."
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "Digital transformation in government is hard and messy but it’s also incredibly rewarding. Through EVOLVE, we’re not just replacing contracts. We are setting the foundations for a more flexible, user-centred and cost-effective justice system."
        },
        {
            "text": "Thanks to everyone across Justice Digital, HMCTS, and the wider MoJ who’s been part of this journey so far. We have still got more to do but we’re proud of how far we’ve come."
        }
    ]
}