{
    "url": "https://buyingforschools.blog.gov.uk/2025/06/18/dfe-launches-school-estate-management-standards-to-support-all-schools-to-manage-their-estates-effectively/",
    "title": "DfE launches School Estate Management Standards to support all schools to manage their estates effectively",
    "authors": [
        "David Fugurally, Head of School Estate Management Standards, Competencies & Skills"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2025-06-18T13:16:59+01:00",
    "content": [
        {
            "text": "The new School Estate Management Standards provide a clear framework to help school leaders and estates management professionals manage their school estates well. In this blog David Fugurally, Head of School Estate Management Standards, Competencies & Skills, explains how they will benefit your school.  "
        },
        {
            "text": "At the Department for Education (DfE) we are dedicated to breaking down the barriers to opportunity and creating chances for all children and learners to achieve and thrive. "
        },
        {
            "text": "A well-managed and well-maintained school site provides the fundamental environment necessary to achieve this, and our ambition to deliver the best education to our children and to give them the best start in life. "
        },
        {
            "text": "Keeping estates operational and safe for pupils, and staff, is a complex undertaking, involving a huge number of vital functions, processes and planning delivered by experienced and qualified professionals. "
        },
        {
            "text": "The Department is committed to working with schools to support them in the good work they already do to manage their sites effectively. "
        },
        {
            "text": "However, many have told us that the vast amount of guidance and regulation that is available can often be overwhelming and unclear, particularly for schools that are at the start of their journey to fully effective estate management. "
        },
        {
            "text": "That’s why we have published the new School Estate Management Standards, bringing together in one succinct and easy-to-understand document the key points of existing government guidance, other advice and regulation. "
        },
        {
            "heading": 3,
            "text": "Comprehensive support package"
        },
        {
            "text": "They will now sit alongside the Estate Management Competency Framework (published June 2023), as part of our comprehensive support package for schools. "
        },
        {
            "text": "The management standards focus on putting the right processes in place, while the competency framework is about having the right people in post and building their relevant knowledge and skills. "
        },
        {
            "text": "The new standards, developed in collaboration with schools and sector representatives, clarify the department’s expectations of schools and responsible bodies (RBs) and represent a structured approach to estate management. "
        },
        {
            "text": "They are designed to help schools prioritise projects within their estate, build on good practice, and meet legal requirements, and address key areas including: "
        },
        {
            "text": "The document is full of practical advice on the basics of managing a school estate, and how to progress to fully achieving effective practice. It also signposts users to additional expert advice - such as the Good Estate Management for Schools manual (GEMS).  "
        },
        {
            "heading": 3,
            "text": "Enhance how you manage your school estate"
        },
        {
            "text": "Our aim is to support all schools in a practical and non-judgemental way, to understand where to start, how to progress, and how to make best use of the wealth of guidance available.  "
        },
        {
            "text": "The estate management standards represent a significant opportunity to enhance how you manage your school estate. By providing a clear framework for progression through four distinct levels, from essential practices to advanced management, they will help ensure your estate supports safe, effective learning environments while meeting legal requirements. "
        },
        {
            "text": "All schools should aim to reach at least Level 3 (Fully Effective) with Level 4 (Advanced) representing an opportunity to become sector leaders in estate management, if this aligns with your strategic aims. "
        },
        {
            "text": "These clearly defined levels allow you to assess your current practices; identify areas for improvement; plan strategic development of your capabilities and document progress for governors, trustees and inspectors. "
        },
        {
            "text": "Further support is available by joining The Trust Network, a DfE-backed body committed to supporting school estates managers to create and maintain environments that enhance teaching and learning. Membership is free and provides professionals with networking opportunities, regular updates, access to exclusive webinars, and much more. "
        },
        {
            "text": "At the department we are hugely appreciative of everything that you do to ensure our school sites are safe and support our children and young people and all those who work with them. "
        },
        {
            "text": "These standards have been created as a direct result of your feedback and collaboration, and we hope that you will find this new resource beneficial in supporting that vital work. "
        },
        {
            "text": "Download and read the School Estate Management Standards document now – and use it as a valuable tool to support the effective management of your school estate.   "
        }
    ]
}