{
    "url": "https://ukhsa.blog.gov.uk/2025/06/18/how-to-avoid-rabies-and-what-to-do-if-youre-exposed-while-travelling/",
    "title": "How to avoid rabies and what to do if you’re exposed while travelling",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Protecting the country's health",
        "Travel"
    ],
    "pub_date": "2025-06-18T12:28:00+01:00",
    "content": [
        {
            "text": "Rabies is a rare but deadly viral infection that affects the brain and nervous system. Human cases of rabies are extremely rare in the UK but the infection poses a risk to travellers visiting regions where the disease remains prevalent."
        },
        {
            "text": "It is typically transmitted via the bite or scratch of an infected animal. Dogs are the most common carriers, but it can be found in cats, bats, monkeys and other mammals. There are no documented cases of human-to-human transmission of rabies. Once symptoms develop in an infected person after they have been exposed, it is almost always fatal."
        },
        {
            "heading": 2,
            "text": "Preparing for travel abroad"
        },
        {
            "text": "If you are travelling to a country with rabies, it’s important to know how to prevent the infection and what actions to take following potential exposure. There is information on the Travel Health Pro website about which countries are affected by rabies and when you should consider a rabies vaccine before travel."
        },
        {
            "heading": 2,
            "text": "Recognising symptoms"
        },
        {
            "text": "Rabies symptoms typically appear within 3 to 12 weeks after exposure (commonly animal bites or scratches), though this timeline can vary. Early signs may be non-specific and include fever, headache, and discomfort at the bite site."
        },
        {
            "text": "As the infection progresses, more serious symptoms develop, including confusion, muscle spasms, and difficulty swallowing."
        },
        {
            "heading": 2,
            "text": "Preventing rabies while travelling"
        },
        {
            "text": "Prevention is crucial when visiting countries where rabies is endemic, particularly in parts of Asia, Africa, and Central and South America. Travellers should consider these preventive measures:"
        },
        {
            "heading": 2,
            "text": "Responding to potential exposure"
        },
        {
            "text": "If you are bitten, scratched, or licked on broken skin by an animal in a rabies-endemic country, take these immediate steps:"
        },
        {
            "text": "The UK is free from rabies in animal populations, but rabies-like viruses have been found in some bats in the UK. If you're bitten by a bat in the UK, contact your doctor promptly for assessment and possible vaccination."
        },
        {
            "heading": 2,
            "text": "Vaccine effectiveness"
        },
        {
            "text": "A full course of pre-exposure rabies vaccines will provide good protection from rabies for most people. People who completed their full course of rabies pre-exposure vaccine over a year ago and are travelling again to a high risk area for rabies can have a single booster dose."
        },
        {
            "text": "However, it is still important to seek medical advice if you are bitten, scratched or licked on broken skin by an animal overseas. If you had a full course of pre-exposure vaccines before travel, even years beforehand, you will only need two additional rabies vaccine doses after an exposure and will not need immunoglobulin."
        },
        {
            "text": "Once symptoms develop, there is no effective treatment, and the disease is usually fatal, so getting medical attention as fast as you can is really important."
        },
        {
            "heading": 2,
            "text": "Rabies in the UK"
        },
        {
            "text": "The UK has been free from rabies in animals other than bats since 1902, making domestic infection extremely rare."
        },
        {
            "text": "Some UK bat species can carry European Bat Lyssaviruses (EBLVs), rabies-like viruses that caused the death of a professional bat handler who sustained several bites in Scotland in 2002. Most human rabies cases reported in the UK are acquired abroad, with 6 such cases recorded between 2000 and 2024."
        }
    ]
}