{
    "url": "https://ipo.blog.gov.uk/2025/06/18/nellie-technologies-from-sushi-to-carbon-dioxide-removal/",
    "title": "Nellie Technologies: from sushi to carbon dioxide removal ",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "Innovation",
        "Patents",
        "Trade marks",
        "Universities"
    ],
    "pub_date": "2025-06-18T10:30:00+01:00",
    "content": [
        {
            "text": "We can't see it, it's undetectable to human senses but it's shortening thousands of lives each year. According to Global Action Plan (the environmental charity behind Clean Air Day), air pollution claims between 29,000 and 43,000 lives in the UK annually. The World Health Organization and UK Government identify it as one of our greatest environmental health threats. "
        },
        {
            "text": "Meet the inventive minds at Nellie Technologies. Nominated for the Earthshot Prize (the prestigious international award that recognises organisations making a positive environmental impact), Nellie is fighting air pollution with protected intellectual property (IP) that's actively pulling carbon dioxide from our atmosphere.  "
        },
        {
            "text": "Their bioengineered carbon removal system transforms harmful emissions into valuable biochar, a special charcoal-like substance that adds structure and nutrient content to soil, acting as a bio-fertiliser. But most importantly, it sequesters (isolates) the carbon that the process has taken out of the atmosphere. "
        },
        {
            "text": "We caught up with Nellie Technologies Founder and Chief Executive, Stephen Milburn, to hear about the team’s carbon removal technology and how IP protection has played a part in their business."
        },
        {
            "heading": 3,
            "text": "\"I never thought I'd be an inventor!\" "
        },
        {
            "text": "A physics graduate from Bristol University, Stephen’s journey to clean air tech began, unexpectedly, with a bold attempt to bring authentic Japanese cuisine to Bristol.  "
        },
        {
            "text": "\"I opened a sushi bar because I lived in Japan for a while and thought I could make the world's best sushi!\" Stephen’s inspirational “anything is possible” approach was a recurring thread right through his story. "
        },
        {
            "text": "When delivery trucks couldn't navigate the narrow alley to his shop, Stephen bought a van to fetch supplies from London himself. That van led to more vehicles, and soon his business pivoted unexpectedly from sushi to a thriving haulage company with a fleet of trucks."
        },
        {
            "text": "After selling his haulage business, Stephen started a software company. During a software project for a Swedish industrial client struggling with emissions management, the lightbulb moment arrived: \"I realised we could capture carbon using microalgae bioreactors.\" "
        },
        {
            "text": "As microalgae grows, it naturally captures carbon and uses it for photosynthetic processes. Today, Nellie Technologies removes 100 tonnes of CO2 annually, converting it to biochar that locks carbon away for more than 1,000 years.  The patented process for accelerating microalgae growth has now positioned Nellie at the cutting edge of carbon removal technology.  "
        },
        {
            "text": "Stephen told us the work that led to development of the patent took place at the AberInnovation development hub at Aberystwyth University. This is an integrated state-of-the-art development facility supporting the acceleration of agri-tech innovation.  "
        },
        {
            "heading": 3,
            "text": "Scientific solutions "
        },
        {
            "text": "Stephen explained Nellie’s innovative approach to carbon removal in refreshingly straightforward terms:"
        },
        {
            "heading": 3,
            "text": "Measuring impact "
        },
        {
            "text": "Nellie measures the efficiency of their system through biomass production. \"How we measure the efficiency is basically how much biomass comes out of the system,\" Stephen explained. \"Because of the molecular structure, we know what CO₂ is removed. Everything that we do is focused on increasing the biomass growth rate.\" "
        },
        {
            "text": "This focus on biomass growth rate is what their granted patent covers – a method to enhance the efficiency of their carbon removal process. "
        },
        {
            "heading": 3,
            "text": "Investing in patents "
        },
        {
            "text": "When we asked Stephen about why patenting their technology was important to the team, he was clear about the commercial imperative: "
        },
        {
            "text": "For Nellie Technologies, patents are essential for attracting investment. Stephen elaborated: \"With carbon dioxide removal companies, we will not be profitable until several years down the line. So, when you're asking an investor for multiple millions to bring this idea to market, you need something to base that on. The IP is really the critical pillar there.\" "
        },
        {
            "heading": 3,
            "text": "Fast and green  "
        },
        {
            "text": "Nellie Technologies used the IPO's Green Channel service when applying for the patent, which Stephen found invaluable. "
        },
        {
            "text": "Learn more about using the Green Channel to accelerate your patent processing here [link]: Patents: accelerated processing - GOV.UK "
        },
        {
            "heading": 3,
            "text": "The Phycochar trade mark "
        },
        {
            "text": "The company owns a trade mark for the word \"Phycochar\" – a term that combines elements of their unique process. Stephen explained the importance of trade mark protection alongside their patent strategy. "
        },
        {
            "heading": 3,
            "text": "Advice for other clean tech innovators "
        },
        {
            "text": "For other clean tech businesses looking to protect their IP, Stephen emphasised the importance of professional guidance."
        },
        {
            "text": "Stephen highlighted the value of working with patent attorneys Abel and Imray. "
        },
        {
            "text": "If you are looking for advice on making the first step in protecting your invention or business visit this link: Seeking intellectual property advice - GOV.UK "
        },
        {
            "heading": 3,
            "text": "Auditing Nellie’s IP "
        },
        {
            "text": "Stephen was candid about how crucial government support has been for Nellie’s IP strategy. The IPO’s IP Audit and IP Access financial support programmes were particularly helpful in assisting the business to identify its IP assets and manage them effectively. "
        },
        {
            "text": "The IP Audit helped Nellie Technologies prioritise which innovations to protect.  "
        }
    ]
}