{
    "url": "https://marinedevelopments.blog.gov.uk/2025/05/02/coastal-marine-planners-spring-edition/",
    "title": "Coastal Marine Planners - Spring Edition",
    "authors": [
        "Kathleen Telford, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-05-02T08:59:47+01:00",
    "content": [
        {
            "text": "We share highlights from across the marine plan areas, showcasing our engagement, events, and collaborative initiatives. From student workshops and coastal restoration to conference presentations and policy support, the coastal planners continue to champion sustainable marine management around our coast."
        },
        {
            "text": "North East"
        },
        {
            "text": "Kathleen and colleagues from the Strategic Renewables Unit delivered a Marine Spatial Planning (MSP) Challenge Game to students at the University of Stirling for the second year as part of our university outreach initiative. It was wonderful to see the students grow in confidence as they navigated the competing interests and developed a deeper understanding of the stakeholder engagement needed to manage the marine environment effectively. A huge thank you to the university for making us feel so welcome."
        },
        {
            "text": "Closer to home, Kathleen joined the Durham Heritage Partnership as they shared their achievements in regenerating and enhancing the natural beauty of the heritage coastline. These efforts include funding to create a mosaic habitat, with over 100 volunteers taking part in tree and seed planning, as well as Sustainable Drainage Systems funding to support nature-based solutions that improve soil health and river conditions. The partnership also worked on defining a route though Hartlepool for the King Charles III England Coast Path. It was great to hear about the positive progress being made in our region."
        },
        {
            "text": "East"
        },
        {
            "text": "Mark and Char have been working closely with the Environment Agency, Wildfowl and Westlands Trust and other partners in the East to support two major regional conferences; EASTME and The Coastal Practitioners Conference. These events bring together marine stakeholders to share knowledge and to help drive innovation in the marine space."
        },
        {
            "text": "In the northern part of the plan area, North Yorkshire Council published their Local Development Scheme, outlining their planned outputs for the next five years. Mark and Kathleen are meeting with policy advisors to promote alignment between marine and terrestrial policies."
        },
        {
            "text": "Local plans across Norfolk, Suffolk and Cambridgeshire are currently under revision, and the Norfolk and Suffolk Local Nature Recovery Strategies (LNRS) Public Consultation is now open. Char will be working closely with the relevant authorities to submit full consultation responses - an essential step in aligning marine and terrestrial plans and policies, encouraging better protection of the marine space and its assets."
        },
        {
            "text": "South East"
        },
        {
            "text": "This year, Marie has focused on engaging with Local Planning Authorities (LPAs) in the south east marine plan area, whose local plans are in the early stages of development. In these meetings Marie discussed the links between the priorities outlined in their plans and the ways in which the South East Marine Plan can help to deliver these. Marie also delivered a bespoke implementation session for LPA planning teams, outlining strategic overlaps with the South East Marine Plan. Through this focused engagement we are equipping planning teams with the tools to integrate marine plans into their processes while fostering strong, ongoing collaboration."
        },
        {
            "text": "Marie also facilitated the MSP Challenge Game with colleagues at the Coastal Futures Conference 2025. The session showcased the complex interactions between marine activities and the decision-making required to be able to successfully manage the marine environment through effective planning."
        },
        {
            "text": "South (East)"
        },
        {
            "text": "As a new team member, Eva has been getting to know her role, by attending meetings, such as the Solent Forum, where stakeholders from academia, the water industry and others presented. Eva also participated in the Sussex Kelp Summit, which explored the ecological importance of kelp and the efforts of Sussex Kelp Recovery Project. You can learn more here: Kelp Summit 2025 | Sussex Kelp Recovery Project. Eva is looking forward to growing and expanding my knowledge in this new role."
        },
        {
            "text": "South (West)"
        },
        {
            "text": "Rosie and Charlotte co-delivered two MSP Challenge Game sessions in Guernsey, engaging local deputies and officers though this interactive tool to build understanding of marine planning. Charlotte also presented on marine planning at the British Marine Coastal Conference to leisure and small commercial marine sector representatives, alongside MMO’s Marine Conservation and Licensing teams. Additionally, Charlotte represented the MMO at the British Ports Association's Small Ports Conference in Cowes, Isle of Wight which provided valuable insight into the priorities and challenges facing smaller ports."
        },
        {
            "text": "South West"
        },
        {
            "text": "In March, Ellie led a MSP Challenge Game workshop at Cardiff University for third-year Marine Environmental Systems students. The session was run in collaboration with the Severn Estuary Partnership, who brought valuable local insights, enhancing the students' learning experience. She has also worked with planning authorities, contributing to the South Gloucestershire Local Plan and supporting efforts with Gloucestershire’s Local Planning Authority."
        },
        {
            "text": "Ellie and Mae jointly delivered MSP Challenge Game workshops for Masters Marine Conservation students at Plymouth University and facilitated a Marine Plan Policy Assessment workshop for Environmental Law of the Sea students. These sessions introduced students to the statutory obligations under section 58(1) of the Marine and Coastal Access Act 2009, which requires public authorities to consider marine plans in decision-making processes. Using case studies to show how marine plans influence licensing decisions and planning applications, gaining practical insights into marine governance and policy implementation."
        },
        {
            "text": "They also attended a national ocean literacy workshop - part of a wider effort to co-develop an ocean literacy strategy for England. Organised by the Diverse Marine Values project, Defra, and the Ocean Conservation Trust, the event built on the 2022 UK-wide ocean literacy assessment. It brought stakeholders together to map current ocean literacy activities, identify gaps and set priorities for a co-designed national strategy."
        },
        {
            "text": "Karrie Schnetler from Marine Licensing supported marine planning by presenting at both the South West Marine Environment group webinar and conference, explaining the Marine Licensing processes and related assessments."
        },
        {
            "text": "North West"
        },
        {
            "text": "This spring, Chloe attended the Coastal Habitat Restoration and Creation Conference hosted by the North West Coastal Forum (NWCF), where experts shared learning and best practice in coastal habitat restoration projects in North West England. Stakeholders from around the UK came to the conference to celebrate the winners of the North West Awards for Coastal Excellence. The event included a site visit to the Solway Coast, to explore the Solway Firth Partnerships CLEARcoasts project, focusing on potential saltmarsh restoration."
        },
        {
            "text": "In early April, Chloe also led a MSP Challenge Game with Peel Ports. She would like to thank everyone who attended. These sessions aim to improve facilitation skills and broaden perspectives on marine spatial planning."
        }
    ]
}