{
    "url": "https://cspl.blog.gov.uk/2025/05/02/risk-and-responsibility/",
    "title": "Risk and Responsibility",
    "authors": [
        "Dame Clare Moriarty DCB"
    ],
    "categories": [
        "Early Warning Signs",
        "Ethical standards",
        "Leadership"
    ],
    "pub_date": "2025-05-02T11:23:48+01:00",
    "content": [
        {
            "text": "Dame Clare Moriarty DCB, Chief Executive of Citizens Advice, reflects on the Committee’s Early Warning Signs report. "
        },
        {
            "text": "Reading the Early Warning Signs report made me reflect on a number of experiences during my civil service career when things went wrong.  Top of the list was the collapse of the West Coast Mainline (WCML) franchise competition in 2012, when I was a Director General in the Department for Transport. "
        },
        {
            "text": "The big takeout from that chapter of my life was about risk.  We tend to think of risk as something to be mitigated, managed down - ideally avoided altogether.  But the reality is that we live with risk all the time.  Deciding to do something involves taking a risk, but deciding not to do something does too, and we often over-weight the risks most visible to us while under-weighting less visible ones.  The answer is not to try and make risk go away but to focus on understanding the whole landscape, and make good risk judgements that take account of the trade-offs involved."
        },
        {
            "text": "There were a whole range of factors that led to the collapse of the WCML franchising competition, many of them recognisable in the Early Warning Signs report.  But for me a key one was risks being taken without proper sight of the consequences.  Analytical mistakes were missed because the risk of delay dominated people’s thinking, and the risk of something going wrong felt remote.  Procedural shortcuts were agreed by a sub-committee acting on its own authority, when decisions should have been escalated to a level where their consequences were visible."
        },
        {
            "text": "In the aftermath of the various inquiries into the franchising collapse I became the Director General for Rail.  As we grappled with rebuilding our capability, our confidence and our reputation, risk was once more the central issue.  "
        },
        {
            "text": "As we prepared to restart the franchising programme, one team focused on the risk of rushing things and argued that we should delay issuing an invitation to tender; another team focused on the risk to market confidence of delay, and wanted to press on.  Creating space for them to have the right conversation, understand risks in the round, and jointly identify the best set of mitigations was critical to being able to move forward."
        },
        {
            "text": "Periodically people would come to me saying ‘it feels like West Coast’ as they experienced tensions that they associated with the period leading up to the franchise collapse.  I developed a practice of almost physically relieving them of the burden of the risks that they identified.  They had done their job in spotting the risks and bringing them to me; it was mine, and that of my boss the Permanent Secretary and others, to decide which risks to take, and to bear the responsibility of doing so. "
        },
        {
            "text": "I learnt a huge amount in that period about sitting with risk, managing it and above all being open to those who raised risks with me.  I come back to that regularly in my present role as Chief Executive of Citizens Advice.  As the membership body for a large network of charities, we are the escalation point for complaints about local Citizens Advice from clients and employees.  We are several steps removed from the specifics of any case and at a distance it’s hard to judge the merits of a complaint.  There’s always a plausible explanation for what happened, and also always one more question that could be asked.  And neither asking, or not asking, that last question is risk-free. "
        },
        {
            "text": "Any of those complaints might be the ‘canary in the mine’, the early warning sign that, if acted on, could prevent a major failure of the kind that the CSPL review explored.  Equally, it might not.  In hindsight it’s very clear where things have gone wrong but in the moment, distinguishing signal from noise can be genuinely difficult.  I’ve learned over time to pay attention to an internal ‘dissonance meter’ which goes off if things don’t feel quite right, even if I can’t pin down why in the moment.  As the report says: “when something goes wrong, it is often the case that 'someone knew'”.  The important thing is that we keep our minds open, understand risk and value our instincts."
        }
    ]
}