{
    "url": "https://nationalscreening.blog.gov.uk/2025/05/02/sign-up-for-uk-nsc-online-seminar-on-breast-screening-and-breast-density/",
    "title": "Sign up for UK NSC online seminar on breast screening and breast density",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "Breast Screening"
    ],
    "pub_date": "2025-05-02T08:07:41+01:00",
    "content": [
        {
            "text": "UK National Screening Committee (UK NSC) seminars, held online via MS Teams, are free for anyone to attend. They provide an opportunity to hear from clinicians and experts on a variety of topics relating to screening tests and screening programmes."
        },
        {
            "heading": 2,
            "text": "Breast density and mammography"
        },
        {
            "text": "Women with dense breast tissue are at greater risk of breast cancer. They are more likely to have a cancer missed by screening, as dense breast tissue and abnormal breast tissue can have a similar appearance on a mammogram."
        },
        {
            "text": "This seminar will look at the increasing evidence for offering additional screening tests to women with dense breasts."
        },
        {
            "text": "The session will be chaired by Prof Anne Mackie, the UK NSC Director of Programmes. Our presenters will be:"
        },
        {
            "text": "There will be a panel Q&A session following the presentations."
        },
        {
            "heading": 2,
            "text": "UK NSC seminars"
        },
        {
            "text": "Anyone with a role or interest in screening is welcome to register for our seminars (see the link above). Feel free to share the details with colleagues."
        },
        {
            "text": "Please note our seminars are not recorded, but we share the presentation slides in our blog and via our UK NSC seminars webpage."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}