{
    "url": "https://moderncivilservice.blog.gov.uk/2025/05/02/your-guide-to-civil-service-live-2025/",
    "title": "Your guide to Civil Service Live 2025",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Civil Service Live",
        "Government Reform",
        "Innovation",
        "Proud Civil Servant"
    ],
    "pub_date": "2025-05-02T12:42:17+01:00",
    "content": [
        {
            "text": "Civil Service Live 2025 begins in Glasgow on 10 June, and registration for all events is now open. Much like last year, there will be a wealth of in-person and virtual sessions to attend throughout June and July. You can see the agenda for each location and what you can register for both online and in-person, so act now to secure your place."
        },
        {
            "text": "To get started, sign up to the Civil Service Live website, then follow these steps to register for a session or in-person event."
        },
        {
            "heading": 2,
            "text": "How to register for Civil Service Live 2025"
        },
        {
            "text": "To ensure you don’t miss out, follow these quick and easy steps:"
        },
        {
            "heading": 2,
            "text": "When and where are the events?"
        },
        {
            "text": "Civil Service Live is taking place across the UK this summer:"
        },
        {
            "heading": 2,
            "text": "What to expect at Civil Service Live"
        },
        {
            "text": "If this is your first time attending an event in-person, you may be wondering what you can expect. Civil Service Live is a great opportunity to network with your peers and explore what other departments are up to. You’ll be able to gain insight into the Government’s missions and the Plan for Change, as well as be the first to know any new announcements from keynote speeches."
        },
        {
            "text": "Many sessions will be available to attend - and some are available online, too - where expert speakers will share their experiences, tips and innovative new ideas. The main focus of sessions this year will be:"
        },
        {
            "text": "There’s a host of new sessions this year that will help you navigate your career journey and expand your knowledge, such as:"
        },
        {
            "text": "There will be an opportunity to take part in a Q&A with the Cabinet Secretary and Civil Service Chief Operating Officer. Workshops will also be available throughout Civil Service Live as well as one-to-one mentoring sessions, speed-networking and, of course, many of your colleagues will be presenting some fantastic exhibits in the main halls. "
        },
        {
            "text": "By the end of this year’s Civil Service Live, you should have a better understanding of the role you play in delivering the Plan For Change, as well as getting your input into how we make our Civil Service even more proud, productive and agile in delivering for citizens."
        }
    ]
}