{
    "url": "https://environmentagency.blog.gov.uk/2021/12/23/floods-and-dredging/",
    "title": "Floods and dredging: explaining the Environment Agency’s approach",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Flood",
        "Flood Planning"
    ],
    "pub_date": "2021-12-23T10:55:49+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What is dredging and desilting?"
        },
        {
            "text": "Dredging and desilting are methods that we use to remove an accumulation of silt material, such as fine gravels or soils that have been washed into rivers from surrounding land in the catchment, from the bottom of rivers to temporarily increase the flow."
        },
        {
            "text": "Desilting is usually undertaken more frequently to remove recent deposits of silt to the bed level of a river. We use dredging to describe removing a range of materials or for making the channel larger by removing the bed and channel side material. It is undertaken less frequently and is a bigger exercise."
        },
        {
            "text": "In the UK, dredging and desilting have historically been carried out for a broad range of reasons: to drain land, maintain flows to mills, abstract sand or gravel for construction or to improve navigation, in addition to preventing flooding. In the past this has sometimes come with unintended consequences including increasing flooding downstream."
        },
        {
            "text": "Dredging and desilting are not as effective at reducing flood risk as other options, are often expensive and can be harmful to the environment.  Therefore the level of dredging and desilting has decreased in the UK over recent decades."
        },
        {
            "heading": 3,
            "text": "Does dredging and desilting prevent flooding?"
        },
        {
            "text": "When used with other flood risk management measures as part of a catchment based approach dredging and desilting can be effective and justified.   In the majority of cases, they are not the most efficient or sustainable ways of reducing flood risk and may actually increase flood risk to downstream communities. ."
        },
        {
            "text": "Natural processes in many rivers means silt will return and accumulate in the same places very quickly, sometimes only weeks after dredging and desilting is carried out, therefore any increase in channel capacity will be short-lived. This is particularly evident in tidal rivers with each tide bringing in new accumulations of silt."
        },
        {
            "heading": 3,
            "text": "Why doesn’t the Environment Agency do more dredging?"
        },
        {
            "text": "Dredging and desilting are an important part of our river maintenance programme, which is why we spent around £5 million on these activities in 2019/20. This is in addition to the approximately £40 million we spend on other works in channels such as weed clearance and blockage removal to keep them flowing."
        },
        {
            "text": "We consider each location carefully and dredge where we know it will make a difference to reduce flood risk. We assess each situation individually to understand the effectiveness, sustainability, environmental impact and value for money that dredging and desilting will provide."
        },
        {
            "text": "Where we conclude that dredging and desilting is economically viable, will not harm the environment and will reduce flood risk, then we will undertake it"
        },
        {
            "heading": 3,
            "text": "What is the impact on the environment?"
        },
        {
            "text": "Dredging and desilting can have serious and long lasting negative impacts on the environment. For example, it can damage or destroy fish spawning grounds and make river banks unstable. Silt can become suspended in the water, lowering oxygen levels, potentially releasing harmful chemicals that may be present. This, in turn, impacts on wildlife, and water quality downstream. The silt that has been removed from rivers can be difficult to dispose of, particularly where it is contaminated due to the historic industrial activity on the lower catchments of our rivers."
        },
        {
            "text": "Before we undertake dredging and desilting activities we make sure the work will not have any negative impacts on the environment, water quality or flood risk elsewhere in the catchment. We also design and undertake the work in a way that improves the river habitat or if that is not possible, minimise any impact as far as we can."
        },
        {
            "heading": 3,
            "text": "How does the Environment Agency reduce flood risk in places where it doesn’t dredge?"
        },
        {
            "text": "Taking action across entire river catchments is  a much more effective and efficient way to protect communities and increase their resilience to flooding."
        },
        {
            "text": "The most visible measures include flood walls, embankments, and demountable and temporary barriers, which help to contain water within river channels. Our strong track record on delivering new defences means that 314,000 homes are better protected since 2015, and the delivery of a record £5.2 billion investment in around 2,000 new schemes across the country will see a further 336,000 properties better protected over this current funding period."
        },
        {
            "text": "Communities are also protected by other flood risk measures such as storing water upstream and slowing the flow through natural flood management measures such as leaky dams. We create flood storage areas to temporarily store flood water on land that will more readily recover from flooding (such as parkland) to prevent flood water moving downstream too quickly and flooding communities."
        },
        {
            "text": "Working with partners, we also carry out activity in the upper catchments of rivers, restoring peatlands, planting trees, and building leaky dams, all of which contribute to slowing the flow of water into communities further downstream. In urban areas, we work with local authorities and other partners to promote sustainable drainage systems, which can include the creation of ponds and green spaces to help soak up rainwater, rather than it flowing quickly into drains and rivers."
        },
        {
            "text": "Across the country we work closely with other Risk Management Authorities such as local authorities and Internal Drainage Boards to manage flood risk. However, even with these measures and the Environment Agency’s strong track record, we cannot prevent flooding all of the time. That’s why we need people to know their risk.  So we encourage everyone to check online if they are at risk of flooding, sign up for flood warnings, and, if they are at risk, know what to do when flooding hits."
        },
        {
            "text": "Householders and business owners can also take other action to protect their property, such as installing Property Flood Resilience (PFR) measures. These can include flood doors, airbrick covers, and flood-resistant coatings on walls, helping to either keep water out of properties, or allow a quicker return to normality after flooding."
        }
    ]
}