{
    "url": "https://ipo.blog.gov.uk/2021/12/23/introducing-the-faker-takers/",
    "title": "Introducing the Faker Takers",
    "authors": [
        "Dan Anthony"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2021-12-23T09:30:09+00:00",
    "content": [
        {
            "text": "Recent reports from the OECD (Organisation for Economic Co-operation and Development) show that fake goods trading is on the increase. Dan Anthony looks at the reasons behind this rise and what is being done to combat these illegal practices. "
        },
        {
            "text": "In the past, intellectual property (IP) crime has comprised of counterfeiters painting fake masterpieces, printing false banknotes, and transforming bullion into ornamental Eiffel Towers. Now, thanks to the digital age and the rise of intangible business assets, something which was once a niche corner of an illegal network has been transformed into a far bigger problem."
        },
        {
            "text": " "
        },
        {
            "text": "Recent reports from the OECD (Organisation for Economic Co-operation and Development) indicate that trade in fake goods has continued to increase from an already high level of 3.3% in 2016. In this blog, I will outline the reasons behind this sustained rise and what is being done to combat these illegal practices."
        },
        {
            "heading": 3,
            "text": "Intangible but vulnerable "
        },
        {
            "text": "Over 80% of the value of UK companies trading on the stock market is deemed intangible. This includes trademarks, design registrations, copyright creations and patent-protected inventions. Although these assets can’t be stolen from a misplaced handbag or seized during a bank heist, they are still vulnerable."
        },
        {
            "text": "Through the sale of counterfeit goods via rogue websites and the dissemination of unlicensed content, these vital assets are at risk of IP infringement."
        },
        {
            "heading": 3,
            "text": "A new breed "
        },
        {
            "text": "Along with Border Force and National Trading Standards officers, a new breed of independent investigators is being established. Their role is to crack down on these practices. They offer IP protection services to innovative companies whose commercial success makes them potential targets for infringement."
        },
        {
            "heading": 4,
            "text": "TM EYE"
        },
        {
            "text": "David McKelvey created TM Eye in 2007. He is the former  Detective Chief Inspector of North and East London’s Criminal Investigation Department."
        },
        {
            "text": "TM Eye is a specialist IP protection service that now represents some of the world’s largest and best-known brands."
        },
        {
            "text": "The team operates internationally and is responsible for more prosecutions and convictions for trade mark offences than any other public or private law enforcement organisation in the UK. It has undertaken over 700 private criminal prosecutions and has a 100% conviction rate. 13% of TM Eye’s convictions receive custodial sentences."
        },
        {
            "text": "The team’s workload is varied, and includes the seizing of truck loads of lethal, counterfeit pharmaceuticals in Mumbai, to busting online counterfeit goods networks here in the UK. The team has three major Crown Court trials coming up in Sheffield, Birmingham and London relating to their current operation. David told us:"
        },
        {
            "text": "The investigation is ongoing."
        },
        {
            "heading": 4,
            "text": "SnapDragon"
        },
        {
            "text": "Rachel Jones is the founder and CEO of SnapDragon Monitoring, who are online brand protection specialists. SnapDragon works with brands around the world to enforce intellectual property rights online removing copycat and fake listings as well as illicit domains."
        },
        {
            "text": "In 2020 SnapDragon was awarded the Queen's Award for Enterprise for innovation in recognition of SnapDragon’s ground-breaking online IP infringement monitoring software. It’s an achievement of which Rachel and her team are hugely proud."
        },
        {
            "text": "Rachel’s experience of IP crime is that of a creative entrepreneur, and her passion for what she does stems from her own experience:"
        },
        {
            "text": "It was this very personal story which has driven SnapDragon's development of affordable, effective software. The software enables brands of any size to identify IP-infringing products for removal from ecommerce and social media sites around the world."
        },
        {
            "heading": 4,
            "text": "WRi Group"
        },
        {
            "text": "Graham Mogg has close connections with the Intellectual Property Office having been instrumental in creating and leading the IPO and National Trading Standards e-Crime Intelligence hubs. He was inspired to create the WRi Group in 2011."
        },
        {
            "text": "Graham’s past experience as a police officer and across the IP environment gives the WRi Group big picture credentials."
        },
        {
            "text": "As Graham says, \"we’re not just here to make money; we’re here to protect consumers and businesses and have contributed to projects that have allowed that to happen.\""
        },
        {
            "text": "Graham has been at the forefront of many of the UK's most successful collaborative enforcement actions. The WRi Group sponsors the Real Deal initiative, supporting local authorities and market operators in the fight against IP crime."
        },
        {
            "text": "The team specialises in bespoke brand protection, investigation and civil recovery services for major clients. The WRi Group’s academy closes the loop between public and private sector, training trading standards officers through its academy."
        }
    ]
}