{
    "url": "https://ukhsa.blog.gov.uk/2021/12/23/long-read-winter-vaccination-for-inclusion-health-groups/",
    "title": "Long read: winter vaccination for inclusion health groups",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "flu"
    ],
    "pub_date": "2021-12-23T11:46:55+01:00",
    "content": [
        {
            "text": "This blog has been produced by the UK Health Security Agency (UKHSA), the Office for Health Improvement and Disparities (OHID) and NHS England and Improvement (NHSEI)."
        },
        {
            "text": "It highlights the unequal impact of COVID-19 and seasonal influenza (flu) on people from inclusion health groups and the importance of tailoring our approach to vaccination to ensure that protection is available and accessible to everyone at risk in our communities."
        },
        {
            "heading": 2,
            "text": "Winter viruses"
        },
        {
            "text": "This winter we are facing high levels of COVID-19 and the additional risk of flu. Although these two diseases are caused by different viruses, they are spread from person-to-person in similar ways."
        },
        {
            "text": "COVID-19 and flu cause more harm to people who already experience poor health and who are more vulnerable because of wider social factors including poverty and poor living or working conditions. Vaccines are available for COVID-19 and flu, and these offer good protection from serious illness and death."
        },
        {
            "heading": 2,
            "text": "Inclusion health groups"
        },
        {
            "text": "Inclusion health is a term used to describe people who are socially excluded and experience multiple risk factors for poor health such as poverty, violence and complex trauma. This can include people who experience homelessness, drug and alcohol dependence, Gypsy, Roma and Traveller communities, sex workers, victims of modern slavery, refugees, asylum-seekers and undocumented migrants."
        },
        {
            "text": "People belonging to inclusion health groups may experience stigma and discrimination and are not consistently included in electronic records such as healthcare databases. They frequently suffer from multiple ongoing health problems and face barriers to accessing healthcare."
        },
        {
            "text": "They may not be registered with a GP or have any information recorded about their health problems in health records. This leads to extremely poor health outcomes, often much worse than the general population, and contributes to increasing health inequalities."
        },
        {
            "heading": 2,
            "text": "Unequal risk in inclusion health groups"
        },
        {
            "text": "The COVID-19 pandemic has not only exposed pre-existing health inequalities affecting those in inclusion health groups, it has also made them worse. Research by Doctors of the World reveals that people in inclusion health groups are:"
        },
        {
            "text": "These factors are also likely to contribute to a greater risk of being exposed to flu and a greater risk of becoming severely unwell or dying."
        },
        {
            "text": "People experiencing homelessness"
        },
        {
            "text": "People experiencing homelessness suffer from early ageing; they experience levels of illness and frailty similar to people 30-40 years older and die at a significantly younger age than the general population."
        },
        {
            "text": "Many people experiencing homelessness suffer with health problems that put them in ‘clinical risk’ groups or make them ‘extremely clinically vulnerable’ and at high risk of becoming seriously unwell or dying from COVID-19 or flu. These health problems may include severe lung disease such as chronic obstructive pulmonary disease (COPD), liver disease, heart disease, poorly controlled diabetes and severe mental illness."
        },
        {
            "text": "People from Gypsy, Roma and Traveller Communities"
        },
        {
            "text": "People from Gypsy, Roma and Traveller communities have much poorer health than the general population and die 10-25 years younger. They are significantly more likely to have a long-term condition making them ‘clinically vulnerable’ to COVID-19 or flu including chronic bronchitis and asthma. People from Gypsy, Roma and Traveller communities often live in crowded accommodation with shared toilet, washing and kitchen facilities. Being unable to socially distance or isolate increases their risk of exposure to the viruses like COVID-19 and flu that are spread from person-to-person."
        },
        {
            "text": "Refugees, asylum seekers and undocumented migrants"
        },
        {
            "text": "Migrants in vulnerable circumstances often live in shared accommodation where it is difficult to practice social distancing and isolation, which can lead to the rapid spread of COVID-19 and flu from person-to-person and outbreaks of disease. Many refugees, asylum seekers and undocumented migrants are from Black, Asian or minority ethnic (BAME) groups who are at greater risk of severe illness and death from COVID-19."
        },
        {
            "text": "Sex workers"
        },
        {
            "text": "Many street sex workers experience homelessness and some are also migrants and face health issues discussed earlier. Higher levels of ongoing health problems among sex workers increases their risk of severe illness or death from COVID-19 or flu. Many sex workers are forced to continue engaging in sex work and expose themselves to the risk of infection in order to earn money to buy food or pay rent"
        },
        {
            "heading": 2,
            "text": "COVID-19 and flu vaccines"
        },
        {
            "text": "COVID-19 vaccination is available to everyone in England and Wales aged 12 or over. The primary course of COVID-19 vaccination includes two doses of the vaccine for people that are aged 12 years and over, which should be given at least 8 weeks apart. A booster programme has also begun to offer additional protection to those most at risk and people aged over 16 with a third dose given 3 months after the second dose. Flu vaccination involves a single dose and may be given at the same time as the COVID-19 vaccination, which avoids any further delay in protection and the risk of the person not returning for a later appointment. Although a large proportion of the adult population have taken up the COVID-19 vaccination offer, not everyone has received their first dose yet. The offer of vaccination remains open to everyone who is eligible, wherever they are on their vaccination journey. Vaccination can be offered to people without an NHS number, and those who are not registered with a GP should not be turned away when trying to access vaccination."
        },
        {
            "heading": 2,
            "text": "Vaccination for Inclusion Health groups"
        },
        {
            "text": "NHS England has identified that people in inclusion health groups are at increased risk of severe disease and higher mortality and should be considered a priority for vaccination against COVID-19."
        },
        {
            "text": "The Joint Committee for Vaccination and Immunisation (JCVI) guidance recognises the need to consider the complex interplay of health and social risk factors for serious illness from COVID-19 and flu when prioritising patients for vaccination."
        },
        {
            "text": "The Green Book, whose chapters reflect the current policies and procedures for vaccination, gives the person prescribing flu or COVID-19 vaccines flexibility in determining eligibility, stating that the prescriber should apply clinical judgment to take into account the risk of COVID-19 or flu worsening any underlying disease that a patient may have, as well as the risk of serious illness from COVID-19 or flu."
        },
        {
            "text": "The COVID-19 booster programme is now open to all adults and so those in inclusion health groups over the age of 16 are eligible and should be supported to get boosted. This includes asylum seekers, refugees, and migrant populations including pregnant women who may need additional routes and support to be able to access their flu and COVID-19 vaccines."
        },
        {
            "text": "Barriers to vaccination"
        },
        {
            "text": "Despite being more vulnerable to COVID-19 and flu, people from inclusion health groups face many challenges accessing the COVID-19 and flu vaccines:"
        },
        {
            "heading": 2,
            "text": "Tailored vaccination approaches"
        },
        {
            "text": "In view of the barriers experienced by people in inclusion health groups, it is important that accessible tailored and outreach vaccination services run alongside inclusive mainstream services. Tailored outreach vaccination approaches allow healthcare teams to deliver vaccinations in locations that feel safe and welcoming and can be more easily accessed by inclusion health groups."
        },
        {
            "text": "This may include:"
        },
        {
            "text": "Alongside increasing the accessibility of the vaccines, it is also crucial to increase confidence among people in inclusion health groups in the safety and effectiveness of the vaccines and in the trustworthiness and competence of the people who are delivering them. This involves providing accurate information in languages and formats that can be understood and delivering this through trusted channels such as housing providers, Voluntary, Community and Social Enterprise (VCSE) organisations, community leaders and representatives and peer advocates from inclusion health groups."
        },
        {
            "text": "UKHSA provides a range of translated information including a COVID-19 vaccination guide for adults, Third dose for weakened immune system leaflet,  Guide to COVID-19 booster,  Information for women of childbearing age, currently pregnant or breastfeeding, what to expect after your COVID-19 vaccination leaflet and Flu vaccination: who should have it this winter and why. UKHSA also produces easy read guides for COVID-19 vaccination and flu vaccination. Doctors of the World have produced a Vaccine Confidence Toolkit and have translated information about the COVID-19 vaccine for asylum seekers, refugees and undocumented migrants into 61 languages. Groundswell has produced accessible information about COVID-19 for people experiencing homelessness and frontline workers."
        },
        {
            "text": "Tailored approaches to offering vaccination to people in inclusion health groups have taken place in several areas across the country, including Brighton, Leeds and Bradford, Manchester, Shrewsbury and Plymouth."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "People in inclusion health groups risk being exposed to COVID-19 and flu this winter and have a greater chance of becoming seriously unwell. Mainstream healthcare services are often not designed in ways that can be accessed by people in inclusion health groups."
        },
        {
            "text": "In addition to taking actions to ensure mainstream services are inclusive, tailoring our vaccination approaches with outreach in safe and welcoming locations. It is important to provide regular opportunities to consider the offer, and the opportunity to have conversations about the vaccines and wider health issues to develop trust and confidence. The regularity of provision of services that are tailored contributes to building trusting relationships will ensure that no one in our communities gets left behind."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "More information about the COVID-19 and flu vaccines can be found in Chapter 14a and Chapter 19 of the Green Book and in the Joint Commission for Vaccination and Immunisation (JCVI) publications and statements."
        },
        {
            "text": "COVID-19 vaccination programme collection:"
        },
        {
            "text": "https://www.gov.uk/government/collections/covid-19-vaccination-programme"
        },
        {
            "text": "https://www.gov.uk/government/publications/covid-19-vaccination-what-to-expect-after-vaccination"
        },
        {
            "text": "Annual flu collection"
        },
        {
            "text": "https://www.gov.uk/government/collections/annual-flu-programme"
        },
        {
            "text": "Free leaflets and resources including Easy Read and many translations are available as paper copies here. Register at the Health Publications website to place your order."
        },
        {
            "text": "To find out more about inclusion health you can access Inclusion Health: Applying all our health. This resource supports front-line health and care staff, managers and staff holding strategic roles to take action on inclusion health."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}