{
    "url": "https://prisonleaversproject.blog.gov.uk/2021/12/23/service-communities-model/",
    "title": "Experimenting with the Service Communities model through the Prison Leavers Project",
    "authors": [
        "Amanda Smith"
    ],
    "categories": [
        "Service Communities"
    ],
    "pub_date": "2021-12-23T16:31:22+00:00",
    "content": [
        {
            "text": "We are convening an exciting cross-government, cross-systems project to test innovative ways to reduce reoffending."
        },
        {
            "text": "There are three key strands to the Prison Leavers Project: our Prison Leavers Innovation Challenge, our Local Leadership and Integration Fund and our Service Communities.  "
        },
        {
            "text": "In this blog post we will be focusing on how we’ve adapted the Service Communities model to form new cross-system multidisciplinary teams that are focusing on policy design, systems change and improvements to service delivery. "
        },
        {
            "text": "What are Service Communities?"
        },
        {
            "text": "Service Communities were first introduced by Government Digital Service in 2017 to explore new ways of organising and working around whole user journeys and services. They are described as:  “…networks of people with different skills and from different professions and organisations, who are united by the service areas they work on.”"
        },
        {
            "text": "The approach was intended to “provide a structure for people to work together across departmental and professional boundaries… a forum where people could collaborate and share things like policy and legal issues, user research, the types of data they hold that relates to the service and the technology they use”. The first couple of Service Communities brought together people working across government on issues related to starting a business, health benefits, and importing and exporting.  "
        },
        {
            "text": "The intention with Service Communities is to make it easier to collaborate and solve common challenges. "
        },
        {
            "text": "We wanted to see if we could adapt the model and apply it to early stage policy design and systems change as well as service delivery when it comes to reducing reoffending amongst prison leavers. "
        },
        {
            "text": "How have we set up our Service Communities?"
        },
        {
            "text": "We’ve established four Service Communities that focus on different areas that those leaving prison need support with. They are:"
        },
        {
            "text": "Each Service Community is formed of a policy lead and policy advisor, operational policy advisor, junior policy officer, user researcher and service designer. Teams are supported by delivery managers and the data/analysis and communications professions."
        },
        {
            "text": "Our Service Communities are full of seconded experts from across the public, charity and voluntary sector, with organisations such as St Giles Trust, the Department for Work and Pensions, Nacro, Changing Lives, Local Government Association working with the Ministry of Justice. Each of our secondees has a day a week back with their ‘home organisation’ to ensure cross-pollination of ideas."
        },
        {
            "text": "Teams are working in an agile way: researching, prototyping, co-designing and testing ideas directly with people who will use them. They'll be taking an iterative approach, learning as they go and adapting every step of the way. We'll be sharing what we discover with other government departments and organisations, and working as openly as possible."
        },
        {
            "text": "Building empathy and understanding between professions"
        },
        {
            "text": "When our teams formed, we held a kick-off week with a series of masterclasses to help build empathy and understanding for each other. Sessions included:"
        },
        {
            "text": "Some colleagues had never heard of agile or user-centred design, although have long been practitioners without realising. That’s why creating an inclusive culture, particularly through the language we use to develop a shared understanding, will continue to be fundamental.  "
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "Our Service Communities have just wrapped up their initial phases of work - known as exploration and discovery - to understand the problem space(s) and the needs of people in prison. They are currently prioritising which interventions to test and pilot that will help reduce crime by supporting prison leavers to improve their outcomes.  "
        },
        {
            "text": "Many areas to tackle are already known, such as the need for people in prison to have consistent relationships; for practices to be trauma-informed; and for improved education and employment opportunities. It’s a case of bringing together many different people and organisations’ understanding of the system to determine what is being done so we can amplify, connect and optimise that work—and identify where new approaches, people and funding could help to make a difference."
        },
        {
            "text": "No single institution or organisation will have all the levers for change, which is why working together across boundaries on shared outcomes, and working in the open is so essential."
        },
        {
            "text": "Our Service Communities are moving into their alpha phase where they will be prototyping, co-designing and testing different ideas. They’ll be using a blend of methodologies and approaches to understand the success of their interventions, from undertaking user research and gathering data to see how they are performing, as well as taking part in a traditional, ‘fixed state’ impact evaluation throughout 2022/23.   "
        }
    ]
}