{
    "url": "https://actuaries.blog.gov.uk/2022/02/18/accessibility-for-all/",
    "title": "Accessibility for all",
    "authors": [
        "Lisa Browne - Head of Communications"
    ],
    "categories": [
        "Accessibility"
    ],
    "pub_date": "2022-02-18T13:26:40+00:00",
    "content": [
        {
            "text": "Accessibility is the term we use when we talk about how we are going to provide a better experience for all users of the information we publish here and on our website."
        },
        {
            "text": "I suppose in its narrowest sense that’s what it means, but overall, it would seem to be more than that. It’s not only important to understand the necessity of helping users access information. It’s also about being aware that by not doing anything, not making any changes, we could possibly disenfranchise people."
        },
        {
            "text": "According to the most recent government figures (published March 2021), there are 14.1 million disabled people in the UK. This means that nationally 22% of people have a disability. The prevalence of people reporting a disability varies across the country and can include people who have:"
        },
        {
            "heading": 2,
            "text": "Starting out"
        },
        {
            "text": "Our accessibility project in the Government Actuary’s Department (GAD) began in autumn 2020, when we published our accessible documents policy."
        },
        {
            "text": "In it we set out the level of accessibility of the documents that GAD publishes on GOV.UK. The policy covers PDFs, spreadsheets, and other types of documents. It’s an important publication as it makes clear our commitment to doing what we can to ensure users can access information."
        },
        {
            "text": "That initial awareness was driven by the fact that the legislation had come into effect. The Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 tasked government and public sector bodies to ensure documents on their websites were as accessible as possible to users."
        },
        {
            "heading": 2,
            "text": "Accessibility journey"
        },
        {
            "text": "In GAD, our initial steps around accessibility were just the beginning. We’ve used that initial awareness as a springboard to undertake a far-reaching exercise around accessibility. For about 18 months now, we’ve been embedding accessibility into our documents across a range of platforms and products."
        },
        {
            "text": "We began by taking advice from accessibility experts. These are people who understand intuitively what it’s like to be discriminated against, either intentionally, or through misunderstandings and assumptions."
        },
        {
            "text": "People in the department attended workshops to find out more about these insights which included for example, building awareness of the use of discriminatory language. It was an important step in building accessibility awareness."
        },
        {
            "heading": 2,
            "text": "Documents and colours"
        },
        {
            "text": "This included going back to basics, so we improved our colour palette by introducing stronger shades of the same colours, to ensure accessibility. This is because on documents these shades now offer a stronger contrast with the background. We have also introduced an off-white background to help neurodiverse users such as people with dyslexia."
        },
        {
            "text": "These refreshed colours, as well as the use of an accessible font style and size meant that we embedded accessible styles into the documents we use as a matter of course in our work. These included report and presentation templates which show that we strive to be as accessible as possible. Then in-house, we drafted accessibility guidelines and held all staff briefings – all about the changes."
        },
        {
            "text": "When it comes to best practice, we know that the HTML format is preferable for website publications. That’s how we share news and updates about the work of GAD, as well as important client reports. Examples include our quarterly special features on issues ranging from GAD’s coronavirus response to our climate work and the COP26 summit. We also publish regular Technical Bulletins which provide analysis in various topics relevant to our work and that of our clients. Again, these are published in HTML and recent topics include budgets, pensions and population projections."
        },
        {
            "heading": 2,
            "text": "Embedding inclusion"
        },
        {
            "text": "The start of our accessibility journey was accompanied a few months after that by the appointment of our first Head of Diversity and Inclusion. Saida Bello said: “It’s important to ensure changes are embedded within an organisation. And inclusion is part of accessibility. To my mind, inclusion is the idea, the principle, and embedding accessibility is how we go about achieving it.”"
        },
        {
            "text": "The Civil Service’s most recent diversity and inclusion strategy sets out the importance and benefits of a more inclusive working culture."
        },
        {
            "heading": 2,
            "text": "Keep on keeping on"
        },
        {
            "text": "I started out by saying that accessibility is the term we use to include as many people as we possibly can. I look forward to a time when it isn’t seen as an issue or a problem or a challenge, but when this level of integration is second nature to us."
        },
        {
            "text": "In the meantime, as an organisation we now know more than we did. We’re also doing our best to be the best we can be when it comes to ensuring all our users are able to access the information."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}