{
    "url": "https://mojdigital.blog.gov.uk/2022/02/18/major-challenges-cautious-optimism/",
    "title": "Major Challenges & Cautious Optimism",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "Excellence in Central Government Event"
    ],
    "pub_date": "2022-02-18T17:19:14+01:00",
    "content": [
        {
            "text": "My Experience of the Excellence in Central Government Event"
        },
        {
            "text": "It’s always interesting when you get a group of digital professionals together. When you get them together at a hotel, for a conference, and an overnight stay - you really start to understand each other. Funnily enough, it’s not at the lectern that you learn about them, but it’s at 1 am in the bar, whilst you’re queuing patiently for breakfast or when you share an understanding chuckle with someone clearly experiencing the same uniquely government-based challenge as you. "
        },
        {
            "text": "What struck me most this week, when I was asked to present at the Excellence in Central Government event at Wotton House, was that other digital leaders in government share the same nuanced feelings about implementing digital change as I do: a sort-of cautious optimism, coupled with a sometimes overwhelming sense of the scale of the challenges we face. "
        },
        {
            "text": "At first, it would seem these are almost contradictory: how is it possible to be both excited and daunted by something at the same time? But, for me, it is in our thorniest challenges that our greatest opportunities lie. "
        },
        {
            "text": "Let’s take data for example. I think that every other presenter at Wotton House mentioned this as a challenge. At the MoJ, we carry so much data that is untraceable, out of date, and expensive. We have warehouses up and down the country filled with boxes and boxes of paper-based data, gathering dust. This is not where we want to be in 2022. It is a challenge. "
        },
        {
            "text": "But, as we know, clean, digital and joined-up data can be enormously valuable for keeping our staff and users safe. Every day, 21 prison officers are assaulted by inmates. We could cut this number down drastically if we had proper insights on prisoners and the tech to make these insights known to prison staff, for example. "
        },
        {
            "text": "The same is true when we think about capability. “There’s never been a more exciting time to work in digital” one of my fellow speakers said - which is absolutely true. I love working in this space precisely because it is so dynamic and forward-looking. And, at the same time, the pandemic and the enormous upswing in demand for digital people has meant that government departments - doing such valuable and often life-changing work - can’t always compete with our private sector counterparts. "
        },
        {
            "text": "So, how do we move forward? How do we deal with the conflict of challenges vs. optimism? "
        },
        {
            "text": "Answer: we don’t see it as a conflict. We see the great opportunities within the challenges we face - the synergy between those things that hold us back and those things which drive us forward. And, crucially, we continue to build teams of motivated, value-driven people who see these challenges and say “right, what’s the opportunity here?”."
        },
        {
            "text": "Gina"
        }
    ]
}