{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/02/18/regulators-experience-of-clinical-trials-during-the-covid-19-pandemic-part-3-looking-forward/",
    "title": "Regulators’ experience of clinical trials during the Covid-19 pandemic (Part 3) – looking forward",
    "authors": [
        "Gail Francis",
        "Martin O'Kane",
        "Kirsty Wydenbach",
        "Lisa Campbell"
    ],
    "categories": [
        "Good clinical practice",
        "Inside the Inspectorate"
    ],
    "pub_date": "2022-02-18T12:36:05+00:00",
    "content": [
        {
            "text": "In parts one and two of this series, we looked at how we responded to the unprecedented challenges the COVID-19 pandemic and the lessons we have learned. In this final part, we explore the challenges ahead."
        },
        {
            "text": "Remote access to EHRs is something we have addressed during the pandemic, to facilitate source data verification (SDV) and monitoring.  We have attached restrictions to that in our guidance, due to confidentiality concerns. So, consideration must be given to where this access takes place, for example will CRAs (Clinical Research Associates) be accessing records in an open plan office, public space or other location where others who are not authorised could view sensitive information?  We have now published guidance for access to EHRs remotely following consultation with stakeholders, including patients and vendors who design and build these systems."
        },
        {
            "text": "In the UK there are opportunities to enable a more flexible and proportionate approach as we are working on updating our national legislation and associated guidance, so we are thinking about any learnings from the pandemic as we do this. In addition, we are also looking to increase diversity and patient involvement, either directly through legislation or supported in guidance. The consultation on the clinical trials legislation will be published soon and we would welcome your input."
        },
        {
            "text": "We have also reviewed, along with the HRA, how trials may be managed differently, in a move away from the traditional model of a site where each participant visits on a regular basis. We have produced guidance that covers what we mean by a ‘trial site’ and how activities can be overseen effectively where the investigator is not physically located at a particular site."
        },
        {
            "text": "In addition, we are supporting the wider programme of work being taken forward as part of the UK vision for the future of clinical research delivery in Saving and Improving Lives: The Future of UK Clinical Research Delivery and its implementation as well as the Life Sciences Vision. These proposals also take steps to support an efficient and effective clinical trials environment, in line with recommendations from the Taskforce for Innovation, Growth and Regulatory Reform (TIGRR). Examples of new ways of working include integration of the Medicines and Healthcare products Regulatory Agency (MHRA) and research ethics committee approvals via combined review of trials of investigational medicinal products and increasing the use of innovative research designs."
        },
        {
            "text": "You may also be aware that ICH E6 guidance on good clinical practice is undergoing a major revision and some key themes from that are proportionality, new technologies and remote ways of working."
        },
        {
            "text": "We have developed, with other partners, an Innovative Licensing and Access Pathway (ILAP) which creates a pathway for innovative new medicines to be supported through development and reach patients sooner."
        },
        {
            "text": "There is lots of information on ILAP on our website, but essentially an organisation can apply for an Innovation Passport for a product, which is then assessed to determine if the entry criteria for ILAP are met. In short these are focused on:"
        },
        {
            "text": "Working with the developer, a product-specific team of experts will help define the target development profile (TDP) for the product, based on its characteristics.  This includes the use of a suite of ‘tools’ designed to help bring clinically important and promising medicines to patients faster and more efficiently. Many of the tools available in the ILAP toolkit are based on our learnings from COVID-19, including the Rapid Clinical Trial Dossier Pre-assessment tool and the Novel Methodology and innovative clinical trial design tool, both of which aim to maintain the momentum in use of the flexibilities available for trials whilst maintaining the open dialogue approach that was so critical for COVID-19 trials."
        },
        {
            "text": "We have learnt a vast amount during the pandemic, and researchers, regulators and other partners in the research ecosystem, and most importantly those who generously participated in the COVID-19 trials have achieved a lot in a short space of time.  We are building on key areas such as early engagement for development of medicines, working across networks not only to support and streamline the design, approval and delivery of trials but to deliver effective products into the market when safe to do so – meaning new and innovative products have reached patients sooner."
        },
        {
            "text": "We have seen the benefits of early engagement with the MHRA (and regulators in general) and would encourage Sponsors to come to us as early as possible for regulatory advice. This is an age of change, adopting new technologies, decentralised trials, novel trial designs and encouraging diversity in clinical trial designs.  We see ourselves as a collaborative and enabling regulator and look for opportunities to support innovative new products or ways of working."
        }
    ]
}