{
    "url": "https://ruralpayments.blog.gov.uk/2022/02/18/sustainable-farming-incentive-pilot-milestones/",
    "title": "Sustainable Farming Incentive pilot milestones",
    "authors": [
        "Sandy Kapila"
    ],
    "categories": [
        "Rural Payments service",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-02-18T14:21:44+00:00",
    "content": [
        {
            "text": "We have achieved a significant milestone this month. We issued the first batch of quarterly payments to those Sustainable Farming Incentive (SFI) pilot participants whose agreements started in November 2021. This has been the culmination of hard work across teams in the Rural Payments Agency and Defra (Future Farming & Countryside Programme)."
        },
        {
            "text": "These payments incorporated our review of the Sustainable Farming Incentive pilot standards payment rates and will continue to be made on a quarterly basis by the middle of the appropriate month."
        },
        {
            "text": "The entire approach to the SFI pilot has been focused on learning. Learning on how to engage differently with farming communities, working in partnership to help build the future. Learning on how we create a package of standards that suitably rewards farmers for the work that they do. Learning how to appropriately streamline the administration to make it simpler."
        },
        {
            "text": "We’ve held three Sustainable Farming Incentive (SFI) pilot Welcome Webinars. They have been well attended with good engagement and some really good questions about the pilot and the scheme. We know that there is an appetite for more engagement so we’ve got plans going forward which will include the introduction of a collaborative virtual space using an online community."
        },
        {
            "text": "Just in case you missed it, SFI is the first of the three new environmental land management schemes sitting alongside the future Local Nature Recovery and Landscape Recovery schemes."
        },
        {
            "text": "We have published a number of blogs already on the SFI pilot which can be found on https://defrafarming.blog.gov.uk/ and https://ruralpayments.blog.gov.uk/."
        },
        {
            "text": "The application window closed at the end of September 2021 and we were really pleased at the amount of interest shown and the willingness of those who’ve applied to work with us to shape the new scheme. We had a good mix of farm types, sizes, locations and tenures."
        },
        {
            "text": "The RPA is the delivery partner for SFI but we do a lot more. We recently published more information about our strong performance across 2021 here (https://ruralpayments.blog.gov.uk/2022/01/17/the-rural-payment-agency-looks-back-on-2021/)."
        },
        {
            "text": "We have been working hard to get agreement offers out to applicants and the first of these were issued in October 2021 for a 1 November start. Since then, we have continued to issue agreement offers on a regular basis with 826 now issued (a further 14 offers have been returned for an amendment). However, there are a few where it is taking more time to complete the processing. We’re keen to maximise what we learn through the pilot, including any lessons on where we can resolve issues at application more quickly."
        },
        {
            "text": "There can be a number of reasons why processing times vary, but before we explain it is helpful to add a little context. Testing the application to agreement process was really important. We also wanted to make it as simple as possible to apply for. In doing so we moved many of the essential checks, normally undertaken as the farmer built their application, to after the application had been submitted to us. This meant that these checks need to be completed manually and this takes time."
        },
        {
            "text": "So when we received your application we have to check the parcels and standards applied for against the pilot eligibility rules; the land data they hold; information about other Agri-Environment schemes and the pilot rules before we are able to send out the offer."
        },
        {
            "text": "We are pleased that 769 participants have accepted their offers. There are 57 who have received their offers but have chosen not to accept it so far. This may be for several reasons, but we would encourage them to accept so their agreements can start. Where you have questions or changes you want to make to your offer, please let us know and we can work with you to update it. There are also 73 applications still being processed; just under half of these are where we are waiting on participants to come back on questions we’ve asked them."
        },
        {
            "text": "This month we allowed pilot participants to apply for Capital items https://www.gov.uk/guidance/countryside-stewardship-capital-grants-manual-from-8-february-2022-sustainable-farming-incentive-pilot-supplement. These grants support work on boundaries, trees and orchards; work to improve water and air quality. We know that there has been a lot of interest and we’ve already started receiving applications."
        },
        {
            "text": "We have often referred to the importance of learning from the pilot and we are capturing lots of valuable insight. We are determined to make this work. We are also pleased that the SFI pilot pioneers are working with us to help shape the future of farming."
        }
    ]
}