{
    "url": "https://nationalscreening.blog.gov.uk/2022/02/18/were-looking-for-3-new-members-to-join-expanding-uk-nsc-apply-now/",
    "title": "We’re looking for 3 new members to join expanding UK NSC: apply now",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-02-18T13:21:22+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is recruiting 3 new members to support delivery of its expanded role and remit."
        },
        {
            "text": "The expanded remit of the committee, agreed by the 4 UK governments and chief medical officers, will include targeted and risk stratified screening alongside population screening."
        },
        {
            "text": "The refreshed UK NSC will aim to be more proactive and innovative, working more closely with other guidance bodies and industry to drive forward the screening agenda."
        },
        {
            "text": "The skills, experience and technical expertise of existing committee members will be needed more than ever as we put the committee’s extended remit into action."
        },
        {
            "text": "To help support the expansion and the strategic direction of the UK NSC remit and put these changes into action, we have identified the need for 3 new posts:"
        },
        {
            "text": "We are looking for enthusiastic, experienced and forward thinking people to take up this challenge."
        },
        {
            "text": "The closing date for applications is midday on 17 March 2022."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}