{
    "url": "https://civilservice.blog.gov.uk/2025/11/19/breaking-down-barriers-how-dfe-is-delivering-for-the-british-public/",
    "title": "Breaking Down Barriers: How DfE is delivering for the British public",
    "authors": [
        "Tony Foot"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-11-19T11:12:09+00:00",
    "content": [
        {
            "text": "In the second of our series spotlighting civil servants driving the Government's Plan for Change, we meet Tony Foot, Director General for Strategy Group, from the Department for Education."
        },
        {
            "text": "If you had to explain your Mission to a member of the public in a lift in 30 seconds, what would you say? "
        },
        {
            "text": "Every child deserves the chance to succeed, no matter who they are or where they come from. But right now, too many children and young people in Britain are held back. By age five, children eligible for free school meals are already five months behind. By 16, this gap has widened to over 18 months. The Opportunity Mission is about breaking that link between background and future success.  "
        },
        {
            "text": "Practically, what has actually been achieved on this Mission since it began? "
        },
        {
            "text": "We’ve made real progress, but there’s much more to do.  "
        },
        {
            "text": "We’ve delivered the biggest-ever childcare expansion  and rolled out  school-based nurseries. New Best Start Family Hubs are making joined-up support easier for families. "
        },
        {
            "text": "We’ve recruited 2,300 more teachers,  launched Regional Improvement for Standards and Excellence (RISE) teams to spread best practice. Free breakfast clubs now reach nearly 180,000 pupils – helping with the cost of living and ensuring children start the day ready to learn. "
        },
        {
            "text": "Skills England is setting direction on national and local skills needs, while foundation apprenticeships ensure every 18 to 21-year-old in England can access education, training, or support to find a job or apprenticeship. "
        },
        {
            "text": "We’re extending free school meals to all children whose parents receive Universal Credit –  lifting 100,000 children out of poverty by the end of this Parliament.  "
        },
        {
            "text": "We’ve also started the national roll out of the Families First Partnership programme to shift the children's social care system towards early support and help families stay safely together.  "
        },
        {
            "text": "However, this is just the starting point for change. "
        },
        {
            "text": "What's the one moment recently reminded you, \"This is why I do this job\"?  "
        },
        {
            "text": "Nothing beats spending time with children and young people and hearing their stories. The safe arrival of scholarship students  from Gaza – was also a really special moment.   "
        },
        {
            "text": "Your biggest barrier right now - and how are you smashing through it? "
        },
        {
            "text": "Increasing opportunity for children and young people takes a whole-of-society effort  across departments; local and regional government; and all sectors. We’re strengthening collaboration and co-design with partners – at a national level as well as in local communities.  "
        },
        {
            "text": "What's your Mission's biggest win that people should be shouting from the rooftops? "
        },
        {
            "text": "We’re  turning the tide on school absence. There are 5 million more days in school and 140,000 fewer pupils persistently absent year in 2024/25 compared to the previous year. "
        },
        {
            "text": "Behind this is a coordinated, multi-intervention approach. That starts with world-leading, real-time attendance data tools to help schools spot problems early and act fast. We’ve invested £15 million for  mentoring 10,000 more persistently absent children, and new Attendance and Behaviour Hubs supporting 500 schools annually. "
        },
        {
            "text": "There is much more to do. Every day in school really counts – even a few missed days significantly impact a child's education and future prospects. "
        },
        {
            "text": "What's the biggest myth about your Mission, you'd love to bust right now? "
        },
        {
            "text": "That it’s just about the long-term. Yes, we’re breaking the long-term link between background and success. But that starts with real change and delivery for families and children right now. "
        }
    ]
}