{
    "url": "https://mhclgmedia.blog.gov.uk/2025/11/19/explainer-everything-you-need-to-know-about-the-new-renters-rights-act/",
    "title": "Explainer: everything you need to know about the new Renters’ Rights Act",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Renters' Rights Act"
    ],
    "pub_date": "2025-11-19T17:25:33+00:00",
    "content": [
        {
            "text": "Renting in England is about to change – and millions of tenants are set to benefit."
        },
        {
            "text": "From 1 May 2026, new laws will kick in that give 11 million renters stronger rights, better protections and more security in their homes."
        },
        {
            "text": "🔑 What’s changing?"
        },
        {
            "text": "🛠️ What about landlords?"
        },
        {
            "text": "Landlords will still be able to get their property back for clear reasons – like selling up, moving in, or dealing with rent arrears or anti-social behaviour."
        },
        {
            "text": "The changes aim to strike a fair balance between renters and landlords, making the system more stable, safer and easier to understand."
        },
        {
            "text": "🧾 What’s coming next?"
        },
        {
            "text": "From late 2026, more improvements will roll out:"
        },
        {
            "text": "🏠 A Private Rented Sector Database"
        },
        {
            "text": "🛠️ A free complaints service"
        },
        {
            "text": "🧾 Progressing future plans - warmer and safer homes"
        },
        {
            "text": "The government is also continuing work to improve living conditions in privately rented homes.Consultations will inform their timelines."
        },
        {
            "text": "New rules in the future will raise the standard of rented homes - tackling damp, mould and dangerous conditions. Landlords will need to fix serious hazards faster and make homes more energy efficient, helping tenants stay warm and cut bills."
        },
        {
            "text": "This is what’s coming:"
        },
        {
            "text": "🧱 Quick landlord action to fix hazards"
        },
        {
            "text": "The government is looking to extend Awaab’s Law to private rentals - forcing landlords to act fast when homes are unsafe. A consultation on how best to do this will be launched soon, so private tenants can benefit from protections like those already supporting social housing tenants."
        },
        {
            "text": "🌱 Greener homes by 2030"
        },
        {
            "text": "By 2030, we plan to require that all privately rented homes must meet new energy efficiency standards (EPC rating C or better), unless exempt. That means better insulation, lower bills and greener living."
        },
        {
            "text": "🏡 A new Decent Homes Standard for private rentals"
        },
        {
            "text": "For the first time, the government will introduce a Decent Homes Standard for privately rented homes - a clear set of rules to make sure every rented property is safe, warm and in good repair."
        },
        {
            "text": "This new standard will help raise the bar across the board, giving renters confidence that their home meets basic safety and quality rules - and giving councils more power to crack down on landlords who don’t meet them."
        },
        {
            "text": "How will I know how to exercise my new rights next year?"
        },
        {
            "text": "First of all, landlords will be responsible for sticking to these new rules – and your local councils will have stronger powers to act if your landlord breaks them. "
        },
        {
            "text": "To help you understand your new rights better, the government will publish guidance for tenants before the changes kick in on 1 May 2026."
        },
        {
            "text": "See MHCLG's press release here. "
        }
    ]
}