{
    "url": "https://educationhub.blog.gov.uk/2025/11/free-school-breakfast-clubs/",
    "title": "Everything you need to know about free school breakfast clubs",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Schools"
    ],
    "pub_date": "2025-11-19T22:30:00+00:00",
    "content": [
        {
            "text": "Since April 2025, we’ve delivered 5 million meals through our free breakfast clubs early adopter scheme."
        },
        {
            "text": "Our 30-minute free breakfast clubs help ensure pupils start every day ready to learn, and in turn improve behaviour, attendance and attainment."
        },
        {
            "text": "As well as helping children thrive academically and socially, breakfast clubs give parents and carers more choices in childcare, and support families with the cost of living"
        },
        {
            "heading": 3,
            "text": "What’s the next stage of the free breakfast club roll out?"
        },
        {
            "text": "Following the success of the early adopters, we’re investing a further £80 million to onboard approximately 2000 more schools between April 2026 and March 2027."
        },
        {
            "text": "To make sure support reaches the children and families who need it most, schools with a 40% or higher free school meal rate will be invited to apply to join the scheme in April 2026, with National School Breakfast Programme primary schools joining the scheme in September 2026."
        },
        {
            "heading": 3,
            "text": "Will there be more funding?"
        },
        {
            "text": "Using insights from the early adopters, we’ve increased the funding rate for mainstream schools and this will come into effect from April 2026."
        },
        {
            "text": "The funding rates will be as follows:"
        },
        {
            "text": "Mainstream schools"
        },
        {
            "text": "Special/ alternative provision schools"
        },
        {
            "text": "All schools new to the programme will also receive a £1000 start-up grant to purchase the equipment and materials they need to run their club."
        },
        {
            "heading": 3,
            "text": "How can schools apply to the free breakfast club programme?"
        },
        {
            "text": "All schools who are eligible will be contacted directly and can apply by completing an expression of interest form."
        },
        {
            "text": "We will consider free school meal rates and current participation in the National School Breakfast Programme when selecting successful schools. "
        },
        {
            "text": "We’ll contact successful schools in the new year."
        },
        {
            "heading": 3,
            "text": "When will families be able to access free breakfast clubs?"
        },
        {
            "text": "If their school is an early adopter, families can already access a free breakfast club will receive information on the offer direct from their school."
        },
        {
            "text": "If their school is not an early adopter, families will be able to access a free breakfast club as we roll out the programme nationally. This will take place in phases but schools will be in touch with families when they begin their club."
        },
        {
            "heading": 3,
            "text": "What other support is available to families?"
        },
        {
            "text": "We’re also expanding childcare for primary school children across England by increasing the number of places available, to support working families."
        },
        {
            "text": "Separate to the breakfast programme, wraparound childcare is before and after school care for primary school aged children in England during term time, such as regular afterschool provision that runs until 6pm or later. You can read more about the offer on the Education Hub."
        },
        {
            "text": "Hundreds of thousands of eligible working parents can also now access 15 hours government-funded early education for children aged 9-months-old and older after new rules kicked in from 1 September 2024. Read more here. "
        },
        {
            "text": "Some families may also be entitled to free school meals at lunchtime. You can find out more about the programme, including who’s eligible, on Gov.uk."
        }
    ]
}