{
    "url": "https://environmentagency.blog.gov.uk/2025/11/19/how-were-tackling-illegal-waste-dumping-and-protecting-our-environment/",
    "title": "How we're tackling illegal waste dumping and protecting our environment",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2025-11-19T15:38:49+00:00",
    "content": [
        {
            "text": "Waste crime is completely unacceptable. We are working tirelessly with compliant businesses, operators and partners to protect our environment and communities from waste crime. We will always take decisive action to investigate and work with police to bring perpetrators to justice."
        },
        {
            "text": "In Kidlington, Oxfordshire, we share the public's disgust at the large-scale dumping of illegal waste. This blog sets out what we've done, what we're doing now, and how you can help us bring those responsible to justice."
        },
        {
            "text": "Our immediate response"
        },
        {
            "text": "In response to evidence from the public, our officers and partner organisations attended the site on 2 July. At this point we confirmed it as a high-risk illegal waste site requiring urgent action."
        },
        {
            "text": "When the risk of further dumping emerged, we secured a court order to close the site to prevent more waste from being illegally tipped.Following that order, we closed access to the site and there has been no further dumping on the site."
        },
        {
            "text": "Unfortunately, the majority of the waste was tipped before we became aware. Once we were notified, we acted swiftly."
        },
        {
            "text": "Our ongoing work"
        },
        {
            "text": "We're working closely with our partners to tackle this incident head-on. Multi-agency coordination is essential in situations like this and the Environment Agency is overseeing the joint response. Today (19 November) we convened Cherwell District Council, Thames Valley Police and National Highways to ensure a unified approach to protecting the local environment and addressing community concerns. This partnership ensures every agency brings its full capabilities to bear on the problem."
        },
        {
            "text": "Let's be absolutely clear: we have the resources, expertise and determination to deal with this situation effectively. Any suggestion otherwise is completely inaccurate and misleading. The Environment Agency is the nation's environmental regulator with decades of experience handling complex environmental incidents."
        },
        {
            "text": "Our specialist teams remain on the ground at the site, conducting rigorous assessments of risks to the River Cherwell, monitoring environmental impact, and taking immediate action where needed. We will continue this intensive monitoring and enforcement work until the site is secured, and any environmental damage is addressed."
        },
        {
            "text": "Criminal investigation  The investigation is being led by our National Environmental Crime Unit, which is staffed by highly skilled waste crime investigators. Presently, we’re actively pursuing lines of enquiry. We cannot comment further, or we risk prejudicing the outcome. We have a strong track record of successfully bearing down on criminals which includes stopping activity at 743 illegal waste sites in the past year. We are confident we’ll track down those responsible for the waste dumped at Kidlington.We cannot commit to a timeline for when the waste will be cleared but as a matter of principle we believe that those who pollute - rather than taxpayers - should cover the costs of clean up.    "
        },
        {
            "text": "However, we are reviewing options for site clearance. This is not a quick process as, unlike the criminals that dumped it there, we have to ensure this vast amount of waste is handled correctly, moved to the right facilities and is done so without causing further damage to the environment."
        },
        {
            "text": "How you can help"
        },
        {
            "text": "Information from the public is critical to holding waste criminals to account."
        },
        {
            "text": "If you have any information about this site or suspect illegal waste activity anywhere, please call our 24-hour incident hotline on 0800 807060. You can also report information to call crime stoppers via their website Independent UK charity taking crime information anonymously | Crimestoppers."
        },
        {
            "text": "We’re aware of people wanting to see the site for themselves. It’s a live crime scene which is covered by a restriction order. It’s not legal or safe to be there."
        },
        {
            "text": "Visiting not only hampers our investigation but also causes further harm to the environment as waste underfoot gets compacted into the ground or dispersed further."
        },
        {
            "text": "Factual correctionsThere have been some false reports in the media and online about some of our response. We’d like to set the record straight on this:All EA did was put a sign on the gate. It has been too slow to find the culprits - Not true. When the site was reported to the Environment Agency, we launched a criminal investigation to find those responsible, closed the site to prevent further dumping and continue to monitor the area for environmental harm."
        },
        {
            "text": "Dumping continued after we closed the site on 23 October - Not true. We have no evidence of more waste dumped at the site since September.EA is too busy to deal with this among all its other work –Not true.  We have the resources, expertise and determination to deal with this situation effectively. We have stopped activity at 743 illegal waste sites in the past year."
        },
        {
            "text": "Our wider work against waste crime"
        },
        {
            "text": "Waste crime undermines legitimate businesses and costs England's economy around £1 billion a year. We're determined to turn the tide."
        },
        {
            "text": "In 2024/5, the Environment Agency successfully stopped activity at 743 illegal waste sites, of which 143 were high risk. Our enforcement officers also prevented nearly 34,000 tonnes of waste from being illegally exported."
        },
        {
            "text": "Working in partnership"
        },
        {
            "text": "Since 2020, we've led the Joint Unit for Waste Crime – a multi-agency taskforce bringing together the Environment Agency, police forces, the National Crime Agency, HMRC, the National Fire Chiefs Council and devolved bodies to tackle serious and organised criminality in the waste sector."
        },
        {
            "text": "By the end of September 2025, the work of the Joint Unit for Waste Crime led to 186 arrests."
        },
        {
            "text": "Following the money"
        },
        {
            "text": "We've also established an Economic Crime Unit within our National Environmental Crime Unit to target the money and assets of waste criminals."
        },
        {
            "text": "In 2024/25, we supported 21 ongoing money laundering investigations, secured 5 account freezing orders and 1 cash detention (£17.9k forfeited, £2.9 million frozen), and finalised 13 confiscation orders totalling £1.55 million."
        },
        {
            "text": "We will continue working tirelessly with compliant businesses, operators and partners to protect our environment and communities from waste crime."
        }
    ]
}