{
    "url": "https://mojdigital.blog.gov.uk/2025/11/19/international-mens-day-celebrating-men-and-boys-while-promoting-gender-equality/",
    "title": "International Men’s Day: Celebrating Men and Boys While Promoting Gender Equality ",
    "authors": [
        "Mark Thompson"
    ],
    "categories": [
        "gender equality",
        "International Men's Day"
    ],
    "pub_date": "2025-11-19T13:22:52+01:00",
    "content": [
        {
            "text": "In Digital and Data, we are used to talking about change, adopting new tools, designing better services, using evidence to improve decisions. But lasting change isn’t just technical, it’s cultural.  "
        },
        {
            "text": "International Men’s Day is a good moment to pause and reflect. Real progress starts with understanding and allyship. Equality isn’t someone else’s job; it’s something we all have a part in. "
        },
        {
            "text": "I’ve been thinking about the kind of culture we want to build together. For me, it’s one where everyone feels seen, supported, and able to thrive. That doesn’t happen by accident, it happens when leaders model openness and inclusion. "
        },
        {
            "text": "Why Men and Equality Are Connected  "
        },
        {
            "text": "Gender equality isn’t just about women’s progression; it’s about creating workplaces where everyone thrives. That means men showing up ever-so slightly differently: listening more, making space, and challenging behaviours that don’t align with respect or fairness.  "
        },
        {
            "text": "Research shows that when men actively act as allies, sponsoring diverse talent, listening, making space, the people they lead feel safer, more included and more likely to stay. Some organisational studies show better outcomes with a 30% variance in financial performance. "
        },
        {
            "text": "In digital and data, we often talk about user-centred design. True gender equality is similar, designing workplaces that work for everyone, where psychological safety, flexibility, and belonging aren’t “nice to have” but the foundations of good work. "
        },
        {
            "text": "Celebrating men in this context isn’t about elevating one gender but about valuing positive actions that promote equality and wellbeing. Boys and men have a powerful role to play in making this real. "
        },
        {
            "text": "Being a Male Leader in the Workplace: Breaking Stereotypes "
        },
        {
            "text": "Men play a vital role in challenging outdated norms. Whether it’s supporting mental health conversations, enabling flexible working, or mentoring, these actions help create workplaces where everyone thrives. "
        },
        {
            "text": "Breaking stereotypes isn’t just about words, it’s about actions. Every time we champion flexibility, listen actively, or sponsor diverse talent, we dismantle barriers and foster respect.  "
        },
        {
            "text": "Personally, I have thrived in workplaces where colleagues genuinely cared about how people were feeling, not just what they were delivering. That kind of empathy builds trust, energy, and better outcomes for everyone. "
        },
        {
            "text": "As a sponsor of the Women in Digital forum in Justice and previously in Cabinet Office, I’ve seen how subtle shifts in language, in job adverts, feedback given as part of a performance appraisal, or even day-to-day interactions, can lead to very different experiences and opportunities. "
        },
        {
            "text": "When men actively model this behaviour, we move closer to workplaces where inclusion isn’t just encouraged, it’s lived. "
        },
        {
            "text": "My Commitment "
        },
        {
            "text": "At the Ministry of Justice, inclusion is something we all own. For me, it’s about turning good intentions into everyday actions that help everyone feel valued and supported. Today is a reminder that men also have a vital role in shaping environments where everyone can thrive. "
        },
        {
            "text": "Here’s what we commit to: "
        },
        {
            "text": "Every action, no matter how small, shapes the kind of culture we build. These experiences have reinforced my belief that equality isn’t just a principle, it’s a performance driver and a cultural cornerstone. "
        },
        {
            "text": "Let’s use International Men’s Day as an opportunity to reflect, celebrate, and commit to building workplaces where equality isn’t just a goal, it’s a lived reality. Together, we can make it happen. "
        }
    ]
}