{
    "url": "https://nda.blog.gov.uk/james-journey-in-nuclear-decommissioning-international-mens-day-2025/",
    "title": "James’ journey in nuclear decommissioning | International Men’s Day 2025",
    "authors": [
        "James Woodfield"
    ],
    "categories": [
        "diversity",
        "health",
        "Mission delivery",
        "Skills",
        "Sustainability"
    ],
    "pub_date": "2025-11-19T12:25:54+00:00",
    "content": [
        {
            "text": "Today marks International Men’s Day, celebrating the positive value men bring to the world, their families and communities. This year’s theme is “Celebrating Men and Boys” and today, we’re celebrating those who embody being a positive male role model, display integrity, as well as their commitment to the NDA’s mission."
        },
        {
            "text": "One such individual is James Woodfield, a Chartered Environmentalist (CEnv) and a Member of the Institute of Sustainability and Environmental Professionals (MISEP) within the NDA’s Strategy team."
        },
        {
            "text": "Based in Cumbria, James plays a key role in our mission to deliver safe, secure, and sustainable decommissioning, with a particular focus on the management of defence-related nuclear materials and sites."
        },
        {
            "text": "Read James’s story below:"
        },
        {
            "text": "I’ll admit it, when it comes to nuclear, I’m a nerd. And luckily for me, I’ve been able to carve a career out of it."
        },
        {
            "text": "I began my career as a graduate in the nuclear industry sponsored through the NDAs nucleargraduate programme by Sellafield Ltd, gaining valuable experience not only at Sellafield and Nuclear Restoration Services’ Chapelcross site, but also with the Environment Agency, where I helped regulate the Trawsfynydd and Wylfa sites. This external perspective was invaluable early on, helping me appreciate the broader reach of our sector and understand that our work extends far beyond the boundaries of our immediate group."
        },
        {
            "text": "But mobility isn’t just for graduates, it’s about growth, opportunity, and inclusion. I’ve seen this first-hand through a recent secondment with the Department for Energy Security and Net Zero (DESNZ), where I gained insight into how our work supports and is supported by wider departmental priorities. I also had the opportunity to contribute to shaping a range of policies across my area of radioactive waste, spent fuels and nuclear materials. Whilst I remained working in a familiar policy area, applying that knowledge outside the NDA group in support of wider government objectives, at the time focussed on the development of Small Modular Reactor (SMR) and Advanced Modular Reactor (AMR) policy as well as new developing new enrichment capability (High-Assay Low-Enriched Uranium or HALEU). This really helped me appreciate the world beyond the NDA group, but also reinforced the fundamental role we place in supporting the entire sector."
        },
        {
            "text": "Flashforward 12 years since starting the graduate programme and I’m now based within the strategy team, helping to shape how the NDA group  utilises its unique skills, knowledge and capability to interact with the Ministry of Defence (MOD) on defence-related nuclear liabilities, ensuing radioactive waste is stored safely and securely. This work, aims to make sure that all the UKs nuclear liabilities are managed as efficiently and effectively as possible to deliver the best outcomes for the industry and value for money for the taxpayer."
        },
        {
            "text": "But I equally know the value of a life outside of work."
        },
        {
            "text": "A large theme of International Men’s Day is the health and wellbeing of men, both mental and physical, and I absolutely value mine. Whether it’s booking a CrossFit class that makes me log off at an appropriate time, or escaping out onto the fells or Pennines with my two cocker spaniels, Monty and Bertie, or even more foolishly, renovating a Grade II listed house (a very lengthy pet project indeed), I know the importance of separating the two strands of my life and prioritising balance. If I’m not looking after myself outside of work, I’m no good when I’m in work, and vice versa."
        },
        {
            "text": "As we mark International Men’s Day, I encourage all of you to remember the positive impact men have on those around them, at work, at home, and in our communities."
        },
        {
            "text": "To find out more about International Men’s Day, visit Home - International Men's Day."
        }
    ]
}