{
    "url": "https://space.blog.gov.uk/2025/11/19/uk-space-agency-and-jaxa-a-powerful-partnership-driving-global-earth-observation-for-action/",
    "title": "UK Space Agency and JAXA: A Powerful Partnership Driving Global Earth Observation for Action",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Earth observation"
    ],
    "pub_date": "2025-11-19T11:38:48+00:00",
    "content": [
        {
            "text": "As the 2025 Chair of the Committee on Earth Observation Satellites (CEOS), the UK Space Agency has deepened its long-standing collaboration with the Japan Aerospace Exploration Agency (JAXA), which has served as CEOS Strategic Implementation Team (SIT) Chair for the past two years.  "
        },
        {
            "text": "Together, the UK Space Agency and JAXA have led the global Earth observation (EO) community through shared purpose, technical excellence, and strategic alignment. "
        },
        {
            "text": "This partnership has proven to be more than symbolic. With complementary leadership priorities of ‘Unlocking EO for Society’ (UK Space Agency), and ‘Climate Policy Impact’ (JAXA), the UK Space Agency and JAXA have aligned their efforts to accelerate progress across key initiatives to enhance the use and impact of Earth observation data, demonstrating what can be achieved when agencies work side by side toward common goals.  "
        },
        {
            "text": "CEOS represents the collective voice of the international EO community, and under the UK Space Agency and JAXA’s leadership, that community has made real progress in utilising earth observation (EO) for climate action, public sector transformation and youth engagement.  "
        },
        {
            "text": "The UK Space Agency was pleased to support JAXA’s priority of ensuring CEOS contributions are central to international climate frameworks like the UNFCCC’s Global Stocktake. "
        },
        {
            "text": "Their efforts have included tailored training for inventory compilers, raising awareness of satellite EO data among policymakers and aligning with UNFCCC and IPCC priorities."
        },
        {
            "text": "This collaboration has helped elevate satellite-derived data as essential tools for climate monitoring and reporting, particularly within the COP process, where both agencies have played a visible and influential role.  "
        },
        {
            "text": "Through the UK Space Agency’s CEOS in Schools programme, students from Japan, the UK and other CEOS nations have engaged in cross-cultural learning, collaborating on the use of EO data for natural disasters and biodiversity monitoring, and presenting their own ideas to senior leaders from space agencies around the world at the CEOS Youth Summit in Bath."
        },
        {
            "text": "This pilot programme has fostered dialogue and inspiration, helping to bring the excitement of EO to the classroom, and build the next generation of EO leaders.  "
        },
        {
            "text": "With support from JAXA, the UK Space Agency has championed the development of a new robust methodology for monitoring methane emissions using remote sensing - jointly led by NPL (UK) and NASA-JPL (US)."
        },
        {
            "text": "JAXA’s world-renowned expertise in methane monitoring has lent credibility and momentum to this initiative, helping establish a common set of standards for facility-scale emissions monitoring from satellites.  "
        },
        {
            "text": "And at the 2025 SIT Technical Workshop, JAXA were an active participant in the UK Space Agency’s dedicated knowledge exchange workshop on ‘Unlocking EO for public services’."
        },
        {
            "text": "Both the UK Space Agency and JAXA shared details of innovative user-centric approaches to help embed satellite EO data in public service provision, from UK Space Agency’s Unlocking Space for Government programme and practical examples from JAXA where EO is being used to underpin new carbon credit programmes - demonstrating how EO can transform public policy and service delivery when tailored to user needs.  "
        },
        {
            "text": "The partnership between UK Space Agency and JAXA spans more than two decades of collaboration. In this latest chapter, both agencies have actively supported each other’s priorities, demonstrating a relationship built not only on technical excellence but also on mutual respect and trust."
        },
        {
            "text": "This enduring cooperation has driven meaningful progress in advancing global Earth observation for the benefit of society."
        }
    ]
}