{
    "url": "https://companieshouse.blog.gov.uk/2025/11/19/verifying-your-identity-for-companies-house-with-gov-uk-one-login/",
    "title": "Verifying your identity for Companies House with GOV.UK One Login",
    "authors": [
        "Natalie Jones OBE - Director of Digital Identity, Government Digital Service"
    ],
    "categories": [
        "Changes to UK company law"
    ],
    "pub_date": "2025-11-19T12:31:00+00:00",
    "content": [
        {
            "text": "18 November 2025 marked an important milestone for UK businesses and the integrity of the Companies House register. From now on, all company directors and people with significant control (PSCs) must verify their identity with Companies House. "
        },
        {
            "text": "This change isn’t just about compliance — it’s about realising the vision the Government Digital Service set out in our blueprint for modern digital government this year, joining up public sector services, using the transformative power of digital."
        },
        {
            "text": "As someone who’s passionate about making government services simpler, safer and more accessible, I’m proud to see GOV.UK One Login at the heart of this transformation. Over 1 million people have already verified their identity for Companies House through GOV.UK One Login since April. This is a huge step forward in building a fairer and safer business environment for everyone."
        },
        {
            "text": "Those 1 million people also join a total of 13.2 million people who have proved their identity with GOV.UK One Login to access more than 110 different government services."
        },
        {
            "text": "Historically, company registration relied heavily on trust, with few formal checks on who was behind a business. The Economic Crime and Corporate Transparency Act changes that approach, introducing identity verification to strengthen confidence in the register and help honest businesses thrive."
        },
        {
            "text": "By making it harder to use fictitious names or hide behind false identities, we’re helping to tackle economic crime and ensure the information on the register is accurate and trustworthy."
        },
        {
            "heading": 2,
            "text": "How GOV.UK One Login works"
        },
        {
            "text": "We’ve worked closely with Companies House to create an online verification route that’s simple and accessible for directors and PSCs across the UK."
        },
        {
            "text": "GOV.UK One Login is free and quick. There are three ways to prove your identity with GOV.UK One Login. They are:"
        },
        {
            "text": "The method you use will depend on your device, if you have photo ID, and what type of photo ID it is."
        },
        {
            "text": "Once you've verified your identity with GOV.UK One Login, Companies House will give you a unique personal code to link that verified identity to your Companies House roles. Read more on when to use the code, for example when filing a confirmation statement."
        },
        {
            "text": "The real benefit of GOV.UK One Login is that your identity verification isn't limited to Companies House. Once you've verified your identity through GOV.UK One Login, you’ll be able to use your GOV.UK One Login to access more than 110 government services – from applying for a DBS check to signing a mortgage deed. This means you will not need to prove your identity again next time a service needs to check who you are."
        },
        {
            "text": "As an alternative to using GOV.UK One Login, you can choose to verify your identity through an Authorised Corporate Service Provider (ACSP). ACSPs are regulated businesses, such as accountants, solicitors or company formation agents, that can perform the same identity checks and submit the verification to Companies House on your behalf for a fee."
        },
        {
            "heading": 2,
            "text": "Built with security and accessibility at its core"
        },
        {
            "text": "GOV.UK One Login is being developed as the ‘front door’ for accessing government services. Our aim is to make it as simple and inclusive as possible for individuals to prove their identity and access connected services, while protecting them and the government from the risks of fraud."
        },
        {
            "text": "To meet these aims, GOV.UK One Login follows high standards for identity verification. Every identity verification service, including GOV.UK One Login, must strike a careful balance between accessibility and strong security. This means using trusted data sources and fraud prevention mechanisms."
        },
        {
            "text": "These safeguards, however, inevitably mean that GOV.UK One Login will not be able to successfully prove every user's identity. That is why all government services that use GOV.UK One Login must also provide an alternative method for identity verification - that is the ASCP route for Companies House."
        },
        {
            "text": "In addition, GOV.UK One Login works closely with the National Cyber Security Centre and operates a multi-layered security approach, including measures to:"
        },
        {
            "text": "We protect accounts at sign‑in with device and identity checks, and we require multi‑factor authentication so access needs more than just a password. To keep your information safe while it is stored or moves between your device and our systems, it is encrypted. GOV.UK One Login is fully compliant with UK data protection and privacy laws, including UK GDPR and the Data Protection Act 2018, and engages regularly with the Information Commissioner’s Office on our approach to data protection."
        },
        {
            "text": "We conduct regular independent testing of our systems as part of assurance activities. We follow the highest security standards for government and private sector services, including dedicated 24/7 eyes-on monitoring and incident response. As the public rightly expects, protecting the security of government services, and the data and privacy of users, to keep pace with the changing cyber threat landscape is paramount."
        },
        {
            "heading": 2,
            "text": "Making it work for everyone"
        },
        {
            "text": "We’re here to help. Our GOV.UK One Login contact centre is available weekdays 9am to 5pm for live support. You can ask a trusted helper to assist using our step‑by‑step helpers guide. "
        },
        {
            "text": "Companies House are phasing in identity verification over 12 months to make things easier for companies and business owners, and they will be in touch directly with information about what you need to do and when."
        },
        {
            "text": "The new requirement to prove the identities of directors and PSCs strengthens trust in UK businesses, but it's also part of something bigger. Our mission at GOV.UK One Login is to transform how people interact with government – making services simpler, faster and more secure. As more services connect, we're getting closer to that vision: prove your identity once, then focus on what matters to you."
        },
        {
            "text": "We're proud to work alongside Companies House on this important step forward for UK business."
        },
        {
            "text": "Read more about verifying your identity for Companies House. "
        }
    ]
}