{
    "url": "https://ukhsa.blog.gov.uk/2025/11/19/what-is-bird-flu-and-how-are-we-protecting-people-against-it-in-the-uk-2/",
    "title": "What is bird flu and how are we protecting people against it in the UK?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Avian Flu"
    ],
    "pub_date": "2025-11-19T09:30:00+01:00",
    "content": [
        {
            "text": "Avian influenza (bird flu) is an infectious disease that affects birds, caused by the influenza A virus. Birds are the hosts for a variety of influenza A virus subtypes, particularly waterfowl and shore birds. All birds are susceptible to avian influenza A and the virus can rapidly cause significant mortality in flocks but some species of bird show more severe clinical signs than others."
        },
        {
            "text": "The influenza A viruses found in birds are not well adapted to infect humans, and human infections with avian influenza viruses are rare. However, some subtypes, such as A(H5N1) or A(H7N9), have been associated with human disease, usually in people directly exposed to infected birds or animals."
        },
        {
            "text": "Over the past few years, a particular virus has come to dominate infections in birds internationally; influenza A(H5N1). Globally it has also caused animal outbreaks among mink and marine mammals and has now spread among dairy cows in the United States. There have been a number of human cases in those working on farms with affected cattle in the US. Both A(H5N1) and A(H5N5) were detected in wild and kept birds in Great Britain last year.  There are many different types of influenza A(H5N1) and the genotype in the UK is different from that circulating in the US."
        },
        {
            "heading": 2,
            "text": "What are the symptoms of bird flu?"
        },
        {
            "text": "The symptoms of avian influenza in humans vary. Most of the infections in humans that have occurred in the US have been mild, with symptoms of conjunctivitis (red, sore and discharging eyes) being common. However, the infection can be serious, and a number of individuals in the US and beyond - for instance in Cambodia - have experienced severe illness."
        },
        {
            "text": "Almost all cases of A(H5N1) virus infection in people have been associated with close contact with infected live or dead birds and mammals or contaminated environments. Influenza A(H5N1) continues to infect new mammal hosts (ranging from foxes, otters and seals to cattle), increasing the opportunities the virus has to evolve."
        },
        {
            "text": "The concern is that the virus may at some point evolve further, allowing it to adapt better to infecting people and spreading between them. We therefore remain vigilant for any evidence of changing levels of risk and keep this under constant review, although based on the latest evidence the current risk to the UK human population from avian influenza remains very low."
        },
        {
            "heading": 2,
            "text": "How are we protecting humans from bird flu?"
        },
        {
            "text": "UKHSA works with the Animal and Plant Health Agency (APHA), the Department for Environment, Food and Rural Affairs (Defra), Food Standards Agency (FSA), and the public health agencies of Scotland, Wales and Northern Ireland to monitor the risk to human health from emerging influenza viruses. We also work closely with partners across the world to learn more about international cases to inform UK preparedness plans."
        },
        {
            "text": "Our surveillance and diagnostic expertise coupled with our genomic sequencing abilities are crucial to the early detection, assessment and response to emerging health and biosecurity threats such as avian influenza."
        },
        {
            "text": "We work with the APHA to monitor circulating avian viruses, and aim to detect potential human avian influenza cases early, assess the risk to human health and scale up the public health response at pace if required. Our work contributes to initiatives such as the WHO Global Influenza Surveillance and Response System, helping the world detect and respond to emerging influenza viruses with pandemic potential."
        },
        {
            "text": "We typically see more detections of avian influenza in wild birds over autumn and winter and an increased risk to poultry and other captive birds, associated with the migratory pattern of waterfowl and environmental conditions becoming more favourable for virus survival."
        },
        {
            "heading": 2,
            "text": "How is bird flu being monitored in the UK?"
        },
        {
            "text": "We are working with the NHS to ensure patients admitted to intensive care with severe acute respiratory infections, or influenza-like-illnesses are tested for respiratory viruses, including influenza."
        },
        {
            "text": "UKHSA public health labs and the influenza reference laboratory undertake additional testing of samples that are positive for influenza A but where normal seasonal influenza is not found, to confirm that the detection is not due to avian influenza."
        },
        {
            "text": "Monitoring of these samples is an important mechanism for the early detection of avian influenza and novel influenza viruses. For example, in November 2023 a novel human case of influenza A(H1N2)v was identified in this way."
        },
        {
            "text": "As people developing avian influenza infections may become severely ill, intensive care units are a good place to target disease surveillance; this work fits within wider surveillance programmes alongside the existing standard public health processes, where people who are exposed to birds with avian influenza are monitored and followed up by UKHSA Health Protection Teams."
        },
        {
            "heading": 2,
            "text": "Vaccination"
        },
        {
            "text": "The standard seasonal flu vaccination is not expected to protect against avian influenza, although it remains important for those eligible to take up the seasonal flu vaccine to protect them from severe illness caused by the flu that circulates every winter in people."
        },
        {
            "text": "As part of long-standing preparedness plans, the government has purchased over 5 million H5 influenza vaccines in case these are ever needed in a pandemic scenario."
        },
        {
            "heading": 2,
            "text": "What should I do if I find a sick or dead bird?"
        },
        {
            "text": "Keep your distance from wild birds as much as possible."
        },
        {
            "text": "There are many reasons why wild birds die or appear to be sick and not every dead or sick wild bird will be infected with avian influenza. Some birds will not show signs of avian influenza infection, so it is not always possible to know if birds are infected with, or have died from, avian influenza. Avian influenza is not often found in small garden birds."
        },
        {
            "text": "If you cannot avoid touching a dead or sick garden bird at your home or other residential property, you should check UKHSA’s guidance on reducing the risk of catching avian influenza  and Defra’s guidance on how to dispose of dead wild birds not required for surveillance."
        },
        {
            "text": "If you want to take the bird to a vet or animal welfare organisation, phone ahead and follow their instructions. This protects other birds and animals at the practice or rehabilitation centre. In some cases, humane euthanasia by a veterinary professional may be the best option for the bird's welfare."
        },
        {
            "text": "In Great Britain, members of the public are encouraged to report findings of dead wild birds using the online reporting system or by calling the Defra helpline (03459 33 55 77). Reporting dead wild birds helps Defra and APHA understand the risk of avian influenza and other diseases to different species groups of wild birds, and supports UKHSA’s understanding of the risk to humans. Further information on APHA’s surveillance for avian influenza in wild birds can be found in their guidance."
        },
        {
            "text": "More information on how Defra and APHA monitor avian influenza virus infection in wild birds and wild mammals can be found in their guidance on GOV.UK."
        },
        {
            "heading": 2,
            "text": "What should I do if I think I may have been exposed to bird flu?­­­"
        },
        {
            "text": "If you are exposed to avian influenza then your regional health protection team will assess and monitor you, and provide advice on any necessary testing or treatment"
        }
    ]
}