{
    "url": "https://marinescience.blog.gov.uk/2025/11/19/world-antimicrobial-awareness-week-act-now-protect-our-present-secure-our-future/",
    "title": "World Antimicrobial Awareness Week - act now, protect our present, secure our future",
    "authors": [
        "Athina Papadopoulou",
        "Craig Baker-Austin"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "Middle East"
    ],
    "pub_date": "2025-11-19T11:06:57+00:00",
    "content": [
        {
            "text": "Antimicrobial resistance (AMR) threatens modern medicine, rendering Antimicrobial resistance (AMR) threatens modern medicine, rendering infections untreatable, surgeries risky, and lives vulnerable. Without urgent action, routine illnesses could become deadly, reversing decades of clinical progress and endangering global health security.  The health of humans, animals, and the environment is interconnected, a concept known as the One Health approach. In marine ecosystems, antimicrobial resistance (AMR) is a growing threat, driven by pollution, wastewater discharge, and inappropriate antibiotic use of antimicrobials in human, animals and environment sectors. Resistant bacteria can spread through the water, affecting marine life and ultimately posing risks to human health."
        },
        {
            "text": "AMR, often referred to as the “silent pandemic”, poses a growing threat to global health and food systems. World AMR Awareness Week takes place annually in November to raise awareness and encourage action to tackle the emergence and spread of AMR pathogens, with this year's theme being, \"act now, protect our present, secure our future\"."
        },
        {
            "text": "The UK FAO Antimicrobial Resistance (AMR) Reference Centre, established under the United Nations Food and Agriculture Organization (UN FAO) designation is equally shared with three Defra agencies: Animal Plant Health Agency (APHA), Centre for Environment, Fisheries and Aquaculture Science (Cefas) and Veterinary Medicine Directorate (VMD). The UK FAO Reference Centre provides independent scientific and technical expertise to support the FAO’s global mission and contributes to this effort by offering world-class policy and scientific guidance to address AMR in terrestrial and aquatic animals, as well as their environments, using a One Health approach."
        },
        {
            "text": "Athina Papadopoulou, Senior Research Microbiologist, Co-Lead of the UK’s FAO Reference Centre for AMR, said, “AMR does not respect boundaries – human, animal, and environmental health are interconnected. WAAW underscores the urgent need for a One Health approach and global partnerships to safeguard our future. At Cefas we are working with partners around the world to generate the evidence we need, and drive meaningful action to safeguard the environment, animal and human health.’"
        },
        {
            "text": "Find out more about how Cefas' work contributes to tackling this global threat with some highlights from past and current activities in our latest blog."
        },
        {
            "heading": 3,
            "text": "Capacity Strengthening in Kenya and Zambia"
        },
        {
            "text": "During WAAW, the Cefas Reference Centre team led an online training on antimicrobial susceptibility testing (AST) for collaborators from the Fish Quality Control Laboratory-Nairobi (FQCL) in Kenya and Aquaculture Research Institute of Zambia (ARIZ) in Zambia.  The training included an overview of the AMR threat through the One Health lens, presentations from collaborators covering success story on ISO accreditation in laboratories in Ghana and expanding ISO accreditation to sentinel laboratories in Nigeria. Alumni experiences from the Fleming Fund Fellowship were shared and theoretical AST sessions led by Cefas, and APHA also took place. Additionally, the collaborators had the opportunity to attend an e-learning course on residues with theoretical and online sessions through August to October 2025 and online training on InFarm by the FAO team in October 2025."
        },
        {
            "heading": 3,
            "text": "UK FAO Antimicrobial Resistance Reference Centre  Singapore workshop "
        },
        {
            "text": "The UK FAO Antimicrobial Resistance (AMR) Reference Centre co-led a five-day knowledge exchange workshop in Singapore in July 2025. The workshop was delivered by Cefas, in collaboration with the UK’s Animal and Plant Health Agency (APHA), the UN FAO Regional Office for Asia and the Pacific (FAO RAP), and Singapore’s National Parks Board (NParks). The event brought together participants from 11 countries across South and Southeast Asia. Through a combination of theoretical sessions and practical, hands-on laboratory training, attendees gained valuable skills in detecting AMR in aquatic animals. Find out more in our workshop blog."
        },
        {
            "heading": 3,
            "text": "Setting the rules – establishing ECOFF guidance for aquatic pathogens"
        },
        {
            "text": "Bacteria that infect animals including fish, play an important role in the global spread of AMR, and need to be considered alongside important human pathogens to fully understand and tackle drug resistance. Cefas, as the UK FAO AMR Reference Centre, has led global initiatives to establish ECOFFs (ecological cut off values) for aquatic pathogens, coordinating multi-laboratory studies across three continents. Using various AMR tests under varied conditions -  including different temperatures - the team determined antibiotic resistance thresholds for pathogens like Yersinia ruckeri and Vibrio parahaemolyticus. These cut-off values are critical for identifying resistant strains, guiding treatment strategies, and protecting aquatic and human health against the growing threat of antimicrobial resistance worldwide. The work underpinning these efforts was recently highlighted as an important case study for the UK’s national action plan (NAP)."
        },
        {
            "heading": 3,
            "text": "West Africa AMR One Health Grant "
        },
        {
            "text": "The West Africa Antimicrobial Resistance One Health (AMROH) grant is a Fleming Fund Regional Grant led by Cefas and delivered through a consortium including the FAO Subregional West Africa Office in Senegal, APHA, and VMD between January 2022 and March 2026. Funded by the UK Department of Health and Social Care, AMROH supports Fleming Fund Country Grants by strengthening AMR surveillance across animal health including aquaculture and environment sectors. There are several AMROH grants targeted at Lower- and middle-Income Countries (LMICs) regions e.g. West Africa, East Africa, South and South East Asia. The grant the Reference Centre leads targets four West African countries—Ghana, Nigeria, Senegal, and Sierra Leone. Recent milestones include workshops on antimicrobial residues in Ghana, antimicrobial susceptibility testing (AST) training in Ghana, Sierra Leone and Senegal, and the feedback on the surveillance strategies in all four recipient countries. Read more in our previous blog and this APHA blog."
        },
        {
            "heading": 3,
            "text": "Climate, Health and Environment ResilienceProgramme (CHERP) in the Gulf"
        },
        {
            "text": "Collaborative research was conducted with the Kuwait Institute of Scientific Research (KISR) and the Environment Public Authority (EPA) to assess the presence and diversity of antibiotic resistance in marine water and sediment and coastal wastewater outfalls. This research project included training of junior researchers in bacterial isolation, identification, and AMR resistance testing, with project results published in a number of peer-reviewed scientific journal articles. This research contributes to a baseline screening of the presence of AMR in the Gulf marine environment and will inform the ongoing development of Kuwait’s agri-environment surveillance programme and national guidelines on antibiotic usage. Find out more about the wider CHERP programme including our AMR work in the Gulf in our report."
        },
        {
            "text": "You can also find out more about our AMR research in these recent papers:"
        },
        {
            "text": "Epidemiological cut-off values for Vibrio parahaemolyticus calculated from minimal inhibitory concentration data generated at 35 and 28°C - PubMed"
        },
        {
            "text": "National Action Plans for Antimicrobial Resistance: What are they and how do they affect aquaculture? | Published in Bulletin of the European Association of Fish Pathologists"
        },
        {
            "text": "Diversity and antimicrobial resistance among bacterial isolates from finfish aquaculture in Thailand | BMC Veterinary Research"
        },
        {
            "text": "First national study on genomic profiling of Escherichia coli in United Arab Emirates (UAE) aquatic environments shows diverse Quinolone and Cephalosporin resistance - ScienceDirect"
        },
        {
            "text": "Association of antimicrobial resistant Vibrio and species pathogenic to humans with aquacultured seafood - ScienceDirect"
        }
    ]
}