{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/07/15/air-st-leadership-integration-roles-dstl/",
    "title": "Air S&T Leadership & Integration Roles- DSTL",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-07-15T14:41:16+01:00",
    "content": [
        {
            "text": "Can you work in partnership with industry and academia to deliver the future of UK airpower?"
        },
        {
            "text": "The Dstl Air Systems Programme has a new four-year mandate to develop and exploit air-related S&T, to benefit UK defence, security, & prosperity. We have a number of exciting and unique technical leadership & integration roles at all points of the S&T life cycle and at all grades and Dstl Levels."
        },
        {
            "text": "These opportunities fall into four broad areas, and all have equal priority in the Dstl Air Systems Programme:"
        },
        {
            "text": "I. Enhancing air S&T pull-through from across the enterprise to address major capability challenges, such as Freedom of Access & Manoeuvre (FOAM), and Air Information Advantage"
        },
        {
            "text": "II. Future Combat Air System Programme, which is maturing technologies for and developing a 6th generation combat air system to replace Typhoon when it leaves service around 2040"
        },
        {
            "text": "III. Technical support to the RAF Rapid Capabilities Office (RCO) and the Air & Space Warfare Centre (ASWC), putting S&T into the hands of front-line users more quickly"
        },
        {
            "text": "IV. Dstl’s CUTLASS & SABRE combat air simulators are key to helping UK understand how to maximise effectiveness from its various combat air systems"
        },
        {
            "text": "For more information, including job descriptions and how to apply, please click here"
        },
        {
            "text": "Apply before 11:50 pm on Monday 31st October 2022"
        }
    ]
}