{
    "url": "https://kingsawards.blog.gov.uk/2022/07/15/email-security-team-spambrella-recognised-for-its-excellence-and-growth-with-global-clients/",
    "title": "Email Security Team Spambrella Recognised For Its Excellence And Growth With Global Clients",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "International trade",
        "Queen's Awards",
        "queensawards",
        "South East",
        "Uncategorized",
        "Winners"
    ],
    "pub_date": "2022-07-15T14:03:51+01:00",
    "content": [
        {
            "text": "The Queen’s Awards for Enterprise are the most prestigious awards for UK businesses and are a globally recognised royal seal of approval for UK companies."
        },
        {
            "text": "The Queen's Award to Industry, the scheme's original title, was instituted by Royal Warrant in 1965, with the first Awards announced in 1966. It later became known as The Queen's Awards for Export and Technology in 1975, before becoming The Queen's Awards for Enterprise in 1999. "
        },
        {
            "text": "Those companies awarded in International Trade have demonstrated that their business has achieved substantial growth in overseas earning and in commercial success (for their business size and sector) through either outstanding achievement over 3 years or continuous achievement over 6 years."
        },
        {
            "text": "Spambrella is an Email Security and Security Awareness Training specialist. Their services are delivered to some of the World’s largest and most successful security-conscious companies in a multitude of continents and environments.  "
        },
        {
            "text": "Stuart Hargreaves, COO of Spambrella says; "
        },
        {
            "text": "Stuart Hargreaves commented on receiving the award; "
        },
        {
            "text": "Internationally Spambrella has gained more recognition since they attained the award. They have already seen a net benefit to the business especially with confidence in our brand and with that, additional organic sales growth. "
        },
        {
            "text": "Spambrella’s advice for potential applicants is to study the applications questions and discuss the figures with your team. It will soon become apparent if the facts are in-line. Additionally, it is important to have a story, remember this is an award for 'Enterprise' so do not be put off if you do not have £100M annually in revenues. It is good to share your struggles, successes - the judges are real people, and you want them to feel the passion and pride you have for your company. "
        },
        {
            "text": "Learn more about Spambrella here: https://www.spambrella.com/ "
        },
        {
            "text": "Applications for The Queen’s Awards for Enterprise are now open, and close midday 6th September. Apply here: https://www.gov.uk/queens-awards-for-enterprise "
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880 "
        }
    ]
}