{
    "url": "https://space.blog.gov.uk/2024/09/24/enabling-technologies-programme-lasers/",
    "title": "Enabling Technologies Programme: Lasers!",
    "authors": [
        "Emily Jayne Peters"
    ],
    "categories": [
        "Delivering Missions and Capabilities"
    ],
    "pub_date": "2024-09-24T09:34:56+01:00",
    "content": [
        {
            "text": "Our Enabling Technologies Programme (ETP) is designed to increase the readiness of high-potential technologies. One of the most captivating technologies being used and developed by our project partners is the laser. Powerful, accurate and highly versatile, lasers are found in a wide range of devices we use every day and enable developments in areas ranging from modern medicine to military and space applications."
        },
        {
            "text": "The UK Space Agency’s ETP calls have funded 41 projects to date across 4 themes. In conjunction with the Science and Technology Facilities Council (STFC), ETP Call 2 invited applications for funding under the theme “Science Instruments”. Naturally, several of the successful projects are making use of laser technology for space science.The Glasgow-based Fraunhofer Centre for Applied Photonics  (ETP2-006) is due to complete “Global Lidar Altimetry Mission: GLAMIS” (UAV demonstrator phase) by November 2024 in collaboration with the University of Edinburgh."
        },
        {
            "text": "Much like the traditional sonar methods used underwater, LiDAR - laser imaging (or light), detection, and ranging – uses lasers by firing them at a surface and measuring how long it takes for the signal to be returned. Quantum technology has improved LiDAR to allow scientists to develop sensitive and highly efficient instruments suitable for space applications. GLAMIS draws from this technology to develop a low SWaP light detection and ranging method (LiDAR) instrument that can be mounted onto uncrewed aerial vehicles (UAVs) such as drones and satellites, to support Earth observation and Earth sciences."
        },
        {
            "text": "Testing GLAMIS has not been easy; hindered by the need for a full moon on a cloudless night (no mean feat in Scotland!), the team at Fraunhofer had to wait several months to fly a UAV."
        },
        {
            "text": "August 2024’s spectacular Super Blue Moon allowed for the first night test-flight of GLAMIS demonstration aboard a drone. The team is also celebrating acceptance of a conference paper at the upcoming IEEE Photonics Conference in Rome, Italy."
        },
        {
            "text": "Refining our use of laser technology is essential for furthering space exploration in undesirable conditions. ETP2-021 supports MDA Space and Robotics in their ongoing project, “Structured light for Robotics guidance, InsPection and Exploration (STRIPE)”. Due for completion in early 2025, the team at MDA is working to develop a novel laser sensor that will enable even the most difficult of space missions by supporting complex vision-based missions in poor illumination conditions, promising extensive commercial and research opportunities."
        },
        {
            "text": "Also funded by ETP2 is RAL Space in Harwell, which provides a valuable industry-academia link, and is the space hub for UK Rese​arch and Innovation​. ETP2-022, “Quantum magnetometry for Space Weather”, aims to design and manufacture a highly stabilised laser which can be used in low Earth orbit to support space weather measurement."
        },
        {
            "text": "Mark Bason, quantum researcher at RAL Space, told us:"
        },
        {
            "text": "To learn more about the Enabling Technologies Programme, look out for upcoming posts featuring advanced and novel instruments, communications technology, and equipment to aid human exploration of space!"
        }
    ]
}