{
    "url": "https://food.blog.gov.uk/2024/09/24/explaining-allergy-advice-on-mustard-ingredients-contaminated-with-peanuts/",
    "title": "Explaining allergy advice on mustard ingredients contaminated with peanuts",
    "authors": [
        "Darren Whitby, Head of Incidents and Resilience"
    ],
    "categories": [
        "Allergy",
        "Business guidance"
    ],
    "pub_date": "2024-09-24T16:01:31+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "You may have seen recent coverage or information regarding mustard ingredients contaminated with peanuts. The FSA are advising people who have a peanut allergy to avoid consuming foods that contain or may contain mustard ingredients."
        },
        {
            "text": "We are urgently working with the relevant local authorities, individual businesses and industry organisations to identify further products which are affected."
        },
        {
            "text": "Here, we explain more about what our advice is, what consumers should look out for and what businesses should be doing."
        },
        {
            "heading": 3,
            "text": "Does this advice affect all products containing mustard, including mustard itself?"
        },
        {
            "text": "Those with a peanut allergy should avoid consuming any products containing mustard, mustard powder or mustard flour as an ingredient, until further notice, while we investigate. This includes:"
        },
        {
            "heading": 3,
            "text": "Can you provide a date or time frame when this contamination has occurred? For example, would those affected by peanut allergies be able to eat food in their cupboards purchased before September 2024?"
        },
        {
            "text": "We can’t provide a date or time frame at the moment, because it is unclear when the contamination began at the supplier in India. Until we can establish that, we are advising people with a peanut allergy to avoid all products containing mustard, including those purchased before September 2024."
        },
        {
            "heading": 3,
            "text": "Is it safe to eat out?"
        },
        {
            "text": "We are advising those with a peanut allergy to take extra precautions above those they usually take as they should avoid consuming products that contain or may contain mustard, mustard flour or mustard powder. So, if you can’t see the allergen information when you eat out please speak to staff, and if in any doubt do not consume. This advice also applies in settings such as schools, hospitals and care homes, as well as cafes and restaurants. We are working with industry organisations to make sure that businesses in these sectors are aware of and are acting on our advice."
        },
        {
            "heading": 3,
            "text": "How long will the investigation take? How long will people with a peanut allergy have to avoid eating foods that contain or may contain mustard, mustard flour or mustard powder?"
        },
        {
            "text": "Due to the nature of the contaminated product, the investigation is likely to be long and complex. We know of at least one UK based business that received a contaminated batch from the Indian supplier; we need to establish whether there are others. Mustard is an ingredient that is used in small quantities in many products, and those products may pass through more than one business before they reach the end consumer. For example, the contaminated mustard powder could have been made into a spice mix by one business, that is then supplied to another business to be added to a sauce, that is then supplied to another business to be used in a sandwich or ready meal, that is finally sold to consumers. "
        },
        {
            "text": "The investigation is therefore a painstaking process for businesses and local authorities checking where contaminated products have been supplied to, and following up at each stage of the chain until all affected products are identified. The FSA has asked businesses to carry out this process as quickly as possible."
        },
        {
            "heading": 3,
            "text": "Does this advice just affect the UK?"
        },
        {
            "text": "We are aware that at least one of the affected products has been exported to Ireland. We are working closely with the Irish authorities and you can find details of the action that they are taking on their website. It is not clear whether the contaminated batch of mustard powder was exported from India to other countries, but we have alerted the International Food Safety Authorities Network (INFOSAN) to our investigation so that other food authorities can take appropriate action in their countries."
        },
        {
            "heading": 3,
            "text": "I work in a restaurant, what should I be doing to protect my customers?"
        },
        {
            "text": "It’s extremely important that anyone with a peanut allergy does not consume foods or drinks that contain or may contain mustard, mustard powder or mustard flour, because it may have been contaminated with peanuts."
        },
        {
            "text": "If any of the items on your menu contain (or may contain mustard, mustard powder or mustard flour) please make sure you inform customers with peanut allergies, and tell them not to consume them."
        },
        {
            "text": "We’re asking people with peanut allergies to check with cafe or restaurant staff if any of their products contain mustard – by law, food businesses must provide this information to customers."
        },
        {
            "text": "You may also find it useful to refresh your knowledge of our general guidance on how to manage allergies in food businesses."
        },
        {
            "heading": 3,
            "text": "How can I find up-to-date information on which products have been affected?"
        },
        {
            "text": "A full list of recalled products can be found here."
        },
        {
            "text": "As always, we urge people with an allergy to sign up to our allergy alerts, to get future allergy product recall alerts by email or SMS text message. This is a free service."
        },
        {
            "heading": 1,
            "text": "Egluro’r rhybudd alergedd ar gynhwysion mwstard sydd wedi’u halogi â physgnau"
        },
        {
            "text": "Efallai y byddwch wedi clywed sôn yn ddiweddar am gynhwysion mwstard sydd wedi’u halogi â physgnau. Mae’r ASB yn cynghori pobl ag alergedd i bysgnau i osgoi bwyta bwydydd sy’n cynnwys neu a allai gynnwys cynhwysion mwstard."
        },
        {
            "text": "Rydym yn gweithio ar frys gyda’r awdurdodau lleol perthnasol, busnesau unigol a sefydliadau’r diwydiant i ganfod cynhyrchion eraill yr effeithir o bosib arnynt."
        },
        {
            "text": "Yma, rydym yn esbonio mwy am ein cyngor, yr hyn y dylai defnyddwyr edrych amdano a’r hyn y dylai busnesau fod yn ei wneud."
        },
        {
            "heading": 3,
            "text": "A yw’r cyngor hwn yn effeithio ar bob cynnyrch sy’n cynnwys mwstard, gan gynnwys mwstard ei hun?"
        },
        {
            "text": "Dylai pobl ag alergedd i bysgnau osgoi bwyta unrhyw gynhyrchion sy’n cynnwys mwstard, powdr mwstard neu flawd mwstard fel cynhwysyn, hyd nes y clywir yn wahanol, wrth i ni gynnal ymchwiliadau. Mae hyn yn cynnwys:"
        },
        {
            "heading": 3,
            "text": "A allwch chi roi dyddiad neu gyfnod amser pan ddigwyddodd yr halogiad hwn? Er enghraifft, a fyddai pobl ag alergedd i bysgnau yn gallu bwyta bwyd yn eu cypyrddau a brynwyd cyn mis Medi 2024?"
        },
        {
            "text": "Ni allwn roi dyddiad na chyfnod amser ar hyn o bryd oherwydd nad yw’n glir pryd y dechreuodd yr halogiad gyda’r cyflenwr yn yr India. Hyd nes y gallwn gadarnhau hynny, rydym yn cynghori pobl ag alergedd i bysgnau i osgoi pob cynnyrch sy’n cynnwys mwstard, gan gynnwys y rheiny a brynwyd cyn mis Mehefin 2024."
        },
        {
            "heading": 3,
            "text": "A yw’n ddiogel bwyta allan?"
        },
        {
            "text": "Rydym yn cynghori pobl ag alergedd i bysgnau i gymryd rhagofalon ychwanegol uwchlaw’r rhai y maent fel arfer yn eu cymryd gan y dylent osgoi bwyta cynhyrchion sy’n cynnwys neu a allai gynnwys mwstard, blawd mwstard neu bowdr mwstard. Felly, os na allwch weld yr wybodaeth am alergenau pan fyddwch yn bwyta allan, siaradwch â’r staff. Os bydd gennych amheuaeth, peidiwch â bwyta’r cynnyrch dan sylw. Mae’r cyngor hwn hefyd yn berthnasol mewn lleoliadau fel ysgolion, ysbytai a chartrefi gofal, yn ogystal â chaffis a bwytai. Rydym yn gweithio gyda sefydliadau’r diwydiant i wneud yn siŵr bod busnesau yn y sectorau hyn yn ymwybodol o’n cyngor ac yn gweithredu arno."
        },
        {
            "heading": 3,
            "text": "Pa mor hir fydd yr ymchwiliad yn ei gymryd? Am faint y bydd angen i bobl ag alergedd i bysgnau osgoi bwyta bwydydd sy’n cynnwys neu a allai gynnwys mwstard, blawd mwstard neu bowdr mwstard?"
        },
        {
            "text": "Oherwydd natur y cynnyrch halogedig, mae’r ymchwiliad yn debygol o fod yn hir a chymhleth. Gwyddom am o leiaf un busnes yn y DU a gafodd swp halogedig gan y cyflenwr o’r India; mae angen i ni ddarganfod a oes rhai eraill. Defnyddir mwstard fel cynhwysyn mewn symiau bach mewn llawer o gynhyrchion, a gallai’r cynhyrchion hynny basio trwy fwy nag un busnes cyn iddynt gyrraedd y defnyddiwr terfynol. Er enghraifft, gallai’r powdr mwstard halogedig fod wedi’i wneud yn gymysgedd sbeis gan un busnes, sydd wedyn yn cael ei gyflenwi i fusnes arall i’w ychwanegu at saws, sydd wedyn yn cael ei gyflenwi i fusnes arall i’w ddefnyddio mewn brechdan neu bryd parod, sy’n cael ei werthu yn y pen draw i ddefnyddwyr. Mae’r ymchwiliad, felly, yn broses fanwl wrth i fusnesau ac awdurdodau lleol wirio i ble mae cynhyrchion halogedig wedi’u cyflenwi, a gwneud gwaith dilynol ym mhob cam o’r gadwyn tan fydd yr holl gynhyrchion yr effeithir arnynt wedi’u nodi. Mae’r ASB wedi gofyn i fusnesau gynnal y broses hon cyn gynted â phosib."
        },
        {
            "heading": 3,
            "text": "A yw’r cyngor hwn yn effeithio ar y DU yn unig?"
        },
        {
            "text": "Rydym yn ymwybodol bod o leiaf un o’r cynhyrchion yr effeithiwyd arnynt wedi’i allforio i Iwerddon. Rydym yn gweithio’n agos gydag awdurdodau Iwerddon, a gallwch ddod o hyd i fanylion y camau y maent yn eu cymryd ar eu gwefan. Nid yw’n glir a gafodd y swp halogedig o bowdr mwstard ei allforio o’r India i wledydd eraill, ond rydym wedi hysbysu’r Rhwydwaith Awdurdodau Diogelwch Bwyd Rhyngwladol (INFOSAN) am ein hymchwiliad fel y gall awdurdodau bwyd eraill gymryd camau priodol yn eu gwledydd."
        },
        {
            "heading": 3,
            "text": "Rwy’n gweithio mewn bwyty. Beth dylwn i fod yn ei wneud i ddiogelu fy nghwsmeriaid?"
        },
        {
            "text": "Mae’n hynod bwysig nad oes neb ag alergedd i bysgnau yn bwyta bwydydd nac yn yfed diodydd sy’n cynnwys neu a allai gynnwys mwstard, powdr mwstard neu flawd mwstard oherwydd ei bod yn bosib eu bod wedi’u halogi â physgnau."
        },
        {
            "text": "Os yw unrhyw rai o’r eitemau ar eich bwydlen yn cynnwys (neu os gallent gynnwys) mwstard, powdr mwstard neu flawd mwstard, gwnewch yn siŵr eich bod yn rhoi gwybod i gwsmeriaid ag alergedd i bysgnau, a dywedwch wrthynt am beidio â’u bwyta."
        },
        {
            "text": "Rydym yn gofyn i bobl ag alergedd i bysgnau wirio gyda staff y caffi neu’r bwyty a yw unrhyw rai o’u cynhyrchion yn cynnwys mwstard – yn ôl y gyfraith, mae’n rhaid i fusnesau bwyd ddarparu’r wybodaeth hon i gwsmeriaid. "
        },
        {
            "text": "Efallai y bydd hefyd o ddefnydd i chi adnewyddu eich gwybodaeth am ein canllawiau cyffredinol ar sut i reoli alergeddau mewn busnesau bwyd."
        },
        {
            "heading": 3,
            "text": "Sut gallaf ddod o hyd i’r wybodaeth ddiweddaraf am y cynhyrchion yr effeithiwyd arnynt?"
        },
        {
            "text": "Mae rhestr lawn o’r cynhyrchion a alwyd yn ôl i’w gweld yma. Fel bob amser, rydym yn annog pobl ag alergedd i danysgrifio i’n rhybuddion alergedd er mwyn cael rhybuddion ‘galw cynnyrch yn ôl’ yn y dyfodol trwy e-bost neu neges destun. Mae’r gwasanaeth hwn yn rhad ac am ddim."
        }
    ]
}