{
    "url": "https://forestrycommission.blog.gov.uk/2024/09/24/make-your-next-woodland-condition-assessment-easier/",
    "title": "Make your next Woodland Condition Assessment easier",
    "authors": [
        "Chris Tomlin"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2024-09-24T09:00:00+01:00",
    "content": [
        {
            "text": "Trees provide far-reaching benefits to people, nature and the wider environment. But to deliver these benefits, they need to be well-managed and protected. A good way to achieve this is to regularly check the condition of your trees."
        },
        {
            "text": "A Woodland Condition Assessment can help you do just that. This year we launched an app that makes completing this assessment much easier."
        },
        {
            "heading": 2,
            "text": "Woodland Condition Assessments explained"
        },
        {
            "text": "A condition assessment tells you how your woodland is doing, which helps you determine how to improve it and how best to manage it."
        },
        {
            "text": "Using the Woodland Condition Assessment app, you will be asked to evaluate 15 different indicators, from the number of species in your woodland to the health of your trees. The assessment then compares your answers against a set of standards to tell you the overall condition of your woodland."
        },
        {
            "text": "Every woodland will benefit from an assessment which should be repeated if there are any major changes, or every 10 years. You can use the app for broadleaf, conifer, native, non-native and mixed woodlands. But it isn't suitable for designated woodlands (a Site of Special Scientific Interest for example)."
        },
        {
            "heading": 2,
            "text": "Why assess your woodland?"
        },
        {
            "text": "Assessments can help you to boost biodiversity, spot early signs of trouble and get more out of your woodland. Anyone can complete an assessment, whether you’re the owner and manager of a small wood or looking to take Biodiversity Net Gain (BNG) measurements."
        },
        {
            "text": "These assessments are also required for some of our grant schemes, including the Landscape Recovery scheme and HS2 Woodland Fund."
        },
        {
            "heading": 2,
            "text": "Improving the process"
        },
        {
            "text": "Previously, woodland managers had to fill out a series of spreadsheets to complete a Woodland Condition Assessment. These were difficult to navigate and cumbersome to use in the field."
        },
        {
            "text": "People told us they wanted an improved, accessible version of the assessment, which had clearer guidance and could be accessed and completed on site. We also needed to optimise the whole process to reflect how to make improvements for BNG in woodlands."
        },
        {
            "text": "This is exactly what we did. The methodology behind the assessment was proven and sound. So our focus was to tangibly improve the experience for woodland managers and other users."
        },
        {
            "text": "In early 2023 I began a project to develop a new app, working with a wide range of organisations, who suggested ways to improve the assessment and tested the app during development. This included Small Woodlands Association, ICF, Woodland Trust, Natural England, Forest Research, Defra and RSPB."
        },
        {
            "heading": 2,
            "text": "Using the app to complete your assessment"
        },
        {
            "text": "Earlier this year the app was launched along with new guidance and support. Sylva Foundation led on the build and design of a new app, while the Field Studies Council developed the guides, survey instructions and training."
        },
        {
            "text": "Woodland owners and managers have given us some great feedback so far:"
        },
        {
            "text": "We will use assessment data to build up a picture of woodland condition at a national, regional and sub regional level. This helps us to target initiatives, feed into Local Nature Recovery Strategies and to track changes in woodland condition."
        },
        {
            "text": "The Woodland Condition Assessment app is available to use on your phone, tablet or desktop for free. You can use it to carry out assessments and/or for use to contribute to the overall BNG calculation for a site. The app will talk you through the whole process and interpret the results for you."
        },
        {
            "text": "You can access the app through the Woodland Condition Assessment web page and the Field Studies Council have helpful guides and training to support those undertaking assessments."
        }
    ]
}