{
    "url": "https://environmentagency.blog.gov.uk/2024/09/24/nutrient-planning-is-not-small-potatoes/",
    "title": "Nutrient planning is not small potatoes",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Uncategorized"
    ],
    "pub_date": "2024-09-24T14:01:39+00:00",
    "content": [
        {
            "text": "An Environment Agency expert discusses the importance of nutrient planning."
        },
        {
            "text": "I'm a Senior Environment Officer for Agriculture for the Environment Agency and part of my role involves assessing whether the fertilisers and manures that a farmer plans to use are what is needed by the crops they are growing."
        },
        {
            "text": "Importance of nutrients for crops"
        },
        {
            "text": "Crops require various nutrients to grow. Different crops and varieties need varying amounts of these nutrients at different growth stages. Some nutrients can be sourced from soil reserves, underlining the importance of soil testing to understand nutrient availability. A lack of essential nutrients can lead to reduced crop yield and quality."
        },
        {
            "text": "When manures and fertilisers are applied, they can provide nutrients that crops can utilise immediately or be stored in the soil for future use.  Applying too many nutrients can exceed the plants’ needs and soil capacity, which can then be lost. These lost nutrients can pollute streams and rivers."
        },
        {
            "text": "Soil sampling and testing help farmers to plan what manures and fertilisers are needed, ensuring their investments in these resources are maximised, while also complying with regulations."
        },
        {
            "text": "Engaging with farmers to identify issues in nutrient management"
        },
        {
            "text": "Although we have various regulatory tools at our disposal, one of the most effective ways to improve practices in this aspect of farming is to provide advice."
        },
        {
            "text": "I share learning between farmers and partners that help protect the environment and reduce costs to the farm. Where non-compliance with a regulation is identified, I agree actions with the farmer to make the necessary improvements."
        },
        {
            "text": "Before each inspection, I inform a farmer about the areas we will focus on and the documents we will review."
        },
        {
            "text": "Earlier this year, I conducted a farm inspection where I examined the farm’s soil test results, previous fertiliser and manure spreading records, and its nutrient plan for the cropping year ahead."
        },
        {
            "text": "A nutrient plan is prepared before a crop is sown to help decide the type and amounts of manures and fertilisers that are needed to help the crop to grow."
        },
        {
            "text": "Due to the wet winter and spring this year (2024) and the delay in planting, no manures or fertilisers had been applied at the time of inspection."
        },
        {
            "text": "On reviewing the fertiliser application plans for the farm, I noticed that some potato fields were at risk of receiving more manure and compound fertiliser than necessary. To address this concern, I consulted with the farmer and the farm’s advisors. The farm had a few different advisors involved in soil testing, nutrient planning, crop selection, and record-keeping."
        },
        {
            "text": "Variables change a lot with crop growing and this can affect decision making. So, for nutrient management plans to be accurate, it’s essential that all those working for the farm business share timely information with each other."
        },
        {
            "text": "In this case, recent soil test results and new crop variety information had not been communicated effectively. As a result, the nutrient management plan was outdated and needed to be reviewed. If the farmer had followed the original plan, there would have been more nutrients applied than required by the soil and crops."
        },
        {
            "text": "Actions taken by the farm"
        },
        {
            "text": "As a result of the inspection, the farmer made improvements to the nutrient plans, including using recent soil test results to inform the amount of manure and type of fertiliser that the potato crops needed."
        },
        {
            "text": "We also discussed what actions the farmer takes to reduce soil runoff, which happens when rainwater flows over the surface of the land and carries away soil and nutrients."
        },
        {
            "text": "The farmer was already proactive in this area, reducing the risk of soil loss by making sure there was a green cover of crops over the winter and only growing varieties of potato that are harvested before the wetter weather, which generally starts in the autumn."
        },
        {
            "text": "Addressing current challenges"
        },
        {
            "text": "In 2023, Defra reported a utilised agricultural area of 17 million hectares, covering 70% of land in the UK. Inspections can lead to improvements that safeguard the environment and save costs by preventing nutrient over-application.  Further information about the importance of nutrient management planning in farming: Regulations require farmers to test their soil to monitor nutrient levels"
        }
    ]
}