{
    "url": "https://buyingforschools.blog.gov.uk/2024/09/24/safety-in-school-kitchens-and-laundries-the-vital-role-of-risk-assessments-and-equipment-checks/",
    "title": "Safety in school kitchens and laundries: the vital role of risk assessments and equipment checks",
    "authors": [
        "Julie Noble, Health, safety and fire resilience technician"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-09-24T12:14:49+01:00",
    "content": [
        {
            "text": "Julie Noble is health, safety, and fire resilience technician for the risk protection arrangement (RPA), the DfE’s alternative to commercial insurance. When it comes to school kitchens and laundries, safety isn’t just a matter of convenience - it’s an absolute necessity. In this blog, Julie talks about how risk assessments and equipment checks are essential tools for keeping everyone safe."
        },
        {
            "heading": 3,
            "text": "Why risk assessments are important"
        },
        {
            "text": "Risk assessments are not just paperwork; they are a fundamental tool for preventing accidents and complying with legal obligations. They play a pivotal role in ensuring the safety of everyone."
        },
        {
            "text": "Kitchens and laundries have their own set of health and safety challenges. The risks are multiple and diverse, from sharp knives to hot surfaces, dish washers to washing machines, and fryers to dryers. A risk assessment helps pinpoint hazards and allows for the implementation of reasonable steps to mitigate them."
        },
        {
            "text": "Conducting checks in my role as health, safety and fire resilience technician, I have come across most risk scenarios in schools. It is quite an exhaustive list but based on my practical experience and common claims that come through the risk protection arrangement (RPA) service, I want to focus on the measures you can take to reduce potentially catastrophic consequences in two key areas – dryers and fryers."
        },
        {
            "heading": 3,
            "text": "Dryers and fryers"
        },
        {
            "text": "Dryers and deep-fat fryers are appliances used daily in most schools. Any negligence can have serious consequences, but accidents can be prevented if the correct checks are undertaken."
        },
        {
            "text": "A common cause of fires is due to wear and tear. Frequent use can lead to malfunctioning parts, loose connections and a build-up of debris such as crumbs and fat in fryers, and lint in dryers."
        },
        {
            "text": "Proactively addressing these issues reduces the risk of accidents such as electrical fires or oil spills. Well-maintained equipment will also last longer, saving your school money on replacements."
        },
        {
            "text": "I’ve pulled together some simple pointers and advice that I hope will help you:"
        },
        {
            "heading": 4,
            "text": "General fryer advice"
        },
        {
            "heading": 4,
            "text": "General dryer advice"
        },
        {
            "heading": 3,
            "text": "Risk assessments and equipment checks "
        },
        {
            "text": "I’d like to close by sharing some basic risk assessment and equipment check information every school or trust should adhere to."
        },
        {
            "heading": 4,
            "text": "Risk assessments"
        },
        {
            "text": "Risk assessments involve systematically identifying potential hazards within the kitchen. From slippery floors to malfunctioning equipment, these assessments help pinpoint areas of concern."
        },
        {
            "text": "Once hazards are identified, the next step is evaluating the associated risks. How likely is an accident or injury? What could be the consequence? Risk assessments provide answers and guide decision making."
        },
        {
            "text": "Armed with risk assessment findings, schools can take targeted action. Whether it’s implementing safety protocols, providing training, or modifying procedures, risk assessments inform preventative measures."
        },
        {
            "heading": 4,
            "text": "Role of equipment checks "
        },
        {
            "text": "Equipment checks ensure that kitchen appliances and tools are in proper working condition. Regular inspections catch issues early, preventing potential accidents or breakdowns."
        },
        {
            "text": "When equipment checks reveal problems, for example faulty wiring, malfunctioning ovens, or worn-out knives, schools can take immediate corrective actions to minimise risks."
        },
        {
            "text": "Schools must adhere to health and safety regulations. Proper equipment checks demonstrate compliance and contribute to a safe environment."
        },
        {
            "heading": 3,
            "text": "Help and advice"
        },
        {
            "text": "I recognise that this is an important task, and this is just a brief overview. If you would like more information about the topics discussed in this blog post, or about the RPA, visit the GOV.UK RPA website or contact schools.commercial@education.gov.uk ."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}