{
    "url": "https://defradigital.blog.gov.uk/2024/09/24/thinking-big-and-bold-meet-fast-streamer-amad-ahmed/",
    "title": "Thinking big and bold: Meet fast streamer Amad Ahmed",
    "authors": [
        "barryshaw"
    ],
    "categories": [
        "Defra digital",
        "Defra technology"
    ],
    "pub_date": "2024-09-24T08:32:09+01:00",
    "content": [
        {
            "text": "Digital, Data, Technology (DDaT) and Cyber Fast Streamer Amad Ahmed considers what inspires him to think big and to be bold and innovative in his approach to work."
        },
        {
            "text": "Hi, I’m Amad, and I joined Defra last October, as part of the Civil Service Fast Stream. This is my first role at Defra and my second fast stream posting, which began with a role in User Centred Design a year earlier at the Department for Business and Trade."
        },
        {
            "text": "Defra was my first choice for placement as the Department is aligned with my personal values. I was drawn to this current role of Technology Innovation Consultant within Digital, Data, Technology and Security (DDTS) because I believe innovative technologies have the potential to drive meaningful change."
        },
        {
            "text": "Since taking on this role, my belief has been strengthened through the explorations I’ve led, which have demonstrated how technology can make business processes more productive, efficient, and cost-effective."
        },
        {
            "heading": 2,
            "text": "A mission that inspires and motivates"
        },
        {
            "text": "I’m driven by our team’s mission to ‘help Defra group proactively explore and make informed investments in new digital technologies’."
        },
        {
            "text": "Our team thrives in a culture of innovation, and we are supported by our executive leadership, who foster an environment where creativity is embraced, and bold ideas are encouraged. A recent testament to this is the launch of Defra’s AI Unit, a collaborative initiative between our DDTS function and the Defra Strategy Unit, designed to oversee and advance Defra’s AI efforts."
        },
        {
            "text": "What truly motivates me is knowing that the projects I contribute to have the potential for lasting, meaningful impact — particularly in areas I’m passionate about, such as protecting biodiversity and enhancing climate resilience."
        },
        {
            "heading": 2,
            "text": "Thinking differently, having flexibility"
        },
        {
            "text": "One defining characteristic that enhances my ability to think differently is my neurodiversity, which enables me to approach problems from a unique perspective. Supported by a Workplace Passport, I receive reasonable adjustments that have helped me thrive in this role."
        },
        {
            "text": "Additionally, my time as a self-employed professional before joining the Civil Service has equipped me with creative and strategic thinking skills that I can draw upon to find solutions to challenges and drive success."
        },
        {
            "text": "In my current role, I’ve worked on projects that address environmental challenges with innovative solutions. For instance, I worked with the Animal and Plant Health Agency on an AI-driven initiative to combat illegal ivory trading. By using AI and web scraping technologies, our solution successfully automated a manual process, resulting in significant improvements in productivity and efficiency. This solution is being investigated further by Defra’s AI Unit, with the potential to scale and deploy it for a range of monitoring functions Defra group performs."
        },
        {
            "text": "I also partnered with the Environment Agency on a pioneering Virtual Reality (VR) project for flood consultations. We employed Digital Twin technology to create a virtual model of a coastal town at risk of flooding, aiming to create greater public understanding and engagement. Working with a gaming studio, we developed an immersive VR experience that visualised sea level changes before, during, and after a potential flood event."
        },
        {
            "text": "This visualisation was presented at a public event in Eastbourne, and was attended by the House of Lords Committee for Climate Change. The positive feedback from the event highlighted the power of VR in conveying the urgency of flood defences to affected communities."
        },
        {
            "heading": 2,
            "text": "Being creative, learning along the way"
        },
        {
            "text": "My role at Defra aligns seamlessly with my personal and professional values of creativity, impact, and continuous learning. I’ve learned about a range of emerging technologies by horizon scanning for new developments, which has enabled me to contribute to the annual radar report our team publishes."
        },
        {
            "text": "As well as that, I’ve consulted with other Defra teams to understand their challenges, and I have overseen the delivery of solutions. This has given me the opportunity to build my experience in stakeholder and delivery management too."
        },
        {
            "text": "Professionally, I value collaboration and teamwork. My role requires me to work with business teams, ALBs, and external partners. This collaborative, multidisciplinary environment helps us tackle complex challenges effectively and achieve impactful results together."
        },
        {
            "text": "A key highlight of my Defra experience was participating as an exhibitor at Civil Service Live 2024 (CSL). There, our team showcased our work in AI and VR to other civil servants across government. Attending CSL was a valuable opportunity to exchange insights, collaborate on new solutions, and build relationships - both personal and across departments."
        },
        {
            "heading": 2,
            "text": "Why bold and innovative thinking is essential for departments like Defra"
        },
        {
            "text": "Thinking this way enables Defra to develop novel solutions to complex problems. Traditional approaches often fall short in the face of rapid changes and unprecedented issues such as climate change, biodiversity loss, and resource management."
        },
        {
            "text": "By embracing innovative technologies, we can develop more effective strategies and tools to mitigate these problems. This forward-thinking mindset allows us to stay ahead of emerging threats, drive meaningful change, and create sustainable solutions that have a lasting impact on both the environment and society."
        },
        {
            "text": "As I prepare to move on to my next placement as a Business Analyst at the Department for Work and Pensions, it’s given me cause to reflect that how, by working in a role that has encouraged creative problem-solving, I’ve been able to contribute to shaping solutions for the business problems that colleagues are facing. These solutions have the potential to drive long-term change, and this has made my work here in Defra engaging, challenging and rewarding."
        },
        {
            "text": "Amad Ahmed is on the Digital, Data, Technology (DDaT) and Cyber Fast Stream, and currently placed as a Technology Innovation Consultant within Digital, Data, Technology and Security at Defra."
        },
        {
            "text": "If you are interested in finding out more about the different talent programmes we offer, please do get in touch. All of our talent schemes support the new Civil Service People Plan, a key aim of which is to create and enable fairer opportunities for anyone to become qualified and experienced civil servants, from entry to senior leadership."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}