{
    "url": "https://vets.blog.gov.uk/2025/08/01/at-the-heart-of-global-decisions-my-woah-general-session-experience/",
    "title": "At the Heart of Global Decisions: My WOAH General Session Experience",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services",
        "International Work",
        "Jobs and Experiences",
        "Policy Work"
    ],
    "pub_date": "2025-08-01T14:05:00+01:00",
    "content": [
        {
            "text": "The end of May marked the 92nd WOAH General Session, and I had the pleasure of being invited as part of the UK delegation. It was my first time attending, and even for those who go every year, this one felt different- it was special."
        },
        {
            "text": "What is the WOAH General Session conference?"
        },
        {
            "text": "The World Organisation for Animal Health (WOAH) is the international authority on animal health, setting standards and coordinating global efforts to prevent and manage disease and improve animal welfare. Each year, representatives from across the globe gather for its General Session to shape the future of veterinary policy and public health."
        },
        {
            "text": "Figure 1: WOAH audience during one of the interventions."
        },
        {
            "text": "It wasn’t just another conference. This experience felt like stepping inside the engine room of global veterinary decision-making. For the first time, I saw how priorities are set, how technical debates become international standards, and how countries- each with different contexts and needs-navigate shared challenges."
        },
        {
            "text": "UK Achievements & Recognition (BSE status)"
        },
        {
            "text": "One of the most memorable moments during the General Session was witnessing the official recognition of the UK as having a negligible risk for Bovine Spongiform Encephalopathy (BSE). Seeing the magnitude of work behind it- years of effort, scientific precision, and policy commitment all converging into one historic announcement."
        },
        {
            "text": "Being present for that moment helped me grasp just how important these milestones are – not only for trade, but for reputation, resilience, and the people behind the scenes who make it all happen."
        },
        {
            "text": "Figure 2: Christine Middlemiss, UK Chief Veterinary Officer, receiving UK negligible risk status for BSE."
        },
        {
            "text": "UK-Led Events (AMR Forum & bTB Vaccination Session)"
        },
        {
            "text": "While the BSE recognition was a landmark moment, it certainly wasn’t the only highlight for the UK during the week. From expert roundtables to packed side events, our scientific and policy leadership was front and centre."
        },
        {
            "text": "It was brilliant to see UK scientists participating in technical discussions-including Dr Donald King, one of our leading disease consultants on FMD, who was invited to join a panel on vaccination strategies. Listening to him share insights with a global audience reminded me of the incredible depth of knowledge we have in the UK and how much others respect it."
        },
        {
            "text": "Figure 3: Donald King, second on the left participating in a vaccination strategy discussion."
        },
        {
            "text": "The AMR Chief Veterinary Officers Forum was another proud moment. Co-hosted by the UK and Sweden, the event brought together around 30 countries and international bodies such as WOAH, FAO, and leading NGOs. The discussion focused on antimicrobial resistance- how countries are tackling it, the role of vaccination in reducing antibiotic use, and why we need strong data and One Health approaches."
        },
        {
            "text": "Figure 4: Christine Middlemiss and the Swedish CVO Dr Lena Hellqvist Björnerot during the AMR event."
        },
        {
            "text": "And then there was the UK-led event on bovine tuberculosis (bTB) vaccination – one of the most well-attended side sessions at the General Session. Over 100 delegates filled the room, curious to hear how we have developed a deployable cattle vaccine and our innovation of the DIVA (Detecting Infected amongst Vaccinated Animals) skin test. This breakthrough allows countries to distinguish between vaccinated and infected animals."
        },
        {
            "text": "What struck me most was the engagement in the room: delegates from all corners of the world asked thoughtful questions and showed real interest in the practical and trade-related implications. It felt like we weren’t just sharing science- we were building trust and paving the way for future collaboration."
        },
        {
            "text": "These events helped me understand how technical expertise, diplomacy, and international partnerships come together in ways I hadn’t appreciated before. It made me proud to represent the UK and grateful to witness our work being acknowledged and amplified on a global stage."
        },
        {
            "text": "Figure 5:  AJ Coulter and Maria Dominguez during the bovine tuberculosis (bTB) vaccination event."
        },
        {
            "text": "Animal welfare was another key theme during the General Session, and the UK’s leadership truly stood out. Dr. Rebeca Garcia, our Animal Welfare Focal Point, played an inspiring role in representing the UK’s voice-bringing both depth and clarity to some of the week’s most complex conversations."
        },
        {
            "text": "I had the chance to attend the high-level panel on Animal Welfare, where Rebeca spoke alongside global leaders from FAO and the International Coalition for Animal Welfare (ICFAW). Hearing her share insights from the UK’s AMR Action Plan- with emphasis on prevention and the integration of welfare principles into national strategies-was a proud moment. "
        },
        {
            "text": "Figure 6: Dr. Rebeca Garcia during the antimicrobial resistance (AMR) and animal welfare event."
        },
        {
            "text": "What is a Bilateral Meeting and Why it Matters?"
        },
        {
            "text": "I was invited to participate in several bilateral meetings during the WOAH General Session- an experience that turned out to be both eye-opening and rewarding. These one-on-one discussions between countries offer a valuable opportunity to address trade, animal health, regulatory concerns, and wider cooperation. They’re practical, often fast-paced conversations where countries can clarify technical questions, iron out issues, and lay the groundwork for future agreements. In total, the UK delegation took part in 14 bilateral meetings with countries. This level of engagement speaks volumes about the UK’s active role on the international stage and its commitment to strengthening relationships that support our farming and food industries. For the UK, these dialogues are vital in opening new markets and enhancing trust in our veterinary and regulatory systems"
        },
        {
            "text": "Being in the room for some of these meetings gave me first hand experience in international diplomacy- a glimpse into how partnerships are built not just through policy, but through people."
        },
        {
            "text": "Figure 7: Alba Barrecheguren, Jorge Martin-Almagro and Balazs Toth in a bilateral meeting with Chile delegation."
        },
        {
            "text": "After the formal sessions and high-profile events, much of the real influence lies in the quiet precision of those driving the details. In the final two days of the WOAH General Session, delegates from nearly every country cast vote to update international standards-deciding on everything from disease case definitions to recommended diagnostic tests. These decisions shape how nations manage outbreaks, regulate trade, and protect animal welfare. It is a fast-moving but carefully orchestrated process, bult on months of preparation. This is where Raquel, the UK WOAH Focal Point Coordinator for Standards, made a remarkable impact."
        },
        {
            "text": "Her role didn’t just begin at the General Session; it culminated there. From crafting interventions with meticulous attention to scientific rigour, to coordinating across UK experts and departments, Raquel ensured our positions were not only heard but respected."
        },
        {
            "text": "Figure 8: Raquel Cobos with Yousif Ahmed Al Essa, CEO, Horse Welfare Authority of Bahrain."
        },
        {
            "text": "It was an intense but incredibly rewarding week- a true privilege to be part of such a significant event, leaving me with valuable insights and lessons for the future."
        },
        {
            "text": "Many thanks for this opportunity and it was a pleasure!!"
        },
        {
            "text": "Written by "
        },
        {
            "text": "Alba Barrecheguren DVM&S"
        },
        {
            "text": "Veterinary Advisor , Veterinary Exotic Notifiable Diseases Unit  (VENDU)"
        }
    ]
}