{
    "url": "https://vets.blog.gov.uk/2025/08/01/beyond-the-clinic-out-of-the-lab-a-vets-route-to-life-behind-the-scenes-at-the-vmd/",
    "title": "Beyond the clinic & out of the lab. A vet’s route to life ‘behind the scenes’ at the VMD",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Professional development"
    ],
    "pub_date": "2025-08-01T12:05:00+01:00",
    "content": [
        {
            "text": "Jon Haycock is a Senior Veterinary Assessor at the Veterinary Medicines Directorate (VMD) and shares his career path since graduation."
        },
        {
            "text": "Whilst writing this piece, I’ve come to realise that I clearly enjoy the immense variety that the veterinary profession has to offer.  Even before graduation, I knew I fancied doing something a little different and focussed my undergraduate research on EEHVs, an emerging viral threat to Asian elephants, at ZSL Whipsnade Zoo."
        },
        {
            "text": "I was then incredibly excited when my first job after leaving university in 2011 was at a practice with a heavy wildlife, zoological, and exotics caseload.  As well as learning the ropes of veterinary medicine across an array of species, the partner of that practice took their standing in society as a vet very much to heart and this exposed me to the huge diversity of roles and responsibilities that veterinary work can involve."
        },
        {
            "text": "Keen to explore the other possibilities, the following decade is probably best described as the pursuit of academic ventures with forays back into clinical practice, and an MSc in wild animal health further developed my passion for zoological research."
        },
        {
            "text": "With the threat of EEHVs looming ever-larger, I relished the opportunity to get involved in this small but crucial field of research and completed a PhD at the Animal and Plant Health Agency and University of Surrey, exploring the innate immune system of Asian elephants.  To this day, a career high is that very same research being put into practice to save one of the elephant calves at Chester Zoo."
        },
        {
            "text": "With the subsequent development of EEHV vaccination strategies, my time in pachyderm-based research sadly came to an end.  However, no sooner had I returned to the somewhat familiar territory of clinical practice than the pandemic hit, bringing all the challenges for veterinary colleagues that I need not elaborate on here."
        },
        {
            "text": "After a year or so, and starting to get disillusioned with first opinion work, I once again found myself searching for something a little different, and having signed up to civil service job alerts, I familiarised myself with the civil service recruitment process.  As highlighted by an excellent previous GVS blog post, it was all about identifying and acknowledging the vast array of transferrable skills we’re all told we have as vets, but probably never fully appreciate in practice."
        },
        {
            "text": "After an unsuccessful first attempt (which I’ve since reassured myself is not uncommon for new entrants to the civil service!), I ultimately joined the VMD as a veterinary assessor in August 2021.  While preparing for the interview, and then from the moment I joined, I was motivated by how much was accomplished by such a dedicated group of people, out of sight of the wider profession, of which I had no previous awareness."
        },
        {
            "text": "Right from my first day, the VMD has been an incredibly supportive environment to work.  There’s very much a sense of collaborative responsibility within the organisation, which really helps everybody to develop and thrive.  The chance to visit salmon farms in Scotland and shadow APHA bee inspectors in Sussex are two memorable examples of being proactively encouraged to further my understanding of lesser-known facets of the veterinary world."
        },
        {
            "text": "However, my core role as a veterinary assessor is to scrutinise the data that veterinary pharmaceutical companies submit to the VMD to support marketing authorisation applications.  Additionally, I’m one of the lead assessors at the VMD for veterinary clinical field trials in the UK.  These both allow me to draw from the skillsets derived from my previous positions, at a wonderfully rewarding interface of research, critical data analysis, and applying clinical knowledge."
        },
        {
            "text": "Otherwise, there’s a huge variety of areas that vets, including myself, are involved in at the VMD, whether it’s pharmacovigilance, residues surveillance, antimicrobial resistance, pharmaceuticals in the environment, or liaising with other veterinary and government organisations like the RCVS, the BVA, or the Home Office.  Although I never thought of myself as somebody who’d work in an office, being part of these discussions has been an incredibly rewarding opportunity to get stuck into and influence the decision-making processes that help inform the wider profession, often on contentious issues. "
        },
        {
            "text": "Separately, I also continue to undertake part-time weekend clinical work.  In doing so, I have a deeper understanding of the direct relevance of the VMD’s work to the everyday responsibilities of veterinary professionals, and I’ve certainly become far more confident in my clinical decision making because of my regulatory insight.  Through proactive external engagement with veterinary professionals, the VMD aims to empower others to feel the same.  By raising awareness of all the functions the VMD performs (so much more than a practice inspection every four years!) and providing reassurance that it actually supports, rather than obstructs, daily life at the veterinary coal face, those in practice may consider us more “behind the scenes but working for the front line”."
        },
        {
            "text": "Above all else, the biggest difference to previous positions has been the improved flexibility and work-life balance.  Additionally, the prospects for career progression and development within the VMD, let alone the wider civil service, has made this feel like the right move for me.  The work is challenging, highly fulfilling, and even though the animals might not be immediately in front of us, there’s no doubt that all VMD vets feel a keen duty to uphold our oath and ensure animal health and welfare, albeit on a broader scale."
        },
        {
            "text": "If there was any sort of conclusion to draw from my career so far, I’d say it’s to never be afraid to get involved in something out of the ordinary and take advantage of all that this incredible profession has to offer."
        },
        {
            "text": "Written by "
        },
        {
            "text": "Dr. Jon Haycock | Senior Veterinary Assessor"
        },
        {
            "text": "Veterinary Medicines Directorate"
        }
    ]
}