{
    "url": "https://defrafarming.blog.gov.uk/2025/08/01/capital-grants-offer-now-closed-for-new-applications/",
    "title": "Capital Grants offer now closed for new applications",
    "authors": [
        "Sarah Blatchford"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Grants"
    ],
    "pub_date": "2025-08-01T13:33:05+01:00",
    "content": [
        {
            "text": "This is a short post to let you know that we’ve now fully allocated all available funding for the 2025 round of Capital Grants.  "
        },
        {
            "text": "With over 8,000 applications submitted in under 5 weeks, this is the fastest uptake ever for the offer and shows a clear appetite from the sector to transition towards nature-friendly farming. "
        },
        {
            "text": "Having thresholds in place for this round means more farmers have been able to access funding to support their efforts to deliver for nature. "
        },
        {
            "text": "As part of our ongoing commitment towards improving transparency, we provided an update of uptake levels when 50% and 75% of funding was allocated. We did this to raise awareness of when application windows for funding opportunities were likely to close, and to support you with your business planning. "
        },
        {
            "text": "The high level of interest has been encouraging and shows how committed farmers are to improving their land, protecting the environment, and investing in a more sustainable future for farming. "
        },
        {
            "heading": 2,
            "text": "What this means for you "
        },
        {
            "text": "If you submitted your application and any supporting evidence before today 1 August at 1:30pm, you don’t need to do anything. The Rural Payments Agency (RPA) will contact you directly with the outcome once your application has been processed.  "
        },
        {
            "text": "While eligible applications are considered, funding cannot be guaranteed. "
        },
        {
            "text": "If you started your application but didn’t submit it, unfortunately you won’t be able to continue.  "
        },
        {
            "text": "There may be some exceptions to this where applicants were unable to submit their application and had sought assistance from the RPA to enable them to submit it. The RPA will assess these on a case-by-case basis and confirm to affected applicants shortly. "
        },
        {
            "text": "If your application is approved, you will get your money once the work has concluded and you submit your claim for payment, and any necessary evidence, within the given timeframe. The Capital Grant will reimburse you for the pre-agreed amount to complete the eligible works.   "
        },
        {
            "text": "We plan to make further improvements to the offer for future rounds. We expect to open a new round for farmers to access more funding during 2026. "
        },
        {
            "heading": 2,
            "text": "Benefiting farming and nature "
        },
        {
            "text": "We’re looking forward to seeing the outcomes of these grants over time and the lasting benefits they’ll bring to farms, nature, and the wider environment. "
        },
        {
            "text": "In this round, items that support improvements to water quality attracted the most interest. This funding will go towards farm upgrades such as yard roofing and fencing, helping reduce runoff and keeping livestock out of watercourses. "
        },
        {
            "text": "This round of funding will also support farmers’ efforts to: "
        },
        {
            "heading": 2,
            "text": "The wider offer "
        },
        {
            "text": "The government’s New Deal for Farmers is designed to support growth and return farm businesses to profitability.  "
        },
        {
            "text": "Over the next 4 years, funding for Environmental Land Management schemes, paid directly to farmers, will increase 150% from £800 million in 2023/24 to £2 billion by 2028/29.  A record £11.8 billion for sustainable farming and food production is being invested over this parliament.  "
        },
        {
            "text": "You can access the following funding now:  "
        },
        {
            "text": "Looking ahead, we will: "
        },
        {
            "text": "To receive the latest information from the Farming and Countryside Programme, subscribe to the Farming blog.     "
        }
    ]
}