{
    "url": "https://dwpdigital.blog.gov.uk/2025/08/01/celebrating-women-in-tech-a-powerful-collaboration-between-dwp-digital-and-aws/",
    "title": "Celebrating Women in Tech: A Powerful Collaboration Between DWP Digital and AWS",
    "authors": [
        "Hafizah Begum"
    ],
    "categories": [
        "Digital With Purpose",
        "Diversity",
        "DWP Digital",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2025-08-01T11:56:32+01:00",
    "content": [
        {
            "text": "DWP Digital and AWS came together to host an empowering Women in Tech event in Manchester. Held on Emmeline Pankhurst Day (14th July), a date that honours one of the UK’s most iconic champions of women’s rights. The event paid tribute to the transformative role women have played in shaping society, the ongoing impact in the tech industry today, and their vital role in driving future innovation and change. "
        },
        {
            "text": "The event was an opportunity for cross-government tech leaders to inspire, empower and share experiences, full of thought-provoking keynotes, interactive workshops, and expert panel discussions. "
        },
        {
            "heading": 2,
            "text": "Opening with Purpose: Tech She Can’s Mission to Inspire Change "
        },
        {
            "text": "Millie Stacey, Head of Fundraising at Tech She Can, opened the event with a moving reflection on the charity’s journey since 2018. She shared how the organisation has grown with a clear mission: to inspire and educate girls and women to pursue tech-related studies and professions to improve the pipeline. "
        },
        {
            "text": "Backed by compelling statistics and inspiring videos, Millie highlighted the persistent gender imbalance in the industry and the urgency for diversity and initiatives like Tech She Can. Her message was clear, when children see themselves represented, as girls, neurodiverse individuals, or those with disabilities, it’s not just aspirational, it’s essential for a more inclusive and innovative future. "
        },
        {
            "heading": 2,
            "text": "From Challenge to Triumph: Lessons from Helen Tither and the Corinthians "
        },
        {
            "text": "Helen Tither, founder of Films Not Words, shared her challenging journey from journalism to documentary filmmaking as a woman, driven by her passion for telling women’s untold stories. She discussed her highly praised documentary on Emmeline Pankhurst: The Making of a Militant and introduced her latest film on the Manchester Corinthians, a pioneering women’s football team formed in 1949 during the FA’s ban on women’s football. "
        },
        {
            "text": "Joined by Marlene Cook, one of the original players, who shared powerful memories of international tours, playing in front of tens of thousands, and the challenges they faced, from lack of funding and facilities to societal stigma. Despite their global success, the team was never officially recognised due to the FA ban.  "
        },
        {
            "text": "The keynote highlighted the importance of resilience, and preserving women’s stories, reminding the audience that pushing boundaries often means creating your own path when none exists. "
        },
        {
            "heading": 2,
            "text": "Empowering Yourself: The Power of Self-Promotion and Advocacy "
        },
        {
            "text": "A thought-provoking session led by Soraya Tavakol, Senior Partner Development Specialist at AWS explored the often-overlooked power of self-promotion and personal advocacy. These skills can feel uncomfortable, yet are essential for career progression in tech. Through sharing her personal journey and achievements, she inspired attendees to embrace their stories and build a personal brand. "
        },
        {
            "text": "Her interactive activity created a safe and supportive space for women to practice self-promotion, uplift one another and celebrate their unique journeys. It was a compelling reminder that when women champion themselves and each other, they pave the way for greater visibility, confidence, and success across the industry. "
        },
        {
            "heading": 2,
            "text": "Threat Modelling Unpacked: Tackling Cybersecurity in Real Time "
        },
        {
            "text": "Senior Security Specialist at AWS, Danny Cortegaca, led a hands-on technical session that gave participants a chance to explore the fundamentals of threat modelling, an essential skill in today’s cybersecurity landscape. "
        },
        {
            "text": "Attendees took a deep dive into cybersecurity frameworks such as STRIDE and MITRE ATT&CK, gaining practical insights into identifying threats and crafting effective threat statements. The session also introduced AWS’s Threat Technique Catalogue and the ATLAS Matrix, leaving attendees not only more informed but equipped with tools to better understand and address potential vulnerabilities. "
        },
        {
            "heading": 2,
            "text": "Panel Insights: Sisterhood, Allyship and Representation "
        },
        {
            "text": "A standout moment of the event was bringing together diverse voices that sparked honest conversations around career growth, representation, and resilience in the tech industry. Moderated by Charlene Manning, Business Development Manager at AWS and featuring DWP Digital changemakers Victoria Seller, Senior Solutions Architect, Annesa Mariyam, DevOps Engineer and Aleksandra Bobrowska, Analytics Lead. "
        },
        {
            "text": "The panel reflected on navigating tech careers as women and facing gender imbalance during motherhood with part-time hours affecting progression, gender bias in meetings and internalising self-doubt. They emphasized the importance of resilience, allyship, self-advocacy and having a supportive team culture. "
        },
        {
            "heading": 2,
            "text": "Closing Thoughts and Reflections "
        },
        {
            "text": "The Women in Tech event cultivated a truly collaborative and inspiring atmosphere, equipping attendees with technical insights and practical strategies with a revived sense of purpose. By spotlighting the importance of psychological safety, inclusive culture and celebrating smalls wins, the speakers encouraged open sharing and self-belief. Their diverse journeys into tech, each non-linear and uniquely shaped, delivered a striking message that there is no single path to success and every experience adds value. "
        },
        {
            "text": "More than just a tech event, the stories shared were a celebration of courage, resilience, connection and community. The event served as a powerful reminder that when women support and uplift each other, they not only navigate the industry but transform it. Together we must challenge biases, champion change and build a more inclusive future, one conversation at a time. "
        }
    ]
}