{
    "url": "https://ssac.blog.gov.uk/2025/08/01/how-does-the-benefits-system-influence-young-peoples-choices/",
    "title": "How does the benefits system influence young people’s choices?",
    "authors": [
        "Carl Emmerson"
    ],
    "categories": [
        "Child Benefit",
        "Children",
        "Claimants",
        "Consultation",
        "DWP",
        "Independent advice",
        "Universal Credit"
    ],
    "pub_date": "2025-08-01T12:54:46+01:00",
    "content": [
        {
            "text": "The Social Security Advisory Committee (SSAC) exists to provide impartial advice to the Secretary of State for Work and Pensions and the wider ministerial team on the social security system. As part of our independent work programme we have just begun a new detailed study into how the benefits system influences the decisions young adults aged 16- to 18-year-old – and their families – make around education, apprenticeship and work."
        },
        {
            "text": "The support provided by Child Benefit, Universal Credit, and other payments varies according to the decisions taken by young adults. For young people in low-income households the decision to move from full‑time education into an apprenticeship can – but not always – reduce their parent(s) entitlement to means-tested support. For young carers, care leavers, or those with disabilities, the implications can be particularly complex. And there is variation in the support available in different parts of the UK."
        },
        {
            "text": "The three key goals of our study are therefore to:"
        },
        {
            "text": "Our project will draw on existing research and engagement with policy officials at the Department for Work and Pensions and devolved administrations in order to map how support for different choices made by young adults varies across England, Scotland, Wales and Northern Ireland. We also want to understand the lived experience behind the formal rules of the system and the relevant statistics. To ensure this, we will bring in voices from those with experience of these issues including, most importantly, directly from parents and young people themselves. We will also host roundtables with charities, including organisations working with young carers, care leavers and disabled young people. And we will meet with think tanks and others who have done work in this important, though somewhat neglected, policy area – especially in the context of the raising of the education and training leaving age up to 18 in 2013."
        },
        {
            "text": "Our project is also timely. There is increasing concern about the rising number of young people in the UK who are Not in Education, Employment or Training (NEET). The DWP’s recent Green Paper includes a discussion of reforms specifically targeted at 16- to 24-year-olds, and the Government has a new Youth Guarantee for 18- to 21-year-olds in England. By way of a response to some of these issues, DWP has just appointed a Director for Youth and NEET, Alex Fitzpatrick. We look forward to working with Alex and her colleagues as our research proceeds through the summer and autumn, with a plan to send our findings – on what is working well and any weaknesses that we uncover – and recommendations for any reforms needed to the Secretary of State for Work and Pensions by the end of the year."
        },
        {
            "text": "If you have any evidence relevant to the three goals listed above that may inform our advice or help shape our recommendations to the Secretary of State, we would be delighted to hear from you. Please do get in touch with Lauren Shields, who we have recently been delighted to welcome to our secretariat under a PhD student policy internship scheme funded by UK Research and Innovation to support us on this project. Lauren can be contacted at ssac.consultation@ssac.gov.uk."
        }
    ]
}