{
    "url": "https://ruralpayments.blog.gov.uk/2025/08/01/sustainable-farming-incentive-expanded-offer-for-2024-sfi-2024-understanding-the-annual-declaration/",
    "title": "Sustainable Farming Incentive Expanded Offer for 2024 (SFI 2024): understanding the annual declaration",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2025-08-01T11:09:54+01:00",
    "content": [
        {
            "text": "This blog explains the annual declaration process for SFI 2024. For details of the annual declaration process for SFI 2023, please read the blog published on 13 August 2024."
        },
        {
            "text": "What is the annual declaration? "
        },
        {
            "text": "The annual declaration is how you, as an SFI agreement holder, can confirm that you have met or expect to meet the requirements of your agreement for that year. It’s an important part of receiving the final payment for the agreement year."
        },
        {
            "text": "You’ll make your annual declaration online using the Rural Payments service, making it accessible and straightforward."
        },
        {
            "text": "What you need to do"
        },
        {
            "text": "Each SFI agreement lasts for 3 to 5 years. As an agreement holder, you need to submit an annual declaration during the last 2 months of each relevant agreement year.  "
        },
        {
            "text": "The timing for the declaration depends on the start date of your SFI agreement, and the Rural Payments Agency (RPA) will let you know when the submission period opens. If we are unable to invite you to complete your declaration at the expected date, we will contact you by phone, email or letter."
        },
        {
            "text": "Before submitting an annual declaration, you should download a copy of the current year’s agreement."
        },
        {
            "text": "Below is a summary of what you need to do: "
        },
        {
            "text": "It’s important to submit your annual declaration within the timescale to receive the final quarterly instalment of your annual payment. Your final payment will usually be made 3 months after your third payment but will not be released until you have completed the 12th month of your agreement year."
        },
        {
            "text": "If you haven’t been able to meet your agreement requirements for this year, you should select ‘No’ and complete the free-text box to explain why. RPA will then review this information and contact you."
        },
        {
            "text": "Key dates for submitting your annual declaration"
        },
        {
            "text": "Below are the opening and closing dates for the annual declaration based on the start date of your agreement."
        },
        {
            "text": "You should mark the relevant dates in your calendar and complete your declaration promptly to avoid any delays to your payment. "
        },
        {
            "text": "More information"
        },
        {
            "text": "You can read more about the annual declaration requirements in section 12.1 of the SFI expanded offer for 2024: agreement holder’s information. There are different versions of this guidance you will need to use, depending on the start date of your agreement."
        },
        {
            "text": "If your agreement started:"
        },
        {
            "text": "If you need any assistance or have questions about the annual declaration process, please contact the Rural Payments Agency."
        }
    ]
}