{
    "url": "https://insidedio.blog.gov.uk/2022/09/06/no-mow-may-at-raf-st-mawgan-the-best-excuse-for-not-mowing-the-lawn/",
    "title": "No Mow May at RAF St Mawgan: the best excuse for not mowing the lawn!",
    "authors": [
        "Samuel Ibbotson"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Sustainability"
    ],
    "pub_date": "2022-09-06T15:58:42+00:00",
    "content": [
        {
            "text": "An area of tall grass providing a potential nesting site for skylarks and other birds [Crown Copyright / MOD 2022]I’m Samuel Ibbotson, an Estate Facility Manager for DIO. My role is an interesting and varied one, and this summer at RAF St Mawgan in Cornwall has been no exception, following a station-wide “No Mow May” initiative."
        },
        {
            "text": "First launched in 2019 by the botanical charity Plantlife, No Mow May is a campaign that encourages gardeners to not mow their lawn during the month of May, in order to let wild flowers bloom and provide a nectar feast for pollinators such as bees, butterflies and moths. This is normally carried out in small lawns, but at RAF St Mawgan the decision was made to undertake No Mow May on an industrial scale."
        },
        {
            "heading": 2,
            "text": "Implementing No Mow May"
        },
        {
            "text": "Some distinct challenges were identified as it became apparent that we could not completely retire the mowers during May. Although RAF St Mawgan does not have an active airfield, it’s still a fully operational station, so we had to make sure the scheme would not conflict with operational requirements. This meant carefully selecting the right areas in which to introduce our no-mow policy, as well as considering the possibility of allowing these areas to ‘rewild’ following May itself."
        },
        {
            "text": "As RAF St Mawgan was the first establishment to fully embrace this initiative within the South West region, there was a real sense of innovation in attempting to set an example which, if successful, other sites would be able to follow."
        },
        {
            "heading": 2,
            "text": "The importance of collaboration"
        },
        {
            "text": "The ethos of our work to manage facilities across the Defence estate is collaboration, and No Mow May at RAF St Mawgan reflected this at all levels."
        },
        {
            "text": "Led by the Station Commander, the scheme was proposed as part of our Defence-wide commitment to contribute to the UK government’s Net-zero 2050 target. With this important aim in mind, support was provided from our facilities management contractor, VIVO Defence Services, and their grounds maintenance industry service partner, Gavin Jones Ltd. A special thanks to Andrew Tregunna, our VIVO South West Grounds Manager, for putting in a great deal of effort to manage and support the scheme."
        },
        {
            "text": "Daisies and wildflowers have re-emerged at RAF St Mawgan as a result of No Mow May [Crown Copyright / MOD 2022]Station personnel were also kept informed and engaged over the course of No Mow May through the Environmental Action Group, a network of representatives from across the Station."
        },
        {
            "heading": 2,
            "text": "The results"
        },
        {
            "text": "In July, ecologists from the Eden Project were invited to RAF St Mawgan to assess the impact of No Mow May on the Station’s flora and fauna, with some exciting results."
        },
        {
            "text": "The Eden Project team highlighted an area of grass that, since being allowed to grow, has enabled the solitary skylark to nest – a real positive for the site’s ecology. This area will be left long but managed, to allow the birds to nest for the remainder of their nesting season."
        },
        {
            "text": "Another area of the site has been taken over by the chamomile plant. As this area is not impacting any operational requirements, we are leaving it to seed, spread, and hopefully flourish. The yarrow plant was also identified in a further area of unmown grass. The Eden project team reported that they’d never seen an area as abundant with this rare plant! The team returned to site and harvested the seed on the 1st September, to help bolster the Eden Project’s seed collection."
        },
        {
            "text": "Daisies, an important food source for early pollinators, growing at the station [Crown Copyright / MOD 2022]Another key benefit linked to the No Mow May initiative has been the re-development of grassland areas as a result of a reduction in herbicide use at the Station. This began in March, with vegetation allowed to recolonise areas that were previously kept bare. This has complemented a programme to release hedgehogs, for which grassland edges provide a vital habitat. In broad numbers, RAF St Mawgan has been spared approximately 25 litres of herbicide to date. Over the course of the year this will be closer to 100 litres."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "No Mow May has proved to be a tremendous success at RAF St Mawgan. Moving forward, our focus is on its long-term impact and how we can continue to apply the lessons learnt, not just at the station but also other military establishments."
        },
        {
            "text": "An educational approach, aimed at changing attitudes and behaviours, is a key part of this process. While a hedge full stinging nettles may not be very appealing to us, to a butterfly it’s the Ritz! Likewise, the success of the No Mow May scheme has highlighted the benefits of adapting grounds maintenance approaches where possible, to allow for the growth of wildflowers and grassy hedges which benefit a host of wildlife."
        },
        {
            "text": "Ultimately, the key to the sustainable management of the Defence estate lies in balancing the needs of its military users with environmental enhancements, to build resilience against the climate challenges of the future. I’m proud to have been part of the No Mow May initiative at RAF St Mawgan, which represents an excellent example of DIO working with our industry partners and military customers to achieve this aim."
        }
    ]
}