{
    "url": "https://space.blog.gov.uk/2022/09/06/the-night-sky-in-september-2/",
    "title": "The night sky in September",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-09-06T14:53:52+01:00",
    "content": [
        {
            "text": "Some of the most beautiful sights in our night skies are visible through September, and if you can get away from the bright lights of towns and cities there are some real treats in store."
        },
        {
            "text": "The summer constellations are still overhead as darkness falls.  Look high in the south to see Cygnus the Swan, whose tail (the bright star Deneb) forms the ‘summer triangle’ of stars with Altair and Vega."
        },
        {
            "text": "From darker skies Cygnus sit in amongst a brighter stretch of the glowing band of stars that make up our Milky Way galaxy, which arcs down through the southern sky."
        },
        {
            "text": "It sweeps through Aquila the eagle (home to bright star Altair), down to the southern horizon and the constellation of Sagittarius, which marks the direction of the very centre of our galaxy."
        },
        {
            "text": "See if you can spot the fainter constellation of Delphinius (the dolphin), a small group of stars just to the left of bright star Altair."
        },
        {
            "text": "While many of the constellations require a fairly vivid imagination to see the object, figure or animal they’re named after, Delphinius is a fun constellation to look out for, as it actually resembles a dolphin leaping out of water!"
        },
        {
            "text": "As Autumn approaches some familiar sights will return to the night sky.  Looking to the left of Cygnus and Delphinius and moving through the large constellation of Pegasus (which looks like a large upside-down winged horse!) you’ll reach Andromeda."
        },
        {
            "text": "Andromeda is another must-see from darker skies, hosting the most distant object visible to the naked eye – the Andromeda Galaxy."
        },
        {
            "text": "In last month’s blog we described how it would take four years travelling at the speed of light (approx. 300,000 kilometres or 186,000 miles per second) to reach our nearest star."
        },
        {
            "text": "Travelling at the same speed it would take two and a half million years to reach the trillion stars that make up the Andromeda Galaxy!"
        },
        {
            "heading": 3,
            "text": "Autumn equinox"
        },
        {
            "text": "Autumn begins on 23 September, with the equinox marking the point in our planet’s orbit where the north and south poles are equally distant from the Sun and where the days and nights are equal in length."
        },
        {
            "heading": 3,
            "text": "The moon and planets"
        },
        {
            "text": "September is Jupiter’s time to shine."
        },
        {
            "text": "Our solar system’s largest planet reaches opposition with Earth on 26 September, meaning the two planets are at their closest point to each other as they travel around the Sun."
        },
        {
            "text": "This sees Jupiter at its largest and brightest this month, so it’s the perfect time to try and spot it."
        },
        {
            "text": "On a cloudless night, it is unmistakably bright, and it is visible throughout the night. As darkness falls it sits just above the eastern horizon, rises higher through the night and is still visible in the south-west at dawn."
        },
        {
            "text": "Powerful binoculars might enable you to spot the Galilean moons of Jupiter as tiny points of light around the gas giant."
        },
        {
            "text": "These will be easier to spot through a small telescope, which may also show the bands in Jupiter’s atmosphere, and the Great Red Spot, a storm around twice the size of earth that appears to have been raging on Jupiter for hundreds of years."
        },
        {
            "text": " "
        },
        {
            "text": "Did you know? Jupiter has 79 official moons, but four are significantly larger than the others. Io, Europa, Ganymede and Callisto were first observed by Italian astronomer Galileo over 400 years ago, and are known as the Galilean moons."
        },
        {
            "text": " "
        },
        {
            "text": "Having reached opposition last month, Saturn is still shining brightly in the south-east as darkness falls, and is a wonderful target for those with a telescope."
        },
        {
            "text": "Mars is gradually getting brighter as it heads towards opposition with Earth in December, and it can be seen just beneath and to the left of the Pleiades star cluster."
        },
        {
            "text": "The full moon will appear in the constellation of Aquarius on 10 September, sitting midway between the planets Saturn and Jupiter."
        },
        {
            "text": "If you’re looking for those fainter objects like the Milky Way or the Andromeda Galaxy, head out on the darker nights of the new moon around 25 September."
        },
        {
            "heading": 3,
            "text": "Space Exploration"
        },
        {
            "heading": 3,
            "text": "Artemis-1"
        },
        {
            "text": "Unfortunately, some issues have arisen with the enormous rocket that was due to launch NASA’s Artemis-1 mission on the first journey around the moon for nearly 50 years. NASA are working to fix the problem and details around the next launch attempt will be announced soon."
        },
        {
            "heading": 3,
            "text": "Double Asteroid Redirection Test (DART)"
        },
        {
            "text": "Launched in November last year, NASA’s ‘Dart’ mission (Double Asteroid Redirection Test) is now safely in orbit around two asteroids - Didymos (around 780 metres across) and smaller Dimorphos (around 160m across) that orbits around the larger body."
        },
        {
            "text": "Later this month, ‘Dart’ will intentionally smash into Dimorphos at a speed of over 23,700kph (14,700mph), to test whether this ‘kinetic impactor’ (high speed collision!) approach could be a means of altering the path of asteroids that threaten our planet in the future."
        },
        {
            "text": "The impact will take place around 11 million kilometres (7 million miles) away from our planet and is scheduled for 26 September."
        }
    ]
}