{
    "url": "https://ofsi.blog.gov.uk/2022/03/10/chelsea-football-club-what-you-need-to-know/",
    "title": "Chelsea Football Club: What you need to know",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial sanctions regime",
        "Russia",
        "UK"
    ],
    "pub_date": "2022-03-10T08:20:11+00:00",
    "content": [
        {
            "text": "Owing to the sale of Chelsea football club by a designated person in May 2022, this blog is historic and is for archival reference only."
        },
        {
            "text": " "
        },
        {
            "text": "As announced by the Foreign, Commonwealth and Development Office Roman Abramovich is now a designated person and therefore subject to financial sanctions. This means all funds and economic resources belonging to, held or controlled directly or indirectly by this person are required to be frozen immediately."
        },
        {
            "text": "Asset freeze restrictions also apply to any entities that are owned or controlled by Roman Abramovich. This means that Chelsea Football Club is now also subject to an asset freeze under UK financial sanctions."
        },
        {
            "text": "In relation to this designation, HM Treasury, through the Office of Financial Sanctions Implementation (OFSI), has issued General Licence INT/2022/1327076. This allows Chelsea Football Club to undertake activities that would otherwise be prohibited by financial sanctions, meaning the club can fulfil its fixtures and carry out football business, without undermining the impact of sanctions."
        },
        {
            "text": "The full details of this General Licence can be found on GOV.UK, however the main permissions in the Licence include:"
        },
        {
            "heading": 3,
            "text": "Attending a match"
        },
        {
            "text": "As it is also prohibited to make funds or economic resources available to any individual or entity subject to an asset freeze, the General Licence also outlines permissions for those wishing to attend a match."
        },
        {
            "text": "Anyone who has already purchased a ticket for a fixture, or has a Club season ticket, can attend fixtures and purchase refreshments while attending these fixtures."
        },
        {
            "heading": 3,
            "text": "Televising matches"
        },
        {
            "text": "Broadcasters are permitted to broadcast any fixtures involving the Club under pre-existing arrangements. Relevant bodies may also pay revenue to the Club for broadcast licensing related to any fixtures."
        },
        {
            "heading": 3,
            "text": "Merchandise"
        },
        {
            "text": "While this is subject to certain conditions, the General Licence permits parties who purchased or produced Club Merchandise prior to 10 March 2022, to continue selling that merchandise on the condition that no funds or other financial benefits are made available to the Club or to the designated person."
        },
        {
            "text": "For further information on the impact of financial sanctions and General Licences, please visit the OFSI website and consult OFSI’s General Guidance for Financial Sanctions."
        }
    ]
}