{
    "url": "https://dragonsden.blog.gov.uk/2022/03/10/dragons-den-series-19-episode-10/",
    "title": "Dragons Den Series 19 Episode 10",
    "authors": [
        "Edward Rose"
    ],
    "categories": [
        "Designs",
        "Patents"
    ],
    "pub_date": "2022-03-10T21:25:55+00:00",
    "content": [
        {
            "text": "It’s episode 10 of series 19 of Dragons’ Den, which sees a new contributor to the blog – me! Before I give you my take on the episode, I’ll tell you a bit about myself. I work at the Intellectual Property Office, which is the UK government department responsible for all matters IP in the UK, including patents, copyright, trade marks, and designs."
        },
        {
            "text": "My role is a Patent Examiner, which involves working out if a patent can be granted for an invention. A patent is basically copyright for inventions and allows inventors to stop other people from copying their great ideas."
        },
        {
            "text": "Patents are a good way of rewarding innovation, and also allow inventors to recoup the costs involved in developing new technology by giving them the exclusive right to sell their invention. The main requirements for a patent are that the invention has to be new (so that people aren’t stopped from what they are already doing!) and ‘inventive’ (so that people aren’t stopped from making trivial changes to existing devices, e.g. using rivets instead of screws)."
        },
        {
            "text": "Inventions also have to be capable of being made using existing knowledge and technology, so unfortunately time machines and perpetual motion machines cannot be patented (at the moment…)"
        },
        {
            "heading": 3,
            "text": "A heated desk"
        },
        {
            "text": "Only one pitch in tonight’s episode touched on patents, so that seems like the best place to start. ‘Hot-desking’ is something that we’ve heard a lot about in plans for returning to offices from homeworking."
        },
        {
            "text": "Dorset’s Peter Waine has taken the meaning of this to a whole new level with his heatable desk, which aims to reduce office ‘thermostat wars’ and reliance on energy-intensive portable heaters. He asked the Dragons for £70k in return for 15% of his business ӧkoform."
        },
        {
            "text": "After investigation from Peter Jones, Touker Souleyman, and Steven Bartlett, Sara Davies brought up the topic of intellectual property. Peter confirmed that he’d been unable to get a patent for his heated desk, since devices already existed in Germany and the UK."
        },
        {
            "text": "A quick search in patent classification area A47B (which covers desks) confirmed that heated desks are known – GB2483664 A shows a desk with a heater in one of its legs, and DE202004019402U U1 shows a desk that can store heat when it’s warm and release this heat when it gets colder (disclaimer: this is not an endorsement of these devices by the IPO or BBC!)."
        },
        {
            "text": "Peter subsequently admitted that this would mean that people could copy his idea after it takes off. Sadly that took the heat out of the pitch, and Peter left the Den empty-handed."
        },
        {
            "text": "Patents can be a very valuable aspect of a business’s portfolio, but you should make sure that a patent is right for your business, since the process for obtaining a patent is lengthy and expensive. If in doubt we would recommend speaking to a patent attorney who can advise you. You can find out more here: https://www.cipa.org.uk/find-a-patent-attorney/"
        },
        {
            "heading": 3,
            "text": "Do, or doughnut: trying to get investment for a dog collar"
        },
        {
            "text": "Kevan Marshall brought along two adorable Chow Chows to help with his pitch for investment in his business selling inflatable dog collars. Social media mogul Steven Bartlett predicted that Kevan’s collars could go viral on social media, but unfortunately Kevan too failed to woo the Dragons."
        },
        {
            "text": "An interesting point from this pitch was Deborah Meaden ascertaining that there wasn’t anything in the doughnut design that made the collar technically better. You can’t patent inventions based on their design unless there is something in the design that makes the invention technically better – but you may be able to register the actual design itself with the IPO to make sure that other people can’t use your design. If you think it would be useful for your business to protect a design, have a look at:"
        },
        {
            "text": "Before I sign off, I’ll give a quick shout out to some of the other brave souls who dared to enter the Den: dynamic duo Dan Wiseman and Joe Mills, who successfully brought Sara and Deborah on board for a combined £75k in return for 25% of their board game business, ‘The Detective Society’."
        },
        {
            "text": "We also met Steve ‘Willy Wonka’ Russell and Giles ‘chocolate in the veins’ Atwell who, after almost snatching defeat from the jaws of victory, left the Den with their ‘golden ticket’ of £90k from Peter and Steven in return for 20% of their chocolate business Russell & Atwell."
        }
    ]
}