{
    "url": "https://cspl.blog.gov.uk/2022/03/10/leading-in-practice/",
    "title": "Leading in Practice",
    "authors": [
        "Ewen Fergusson"
    ],
    "categories": [
        "Leadership"
    ],
    "pub_date": "2022-03-10T10:00:03+00:00",
    "content": [
        {
            "text": "This week the Committee published the Terms of Reference for its next piece of work, examining the role of leadership in embedding the Principles of Public Life in public sector organisations."
        },
        {
            "text": "‘Leading in Practice’ is the second part of the landscape review that led to our major report ‘Upholding Standards in Public Life’ published last November."
        },
        {
            "text": "While we wait for the government to respond to our recommendations, the Committee intends to take a deeper look at the role of leadership at all levels of an organisation in understanding, developing and sustaining a commitment to the Principles of Public Life."
        },
        {
            "text": "Leadership is arguably the most important of the 7 principles and is described as:"
        },
        {
            "text": "‘Holders of public office should exhibit these principles in their own behaviour and treat others with respect. They should actively promote and robustly support the principles and challenge poor behaviour wherever it occurs.’"
        },
        {
            "text": "We want to look at how the Seven Principles of Public Life are upheld in public sector organisations - including how challenges and obstacles have been overcome - and identify the characteristics of organisations that facilitate public office holders acting in line with the Principles of Public Life. When things have gone wrong or unforeseen issues arose, how did you deal with those problems? Did you or your organisation learn something worth sharing about leadership and ethics from failure?"
        },
        {
            "text": "Are there mechanisms and practices used for embedding principles in the private and third sectors that can usefully be applied in the public sector, or by companies and charities providing services paid for by the taxpayer?"
        },
        {
            "text": "We really want to hear from you if your organisation has a good example to share."
        },
        {
            "text": "The Committee has always been clear that leadership is about personal conduct; it can be demonstrated at all levels of an organisation, not just something for Chief Executives or board members."
        },
        {
            "text": "We hope that when we publish this review, we can include real life case studies of leading in practice that will be useful and informative in promoting high standards across public life."
        },
        {
            "text": "Find out more about Leading in Practice"
        },
        {
            "text": "Follow CSPL on Twitter "
        },
        {
            "text": "Download previous CSPL reports"
        },
        {
            "text": "Watch a short film about Leadership"
        }
    ]
}