{
    "url": "https://ofsi.blog.gov.uk/2022/03/10/russia-what-has-changed-and-what-do-i-need-to-do/",
    "title": "Russia: What has changed and what do I need to do?",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial sanctions",
        "Financial sanctions regime",
        "Russia",
        "UK"
    ],
    "pub_date": "2022-03-10T08:56:17+00:00",
    "content": [
        {
            "text": "In response to the Russian invasion of Ukraine on 24 February 2022, the UK, alongside allies across the world, swiftly executed the biggest package of sanctions ever imposed against a G20 nation."
        },
        {
            "text": "In this blog, OFSI will set out some of the changes that have been put in place, and where stakeholders can find more information."
        },
        {
            "heading": 3,
            "text": "Asset freezes"
        },
        {
            "text": "The UK has imposed asset freezes on President Putin and Russia’s foreign minister Sergey Lavrov, amongst others. Details of all individuals and entities subject to an asset freeze (designated persons) can be found on OFSI’s consolidated list. OFSI has a separate list of Russian entities named in relation to financial and investment restrictions."
        },
        {
            "text": "You can also find a list of designated persons in Russia on OFSI’s Russia regime page."
        },
        {
            "text": "Whenever changes are made to the consolidated list, OFSI will update its subscribers through its e-mail alerts. The list can change quickly, so it is important to keep up to date with these changes."
        },
        {
            "heading": 3,
            "text": "Russia sanctions regulations  "
        },
        {
            "text": " The Russia (Sanctions) (EU Exit) Regulations 2019 came fully into force on 31 December 2020, replacing the Ukraine (European Union Financial Sanctions) Regulations 2014. This regime is aimed at encouraging Russia to cease actions destabilising Ukraine or undermining or threatening the territorial integrity, sovereignty or independence of Ukraine. The Sanctions (EU Exit) (Miscellaneous Amendments) (No. 2) Regulations 2020 and the Sanctions (EU Exit) (Miscellaneous Amendments) (No. 4) Regulations 2020 should be reviewed alongside the Russia regulations."
        },
        {
            "text": "Several amendment regulations to the regime were laid in February and March 2022."
        },
        {
            "text": "These are listed on OFSI’s Russia regime page and should be read alongside the above regulations."
        },
        {
            "text": "The above regulations are intended to be read alongside more detailed sanctions guidance published by several HMG departments including the Foreign, Commonwealth and Development Office (FCDO), the Department for International Trade (DIT), Department for Transport (DfT) and Home Office."
        },
        {
            "heading": 3,
            "text": "Russia sectoral measures "
        },
        {
            "text": " The recent amendment regulations have extended some of the investment and financial restrictions on Russian companies and introduced some new measures."
        },
        {
            "text": "These include:"
        },
        {
            "text": "OFSI has updated its Russia regime specific guidance to give more details about the financial measures listed above. Statutory guidance has also been published that covers wider trade and aviation measures as well as the financial measures."
        },
        {
            "heading": 3,
            "text": " Licensing"
        },
        {
            "text": "It is possible to apply for a licence to undertake certain activities that would otherwise be prohibited. OFSI’s Russia guidance and the schedule of the amendment regulations detail what grounds are available to apply for different licences. The available grounds vary depending on which activity you are undertaking."
        },
        {
            "text": "OFSI has also issued several general licences under the Russia sanctions regime. A general licence allows multiple parties to undertake specified activities which would otherwise be prohibited by sanctions legislation, without the need for a specific licence."
        },
        {
            "text": "The general licences issued under the Russia regime cover various activities such as allowing financial institutions to wind down their positions in Russian banks."
        },
        {
            "text": "OFSI does not accept applications for general licences from individuals or institutions – rather each licence has its own requirements for use. Details of general licences and the requirements for use can be found on OFSI’s general licence page."
        },
        {
            "heading": 3,
            "text": "Economic Crime Bill "
        },
        {
            "text": "As part of the Economic Crime Bill, the government is toughening OFSI’s ability to clamp down on financial sanctions breaches. The Bill will introduce a strict civil liability test for monetary penalties. This will be more wide-ranging than the current test, which requires firms to have knowledge or a “reasonable cause to suspect” that sanctions are being breached."
        },
        {
            "text": "It will also allow OFSI to publicly name firms that breach sanctions regardless of whether a penalty is imposed, and will expand OFSI’s information sharing powers."
        },
        {
            "heading": 3,
            "text": "Reporting to OFSI "
        },
        {
            "text": "You are legally obliged to report to OFSI if, as a relevant firm you know or suspect that a breach of financial sanctions has occurred, that a person is a designated person, or you hold frozen assets and that knowledge or suspicion came to you while conducting your business. You must contact OFSI at the earliest opportunity using the reporting form on gov.uk."
        },
        {
            "heading": 3,
            "text": "Crypto assets "
        },
        {
            "text": "OFSI’s general guidance is clear that crypto assets are an economic resource, and as such are caught by financial sanctions regulations. Attempting to circumvent sanctions using crypto assets is still prohibited in the same way that it would be for any traditional fiat currency. Any reports of suspected non-compliance should still be reported to OFSI in the same way."
        },
        {
            "heading": 3,
            "text": " Looking ahead "
        },
        {
            "text": "OFSI continues to engage with stakeholders during this period and is monitoring the situation closely. We have already published an initial update to our Russia guidance and will be updating the section shortly. OFSI will keep subscribers updated on any changes to guidance, licences and the consolidated list via its email alert service. You can subscribe to OFSI’s e-alerts here"
        },
        {
            "heading": 3,
            "text": "Useful information"
        },
        {
            "text": "There are other types of sanctions restrictions in place in respect of Russia which are implemented by Department of International Trade, Department for Transport, and the Home Office. For information covering all these restrictions please visit FCDO’s website."
        },
        {
            "text": "For any questions related the impact of relevant sanctions on UK businesses operating in any sector, or business operations in Ukraine or Russia, contact the Export Support Service who are providing a front-line Russia sanctions support service to all businesses."
        },
        {
            "heading": 3,
            "text": "Useful links"
        },
        {
            "text": "OFSI’s consolidated list of asset freeze targets"
        },
        {
            "text": "OFSI’s Russia regime page"
        },
        {
            "text": "Russia regime specific guidance"
        },
        {
            "text": "Russia statutory guidance"
        },
        {
            "text": "OFSI’s general guidance"
        },
        {
            "text": "OFSI’s general licences"
        },
        {
            "text": "Apply for a licence"
        },
        {
            "text": "Report to OFSI"
        },
        {
            "heading": 3,
            "text": "Contact details"
        },
        {
            "text": "Office of Financial Sanctions Implementation (OFSI)"
        },
        {
            "text": "Department for International Trade (DIT)"
        },
        {
            "text": "Export Control Joint Unit"
        },
        {
            "text": "Foreign, Commonwealth & Development Office (FCDO)"
        },
        {
            "text": "Home Office (HO)"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}