{
    "url": "https://civilservice.blog.gov.uk/2022/03/10/to-share-or-not-to-share-that-is-the-question/",
    "title": "To share or not to share, that is the question",
    "authors": [
        "Charlotte Middleton",
        "Ruth Harriford"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-03-10T09:20:48+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Finding the right person to share a job with can be difficult but is totally worthwhile once all goes to plan. "
        },
        {
            "text": "Most of us have seen the movie When Harry Met Sally; in this Civil Service remake, we talk about how Charlotte met Ruth and the benefits of job-sharing. "
        },
        {
            "text": "Charlotte Middleton, Deputy Director, Ministry of Justice, joined in 2020 "
        },
        {
            "text": "Ruth and I both had demanding SCS1 (Senior Civil Service) roles before having children. We wanted space and time to care for our children but didn’t want our careers to suffer because our families were expanding. "
        },
        {
            "text": "We were fortunate to have excellent job share role models in our departments and thought job sharing would create a perfect wellbeing and lifestyle balance. The only challenge was finding the right person."
        },
        {
            "text": "Tingly sensation"
        },
        {
            "text": "I signed up for the Civil Service Job Share Finder, and within days I got a notification that Ruth had posted her profile. I had reservations regarding timings as Ruth had yet to take maternity leave, however a friend advised how wonderful it would be to go off on maternity leave knowing my return was sorted. This encouraged me to immediately get in touch with Ruth."
        },
        {
            "text": "Our eyes met…"
        },
        {
            "text": "Nerves hit me as I walked to the café to meet Ruth. Would she like me? Would we have enough to talk about? But over coffee we found an instant connection. It felt like a first date, we talked for ages. Ruth had so much energy and was open and friendly. We shared values, leadership styles, career aspirations, and a similar outlook on life. The things I was worried about were things she was thinking about too."
        },
        {
            "text": "Am I good enough?"
        },
        {
            "text": "Our second meeting was held virtually due to coronavirus. We agreed to do a bit of due diligence on each other, sharing details of colleagues to find out what we were really like on both a working and personal level. All the feedback on Ruth was fantastic, so my thoughts then turned to: would I be good enough? Fortunately, my colleagues must have been kind too, and we agreed to join up. We stayed in touch over the following year and the birth of Ruth’s beautiful daughter."
        },
        {
            "text": "Journey into the unknown"
        },
        {
            "text": "In March 2021 we started a new job in the Ministry of Justice where we faced  the challenge of building up a new team, coupled with the challenge of our new job share. The last six months have been transformational – I love the resilience, skills blend, built-in support, and mentoring that a job share offers. It feels like a true partnership.   "
        },
        {
            "text": " It feels natural working together but, as with most new relationships, whether business or personal, you have to work on it. It's important to find time to talk about work, how our job share is going, and when we don’t agree, we need to come up with a compromise."
        },
        {
            "text": "Better together"
        },
        {
            "text": "It’s felt a lot more resilient to work in a job share: always having someone to talk things through with who wants the same outcome, especially when things are tough.  We always come up with better ideas together than separately. We both thought it would be more difficult sharing a leadership role than it is in reality."
        },
        {
            "text": "Ruth Harriford, Deputy Director, Ministry of Justice, joined in 2020"
        },
        {
            "text": "I met Charlotte when I was heavily pregnant with my first child. I was eager to find someone to pair up with for a job share before going on maternity leave, but thought it would be a much more difficult process and was unsure how things would progress. "
        },
        {
            "text": "First impression "
        },
        {
            "text": "I was quite nervous before our first meeting; I hoped Charlotte would like me. Charlotte and I not only had complementary backgrounds, but shared many core values and leadership styles. We both wanted to enjoy the short time in childhood when children are small, yet be able to pursue a challenging, interesting career."
        },
        {
            "text": "Sealing the deal"
        },
        {
            "text": "Since starting our role in March, we’ve grown into a true partnership. It’s always felt natural to work together and it’s very refreshing to work with someone whose objectives are wholly aligned to your own. Like all relationships, we’ve had moments of disagreements and had to compromise.  "
        },
        {
            "text": "I think the strength of a job share lies in this ability as it’s important to bring different skills and talents to the table. By working through issues together, our outcome is often better because two brains have been applied rather than one."
        },
        {
            "text": "It takes two…"
        },
        {
            "text": "Our crossover day is always manic with back-to-back meetings and time for a handover. I always feel better after speaking with Charlotte as a problem shared is a problem halved. There’s quite a lot of responsibility working so closely with another person. I always want to hand things over in a good state for Charlotte to pick them up. We are both careful not to fall into the part-time workers’ trap of never taking time for personal development, relationship building, or corporate activities. It’s powerful being in a partnership where you always want the best for each other.  "
        },
        {
            "text": "We’d never have found each other without the Civil Service Job Share Finder."
        },
        {
            "heading": 4,
            "text": "And finally… "
        },
        {
            "heading": 4,
            "text": "We’d recommend job sharing to anyone. You just need to find someone you trust and are happy to share your work life with – and be ready to learn from them."
        },
        {
            "text": "If after reading this, you decide to look for your ideal job share partner or simply want further information, sign up to Civil Service Job Share Finder and see where it takes you."
        }
    ]
}