{
    "url": "https://digitalpeople.blog.gov.uk/2022/03/10/why-i-chose-to-become-a-data-analyst-apprentice-in-the-civil-service/",
    "title": "Why I chose to become a data analyst apprentice in the Civil Service",
    "authors": [
        "Majhar Ahmed, Level 4 Data Analyst apprentice"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Digital & Technology Faststream",
        "Emerging talent"
    ],
    "pub_date": "2022-03-10T10:30:45+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why I chose an apprenticeship"
        },
        {
            "text": "I applied for this role with no previous experience, but instead with a passion and drive for learning. From my careers research over the years I saw the Civil Service as the place I wanted to be, and I can confidently say that choosing an apprenticeship as an entry route was the reason I’ve been able to realise this ambition."
        },
        {
            "text": "I didn’t finish my A Levels, and was faced with the enormous question: what do I do now? I knew university wasn’t for me, despite the potential outdated stigma and drawbacks surrounding people who haven’t gone to university. I had also always known that I had a dream of working for the Civil Service and an interest in working with data."
        },
        {
            "text": "A couple of years passed, and with fewer hairs on my head and several job rejections later, I was given an interview for a Level 4 Data Analyst apprentice position in the Cabinet office. It came as a shock, but has really turned out to be life changing. As I now know, my fellow apprentices come from all age groups, backgrounds and with different experiences, but with the common quality of wanting to learn and expand their skills and knowledge. The beauty of an apprenticeship is that there isn't a specific ‘type’ of person you must be, rather it is a route accessible to all, including people like me. It’s a way to gain experience and a qualification, all while earning a salary. It’s win win!"
        },
        {
            "heading": 2,
            "text": "What might an average day for an apprentice look like?"
        },
        {
            "text": "For me it usually starts with a quick catch up with my fellow apprentices as we are split up into different teams on different tasks. Ultimately we are all working towards a common goal: achieving the same qualification, but understanding how we apply our learning to our different roles can give insights on how to solve common problems that you might not have thought of. "
        },
        {
            "text": "I enjoy the flexibility to schedule my day to accommodate my needs which applies to everyone working in the civil service. Here in the Civil Service no day is ever the same, which adds great variety. Working as a data professional means I get to work on a range of projects that support the operating of the Civil Service, which in turn supports the general public to use vital online government services."
        },
        {
            "heading": 2,
            "text": "What have I learnt so far?"
        },
        {
            "text": "Not only do I believe that this apprenticeship has upskilled me, it has also helped me grow as a person and a professional. It has been a wonderful journey: starting out as a beginner and growing my knowledge, skills and behaviours, some might even say becoming somewhat of a master at it! It’s great to get acknowledgement from your colleagues. "
        },
        {
            "text": "However, crucially, I think the growth in confidence it has given me is second to none. When you know people rely on you it shows how integral you are to your team. Although you’re an apprentice, you’re also a fully integrated employee which comes with its own pressures and expectations. "
        },
        {
            "text": "Working on my apprenticeship coursework and projects simultaneously can be challenging, but has shown me how I can better manage my time, organisation and productivity. Managing my time is something I never really got to grips with (just ask my mother!) until I started this apprenticeship. Despite the worries I had about whether I could do this, I’ve learnt you are capable of doing extraordinary things when you put your mind to it. I’ve also been surrounded by incredibly supportive colleagues and peers which has been transformative."
        },
        {
            "heading": 2,
            "text": "Advice from an apprentice to a future apprentice"
        },
        {
            "text": "I wish I had known how straightforward it is to apply for an apprenticeship here at the Civil Service. I’m sure many of us think of the headaches and potential obstacles when applying for a role, however it is incredibly easy. Apply for a range of roles, not only those you think you are good at, but roles that you are keen to explore or have an interest in. Many skills are transferable, so you won’t ever feel stuck on doing one particular thing. The Civil Service is enormous and the demands of different departments and services are endless!"
        },
        {
            "heading": 2,
            "text": "Why should the Civil Service invest in apprenticeships?"
        },
        {
            "text": "In my opinion, the Civil Service should continue to modernise and adapt to changing labour markets and workforce needs by continuing to invest heavily in apprenticeships. Apprenticeships give thousands of people opportunities which they may never have had before, and are an effective mechanism for growing talent across all sectors to drive transformation. It’s also a proven way to increase diversity in the workforce and to develop future leaders across the spectrum. What’s not to like? "
        },
        {
            "text": "Browse and apply for apprenticeship opportunities in the Civil Service"
        },
        {
            "text": "Learn more about the apprenticeships on offer in the Civil Service"
        },
        {
            "text": "Learn more about becoming a digital, data and technology professional in government "
        }
    ]
}