{
    "url": "https://space.blog.gov.uk/2024/01/09/2024-highlights-and-winter-sights-the-night-sky-in-january/",
    "title": "2024 highlights and winter sights: the night sky in January",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-01-09T10:44:43+00:00",
    "content": [
        {
            "text": "Happy New Year! 2024 hosts several fascinating night sky sights so why not wrap up warm and head outside to see if you can spot them."
        },
        {
            "heading": 2,
            "text": "Highlights of 2024"
        },
        {
            "text": "2024 starts with an early morning line up of the rocky planets of our Solar System.  This month Mercury, Venus and Mars can all be spotted before the dawn light of the rising Sun outshines them."
        },
        {
            "text": "A fascinating comet makes a return to our skies in March.  Comet 12P/Pons-Brooks has an intriguing history of flaring suddenly in brightness as it approaches the inner Solar System on its 70-year orbit of the Sun."
        },
        {
            "text": "Currently only visible with the aid of a telescope, this comet already appears to be up to its old tricks, significantly flaring several times over the last few months, making astronomers hopeful it will become visible to the naked eye as it moves closer to the Sun in the coming weeks."
        },
        {
            "text": "As the Moon orbits our planet, it regularly appears to pass close to (and occasionally occults) bright stars and planets."
        },
        {
            "text": "In 2024, the Moon has several very close passes to the distinctive Pleiades star cluster, and this summer the Moon will completely occult the planet Saturn, where with a small telescope you’ll be able to see Titan, Saturn’s largest moon, disappear behind our own."
        },
        {
            "text": "The Moon itself will be partially eclipsed by our planet twice this year.  There’s a brief penumbral lunar eclipse visible in March and a more prominent partial lunar eclipse in September."
        },
        {
            "text": "Meanwhile meteor spotters will be glad to hear the peak of the summer’s prolific Perseid meteor shower this year falls on relatively moon-free nights, enabling stargazers to see many more meteors."
        },
        {
            "text": "The summer will also see Mars and Jupiter appear to almost touch in our skies as they pass through the constellation of Taurus."
        },
        {
            "text": "Venus is always spectacularly bright when it’s visible, but it’ll put on a great display in our evening skies towards the end of the year, and Jupiter will be higher in our skies than it has been for over a decade."
        },
        {
            "text": "Approximately every 11 years, the Sun’s output of radiation, solar flares, and ejection of material into space increases and decreases."
        },
        {
            "text": "This is known as the ‘solar cycle’ and it is believed to be approaching its maximum either this year or next, and the increased likelihood of charged particles from our Sun interacting with gases in our atmosphere means the chances of seeing Aurora Borealis (the ‘Northen Lights’) are significantly increased."
        },
        {
            "text": "Websites such as SpaceWeather, the Met Office and others provide aurora forecasts and it’s worth checking these regularly."
        },
        {
            "text": "It’s not uncommon to witness these beautiful events in Scotland and the North of England, and as the Sun’s activity grew through 2023, there were a few sightings down in the south of England."
        },
        {
            "heading": 2,
            "text": "Winter Stars (part two)"
        },
        {
            "text": "Last month we looked at some of the prominent stars in our winter night skies.  We continue that journey here looking at some of the stars from the constellations of Gemini (the Twins), Canis Major (the Great Dog) and Canis Minor (the Lesser Dog)."
        },
        {
            "text": "Sirius is the brightest star in our night sky, its name comes from the ancient Greek word for ‘glowing’ or ‘scorching’.  It’s actually a system of two stars.  Sirius A (known as the Dog star) is around twice the size of our Sun, while Sirius B (known as the Pup star) is smaller than planet Earth!"
        },
        {
            "text": "Sirius B is classified as a ‘white dwarf’, a cooling remnant of a once much-larger star.  While small, it is incredibly dense - the gravity around Sirius B is so great an average-sized human there would weigh over 20 million kilograms!"
        },
        {
            "text": "The brightness of the Sirius star system comes from its proximity to Earth.  At just eight light-years away, there are only a handful of stars that lie closer to us than Sirius."
        },
        {
            "text": "Procyon (above the left tree in the image above) lies just 11 light-years away from us in the constellation of Canis minor.  Like Sirius, it’s a system of two stars - one around twice the size of our Sun, the other smaller than Earth, but very dense and much less bright."
        },
        {
            "text": "The stars Castor and Pollux form the heads of the mythological Twins of the constellation of Gemini."
        },
        {
            "text": "Castor is a system of six stars that lies around 51 light-years away, where the largest star is around three times the size of our Sun."
        },
        {
            "text": "Pollux is an orange-hued giant star, around 10 times the size of our Sun and a little closer than Castor at 34 light-years away.  The star has a planet orbiting it that is around twice the size of Jupiter."
        },
        {
            "heading": 2,
            "text": "Space science and exploration missions to look forward to in 2024"
        },
        {
            "text": "NASA’s ‘Europa Clipper’ is scheduled to begin its journey to study Europa, a fascinating icy moon of Jupiter, in October."
        },
        {
            "text": "The largest spacecraft NASA have ever sent to another planet, the mission will begin its six-year journey to study the moon believed to hold nearly twice as much water as planet Earth, encased under Europa’s thick icy shell."
        },
        {
            "text": "Following the successful completion of Artemis I’s un-crewed orbit of the Moon at the end of 2022, Artemis II is scheduled to carry four astronauts around the Moon in November, paving the way for crewed landings in the coming years."
        },
        {
            "text": "China’s lunar exploration will also continue in 2024, with their Chang’e 6 mission to return rock and soil samples from the far side of the Moon scheduled for launch in May."
        }
    ]
}