{
    "url": "https://space.blog.gov.uk/2024/01/09/2024-the-year-of-the-space-entrepreneur/",
    "title": "2024: The Year of the Space Entrepreneur",
    "authors": [
        "Entrepreneurial Spark"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2024-01-09T15:01:55+00:00",
    "content": [
        {
            "text": "It is an exciting time within the space sector as it experiences explosive expansion and transformation. There has been a staggering annual growth rate of 21% in private investment."
        },
        {
            "text": "As a result, 2024 is looking to be the year of the space entrepreneur as the sector is in the perfect position to support a flourishing start-up ecosystem."
        },
        {
            "heading": 2,
            "text": "Making the most of the industry’s growth"
        },
        {
            "text": "Through the Fusion programme, the UK Space Agency, Entrepreneurial Spark and Exotopic will prime up to 20 of the UK’s most promising space entrepreneurs to make the most of this growth in the industry."
        },
        {
            "text": "This dynamic investment-completion programme will propel their ventures across the investment line. In just 6 months, space entrepreneurs will get the technical support they need to become investment ready before connecting them with early-stage investors looking to initiate deals."
        },
        {
            "text": "Entrepreneurs in the cohort will have access to weekly one-to-one sessions with the UK’s leading investment experts in the sector as well as an intensive, fully funded boot camp that will allow them to elevate their pitches."
        },
        {
            "text": "Finally, they will pitch to active investors at two prestigious demo days where they can raise transformational seed and pre-seed rounds of up to £2 million."
        },
        {
            "heading": 2,
            "text": "Funding challenges in the space sector"
        },
        {
            "text": "Despite its continual growth and promise, the space sector is not without its funding challenges. Compared to other commercial sectors, it is relatively new and therefore is smaller. As a result, there are fewer angel investors familiar with the industry."
        },
        {
            "text": "Furthermore, due to the space industry’s relative infancy, space companies face smaller market sizes and longer routes to market. These combined factors result in many space entrepreneurs experiencing heightened difficulty of securing seed investment."
        },
        {
            "text": "All this works to limit the potential of the space sector and those who are innovating within it, a challenge which Fusion is looking to solve."
        },
        {
            "heading": 2,
            "text": "Space, the commercial frontier"
        },
        {
            "text": "There is a common misconception that space is mostly about scientific exploration. However, commercial services and products represent 80% of the UK space market. These are represented by the technology that we rely on for everyday life from telecoms to agriculture."
        },
        {
            "text": "Furthermore, the space industry has produced some amazing initiatives over the past decade and there are many more to come. These include geomonitoring satellites that can help with the fight against climate change and pharmaceutical companies looking to make new life saving drugs on satellite labs."
        },
        {
            "text": "But those outside of the industry have little visibility into many of these ventures, our dependence on them, and how they improve life on Earth. Not only is the Fusion programme supporting entrepreneurs, but it is also supporting investors on their journey into the space sector."
        },
        {
            "text": "The Fusion programme is seeking out investors from other sectors and educating on the space industry and its unique opportunities. This initiative will help to increase the number of active fund managers, angel investors and syndicates connecting with the sector."
        },
        {
            "heading": 2,
            "text": "Applications for Fusion are closing soon!"
        },
        {
            "text": "Applications for the Fusion programme are closing very soon, on the 12 January 2024. Seize your opportunity to make 2024 the year you transform your Space venture and apply today."
        },
        {
            "heading": 2,
            "text": "For investors:"
        },
        {
            "text": "Fusion provides an exclusive chance for early-stage investors from outside of the Space sector to gain insights into the space market."
        },
        {
            "text": "Through a series of Investor Lounge seminars, investors will have the opportunity to learn about its evolution towards becoming a more innovative, commercially led sector. These investor lounges will clarify how space start-ups are not only purely “space” but can be considered through the lenses of other sectors such as bio sciences, telecoms, net zero and data analytics."
        },
        {
            "text": "With this support, investors will be more informed and best placed to unlock the potential of the next wave of Space entrepreneurs."
        },
        {
            "text": "The first Investor Lounge will be held on the 18 January 2024. Click here to discover more about how you can join the lounges, get involved with Fusion."
        }
    ]
}