{
    "url": "https://moderncivilservice.blog.gov.uk/2024/01/09/embedding-a-culture-of-innovation/",
    "title": "Embedding a culture of innovation",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Proud Civil Servant",
        "Skilled",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-01-09T08:06:46+00:00",
    "content": [
        {
            "text": "In our previous article Building an Innovative Civil Service we talked about how innovation is fundamental to continually deliver value to the public. Innovation can be abstract and we want to highlight how important culture is in fostering psychological safety and behaviours to innovate. In this article, we’ll demystify how you can put innovation into action."
        },
        {
            "heading": 2,
            "text": "How can the Civil Service be more innovative?"
        },
        {
            "heading": 3,
            "text": "Innovation is culture change"
        },
        {
            "text": "Embedding a culture of innovation is delivered through a combination of four building blocks of change:"
        },
        {
            "heading": 3,
            "text": "Communicate examples of innovation"
        },
        {
            "text": "Innovation needs to be communicated and successes should be shared widely. Innovation is transferred through inspiration and contrary to common beliefs, innovation isn’t always going to be a ‘big bang’ moment; it’s more likely to be observed as lots of cumulative steps to improvement. We’ll be showcasing examples across the Civil Service for you to learn from on our blog during January and February. "
        },
        {
            "heading": 3,
            "text": "Role model behaviours of innovation"
        },
        {
            "text": "Leaders need to support a culture that encourages curiosity, exploration, and experimentation. Line managers need to role model behaviours like suggesting new and creative ideas, to help empower their teams to feel they can do the same. Empowerment and cultures of psychological safety are key enablers here too! The Innovation Masterclass for current and future leaders has focused on upskilling senior leaders in how to foster an environment to support innovation in their teams."
        },
        {
            "text": "Anyone has the potential to innovate! To set yourself up for success, get familiar with the processes that support innovation. This involves defining a problem — evidencing with data where possible! — developing a set of potential solutions, testing and evaluating them before deciding whether to proceed with implementation. The Senior Cross-Government Innovation Working Group is looking at how we make existing innovation learning and development offers accessible to all civil servants. "
        },
        {
            "text": "If your department has an innovation team, you can reach out to them to get more information on what resources, playbooks and toolkits are available."
        },
        {
            "heading": 3,
            "text": "Embed innovation infrastructure"
        },
        {
            "text": "An innovative culture is not just creative thinking and experimentation. To truly embed innovation into the wiring of departments and teams, we need to ensure the right infrastructure, systems and processes are in place to incentivise and support innovation. This could mean streamlining cumbersome business case processes, promoting schemes to capture and evaluate staff ideas, formalising the use of pilots to test new ideas before you scale them, and recognising and rewarding innovative behaviour in our performance management."
        },
        {
            "text": "Innovation is no easy feat. It’s a complex endeavour requiring complementary initiatives and processes underpinned by people feeling empowered to raise new ideas and challenge the status quo. Building an innovative Civil Service is about both understanding the enabling conditions to foster creativity and collaboration, and having the infrastructure and processes to iterate, deliver and scale the best ideas."
        },
        {
            "heading": 4,
            "text": "What can you do?"
        }
    ]
}