{
    "url": "https://environmentagency.blog.gov.uk/2024/01/09/fisheries-enforcement-2023-a-year-of-action-and-collaboration/",
    "title": "Fisheries Enforcement 2023: A Year of Action and Collaboration ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2024-01-09T15:09:18+00:00",
    "content": [
        {
            "text": "As we usher in a new year, it's an opportunity to look back at the Environment Agency's fisheries enforcement work in 2023. This year has been marked by concerted efforts from EA staff, innovative campaigns, and significant collaborations to combat illegal fishing and protect our fisheries."
        },
        {
            "text": "Enforcement by the Numbers:"
        },
        {
            "text": "In 2023, our teams conducted a total of 33,684 valid licence checks. This substantial number reflects our commitment to ensuring anglers abide by regulations, contributing to the sustainable management of our fisheries."
        },
        {
            "text": "Offence Reports and Actions Taken: "
        },
        {
            "text": "Throughout the year, we produced a total of 1,638 Offence Reports (ORFs).  We successfully concluded 739 prosecutions, a testament to our rigorous and effective legal processes."
        },
        {
            "text": "Zero Tolerance and Compliance: "
        },
        {
            "text": "Our zero-tolerance policy towards illegal fishing activities is evident in our 100% success rate in prosecutions. This firm stance is crucial in deterring unlawful practices and preserving our fisheries for future generations."
        },
        {
            "text": "Financial Penalties and Deterrence: "
        },
        {
            "text": "The total penalties imposed throughout the year amounted to £67,157, with an average penalty of £346.07. These financial repercussions serve not only as a punishment but also as a deterrent, underlining the seriousness with which we treat fisheries offences."
        },
        {
            "text": "Advisory and Corrective Measures: "
        },
        {
            "text": "In addition to legal actions, we also provided advice and guidance on 67 occasions and issued 283 warning letters. These measures are part of our approach to educate and inform, helping to prevent future offences."
        },
        {
            "text": "Cautions and NFA: "
        },
        {
            "text": "Cautions were accepted on 283 occasions, providing offenders with an opportunity to rectify their mistakes without legal consequences. In some cases, we opted for No Further Action (NFA), where there was insufficient evidence or mitigating circumstances."
        },
        {
            "text": "Key Operations and Enforcement Achievements:"
        },
        {
            "text": "Yorkshire's Proactive Enforcement: In a noteworthy initiative, the Yorkshire Fisheries Enforcement Team, established in 2023, conducted an impressive 5,877 licence checks, leading to 342 offence reports (ORFs) and 50 successful prosecutions. This proactive approach was crucial in addressing a spectrum of fishing-related crimes."
        },
        {
            "text": "Cracking Down on Illegal Crayfish Trapping: A joint operation with local law enforcement in Yorkshire targeted a prolific illegal crayfish trapper on the River Rother near Killamarsh. This operation, conducted in July, was instrumental in safeguarding local biodiversity."
        },
        {
            "text": "Greater Manchester, Merseyside, and Cheshire's Collaborative Efforts: In August, these teams joined forces with the Cheshire Rural Crime Team, resulting in 6 individuals being reported for fishing without valid licences and the seizure of illegal fishing gear."
        },
        {
            "text": "Utilizing Drone Technology in Wessex: In September, our Wessex team, in collaboration with the Avon and Somerset Police’s drone unit, scanned extensive river areas. This innovative approach allowed for efficient monitoring and action against illegal activities, including out-of-season fishing."
        },
        {
            "text": "Legal Actions and Impactful Prosecutions:"
        },
        {
            "text": "Major Prosecution in South West: In a significant legal success, our team in Devon, Cornwall, and the Isles of Scilly, in partnership with Cornwall IFCA, closed down an illegal electro-fishing operation in Cornish inshore waters. This operation, culminating in nearly £30k of fines and costs in October, showcased our commitment to rigorous legal action against environmental offences."
        },
        {
            "text": "Addressing Fish Poaching and Theft: Our East Midlands and Lincolnshire teams, in a two-day operation in November, conducted 320 spot checks, leading to 30 offence reports in Nottinghamshire and Lincolnshire. One notable case involved the arrest of an individual under the Firearms Act 1968."
        },
        {
            "text": "Enhancing Partnerships and Community Engagement:"
        },
        {
            "text": "Strengthening Relationships with Angling Clubs: Throughout the year, our regional teams have been focused on building stronger partnerships with local angling clubs, crucial for fostering community support and awareness in conservation efforts."
        },
        {
            "text": "Educational Initiatives and Training: Our West Midlands team's involvement in training days with local police forces, like the one at Kingsbury Water Park, emphasized the importance of educating and training law enforcement on fisheries offences and enforcement techniques."
        },
        {
            "text": "Technology in Enforcement:"
        },
        {
            "text": "Embracing technological advancements, our teams have been utilizing tools like drones for surveillance and data collection, aiding in more effective monitoring and enforcement."
        },
        {
            "text": "As we move into 2024, our focus remains on enhancing our regulations and working collaboratively with various sectors to improve fisheries management. We are also dedicated to integrating technological advancements to further our enforcement capabilities."
        },
        {
            "text": "The past year has seen remarkable achievements in fisheries enforcement. As we step into 2024, we are equipped with the lessons learned, the successes achieved, and the partnerships forged. We remain committed to safeguarding our aquatic environments and look forward to continuing our work with vigilance and dedication."
        },
        {
            "text": "We encourage everyone to stay informed and engaged with our fisheries management efforts. Whether supporting sustainable practices or participating in educational campaigns, every action contributes to the health and vitality of our waterways."
        },
        {
            "text": "We owe a massive thanks to all members of the public for reporting illegal activity in 2023. If you see or suspect illegal fishing activity, you can report it to our 24-hour incident hotline on 0800 80 70 60."
        }
    ]
}