{
    "url": "https://opss.blog.gov.uk/2024/01/09/get-to-know-the-regulatory-design-and-governance-team/",
    "title": "Get to know the Regulatory Design and Governance Team",
    "authors": [
        "Jas Dhillon",
        "Alice Kelly"
    ],
    "categories": [
        "OPSS Impact",
        "Regulatory Design & Governance",
        "Teams at OPSS"
    ],
    "pub_date": "2024-01-09T14:56:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Who are we?"
        },
        {
            "text": "Our team is made up of wide range of skills and experience ranging from policy, regulation, legal, enforcement and the private sector."
        },
        {
            "heading": 3,
            "text": "What do we do?"
        },
        {
            "text": "The Regulatory Design & Governance team (RD&G) have played a unique and fundamental role of providing regulatory expertise to OPSS and to Other Government Departments (OGDs) and their policy teams to identify, analyse and tackle challenges that affect OPSS regulatory roles."
        },
        {
            "text": "We lead on the development, design and adoption of new enforcement roles; and supporting the ongoing development of OPSS’ impact as a regulator to protect people and places from product related harm. It also builds the governance to support regulatory effectiveness and work with a wide range of colleagues across OPSS and government that have a stake in OPSS' approach to regulation."
        },
        {
            "text": "Our expertise is even more important than ever today as we step outside of the EU and design regulation to the new environment we live in and also to support the economy.  This includes an increased focus on innovation and the use of digital technology in developing products."
        },
        {
            "heading": 3,
            "text": "RD&G in Action "
        },
        {
            "text": "Many products are considered ‘smart’ products, from smart watches and smart security cameras, right through to the more unusual – smart nappies!  But, with advancement in technology comes additional risk, that’s why the Government recently legislated to protect consumers, networks and infrastructure from the harms associated with vulnerable consumer connectable products."
        },
        {
            "text": "Our team were approached by the Department of Science, Innovation and Technology (DSIT), to consider adoption of the enforcement role for Part 1 of the Product Security & Telecommunications Infrastructure Act (PSTI) – which focusses on introducing three security measures for consumer connectable products to protect against potential vulnerabilities."
        },
        {
            "text": "We faced two key challenges when reviewing this role.  The first was that OPSS have historically focussed on physical product attributes, only recently moving into the world of ‘cybersecurity’, with the Electric Vehicle Smart Charge Point Regulations.  The second, was understanding how this product regime dovetailed with the Northern Ireland Protocol, the UK Internal Markets Act and the Windsor Framework – this is the first piece of UK wide product legislation since Brexit."
        },
        {
            "text": "For both challenges, RD&G engaged with and brought together key stakeholders around OPSS, DBT and DSIT.   This activity was key to ensuring that we will have the right resource, expertise, and capabilities to adopt and effectively regulate the proposed role."
        },
        {
            "text": "The Regulatory Design & Governance team is at the forefront of OPSS’ new roles, shaping our future as a mature regulator.  If you would like to find out more about the team and the work that we do, please contact john.holmes2@businessandtrade.gov.uk."
        }
    ]
}