{
    "url": "https://minimumwage.blog.gov.uk/2024/01/09/low-pay-commission-regional-visits-2024-your-chance-to-be-heard/",
    "title": "Low Pay Commission regional visits 2024 – Your chance to be heard",
    "authors": [
        "laituanloh"
    ],
    "categories": [
        "Evidence and Consultation"
    ],
    "pub_date": "2024-01-09T13:08:27+00:00",
    "content": [
        {
            "text": "Low Pay Commissioners will be meeting workers and businesses across the UK, on six regional visits. This is your chance to let us know how you are affected by the minimum wage."
        },
        {
            "text": "If you want to participate, get in touch with us if you would like to meet our Commissioners. You can email at lpc@lowpay.gov.uk or call us on 07511 162 380."
        },
        {
            "text": "Where we will be this year:"
        },
        {
            "text": "We select our locations based on their minimum wage coverage and unemployment levels. Our guiding aim is to listen to a diverse range of people from across the UK and visit locations we have not been to before or recently. "
        },
        {
            "text": "The LPC takes very seriously what we hear on all our visits, so it is a chance for anyone with an interest to have their voice heard. "
        },
        {
            "text": "Who do we want to hear from: "
        },
        {
            "text": "We are looking to meet with people affected by the minimum wage in all of these locations: workers, employers, local authorities, charities and anyone else with an interest. We are happy to come to you directly or equally to host a meeting ourselves in your area. "
        },
        {
            "text": "What do we want to hear about: "
        },
        {
            "text": "From workers - "
        },
        {
            "text": "From businesses -  "
        },
        {
            "text": "Our annual written consultation will be launched shortly, detailing all the areas we want to gather evidence on. "
        },
        {
            "text": "Why we go on regional visits: "
        },
        {
            "text": "Since 1998 the Low Pay Commission (LPC) has made recommendations to the Government on the levels of the National Minimum Wage (NMW).  It has also reported and produced recommendations on related policy matters including enforcement and compliance. "
        },
        {
            "text": "To inform these recommendations, we consult widely across the economy with businesses, workers, local authorities, charities, and other interested parties. "
        },
        {
            "text": "We produce evidence-based advice, and our regional visits are an essential part of our evidence gathering cycle. Through visiting different areas of the UK, we speak with workers on or close to the minimum and living wage as well as the employers who are directly affected by the change in rates. "
        },
        {
            "text": "The real-life experiences of those in low-paid work and of those employers in low-paying sectors are hard to understand from the statistics alone. By talking face to face with the people most affected by our recommendations, Commissioners can understand what is happening on the ground and the themes and issues which are emerging. "
        },
        {
            "text": "On our visits in 2023, we heard valuable evidence from workers on the cost of living, insecure employment and work intensification. Employers told us they had responded to the NLW increases by increasing prices, reducing profits and pay differentials and smaller firms reduced investment. These insights enable the LPC to better understand the impact of our work on both workers and employers.  "
        },
        {
            "text": "Last year, we focused on compliance and enforcement and presented data on underpayment and explored the persistence of underpayment for individual workers.  The evidence we heard formed our report on Compliance and enforcement of the National Minimum Wage. "
        },
        {
            "text": "If you want to participate, get in touch with us if you would like to meet our Commissioners. You can email at lpc@lowpay.gov.uk or call us on 07511 162 380. "
        }
    ]
}