{
    "url": "https://mhclgmedia.blog.gov.uk/2024/01/09/michael-gove-launches-new-consultation-to-deliver-awaabs-law/",
    "title": "Michael Gove launches new consultation to deliver Awaab’s Law",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-01-09T13:14:54+00:00",
    "content": [
        {
            "text": "There has been widespread coverage in the media about the consultation published by the Department for Levelling Up, Housing & Communities, which sets out new plans to improve social housing standards and clamp down on rogue social landlords who fail to provide safe homes – supporting the Government’s pledge to deliver Awaab’s Law."
        },
        {
            "text": "This includes new legal requirements for social landlords to investigate hazards within 14 days, start fixing within a further 7 days, and make emergency repairs within 24 hours. Those landlords who fail to comply can be taken to court where they may be ordered to pay compensation for tenants."
        },
        {
            "text": "Several national outlets including BBC News, The Sun, The Independent, Daily Mirror, Sky News, and The Daily Telegraph all report that social landlords will be legally required to repair emergency hazards within 24 hours and must keep clear records of issues and their attempts to resolve these – with tenants also given increased legislative power to challenge housing conditions through the courts. Coverage also notes Awaab’s father, Faisal Abdullah, expressing support for the new proposals."
        },
        {
            "text": "Broadcast coverage included social housing campaigner, Kwajo Tweneboa, appearing on Sky News to discuss the new requirements and how to hold social housing providers to account. BBC News also ran a package about the proposals."
        },
        {
            "text": "Elsewhere, there has been regional coverage which includes an impassioned op-ed by the Housing Secretary, Michael Gove, in the Manchester Evening News about making Awaab’s Law a reality."
        },
        {
            "text": "The consultation is open for eight weeks and the Government will introduce secondary legislation to bring Awaab’s Law info force as soon as practically possible."
        },
        {
            "text": "Housing Secretary, Michael Gove said:\n"
        }
    ]
}