{
    "url": "https://buyingforschools.blog.gov.uk/2024/01/09/transforming-public-procurement-tpp-how-procurement-will-change-for-some-schools-and-trusts/",
    "title": "Transforming Public Procurement (TPP) - how procurement will change for some schools and trusts",
    "authors": [
        "Kevin Draisey, Head of Procurement Operations"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-01-09T12:14:47+00:00",
    "content": [
        {
            "text": "Over the last few years, a huge amount of work has been undertaken by the Cabinet Office and stakeholders across the country on Transforming Public Procurement, also known as TPP. The outcome of this work is the new Procurement Act 2023 which is set to take effect in October 2024. This means changes in procurement regulation and practices, aimed at bringing about a more flexible, strategic approach to public procurement."
        },
        {
            "text": "Kevin Draisey is Head of Procurement Operations for Get help buying for schools, the DfE’s free supported buying service for schools and trusts. In this blog post, Kevin explains what TPP means for people who buy for schools and trusts and how they can get ready for the changes ahead."
        },
        {
            "text": "What will the Transforming Public Procurement Act change?"
        },
        {
            "text": "The reforms proposed within the new Procurement Act 2023 are important because they will improve our procurement regulations, so that every pound goes further for our communities and public services. They place value for money, public benefit, transparency and integrity at the heart of our procurement system and will modernise and unify our systems and processes. The reforms will get tough on underperforming suppliers, and exclude those who pose an unacceptable risk."
        },
        {
            "text": "The Act will reform the UK’s public procurement regime, making it quicker, simpler, more transparent and better able to meet the UK’s needs while remaining compliant with our international obligations. It will introduce a new regime that is based on value for money, competition and objective criteria in decision-making. It will create a simpler and more flexible commercial system that better meets the country’s needs, and it will more effectively open public procurement to new entrants such as small businesses and social enterprises, so that they can compete for - and win - more public contracts."
        },
        {
            "text": "The Procurement Bill, which will reform the existing Procurement Rules, received Royal Assent in October 2023. In early 2024 secondary legislation (regulations) will be laid to bring some elements of the Bill and the wider regime into effect."
        },
        {
            "text": "We will then be given a minimum of 6 months’ notice before ‘go-live’, which we anticipate will be October 2024. The existing legislation will apply until the new regime goes live and will also continue to apply to procurements started under the old rules."
        },
        {
            "text": "Implications for school and trust buyers"
        },
        {
            "text": "Transforming Public Procurement will have implications for school buyers. Here are some key areas to consider before the new regulations come into force:"
        },
        {
            "text": "Guidance and support available"
        },
        {
            "text": "For procurement nerds like me, this is all very exciting! But, if it all sounds daunting don’t worry, help is at hand before the new regulations come into effect. Comprehensive guidance and support will be provided as we approach October 2024. Get help buying for schools will be available to provide any advice and guidance schools need free of charge. In addition, there will be a Cabinet Office led learning and development programme to support those operating within the new regime, available free at the point of delivery."
        },
        {
            "text": "Launch of TPP training resources"
        },
        {
            "text": "Cabinet Office has now launched the first official training resources to support the introduction of the new Procurement Act. These are known as Knowledge Drops."
        },
        {
            "text": "The Knowledge Drops are designed to provide a high-level overview of the changes to the procurement regulations due to go live October 2024. In total they should take no longer than 1 hour to go through."
        },
        {
            "text": "Supporting factsheets are also available to accompany the Knowledge Drops. They are designed to build awareness and understanding regarding exemptions and the general regime."
        },
        {
            "text": "Schools and trusts undertaking procurements are contracting authorities and are advised to review the training materials. Part 1 is useful for everyone involved in buying as it highlights the changes to, and the benefits of, the new procurement rules."
        },
        {
            "text": "Knowledge Drops for contracting authorities"
        },
        {
            "text": " Supporting Factsheets"
        },
        {
            "text": "We will continue to update schools and trusts as more information and training becomes available. In the meantime, if you are a school or trust and need any free help and support with your procurement, contact the team at Get help buying for schools."
        },
        {
            "text": " "
        }
    ]
}