{
    "url": "https://insidehmcts.blog.gov.uk/2026/02/26/designing-justice-for-the-future/",
    "title": "Designing justice for the future ",
    "authors": [
        "Mark Evans, Deputy Director Capital Planning, Investment and Sustainability"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "User experience and research"
    ],
    "pub_date": "2026-02-26T10:52:13+00:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "In 2022, we bought 7 Newgate Street, a building that had become available next door to the Old Bailey. We decided to invest in Newgate Street to create a world leading tribunal centre, designed specifically to meet our current requirements with the flexibility to meet future needs.  "
        },
        {
            "text": "Tribunal buildings such as Victory House and Fox Court, had served us for many years, but we knew they were tired, no longer fit for purpose and would have required an enormous level of investment just to remain operational. "
        },
        {
            "heading": 2,
            "text": "A Modern, Flexible Centre Built for the Future"
        },
        {
            "text": "Once complete, the London Tribunals Centre will house 30 hearing rooms, 19 formal and 11 informal, as well as 40 judicial chambers supporting up to 60 judges. It will be one of the largest tribunal centres in Europe and, in my view, a real landmark for the HMCTS estate. Importantly, it has been designed with future needs in mind, meaning it can evolve as tribunals change over time. This includes the ability to incorporate new technologies and accommodate changes in jurisdictions or caseloads without requiring major redesign or disruption."
        },
        {
            "text": "The flexible layout, a mix of hearing room types, and modern infrastructure will allow the centre to respond to changes in caseloads, ways of working, and jurisdictional requirements for many years to come. "
        },
        {
            "text": "By consolidating services from Victory House and Fox Court into Newgate Street, we’ll be able to deliver hearings more efficiently, more consistently and to a much higher standard.  "
        },
        {
            "text": "Bringing teams, jurisdictions and expertise under one roof will improve the experience of tribunal users, strengthen our resilience and make it easier to share best practice across tribunals. Users will benefit from a more joined up service, improved infrastructure will support hybrid hearings and make it easier for people to engage with the tribunal in the way that works best for them. This will benefit tribunal users, the judiciary and staff alike creating a modern, accessible environment."
        },
        {
            "text": "Because this is a major refurbishment, we’ve been able to take full advantage of the opportunity to ensure the centre is fully compliant with modern building requirements. This reflects our wider commitment to making the justice system accessible, inclusive and respectful of individual needs. "
        },
        {
            "heading": 2,
            "text": "Designing Spaces That Make a Difference"
        },
        {
            "text": "For those who will visit the London Tribunals Centre once it opens, the experience will feel very different from some of the buildings they may be used to. The foyer and reception area are deliberately designed to be open and light. It’s a large, impressive space and I genuinely hope the first reaction for people walking through the doors is a sense of “wow, this is what can be achieved.”  "
        },
        {
            "text": "While Newgate Street is a flagship project, it’s one part of a much bigger picture. Alongside new developments, we’re also making significant investments to improve our existing court and tribunal buildings across the country. This year we will spend £148 million on repairs and maintenance, a substantial increase on previous years. Some projects may sound modest on paper such as roof replacements or heating upgrades, but these improvements can have a big impact on court users and our ability to deliver our day-to-day operations."
        },
        {
            "heading": 2,
            "text": "Collaboration at the Heart of Delivery"
        },
        {
            "text": "Delivering on this investment is a true team effort. Teams within HMCTS Property have worked closely with operational colleagues and the judiciary to create a space that genuinely meets the needs of its users. This ensures that every design choice is grounded in real‑life court experience, from how people move through the building to how each room supports the delivery of justice. "
        },
        {
            "text": "By working directly with those who use the space every day, we gain insights that can’t be captured through designs alone, helping us deliver environments that are safe, efficient and supportive for all who work in or attend the court. Operational and judicial feedback directly shapes the final outcome, ensuring the space is not just functional on paper but practical, accessible and fit for purpose in the long term. Through this partnership, we create buildings that enable better services, smoother operations and an improved experience for court users. Collaboration has never been stronger, and it’s making a real difference to how services are delivered. "
        },
        {
            "text": "Working on the London Tribunals Centre has been a genuine privilege. I believe this building will stand as a symbol of what we can achieve when we invest thoughtfully, plan for the future and keep users at the centre of our decisions."
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Dylunio cyfiawnder ar gyfer y dyfodol"
        },
        {
            "text": "Yn 2022, prynwyd 7 Newgate Street, adeilad a ddaeth ar gael drws nesaf i'r Old Bailey. Fe wnaethom benderfynu buddsoddi yn Newgate Street i greu canolfan dribiwnlys sy'n arwain y byd, wedi'i chynllunio'n benodol i fodloni ein gofynion presennol gyda'r hyblygrwydd i ddiwallu anghenion y dyfodol. "
        },
        {
            "text": "Roedd adeiladau tribiwnlys fel Victory House a Fox Court wedi ein gwasanaethu ers blynyddoedd lawer, ond roeddem yn gwybod eu bod yn hen, ddim yn addas i'r diben mwyach a byddai angen lefel enfawr o fuddsoddiad iddynt barhau i weithredu."
        },
        {
            "heading": 2,
            "text": "Canolfan Fodern, Hyblyg wedi'i Hadeiladu ar gyfer y Dyfodol"
        },
        {
            "text": "Ar ôl ei chwblhau, bydd Canolfan Tribiwnlysoedd Llundain yn gartref i 30 o ystafelloedd gwrandawiadau, 19 ffurfiol ac 11 anffurfiol, yn ogystal â 40 o siambrau barnwrol sy'n cefnogi hyd at 60 o farnwyr. Bydd yn un o'r canolfannau tribiwnlys mwyaf yn Ewrop ac, yn fy marn i, yn garreg filltir go iawn i ystad GLlTEF. Yn bwysig, mae wedi'i chynllunio gydag anghenion y dyfodol mewn golwg, sy'n golygu y gall esblygu wrth i dribiwnlysoedd newid dros amser. Mae hyn yn cynnwys y gallu i ymgorffori technolegau newydd a darparu ar gyfer newidiadau mewn awdurdodaethau neu lwythi achosion heb fod angen ailgynllunio neu aflonyddu mawr. "
        },
        {
            "text": "Bydd y cynllun hyblyg, cymysgedd o fathau o ystafelloedd gwrandawiadau, a seilwaith modern yn caniatáu i'r ganolfan ymateb i newidiadau mewn llwythi achosion, ffyrdd o weithio, a gofynion awdurdodaeth am flynyddoedd lawer i ddod. "
        },
        {
            "text": "Trwy gydgrynhoi gwasanaethau o Victory House a Fox Court i Newgate Street, byddwn yn gallu cyflwyno gwrandawiadau yn fwy effeithlon, yn fwy cyson ac i safon llawer uwch. "
        },
        {
            "text": "Bydd dod â thimau, awdurdodaethau ac arbenigedd o dan yr un to yn gwella profiad defnyddwyr tribiwnlys, yn cryfhau ein gwytnwch ac yn ei gwneud hi'n haws rhannu arferiongorau ar draws tribiwnlysoedd. Bydd defnyddwyr yn elwa o wasanaeth mwy cydgysylltiedig, bydd seilwaith gwell yn cefnogi gwrandawiadau hybrid ac yn ei gwneud hi'n haws i bobl ymgysylltu â'r tribiwnlys yn y ffordd sy'n gweithio orau iddynt. Bydd hyn o fudd i ddefnyddwyr y tribiwnlys, y farnwriaeth a'r staff fel ei gilydd gan greu amgylchedd modern, hygyrch."
        },
        {
            "text": "Gan fod hwn yn adnewyddiad mawr, rydym wedi gallu manteisio i'r eithaf ar y cyfle i sicrhau bod y ganolfan yn cydymffurfio'n llawn â gofynion adeiladu modern. Mae hyn yn adlewyrchu ein hymrwymiad ehangach i wneud y system gyfiawnder yn hygyrch, yn gynhwysol ac yn parchu anghenion unigol."
        },
        {
            "heading": 2,
            "text": "Dylunio Mannau Sy'n Gwneud Gwahaniaeth"
        },
        {
            "text": "I'r rhai a fydd yn ymweld â Chanolfan Tribiwnlysoedd Llundain unwaith y bydd yn agor, bydd y profiad yn teimlo'n wahanol iawn i rai o'r adeiladau y gallant fod wedi arfer â nhw. Mae'r cyntedd a'r dderbynfa wedi'u cynllunio'n fwriadol i fod yn agored ac yn ysgafn. Mae'n ofod mawr, trawiadol ac rwy'n gobeithio mai'r ymateb cyntaf i bobl sy'n cerdded drwy'r drysau yw’rymdeimlad o \"waw, dyma beth y gellir ei gyflawni.\" "
        },
        {
            "text": "Er bod Newgate Street yn brosiect blaenllaw, mae'n un rhan o ddarlun llawer mwy. Ochr yn ochr â datblygiadau newydd, rydym hefyd yn gwneud buddsoddiadau sylweddol i wella ein hadeiladau llys a thribiwnlys presennol ledled y wlad. Eleni byddwn yn gwario £148 miliwn ar atgyweiriadau a gwaith cynnal a chadw, cynnydd sylweddol o'i gymharu â'r blynyddoedd blaenorol. Efallai y bydd rhai prosiectau yn swnio'n gymedrol ar bapur fel ailosod to neu uwchraddio systemau gwresogi, ond gall y gwelliannau hyn gael effaith fawr ar ddefnyddwyr y llys a'n gallu i gyflawni ein gweithrediadau o ddydd i ddydd. "
        },
        {
            "heading": 2,
            "text": "Cydweithio wrth Galon y Cyflawni"
        },
        {
            "text": "Mae cyflawni'r buddsoddiad hwn yn ymdrech tîm go iawn. Mae timau o fewn Eiddo GLlTEF wedi gweithio'n agos gyda chydweithwyr gweithredol a'r farnwriaeth i greu gofod sy'n diwallu anghenion ei ddefnyddwyr. Mae hyn yn sicrhau bod pob dewis dylunio wedi'i seilio ar brofiad llys bywyd go iawn, o sut mae pobl yn symud trwy'r adeilad i sut mae pob ystafell yn cefnogi cyflawni cyfiawnder. Trwy weithio'n uniongyrchol gyda'r rhai sy'n defnyddio'r gofod bob dydd, rydym yn cael mewnwelediadau na ellir eu dal trwy ddyluniadau yn unig, gan ein helpu i ddarparu amgylcheddau sy'n ddiogel, yn effeithlon ac yn gefnogol i bawb sy'n gweithio yn y llys neu'n mynychu'r llys. Mae adborth gweithredol a barnwrol yn siapio'r canlyniad terfynol yn uniongyrchol, gan sicrhau bod y gofod nid yn unig yn swyddogaethol ar bapur ond yn ymarferol, yn hygyrch ac yn addas i'r diben yn y tymor hir. Trwy'r bartneriaeth hon, rydym yn creu adeiladau sy'n galluogi gwell gwasanaethau, gweithrediadau llyfn a phrofiad gwell i ddefnyddwyr y llys. Nid yw cydweithredu erioed wedi bod yn gryfach, ac mae'n gwneud gwahaniaeth gwirioneddol i sut mae gwasanaethau yn cael eu darparu."
        },
        {
            "text": "Mae gweithio ar Ganolfan Tribiwnlysoedd Llundain wedi bod yn fraint wirioneddol. Rwy'n credu y bydd yr adeilad hwn yn symbol o'r hyn y gallwn ei gyflawni pan fyddwn yn buddsoddi'n feddylgar, cynllunio ar gyfer y dyfodol a chadw defnyddwyr yng nghanol ein penderfyniadau."
        }
    ]
}