{
    "url": "https://dragonsden.blog.gov.uk/2026/02/26/dragons-den-ip-blog-series-23-episode-5/",
    "title": "Dragons' Den IP Blog - Series 23 Episode 5",
    "authors": [
        "Paula Davy"
    ],
    "categories": [
        "Confidentiality",
        "Designs",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2026-02-26T21:00:00+00:00",
    "content": [
        {
            "text": "There was a mixed bag of businesses in the Den tonight; from gut-friendly ferments to build-your-own headphones, to a dating app with a difference. Yet there was one thing they all had in common – innovation. The entrepreneurs were all striving to build and improve on existing products, through innovative modifications and concepts."
        },
        {
            "heading": 3,
            "text": "The wrong ‘pitch’"
        },
        {
            "text": "James Martin entered the Den looking to secure a 60k investment in return for a 10% stake in his business, Glawning. A clever play on the word ‘glamping’ and ‘awning’, James was showcasing his teepee style canvas awning that attaches to motorhomes, caravans and the like."
        },
        {
            "text": "I was keen to see if James had protected this unique business name and after using IPO’s ‘search for a trade mark’ tool, I was pleased to see he has a registered trade mark for the word ‘glawning’ under classes 20 and 22, which relate to camping."
        },
        {
            "text": "It's important to note however, having a registered trade mark for your business name doesn't mean you own the official company name and vice versa. Company names need to be registered via Companies House."
        },
        {
            "text": "Anyway, let's get back to the pitch and see if James’ tent can stand up against the Dragons!"
        },
        {
            "text": "While they were all impressed with the awning, Touker Suleyman was concerned that competitors could copy it, to which James replied, ‘We do have design rights on this particular configuration.’"
        },
        {
            "text": "It appears that Glawning does have a series of registered designs. You can view the different awning designs James has registered at this link: DSView."
        },
        {
            "text": "In addition to a trade mark and a registered design, James has also applied for a patent ‘for a new design’ which he claims is ‘going to be a gamechanger’ - a pop up, driveaway awning. Upon hearing the words ‘patent’ and ‘design’ in the same sentence, Deborah Meaden seeks to clarify what protection James has applied for, ‘Is that a patent or a design patent?’"
        },
        {
            "text": "A design patent is a US term, not legally recognised in the UK, and is used to protect the aesthetic appearance of something. It is very different from a UK patent, which protects the technical aspect of an invention and is notoriously difficult to obtain."
        },
        {
            "text": "While the Dragons’ eyes lit up at the mention of a patent, their enthusiasm was short lived after James confesses that he only applied for it the day before coming into the Den."
        },
        {
            "text": "In contrast to a registered design, where you will receive a decision on your application in just a few weeks, getting a patent is a complicated process which can take years, even with the help of a patent attorney."
        },
        {
            "text": "This realisation deters all the Dragons from investing in James and his business and they all declare themselves ‘out.’ However, Peter Jones recognises the value a granted patent can bring and throws James a lifeline, "
        },
        {
            "text": "Did you know, intellectual property (IP) can be one of your business’ most valuable assets and should be considered in the same way as your physical assets? Having IP protection in place can make you more desirable to investors and can be used to secure funding, so it's important you know the value of your trade mark, patent or design. An IP professional or accountant can help you with this, and our guidance details more about getting professional IP help."
        },
        {
            "heading": 3,
            "text": "Too many cooks?"
        },
        {
            "text": "One thing I noted from tonight’s episode was a lot of talk surrounding the involvement of other parties in the various businesses, in particular Club Cultured and Kibu. While the Dragons were concerned that more people meant diluted shares/profit, I was looking at the businesses with my intellectual property hat on. I hoped the inventors had the right agreements in place to determine who owns what with regards to the IP.   "
        },
        {
            "text": "Often, many people end up involved in creating intellectual property because modern ideas rarely come from a single mind working in isolation. Businesses rely on teams of designers, engineers, researchers, and partners who each contribute something unique, which means ownership can quickly become complicated if it isn't clearly defined."
        },
        {
            "text": "When the rules are transparent and well maintained, collaboration becomes safer and far more productive - the more the merrier when it comes to innovation!"
        },
        {
            "text": "Congratulations to all tonight’s entrepreneurs, especially to Kibu and Hati for securing investment from the Dragons. If this episode has inspired you to turn a lightbulb moment into a reality, we have plenty of free guidance on our website to help you along your journey and protect your all-important IP."
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}