{
    "url": "https://naturalengland.blog.gov.uk/2026/02/26/guest-blog-using-biodiversity-net-gain-to-support-dynamic-habitats/",
    "title": "Guest blog: Using Biodiversity Net Gain to Support Dynamic Habitats",
    "authors": [
        "Dr Eleanore Miles",
        "Dr Sarah Scott",
        "Rachel Blount"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Evidence",
        "Landscape",
        "Natural England",
        "Nature",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2026-02-26T12:00:55+00:00",
    "content": [
        {
            "text": "How do you create dynamic habitat systems, that are allowed to shift, grow, and reshape themselves naturally, within the rules of Biodiversity Net Gain (BNG)?"
        },
        {
            "text": "BNG requires that developers leave nature in a measurably better state either on site and or offsite, after a development.  BNG does this using a Statutory biodiversity metric that measures biodiversity value using, habitats as a proxy."
        },
        {
            "text": "“Process led” habitats develop from water flow, flooding, erosion, plant succession and animal activity rather than human interventions. They don’t follow neat designs or fixed timetables but can deliver significant biodiversity gains."
        },
        {
            "text": "This blog explores insights from three experts — Dr Sarah Scott (Senior Advisor, Environment Agency), Rachel Blount (Landscape Ecologist, Nattergal), and Dr Eleanore Miles (Principal Geomorphologist, AtkinsRéalis) — to show how BNG can work with dynamic habitats."
        },
        {
            "heading": 4,
            "text": "Working With Natural Change: Advice from the Environment Agency (Dr Sarah Scott)"
        },
        {
            "text": "Rivers, floodplains and coasts move and change, it allows them to evolve and adapt in relation to their surroundings and climate change. It is also good for nature — but it can feel challenging when trying to meet BNG requirements."
        },
        {
            "text": "Below are six principles that can make BNG compatible with evolving habitats:"
        },
        {
            "text": "Predict outcomes using best available evidence"
        },
        {
            "text": "Draw on your best available data from modelling and comparable sites to forecast how habitats are likely to develop on your site."
        },
        {
            "text": "Be careful about selling units"
        },
        {
            "text": "Begin selling only biodiversity units you are confident you can deliver. As the site matures and certainty of what you will deliver increases, additional units can be sold."
        },
        {
            "text": "Register your best outcomes"
        },
        {
            "text": "The BNG Register records land supplying off-site units. Registering units doesn’t commit you to selling them. Register the units that would be created in the best scenario and be precautionary in selling them as above."
        },
        {
            "text": "Build flexibility into your Habitat Management and Monitoring Plan (HMMP)"
        },
        {
            "text": "Be open about uncertainties when writing your HMMP. Plan for a range of outcomes and include “trigger points” for when you may need to intervene. Make sure you know what a healthy, naturally functioning system looks like on your site and prevent any further interventions once achieved."
        },
        {
            "text": "Work with a supportive Responsible Body (RB) or Local Planning Authority (LPA)"
        },
        {
            "text": "Work with an RB or LPA that understands your site will change over time, can accommodate this flexibility, and allows biodiversity unit numbers to be updated without rewriting legal agreements from scratch."
        },
        {
            "text": "Consider insurance"
        },
        {
            "text": "Insurance products can fund replacement units if some outcomes aren’t achieved during the legal agreement. Include the cost of insurance in your unit pricing."
        },
        {
            "heading": 4,
            "text": "Nattergal: Restoring Nature at Scale Through Natural Processes (Rachel Blount)"
        },
        {
            "text": "Nattergal are using BNG funding to undertake process-led, large-scale restoration of ecologically degraded land."
        },
        {
            "text": "Co-founded by the owners of Knepp Estate, we draw heavily on their evidence of mosaic habitats forming on farmland when cropping stops, free-roaming grazing animals are introduced and natural processes take over."
        },
        {
            "text": "Flexible plans for dynamic landscapes"
        },
        {
            "text": "Our HMMPs accommodate natural ecological change. Instead of mapping exact locations of all habitat patches, we group habitats into mosaic areas and estimate the proportion of each habitat type within the area."
        },
        {
            "text": "Monitoring and adaptive management"
        },
        {
            "text": "We closely monitor number of plant species, habitat structure and key wildlife groups and adjust management when needed. Risks are identified early, and backup actions — such as targeted tree planting — are set out with clear trigger points for their use if habitats fail to establish naturally."
        },
        {
            "text": "Legal agreements that support flexibility"
        },
        {
            "text": "Our conservation covenants (legal agreements), allow management to adapt over time and biodiversity units to be recalculated if outcomes exceed expectations. This avoids penalising landowners for selling fewer units at the start."
        },
        {
            "text": "Being one of the first companies to undertake BNG projects means we are always learning. But it is clear already, natural processes are compatible with BNG and can fund process-led landscape scale nature restoration."
        },
        {
            "heading": 4,
            "text": "AtkinsRéalis: Managing Risk in Process Led River and Beaver Projects (Dr Eleanore Miles)"
        },
        {
            "text": "AtkinsRéalis supported Nattergal at Boothby Wildland, Lincolnshire — a site restoring a river and surrounding habitat through physical management and beaver reintroduction."
        },
        {
            "text": "Precautionary evidence-based forecasting"
        },
        {
            "text": "The team estimated biodiversity uplift based on habitat predictions using data from similar sites, scientific studies and hydrological modelling. Precautionary estimates were used for less predictable, longer-term change through natural processes."
        },
        {
            "text": "A phased approach to selling lower and higher risk units"
        },
        {
            "text": "Sales of biodiversity units were phased so only low risk units will be sold initially, with higher risk units to be sold as management targets are met."
        },
        {
            "text": "Confidence now, flexibility later"
        },
        {
            "text": "This approach allows early, reliable habitat gains to be sold upfront while selling further units as habitats develop. The option is also retained to sell additional units if the site delivers more than expected."
        },
        {
            "text": "Natural England serves as the government’s statutory advisor and key regulator for BNG in England.  It designed the mandatory Biodiversity Metric, manages the register for off-site gains, and handles the sale of statutory biodiversity credits to ensure development results in at least 10% improvement in habitat value."
        }
    ]
}