{
    "url": "https://charitycommission.blog.gov.uk/2026/02/26/how-were-helping-trustees-navigate-their-fundraising-responsibilities/",
    "title": "How we’re helping trustees navigate their fundraising responsibilities",
    "authors": [
        "Mazeda Alam, Head of Guidance & Practice"
    ],
    "categories": [
        "Guidance"
    ],
    "pub_date": "2026-02-26T14:10:39+00:00",
    "content": [
        {
            "text": "Fundraising is vital to the charity sector, enabling organisations to raise the funds they need to deliver their missions and thereby support the communities they serve. Getting it right protects public trust and ensures charities can continue to attract the financial support they need to make their desired impact."
        },
        {
            "text": "We’ve updated our guidance on fundraising (CC20) and emergency appeals guidance (CC40) to help trustees clearly understand their responsibilities, especially at a time when charities may need to work harder for donations whilst also seeing increased demand for their services."
        },
        {
            "text": "Both pieces of guidance are now more concise and accessible, making it easier for trustees to understand their responsibilities."
        },
        {
            "text": "Why have we revised the guidance?"
        },
        {
            "text": "We chose to refresh our fundraising guidance in response to the ongoing challenging financial environment for many charities and also to better complement the separate role of the Fundraising Regulator."
        },
        {
            "text": "Our analysis of annual returns indicates the generosity of the public accounts for almost a third of charity income through donations and legacies, valued at £31.4bn in 2023. However, our 2025 public research indicates the proportion of people donating or raising funds for charities has fallen in the previous five years. As a result, charities may find they need to work harder to attract and retain financial support from the public."
        },
        {
            "text": "One way of reassuring donors is to fully comply with the law on fundraising and follow best practice, which charities can do by registering with the Fundraising Regulator and following its now well-established Code of Fundraising Practice. Our refreshed guidance complements the Code, which was updated in November, to help trustees better understand their legal duties and responsibilities in this important area."
        },
        {
            "text": "What’s changed?"
        },
        {
            "text": "Both guides are now shorter reads, enabling trustees to understand core messages to improve their practice. At the same time, the new fundraising guidance explains how trustees’ management of fundraising should dovetail with how they minimise fraud at their charity and manage other risks."
        },
        {
            "text": "CC20 continues to focus on key areas, such as:"
        },
        {
            "text": "Our revised CC40 emergency appeals guidance, meanwhile, recognises the essential role that charities play in emergency situations. Aid charities raising money to carry out expert humanitarian work worldwide is a clear example. But emergencies happen closer to home too, where charities and other agencies work together to meet immediate and longer-term needs of communities in the UK. The Southport Stronger Together Appeal is a recent example, supporting those affected by the shocking knife attack which took place in that community in 2024. "
        },
        {
            "text": "Understanding the best way to help"
        },
        {
            "text": "Whether delivering relief directly, fundraising or supporting in other ways, trustees should understand what their charity can and cannot do, and what is the best way to help."
        },
        {
            "text": "It is understandable to want to set up an appeal in the face of a crisis, disaster or other emergency. And it is easy to do this using online giving platforms. But the revised CC40 guidance sets out important considerations that will enable trustees to understand how they can help while also avoiding potential issues later."
        },
        {
            "text": "For example, the guidance reminds trustees to check if their charity’s purposes enable it to raise funds for the emergency. And, if they do raise funds, there’s guidance on being clear and transparent about what they will use the funds for, while ensuring compliance with the law and the Code of Fundraising Practice."
        },
        {
            "text": "Both pieces of guidance emphasise trustees’ fundamental duties when fundraising generally or for an emergency appeal."
        },
        {
            "text": "Taken together, we hope that that our redesigned guidance will help trustees fulfil their responsibilities, protect their charities and help maintain the public’s trust in the sector’s essential work."
        }
    ]
}