{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2026/02/26/how-digital-identity-can-support-compliance-with-the-uks-money-laundering-regulations/",
    "title": "How digital identity can support compliance with the UK’s Money Laundering Regulations ",
    "authors": [
        "Eleanor Curry",
        "Paul Donati"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2026-02-26T12:13:31+00:00",
    "content": [
        {
            "text": "Regulated businesses across the UK economy – from financial services to gambling, and from art dealers to estate agents – must comply with the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017 (Money Laundering Regulations). "
        },
        {
            "text": "Some firms already use digital journeys to onboard customers. Others have told us they want clearer direction on when, and how, digital identity checks can be used to meet Money Laundering Regulations requirements. "
        },
        {
            "text": "Following a public consultation on the Money Laundering Regulations in 2024, HM Treasury committed to publish joint guidance with the Department for Science, Innovation and Technology (DSIT) on using digital verification services (“DVS”). "
        },
        {
            "text": "That joint guidance is now available and sets out how the UK digital verification services trust framework (“trust framework”) interacts with the Money Laundering Regulations. "
        },
        {
            "text": "This post summarises what the guidance means in practice. "
        },
        {
            "heading": 2,
            "text": "What the guidance is for "
        },
        {
            "text": "The guidance has been created to help organisations covered by the Money Laundering Regulations understand: "
        },
        {
            "heading": 2,
            "text": "What this means for Money Laundering Regulations compliance "
        },
        {
            "text": "Under the Money Laundering Regulations, regulated entities must have policies, controls and procedures to mitigate the risks of money laundering and terrorist financing. "
        },
        {
            "text": "This includes customer due diligence (CDD) measures to verify identity and understand the purpose behind transactions. "
        },
        {
            "heading": 2,
            "text": "Using certified and registered DVS under Regulation 28 of the Money Laundering Regulations "
        },
        {
            "text": "The guidance explains that DVS which are certified against the trust framework and on the DVS Register, can be treated as a reliable and independent source of information, with appropriate anti-impersonation assurance. "
        },
        {
            "text": "Speciﬁcally, for individuals, entities are able to fulﬁl their obligations under Regulation 28 of the Money Laundering Regulations by verifying a customer’s identity using certiﬁed and registered DVS. "
        },
        {
            "text": "Regulated entities may also use certified and registered DVS to support verification of company directors. "
        },
        {
            "text": "DVS which are not certified and are therefore not on the DVS register cannot reliably be deemed suitable for identity veriﬁcation in compliance with the Money Laundering Regulations. "
        },
        {
            "heading": 2,
            "text": "What firms still need to do "
        },
        {
            "text": "Using digital identity can support identity verification, but it does not remove wider Money Laundering Regulations responsibilities. "
        },
        {
            "text": "Regulated entities should: "
        },
        {
            "heading": 2,
            "text": "What’s next "
        },
        {
            "text": "Alongside this work, the government expect to consult on a national Digital ID issued directly by government. "
        },
        {
            "text": "Where necessary, we will work with sector guidance bodies to ensure that specific guidance encourages the appropriate use of digital identity for CDD measures. "
        },
        {
            "text": "Widespread use of digital identity could bring significant benefits – estimated at £701 million per year for the UK economy – but those benefits depend on trust. The trust framework and the DVS Register are designed to provide that foundation, while supporting regulated firms to meet their obligations under the Money Laundering Regulations. "
        }
    ]
}