{
    "url": "https://sustainableict.blog.gov.uk/2024/12/02/how-were-bringing-new-ideas-into-our-sustainability-alliance/",
    "title": "How we’re bringing new ideas into our sustainability alliance",
    "authors": [
        "Chris Howes - Chief Digital and Information Officer"
    ],
    "categories": [
        "GDSA",
        "Sustainable ICT",
        "Uncategorized"
    ],
    "pub_date": "2024-12-02T10:36:55+00:00",
    "content": [
        {
            "text": "Chris Howes reflects on a recent gathering of Government Digital Sustainability Alliance (GDSA) members that included the latest recruits to what is becoming a fast-growing forum."
        },
        {
            "text": "It was my pleasure recently to welcome a new cohort of members during the latest meeting of our fast-growing Government Digital Sustainability Alliance (GDSA)."
        },
        {
            "text": "They joined existing members of the alliance to explore and discuss the emerging strategic context arising from the election of the new Government in July, and what this means for those of us engaged in the topic of ICT (Information Communications Technology) sustainability."
        },
        {
            "text": "It was the first time that we had met since our March Summit, an event which marked the beginning of a new phase of coordinated GDSA and cross-Government working in this area of policy. It was also the first opportunity for our new members to say ‘hello’ and to bring their ideas into the conversation."
        },
        {
            "heading": 2,
            "text": "Progress since March"
        },
        {
            "text": "Since we gathered in March, we’ve seen the expansion of the GDSA to over 50 organisations, which is a hugely encouraging sign of the appetite and enthusiasm that is out there on this topic."
        },
        {
            "text": "It’s hugely positive that we’ve been able to increase the range of organisations that we have represented in the GDSA – for example we now have more reseller and not for profit organisations and academic institutions, as well as suppliers who specialise in different parts of the technology lifecycle."
        },
        {
            "text": "Our approach has been to welcome as many people as possible to the alliance as Associate Members, to start getting involved and attending events like this.  "
        },
        {
            "text": "We’ve also seen increasing coordination across Government on this issue in recent months. The cross-Government Digital Sustainability Steering Group now meets every month to agree strategy and prioritise our efforts, and it was great to have members from that group at our event too."
        },
        {
            "heading": 2,
            "text": "What we talked about"
        },
        {
            "text": "Those who were able to join me heard about the progress of the current working groups on Scope 3 (supply chain) emissions, circular economy and planetary impact."
        },
        {
            "text": "We also confirmed that two new working groups are being established, focusing on emerging opportunities on AI, and the Green Service Principles. The creation of these new working groups, sitting alongside the work that we're already doing in the GDSA, signals an ongoing commitment from both Government and industry to address the issues we face in the ICT sector."
        },
        {
            "text": "Globally, we’re continuing to see increasing attention on this issue too. For example, the UK was one of nearly 200 members of the Global Digital Compact earlier this year, and in the past couple of weeks COP29 has included further discussions on Green IT and “IT for Green” issues. I myself had a very productive meeting with the UN Environment Programme just last month, to understand opportunities for joint working with them in the future too."
        },
        {
            "text": "The new Government have confirmed their commitment to this issue across key Departments such as the Department for Energy Security & Net Zero, Department for Science, Innovation & Technology (DSIT), and Defra. Indeed, our new Secretary of State has put a particular focus on improving circularity across the UK economy."
        },
        {
            "text": "We are continuing to ensure sustainable IT has a key part in the new ‘Digital Centre’ which is being established in DSIT now that the Government Digital Service (GDS) and the Central Digital & Data Office (CDDO) have moved across there."
        },
        {
            "text": "We’ve completed ourlatest annual report on Government performance and will be publishing this very soon – much of the information in this report is reliant on GDSA members providing data to various Departments. The Greening Government commitments are also being updated, and we have worked across Government to include ambitious updated commitments on sustainable IT performance."
        },
        {
            "heading": 2,
            "text": "Why what we do matters"
        },
        {
            "text": "So, as you can see, we are making progress, but we still face some significant challenges ahead, which to me are also opportunities, and which the GDSA will be crucial in helping us with."
        },
        {
            "text": "Technology is so crucial to the environment – both as a cause and a solution to the climate crisis. If you’re reading this, I’m hoping that you are already on the same page about that!"
        },
        {
            "text": "As I often think, there is no monopoly on ideas, and as always, I’m really interested in hearing ideas from anyone who has an interest in this topic. It’s important to me that we find ways to make space for people who want to contribute more, to be able to, so do please reach out to us if you have any."
        },
        {
            "text": "I’ve been working in the field of environmental protection for about 40 years now. In fact, I began my career managing emissions from major industries, including nuclear and oil and gas. More recently I’ve had a more traditional IT focus, both on major infrastructure programmes but also (especially in recent years) the move to service-based and digital approaches."
        },
        {
            "text": "One of the key things I’ve learned though, especially relating to this issue, is that Government doesn’t have all the answers, and groups like the GDSA are essential for us to work with suppliers and academia to make progress. So, please let’s continue to do that."
        },
        {
            "text": "Chris Howes is the Chief Digital and Information Officer for Defra and the Senior Responsible Officer for sustainable ICT across UK Government."
        },
        {
            "text": "The GDSA seeks to promote, collect, share and demonstrate best practice aligned to Defra’s and UK Government sustainability commitments."
        },
        {
            "text": "If you’re interested in finding out more about what we do or would like to know more about becoming a member of the Alliance, please get in touch."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}