{
    "url": "https://buyingforschools.blog.gov.uk/2024/12/02/my-experience-of-the-risk-protection-arrangement-rpa-claims-process-when-our-school-flooded/",
    "title": "My experience of the risk protection arrangement (RPA) claims process when our school flooded.",
    "authors": [
        "Catherine Morley, Headteacher at Theale Church of England primary School"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-12-02T11:50:55+00:00",
    "content": [
        {
            "text": "Catherine Morley is Headteacher at Theale Church of England Primary School in Reading, West Berkshire. In this blog post, Catherine shares her experience of the RPA support her school received when an incident with the sprinkler suppression system resulted in severe water damage to her school."
        },
        {
            "text": "It was Monday morning, 7 July, 2023, and I was first on site. When I walked into the school, I could hear running water and was immediately worried. At some point during the weekend, one of the sprinkler heads had failed and water had spread across half the school. I was paddling in about 5 inches of water!"
        },
        {
            "text": "Our school isn’t brick-built, there was no natural barrier for the water. With porous concrete floors and underfloor heating, water seeped into the foundations. The sprinkler tank kept filling, creating a constant stream of water."
        },
        {
            "text": "Having recently relocated to a new building, we'd spent two years improving our school. Seeing it destroyed was devastating. The water had damaged the electrical systems. I made the decision to close the school for a day to ensure everyone's safety."
        },
        {
            "text": "The day was filled with urgent calls for assistance. The RPA responded swiftly, dispatching an electrician to ensure safety. With DfE support, we focused on getting children back to school. The RPA quickly brought in experts and equipment. These professionals prioritised understanding our school's needs and ensuring its smooth operation for the children, rather than focusing solely on costs."
        },
        {
            "text": "I opened the school the following day and the children came back on a rotation for the final two weeks of term. We used the hall and outside space for classrooms, making sure the children enjoyed the end of term activities."
        },
        {
            "text": "With half the school destroyed, we worked tirelessly through summer to prepare for September. The RPA, despite challenges in finding temporary accommodation, assisted in securing space at a local education centre. They funded transport and resources needed to get the school up and running, working alongside the local authority to support our recovery."
        },
        {
            "text": "The works were completed to a high standard, not just some dryers brought in to dry the school out. The damage was so significant, and it was only because of the company the RPA brought in to do the testing of damp levels on the walls we knew the full extent of the problem. When the floors were dug up you could see the extent of the damage."
        },
        {
            "text": "We implemented a staggered approach to setting up temporary accommodation, which, although more challenging for contractors, better suited the children's needs. We had eight temporary buildings, and a toilet block brought on site at the end of September 2023, and by October half-term, our Year 6 children had moved back and the whole school was at least back on one site."
        },
        {
            "text": "From January 2024 we had started to move back into the main school. The last works in the hall and art studio were completed during the Easter break and the temporary accommodation was removed. By May we were back in our school. I’m so pleased the children have not been impacted as much as they could have been. I am also lucky to have such committed staff who have worked so hard and flexibly to make this massive logistical project work."
        },
        {
            "text": "I felt like we were in safe hands all the way through"
        },
        {
            "text": "The contractors throughout the works were very professional, there were no issues with them on site and they did a brilliant job. We have a better school than before this happened because of the mitigation measures that have been put in place, for example different underfloor insulation to stop the spread of water."
        },
        {
            "text": "We had like-for-like things such as furniture and cupboards. When we had to move back into the school we were supported, and school events were worked around."
        },
        {
            "text": "Despite the logistical challenges involving numerous companies and trades, we felt supported throughout by the RPA. Our primary goal, shared by the RPA, was to minimise the impact on our children and maintain our high standards. It never felt like a battle to make sure everything was as good as it had been and for the children to have what they need, that was great."
        },
        {
            "text": "Would you recommend the RPA?"
        },
        {
            "text": "Yes, I don’t know why a school would not be a member of the RPA."
        },
        {
            "text": "Throughout this whole ordeal it felt manageable because we had a team of people around us that were appointed by or worked for the RPA, and they just managed everything and kept us informed."
        },
        {
            "text": "They were kind all the way through, they were practical and helpful. I had their mobile numbers and could call them at any time … and they are insuring us again this year, I’m so grateful to them, I would have thought after this major event they would say no!"
        },
        {
            "text": "Join the RPA today"
        },
        {
            "text": "If you have read this and you are a public sector school that is not currently an RPA member, joining is simple and takes less than 5 minutes."
        },
        {
            "text": "There are no forms, and RPA operates on a no material fact disclosure basis, so we don’t need estate, buildings or contents valuations and we don’t review your school's risk rating. There is also no annual renewal process – your membership will just roll over to the next year. To find out more, watch our pre-recorded RPA webinar."
        },
        {
            "text": "Follow the Buying for schools LinkedIn page for daily updates about all the webinars we run, events school buyers might find useful, and new frameworks as they become available. It really is a useful resource for anyone who is buying for a school or a trust."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}