{
    "url": "https://mhclgmedia.blog.gov.uk/2024/12/02/radical-action-to-speed-up-removal-of-unsafe-cladding-announced/",
    "title": "Radical action to speed up removal of unsafe cladding announced",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Building safety"
    ],
    "pub_date": "2024-12-02T14:30:39+00:00",
    "content": [
        {
            "text": "There has been widespread coverage following the Ministry of Housing, Community and Local Government’s publication of the Remediation Acceleration Plan today (2 December 2024)"
        },
        {
            "text": "This was picked up in print and online by the BBC, FT, I, Guardian, Mirror, LBC, the Sun, and Daily Mail. On broadcast the news was covered by BBC Radio Four’s Today programme and ran second on the ITV bulletins."
        },
        {
            "text": "The Remediation Acceleration Plan (RAP) introduces new measures to ensure buildings get fixed quicker, rogue freeholders are held to account, and affected residents have an end in sight after years of uncertainty."
        },
        {
            "text": "Reporting largely leads with the RAP’s ambitious new target dates for making buildings safe:"
        },
        {
            "text": "The plan is backed by more investment in enforcement - so that local authorities, fire and rescue authorities and the Building Safety Regulator have the capacity to tackle hundreds of cases per year.  A full range of options on sanctions are being considered if we do not see rapid action from building owners."
        },
        {
            "text": "The government has also published a joint action plan with developers to accelerate their work to fix buildings for which they are responsible – with at least 29 developers accounting for over 95% of relevant buildings having already committed to more than doubling the rate at which they are assessing and remediating their buildings."
        },
        {
            "text": "The plan follows the publication of the final Grenfell Tower Inquiry report in September, which highlighted catastrophic and systemic failures in keeping people safe. It delivers on the Prime Minister’s commitment that the government set out further steps on remediation to deliver real change."
        },
        {
            "text": "The Deputy Prime Minister also wrote to private sector organisations with high rise buildings in government funds where work to remediation unsafe cladding has not started."
        },
        {
            "text": "The letters set clear expectations that organisations need to start work on site or face the consequences. The expectations require a start on site expectation of the end of March 2025 for buildings with unsafe ACM cladding and no later than the end of 2025 for buildings with other types of unsafe cladding"
        },
        {
            "text": "The government is considering the Phase 2 report of the Inquiry and has committed to providing an update on our progress by March 2025."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said:     "
        },
        {
            "text": "“More than seven years on from the Grenfell tragedy, thousands of people have been left living in homes across this country with dangerous cladding.   "
        },
        {
            "text": "“The pace of remediation has been far too slow for far too long. We are taking decisive action to right this wrong and make homes safe. "
        },
        {
            "text": "“Our Remediation Acceleration Plan will ensure those responsible for making buildings safe deliver the change residents need and deserve.” "
        },
        {
            "text": "Building Safety Minister Alex Norris said:   "
        },
        {
            "text": "“Every resident deserves to feel safe in their home. By setting a clear timeline and firm deadlines, today’s announcement is a major step towards ensuring every building is made safe. "
        },
        {
            "text": "“Our Remediation Acceleration plan will fix buildings faster, identify all buildings with unsafe cladding and support vulnerable residents.  "
        },
        {
            "text": "“This underscores our unwavering commitment to safeguarding residents and holding those responsible to account. We will not hesitate to actively pursue the owners of buildings who refuse to act.” "
        }
    ]
}