{
    "url": "https://socialcare.blog.gov.uk/2024/12/02/shared-lives-mutually-assured-support/",
    "title": "Shared Lives: mutually assured support",
    "authors": [
        "Suzi Clark"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Innovation"
    ],
    "pub_date": "2024-12-02T11:56:17+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is Shared Lives?"
        },
        {
            "text": "Throughout this year, I have travelled across the country talking to sector colleagues about a hopeful and innovative form of social care - Shared Lives."
        },
        {
            "text": "Shared Lives is a community-based service offering accommodation and support to adults with learning disabilities and/or other social care needs. It is person-centred, rights based, inclusive and built on positive relationships. "
        },
        {
            "text": "This model of care and support is all about sharing family and community life and can be adapted for day, respite and long term arrangements."
        },
        {
            "text": "The set up succeeds through the careful matching of needs and interests and is run or commissioned by local adult social care services."
        },
        {
            "heading": 2,
            "text": "Accelerating reform"
        },
        {
            "text": "This year has seen Shared Lives in the spotlight thanks to the Accelerating Reform Fund (ARF). This fund, aimed at scaling social care innovation in England, provides grant funding to councils, which encourages partners to work together across local Integrated Care Systems."
        },
        {
            "text": "Nearly half of all ICS areas in the country chose to use their ARF grant to grow and develop shared living arrangements such as Shared Lives. This reflects how respected and valued this option is and the benefits it can deliver by expanding out to more people."
        },
        {
            "text": "As a national charity supporting the sector by providing membership, development and growth support (which we call ‘strategic advice’), Shared Lives Plus has been working closely with councils to support them in their grant-funded growth activities."
        },
        {
            "text": "This includes:"
        },
        {
            "text": "These funded projects have encouraged local innovation and growth across the adult social care sector."
        },
        {
            "heading": 2,
            "text": "Spreading the message"
        },
        {
            "text": "Throughout my conversations with colleagues across the country, I am left hopeful by a common response to Shared lives no matter where I go and who I speak to, in which everyone wants to see shared lives grow and succeed."
        },
        {
            "text": "However, it is also true many people have still never heard of shared lives. Therein lies the biggest challenge to shared lives flourishing - how do we raise its profile further?"
        },
        {
            "text": "I think an opportunity has arisen to use these local projects to amplify the conversation about Shared Lives and make use of new and untapped local channels and networks."
        },
        {
            "text": "We can build on the collaborative efforts and energy of so many people this year and encourage local decision makers, to adopt Shared Lives as a framework for mutually beneficial support."
        },
        {
            "text": "If we maintain this momentum, we may reach the tipping point where Shared Lives becomes a common reference in our conversations and grows as an option for those who need this kind of care and support the most."
        }
    ]
}