{
    "url": "https://ofsi.blog.gov.uk/2024/03/28/2024-crown-dependencies-and-overseas-territories-sanctions-forum/",
    "title": "2024 Crown Dependencies and Overseas Territories Sanctions Forum",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2024-03-28T16:31:42+00:00",
    "content": [
        {
            "text": "Earlier this month, sanctions leads and implementers from across the Crown Dependencies (CDs) and Overseas Territories (OTs) gathered in London for the fourth annual CDs and OTs Sanctions Forum.  "
        },
        {
            "text": "Sanctions Implementation in the CDs and OTs "
        },
        {
            "text": "The CDs and OTs play a vital role in implementing and enforcing UK sanctions and countering circumvention in partnership with UK authorities. This collaborative effort helps to ensure that the UK sanctions regime is robust and that our measures have their intended impact.  "
        },
        {
            "text": "UK sanctions apply fully in the CDs and OTs. Each CD and OT has its own competent authority responsible for the implementation of financial sanctions, and OFSI has worked closely with them for several years. CDs and OTs have played a critical role in the implementation of the Russia sanctions regime, freezing significant assets across their jurisdictions. "
        },
        {
            "text": "This work also contributes to broader strategic efforts between the UK and the OTs to counter illicit finance, which includes sanctions evasion. Under the Economic Crime Plan 2, the UK has committed to strengthening our dialogue with the OTs on illicit finance.  "
        },
        {
            "text": "The Sanctions Forum "
        },
        {
            "text": "The Forum, which is co-organised by OFSI and FCDO, is a regular milestone in our year-round engagement with the CDs and OTs. It is an opportunity for practitioners across the wider British constitutional family to meet in-person for a technical exchange on a range of topics related to sanctions and their implementation, to share experiences, information and discuss examples of best practice. "
        },
        {
            "text": "This year’s forum was opened by Treasury Lords Minister, Baroness Vere, who reflected on what we have collectively achieved over the past two years and the importance of our continued collaboration to implement the UK’s sanctions regimes. "
        },
        {
            "text": "Attendees participated in a series of interactive sessions, which covered areas including enforcement, circumvention, licensing, litigation and trusts. They also met with representatives from across government, including the National Crime Agency (NCA), Department for Transport (DfT) and the new Office of Trade Sanctions Implementation (OTSI).  "
        },
        {
            "text": "Next Steps "
        },
        {
            "text": "The 2024 Sanctions Forum focused on the theme of collaboration, and this is something we are keen to strengthen further in the year ahead. We are extremely grateful to our colleagues in the CDs and OTs for their continued productive engagement, positive collaboration and consistent effort, and look forward to building on the success of the latest forum. "
        }
    ]
}