{
    "url": "https://levellingupadvisorycouncil.blog.gov.uk/2024/03/28/bridging-the-uk-sme-finance-gap-oliver-wyman-report-offers-solutions/",
    "title": "Bridging the UK SME Finance Gap: Oliver Wyman report offers solutions",
    "authors": [
        "luacsecretariat"
    ],
    "categories": [
        "Access to finance"
    ],
    "pub_date": "2024-03-28T10:22:48+00:00",
    "content": [
        {
            "text": "For nearly a century, the UK has grappled with the persistent challenge of regional disparities in access to finance for its small and medium-sized enterprises (SMEs). The \"MacMillan Gaps,\" first identified by the MacMillan Committee in 1931, continue to hinder the growth and development of businesses across the nation, particularly for those in regions outside of London and the South East."
        },
        {
            "text": "A new report by the global consultancy firm Oliver Wyman—carried out under the auspices of the Levelling Up Advisory Council—sheds new light on where these gaps exist, both by region and by funding type, by piecing together new and existing data on the UK’s funding ecology."
        },
        {
            "text": "Launched on 29 February at Oliver Wyman’s Tower Bridge offices, How to Close The UK SME Finance Gap And Boost Growth provides a forensic assessment of the UK's funding ecology, identifying spatial cold spots for business financing, particularly equity finance for scale-up stage companies."
        },
        {
            "text": "The report identifies three main factors contributing to these cold spots:"
        },
        {
            "text": "Interestingly, the report finds that the proportion of active enterprises classified as high growth is relatively consistent across the UK and has little correlation with equity investment and access to lending—suggesting that a lack of ambitious businesses is not the main reason behind regional finance disparities."
        },
        {
            "text": "The report puts forward eight recommendations that focus on strengthening local governance, mobilising private and public sector capital, and implementing targeted government policies. These recommendations aim to create a more balanced and equitable distribution of finance across the UK's thriving SME landscape."
        },
        {
            "text": "The report launch event, opened by the Secretary of State for Levelling Up, Housing and Communities, and moderated by LUAC Chair Andy Haldane, featured insightful panel discussions with experts from local government, finance, and banking sectors."
        },
        {
            "text": "The discussions arrowed in on the challenges faced by SMEs in accessing finance and the potential solutions to overcome these obstacles, including how to ensure businesses are ready to receive and utilise finance. The panellists also engaged in a wider discussion around the challenges of improving regional disparities in skills and infrastructure and leveraging devolution and planning systems to address these disparities."
        },
        {
            "text": "The report serves as a catalyst for broader initiatives, such as the Local Finance Working Group, announced at Autumn Statement 2023, and the South Yorkshire access to capital pilot, which aim to facilitate a more free-flowing and equitable distribution of finance across the UK's investment ecosystem.\nBy addressing regional access to finance and investment in infrastructure imbalances, these initiatives hope to unlock untapped potential and drive economic growth across the nation."
        }
    ]
}