{
    "url": "https://insideDIO.blog.gov.uk/2024/03/28/celebrating-success-constructing-the-carne-building/",
    "title": "Celebrating success - Constructing the Carne Building",
    "authors": [
        "Victoria Wall"
    ],
    "categories": [
        "Accommodation",
        "Construction"
    ],
    "pub_date": "2024-03-28T16:20:05+00:00",
    "content": [
        {
            "text": "I joined DIO in March 2022 as an Assistant Project Manager, working on various infrastructure projects across the Defence Estate. In August 2022, I took ownership of a major project at Imjin Barracks to deliver new Single Living Accommodation (SLA) for Army personnel based there. Crucial to my job was working with all stakeholders, including our contractors, to ensure that we delivered modern and sustainable infrastructure that meets the needs of the Armed Forces both now and in the future, and, as a military spouse myself, I know first-hand how important this is."
        },
        {
            "text": "I oversaw and coordinated this project from its technical design all the way through to its handover and I was proud to attend the recent visit by Her Royal Highness, The Princess Royal, to see her officially open the Carne Building."
        },
        {
            "text": "My job always presents new challenges and no two days on this project were the same. One day I would be working on the technical design, coordinating with the contractor on any design changes and on another, I would be on the construction site overseeing progress and holding meetings, as well as solving the day-to-day challenges that come with most projects."
        },
        {
            "heading": 2,
            "text": "Turning challenges into opportunities "
        },
        {
            "text": "A particularly exciting element of this project for me was the inclusion of an energy battery storage system. The system harvests excess energy from solar panels on the building’s roof. This system had never been used before by the MOD and so was the first of its kind. This was a big challenge but also a great opportunity to learn from other projects and take an innovative approach to sustainability."
        },
        {
            "text": "My role was primarily about learning, upskilling, researching, and coordinating with different Subject Matter Experts (SMEs) on how to deliver the system, as well as taking advice from organisations outside of the MOD."
        },
        {
            "text": "The Carne Building is the first block of new bedspaces to be delivered under the Army’s ten-year Single Living Accommodation Programme, which is improving the standard of single soldier accommodation across the MOD estate."
        },
        {
            "text": "The new SLA comprises of 69 single ensuite bedspaces along with communal living and kitchen/diner facilities.  As well as the energy battery storage system, the building includes other sustainable features, such as air source heat pumps and SMART technology to monitor energy use and ensure the building runs as efficiently as possible."
        },
        {
            "text": "I am pleased to be part of work that is delivering infrastructure that has such an impact on the Armed Forces. This project was a truly collaborative effort from start to finish, and by working closely with the Army customer we were able to fully understand how we can enhance the living experience for our Military personnel."
        },
        {
            "text": "This project has made me feel incredibly proud and I regard the new SLA as a truly outstanding facility for our service personnel to enjoy."
        }
    ]
}