{
    "url": "https://companieshouse.blog.gov.uk/2024/03/28/companies-house-campus-sharing-user-centred-thinking-across-the-organisation/",
    "title": "Companies House Campus: sharing user-centred thinking across the organisation",
    "authors": [
        "Alkistis Geropoulou - Head of User-Centred Design"
    ],
    "categories": [
        "Working at Companies House"
    ],
    "pub_date": "2024-03-28T12:59:41+00:00",
    "content": [
        {
            "text": "The Companies House Campus (CH Campus) is an education hub with courses developed by our user-centred design team and delivered to our colleagues. We’ve developed a series of courses to help our colleagues gain a better understanding of the needs of our end users and how to deliver services that meet their needs."
        },
        {
            "text": "CH Campus gives us the opportunity to develop and establish better collaboration between our teams."
        },
        {
            "heading": 2,
            "text": "How I developed digital skills"
        },
        {
            "text": "Before joining the Government Digital Service (GDS) in 2018, I knew very little about digital delivery and product design. During my time at GDS, I developed technical skills and leadership traits by:"
        },
        {
            "text": "After completing courses in product management, service design, and agile delivery methodology, I looked for opportunities to put the templates and tools I’d learned to good use."
        },
        {
            "text": "I worked as a digital assessor and supported digital teams across government departments to meet the service standard. The training I received helped me:"
        },
        {
            "text": "Most importantly, the terminology and tools I picked up helped me support teams with telling their story and presenting their work."
        },
        {
            "heading": 2,
            "text": "Connecting through learning and sharing experiences"
        },
        {
            "text": "When I joined Companies House, I found a highly skilled and engaged user-centred design community. This community was made up of teams including:"
        },
        {
            "text": "All of the teams were well connected with other government departments, and up to speed with the latest design and accessibility standards. They were also highly regarded in the organisation. I wanted to use that expertise to develop other people’s skills the way others had helped me in my journey."
        },
        {
            "heading": 2,
            "text": "Setting up the CH Campus"
        },
        {
            "text": "When creating the CH Campus, we asked ourselves who our audience was and what needs we were trying to meet. Looking at our own development, we’d attended training not just to learn new things but also to connect with others and share experiences. This led to our campus motto: ‘Connect, learn and share’."
        },
        {
            "text": "By bringing everyone together, we aimed to create opportunities for learning and to help people understand the value of user-centred design. We also wanted to help non-technical colleagues build knowledge and understanding of how digital services are designed."
        },
        {
            "text": "The teams from the UCD community got together to discuss what training would offer value to our digital and non-digital colleagues across the organisation."
        },
        {
            "text": "We launched a pilot trial of CH Campus to see how much interest there was across the organisation, and to find out about people's learning needs. As a result, we developed and ran the first 4 courses:"
        },
        {
            "text": "We delivered the sessions both in person and remotely so that we could reach all colleagues and have the opportunity to get to know each other."
        },
        {
            "heading": 2,
            "text": "What we’ve learned so far"
        },
        {
            "text": "We collected feedback before and after the training courses to assess the impact they had on development and community building. The feedback showed that our training sessions were engaging and enthusiastic. The sessions helped our colleagues understand how they could apply user-centred design thinking to their work."
        },
        {
            "heading": 2,
            "text": "Our vision for CH Campus"
        },
        {
            "text": "We’ve designed CH Campus as a platform that any other digital teams can use to host and run training. Once we start onboarding other teams to deliver their own training, we hope to expand our curriculum with training on product management and agile delivery management."
        },
        {
            "text": "We’re also exploring how we can add value to other government departments by combining our training materials and opening our training courses to other cross-government colleagues."
        },
        {
            "text": "We’ll record and store our training sessions to create a library of training videos for any new person that joins the organisation."
        },
        {
            "text": "Like any digital product, we’ll monitor the impact of CH Campus on our community and culture. We’ll also continue to review how it meets the needs of our users. There’s so much scope, so watch this space."
        }
    ]
}