{
    "url": "https://levellingupadvisorycouncil.blog.gov.uk/2024/03/28/from-industrial-decline-to-innovation-the-transformational-impact-of-the-amrc/",
    "title": "From industrial decline to innovation: the transformational impact of the AMRC",
    "authors": [
        "luacsecretariat"
    ],
    "categories": [
        "Research & innovation"
    ],
    "pub_date": "2024-03-28T16:19:03+00:00",
    "content": [
        {
            "text": "In the heart of Rotherham, on the site of the former Orgreave coking plant—a place once synonymous with industrial decline and social unrest—a remarkable transformation has taken place. The Advanced Manufacturing Research Centre (AMRC), established in 2001 through a joint venture between the University of Sheffield and Boeing, is blazing a trail for the UK's manufacturing industry and bringing new hope to the local community."
        },
        {
            "text": "By bridging the gap between academic research and industrial application through world-leading research into advanced machining, manufacturing, and materials, the AMRC is creating new opportunities for growth and innovation. The centre's groundbreaking work is not only reshaping the manufacturing landscape but also inspiring a new generation of skilled workers."
        },
        {
            "text": "On 13 March, the Levelling Up Advisory Council (LUAC) visited the AMRC's state-of-the-art training facilities, which have attracted global manufacturing giants such as Rolls-Royce, McLaren, and Airbus. The visit showcased the transformative potential of investing in skills, innovation, and infrastructure."
        },
        {
            "text": "The AMRC's Training Centre, opened in 2014, is a shining example of this transformative potential. By providing apprenticeships and training programmes in advanced manufacturing, the centre is creating a skills pathway from Level 3 apprenticeships to PhDs at Sheffield University, ensuring a pipeline of highly skilled workers for the future."
        },
        {
            "text": "The visit also highlighted the importance of collaboration between government, industry, and academia in driving economic growth and regeneration. During a roundtable discussion led by Andy Haldane, Chair of the LUAC, regional stakeholders discussed the potential of deeper devolution powers to enable local areas to tailor policies and investments to their specific needs, particularly around adult skills and transport connectivity."
        },
        {
            "text": "The LUAC's visit to the AMRC serves as a powerful reminder of the transformative potential of Levelling Up. By investing in skills, innovation, and infrastructure, new opportunities can be created for communities scarred by industrial decline. The success of the AMRC also demonstrates that when government, industry, and academia work together towards a common goal, remarkable results can be achieved."
        }
    ]
}