{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/28/mapping-our-natural-assets-the-natural-capital-and-ecosystem-assessment-programme/",
    "title": "Mapping our natural assets: the Natural Capital and Ecosystem Assessment programme",
    "authors": [
        "Sarah Adcock",
        "David Jones"
    ],
    "categories": [
        "Local Nature Recovery Strategies",
        "Nature",
        "NCEA programme",
        "Research and data analysis",
        "Wetland"
    ],
    "pub_date": "2024-03-28T12:00:21+00:00",
    "content": [
        {
            "text": "We are Senior Responsible Owners for Defra’s Natural Capital and Ecosystem Assessment programme. In this post, we explain why building a picture of our natural assets and their benefits is the first, crucial step in protecting our environment. "
        },
        {
            "text": "The UK Government has an ambition to leave our environment in a better state for future generations, but that raises a question – what state is it in now? Enter Defra’s biggest Research & Development programme in England to date: the Natural Capital and Ecosystem Assessment (NCEA) programme.  "
        },
        {
            "text": "NCEA is undertaking a nationwide survey of England’s land, coast, and sea.  This is so we can understand how best to protect and enhance our environment, halt the decline in biodiversity, and adapt to and mitigate against climate change. "
        },
        {
            "text": "By mapping the locations of our natural assets, the benefits they provide – whether that be environmental, economic or societal - and the pressures they are facing, we can make better decisions that take all this into account. "
        },
        {
            "text": "For example, our wetlands provide a huge range of services. They sequester carbon, reduce pollutants, provide  flood protection,  natural habitats, and a space for us to visit and enjoy. Knowing where our wetland environments are, and their condition, means we can make smarter decisions about how to protect or restore them.  "
        },
        {
            "text": "NCEA will transform environmental decision-making in England by generating a holistic picture of the state of our natural environment, which has not been done before.  "
        },
        {
            "text": "It’s no small feat. According to the latest figures from the Office for National Statistics, the total asset value of natural capital in England was an estimated £1.4 trillion in 2020. That is 78% of the total UK asset value, but this doesn’t begin to capture the full value we place on it.  "
        },
        {
            "text": "Counting nature "
        },
        {
            "text": "The NCEA programme is collecting data across different habitat types to develop a baseline of natural capital evidence and enable us to monitor changes over time. These habitats range from forests, peatland and freshwater lakes to offshore seabeds.  "
        },
        {
            "text": "We are also collecting data on the species that live there.  "
        },
        {
            "text": "By March 2025, we will have made significant contributions to England’s natural capital evidence baseline, including: "
        },
        {
            "text": "And we’re also discovering things we didn’t expect – like a new species of UK earthworm! "
        },
        {
            "text": "How does NCEA gather this evidence? "
        },
        {
            "text": "We are combining remote sensing (such as satellite and aerial photography) with boots-on-the-ground professional and citizen science field surveying. "
        },
        {
            "text": "And to ensure we have robust data sets, NCEA is capitalising on new technology and innovative systems, such as autonomous underwater vessels (including the now famous Boaty McBoatface!), environmental DNA and acoustic surveying (for species such as bats and marine mammals). "
        },
        {
            "text": "NCEA is working in partnership with Defra’s arms-length bodies to build this evidence, as well as with other government departments, industry, academia, NGOs, and – through citizen science initiatives – the public.  "
        },
        {
            "text": "How will this improve environmental decision-making?  "
        },
        {
            "text": "The NCEA evidence and analysis will feed into the development, monitoring and evaluation of key government policies and interventions. These include Biodiversity Net Gain and Marine Net Gain, the Environmental Land Management schemes, Fisheries Management Plans and Local Nature Recovery Strategies.  "
        },
        {
            "text": "NCEA data will feed into Environment Act targets on species status and abundance in England, creating habitats outside of protected sites, reducing pollution by agriculture and improving woodland cover, and UK Marine Strategy targets to achieve Good Environmental Status in UK seas.  "
        },
        {
            "text": "More information "
        },
        {
            "text": "If you’re interested in understanding more about what we’re doing, read more on our NCEA GOV.UK page.  "
        },
        {
            "text": "If you have any questions, please get in touch with us. Email the terrestrial team (including freshwater) or email the marine team.￼ "
        },
        {
            "text": "For more stories like this, please subscribe to the Environment blog to receive an email whenever we publish a new post."
        }
    ]
}