{
    "url": "https://dfedigital.blog.gov.uk/2025/07/16/creating-3-principles-of-informed-consent-for-user-research/",
    "title": "Creating 3 principles of informed consent for user research",
    "authors": [
        "DfE User research informed consent group"
    ],
    "categories": [
        "Accessibility",
        "Collaboration",
        "Community of Practice",
        "Cross-government",
        "digital inclusion",
        "neurodiversity",
        "user research",
        "User-centred design"
    ],
    "pub_date": "2025-07-16T11:19:53+01:00",
    "content": [
        {
            "text": "Informed consent is a process where an individual makes a choice whether to take part in research. They make this choice after a user researcher gives them information about what the research is about."
        },
        {
            "text": "Informed consent involves both communicating what participation involves but also making sure the form of communication and any paperwork are accessible to participants."
        },
        {
            "text": "Gaining informed consent can be a daunting task for user researchers depending on their level of experience and the complexity of the project."
        },
        {
            "text": "To help with this, the Department for Education (DfE) user research informed consent working group has created 3 principles:"
        },
        {
            "text": "In this blog post, we cover: "
        },
        {
            "text": "If you want to know more about using the 3 principles, you can view them in this slide-pack that you can share with colleagues:"
        },
        {
            "text": "Informed consent guiding principles slide-deck"
        },
        {
            "heading": 2,
            "text": "The informed consent working group"
        },
        {
            "text": "In 2024, a group of DfE user researchers formed a working group to find better ways to approach informed consent. We were inspired by a talk given to our UR community by Katherine Smales from University College London, about an innovative approach she used for research with young children."
        },
        {
            "text": "In our working group, we identified that:"
        },
        {
            "text": "To reflect this, we created the following problem statement:"
        },
        {
            "text": "How can we ensure that DfE URs and relevant colleagues understand how to always inform participants and gather their consent in appropriate ways? And what kinds of guidance, support or tools are needed to help with this?"
        },
        {
            "heading": 2,
            "text": " How we developed the principles"
        },
        {
            "text": "Inclusivity and accessibility were central to our approach. We began with desk research focused on the needs of participants, including those with access needs, or young children."
        },
        {
            "text": "A key insight from our research was that there is no one-size-fits-all approach, especially since participants may have many overlapping needs. We developed flexible guiding principles which:"
        },
        {
            "text": "We then created a prototype slide-pack based on our findings and conducted 2 rounds of user testing with URs:"
        },
        {
            "text": "We also sought feedback from DfE’s user research community Ethics Forum and our Inclusive User Research working group. The principles went through two major iterations before the version we’re sharing today. "
        },
        {
            "heading": 2,
            "text": "Using the principles"
        },
        {
            "text": "You can view the slide-pack and share it with colleagues."
        },
        {
            "text": "The guiding principles are a supportive tool rather than a rigid checklist. We hope that they will help URs and anyone else involved in research to navigate diverse contexts.  They can use this pack when planning how they will gather informed consent. They can also use it to develop or review their knowledge of informed consent. "
        },
        {
            "text": "The pack includes: principles, their definition, explanations about why they matter, real case studies, tips for planning and delivering informed consent."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The principles are a strong foundation. But our research revealed URs need practical tools to apply them. For example, they might need more support to identify situations where different forms of informed consent are needed, or to create tools like picture-based information sheets."
        },
        {
            "text": "Over the coming months, we’ll be developing a toolkit to address this need. The toolkit's purpose is to help user researchers apply the principles."
        },
        {
            "text": "Thank you"
        },
        {
            "text": "We thank all our past and present members: Imran Akhtar, Elena Bracey, Heather Bramwell, Katie Carnie, Solène Heinzl (project co-ordinator and Informed Consent working group lead), Rosalie Lord, Latifa Mahdi, Nataliya Mykhalchenko, Lucy Sutton and Denny Vlaeva. We thank Arrun Gaydhani and Rob Dale for their helpful contributions, and Tom Adams, head of user research at DfE, for his helpful guidance throughout the process. Last but not least, we are grateful to all the URs who engaged with us. These principles would not exist without you. We hope you’ll find it as interesting to engage with our future work. "
        }
    ]
}