{
    "url": "https://defrafmp.blog.gov.uk/2025/07/16/dive-into-fmps-a-look-at-governance-in-fisheries-management-plans/",
    "title": "Dive into FMPs: a look at governance in fisheries management plans",
    "authors": [
        "Nicola Lewellen - FMP Engagement and Communications"
    ],
    "categories": [
        "- Defra led FMPs"
    ],
    "pub_date": "2025-07-16T16:03:02+01:00",
    "content": [
        {
            "text": "As we progress with our fisheries management plans (FMP) journey we want to help you understand how the plans are delivered. "
        },
        {
            "text": "This is the first post in a three-part series to dive into FMPs. I hope that it helps you understand who does what, and how and when the valuable information, views, and opinions from experts and stakeholders are brought in. "
        },
        {
            "text": "Part two will look at our partners and experts and part three will explore stakeholder engagement and some of the groups and forums that we lead or collaborate with. "
        },
        {
            "text": "In this post, we'll look at our overarching programme governance. "
        },
        {
            "text": "We'll cover who's in charge, how decisions are made, and how risks are managed. Having a solid governance structure is crucial for keeping things running smoothly and ensuring that all our hard work pays off in the end. "
        },
        {
            "text": "First, I’ll start by explaining the terms mentioned above. "
        },
        {
            "heading": 2,
            "text": "What is the FMP ‘programme’? "
        },
        {
            "text": "A programme is the coordinated management of multiple projects that work together to deliver strategic, or long-term, outcomes and benefits. "
        },
        {
            "text": "The FMP programme consists of projects delivering Defra’s 15 FMPs which aim to meet the objectives set out in the Joint Fisheries Statement with the shared ambition of delivering world class, sustainable management of our sea fisheries and aquaculture across the UK, and to play our part in supporting delivery of this globally. "
        },
        {
            "heading": 2,
            "text": "What is governance? "
        },
        {
            "text": "Programme governance leads the way we work. It’s the framework or structure that gives our work direction and keeps our programme on track, giving clear leadership, clear decision-making processes and accountability at every level.  "
        },
        {
            "text": "Whether its managing risks, making sure we have a suitable resource allocation or keeping stakeholders engaged, it’s necessary to keep things efficient and successful. "
        },
        {
            "text": "Within FMPs, our governance makes sure that our work is aligned with Defra's strategy and goals. It helps us to safeguard and balance stakeholder interests and helps us be compliant with the law and reduce risks. "
        },
        {
            "heading": 2,
            "text": "FMP Programme Board "
        },
        {
            "text": "At the head of our governance structure is the Board which provides direction, oversight, and accountability. "
        },
        {
            "text": "It gives long-term strategic leadership and makes decisions around the prioritisation of work and resources to ensure that the programme delivers high-quality FMPs.  "
        },
        {
            "text": "It also makes sure that the work being done is aligned within the Defra group and helps us to manage any potential risks and issues.  "
        },
        {
            "text": "Members of the board include senior representatives from: "
        },
        {
            "text": "Other members and subject matter experts are invited to support and advise the board when needed. "
        },
        {
            "text": "The following groups take a strategic long-term vision but also directly support the day-to-day delivery of FMP work. "
        },
        {
            "heading": 2,
            "text": "Programme Management Group "
        },
        {
            "text": "This group reports on the progress of FMP development and supports the design and publication of plans through lessons learned and risk management.  "
        },
        {
            "text": "Members include Defra policy teams, delivery partners and experts from MMO, Cefas, AIFCA and Seafish, JNCC and Natural England as well as ICF who is evaluating the programme.  "
        },
        {
            "text": "We will talk about our delivery partners and projects in our next post of this series. "
        },
        {
            "heading": 2,
            "text": "Implementation Delivery Group "
        },
        {
            "text": "This group, with members from Defra, MMO and AIFCA, tracks the delivery of the goals in the published FMPs and identifies and acts on any barriers to make sure things are moving on as planned.  "
        },
        {
            "heading": 2,
            "text": "Engagement and Communications Group "
        },
        {
            "text": "This group brings together people responsible for FMP engagement and communications from across Defra’s policy teams and delivery partners. The group works to coordinate activities across the projects in the programme and takes a long-term approach to planning. "
        },
        {
            "heading": 2,
            "text": "Working on joint plans "
        },
        {
            "text": "Defra is the ‘coordinating authority’ responsible for preparing and publishing 15 of the 43 FMPs. We work alongside the other ‘fisheries policy authorities ‘- Northern Ireland, Scotland and Wales, on joint plans where one or more of the authorities work on them together.  "
        },
        {
            "text": "We hold regular meetings with the other authorities to keep on track with progress towards delivering our joint plans. This mainly takes place through monthly meetings with a working group, where Defra policy officials work closely with their counterparts to support the preparation of these FMPs.  "
        },
        {
            "text": "See who is responsible for FMPs on the full list of FMPs  "
        },
        {
            "text": "Keep an eye on the blog or subscribe to be notified of the next two posts in this series. "
        }
    ]
}