{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/07/16/publishing-the-second-year-of-inclusion-data/",
    "title": "Publishing the second year of inclusion data",
    "authors": [
        "Katie Sunley"
    ],
    "categories": [
        "Digital identity",
        "Inclusion"
    ],
    "pub_date": "2025-07-16T10:37:03+01:00",
    "content": [
        {
            "text": "Today, we’ve published the findings from the second annual digital identity inclusion monitoring report. The report helps to monitor inclusion and accessibility in the certified digital identity market over time. You can read the full report on GOV.UK. "
        },
        {
            "text": "The government wants to ensure that anyone who chooses to use a digital identity can use one. This means that digital identities should be inclusive and accessible to as many people as possible. To achieve this, we need to understand how inclusive services are and whether intervention may be useful. "
        },
        {
            "heading": 2,
            "text": "How we collect information on inclusion "
        },
        {
            "text": "The government’s rules for digital verification services, the UK digital identity and attributes trust framework, outlines how organisations can ensure that their services are inclusive by encouraging them to adopt inclusive and accessible practices. Services that are certified against the trust framework must also complete an inclusion monitoring survey. "
        },
        {
            "text": "The inclusion monitoring survey consists of around 40 questions covering topics such as documentation and evidence, accessibility, data collection, and biometrics. The survey responses are anonymous and individual services are not assessed. Instead, the results are aggregated to gain insights on the extent to which services in the certified market are inclusive and accessible. The survey captures data from a fixed point in the year.   "
        },
        {
            "heading": 2,
            "text": "Key findings "
        },
        {
            "text": "The findings of the report suggest modest improvements from last year’s results in several areas. For example: "
        },
        {
            "text": "We also added a few new questions to the survey, which provide further insight on the types of services offered: "
        },
        {
            "heading": 2,
            "text": "Limitations of the survey "
        },
        {
            "text": "The survey is completed by certified services, so the results don’t reflect the whole market. As the survey is completed by organisations, the survey doesn’t collect information from the perspective of users. "
        },
        {
            "text": "There are also broader factors that can affect people’s ability to access digital identity services, such as lack of connectivity, lack of access to devices, or low digital skills. Monitoring these factors is not in scope of this survey. However, tackling these wider digital inclusion issues is a priority for the Government and information on this can be found in the Digital Inclusion Action Plan. "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "It’s encouraging to see small improvements have been made since the findings from last year, and we hope this trend will continue. By the time of the next survey, some services will be certified against the latest version of the trust framework, which includes increased requirements in areas such as accessibility and biometric testing. "
        },
        {
            "text": "In the meantime, we will continue to use the findings to inform our development of the trust framework and inclusion policy more broadly. "
        }
    ]
}