{
    "url": "https://insidehmcts.blog.gov.uk/2025/07/16/putting-children-first-my-work-in-family-public-law/",
    "title": "Putting Children First: My Work in Family Public Law",
    "authors": [
        "Suzanne Lawton, CTSC Operations Manager, Family Public Law, Private Law and Family Legacy Telephony"
    ],
    "categories": [
        "Family",
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2025-07-16T13:00:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Family Public Law is any case that requires state intervention for a child under 17 years old. We handle cases relating to children's safety, safeguarding and welfare."
        },
        {
            "text": "Every single case is different. From the first day that new advisors join our team, we emphasise one critical point, there's a child at the heart of every application. Everything we do relates to a child with individual needs."
        },
        {
            "text": "My team will always go the extra mile with their cases because they know they're dealing with a baby, a toddler, or a child who's had a difficult start in life for a variety of reasons. My team are very conscious of this responsibility and will do everything they can to help achieve the right outcome."
        },
        {
            "heading": 2,
            "text": "Supporting families through difficult times"
        },
        {
            "text": "There are many reasons why a Family Public Law application may be made. It could be because a child is suffering abuse or neglect, or there might be parental substance issues requiring children to be removed from that environment. Sometimes, parents are caring for children with difficult medical conditions and are struggling to cope."
        },
        {
            "text": "Local authority applications are not always because of abuse or neglect, sometimes parents are simply struggling and need guidance and help. Our role is to do what we can to support everyone involved in that child’s care. This includes the Children and Family Court Advisory and Support Service (Cafcass), the local authority and the judge hearing the case. We will give them the information they need, in a timely way so that decisions can be made effectively.  "
        },
        {
            "text": "By doing this, we ensure the needs of the individual child are always put first."
        },
        {
            "heading": 2,
            "text": "Digital transformation improving our responsiveness"
        },
        {
            "text": "Currently, we have 82 people in our team, and we handle every case in England and Wales. All applications are now digitalised and we manage cases starting with those that are the highest priority. Priority is based largely on potential risks to the child or, if there is a hearing scheduled to be held within the next 24 hours and action is required before the case is heard."
        },
        {
            "text": "My role is to ensure our service is running effectively – monitoring how many cases we're covering each week and making sure that we handle them within appropriate timescales. Some of the cases can at times be a difficult read so it’s important that staff take regular breaks and talk to their managers when they need to, and we also have regular checks on our wellbeing. Although there are many sad stories, our roles are helping to support better outcomes for children that need assistance through the court."
        },
        {
            "heading": 2,
            "text": "Rebuilding personal connections in a digital age"
        },
        {
            "text": "As we now communicate through a digital system, remote from the local courts, we want to ensure that we don’t lose that personal touch. In February we set up an engagement project where we reached out to each of the 42 regional Designated Family Judges, giving them a single point of contact, ensuring they are always kept up to date."
        },
        {
            "text": "To date we have heard back from 35 of those judges, and they have all been extremely positive and enthusiastic, wanting to work with us to maintain supportive and strong relationships. We now work in partnership with the judges to identify and deal with any issues in local regions when they arise. We also have quarterly calls to listen to feedback and also share information about system improvements."
        },
        {
            "text": "We also visit local courts so that we can continually improve the way we work and share information. This helps bring Service Centres and local courts together and helps us achieve that single goal of keeping the child at the centre of what we do. Later this summer, we'll be implementing a similar process with local authorities to improve information sharing."
        },
        {
            "text": "I firmly believe a service can only be as good as the information you're given. We all need to work together to deliver the best outcomes for children."
        },
        {
            "heading": 2,
            "text": "The human element remains central"
        },
        {
            "text": "Over the years, we've got busier, but having real-time data makes trends much easier to spot and plan for. For example, we know there will be more cases after school holidays, like Easter and Christmas, so we’re able to put a plan in place to meet additional demand."
        },
        {
            "text": "One of the first things we've learned in our job is that we're not dealing with just a piece of paper – we're dealing with a child. That makes our mindset different, and we're very proud to be working in a service that ensures that every child receives the attention, care and access to justice they deserve."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Rhoi Plant yn Gyntaf: Fy Ngwaith ym maes Cyfraith Gyhoeddus Teulu"
        },
        {
            "text": "Cyfraith Gyhoeddus Teulu yw unrhyw achos sydd angen ymyrraeth wladol ar gyfer blentyn o dan 17 oed. Rydym yn delio gydag achosion sy’n ymwneud â diogelwch plant, diogelu a lles."
        },
        {
            "text": "Mae pob un achos yn wahanol. O’r diwrnod cyntaf mae cynghorwyr newydd yn ymuno â’n tîm, rydym yn pwysleisio un pwynt hanfodol, mae plentyn wrth wraidd pob cais. Mae popeth rydym yn ei wneud yn ymwneud â phlentyn ag anghenion unigol."
        },
        {
            "text": "Mae fy nhîm bob amser yn mynd yr ail filltir gyda’u hachosion gan eu bod yn gwybod eu bod yn delio gyda babi, plentyn bach neu blentyn sydd wedi cael dechrau anodd i’w bywyd am amryw o resymau. Mae fy nhîm yn ymwybodol iawn o’r cyfrifoldeb hwn a byddant yn gwneud popeth y gallant i helpu i gael y canlyniad iawn."
        },
        {
            "heading": 2,
            "text": "Cefnogi teuluoedd drwy cyfnodau anodd"
        },
        {
            "text": "Mae yna nifer o resymau pam y gwneir cais Cyfraith Gyhoeddus Teulu. Gallai fod oherwydd bod plentyn yn dioddef camdriniaeth neu esgeulustod, neu gall fod sefyllfa ble mae rhieni yn camddefnyddio sylweddau, sy’n ei wneud yn ofynnol i symud y plentyn o’r amgylchedd hwnnw. Weithiau, mae rhieni yn gofalu am blant wrth ddioddef cyflwr meddygol heriol ac yn ei chael hi’n anodd ymdopi."
        },
        {
            "text": "Nid yw ceisiadau gan awdurdod lleol bob amser oherwydd cam-drin neu esgeulustod, weithiau mae rhieni yn ei chael hi’n anodd ac angen arweiniad a chymorth. Ein rôl yw gwneud yr hyn y gallwn i gefnogi pawb sy’n ymwneud â gofal y plentyn hwnnw. Mae hyn yn cynnwys y Gwasanaeth Cynghori a Chynorthwyo Llys i Blant a Theuluoedd (CAFCASS), yr awdurdod lleol a’r barnwr sy’n gwrando’r achos. Byddwn yn rhoi’r wybodaeth maent ei hangen iddynt, mewn modd amserol fel y gellir gwneud penderfyniadau yn effeithiol."
        },
        {
            "text": "Drwy wneud hyn, rydym yn sicrhau bod anghenion y plentyn unigol bob amser yn cael eu rhoi’n gyntaf.  "
        },
        {
            "heading": 2,
            "text": "Trawsnewid digidol yn gwella ein hymatebolrwydd"
        },
        {
            "text": "Ar hyn o bryd, mae gennym 82 o bobl yn ein tîm, ac rydym yn delio gyda phob achos yng Nghymru a Lloegr. Mae pob cais bellach wedi’u digideiddio, ac rydym yn rheoli achosion gan ddechrau gyda’r rhai â’r flaenoriaeth uchaf. Mae blaenoriaeth yn seiliedig yn bennaf ar risgiau posibl i’r plentyn, neu os bydd gwrandawiad wedi’i drefnu i gael ei gynnal o fewn y 24 awr nesaf a bod angen cymryd camau cyn i’r achos gael ei wrando."
        },
        {
            "text": "Fy rôl i yw sicrhau bod ein gwasanaeth yn rhedeg yn effeithlon – rwy’n monitro sawl achos rydym yn delio â nhw bob wythnos ac yn sicrhau ein bod yn delio â nhw o fewn amserlenni priodol. Gall rhai o’r achosion ar adegau fod yn anodd i’w darllen, felly mae’n bwysig bod staff yn cymryd seibiant rheolaidd ac yn siarad gyda’u rheolwyr pan fyddant angen, ac rydym hefyd yn cynnal gwiriadau lles yn rheolaidd. Er bod yna nifer o straeon trist, mae ein rolau yn helpu i gefnogi canlyniadau gwell i blant sydd angen cymorth drwy’r llys."
        },
        {
            "heading": 2,
            "text": "Ailddatblygu cysylltiadau personol mewn oes ddigidol"
        },
        {
            "text": "Gan ein bod bellach yn cyfathrebu drwy system ddigidol, o bell o’r llysoedd lleol, rydym eisiau sicrhau nad ydym yn colli’r cyswllt personol. Ym mis Chwefror, gwnaethom sefydlu prosiect ymgysylltu ble wnaethom gysylltu â phob un o’r 42 Barnwr Teulu Dynodedig rhanbarthol, gan roi un pwynt cyswllt iddynt, a sicrhau eu bod bob amser yn derbyn y wybodaeth ddiweddaraf."
        },
        {
            "text": "Hyd yma, rydym wedi clywed yn ôl gan 35 o’r barnwyr hynny, ac maent i gyd wedi bod yn hynod gadarnhaol a brwdfrydig, ac maen nhw eisiau gweithio gyda ni i gynnal perthnasoedd cefnogol a chadarn. Rydym bellach yn gweithio mewn partneriaeth gyda’r barnwyr i nodi a delio gydag unrhyw faterion mewn rhanbarthau lleol pan fyddant yn codi. Rydym hefyd yn cynnal galwadau chwarterol i wrando ar adborth ac i rannu gwybodaeth am welliannau i systemau."
        },
        {
            "text": "Rydym hefyd yn ymweld â llysoedd lleol fel y gallwn barhau i wella’r ffordd yr ydym yn gweithio ac yn rhannu gwybodaeth. Mae hyn yn helpu i ddod â’r Canolfannau Gwasanaethau a llysoedd lleol ynghyd, a’n helpu i gyflawni’r un nod o gadw’r plentyn wrth wraidd yr hyn rydym yn ei wneud. Yn ddiweddarach yr haf hwn, byddwn yn gweithredu proses debyg gydag awdurdodau lleol i wella prosesau rhannu gwybodaeth."
        },
        {
            "text": "Rwy’n credu’n gryf y gall gwasanaeth ond bod cystal â’r wybodaeth a roddir i chi. Rydym i gyd angen gweithio gyda’n gilydd i gyflawni’r canlyniadau gorau i blant."
        },
        {
            "heading": 2,
            "text": "Mae’r elfen ddynol yn parhau’n ganolog"
        },
        {
            "text": "Dros y blynyddoedd, rydym wedi prysuro, ond mae cael data amser real yn ei wneud yn haws adnabod tueddiadau a chynllunio ar eu cyfer. Er enghraifft, rydym yn gwybod y bydd mwy o achosion ar ôl gwyliau’r ysgol, fel y Pasg a’r Nadolig, felly rydym yn gallu rhoi cynllun ar waith i ymdrin â’r galw ychwanegol."
        },
        {
            "text": "Un o’r pethau cyntaf rydym wedi’i ddysgu yn ein gwaith ni yw nad ydym yn delio gyda darn o bapur yn unig – rydym yn delio gyda phlentyn. Mae hynny’n gwneud i ni feddwl yn wahanol, ac rydym yn falch iawn o weithio mewn gwasanaeth sy’n sicrhau bod pob plentyn yn derbyn y sylw, y gofal a’r mynediad at gyfiawnder maent yn ei haeddu."
        }
    ]
}