{
    "url": "https://dcmslibraries.blog.gov.uk/2025/07/16/rediscovering-libraries-new-insights-on-engaging-non-users/",
    "title": "Rediscovering libraries: new insights on engaging non-users",
    "authors": [
        "Glenn Gottfried, Associate Director, Ipsos"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2025-07-16T13:30:58+01:00",
    "content": [
        {
            "heading": 5,
            "text": "Editor’s Note: "
        },
        {
            "text": "Libraries have long been essential parts of our communities, offering free access to knowledge, resources, and shared spaces. However, recent decades have seen a concerning decline in library engagement across England. With two-thirds of adults (66%) not having used a library in the past year, understanding why people aren't engaging with libraries and how to attract them back is crucial."
        },
        {
            "text": "In November 2024, Ipsos blogged for us on an initial qualitative piece of research work which started to look at the barriers to library use and how to encourage engagement. Last week DCMS published the next phase of this work, a comprehensive quantitative report exploring the barriers to library use and potential strategies for re-engagement. The report offers valuable insights for policymakers, library staff, and the general public alike."
        },
        {
            "text": "Barriers to library use"
        },
        {
            "text": "The research, conducted by Ipsos UK, surveyed 4,243 library non-users aged 17 and over, across England in January 2025 using our online random probability Knowledge Panel. It reveals several key barriers that prevent people from using libraries. They can be grouped into three main categories using the COM-B framework (a framework from behavioural science that helps us understand why people do or do not engage in certain behaviours). They are Capability (awareness and skills), Opportunity (external factors enabling or hindering use), and Motivation (personal reasons for or against using libraries)."
        },
        {
            "text": "We used a technique called Maximum Difference Scaling (MaxDiff) to understand the relative importance of different barriers to library use. In this analysis, respondents were asked to compare different reasons for not using libraries and choose which were the biggest and smallest barriers for them personally. The resulting scores range from 0 to 100, with higher scores indicating a higher likelihood of that barrier being chosen as important."
        },
        {
            "heading": 4,
            "text": "Services with potential to re-engage non-users"
        },
        {
            "text": "Despite the barriers mentioned above, the research uncovered several services that could potentially draw non-users back to libraries:"
        },
        {
            "text": "Different services appeal more strongly to specific demographics. For example, just over half (53%) of 17-24 year olds selected dedicated work and study spaces as a factor that would encourage them to use their local library. This suggests that libraries could potentially attract younger users by positioning themselves as alternative workspaces."
        },
        {
            "text": "Meanwhile, good parking facilities were particularly important for those aged 65 and above (29% compared to 23% overall), highlighting the need to consider accessibility for older users. For parents, especially those with children aged 0-4, an engaging programme of activities and events for children was a significant draw (43% compared to 31% of parents overall)."
        },
        {
            "text": "These findings demonstrate the importance of tailoring library services to meet the diverse needs of different community segments."
        },
        {
            "heading": 5,
            "text": "Segmentation of library non-users"
        },
        {
            "text": "The research identified five distinct segments of library non-users, each with unique characteristics and potential for re-engagement:"
        },
        {
            "text": "Armchair Supporters (24% of non-users): Hold positive views of libraries but don't personally engage or use them. They tend to be older, from higher socioeconomic backgrounds, and living in less deprived areas. While they value libraries in theory, they may not see the personal relevance."
        },
        {
            "text": "Digital & Community Seekers (25%): Value libraries as community hubs but seek greater digital integration and convenience. They are more likely to be female, younger, from ethnic minority backgrounds, and working full-time. This group sees potential in libraries but needs services that align with their digital-first lifestyles."
        },
        {
            "text": "The Disengaged (23%): Show low awareness of library offerings and feel a lack of personal relevance. They are more likely to be male, older, non-graduates, and from lower socioeconomic backgrounds. Engaging this group may require fundamental shifts in how libraries communicate their value."
        },
        {
            "text": "Dismissive Non-Users (9%): Hold deeply negative perceptions of libraries and strongly resist engagement. They are more likely to be men, younger, from lower socioeconomic backgrounds, and lack confidence in using the internet. This group presents the biggest challenge for engagement."
        },
        {
            "text": "Enthusiastic Adopters (19%): Hold overwhelmingly positive attitudes towards libraries and show the greatest potential for engagement. They are more likely to be women, not working full-time, graduates, and from higher socioeconomic backgrounds. This segment represents a prime opportunity for libraries to convert positive sentiment into active usage."
        },
        {
            "text": "Understanding these segments can help libraries tailor their outreach and services to effectively address the needs and preferences of different groups."
        },
        {
            "heading": 6,
            "text": "Interventions to consider"
        },
        {
            "text": "Based on these findings, and workshops conducted by Ipsos with frontline library staff the report suggests three interventions for libraries to consider:"
        },
        {
            "text": "These interventions would need to be tailored to specific audiences, local demographics, or segments where possible to facilitate implementation in practice. An implementation approach involving monitoring and adaptation would also be required."
        },
        {
            "text": "The findings from this report commissioned by DCMS offer a wealth of insights for libraries seeking to re-engage non-users. By understanding the barriers that prevent people from using libraries, the services that could attract them back, and the distinct segments of non-users, libraries can develop targeted strategies for increasing engagement. As libraries continue to evolve in the digital age, these insights will be crucial in ensuring they remain vital community resources for years to come."
        },
        {
            "text": "We would like to thank respondents and library staff for taking the time to share their experiences and views with us, helping us understand how to build future library engagement."
        },
        {
            "text": "The full report can be found here and was published alongside a Written Ministerial Statement in the Houses of Parliament.  "
        },
        {
            "text": "We will be hosting an online presentation of the results to Libraries Connected on Wednesday 20th August at 3:00pm. This presentation will provide an opportunity for library professionals to delve deeper into the research and explore how these insights can be applied to their own services and communities."
        }
    ]
}