{
    "url": "https://defradigital.blog.gov.uk/2022/11/15/a-breakthrough-year-for-digital-sustainability/",
    "title": "A breakthrough year for digital sustainability",
    "authors": [
        "Chris Howes, Chief Digital and Information Officer"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2022-11-15T07:30:25+00:00",
    "content": [
        {
            "text": "This year has been a transformative period for sustainable ICT, and the publication this week of the 2021-22 Greening Government ICT report marks the latest milestone on our important journey."
        },
        {
            "text": "Defra Digital, Data and Technology Services (DDTS) have been instrumental to the publication of key documentation across government, to ensure that being sustainable is no longer seen as a nice to have but is necessary and vital in the delivery of our government digital services. Key documents include:"
        },
        {
            "text": "Our government role in leading supplier relationships on this topic has also gone from strength to strength through our breakthrough event at COP26 called Technology for Climate Action. This is where 2,000 stakeholders, CEOs and senior leaders from a range of technology companies came together to discuss how they could best help reduce the harmful impact industrialisation is having on the environment. We have continued this work throughout 2021/22 and I look forward to updating you on our progress after COP27 following the launch of our Government Digital Sustainability Alliance (GDSA)."
        },
        {
            "text": "This work is governed and managed by our Sustainable Technology Assurance and Reporting (STAR) team. A group of around 80 empowered digital sustainability experts from across government departments, agencies and bodies supported by academia, charities and the technology sector which we chair."
        },
        {
            "heading": 2,
            "text": "The Greening Government ICT Annual report 2021/22"
        },
        {
            "text": "Each year we run the greening government ICT annual report to capture valuable data regarding progress on this topic in the form of carbon footprint, end of life, policy and strategy data. This years report captures more and better data than ever before."
        },
        {
            "text": "Performance highlights include:"
        },
        {
            "text": "The data behind this is vast and available to all members of the STAR to help them make informed decisions about legacy transformation, migration to the cloud and better management of resource. This data is also provided to the Cabinet Office through the Central Digital and Data Office (CDDO)."
        },
        {
            "text": "Technology won’t solve everything though. Minimising climate change will require massive behavioural and societal changes. So, we need a greater focus on how technology and data can help drive that. Our partnerships with industry are a vital component to increasing access to vital data needed by our DDaT professionals to design and deliver sustainable ICT and digital services."
        },
        {
            "text": "My thanks must go to many industrious thought leaders on sustainable ICT that formed and pushed this group and its work into the mainstream. We have been proud to be at the vanguard of this increasingly crucial topic and look forward to engaging internationally to ensure that ICT and Digital services are part of the solution, and not part of the problem."
        }
    ]
}