{
    "url": "https://food.blog.gov.uk/2022/11/15/cost-of-living-supporting-food-charities-and-businesses-to-deliver-food-you-can-trust/",
    "title": "Cost of living: supporting food charities and businesses to deliver food you can trust",
    "authors": [
        "Katie Pettifer, Director of Strategy and Regulatory Compliance"
    ],
    "categories": [
        "Business guidance",
        "Our mission"
    ],
    "pub_date": "2022-11-15T10:23:13+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "So many people in our society are facing a huge challenge this winter, with increases in the cost of living. On a recent visit to Fareshare’s North East warehouse in Newcastle, I saw first-hand the amazing work that’s being done to help provide food to local communities."
        },
        {
            "text": "It was fascinating to learn about how food comes to them and their strong focus on reducing waste – they’re keen to use whatever would otherwise be wasted in the food system, from fresh veg to frozen curries. And they are also working to strengthen community resilience through projects like community kitchens, rather than just handing out food parcels."
        },
        {
            "text": "I was there as part of an FSA Board visit to learn more about community food provision, and to better understand what’s happening on the ground when it comes to community cooking and food banks."
        },
        {
            "heading": 2,
            "text": "What we know"
        },
        {
            "text": "Part of the FSA’s job is to collect evidence on all aspects of food to inform our work and the work of wider government. We’ve collected data on household food security and food bank usage in England, Wales and Northern Ireland through our flagship consumer survey, Food and You 2, which has been conducted twice a year since 2020."
        },
        {
            "text": "Since the start of the pandemic we have also been tracking people’s behaviours and concerns more regularly through our monthly consumer insights tracker. We’ve recently begun publishing monthly bulletins of our consumer insight tracker data. The most recent bulletin, published today (15 November 2022), says:"
        },
        {
            "text": "At the FSA we don’t regulate food prices. We are well aware that the causes of rising food costs are complex and go considerably beyond our remit. But these experiences people are reporting to us – and similar challenges we’re hearing from businesses about rising costs – are critically relevant to our work as a regulator, and to our mission to make sure people have food they can trust."
        },
        {
            "text": "Food banks are not the long-term answer to the growing issue of people struggling to afford food, but the reality today is that they are a food source for an increasing number of people. Food banks and food redistribution charities can be an incredibly important and trusted lifeline in communities to ease people through these challenging times. They can also play a very important part in reducing the amount of food we waste."
        },
        {
            "text": "With FSA data showing the increase in food bank usage, we decided to work with charities and businesses to ensure that donating food and redistributing it is as straightforward as possible. We won’t compromise on food safety – everyone should have food that is safe to eat – but we can make it easier for both those who work for food charities and those who use them to follow best practice for storing, preparing, and cooking food."
        },
        {
            "heading": 2,
            "text": "New guidance to help community food charities"
        },
        {
            "text": "People working in food banks, community pantries and other community food redistribution schemes care passionately about trying to do the right thing for their local communities. They've been telling us that they are sometimes a bit anxious about how they can keep food safe - how long can people eat food past its best-before date, can they freeze food to make it last longer? Some smaller, independent food banks are opening up who do not always have experience of operating within the food industry and so are less familiar with food hygiene and safety requirements."
        },
        {
            "text": "There’s already lots of information out there but it became clear that it wasn’t easy for people to access and use. So for the first time, we have created dedicated guidance specifically targeted to support food aid charities to avoid confusion around what they need to do to ensure they keep food safe. This new guidance gathers our relevant advice and rules in one place to make it easier for charities to understand what they need to do to get safe food to people who need it. Our thanks go to FareShare, the Independent Food Aid Network UK (IFAN) and the Waste and Resources Action Programme (WRAP) for testing the guidance to ensure it would meet the needs of those it was designed to help."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We’ll keep reviewing our policies to reflect the changing environment consumers are living in, as well as protecting the interests of consumers in relation to food. We’ll also continue to monitor food affordability and people’s food security via our consumer tracker, to continue to provide an objective insight for policy-makers and others working on these challenges. We have committed to publishing this information in a monthly update."
        },
        {
            "text": "There’s more work to do on ensuring good food goes to people who need it and on cutting food waste. WRAP estimate that between 2015 and 2020, they probably managed to stop about 300,000 tonnes of food being wasted by redistributing it. But there's still another 200,000 tonnes of food which is safe to eat, but which is currently being wasted."
        },
        {
            "text": "Working with industry, government and charitable organisations we’ll continue to examine and improve the regulatory landscape for food banks and donors, making sure that rules and guidance are proportionate, effective and supportive of the good work already being done."
        },
        {
            "heading": 1,
            "text": "Costau byw: cefnogi elusennau a busnesau bwyd i ddosbarthu bwyd y gallwch ymddiried ynddo"
        },
        {
            "text": "Mae cymaint o bobl yn ein cymdeithas yn wynebu heriau enfawr y gaeaf hwn, gyda’r cynnydd mewn costau byw. Wrth ymweld â warws Fareshare North East yn Newcastle yn ddiweddar, gwelais y gwaith anhygoel sy’n cael ei wneud i helpu i ddarparu bwyd i gymunedau lleol."
        },
        {
            "text": "Roedd yn hynod ddiddorol dysgu am daith y bwyd a ffocws cryf yr elusen ar leihau gwastraff. Maent yn awyddus i ddefnyddio bwyd fyddai’n cael ei wastraffu yn y system fwyd fel arall, o lysiau ffres i gyris wedi’u rhewi. Maent hefyd yn gweithio i gryfhau gwytnwch y gymuned trwy brosiectau fel ceginau cymunedol, yn hytrach na dosbarthu parseli bwyd yn unig."
        },
        {
            "text": "Roeddwn i yno fel rhan o ymweliad Bwrdd yr Asiantaeth Safonau Bwyd (ASB) i ddysgu mwy am ddarpariaeth bwyd cymunedol, ac i ddeall yn well beth sy’n digwydd ar lawr gwlad ym maes coginio cymunedol a banciau bwyd."
        },
        {
            "text": "Yr hyn a wyddom"
        },
        {
            "text": "Rhan o rôl yr ASB yw casglu tystiolaeth ar bob agwedd ar fwyd i lywio ein gwaith a gwaith y llywodraeth ehangach. Rydym wedi casglu data ar ddiogeledd bwyd cartrefi a’r defnydd o fanciau bwyd yng Nghymru, Lloegr a Gogledd Iwerddon drwy ein harolwg defnyddwyr blaenllaw, Bwyd a Chi 2, a gynhelir ddwywaith y flwyddyn, a hynny ers 2020."
        },
        {
            "text": "Ers dechrau’r pandemig, rydym hefyd wedi bod yn olrhain ymddygiadau a phryderon pobl yn fwy rheolaidd trwy ein traciwr misol, Deall Safbwyntiau Defnyddwyr. Yn ddiweddar, rydym wedi dechrau cyhoeddi bwletinau misol am ddata ein traciwr misol, Deall Safbwyntiau Defnyddwyr. Mae’r bwletin diweddaraf, a gyhoeddwyd heddiw (15 Tachwedd 2022) yn nodi’r pwyntiau canlynol:"
        },
        {
            "text": "Nid yw rheoleiddio prisiau bwyd yn rhan o waith yr ASB. Rydym yn ymwybodol iawn bod ffactoaru cymhleth yn achosi i gostau bwyd gynyddu, ac mae hyn gryn dipyn y tu hwnt i’n cylch gwaith. Ond mae’r profiadau y mae pobl yn eu cael – a’r heriau tebyg y mae busnesau’n eu hwynebu wrth i gostau gynyddu – yn hanfodol berthnasol i’n gwaith fel rheoleiddiwr, ac i’n cenhadaeth, sef sicrhau bod gan bobl fwyd y gallant ymddiried ynddo."
        },
        {
            "text": "Nid yw banciau bwyd yn ateb hirdymor wrth i bobl ei chael hi’n anodd fforddio bwyd, ond y gwir amdani yw, erbyn heddiw, eu bod yn ffynhonnell o fwyd i nifer gynyddol o bobl. Gall banciau bwyd ac elusennau ailddosbarthu bwyd fod yn wasanaeth hynod bwysig a dibynadwy mewn cymunedau sy’n helpu pobl yn ystod y cyfnod heriol hwn. Gallant hefyd chwarae rhan bwysig iawn wrth leihau faint o fwyd rydym yn ei wastraffu."
        },
        {
            "text": "Wrth i ddata’r ASB ddangos cynnydd yn y defnydd o fanciau bwyd, gwnaethom benderfynu gweithio gydag elusennau a busnesau er mwyn sicrhau bod rhoi bwyd i fanciau bwyd a’i ailddosbarthu mor syml â phosib. Diogelwch bwyd yw ein prif flaenoriaeth – dylai fod gan bawb fynediad at fwyd sy’n ddiogel i’w fwyta – ond gallwn ei gwneud hi’n haws i’r rheiny sy’n gweithio i elusennau bwyd, a’r bobl hynny sy’n eu defnyddio, i ddilyn arferion gorau ar gyfer storio, paratoi, a choginio bwyd."
        },
        {
            "heading": 2,
            "text": "Canllawiau newydd i helpu elusennau bwyd cymunedol"
        },
        {
            "text": "Mae pobl sy’n gweithio mewn banciau bwyd, pantris cymunedol a chynlluniau ailddosbarthu bwyd cymunedol eraill yn poeni’n fawr am wneud y peth iawn ar gyfer eu cymunedau lleol. Maent wedi bod yn dweud wrthym eu bod weithiau’n poeni am gadw bwyd yn ddiogel – pa mor hir y gall pobl fwyta bwyd sydd wedi mynd heibio ei ddyddiad ‘ar ei orau cyn’, a allant rewi bwyd i wneud iddo bara’n hirach? Mae banciau bwyd bach, annibynnol yn agor, ac efallai nad oes ganddynt brofiad o weithredu o fewn y diwydiant bwyd bob amser, a’u bod yn llai cyfarwydd â gofynion hylendid a diogelwch bwyd o ganlyniad."
        },
        {
            "text": "Mae llawer o wybodaeth ar gael yn barod ond daeth yn amlwg nad oedd yr wybodaeth hon yn hawdd i bobl gael gafael arni a’i defnyddio. Felly am y tro cyntaf, rydym wedi creu canllawiau pwrpasol wedi’u targedu’n benodol at gefnogi elusennau cymorth bwyd i osgoi dryswch ynghylch yr hyn y mae angen iddynt ei wneud er mwyn sicrhau bod bwyd yn ddiogel. Mae’r canllawiau newydd hyn yn crynhoi ein cyngor a’n rheolau perthnasol mewn un lle, i’w gwneud yn haws i elusennau ddeall beth sydd angen iddynt ei wneud er mwyn darparu bwyd diogel i bobl sydd ei angen. Hoffem ddiolch i Fareshare, Rhwydwaith Cymorth Bwyd Annibynnol y DU (IFAN) a Rhaglen Weithredu’r Cynllun Gwastraff ac Adnoddau (WRAP) am brofi’r canllawiau er mwyn sicrhau y byddent yn diwallu anghenion y bobl y cynlluniwyd y canllawiau hyn ar ei cyfer."
        },
        {
            "text": "Y camau nesaf"
        },
        {
            "text": "Byddwn yn parhau i adolygu ein polisïau i adlewyrchu’r amgylchedd newidiol y mae defnyddwyr yn byw ynddo, yn ogystal â diogelu buddiannau defnyddwyr mewn perthynas â bwyd. Byddwn hefyd yn parhau i fonitro fforddiadwyedd a diogeledd bwyd trwy ein traciwr defnyddwyr, er mwyn darparu mewnwelediad gwrthrychol i lunwyr polisi ac eraill sy’n gweithio ar yr heriau hyn. Rydym wedi ymrwymo i gyhoeddi’r wybodaeth hon yn fisol."
        },
        {
            "text": "Mae mwy o waith i’w wneud ar sicrhau bod pobl sydd ei angen yn cael bwyd da a’n bod ni’n lleihau gwastraff bwyd. Mae WRAP yn amcangyfrif eu bod wedi llwyddo i atal tua 300,000 o dunelli o fwyd rhag cael ei wastraffu trwy ei ailddosbarthu rhwng 2015 a 2020. Ond mae tua 200,000 o dunelli o fwyd o hyd sy’n ddiogel i’w fwyta sy’n cael ei wastraffu ar hyn o bryd."
        },
        {
            "text": "Trwy weithio gyda’r diwydiant, y llywodraeth a sefydliadau elusennol, byddwn yn parhau i archwilio a gwella’r dirwedd reoleiddio ar gyfer banciau bwyd a rhoddwyr bwyd, gan sicrhau bod rheolau a chanllawiau’n gymesur, yn effeithiol ac yn cefnogi’r gwaith da sy’n cael ei wneud eisoes."
        }
    ]
}