{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/15/the-rpa-podcast-episode-4-transcript/",
    "title": "The RPA Podcast: Episode 4 Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Social Media"
    ],
    "pub_date": "2022-11-15T10:57:47+00:00",
    "content": [
        {
            "text": "Executive Summary"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "****Intro music to fade****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Hello and welcome to the fourth episode of The RPA Podcast. In today’s programme, we’ll be hearing about the Rural Payments Agency’s more collaborative approach to inspections and visits, and the improvements you can expect to see in the coming months. We’ll also be taking some time to understand the RPA’s geospatial mapping process and learning about the exciting changes that the RPA hope will transform the mapping experience for farmers. As we approach December’s Basic Payments Scheme payments window, we’ll be discussing BPS progressive reductions and understanding how the combination of progressive reductions and advance payments will impact this year’s window. And later in the episode I’m delighted to say we’ll hear from farming ambassador and RPA colleague, Norma Boyes MBE, as she reflects on how farming has changed, and continues to change, for women in agricultural roles and communities, as we mark October’s International Day of Rural Women."
        },
        {
            "text": "But first today, we’ve heard in previous podcasts how the RPA is constantly trying to improve the service they provide, so farmers can grow their businesses and create thriving rural communities. Exploring how the RPA can work more collaboratively with farmers during the inspections process has been a priority for the RPA and I’m delighted to say I’m joined by Richard Anderson, who leads the Field Officer teams at the RPA, to talk about a new partnership-based approach to visits. Richard, thanks for joining us today."
        },
        {
            "text": "Richard: Thanks James, it’s great to be here."
        },
        {
            "text": "James: Richard, what can our listeners expect to see in the months ahead?"
        },
        {
            "text": "Richard: So, as you mentioned, we’ve introduced a more supportive, partnership-based approach to inspections, moving away from the penalty-based system under the EU - where there was frequently a default to payment reduction - to a more farmer-focused visit for schemes such as the Sustainable Farming Incentive and Countryside Stewardship. Our visits - we aren’t calling them inspections anymore - now cover the checks we need to do, and our Inspectors are now referred to as Field Officers."
        },
        {
            "text": "James: And will the purpose of the visits remain the same?"
        },
        {
            "text": "Richard: Well, our Field Officers will continue to carry out visits for control purposes because we’re giving out public funds but with the aim of supporting farmers by offering greater levels of advice, guidance and signposting to help improve compliance with standards and scheme requirements. So, for example, as part of this supportive approach, we’ve introduced a new visit record checklist. This will help inform farmers of their responsibilities, and farmers and land managers can also expect a summary of the visit on Cross Compliance and Countryside Stewardship Domestic visits, including any advice and guidance that we’ve given, as well as what’s going well in the agreement. We then want to use this insight, in combination with other data sources, to help all our scheme participants meet their obligations."
        },
        {
            "text": "James: That all sounds really positive Richard, and it sounds like the Field Officer’s role has also evolved?"
        },
        {
            "text": "Richard: It has. We undertake more than 6,500 visits each year, supporting the farming, food production and food trader sectors across England. Their role is to visit farm premises to ensure farmers and claimants are complying with UK and legacy EU legislation, scheme rules, and agreement options. But our Field Officers are a fantastic source of advice and guidance on holdings as well as remotely, supporting farmers, livestock and landowners with their applications and compliance. Going forward, our advice and guidance activity will increase as we work with farmers and land managers to help them secure the outcomes of their agreements, prior to checking compliance with scheme controls."
        },
        {
            "text": "James: And I believe this is just the start of the process with further improvements to come?"
        },
        {
            "text": "Richard: Yes, absolutely James. We’ve already delivered a number of initiatives, but our aim is to improve the experience further through, for example, reducing the visit burden by using information from our remote observation activities to increase the number of checks we’re able to do without the need for field visits. We’ll also continue to listen to feedback and refine our approach to field visits and making things more straightforward where we can."
        },
        {
            "text": "James: So it sounds like there’s a real focus on making things easier for farmers?"
        },
        {
            "text": "Richard: Absolutely. Farmers and rural communities are at the heart of what we do, and we strive to provide excellent delivery and outcomes that are in the public interest. We’ll continue to support farmers and land managers through the agricultural transition, seeking to place profitable and sustainable farming and food production at the forefront of environmental good practice. We share their passion for high quality food production and a flourishing environment, and we’ll continue to seek ways to help them meet scheme obligations in a way that reflects your commitment and our duties in managing public funds."
        },
        {
            "text": "James: That’s great, thanks Richard, and we’ll certainly look forward to hearing more about the improvements to visits in the months ahead. Next, we’ll be exploring the mapping process with Rachael Dale."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: As part of the Rural Payments Agency’s commitment to improve the mapping experience for farmers, the RPA is making further improvements to the RLE1 mapping process, which is used by farmers and land agents to update land data, land links and entitlements. I’m now joined by Rachael Dale, Head of Geospatial Services at the RPA, to explore this further. Rachael, thanks for your time today."
        },
        {
            "text": "Rachael: Thanks James."
        },
        {
            "text": "James: Rachael, before we move onto the improvements, please can you just explain a little about the geospatial mapping process?"
        },
        {
            "text": "Rachael: Yes, of course. So geospatial, or location, data is an umbrella term for any data that has a location element. It tells us where people and objects are in relation to a particular geographic location whether in the air, on the ground, or at sea. So RPA maps around 2.6million land parcels – which we mean by fields – and we do this by using a range of intelligence such as notifications by the submission of an RLE1 form, Ordinance Survey and also through technology, and we use this to keep the mapping data as accurate as possible. When we process claims for payments we check this mapping data against the claim data we get from farmers and if there are any differences we have to resolve it. We also undertake an activity every year where we use aerial photography, satellite imagery and Ordnance Survey, which has been acquired that year, to check against any parcels that haven’t been updated over three years. And so each year, we always have a mixture of zones across England and these are selected each year and digitisers compare the images to the claims we receive and our mapped land parcels and land covers. My team map physical land parcel boundaries and features, such as hedges, so accurate payments can be made to farmers."
        },
        {
            "text": "James: And you receive a significant number of land mapping changes each year?"
        },
        {
            "text": "Rachael: Yes, we do. So, RPA currently receives over 20,000 RLE1 forms each year requesting mapping changes, and the majority of these are submitted during a two-month window from mid-April to mid-June, so a timely turnaround is reliant on farmers and land managers providing accurate information. This is also important as farmers need to ensure their digital maps correctly show agricultural land parcels on their holding so they’re able to apply for, or claim, for rural payments. If the data on the RLE1 form is inaccurate or incomplete, or maps are incorrect or go missing, this can lead to mapping change delays."
        },
        {
            "text": "James: We heard earlier about the new approach to visits, and your team plays a key role in this process?"
        },
        {
            "text": "Rachael: So, yes, we’re beginning to increase the use of the latest satellite imagery to reduce the visit burden. We’ll use this information to monitor scheme controls and areas where advice is being requested. And it will also help us to support our farmers and land managers to meet outcomes   before Field Officers visit."
        },
        {
            "text": "James: Great, thanks Rachael. So, can you tell us a little about your plans for the months ahead?"
        },
        {
            "text": "Rachael: Yes, so over the next year, we’ll explore digital options that can be accessed online, whilst ensuring we maintain accessibility for all farmers and land managers. We’re excited at the difference these changes will make and will be seeking feedback to look at the best way to improve the experience."
        },
        {
            "text": "James: And what will these improvements look like?"
        },
        {
            "text": "Rachael: So, we’re exploring options to allow farmers and land managers to amend their land details online which is aiming to reduce the amount of time to submit a land change and also improving our processing times. Options are currently being reviewed, so I can’t go into detail as yet, but we’ll outline these further at a later date."
        },
        {
            "text": "James: So this will build on the changes made just a couple of years ago?"
        },
        {
            "text": "Rachael: Yes, that’s right. So, in March 2020 we launched a new RLE1 process, which gave the option of completing a digital RLE1 form. It’s proven a very popular submission route, with over 75% of the forms now being received via email."
        },
        {
            "text": "James: And I believe this is particularly important with the new Environmental Land Management schemes in mind?"
        },
        {
            "text": "Rachael: Yes, it is. So unlike the Basic Payment Scheme and Countryside Stewardship applications, new schemes like the Sustainable Farming Incentive scheme can’t proceed if there’s any mapping work outstanding, also if a land cover currently on a claim isn’t eligible for a particular SFI standard. So these improvements would shorten the turnaround times and streamline the process to meet the needs of farmers in current and new schemes. And it will greatly improve the time it takes to submit a land change and there will be continual improvements as we move forward in this area, based on feedback from the farmers."
        },
        {
            "text": "James: You mentioned earlier the importance of farmers providing accurate information, so how can our listeners ensure a smooth process?"
        },
        {
            "text": "Rachael: There are a few things farmers can do to ensure timely updates. You can help us by making sure all the required fields are completed within the RLE1 form, making clear annotations on any maps, and responding promptly to RPA requests for further information and also by following the guidance when emailing RLE1 forms. When you send an RLE1 form to RPA to make mapping changes to your registered land, it’s important you send accurate sketch maps as well."
        },
        {
            "text": "James: And where can farmers and land managers find the information relating to their holding?"
        },
        {
            "text": "Rachael: You can see digital maps of all the land parcels registered to your holding using the Rural Payments Service on GOV.UK. If the digital maps don’t show your land correctly, you can make changes in the Rural Payments Service or by filling in an RLE1 form. And an RLE1 form also needs to be used to register a land parcel for the first time or to make any other changes."
        },
        {
            "text": "James: And finally Rachael, on a related point, I understand you’re also exploring the use of data to help support farmers affected by extreme weather?"
        },
        {
            "text": "Rachael: Yes, that’s right James. We’re testing the use of free satellite data captured over a regular cycle throughout the year to identify land that may be impacted by natural events such as floods and in particular this year where we’ve seen wildfires. The plan would be that the results will be integrated with our mapping data for RPA to reach out to our farmers and land managers to provide support around meeting the scheme requirements."
        },
        {
            "text": "James: And that sounds like another potentially exciting and innovate piece of work. Rachael, thank you for joining us today and we’ll look forward to welcoming you back to hear more about developments during 2023."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: The combination of a further step in the progressive reductions to Basic Payment Scheme payments and this year’s advance payments, means farmers and land managers need to consider a number of factors when calculating this year’s payment. I’m pleased to say I’m now joined by Kenny McLoughlin, BPS and CS Claims Product Lead at the RPA, who will guide us through December’s BPS payments window. Kenny, it’s great to welcome you to The RPA Podcast."
        },
        {
            "text": "Kenny: Thanks James, it’s great to be here."
        },
        {
            "text": "James: Kenny, first of all, can you talk us through where we are with BPS payments this year?"
        },
        {
            "text": "Kenny: Yes, of course. So as I’m sure your listeners are aware, the Basic Payment Scheme – or BPS - is a rural payment that provides financial help to the farming industry. Direct payments are being phased out by 2027, through progressive reductions, and these were introduced in the 2021 scheme year. And as you said in your introduction, 2022 Direct payments will see a further step in the reductions made. The other key factor this year is we’ve seen the permanent change in the frequency of payments, with the introduction of two instalments - we brought in advances from July and August, and balances from December."
        },
        {
            "text": "James: Yes, and I know the advances were widely welcomed to help farmers with their cashflow, but obviously it impacts December’s payment."
        },
        {
            "text": "Kenny: Yes, clearly with around 50% of the overall payment issued earlier this year for the majority of claimants, we would urge farmers to remind themselves of what they have received and what they expect, prior to the opening of the payment window in December."
        },
        {
            "text": "James: And the progressive reductions, combined with rising costs and ongoing cashflow challenges, will be a concern to many listening today. What’s your message to farmers and land managers seeking alternative revenue streams?"
        },
        {
            "text": "Kenny: The money from progressive reductions is reinvested in a new scheme to support farming and the countryside, such as the Sustainable Farming Incentive and the Farming Investment Fund. We understand the importance of cashflow to rural businesses and I would urge all farmers and land managers to explore the opportunities available through the current schemes and grants relevant to them."
        },
        {
            "text": "James: So, I’m sure the question our listeners would want to ask is, are the 2022 payments on track?"
        },
        {
            "text": "Kenny: I’m pleased to say they are. Advance payments and the delivery of other schemes have placed an increased workload on my team, but they’ve done an incredible job and we’re on-track for December."
        },
        {
            "text": "James: Great, and where can we find out more information on progressive reductions?"
        },
        {
            "text": "Kenny: I would recommend using the online calculator available on GOV.UK, to find out how progressive reductions could affect your BPS payment – not just this year but for the reductions during scheme years 2021 to 2024. It’s important to highlight here that you don’t need to enter any personal information to use the calculator. The results are an estimate based on the progressive reduction figures set out in the Farming is Changing leaflet and the data you enter. Further information on BPS progressive reductions and advance payments can also be found on GOV.UK."
        },
        {
            "text": "James: Thanks Kenny. I’d also like to touch on the serious issue of fraudsters potentially targeting farmers. What’s your advice to listeners today?"
        },
        {
            "text": "Kenny: Yes, sadly we have seen examples of fraudsters targeting farmers who receive subsidy payments and we’re aware that in the past some farmers and land managers have received emails and telephone calls claiming to be from RPA or Defra. Links to a fake website designed to look like the authentic RPA or Defra online service are sometimes included in the message. It’s important to highlight here we don’t send emails or text messages with links to websites asking you to confirm your personal details or payment information. So, we strongly advise anyone who receives such a request not to open the link and delete the item."
        },
        {
            "text": "James: That’s really helpful Kenny and are there any key points to remember?"
        },
        {
            "text": "Kenny: Yes, I think there are four key things to remember. First of all, never discuss your bank account details with someone you don’t know. Secondly, we won’t ask you to make a payment over the phone. Thirdly, delete any emails or texts you don’t believe are genuine, and don’t open any links. And finally, be cautious about what information you share externally, particularly on social media. Again, you can find further advice on the RPA’s pages on GOV.UK."
        },
        {
            "text": "James: Great, and if a farmer or land manager suspects an attempted fraud or feel they’ve been the subject of fraud, who can they contact?"
        },
        {
            "text": "Kenny: They can call the RPA’s Fraud referral team on 0800 347 347 or email FraudInConfidence@rpa.gov.uk. Farmers can also call Action Fraud - the UK’s national reporting centre for fraud and cyber-crime on 0300 123 2040."
        },
        {
            "text": "James: That’s great, thanks Kenny; hopefully we won’t ever need to use them but it’s always good to be prepared. Thanks again for your time today."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Norma Boyes has worked for the Rural Payments Agency for over twenty years. Norma and her family have also been involved with farming for generations and she’s always lived on farms. So Norma’s involvement with rural organisations and agricultural shows in the North West, means she’s a well-known and well-respected member of the community. So, to mark International Day of Rural women in October, the RPA’s Kris Bell visited Norma on her farm to ask for her thoughts on the role of women in farming, how it has changed over the years and her advice to women considering a move into the agricultural sector."
        },
        {
            "text": " "
        },
        {
            "text": "****Audio with background music – Norma Boyes MBE****"
        },
        {
            "text": "Norma: My name’s Norma Boyes, I’m 73 and I have been part of the rural community all my life, probably both sides of my family for the last four or five generations, so I don’t really know much else really. I’m still involved with the family farm. I’ve worked as part of the Rural Payments, BCMS, MAFF for twenty-four years and I still work there part-time."
        },
        {
            "text": "Kris: Do you think the role for women in farming has changed through the years and do you see any gender issues within farming today?"
        },
        {
            "text": "Norma: I think they’re a lot better than they used to be. It’s like any gender issue, there’s still a long way to go, and I don’t think they’re exclusive to farming. It wasn’t that the participation by women wasn’t there, it was that it wasn’t recognised. The farmers’ wives and daughters always worked but it was the sons that were part of the…the eldest son inherited the farm and that was it. Whereas now, it’s who’s best placed to do that, who wants to do that. One example, I think is very successful, is one of my cousins. His son didn’t want the farm, his daughter did and her husband, and they’ve taken it on. It’s a local farm and they’ve also diversified, so they’re building on that. And maybe because it’s a woman, she sees more opportunities, and they’ve got a wedding barn which is very successful, three barns, and they’ve now diversified again with the support of grants, and they’re doing cheese. It’s finding its feet and it’s very successful. Whereas they wouldn’t have been given that opportunity. It would’ve either been the farm would have been sold or the son would’ve taken over and that’s how, I think it’s important. It isn’t happening everywhere, but it is starting to happen, which I think is key."
        },
        {
            "text": "Kris: Do you think farming is more inclusive to women than it was in the past?"
        },
        {
            "text": "Norma: I think there is still a perception by some of the older people within farming, the older generation, and I’m speaking myself as an older generation person to be fair, that the women are maybe not as strong physically to be able to do the work but things have changed, and there’s so much more mechanisation and there is so much more technical work, and I think probably women are better at that type of stuff actually than some of the men are. And I think it’s utilising what is available and recognising that actually they have different strengths and I think that’s with all types of work isn’t it. That’s what I think is important, that there’s a recognition that you can work smarter, you don’t have to make it such hard work."
        },
        {
            "text": "Kris: Who do feel are the biggest female role models in farming?"
        },
        {
            "text": "Norma: I think, in a strange way, I think Her Majesty The Queen was a big representative of the countryside. She not only promoted the horses, the dogs, she actually showed pedigree cattle and sheep at the agricultural shows. She had her roots in the countryside, and I think we couldn’t have had a better role model than her. One of the other people who I think was very influential in years gone by was Beatrix Potter, Mrs Heelis. What she did was in effect create the National Trust. Her farms were the foundation for the National Trust. I was actually judging at Loweswater Show and I realised that she was actually the first female president of Loweswater Show in 1938. I’m addicted, since I was a child, to Beatrix Potter, I must have one-hundred-and-fifty ornaments of the Beswick ornaments. But of the more modern ones, I think it’s the first time we’ve had…National Farmers Union…it’s the first time they’ve had a female president. And Minette Batters is the president now and she is a farmer in her own right, and she leads a strong representation. I think she’s a role model for anybody that can aspire to be and take those roles."
        },
        {
            "text": "Kris: You are now supporting the next generation of farmers, what would be your advice to a young lady starting out in farming today?"
        },
        {
            "text": "Norma: I would say look for opportunities, don’t be afraid to diversify, look for grants that we’re giving out, and support and training, take advantage of everything that’s available. I think you need to be aware of where you want to be and work towards that, without too much risk. Defra, and Rural Development and the RPA, they’ve all got various grants schemes that are available if you’ve got land or if you want to buy equipment. And again, local colleges supply lots of training and lots of it if you haven’t made it to university then there are still opportunities to do things within your own environment and build on that. If you’re going into farming or you’re diversifying into something else, you need to have a sound business background, and you need to get that before you start to do things. But nobody’s going to do it for you, so you have to look and be prepared to put yourself in that situation."
        },
        {
            "text": "****Audio music to fade****"
        },
        {
            "text": "James: Our thanks to Norma and Kris. I always enjoy listening to Norma talk about her life in farming and if you would like to hear more, you can watch the videos of Kris’ interview with Norma via the RPA’s YouTube channel and they’re also available to watch on the RPA’s Twitter and Facebook accounts."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "So, that’s all we’ve got time for today. Thank you to Richard, Rachael, Kenny and Norma, and thank you once again for listening. We’ve covered a range of topics again today but we’re always happy to receive your questions and suggestions. So, if you’d like us to cover a particular topic or issue with our subject experts, please get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on Twitter - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the fifth RPA podcast as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": " "
        },
        {
            "text": "****Close music to fade****"
        }
    ]
}