{
    "url": "https://companieshouse.blog.gov.uk/2022/11/15/what-companies-house-will-look-like-in-the-future/",
    "title": "What Companies House will look like in the future",
    "authors": [
        "Louise Smyth - Chief Executive and Registrar of Companies"
    ],
    "categories": [
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2022-11-15T12:30:43+00:00",
    "content": [
        {
            "text": "The Economic Crime and Corporate Transparency Bill is currently making its way through Parliament. It had its second reading last month, and Martin Swain (Director of Strategy, Policy, Communications and Legal at Companies House) gave evidence at a committee session at the end of October."
        },
        {
            "text": "The committee stage is a detailed examination of the Bill, and this stage can often last for several weeks. A wide range of key stakeholders will be giving evidence during the committee stage to make sure MPs have a balanced and thorough understanding of all the different aspects of the Bill."
        },
        {
            "text": "This Bill builds on the Economic Crime (Transparency and Enforcement) Act, which introduced the Register of Overseas Entities back in August. We’re more than halfway through the transition period for the Register of Overseas Entities, and I urge you to comply with your new responsibilities and register well before the deadline if you’re in scope."
        },
        {
            "heading": 2,
            "text": "Why the Economic Crime and Corporate Transparency Bill is important"
        },
        {
            "text": "We’re approaching a pivotal moment in the history of Companies House. This legislation will fundamentally change our role and our purpose and will give us the powers we need to play a more significant role in tackling economic crime. Over time, we’ll become an active gatekeeper of the data on our registers rather than a passive recipient, and we’ll have the tools to go further to prevent the misuse of corporate entities."
        },
        {
            "text": "It's widely known that the UK has one of the largest and most open economies in the world. However, it’s become increasingly apparent that this openness exposes the UK to criminals who want to use our corporate structures for illicit purposes. This is one of the things the new Bill will address."
        },
        {
            "text": "The measures in the Bill will make sure the UK continues to be a great place to do business, while enabling us to take a tougher stance against economic crime."
        },
        {
            "text": "The measures include:"
        },
        {
            "heading": 2,
            "text": "The changing role and purpose of Companies House"
        },
        {
            "text": "We’re doing the very best we can with our current powers, but we’ll be able to operate in a different way in the future and make a real difference to the economy – and to people’s lives and livelihoods. We know that economic crime threatens everyone, from global businesses to individuals. As well as having the tools to contribute to the fight against economic crime, I want to be able to help those people who have had their identity stolen, their home address used illegally, or had their companies hijacked. These new powers will allow me to do that."
        },
        {
            "text": "Moving away from being that passive recipient to a more active gatekeeper will result in a company register with more reliable data, and more levers to be able to stop those who are using companies as a vehicle for economic crime – both of which will drive confidence in the UK economy. This shift will not happen overnight, but you’ll start to see a visible difference in the way we respond to suspected fraud and other suspicious activities when we have our new powers."
        },
        {
            "text": "However, it’s also important to me that we maintain a balance between tackling economic crime and minimising burdens on law-abiding companies, which make up the vast majority of the register. I’ll be thinking carefully about where it’s appropriate to challenge, and where we need to prioritise ease of doing business for those law-abiding companies. I’ll be keeping the government’s aim of making the UK the best place to start and grow a business at the forefront of my mind when I’m making these decisions."
        },
        {
            "text": "We’ll also be working hard to make sure the upcoming changes, many of which will affect every company on the register, are as straightforward as possible. Keep a look out on our blog for more details about the changes and what you can do to prepare, and sign up to our newsletter if you’d like to receive regular updates."
        },
        {
            "text": "Our people’s commitment at Companies House never fails to make me proud. We’re committed to embracing change and doing things differently, supporting each other, and providing the best services for our customers. I have no doubt that we’ll rise to this challenge together to make sure Companies House is ready to deliver with our new powers."
        }
    ]
}