{
    "url": "https://socialcare.blog.gov.uk/2022/05/06/chief-nurse-for-adult-social-care-awards-inspirational-stories-part-two-of-two/",
    "title": "Chief Nurse for Adult Social Care Awards: inspirational stories (part two of two)",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2022-05-06T10:48:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Barbara Johnson, Gold Award winner, Director of Nursing at Risedale Care Homes"
        },
        {
            "text": "Barbara is an extremely passionate and driven individual who understands the needs of the residents and families she provides care for. Her leadership skills and supportive management style also mean Risedale Care Homes' senior management team feel confident and fully supported. This was never more apparent than during the last two years of the COVID-19 pandemic."
        },
        {
            "text": "The compassionate way she led her team throughout these unprecedented times was commendable. The safety and wellbeing of her residents and staff remained her priority at all times. She is passionate about expanding and improving colleagues' skills and the benefits this passes on to residents. By 2026, there will be over fifty home grown registered nurses all as a result of Barbara’s vision of self sufficiency."
        },
        {
            "text": "Barbara listens to staff. She listens to what they need and is not afraid to speak to others to make sure those needs are addressed. For example, Barbara approached the University of Cumbria , desperate for an assistant practitioner programme as her staff had expressed an interest."
        },
        {
            "text": "Barrow is very much a cul-de-sac of the north west. Many staff simply could not attend university due to financial, child or family commitments, so it was wonderful that Barbara could support her colleagues' professional development in this way."
        },
        {
            "text": "Not only does Barbara support her own staff development, Barbara has supported many other social care providers on ‘how to grow your own’. She is passionate about staff development at all levels and supports home managers to realise their own potential and become effective leaders."
        },
        {
            "heading": 2,
            "text": "Camille Leovold, Award winner, Managing Director and co-founder of Abbots Care"
        },
        {
            "text": "Camille founded the business with her mum and sister in 1995.  Alongside her sisters, she approached Hertfordshire County Council to provide domiciliary care and started Abbots Care after becoming an approved agency. The service now supports almost 1,000 people being cared for at home and employs 500 care workers, and she continued to offer crucial support to staff during the pandemic."
        },
        {
            "text": "During this time, Camille supported her teams to reduce levels of anxiety and fear among colleagues and recipients of care. Some care workers volunteered to form small barrier “COVID” teams, to support recipients of homecare with symptoms or a positive diagnosis of COVID-19. Colleagues received advanced training in infection prevention and control from the local Clinical Commissioning Group and worked on special rotas with sufficient gaps to allow comfort breaks."
        },
        {
            "text": "Camille has been recognised for creating a learning management system, clear career pathways and a Leadership Academy within Abbots Care. The latter supports rising stars within the organisation to develop into managers."
        }
    ]
}