{
    "url": "https://digitalpeople.blog.gov.uk/2022/05/06/come-and-meet-us-at-silicon-milkroundabout-londons-big-tech-job-event/",
    "title": "Come and meet us at Silicon Milkroundabout - London’s big tech job event",
    "authors": [
        "Government Digital Service"
    ],
    "categories": [
        "Digital data and technology",
        "Skills and Learning",
        "Working at GDS"
    ],
    "pub_date": "2022-05-06T12:11:40+01:00",
    "content": [
        {
            "text": "On 14 and 15 May, and after 2 years of virtual meetings, the data and technology teams from several government departments, including Government Digital Service (GDS); UK Security Vetting (UKSV), the Department for Work and Pensions (DWP); Department for Environment, Food and Rural Affairs (Defra); Department for Education (DfE); and Central Digital and Data Office (CDDO), will return to Europe’s largest tech job fair, Silicon Milkroundabout, to meet candidates face to face"
        },
        {
            "text": "Silicon Milkroundabout has been around since May 2011, and provides a fantastic opportunity for technical teams and talented job seekers to come together: celebrating all that’s good and great in the tech world. The 2-day event will see thousands of candidates with a mix of technical skills: from designers, product managers, developers and much more, excitedly looking for the next step in their career."
        },
        {
            "text": "Since government’s first attendance at Milkroundabout in 2017, hundreds of people have been given the opportunity to chat with government’s software developers, technical architects, delivery managers, webOps engineers, data scientists, designers, product managers and find out more about doing tech for good on the #UKGovIsHiring stand."
        },
        {
            "heading": 2,
            "text": "Why join the civil service?"
        },
        {
            "text": "The UK civil service is a world leader in digital transformation, with governments around the world modelling their approach on ours. We offer the unparalleled opportunity to really make a difference to citizens' lives in all that we do, every single day. We work nationally, and internationally, to empower decision-making, opportunities and equality. "
        },
        {
            "text": "With an unprecedented number of innovative projects underway in the UK civil service, the potential to help solve complex problems and shape society’s future is once in a lifetime. We’re working hard to make the power and promise of tech a reality, to reach a greener, more sustainable future that works for everyone. "
        },
        {
            "text": "What we offer:"
        },
        {
            "text": "If this sounds like something you want to be a part of, come and meet us at the event!"
        },
        {
            "heading": 2,
            "text": "Still not convinced?"
        },
        {
            "text": "Here’s what some of our people had to say about working in the Civil Service:  "
        },
        {
            "text": "“I enjoy working for the government as you get to use your expertise in agile methods to build and run services that matter for everyone in the country.” - Richard, Delivery Manager for GOV.UK Pay (GDS)"
        },
        {
            "text": "“I want to come to the event to attract the best talent to the Civil Service and ensure we have people who best mirror the society we serve. What I love about being a civil servant is having the opportunity to work on, and shape, the questions that impact us all - but at the source, well before anyone else outside of government. This  is a huge privilege and responsibility,  some of those projects for example have included e.g EU Exit, reacting to  Covid-19, as well as the exciting Levelling Up work!” - Ola, Head of Consulting Architects (GDS)"
        },
        {
            "text": "“I've been working as a designer in government since 2016 – designing services so they are easier and more effective for people. It's been an opportunity to do some of the most interesting, challenging and significant work of my career.  We want to have more designers in government shaping policies and services, and we want to have more designers from all kinds of backgrounds and experiences. I'm really looking forward to Silicon Milkroundabout – to meet designers, to see what other organisations have been up to, and to share my excitement about being a designer in government.” - Tory, Head of Design (GDS)"
        },
        {
            "text": "“Now more than ever, data has a central role to play in the work of government. My team has developed a common set of data visualisation and reporting services, focusing on data trust and automation. We work closely with our operational colleagues to ensure data is available to inform decision making across DWP’s services. I’m privileged and proud to be using data to positively impact the lives of millions of the UK’s citizens.” - Emma, Head of Enterprise Insight (DWP)"
        },
        {
            "heading": 2,
            "text": "Building the best public services starts with having the best people"
        },
        {
            "text": "We believe that building the best public services starts with the best people, because without people there isn’t a service. We want to build brilliant digital, data and technology teams that reflect the society we serve. An inclusive, transparent working culture that brings different backgrounds and perspectives together helps deliver better outcomes for the public, besides being simply the right thing to do of course."
        },
        {
            "text": "This is why we’re so passionate about  reaching out and connecting with as many talented professionals as possible - so we can make government work better for everyone."
        },
        {
            "text": "Come to stand 192/194, on 14 and 15 May to chat to teams from DWP Digital, the Government Digital Service, Department for Business, Energy and Industrial Strategy (BEIS), Department of Education and more."
        },
        {
            "text": "Follow @digicareersgov for digital, data and technology jobs opportunities nationwide."
        }
    ]
}