{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/05/06/future-climate-and-air-quality/",
    "title": "Future Climate and Air Quality",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-06T15:55:37+01:00",
    "content": [
        {
            "text": "If you are interested in air quality and how this might change in the future, we would love to hear from you! TerraFIRMA* is a new project spinning up at the Met Office and Natural Environment Research Council (NERC) institutions across the UK. TerraFIRMA (‘Future Impacts Risks and Mitigation in a Changing Earth  System’) will use Earth system modelling to investigate the impacts of future global change on air quality as well as water resources, wildfires, marine ecosystems and global sea level rise."
        },
        {
            "text": "TerraFIRMA will generate data on air pollutants under different scenarios of emissions and climate. These will include warming overshoot scenarios where global warming exceeds key targets (e.g. 1.5 to 2°C) and cools thereafter, stabilization scenarios where global warming is held at these targets and climate change mitigation options. We will also be developing a higher resolution model to test these scenarios over the UK region. We think there is huge potential for these data to be used by the air quality impacts community and our first job is to find out who you are!"
        },
        {
            "text": "If you are working on air quality science or policy and are interested in how air quality may change in the future, please contact us using the email address below. We are keen to understand what use cases you might have for TerraFIRMA data and how we can extend the model simulations to be useful for assessing air quality impacts, for example, through downscaling. Initially we would like to meet with interested parties in small groups or teams with the view to holding a workshop in Autumn 2022."
        },
        {
            "text": "Contact: Catherine Hardacre at the Met Office (catherine.hardacre@metoffice.gov.uk) or Nicola Warwick (njw44@cam.ac.uk) at the Centre for Atmospheric Science, University of Cambridge"
        },
        {
            "text": "* TerraFIRMA is funded by a Natural Environment Research Council (NERC) long term science multi centre (LTSM) grant. Joint partner institutions include the British Antarctic Survey, the UK Centre for Ecology and Hydrology, the National Centre for Atmospheric Science, the National Centre for Earth Observation, the National Oceanography Centre, the Plymouth Marine Laboratory and the Centre for Polar Observation and Modelling. The Met Office Hadley Centre is a key partner to TerraFIRMA"
        },
        {
            "text": " "
        }
    ]
}