{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/05/06/global-accessibility-awareness-day-19th-may-the-importance-of-clear-comms/",
    "title": "Global Accessibility Awareness Day 19th May – The importance of clear comms",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Role Model Series"
    ],
    "pub_date": "2022-05-06T18:29:26+01:00",
    "content": [
        {
            "text": "Global Accessibility Awareness Day 19th May – The importance of clear comms\nPaul Willgoss MBE, HSE, Science Division, Chief Scientific Adviser’s Office"
        },
        {
            "text": "I am a disabled civil servant, and I’ve been involved in improving the Civil Service for others over the last 20 years. Yet every year, I’ve seen accessibility can often be viewed as a strange, remote new world. Trust me, it doesn’t have to be!"
        },
        {
            "text": "Making sure our documents are accessible to as many people as possible is right at the heart of being an inclusive organisation. For many of us, reading a poorly structured document is tiring and frustrating."
        },
        {
            "text": "Imagine having to fiddle with multiple settings, then trying to cut and paste text into other programmes just to access the multitude of written communications we each receive every day. On top of this, you’re fatigued from managing your life already. This is the reality for many disabled people."
        },
        {
            "text": "Misunderstanding and confusion"
        },
        {
            "text": "There is a lot of misunderstanding and confusion about making documents accessible. If you’re producing glossy policy documents, websites or apps, then please find an expert as early as possible - it’s much easier to build accessibility in from the start rather than retrofit it."
        },
        {
            "text": "Many documents and services for UK citizens are written by civil servants in our teams, departments or across the Civil Service, so following some simple rules can be really helpful."
        },
        {
            "text": "New guide"
        },
        {
            "text": "Last year, we published a guide on how to make social media posts clearer. It was developed by the Government Digital Service in partnership with the Government Communication Service (GCS) with input from the Government Equalities Office."
        },
        {
            "text": "You can read the guidance: Planning, creating and publishing accessible social media campaigns on the GCS website. We also developed on-demand training about digital accessibility best practices to upskill more colleagues."
        },
        {
            "text": "Practical Dos and Don’ts"
        },
        {
            "text": "If you’re unsure about whether your communication is accessible for colleagues, the best thing to do is to ask them. There are also some fantastic accessible communications learning and resources available to everyone. As a starting point, here are some things that you can do to make your communications more accessible, especially emails and documents."
        },
        {
            "text": "DO’S"
        },
        {
            "text": "► When sharing documents, check that the layout is easy to follow."
        },
        {
            "text": "► Use plain English in your messaging, check the readability and sentence structure."
        },
        {
            "text": "► To make information easier to digest, break long paragraphs into shorter ones and use left align for margins."
        },
        {
            "text": "► Use a simple font such as Arial and, where you can, use size 12 as a minimum in your emails and documents, and larger fonts for powerpoint presentations."
        },
        {
            "text": "► Include alternative text (‘alt text’) description for images or graphs to help visually impaired users."
        },
        {
            "text": "DON’TS"
        },
        {
            "text": "▲ When sending attachments, don’t just use PDFs. Instead, include a Word version or HTML pages. This makes the documents accessible to users with screen reading software."
        },
        {
            "text": "▲ Don’t add background shades on your documents or emails"
        },
        {
            "text": "▲ Make sure hyperlinks are clear. Avoid links that say 'click here' and 'read more' because a person using a screen reader won’t know what’s being linked to."
        },
        {
            "text": " "
        }
    ]
}