{
    "url": "https://educationhub.blog.gov.uk/2022/05/06/how-were-helping-people-learn-new-skills-regardless-of-their-age-through-the-lifelong-loan-entitlement/",
    "title": "How we’re helping people learn new skills regardless of their age through the Lifelong Loan Entitlement",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Adult learning",
        "lifelong loan entitlement",
        "Skills"
    ],
    "pub_date": "2022-05-06T13:58:30+01:00",
    "content": [
        {
            "text": "We want people to be able to learn, upskill and retrain over the course of their lifetime. That’s why we are introducing the Lifetime Loan Entitlement. It will provide learners with a loan entitlement to the equivalent of four years of post-18 education (£37,000 in today’s fees) to use over their lifetime."
        },
        {
            "text": "We consulted with the public on the details of how the programme will work and will set out our plans in due course."
        },
        {
            "text": "Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "What will people be able to use the Lifelong Loan Entitlement for? "
        },
        {
            "text": "The Lifelong Loan Entitlement will be introduced from 2025, providing individuals with a loan entitlement to the equivalent of four years of post-18 education (£37,000 in today’s fees) to use over their lifetime. It will be available for both modules and full years of study at higher technical and degree levels (levels 4 to 6), regardless of whether they are provided in colleges or universities."
        },
        {
            "heading": 3,
            "text": "And how exactly will the Lifelong Loan Entitlement work? "
        },
        {
            "text": "We are working closely with the Student Loans Company to design, develop and deliver lifelong learning accounts from 2025."
        },
        {
            "text": "New students will be able to sign up, log in online and find a learning loan entitlement worth the equivalent of four years of post-18 education to be used across higher and further education as they choose. This online Lifelong Loan Entitlement account will allow them to see their loan entitlement and receive clear signposting of the courses and modules they can get onto to reach their career goals."
        },
        {
            "text": "We recently consulted on the detail and scope of the Lifelong Loan Entitlement, as part of our planned pathway to delivery from 2025. This engagement is a critical part of delivering a transformation of student finance, and the Government will publish a full response in due course."
        },
        {
            "heading": 3,
            "text": "Who will be able to access the Lifelong Loan Entitlement? "
        },
        {
            "text": "We are considering eligibility conditions for study funded by the Lifelong Loan Entitlement and provide more detail in due course."
        },
        {
            "heading": 3,
            "text": "Will people have to pay back the loan?"
        },
        {
            "text": "The Government is considering how repayment terms under the Lifelong Loan Entitlement will work and we will set out more detail in due course."
        },
        {
            "text": " "
        }
    ]
}