{
    "url": "https://marinedevelopments.blog.gov.uk/2022/05/06/i-vms-update-may-2022/",
    "title": "I-VMS Update - May 2022",
    "authors": [
        "Sean Douglas, Head of Enforcement, Intelligence and Investigations"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-06T16:16:22+01:00",
    "content": [
        {
            "text": "We are pleased to announce that a quarter of I-VMS devices have been ordered by fishers from across the English inshore fleet.  We would like to thank everyone who has already chosen, purchased and arranged installation of your preferred type-approved device."
        },
        {
            "text": "There are a number of fishers who are yet to start the process, and we are keen to work with you to help you choose, order, arrange installation, and claim your grant funding to cover costs."
        },
        {
            "text": "Our goal is for the entire inshore fishing fleet to be I-VMS equipped and ready by the end of the year as legally required."
        },
        {
            "text": " "
        },
        {
            "text": "We have the following support already in place to help our inshore fleet with the I-VMS process "
        },
        {
            "text": "Future events and activities"
        },
        {
            "text": "North West 7.a – Tuesday, 10 May 15:00 – 18:00 – Whitehaven (Summergrove Halls, CA28 8XZ)\nNorth East 4.b – Tuesday, 17 May 15:00 – 18:00 – North Shields (venue tbc)\nSouth East 4.c – Tuesday, 24 May 15:00 – 18:00 – Ipswich (venue tbc)\nSouth 7.d – Tuesday, 31 May 15:00 – 18:00 – Brighton (venue tbc)\nSouth West 7.efg – Tuesday, 14 June 15:00 – 18:00 – Plymouth (Future Inn Plymouth, PL6 5ZD)"
        },
        {
            "text": "We invite you to attend these meetings to learn more about the I-VMS program and share your own concerns or issues  We will follow up and contact individuals directly to talk over any concerns that you may have and provide support and advice"
        },
        {
            "text": "The I-VMS project rollout has been challenging for some, but it’s also providing the English inshore fleet with a fantastic opportunity to protect and promote the future interests of the industry."
        },
        {
            "text": "We want to reassure fishers that we are listening to you.  We are liaising with suppliers on delivery or installation delays and working with industry on tranche dates to help manage the supply and demand for device purchase and installation across the fleet."
        },
        {
            "text": "We would encourage every fisher and every vessel is fully I-VMS equipped and ready as soon as possible."
        },
        {
            "text": "Please keep talking to us and help us to help you."
        },
        {
            "text": " "
        }
    ]
}