{
    "url": "https://minimumwage.blog.gov.uk/2022/05/06/lpc-kicks-off-2022-visits-programme-in-leicester-but-has-anything-changed/",
    "title": "LPC kicks off 2022 visits programme in Leicester – but has anything changed?",
    "authors": [
        "Jack Darby"
    ],
    "categories": [
        "Compliance and enforcement"
    ],
    "pub_date": "2022-05-06T15:48:29+01:00",
    "content": [
        {
            "text": "Each year the Low Pay Commission (LPC) conducts field visits to collect evidence from workers, unions, campaigners, councils and employers on low pay-related issues in their areas. This is a crucial part of our annual cycle of work and the information people share with us is invaluable. This year our visits programme covers Leicester, Glasgow and Paisley, the Black Country, Conwy and Llandudno, Hastings and Rother, and Derry/Londonderry, the first two of which were held virtually."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "For our trip to Leicester, we concentrated specifically on compliance issues. We wanted to see what had changed since this article from 2020. At the LPC, we have a clear interest in understanding the impact of our recommendations, including what the barriers are to everyone receiving at least the statutory minimum wage level to which they are entitled. We publish annual reports on minimum wage compliance; and will be discussing the enforcement challenge, in Leicester and elsewhere, in a report later this year."
        },
        {
            "text": "The headline is that low pay and the garment sector in Leicester are still a conundrum. On the one hand, we heard of systematic and deliberate non-compliance, involving circumvention of biometric ‘clocking-on’ arrangements, falsified time sheets, workers paying cash back to employers, and widespread ‘phoenixing’, whereby companies fold and regenerate, thus avoiding certain statutory employment rights."
        },
        {
            "text": "However, simultaneously, we also heard that there have been significant and sustained levels of resource dedicated to enforcement work. At the centre of this has been Operation Tacit, a multi-agency drive led by the Gangmasters and Labour Abuse Authority (GLAA) to ensure workers are being treated correctly and businesses are following regulations. But this work has not turned up the endemic non-compliance we heard about from others. It is important for all parties to understand the reasons for this disconnect."
        },
        {
            "text": "We were very pleased to hear from HMRC’s local enforcement team, which enabled us to understand in much better detail what their work consists of. Representatives of the Health and Safety Executive, the Home Office and the Gangmasters and Labour Abuse Authority, each with their own perspective, took the time to guide us through their contribution to non-compliance work, which is framed by the legislative powers under which they operate."
        },
        {
            "text": "The notion of responsible supply chains, with well-known brands at the head of chain having a particularly important role to ensure compliance, was brought up by enforcement authorities and large-scale garment retailers. Interventions such as the Fast Forward initiative[1] and the Apparel and General Merchandise Public Private Protocol[2] seem to have been effective in providing a framework in which non-compliance can be detected and corrective action taken. But the lack of visible organisation amongst manufacturers in Leicester makes it impossible to engage them in a structured conversation about labour standards."
        },
        {
            "text": "Researchers and independent auditors guided us through their work. It seems clear that there remains a part of the textile sector where non-compliance is determined and entrenched. These companies are highly resistant to through-the-front-door enforcement – something that the enforcement authorities are clearly now factoring into their operations."
        },
        {
            "text": "As ever, it was a particular pleasure to be able to talk to some of the workers directly affected by these issues, albeit on the condition of anonymity (which is of course indicative of a problem in itself). Some were themselves paid at or above the National Living Wage (NLW), but nevertheless believed non-compliance  to be widespread and had friends and family members who experienced it."
        },
        {
            "text": "Others were directly employed in jobs for which they received significantly below the NLW, were told that they could be replaced by people who would work for even less, were unable to raise concerns without fearing dismissal, had no faith in external channels (such as ACAS or the HMRC hotline) and witnessed or suffered from workplace bullying. We were also told about strong community pressures against speaking out. Working for a good manager or owner was seen as a reasonable aspiration as well as both valuable and important"
        },
        {
            "text": "All stakeholders we spoke to agreed that even if there were more effective enforcement activity, with greater acceptance from the community, incentives to be non-compliant are still strong, especially with an economic model that forces down cost. The dexterity shown in the ‘phoenixing’ process means that however well-resourced, enforcement work struggles to keep pace with the proliferation of new companies operated by the same bad actors. The circumstances therefore require a proactive approach to make non-compliance socially unacceptable and economically unattractive. Leicester City Council in particular described to us the innovative work being done by the local authority for which they deserve credit. There are no easy answers, but a range of possible measures which we will explore in our forthcoming report."
        },
        {
            "text": "Thanks to the LPC secretariat for organising an extremely useful and informative virtual visit, and to all those we spoke with for their time and candour. Our findings and recommendations will be published in full in an enforcement-focused report published later in the year. If you are in one of the remaining four site visit areas and would like to speak with us, contact the Commission secretariat at lpc@lowpay.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": "References:"
        },
        {
            "text": "[1] https://www.fastforwarduk.org/"
        },
        {
            "text": "[2] https://www.gla.gov.uk/i-am-a/i-use-workers/apparel-and-general-merchandise-public-private-protocol/"
        }
    ]
}