{
    "url": "https://dwpdigital.blog.gov.uk/2022/05/06/meet-the-engineer-diane/",
    "title": "Meet the engineer: Diane",
    "authors": [
        "Diane Reddell, associate QA tester, DWP Digital"
    ],
    "categories": [
        "Engineering",
        "Test engineering"
    ],
    "pub_date": "2022-05-06T12:26:26+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Tell us a little bit about your role   "
        },
        {
            "text": "As a QA tester at DWP Digital I work with my team to create test conditions for tickets, prepare the test data and run the tests which can be exploratory, manual and automated tests. I then gather the evidence to show how the tests have met the acceptance criteria on the tickets.   "
        },
        {
            "text": "In my role you need to have the business knowledge and the technical skills. It’s also about analysis, being able to spot differences, being able to relay complex information, being proactive and being a people person as you have to interact with a range of stakeholders.   "
        },
        {
            "heading": 2,
            "text": "How long have you been working at DWP Digital and what roles have you done?   "
        },
        {
            "text": "I’ve worked for DWP collectively for 14 years with and have spent the last 7 within DWP Digital, previously as a live support business administrator and a junior software engineer. I’ve also worked informally in a delivery manager type role for a few projects. "
        },
        {
            "heading": 2,
            "text": " Tell us about a project you’re working on "
        },
        {
            "text": " The current project I’m working on is called the Debt Manager 11 project. It’s a bespoke software package which is being customised for DWP to manage customer debts from a range of welfare benefits and payments allocated to those customer debts.  "
        },
        {
            "heading": 2,
            "text": " What tech do you use? "
        },
        {
            "text": " The tech I use on the project include Azure, IntelliJ, Visual Studio Code, Postman, Java, Selenium, Cucumber, Maven, Serenity, GitLab, Jira, Confluence and Slack. "
        },
        {
            "heading": 2,
            "text": " What do you like most about your job? "
        },
        {
            "text": " The things I like most are being able to learn something new every day, doing analysis to see how things work and doing exploratory testing. "
        },
        {
            "heading": 2,
            "text": "What’s the best thing about DWP Digital? "
        },
        {
            "text": " The best thing about DWP Digital is the opportunities there are to develop a career. Also, there’s always somebody to mentor you if you need it. "
        },
        {
            "heading": 2,
            "text": " What are your career goals for the next few years? "
        },
        {
            "text": " I’d like to progress to become a lead test engineer, transfer to become a solutions architect and then progress into a senior leadership role.   "
        },
        {
            "text": " In addition to this I would like to progress my disability and gender advocacy role. "
        },
        {
            "heading": 2,
            "text": " What do you enjoy doing in your spare time? "
        },
        {
            "text": " In my spare time I like going to comedy shows, live and club events.  I have a wide range of musical tastes. I’m also a volunteer moderator for two DJ streamers on Twitch.  "
        }
    ]
}