{
    "url": "https://aphascience.blog.gov.uk/2022/05/06/taking-action-to-tackle-invasive-plants-through-volunteering/",
    "title": "Taking action to tackle invasive plants through volunteering",
    "authors": [
        "Yvonne Spencer"
    ],
    "categories": [
        "Invasive Species",
        "Wildlife"
    ],
    "pub_date": "2022-05-06T13:04:46+01:00",
    "content": [
        {
            "text": "It is well accepted that people whose jobs allow them to enhance the lives of people, animals or the environment have better job satisfaction and wellbeing. People working at APHA are fortunate to be putting this into practice at a number of levels through their work and also though volunteering activities which align with Defra’s objectives and the APHA mission ‘To safeguard animal and plant health for the benefit of people, the environment and the economy’."
        },
        {
            "text": "Prior to becoming Director of Science Transformation, to work on the redevelopment of our Weybridge science facilities, I was Head of Pathology & Animal Sciences and a Lead Scientist used to dealing with a range of animal and plant health related issues impacting the UK. My current role is now more strategic which means I’m in meetings most of the time, so it was a welcome change to take part in a local volunteering event to help clear floating pennywort weeds that are taking over the waterways (see distribution map)."
        },
        {
            "text": "Floating pennywort (Hydrocotyle ranunculoides) is just one of the many invasive, non-native species of plants that APHA’s GB Non-native Species Secretariat (NNSS) are concerned about. The NNSS leads the Check Clean Dry and Be Plant Wise campaigns in partnership with a wide range of other organisations, to raise awareness of the impacts of invasive non-native species, and how people can help to prevent their spread. Once established, invasive non-native species can be extremely difficult and costly to control, but across GB there is a network of Local Action Groups helping to manage of a number of invasive plants. Volunteers include APHA staff, who are helping to tackle floating pennywort."
        },
        {
            "text": "I was pleased to be able to help at one of the local volunteering events in February, organised by Purley Canoe Club, the Lower Mole Partnership and British Canoeing, to address the overgrowth of floating pennywort on the River Mole in Walton on Thames. I even roped my family in to help! We joined local residents and colleagues from APHA and Dittons Paddle Boarding and Walton Canoe and Camping clubs to haul large rafts of pennywort that were blocking the river."
        },
        {
            "text": "Large clumps of pennywort were collected on kayaks or paddleboards or dragged from the river onto the bankside using ropes, rakes, tarpaulin and lots of heaving. It was hard work and very muddy, but we all felt very satisfied at the end of the day when we saw the amount we had cleared, and the improvement in the water flow. This was the fourth volunteering event held along the river and it’s a constant battle to stay on top of this fast-growing invasive plant. There are lots of other problems impacting the environment so there is a concerted effort coming up to address these issues during Invasive Species Week."
        },
        {
            "heading": 3,
            "text": "Invasive Species Week"
        },
        {
            "text": "Invasive Species Week takes place from the 16-22 May 2022. Many organisations across the UK will be taking part in this annual event led by the Non-native Species Secretariat (NNSS) to raise awareness of the impacts of invasive non-native species and the simple things everyone can do to help prevent their spread:"
        },
        {
            "heading": 3,
            "text": "More information on Invasive Species Week"
        },
        {
            "text": "We hope you enjoy getting involved during Invasive Week, or in the future!"
        }
    ]
}