{
    "url": "https://ruralpayments.blog.gov.uk/2022/05/06/the-rural-payments-agency-podcast-episode-2/",
    "title": "The Rural Payments Agency Podcast: Episode 2",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "RPA podcast",
        "Rural Payments service",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-05-06T15:41:24+01:00",
    "content": [
        {
            "text": "The Rural Payments Agency (RPA) has released the second episode of The RPA Podcast."
        },
        {
            "text": "In our latest episode, Sustainable Farming Incentive Pilot Delivery Manager, Alex Hills, talks about the Sustainable Farming Incentive (SFI) pilot scheme, and the important findings that have already been applied to the SFI live service that’s due to launch later this year."
        },
        {
            "text": "We also explore the Countryside Stewardship applications window with Rozanne Kidd, Agricultural Transition Director at the RPA. Rozanne focuses on the improvements made to this year’s Mid Tier scheme and considers how the Sustainable Farming Incentive scheme complements Countryside Stewardship schemes."
        },
        {
            "text": "Later in the podcast Duncan Currie, Project Manager in the Business Transformation Directorate at the RPA, talks us through the recently launched Lump Sum Exit scheme."
        },
        {
            "text": "In our last podcast, we heard how the RPA is focused on listening to customers, learning from their experiences and continuously improving the RPA’s services. Listening to our customers is at the heart of this, and in today’s episode, Megan Hughes, Samantha Kadzidlo and Jen Bird from the RPA’s Customer Development, Journey and Insight Team, discuss the role of the team and how they would like to work with farmers and landowners in the months and years ahead. Megan, Samantha and Jen also highlight their exciting plans to launch the RPA Research and Insight Network Group later in the year."
        },
        {
            "text": "You can also read the transcript for this episode. The RPA Podcast is an opportunity to engage with our customers in a new way, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "If you’d like to listen to the first episode of The RPA Podcast, you can find out more about it in this blog post."
        },
        {
            "text": "You can listen to The RPA Podcast on Apple and Spotify or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts."
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        }
    ]
}