{
    "url": "https://ruralpayments.blog.gov.uk/2022/05/06/the-rural-payments-agency-podcast-episode-2-transcript/",
    "title": "The Rural Payments Agency Podcast: Episode 2 Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "RPA podcast",
        "Rural Payments service",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-05-06T15:39:18+01:00",
    "content": [
        {
            "text": "James: Hello and welcome to the second Rural Payments Agency podcast. During today’s episode, we’ll update you on the Sustainable Farming Incentive scheme, give you the latest information on the Countryside Stewardship applications window and review the Lump Sum Exit Scheme. Later in the programme, we’ll introduce you to the RPA’s Customer Development, Journey and Insight team, and hear about the launch of their RPA Research and Insight Network Group."
        },
        {
            "text": "So, I’m delighted to say my first guest today is Alex Hills, Sustainable Farming Incentive Pilot Delivery Manager at the RPA to talk about the Sustainable Farming Incentive scheme and what we can expect to see delivered during this year. Alex, thanks for your time on The RPA Podcast."
        },
        {
            "text": "Alex: Thanks James."
        },
        {
            "text": "James: Alex, please can you briefly summarise the Sustainable Farming Incentive scheme?"
        },
        {
            "text": "Alex: Yes, as part of the Agricultural Transition Plan, we - Defra and RPA - are launching three new schemes that will reward environmental land management; the Sustainable Farming Incentive scheme, Local Nature Recovery and Landscape Recovery. The Sustainable Farming Incentive scheme will reward farmers to produce public goods such as water quality, biodiversity, animal health and welfare and climate change mitigation, alongside food production. Food production is an important element that often gets missed. These public goods are essential to meeting our 25 Year Environment Plan, Net Zero and animal health and welfare ambitions, alongside our ambitions for a productive and competitive agriculture sector. We launched the SFI pilot scheme last year and the SFI live service will open for applications later this year."
        },
        {
            "text": "James: And you’ve played a pivotal role in the Sustainable Farming Incentive’s pilot phase, so how have you approached this stage?"
        },
        {
            "text": "Alex: Well, this has been a joint effort between the RPA and Defra, and the team’s approach to the Sustainable Farming Incentive pilot has been focused on learning. We’ve been learning how to engage differently with farming communities, working in partnership to help build the future. Also learning how we create a package of standards that suitably rewards farmers for the work they do and how to appropriately streamline the administration to make it simpler. We held three pilot Welcome Webinars for customers and stakeholders, and they’ve been well attended with good engagement. We introduced a collaborative online community recently and it’s great to see participants sharing insight with one another."
        },
        {
            "text": "James: So what’s the latest and where are we today?"
        },
        {
            "text": "Alex: So, we achieved a significant milestone in February when we issued the first batch of quarterly payments to those Sustainable Farming Incentive pilot participants whose agreements started in November 2021. This has been the culmination of lots of hard work across teams in the Rural Payments Agency and Defra’s Future Farming & Countryside Programme. Those payments reflected our review of the Sustainable Farming Incentive pilot standards payment rates and will continue to be made to farmers on a quarterly basis, and by the middle of the appropriate month."
        },
        {
            "text": "James: And were you pleased with the initial uptake?"
        },
        {
            "text": "Alex: The application window closed at the end of September 2021 and we were really pleased at the amount of interest shown and the willingness of those who’ve applied to work with us to shape the new scheme. We had a good mix of farm types, sizes, locations and tenures, and we’ve been working hard to get agreement offers out to applicants - the first of these were issued in October 2021 for a 1st November start. Since then, we’ve continued to issue agreement offers on a regular basis with over 800 issued so far. But there are a few where it’s taking more time to complete the processing. We’re keen to maximise what we learn through the pilot, including any lessons on where we can resolve issues at application more quickly."
        },
        {
            "text": "James: So what have been the key learnings so far?"
        },
        {
            "text": "Alex: Well, we’ve only just started the in-depth learning process but there have been some important findings that we’ve already applied to the SFI live service that is due to launch later this year. For example, pilot farmers told us that they wanted to be able to apply when it made sense for them and their businesses. So, when the SFI live service is launched there’ll be no application submission deadline and the RPA will process applications on a rolling basis. Farmers also told us they wanted the application process to be straightforward enough for them to complete it without having to pay someone to make sense of long documents and complicated forms. We’ve worked to improve the application service and make wording in agreement documents clearer. We’ve also asked pilot participants to keep a journal of their thoughts and reflections at each stage, and these will provide valuable insights into what has worked well, and highlight areas we need to improve as we develop the scheme in the years ahead."
        },
        {
            "text": "James: Thanks Alex. We heard more about the SFI scheme in March, so can you update our listeners on the latest information and what they can expect for the launch this summer?"
        },
        {
            "text": "Alex: Of course. First of all, the scheme will open for applications this June and applications will be made via the Rural Payments service, as was the case for the pilot scheme. It will be available to over 84,000 farmers in England who are eligible for the Basic Payment Scheme – this includes tenants and upland farmers. We’ll support the roll-out with further information nearer the time, along with engagement with our customers and partners.​ It’s really important to highlight that this year is just the beginning and will add more standards into the scheme in later years. So this isn’t the final offer and you can visit the GOV.UK website to see a roadmap of when we’ll add further standards and levels in the years ahead."
        },
        {
            "text": "James: And just to be clear, what does ‘eligible for the Basic Payment Scheme’ mean?"
        },
        {
            "text": "Alex: Eligible for BPS means your business, the Single Business Identifier – or SBI - that’s applying for SFI, must have at least 5 hectares of BPS eligible land and 5 or more BPS entitlements on 16th May 2022. Your business - or SBI - doesn’t have to claim BPS in 2022 or to have received BPS payments in the past."
        },
        {
            "text": "James: So does the minimum 5 hectares of BPS eligible land set the minimum area that can enter into an SFI standards agreement?"
        },
        {
            "text": "Alex: No it doesn’t, the minimum 5 hectares of BPS eligible land doesn’t set a minimum area that’s eligible for SFI, as there isn’t a minimum area you can enter into an SFI standards agreement."
        },
        {
            "text": "James: So why are you linking SFI eligibility to BPS eligibility?"
        },
        {
            "text": "Alex: In early rollout we are doing this purely for practical reasons – because farmers who are BPS eligible are already registered with the RPA. This requirement will be removed in later years so a wider range of farmers can apply for an SFI standards agreement."
        },
        {
            "text": "James: And how long do the Sustainable Farming Incentive agreements last?"
        },
        {
            "text": "Alex: SFI standards agreements will last for 3 years, and farmers need to have management control of the land entered into the agreement for its 3-year duration. Payments will be on a quarterly basis, with the first payment made three months after the agreement starts. We’ll use a new, more supportive approach for checking progress of your agreement. If you cannot deliver your agreement, we’ll start by helping you fix what’s gone wrong, wherever possible and, unlike previous schemes, there will be no additional financial penalties applied. We’re making the scheme more flexible so farmers will be able to add new standards to their agreements annually. And we’ve also extended eligibility for tenants, so if they occupy land on a ‘rolling’ year-by-year basis they’ll be able to apply to the scheme."
        },
        {
            "text": "James: Great, and what would be your message to our listeners in the run-up to SFI applications opening?"
        },
        {
            "text": "Alex: Well, farming is changing, and the Sustainable Farming Incentive scheme aims to help farmers manage land in a way that both improves food production and is more environmentally sustainable. As a new farming scheme, it’s crucial that our standards have been co-designed with farmers and stakeholders. We have listened and improved the application process; it’s straightforward and complements other available schemes. Soil health is of paramount importance and SFI rewards a new way of farming with environmental outcomes to benefit it all​, so I would urge all your listeners to read the latest guidance on GOV.UK and get ready to apply."
        },
        {
            "text": "James: Thanks Alex. It’s certainly a pivotal period in the agricultural transition process and we’ll look forward to hearing more in the months ahead."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Countryside Stewardship applications opened on 8 February this year. The application window for Higher-Tier applicants closed on 29 April and the window closes on 29 July for Mid-Tier applicants. I’m now joined by Rozanne Kidd, Agricultural Transition Director at the RPA to talk more about this year’s Mid-Tier scheme. Rozanne, thanks for your time today."
        },
        {
            "text": "Rozanne: Hi James, thanks and it’s great to be here."
        },
        {
            "text": "James: Rozanne, first of all there were delays to some Countryside Stewardship 2022 agreement offers – so what were the reasons for this and how have you approached this year’s scheme?"
        },
        {
            "text": "Rozanne: There were James. We didn’t make the progress we expected in getting agreement offers out in a timely way and there was no one thing, there were a number of factors which contributed to this. We know that’s frustrating for our customers and are sorry for the delays that caused. As with all our services, we’ve focused on learning from the experience of our customers and teams and improving this year. I would say that our customers can really help here too by getting documents and information needed to us as quickly as possible."
        },
        {
            "text": "James: And this year’s scheme has seen a fairly significant change. Can you tell us more?"
        },
        {
            "text": "Rozanne: It has indeed James. This year, we’ve made it easier to make Mid-Tier applications by making it possible for farmers and landowners to apply online. We’re encouraging customers to apply for Mid-Tier online wherever possible as we think applying online is much quicker than paper applications. It’s also much safer because there’s no risk of applications getting lost in the post and of course for us, and this is important too, it’s a more sustainable option."
        },
        {
            "text": "James: So will Mid-Tier applicants still need to request an application pack?"
        },
        {
            "text": "Rozanne: No, if you’re applying online, you won’t need to request a pack and, as you mentioned earlier, applications are open until 29 July this year. This date also applies to applications for Wildlife Offers and you can track the status of your claims through the Rural Payments service."
        },
        {
            "text": "James: Thanks Rozanne, and what’s the latest on Capital Grants?"
        },
        {
            "text": "Rozanne: Well, applications for Capital Grants also opened on 8 February 2022 but unlike other aspects of Countryside Stewardship, applications will remain open all year. We do however recommend applying for Capital Grants early as we may need to amend the closing date depending on the volume of applications we receive."
        },
        {
            "text": "James: And what about the Countryside Stewardship Protection and Infrastructure agreement?"
        },
        {
            "text": "Rozanne: Well that’s a standalone capital grant that comes under Countryside Stewardship. It’s a new two-year capital grant that allows farmers and landowners to apply for the FY2 Woodland Infrastructure capital item. You can apply and start your agreement at any point during this year, and agreements run for two years after the agreement start date James, and if you complete the works before then, you can claim your funding before the 2 years are up."
        },
        {
            "text": "James: Great, and where can potential applicants find out more about the Countryside Stewardship scheme?"
        },
        {
            "text": "Rozanne: Well, as ever, you can read our Countryside Stewardship: How To Apply guide on GOV.UK along with the full guide to the key dates for all schemes. We’ll also be publishing an RPA blog soon which will address some frequently asked questions and provide more information about our learnings so far. We’re really looking forward to receiving applications for Countryside Stewardship schemes and seeing the benefits they will bring to the environment."
        },
        {
            "text": "James: And finally, Rozanne, earlier in today’s podcast we spoke to Alex about the Sustainable Farming Incentive scheme. I understand there are some considerations for farmers and land managers who are also participating in Countryside Stewardship?"
        },
        {
            "text": "Rozanne: Yes, that’s right James, there are. The SFI scheme will be open to farmers eligible for BPS, Basic Payment Scheme, who already have an agreement under an existing agri-environment scheme - such as Countryside Stewardship and Environmental Stewardship – provided the Sustainable Farming Incentive standard they choose is compatible with their existing agreement and doesn’t result in them being paid twice for similar activities. And again, further information can be found on our GOV.UK website."
        },
        {
            "text": "James: Great, thank you for joining us today Rozanne, that was a really helpful update. And next, we’ll be exploring the Lump Sum Exit scheme."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Thanks again to Rozanne, and I’m now joined by Duncan Currie, Project Manager in the Business Transformation Directorate at the RPA, who will talk us through the Lump Sum Exit scheme. Duncan, thanks for joining us today."
        },
        {
            "text": "Duncan: Thanks James."
        },
        {
            "text": "James: Duncan, some farmers have been keen to hear about the Lump Sum Exit Scheme. We know it can be difficult for farmers who would like to retire or are considering leaving the industry to take that significant next step. So what will the scheme offer?"
        },
        {
            "text": "Duncan: Well, we know there are often a range of considerations for farmers when they’re looking to retire or leave the industry. One of the issues is the financial impact as a lack of capital can prevent them from leaving and we think the Lump Sum Exit Scheme could help them. The time is right to offer this now as farming and the way government supports it is really changing, so it’s good to offer this alternative alongside the Agricultural Transition."
        },
        {
            "text": "James: There was a consultation held with farmers and other industry experts last year, so what were your conclusions?"
        },
        {
            "text": "Duncan: Yes, we ran a consultation on a Lump Sum Exit Scheme for farmers and our proposed approach to delinking payments which had 654 responses. It was great to see the engagement and the interest. After going through the responses, we decided a number of things including that farmers must have claimed Basic Payment Scheme in 2018 or earlier scheme years to be eligible – although there are some exceptions. Farmers will also have to surrender their English BPS entitlements before they can receive the lump sum payment. Once they’ve received the lump sum payment, they won’t be able to claim further Basic Payment Scheme or delinked payments in England, as part of that business."
        },
        {
            "text": "James: And what about transferal of land?"
        },
        {
            "text": "Duncan: Farmers will have to transfer out their agricultural land in England - and rights of common - by 31 May 2024 – apart from up to 5 hectares or land planted with trees under some woodland creation schemes. It’s important to highlight here that farmers will be able to keep their farmhouse, other buildings and non-agricultural land and there will be more flexible rules for partnerships and limited companies than we had proposed in the consultation."
        },
        {
            "text": "James: So how will the payments be calculated?"
        },
        {
            "text": "Duncan: The lump sum will be based on the average BPS payments made to the farmer for the 2019 to 2021 scheme years - this is known as the farmer’s ‘reference amount’. The reference amount will be capped at £42,500 and multiplied by 2.35 to calculate the lump sum. That means the maximum lump sum a farmer can be paid is £99,875, which is in line with proposals in the consultation where the upper limit of £100,000 was broadly supported."
        },
        {
            "text": "James: So for the Lump Sum Exit Scheme, the outcome of consultation focused heavily on the financial support?"
        },
        {
            "text": "Duncan: It was certainly a significant factor. The findings actually supported the view that financial security and assistance was a key factor and those looking to leave the industry needed support. So, following the consultation, we plan to offer farmers in England who wish to exit the industry the option of applying in 2022 for a lump sum payment."
        },
        {
            "text": "James: I saw that guidance was published earlier this year, so can you summarise the key points of the scheme for our listeners?"
        },
        {
            "text": "Duncan: Of course. Yes, we published guidance on lump sum payments in February and this included details of how these payments will be taxed. The RPA also sent information to Basic Payment Scheme applicants to explain how they can request a forecast statement showing the lump sum amount they could receive. Full scheme guidance was shared when we opened the scheme earlier in April. And we expect payments to begin to be made for some farmers from November this year, but farmers will have a longer period if they need it to arrange their exit. The scheme has been designed to enable those who wish to retire or leave the industry to do so in a planned way. By freeing up land, the scheme will also open up opportunities for new entrants and farmers wishing to expand their businesses."
        },
        {
            "text": "James: So when did applications open?"
        },
        {
            "text": "Duncan: Applications opened on 12 April this year and farmers will be able to apply until the end of September 2022."
        },
        {
            "text": "James: Great, thanks Duncan. And the Basic Payment Scheme application window opened on 15 March for farmers to claim their 2022 payments. The deadline for BPS applications – without penalty – is 16 May, so what’s your advice to farmers who are eligible for BPS but considering the Lump Sum Exit Scheme?"
        },
        {
            "text": "Duncan: Well, we’re encouraging farmers who are considering applying for the Lump Sum Exit Scheme to apply for BPS in 2022 as well as applying for the Lump Sum Exit Scheme later on, that’s provided their continuing farming circumstances allow them to do so. This will protect applicants if they find that they are not eligible for the lump sum scheme, cannot complete the transfer of their land in time, or decide to withdraw their application before payments are made."
        },
        {
            "text": "James: Great, thanks again for your time today Duncan. We’ll be back shortly to hear how the RPA is continuing to learn from its customers and build for the future."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: In our first podcast, Customer Director Sandy Kapila highlighted how the RPA is focused on listening to customers, learning from their experiences and continuously improving the RPA’s services. Listening to our customers is at the heart of this cycle and I’m now joined by Megan Hughes, Samantha Kadzidlo and Jen Bird from the RPA’s Customer Development, Journey and Insight Team to discuss the role of the team and how they would like to work with farmers and landowners in the months and years ahead. Megan, Samantha and Jen, thanks for joining today’s podcast. Megan, can you tell us a little about your role and what the team are aiming to achieve?"
        },
        {
            "text": "Megan: Yes, of course. I’m one of the Insight Managers at the RPA and my role involves talking and listening to our customers. To continually improve our offer, it’s crucial we gather our customers’ thoughts, their suggestions and feedback about our services and schemes."
        },
        {
            "text": "James: So how do you capture this feedback?"
        },
        {
            "text": "Megan: Well, through a range of activities. This could be through surveys, focus groups, workshops or meeting people face to face at shows and events. The team and I share this information across the RPA with the relevant teams to ensure we’re doing all we can to help get our customers’ voices heard. This feedback is then used to help improve and shape our services and schemes so we can give our customers the best service we can."
        },
        {
            "text": "James: The schemes and services continue to evolve and I know you and your team also want to explore new channels of communication with customers."
        },
        {
            "text": "Megan: Absolutely. This is a real focus for us, so we’re delighted to be launching our RPA Research and Insight Network Group later in the year. We’re really excited about this group because it means we get to work even more closely with our customers. We know RPA can only improve if we work together, in partnership with our customers and stakeholders. After all, our customers are the ones experiencing our schemes and services, so who is better placed to tell us what’s working and what’s not?"
        },
        {
            "text": "James: And Samantha, what will the Research and Insight Network Group offer and what should our listeners look out for in the months ahead?"
        },
        {
            "text": "Samantha: Our team are going to organise a number of different research events. These events will be at different times of the year, on different days, including in the evenings, and in different locations across England. We know our customers don’t work office hours and sometimes there are much busier parts of the year than others, so we’re really looking to be as flexible as we can when organising these events. We also hope to attend some of the agricultural shows and events – so you’ll find us at the RPA stand, so please do come along and say hello and share your feedback with us!"
        },
        {
            "text": "James: You mentioned other research events, so what will that look like?"
        },
        {
            "text": "Samantha: Well, we’ll do online surveys, hold workshops and other online events, or regional events, where we can talk to people directly. We’ll run focus groups and workshops, we’ll share with you our new products and ask for your feedback or ideas. There are plenty of opportunities for our customers to get involved and make sure their voices heard."
        },
        {
            "text": "James: So it sounds like there’s a real focus on ensuring customers share their experiences and best practice?"
        },
        {
            "text": "Samantha: There really is and it goes beyond any insight and research setting. For us we are looking for real life examples; maybe perhaps invite you to be in a podcast or star in a video. If you’ve had a good experience with one of our schemes or have great tips about how to prepare a claim, or perhaps are able to explain how a grant has changed or improved your business, why not help us by sharing your knowledge and advice with others in the community?"
        },
        {
            "text": "James: Thanks Samantha. And Jen, some of our listeners might be concerned this could be a significant time commitment – on top of an already busy daily schedule. So how will you find the right balance?"
        },
        {
            "text": "Jen: This is something we’ve been so conscious of from the very beginning. We know how valuable time is and especially in the farming industry. So all we would ask is that our panel members try to participate in at least one piece of research a year or attend at least one meeting a year. These can be virtual, on the phone or in person. But the only commitment we’re asking to sign up is one. They can absolutely do more if they want to, so they’ll be invited to various bits of research and we’ll also try to keep it as relevant as we can. So we won’t be asking arable farmers about their opinions on our livestock services, so it’ll be very much built around what they’re eligible for, but what they participate in will be very much in their control. And people can always leave the Group if they want to, although of course we really hope that they don’t; but in that event all they’d need to do is drop us an email and ask to be taken off the mailing list."
        },
        {
            "text": "James: And will the insights be shared with participants?"
        },
        {
            "text": "Jen: Absolutely, yes. It is so important we do that because that gives them that sense of what I’m saying is actually being listened to and acted on. We know there is nothing more frustrating than offering suggestions or advice and then feeling ignored, so we will be sharing as much as we can, as soon as we can. We may put some of the findings on our GOV.UK page as well, our Twitter page, on Facebook or we may email, write or update people on the telephone. And that reminds me, if anyone doesn’t follow RPA on social media, then maybe give us a follow today so that you don’t miss out on any updates. There will be times when we can’t always do everything we wish we could do with the feedback but even in those scenarios, we will still go back to people and say we’ve listened, this is what we’d like to be able to do, maybe it’s not possible just yet but it’s very much on our notepad for the future. And just, again, really reiterate to people that we are listening to what they tell us. We know that nobody knows farmers’ needs better than the farmers themselves."
        },
        {
            "text": "James: Fantastic. And Samantha mentioned the opportunity to take part in videos; I believe this has been a real focus for you and the team recently?"
        },
        {
            "text": "Jen: It has, yes. So we’re looking to create more videos that actually feature farmers, showing their experience in real time so that we can fully understand their perspective and their challenges. And equally we’re also doing a lot more videos to show people how to do things. So how to apply for schemes and how to use certain aspects of the systems. Recently what we did was get some customers to give us their views on the videos we have on our YouTube page. So these were how to tutorials really and, as a result of the feedback that we got, we’re making improvements to the voiceover, we’re clarifying the introductions, giving more information within the video and also looking at accessibility is greater detail. So the feedback that we’ve already had is already having such a tremendous impact and we’ll be sharing those new and improved videos with the customers who helped with this project first and thanking them for their suggestions. But yes, videos are definitely something we want to do more of and is something that will definitely feature on the panel."
        },
        {
            "text": "James: Thanks Jen. And finally Megan, how can our listeners find out more about the RPA Research and Insight Network Group and register their interest?"
        },
        {
            "text": "Megan: Well, the group’s tag line is “come and join our conversation circle”, so we’d love farmers and land managers to get in touch. If you’d like more information or to sign up for the group, please contact us at RPAInsight@rpa.gov.uk. We’re really excited to be launching the Research and Insight Network Group and want our customers to help us shape it to be a space where we work together to achieve great things for all our customers. We really are committed to working in partnership; to help us improve our service by ensuring that all our customers voices’, agricultural communities and businesses are heard, understood and involved in decision making across all sectors."
        },
        {
            "text": "James: Thanks Megan. It certainly sounds like an exciting time to join the RPA Research and Insight Network Group and we’ll talk more about the events and insights in future podcasts. Thank you all for your time today."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "So, that brings us to the end of today’s podcast. Thank you to Alex, Rozanne, Duncan, Megan, Samantha and Jen, and thank you once again for listening. Just a reminder that if you would like us to cover a particular topic with our subject experts, please do get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on Twitter - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the third RPA podcast as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": " "
        },
        {
            "text": "****Close music to fade****"
        }
    ]
}