{
    "url": "https://defrafarming.blog.gov.uk/2022/05/06/tree-health-pilot-what-weve-learned-so-far-and-how-you-can-help/",
    "title": "Tree Health pilot: what we’ve learned so far and how you can help  ",
    "authors": [
        "Joe Harrison"
    ],
    "categories": [
        "Payments to improve tree health",
        "Ways to get involved"
    ],
    "pub_date": "2022-05-06T11:36:32+01:00",
    "content": [
        {
            "text": "Trees play an incredibly important role in our natural environment, urban spaces, culture, wellbeing, and economy. You might remember we blogged about this a few months ago.  "
        },
        {
            "text": "Just last year, Forest Research reported a record number of tree pest and disease enquiries. Climate change is worsening the problem, by leaving many of our native tree species stressed and more vulnerable to disease. Pests and diseases which previously couldn’t survive in this country can now thrive. "
        },
        {
            "text": "As part of our response to this, we’re working with the Forestry Commission to deliver the Tree Health Pilot. "
        },
        {
            "text": "The Tree Health Pilot has been live for 8 months. We received over 80 expressions of interest within the target areas. "
        },
        {
            "text": "The pilot tests new ways of providing support to woodland owners and land managers, helping them to stop the spread of pests and diseases, and to minimise damage when it does occur. "
        },
        {
            "text": "We want to expand on what’s already provided in Countryside Stewardship grants. Our goal is to build a broad, supportive, easy-to-use Tree Health Scheme from 2024 - once the Tree Health Pilot and Countryside Stewardship Tree Health schemes end. "
        },
        {
            "heading": 3,
            "text": "The eight-toothed spruce bark beetle in the south-east "
        },
        {
            "text": "During the pilot, we worked with owners of spruce in the south-east of England, to support the response to the outbreak of the eight-toothed spruce bark beetle which poses a risk to millions of trees. "
        },
        {
            "text": "The Tree Health Pilot provided support to landowners to cover the cost of felling and destroying infected spruce trees, infrastructure and biosecurity kit, and resilient restocking.  "
        },
        {
            "text": "Tree Health Pilot grants have played a part in the wider joint effort to contain this outbreak. The early results are positive. "
        },
        {
            "heading": 3,
            "text": "Larch and ash trees in the north-west "
        },
        {
            "text": "Meanwhile, we’ve been working with many owners of larch trees in the north-west, supporting the removal of difficult to access, small, or undermanaged infected larch trees, to slow the spread of disease. "
        },
        {
            "text": "We’re also working with owners of ash trees along roadsides, to support people to work together to collectively remove and restock dying ash.  "
        },
        {
            "text": "Working on a small scale in a targeted way, we’re trialling payments for road closures and site surveys, to help people manage dangerous ash with minimal disruption to communities or nature.  "
        },
        {
            "heading": 3,
            "text": "An invitation to owners of sweet chestnut trees and oak trees "
        },
        {
            "text": "We’re keen to encourage more applications from owners of sweet chestnut with either sweet chestnut blight or Phytophthora ramorum. "
        },
        {
            "text": "Sweet chestnut trees are an important and iconic native species, and are often found in mixed woodlands, hedgerows, and as stand-alone trees – meaning they haven’t always previously been eligible for grant support.  "
        },
        {
            "text": "We are particularly keen to make sure we test support for these kinds of trees. We welcome more applications. "
        },
        {
            "text": "Later this spring we will open applications for the oak processionary moth support offer within the Tree Health Pilot."
        },
        {
            "text": "The scheme will be open in the established area of oak processionary moth only, and will pay for people to form a group, survey their oak trees, and create a collective plan for management.  "
        },
        {
            "text": "This management plan should help communities independently manage their oak trees, to preserve this beautiful and iconic species, while minimising damages to human health. For more information on the oak section of the pilot, please contact thpilotenquiries@forestrycommission.gov.uk.  "
        },
        {
            "text": "The Tree Health Pilot is open for applications until 2023. If you think you might be eligible, we’d love to hear from you. Check your eligibility and apply on GOV.UK."
        }
    ]
}