{
    "url": "https://hodigital.blog.gov.uk/2022/05/06/want-a-career-in-tech-our-graduate-dynamic-development-scheme-opens-soon/",
    "title": "Want a career in tech? Our graduate Dynamic Development Scheme opens soon",
    "authors": [
        "Dan Carr, DDS Technology Delivery Manager Associate"
    ],
    "categories": [
        "Graduates",
        "Recruitment"
    ],
    "pub_date": "2022-05-06T12:32:10+01:00",
    "content": [
        {
            "text": "The Dynamic Development Scheme (DDS) is an exciting two-year rotational programme for graduates with a minimum 2.2 degree in any subject who are passionate about working in Digital, Data and Technology (DDaT)."
        },
        {
            "text": "During your first year you will complete six-month placements supporting DDaT projects working within different DDaT multidisciplinary teams."
        },
        {
            "text": "In the second year you will complete a 12-month placement and choose a preferred specialism from five options. You will also have a great opportunity to develop and broaden your skills and undertake specialist training."
        },
        {
            "text": "You will form part of a diverse and supportive graduate network, with mentors to help support you shape your career."
        },
        {
            "text": "Our Associates on DDS receive a competitive starting salary (£35,054) London, (£30,817) National."
        },
        {
            "text": "Dan Carr is just coming to the end of his second six-month placement on the scheme."
        },
        {
            "text": "Tell us about your current placement as a Technology Delivery Manager"
        },
        {
            "text": "Hi I’m Dan. I’m currently on the scheme as a Technology Delivery Manager (DM) in the Home Office Forms (HOF) team. Unlike what I thought before joining the Civil Service, being a Technology Delivery Manager has nothing to do with vans, bikes or packages! At its core, delivery management is really an enabling role. It’s all about helping the team maximise the amount of quality work being produced."
        },
        {
            "text": "HOF is chiefly a software development team, so my day-to-day activities include running planning meetings, communicating with our varied stakeholders, removing blockers, and keeping our Kanban board looking as neat and tidy as possible. If I’m doing my job well, everyone else in the team should find they have more time to focus on the things that matter in their jobs."
        },
        {
            "text": "How did you join the DDS in the Civil Service? "
        },
        {
            "text": "I originally applied for the graduate Fast Stream. Although I wasn’t accepted on the Fast Stream luckily my assessment centre scores were good enough to earn me a place on the Direct Appointment Scheme (a “people with potential” pool). From there, I got selected to join the Home Office as part of the DDS."
        },
        {
            "text": "The DDS checked a lot of the boxes I was looking for, in particular the opportunity to rotate between different roles. As I wanted to career-switch from science into data and technology, being able to get an understanding of different jobs was essential to me. So, I jumped at the chance to join the DDS!"
        },
        {
            "text": "Tell us a bit about your colleagues in the Home Office"
        },
        {
            "text": "Imagine if you found out you were joining a new type of team you’d never worked in before, in a role where you had basically zero experience. On top of that, there’s currently no one in the team doing that role, so you have to carve out your own niche. That was my situation six months ago before joining my current placement. I was excited for the challenge, but naturally very nervous too."
        },
        {
            "text": "From day one the supportive and friendly nature of my placement manager and my team allayed these fears. I can’t thank the HOF team enough for their patience and understanding when I first joined. What they get right, in my opinion, is really valuing people, sharing responsibility as a team and always encouraging learning and development."
        },
        {
            "text": "I also have the support of the wonderful graduates in my cohort. It’s invaluable to share experiences and learning with a lovely group of like-minded people from diverse backgrounds."
        },
        {
            "text": "What makes you proud to be a civil servant?"
        },
        {
            "text": "There are two big things."
        },
        {
            "text": "The first is my colleagues. I’ve already spoken about my team and the DDS cohort, but it goes even wider than that. I’ve interacted with a diverse range of colleagues in the Civil Service, all unified by their friendliness, helpfulness, and motivation to get the best possible job done. It’s inspiring to be surrounded by people dedicated to making improvements for the public good."
        },
        {
            "text": "I’ve just touched on the second thing that makes me proud: serving the public. For me, that’s really what it’s all about. It’s easy to get caught up in the smaller details, but I love to regularly take a wider look and remember that everything I’m doing is contributing to making peoples’ lives better."
        },
        {
            "text": "What advice would you give to a young person who is unsure about joining the Civil Service?"
        },
        {
            "text": "One of the best things about the Civil Service is there’s such a range of different jobs in different departments out there. No matter what skills you have or want to gain, there is a Civil Service role that’s suited to you."
        }
    ]
}