{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/05/06/what-is-the-gut-microbiota/",
    "title": "What is the gut microbiota?",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Guest Blog"
    ],
    "pub_date": "2022-05-06T15:53:19+01:00",
    "content": [
        {
            "text": "Our bodies are full of trillions of bacteria, viruses and fungi. Collectively, they are known as the microbiota and the combination of their collective genomes is called the microbiome. Imagine a jungle, but instead of trees, insects and animals, we have bacteria, viruses and fungi. Just like how the trees are needed for oxygen and insects to keep the soil healthy, we need many different types of microbes to carry out different jobs. There are more bacterial cells in your body than human cells, with 40 trillion bacterial cells in your body and only 30 trillion human cells we are technically more bacteria than human!"
        },
        {
            "text": "While it is true that some bacteria are associated with disease, others are vitally important for digestion, your immune system and many other aspects of health. These microbes mainly reside in our intestines and on our skin. Most of the microbes in your intestines are found in the large intestine and they are referred to as the ‘gut microbiota’."
        },
        {
            "text": " "
        },
        {
            "text": "How have we acquired our gut microbiota?"
        },
        {
            "text": "The population of the microbiome is highly dependent on your environment and varies greatly between individuals. You are first exposed to microbes when you pass through your mother’s birth canal. As you grow, your gut microbiome begins to diversify, through diet and exposure to new environments, meaning it starts to contain many different types of microbial species. Higher microbiome diversity is considered good for your health."
        },
        {
            "text": " "
        },
        {
            "text": "How does the gut microbiota benefit me?"
        },
        {
            "text": "The microbiota stimulate the immune system, synthesise certain vitamins such as vitamin K and B12 (enzymes required to synthesize B12 are only found in bacteria) and break down complex carbohydrates and fibre using their digestive enzymes. The fermentation of indigestible fibres produces short chain fatty acids which act as a nutrient source for bacteria and are involved in muscle function and immunity. The microbiota also provide protection from pathogenic organisms that enter through consuming contaminated food and drink."
        },
        {
            "text": " "
        },
        {
            "text": "How can I support my gut microbiota? Prebiotics and probiotics"
        },
        {
            "text": "Probiotics are foods that have been fermented and contain live cultures of bacteria. Some examples of food which contain probiotics include yoghurt, kefir, sauerkraut and kombucha. These work to reintroduce bacteria that may be missing. Prebiotics are the fuel – fibre-rich foods and the types of carbohydrates that cannot be digested. These types of foods pass through your intestines undigested so your microbiota can feed off them. Examples include legumes, nuts, seeds, whole grains and skins of fruits and vegetables. While supplements may be useful, they can vary in effectiveness you should always consult with your doctor when making changes to your diet."
        },
        {
            "text": " "
        },
        {
            "text": "Power of the gut microbiota"
        },
        {
            "text": "Together, these microbes weight between 1-2 kg, roughly the same weight as our brain and function as a powerful second organ playing a huge role in our health. Examples of this power has been found in several well-known studies."
        },
        {
            "text": "Studies have shown that the gut microbiome differed completely between identical twins, one of whom was obese and one of whom was healthy. This demonstrated that differences in the microbiome were not genetic. Interestingly, in one study, when the microbiome from the obese twin was transferred to mice, they gained more weight than those that had received the microbiome of the lean twin, despite both groups eating the same diet. This suggests how our microbiota is populated may have a considerable impact although more research is required to determine results in humans."
        },
        {
            "text": "It's important to note that we don’t know what a healthy gut microbiome looks like exactly and what types and amounts of microbes are beneficial from person to person. But we know that to help support the growth of healthy microbiota in your gut, eating a wide variety of fruits, vegetables, whole grains and fermented foods will go a long way."
        }
    ]
}