{
    "url": "https://defradigital.blog.gov.uk/2022/05/06/what-is-technology-innovation-exploration-and-why-do-we-do-it/",
    "title": "What is Technology Innovation exploration and why do we do it?",
    "authors": [
        "Marcus Melton"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra Science and Innovation",
        "Digital transformation"
    ],
    "pub_date": "2022-05-06T07:00:44+01:00",
    "content": [
        {
            "text": "I work in Technology Innovation, a small team that sits in Architecture, Data, Information, and Innovation (ADII) within Digital, Data and Technology Services (DDTS). Our target is to encourage the exploration and adoption of emerging technologies across Defra to better achieve our departmental objectives."
        },
        {
            "text": "We work across three core workstreams - Horizon Scanning, Consultancy and Exploration. I will be focusing on Exploration for this blog, touching on what exactly Exploration is and why it is important for Defra."
        },
        {
            "heading": 2,
            "text": "What is Exploration and why is it important? "
        },
        {
            "text": "Exploration is a term we use for the practical testing of technologies within a Defra context. Exploration can come in the shape of Proof of Concepts (PoC), Proof of Values (PoV) or Pilots, with each type of initiative differing slightly in terms of how widely the technology solution is tested. These initiatives are usually designed to be short-term, timeboxed pieces of work, with limited budgets to test and understand if a proposed technology solution has potential."
        },
        {
            "text": "Due to being light-touch and aimed at getting a steer on the big questions rather than answering every question there may be, explorations do not have to go through our formal project process ,and instead go through a shorter, more flexible Technology Innovation governance workflow."
        },
        {
            "text": "Exploration is really important for the department as it enables Defra to test potential ideas in a cheap and time-boxed way, informs business leaders on significant IT decisions and ultimately encourages us to push the boundaries of our work."
        },
        {
            "text": "Some explorations uncover better ways to overcome our problems, others show that maybe the current solution is still the best and this is ok - both enable the business to make the right decision and save time, money, and resources in the long-run."
        },
        {
            "heading": 5,
            "text": "The team has explored how Virtual Reality driven meetings could enable better dispersed working across Defra"
        },
        {
            "heading": 2,
            "text": "What exploration is currently ongoing?"
        },
        {
            "text": "Covid-19 has seen the team take on an increasing number of explorations, with opportunities to do things differently arising in the new Blended Working world. Our most sophisticated exploration at the moment is Internet of Things (IoT) for Forest Monitoring, which has actually been so successful it has been nominated for an award and extended as a pilot."
        },
        {
            "text": "IoT for Forest Monitoring provides the remote monitoring of forest health through automated readings including tree girth and temperature which in turn enables easier, cheaper, and better forest management."
        },
        {
            "text": "Another exciting ongoing exploration is Augmented Reality (AR) for the Thames Barrier. In this opportunity we are using AR as a training tool for junior members of staff, enabling experienced colleagues to provide AR-driven training guides that the learner can use to learn in-situ and on the job. The benefit of this work is saved costs in technician callouts and effective interactive training being accessible 24/7."
        },
        {
            "text": "And finally, we have been busy exploring new technologies for Defra to make the most of our new Blended Working approach. We have presented much of our work to hundreds of colleagues at the monthly Enterprise Collaboration and Hybrid Working Show & Tells, including our testing of new video conferencing (VC) equipment."
        },
        {
            "heading": 5,
            "text": "Augmented Reality is also being explored to see if it can enable better guidance and training for colleagues undertaking operational tasks."
        },
        {
            "text": "Alongside colleagues, we have tested new VC cameras for small and large meeting rooms across the Defra estate, widening the capability for colleagues to have effective hybrid meetings (no need to huddle around a laptop!). These cameras are now being piloted in Defra offices across the country."
        },
        {
            "heading": 2,
            "text": "What are the benefits of technology innovation? "
        },
        {
            "text": "Each exploration initiative offers its own unique benefits, but these usually fall into three categories – better user experience, improved productivity, or reduced costs. A recent example is our Natural Language Processing pilot which provided a better user experience for members of the public calling the RPA customer contact centre."
        },
        {
            "text": "An automated bot listened to their spoken concerns and automatically sent them links to relevant web pages, all while they were in the queue to speak to a customer agent – with 61% of service transactions being completed faster as a result."
        },
        {
            "text": "For improved productivity, we can look at the Chatbot for Content Cloud pilot (due to go live in May 2022). This initiative will place a chatbot on Defra’s internal Content Cloud service – guiding users through the service, instantly answering their questions and proactively providing helpful reminders and tips. It is expected that this virtual assistant will provide beneficial guidance for thousands of Content Cloud users and result in a better, more efficient service for the department."
        },
        {
            "heading": 5,
            "text": "The Foss Barrier was recreated in virtual reality, demonstrating the ability to examine structures prior to construction or alternation."
        },
        {
            "text": "Finally, explorations can shine a light on possibilities in reducing costs. The Technology Innovation team achieved this through creating a realistic model of the Foss Barrier in virtual reality, demonstrating the valuable ability to investigate, examine and discuss assets before they are built. It is believed this approach could enable significant savings in building and maintenance costs of large structures across Defra."
        },
        {
            "text": "Technology innovation exploration can (and often does!) provide benefits in more than just one area and to more than one set of stakeholders (both internal and external to Defra) - it is this variety that makes the role exciting!"
        },
        {
            "heading": 2,
            "text": "What explorations are coming up? "
        },
        {
            "text": "Right now is a really interesting time for the Technology Innovation team as we line up some exciting exploration opportunities for 2022 and beyond. These initiatives include Low Earth Orbit (LEO) satellite connectivity, to enable automated monitoring in remote areas, IoT to monitor and proactively notify of potential felling in trees, and Virtual Reality to support Blended Working. We're looking forward to completing these explorations and seeing what other challenges and ideas colleagues present to us throughout the year."
        },
        {
            "heading": 2,
            "text": "Want to know more? "
        },
        {
            "text": "If you would like to learn more about Technology Innovation exploration in Defra and what the team does, or to share your ideas, please get in touch."
        },
        {
            "text": " "
        }
    ]
}