{
    "url": "https://insidehmcts.blog.gov.uk/2025/10/15/behind-the-scenes-the-people-of-pecs/",
    "title": "Behind the scenes: The people of PECS ",
    "authors": [
        "Simon Manko,Senior Contract Delivery Manager of PECS"
    ],
    "categories": [
        "Crime",
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2025-10-15T12:06:27+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Often referred to as the Old Bailey, London’s Central Criminal Court (CCC) deals with some of the country’s most high-profile cases. Every day, Prisoner Escort and Custody Services (PECS) colleagues play a crucial role in ensuring the court runs smoothly and everyone in their care remains safe. "
        },
        {
            "text": "In part one of our series, we explored PECS’ wider role within the criminal justice system. Here, we take you through a typical day at the CCC, told through the voices of Serco operational colleagues delivering the contract. "
        },
        {
            "heading": 2,
            "text": "Briefings and checks "
        },
        {
            "text": "Jack, Deputy Court Custody Manager starts early, coordinating staff, managing last-minute changes and ensuring everything is ready before the first van arrives.  "
        },
        {
            "text": "He begins with the morning briefing, covering everything from conflicts between individuals in custody to highlighting those at risk of self-harm or with medical needs. “It’s about keeping everyone safe, both staff and those in our care.” "
        },
        {
            "text": "After the briefing, Jack ensures all security measures are in place: doors locked, checks completed, and vehicles ready.  "
        },
        {
            "heading": 2,
            "text": "The prisoners arrive "
        },
        {
            "text": "Prisoners will usually arrive between 8:30am and 9:30am, for a 10am court start. "
        },
        {
            "text": "Una, a Prisoner Custody Officer with 20 years' experience, is often the first point of contact. Her role is looking after prisoners' welfare and ensuring everyone is safe and secure.  "
        },
        {
            "text": "“I see these prisoners every day because our trials can be three months or longer. You get to know them,” Una explains. “Sometimes they’re chatty, sometimes in low mood. You can’t be judgmental.” "
        },
        {
            "text": "Una has seen returning prisoners, familiar faces and the subtle ways people communicate their needs. “Some want their favourite prayer mat saved, or a certain book. It’s about those little comforts. If they get volatile, you can talk them down because you’ve built that trust.” "
        },
        {
            "heading": 2,
            "text": "Daily realities and challenges "
        },
        {
            "text": "Moriam, also Deputy Court Custody Manager, explains the daily logistics: “The first thing you do is check how many custodies are coming in, then make sure they’re on the court list. We will then assign the available staff to specific duties for the day, for example cells officers. legal officers and dock officers.”  "
        },
        {
            "text": "Jack highlights the unpredictability of the job and constant juggle managing the unpredictability. Even on a ‘quiet’ day, the scale is daunting: “Imagine 38 to 41 people in custody, with only 18 courtrooms. Getting everyone in, keeping them safe and ensuring courts run smoothly. It’s a lot.” "
        },
        {
            "text": "Delays can stem from staff shortages to unexpected traffic jams to custody misbehaviour before they enter the vehicle to issues in the prison they are coming from but blame often lands with PECS staff. Una explains: “We’re seen as the face of the end point – getting the prisoner to court on time. But we’re part of a bigger puzzle. Mostly, things run smoothly, but when they don’t, it’s often out of our control.” "
        },
        {
            "text": "Getting prisoners to court on time is a top priority. “If you fail the dock, it’s bad. The judges think about the public purse and impacts of delays, and pressure is on us to keep things moving.” "
        },
        {
            "heading": 2,
            "text": "The power of communication "
        },
        {
            "text": "Dimitrios, Court Cluster Manager, manages several of London’s busiest courts through relationships and problem-solving: “I need to have a very good relationship with judges and court users to ensure everything runs smoothly.”  "
        },
        {
            "text": "He describes collaborative working across agencies to ensure effective working, improving access to justice for all: “Every Thursday we meet with the Recorder, the HMCTS manager, HMPPS and me to discuss any ongoing issues and cases. "
        },
        {
            "text": "Moriam further highlights the importance of shared understanding between legal professionals and PECS: “Often people aren't aware of all the processes we go through, and how reliant we are on others. We should organise more visits to the custody suites with the clerks and ushers so they can get a feel of what it’s like.” "
        },
        {
            "text": "Jack, Una, Dimitrios and Moriam’s stories remind us of the unseen work behind the smooth running of the justice system. Delivering PECS is not just about logistics, it’s about people, teamwork, resilience in unpredictable situations and supporting vulnerable people's safety and wellbeing. For more information about PECS, including how different roles and responsibilities across the justice system support the process you can read the newly published HMPPS PECS user guide. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Y tu ôl i'r llenni: Pobl PECS "
        },
        {
            "text": "Mae Llys Troseddol Canol Llundain (CCC), y cyfeirir ato'n aml fel yr Old Bailey, yn delio â rhai o achosion mwyaf uchel eu proffil y wlad. Bob dydd, mae cydweithwyr Gwasanaethau Carcharu a Hebrwng Carcharorion (PECS) yn chwarae rhan hanfodol wrth sicrhau bod y llys yn mynd rhagddo’n esmwyth a bod pawb yn eu gofal yn aros yn ddiogel. "
        },
        {
            "text": "Yn rhan un o'n cyfres, fe wnaethom archwilio rôl ehangach PECS o fewn y system gyfiawnder troseddol. Yma, rydyn ni'n mynd â chi trwy ddiwrnod arferol yn y CCC, a adroddir gan gydweithwyr gweithredol Serco sy'n cyflawni’r contract. "
        },
        {
            "heading": 2,
            "text": "Sesiynau briffio a gwiriadau "
        },
        {
            "text": "Mae Jack, Dirprwy Reolwr Dalfa’r Llys yn dechrau'n gynnar, yn cydlynu staff, yn rheoli newidiadau munud olaf a sicrhau bod popeth yn barod cyn i'r fan gyntaf gyrraedd.  "
        },
        {
            "text": "Mae'n dechrau gyda'r sesiwn friffio yn y bore, sy'n cynnwys popeth o wrthdaro rhwng unigolion yn y ddalfa i dynnu sylw at y rhai sydd mewn perygl o hunan-niweidio neu ag anghenion meddygol. \"Mae'n ymwneud â chadw pawb yn ddiogel, staff a'r rhai sydd yn ein gofal.\" "
        },
        {
            "text": "Ar ôl briffio pawb, mae Jack yn sicrhau bod yr holl fesurau diogelwch ar waith: bod y drysau wedi'u cloi, bod gwiriadau wedi'u cwblhau, a bod y cerbydau yn barod.  "
        },
        {
            "heading": 2,
            "text": "Y carcharorion yn cyrraedd "
        },
        {
            "text": "Y carcharorion yn cyrraedd "
        },
        {
            "text": "Bydd carcharorion fel arfer yn cyrraedd rhwng 8:30am a 9:30am, ar gyfer dechrau’r llys am 10am. "
        },
        {
            "text": "Una, Swyddog Dalfa’r Carcharorion gydag 20 mlynedd o brofiad, yn aml yw'r pwynt cyswllt cyntaf. Ei rôl yw gofalu am les carcharorion a sicrhau bod pawb yn ddiogel. "
        },
        {
            "text": "\"Rwy'n gweld y carcharorion hyn bob dydd oherwydd bod ein treialon yn debygol o bara tri mis neu fwy. Rydych chi'n dod i'w hadnabod,\" eglura Una. \"Weithiau maen nhw'n sgwrsio, weithiau maent mewn hwyliau isel. Allwch chi ddim bod yn feirniadol.\" "
        },
        {
            "text": "Mae Una wedi gweld carcharorion sy'n dychwelyd, wynebau cyfarwydd a'r ffyrdd cynnil y mae pobl yn cyfathrebu eu hanghenion. \"Mae rhai eisiau eu hoff fat gweddi wedi'i gadw, neu lyfr penodol. Mae'n ymwneud â'r cysuron bach hynny. Os ydyn nhw'n mynd yn gyfnewidiol, gallwch chi siarad â nhw oherwydd eich bod wedi meithrin yr ymddiriedaeth honno.\" "
        },
        {
            "heading": 2,
            "text": "Realiti a heriau dyddiol "
        },
        {
            "text": "Mae Moriam, sydd hefyd yn Ddirprwy Reolwr Dalfa’r Llys, yn esbonio'r logisteg ddyddiol: \"Y peth cyntaf rydych chi'n ei wneud yw gwirio faint o garcharorion sy'n dod i mewn, yna gwneud yn siŵr eu bod ar restr y llys, yna gwirio niferoedd staff, pwy sydd ar wyliau, yn sâl... popeth.\"  "
        },
        {
            "text": "Mae Jack yn tynnu sylw at anrhagweladwyedd y swydd a rheoli'r anrhagweladwyedd hwnnw. Hyd yn oed ar ddiwrnod 'tawel', mae'r raddfa yn frawychus: \"Dychmygwch 38 i 41 o bobl yn y ddalfa, gyda dim ond 18 ystafell lys. Cael pawb i mewn, eu cadw'n ddiogel a sicrhau bod y llysoedd yn mynd rhagddynt yn esmwyth. Mae'n lot.\" "
        },
        {
            "text": "Gall oedi ddeillio o brinder staff i oedi o ran teithio i gamymddwyn yn y ddalfa cyn ac yn ystod y broses gludo i faterion yn y carchar ond mae'r bai yn aml yn cael ei roi ar staff PECS. Eglura Una: \"Rydyn ni'n cael ein gweld fel y pwynt terfynol - cael y carcharor i'r llys ar amser. Ond rydyn ni'n rhan o rywbeth mwy. Yn bennaf, mae pethau'n mynd rhagddynt yn llyfn, ond pan nad ydyn nhw'n gwneud hynny, mae'n aml allan o'n rheolaeth.\" "
        },
        {
            "text": "Mae cael carcharorion i'r llys ar amser yn brif flaenoriaeth. \"Os ydych chi'n methu'r doc, mae’r effaith yn ddrwg. Mae'r barnwyr yn meddwl am y pwrs cyhoeddus ac effeithiau’r oedi, ac mae'r pwysau arnom i gadw pethau i fynd rhagddynt.\" "
        },
        {
            "heading": 2,
            "text": "Pŵer cyfathrebu "
        },
        {
            "text": "Mae Dimitrios, Rheolwr Clwstwr y Llysoedd, yn rheoli nifer o lysoedd prysuraf Llundain trwy feithrin perthnasau a datrys problemau: \"Mae angen i mi gael perthynas dda iawn gyda barnwyr a defnyddwyr llys i sicrhau bod popeth yn mynd rhagddo’n esmwyth.\"  "
        },
        {
            "text": "Mae'n cydweithio ar draws asiantaethau i sicrhau gwaith effeithiol, gan wella mynediad at gyfiawnder i bawb: \"Bob dydd Iau rydym yn cwrdd â'r Cofiadur, rheolwr GLlTEF, HMPPS a minnau i drafod unrhyw faterion ac achosion parhaus. "
        },
        {
            "text": "Mae Moriam yn tynnu sylw ymhellach at bwysigrwydd dealltwriaeth a rennir rhwng gweithwyr proffesiynol cyfreithiol a PECS: \"Yn aml nid yw pobl yn ymwybodol o'r holl brosesau rydyn ni'n mynd drwyddynt, a pha mor ddibynnol ydym ar eraill. Dylem drefnu mwy o ymweliadau ag ystafelloedd y ddalfa gyda'r clercod a'r tywyswyr fel y gallant gael teimlad o sut beth ydyw.\" "
        },
        {
            "text": "Mae straeon Jack, Una, Dimitrios a Moriam yn ein hatgoffa o'r gwaith sy’n digwydd y tu ôl i’r llenni i gynnal y system gyfiawnder. Nid yw cyflwyno PECS yn ymwneud â logisteg yn unig, mae'n ymwneud â phobl, gwaith tîm a gwytnwch mewn sefyllfaoedd anrhagweladwy a chefnogi diogelwch a lles pobl agored i niwed. I gael rhagor o wybodaeth am PECS, gan gynnwys sut mae rolau a chyfrifoldebau gwahanol ar draws y system gyfiawnder yn cefnogi'r broses, gallwch ddarllen canllaw defnyddiwr PECS HMPPS sydd newydd ei gyhoeddi. "
        }
    ]
}