{
    "url": "https://defrafarming.blog.gov.uk/2025/10/15/extension-offer-for-2021-countryside-stewardship-mid-tier-agreements/",
    "title": "Extension offer for 2021 Countryside Stewardship Mid Tier agreements ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2025-10-15T11:04:07+01:00",
    "content": [
        {
            "text": "We’re offering a one-year extension to more than 5,000 Countryside Stewardship Mid Tier (CS MT) agreement holders whose agreements are set to expire on 31 December this year.  "
        },
        {
            "text": "This targeted, time-limited extension is being offered while we develop the reformed Sustainable Farming Incentive for 2026, refresh the Environmental Improvement Plan and roll out the new Countryside Stewardship Higher Tier scheme.   "
        },
        {
            "text": "The one-off extension will help agreement holders to maintain their essential contribution to sustainable food production and the restoration of nature.  "
        },
        {
            "text": "In this post, we’ll share a summary of the offer and the action you’ll need to take.  "
        },
        {
            "heading": 2,
            "text": "About the extension "
        },
        {
            "text": "The extension will move the end date of your agreement to a later point – in this case, to 31 December 2026. "
        },
        {
            "text": "You’ll continue under the same rules, terms and conditions as your existing CS MT agreement. "
        },
        {
            "text": "Please note: "
        },
        {
            "heading": 2,
            "text": "What you need to do "
        },
        {
            "text": "The Rural Payments Agency (RPA) will contact you within the next few weeks if your CS MT agreement is eligible for an extension.  "
        },
        {
            "text": "If you want an extension, you must reply to the offer. Your agreement and payments will then continue after 31 December 2025. "
        },
        {
            "text": "If you do not want to continue with your agreement, or cannot meet the conditions of the extension, let the RPA know.  "
        },
        {
            "text": "If you do not reply by the date in your extension offer, you will not be able to extend your agreement, and it will end on 31 December 2025. "
        },
        {
            "text": "If you have not heard from the RPA by 6 November and have a CS MT agreement expiring in December 2025, you can call the RPA to check. "
        },
        {
            "text": "You can read the full details of the extension, including what you need to do, on GOV.UK."
        }
    ]
}