{
    "url": "https://defrafarming.blog.gov.uk/2025/10/15/fetf-2025-over-8800-applicants-offered-grant-funding/",
    "title": "FETF 2025: Over 8,800 applicants offered grant funding",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2025-10-15T09:47:31+01:00",
    "content": [
        {
            "text": "We’re pleased to confirm that over 8,800 applicants have successfully secured funding through this year’s Farming Equipment and Technology Fund (FETF). Grant Funding Agreements (GFAs) have now been sent. "
        },
        {
            "text": "Together, the successful offers are worth more than £68.4 million."
        },
        {
            "text": "Funding will help thousands of farmers, horticulturalists, forestry owners and associated contractors invest in new machinery – from autonomous robots that plant seeds with precision to slurry separator systems that reduce both waste and costs. "
        },
        {
            "text": "As FETF is a competitive fund, those whose applications weren’t selected have received an email explaining why. "
        },
        {
            "text": "In this post, we shine a light on two farm businesses that benefitted from previous FETF funding. They explain how the funding helped them work more efficiently and protect their profits."
        },
        {
            "heading": 2,
            "text": "Colin J Collins Ltd: improved farming operations"
        },
        {
            "text": "Last year, Worcestershire-based Colin J Collins Ltd secured grant funding from FETF for two farming systems. "
        },
        {
            "text": "A direct drill allows them to sow crops without ploughing first, reducing the time and fuel needed for soil preparation, while helping maintain soil structure and health. "
        },
        {
            "text": "They also invested in a mobile sheep handling system. It makes everyday livestock tasks quicker and safer – tagging lambs, shearing sheep, and carrying out routine health checks are all easier to manage both in the yard and out in the field. "
        },
        {
            "text": "Together, these investments strengthen both their arable and livestock operations, helping the farm run more efficiently and safely while supporting long-term productivity. "
        },
        {
            "heading": 2,
            "text": "T H Turner & Son’s precision slurry management "
        },
        {
            "text": "T H Turner & Son in Warwickshire also strengthened their farm operations last year with precision slurry management technology."
        },
        {
            "text": "This has modernised how they apply slurry, reducing artificial fertiliser use and waste while improving crop nutrition. "
        },
        {
            "text": "They have added 3 pieces of kit. A flow rate monitoring system provides real-time measurement of slurry movement through pipelines, helping them spot any problems quickly."
        },
        {
            "text": "This system has a minimum working width of 8 metres and applies slurry using trailing shoes. These part the crop, place the slurry directly onto the soil surface, and then close the crop again. "
        },
        {
            "text": "This method greatly reduces ammonia emissions and nutrient losses compared with traditional low-trajectory spreading. It also supports better soil health and improves the efficiency of fertiliser use. "
        },
        {
            "text": "This technology uses near infra-red (NIR) spectrometry to continuously monitor the nutrient content of slurry during application. "
        },
        {
            "text": "By providing real-time data, it enables more accurate, site-specific nutrient management. This helps to optimise fertilisation while also protecting water quality. "
        },
        {
            "heading": 2,
            "text": "Next steps for successful applicants "
        },
        {
            "text": "We encourage successful applicants to read their agreements carefully to make sure they understand the terms, conditions, and claim deadline: midday on 31 March 2026."
        },
        {
            "text": "Follow the link in your email to accept or decline the offer before the deadline. The Rural Payments Agency (RPA) is available to help with any questions. "
        },
        {
            "text": "We’d also love to hear from you. If you’d like to share your stories and let us know how you’ve put the funding to use – just leave a comment. It’s great to see the difference new machinery and technology are making on farms across England. "
        },
        {
            "text": "Thank you for your interest in FETF 2025. We look forward to seeing the positive impact on thousands of farming businesses."
        },
        {
            "text": "Subscribe to the Farming Blog to receive a notification whenever a new post is published. "
        }
    ]
}