{
    "url": "https://ipa.blog.gov.uk/2023/05/16/addressing-fuel-poverty-and-the-importance-of-understanding-your-client/",
    "title": "Addressing fuel poverty and the importance of understanding your client",
    "authors": [
        "Frankie Rushton"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Project Delivery"
    ],
    "pub_date": "2023-05-16T14:24:07+01:00",
    "content": [
        {
            "text": "Frankie Rushton, Project Delivery Adviser at the Infrastructure and Projects Authority (IPA), shares her thoughts following a site visit to Coventry, to see the Social Housing Decarbonisation Wave 1 projects in development delivered by DESNZ."
        },
        {
            "text": "The UK has some of the oldest and least energy efficient homes in Europe. A significant number of these social homes are below Energy Performance Certificate rating (EPC) C, meaning that upgrades  need to be made across homes in the UK in order to reduce carbon emissions. That is why the Social Housing Decarbonisation Fund (SHDF) is a Government Major Projects Portfolio (GMPP) programme. The fund aims to improve the energy performance of social homes in England, by upgrading a significant proportion of the social housing stock with a rating of EPC C or below by 2030, while supporting the government’s wider ambition to achieve its Net Zero Commitment by 2050. It will support the installation of energy performance measures in social homes in England through meeting the following objectives: delivering warm and energy efficient homes, reducing carbon emissions, tackling fuel poverty, supporting green jobs, developing the retrofit sector and improving the comfort, health and well-being of tenants."
        },
        {
            "text": "DESNZ have designed this programme with a ‘waved’ approach -  with each tranche designed to build based on previous programme waves. In taking this approach, the investment will see social housing landlords safely improve the energy performance of their properties through the installation of energy efficiency measures and low carbon technologies. This will have a positive impact on tenants’ lives, with benefits including the reduction of bills and improvement in their home’s warmth. It will also ensure that DESNZ helps to build capability in the supply chain and social housing sector, by developing knowledge and capacity to deliver social housing retrofit in the future."
        },
        {
            "text": "Additionally, the SHDF scheme has  a ‘fabric first’ approach (maximising the performance of the components and materials that make up the building fabric) that prioritises the energy efficiency of a property from conception at the start of the design, and through the development process, to maximise a home’s suitability for low-carbon heating, either now or in the future. "
        },
        {
            "text": "On site "
        },
        {
            "text": "Last month, I joined colleagues from the Department for Energy and Net Zero (DESNZ) on a site visit to Coventry where the city council has been working closely with the Citizen Housing Group to deliver SHDF Wave 1. "
        },
        {
            "text": "Coventry is the 10th largest city in England and some areas of the city have high fuel poverty rates. The city received a grant from SHDF Wave 1,  so that a significant number of homes could be treated with an insulated loft hatch, double glazing, loft insulation and external wall insulation. "
        },
        {
            "text": "Our visit began with a meeting in the Friargate council offices, where we were joined by Coventry directors, councillors and surveyors. They discussed their experience of delivering the SHDF Wave 1 programme, including sharing some of their lessons learnt. This included the importance of taking the resident on the journey. SHDF projects are different to traditional asset projects in that the works are often invasive and complex. The teams spoke about the importance of involving residents in the work from the beginning and being part of the decision making process. This means that they are constantly engaged and listened to at all times - transparency is key. "
        },
        {
            "text": "We then drove to two sites where building works were taking place or had already been completed, to see the design and quality of the completed works. The image below demonstrates how the exterior wall insulation appears just like brickwork. Each house received a “like for like” treatment - meaning if it was previously built with brick and pebble dash this would be the effect that would be used. "
        },
        {
            "text": "During the visit we spoke to residents living in the properties that had been upgraded. They commented that as a result of the work done to their homes by the SHDF, they had only used their heating a handful of times during the winter and their home looked and felt brand new. "
        },
        {
            "text": "Development and upskilling "
        },
        {
            "text": "We later visited the Skills Academy that the principal contractor, Westdale Midland Ltd is setting up. The academy will focus on building a new workforce and upskilling the current one by working with local colleges to deliver training and offer apprenticeships in retrofit and gas/electrical engineers​. At the Skills Academy, we put our skills to the test and attempted to create the brick effect render used on the houses that we visited earlier that morning - as experts in project delivery rather than construction, we definitely needed longer at the Skills Academy to pass any of the assessments."
        },
        {
            "text": "Skills and supply chain development has been one of the key successes in the delivery of the programme. SHDF funding has provided confidence in the Coventry market for the PAS2035 (British standard that creates a recognisable quality standard for the retrofit and energy efficiency sector for housing) skill set​, and Westdale’s investment in continuing to build this skills supply chain is evidence of the importance of longer term investment in retrofit. The more confident the market is in this concept, the more the supply chain will respond - we can see the impact of this in Coventry as the Skills Academy seeks to boost the market locally. "
        },
        {
            "text": "Fit for the future "
        },
        {
            "text": "Wave 2 has recently launched with further funding available, enabling local authorities to have a wider reach and support for the retrofit of more properties in their area. It was great to hear how Coventry has learnt from their experiences of the Demonstrator (pilot programme) and Wave 1 and will be applying these learnings in the future. "
        },
        {
            "text": "Colleagues from DESNZ are deeply committed to successful delivery of the programme and seeing their work in action on this site visit has been a fabulous experience as they enable and empower teams to deliver. It’s been a real joy working with the SHDF delivery team and observing their delivery of this major programme throughout the project delivery lifecycle and learning more about the impact on so many lives across England. "
        },
        {
            "text": "Sitting at the heart of government, reporting to the Cabinet Office and HM Treasury, the IPA provides expert project delivery advice, support and assurance to ensure projects are delivered efficiently and effectively. As part of the GMPP, the IPA provides an active support offer to the SHDF by utilising support interventions to maximise benefits across the delivery cycle and will continue to support DESNZ with the implementation of this initiative. For further information on the IPA please see our website here.  "
        }
    ]
}