{
    "url": "https://naturalengland.blog.gov.uk/2023/05/16/children-nature-programme-the-importance-of-integrating-time-spent-in-nature-at-school/",
    "title": "Children & Nature Programme: the importance of integrating time spent in nature at school",
    "authors": [
        "Martin Gilchrist"
    ],
    "categories": [
        "Education",
        "Mental health and wellbeing",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2023-05-16T10:09:06+01:00",
    "content": [
        {
            "text": "Across government, we share an aspiration to create healthy, happy societies. One mechanism for achieving this is by improving the connection people have with nature, which provides better mental and physical health. For children, the effects are more profound, with a wealth of evidence showing those who spend time outside connecting with nature see improvements in school attendance, behaviours, academic achievement, and social skills like teamwork."
        },
        {
            "text": "At Natural England, we aim to deliver solutions for people and the planet. Our expertise and evidence supports nature recovery and removes barriers to accessing nature so that more people can enjoy the many benefits of time spent in nature."
        },
        {
            "text": "The 25 Year environment plan recognised this and Natural England, the Department for Education (DfE) and Defra collaborated on the Children and Nature programme to help provide opportunities for time in nature in disadvantaged areas across different parts of the country."
        },
        {
            "text": "The Programme completed in 2022 and we celebrated the success with delivery partners in the summer that year. Thanks to school-focused projects, 53,000 children experienced more time in nature via community forest visits, residential trips and improvements to school grounds. Care Farms have increased the number of places each year to over 675,000 (a 54 per cent increase)."
        },
        {
            "text": "Care farms, offer people with defined health, social or educational needs the chance to participate in a variety of farming activities, for therapeutic benefit."
        },
        {
            "text": "The programme report is due to be published this summer and the learning is already informing the case for more time in nature in a school day, realising the commitment in the Environmental Improvement Plan to ‘ensure learning in and about nature happens at every level of education.’  We have a series of infographics (some of which are included within this article) to help share this learning more widely. As an example message:  anything can be taught outside, which can aid in achieving a school’s own priorities and objectives."
        },
        {
            "text": "Building time spent in nature into the school day is supported by two aligned DFE initiatives; The National Education Nature Park and Climate Action Award. These are being launched on the 18th May on outdoor classroom day, do look out for #OutdoorClassroomDay on social media."
        },
        {
            "text": "The National Education Nature Park aims to drive and increase engagement with nature for all children and young people. It will encourage the whole of the education estate to work with them to improve the biodiversity of their grounds."
        },
        {
            "text": "From creating pollinator-friendly habitats where biodiversity can thrive, to digging ponds, the concept will showcase how the education estate will create an environment that supports climate resilience."
        },
        {
            "text": "The Nature Park will also provide opportunities for young people to take part in community science, and in biodiversity monitoring and data analysis - learning important/key skills for the future."
        },
        {
            "text": "The climate action award scheme, which will be co-designed in collaboration with children and young people, will help them develop their skills and knowledge in biodiversity and sustainability. It will also celebrate and recognise their work in protecting the local environment. It will act as a demonstration that those children and young people have developed skills and knowledge about climate change and sustainability that will benefit their future studies and careers."
        },
        {
            "text": "Marian Spain, Chief Executive of Natural England reflected; “We’ve known for over a decade how important it is that children learn about - and in - nature, for their health, happiness and their success at school. That’s why I’m so delighted that the learning from the Children and Nature Programme has been able to inform the development of the National Education Nature Park and Climate Action Award scheme.\""
        },
        {
            "text": "Key learnings from this large-scale project to enable schools to successfully embed outdoor learning into their day-to-day activities include:"
        },
        {
            "text": "Read this blog to find out more about the Children & Nature Programme: https://naturalengland.blog.gov.uk/2022/07/25/celebrating-the-children-and-nature-programme-how-learning-in-nature-supports-childrens-mental-and-physical-health-social-skills-and-attainment/"
        },
        {
            "text": "For more information on the Children & Nature Project, please contact Kate Whitehead (Catherine.whitehead@naturalengland.org.uk) or Martin Gilchrist (martin.gilchrist@naturalengland.org.uk)"
        }
    ]
}