{
    "url": "https://onsdigital.blog.gov.uk/2023/05/16/data-apprenticeships-at-the-office-for-national-statistics/",
    "title": "Data apprenticeships at the Office for National Statistics",
    "authors": [
        "jacobstarling"
    ],
    "categories": [
        "Data",
        "DDaT academy",
        "ONS digital people",
        "People and skills",
        "Recruitment"
    ],
    "pub_date": "2023-05-16T09:13:15+01:00",
    "content": [
        {
            "text": "As the UK's largest independent producer of official statistics, we deal with a lot of data - of all different kinds, and with all different purposes. As a result, a large number of our staff have the word  \"data\" in their job title (for example, Data Engineers, Data Scientists and Data Architects).  We also created, and are responsible for the UK government's Data Science Campus, dedicated to maintaining a high level of data literacy across government and investigating methods to push that level even higher."
        },
        {
            "text": "Our 2023 intake of Data Apprentices has just gone live and it's a hugely exciting opportunity to kickstart a career in the data profession with one of the UK's foremost leaders in the field.  We will help you reach a Level 4 Diploma in Data Architecture/Engineering whilst applying what you learn to the exciting and critical projects we do."
        },
        {
            "text": "To get an insight on what it's like to be a Data Apprentice at the Office for National Statistics, I sat down with David Jurgens who's just over half way through this very apprenticeship, having joined us in March 2022."
        },
        {
            "heading": 2,
            "text": "What was it that drew you to our apprenticeship scheme?"
        },
        {
            "text": "I was looking to break into a career in data, having seen the impact that reliable data had during the pandemic. In 2021, I embarked on a Data Science Degree at the Open University and started looking for data engineering roles. As I had previously been working as a musician for ten years, I had little practical experience in working with data. What I found to be really exciting about this apprenticeship scheme was that as long as the candidate had a strong work ethic and a passion for data, it would take in people from different career backgrounds and equip them with the practical skills that are required in data roles today."
        },
        {
            "heading": 2,
            "text": "How are ONS as an employer?"
        },
        {
            "text": "Everybody I’ve worked with within the ONS has been friendly, encouraging, and supportive, and I’ve never felt embarrassed to ask for support when I find technical tasks challenging. The ONS also encourages a healthy work-life balance."
        },
        {
            "heading": 2,
            "text": "What have you leaned in the apprenticeship so far?"
        },
        {
            "text": "For the first ten months of the apprenticeship, I was developing skills in database design, and learnt how to create data models. I also gained an understanding of the importance of metadata."
        },
        {
            "text": "More recently, I have been developing my coding skills in PySpark and Python, and have been introduced to Machine Learning."
        },
        {
            "heading": 2,
            "text": "What’s been the best part of your time at ONS?"
        },
        {
            "text": "I have most enjoyed working in the Development Team for developing a Machine Learning matching tool. I work alongside two highly experienced Data Scientists, and have learnt so much about the life cycle of a Data Science project. I also get to do a lot of coding myself for this project."
        },
        {
            "heading": 2,
            "text": "Do you think you’ll stay at ONS after you’ve completed your apprenticeship?"
        },
        {
            "text": "Yes, definitely! It’s a great place to work."
        },
        {
            "heading": 2,
            "text": "Why should someone consider applying to our Data Apprenticeship?"
        },
        {
            "text": "No matter your previous career background, age or qualifications, this apprenticeship can open the door to a career in data. There are many interesting projects where an apprentice can develop their data engineering and analytical skills. The work that the ONS conducts provides essential data for society, so there is personal satisfaction that the work undertaken during the apprenticeship can improve people’s lives."
        }
    ]
}