{
    "url": "https://teaching.blog.gov.uk/2023/05/16/developing-childrens-reading-skills-with-phonics/",
    "title": "Developing children’s reading skills with phonics",
    "authors": [
        "Janine Ashman"
    ],
    "categories": [
        "English Hubs",
        "Primary schools"
    ],
    "pub_date": "2023-05-16T11:21:37+01:00",
    "content": [
        {
            "text": "Janine Ashman, Director of Learning and Unlocking Excellence English Hub Lead at St. Peter’s primary school in Somerset tells us about how using a phonics scheme has improved learners’ reading skills."
        },
        {
            "text": "Reading at the heart of our curriculum"
        },
        {
            "text": "At St Peter’s, we believe that developing children as expert and enthusiastic life-long readers is a fundamental entitlement for every individual pupil. Reading is the key that opens many doors and successful readers will have a head start in all that they do."
        },
        {
            "text": "At St Peter’s, we recognise that being an expert reader is a key skill for every child that will enable them to achieve in all areas of their life. We believe that every child can learn to read and can develop a love for reading – with the right teaching and encouragement from enthusiastic, knowledgeable teachers. In order to achieve this, we place reading at the heart of our curriculum and have developed a clear and coherent whole school strategy for teaching the skills of reading and promoting reading for pleasure. Our reading culture is embedded across the school, with school staff acting as champions for reading. We weave reading into as many aspects of school life as possible. For example, our school houses are named after four inspirational authors/ poets: Coelho, Donaldson, Jeffers and Rauf. Children learn about these authors and explore their amazing work. We know that to support children to achieve outstanding outcomes in their reading we need to make a rapid start to teaching phonics when they join us in Reception. We start daily phonics lessons as soon as pupils start in Reception using a validated Systematic Synthetic Phonics (. We know that using an SSP benefits our pupils and staff in many ways."
        },
        {
            "text": "Reduction of cognitive load"
        },
        {
            "text": "We have found that one of the key benefits of using a consistent phonics scheme is that it reduces cognitive load for children. When children are learning to read, they have to decode words, understand their meaning and remember them. This can be a lot of cognitive load for an early reader! A phonics scheme provides consistent routines, actions and mantras that all our staff follow and means children can just focus on their new learning rather than seeing phonics presented in lots of different ways across the school."
        },
        {
            "text": "Access to high quality training"
        },
        {
            "text": "Another benefit of using a phonics scheme is that it provides access to high-quality training. Phonics is a specialist area of teaching and requires a high level of expertise. Our staff have all had the benefit of training and support, tailored specifically to our context. This has resulted in a clear coherent approach and ultimately effective teaching. All staff are confident in their subject knowledge and are using the same approach to phonics teaching. That the teaching is of a high standard in both lessons and interventions."
        },
        {
            "text": "Our phonics scheme also provides further CPD opportunities for staff. Our TAs have benefitted from training courses specifically tailored to supporting the lowest 20% for example and our reading lead regularly attends a phonics leader network to swap ideas with other schools and hear the latest developments. This ensures that staff are continuously developing their knowledge and expertise in phonics teaching."
        },
        {
            "text": "Workload reduction for staff"
        },
        {
            "text": "Using a phonics scheme has dramatically reduced our workload this year. Gone are the days of spending hours trying to compose phonetically decodable sentences at the right level! With our scheme plans and resources are all provided so teachers don't have to spend time planning phonics lessons from scratch. This allows us to focus instead on the needs of our class and the support we put in place to allow all children to succeed."
        },
        {
            "text": "Improved outcomes for children in all year groups"
        },
        {
            "text": "The ultimate benefit of using a phonics scheme has been improved outcomes for our children in FS, KS1 and KS2. By quickly giving children the decoding skills they need to access texts that match their phonics attainment, they become fluent and enthusiastic readers. Our SSP gives children many opportunities to practice their decoding skills and plans for explicit teaching of prosody and fluency."
        },
        {
            "text": "As children master phonics and move into Year 2 and beyond we see the benefits of their phonics in both their reading and writing. Strong segmenting skills supports their spelling which we further enhance this by teaching Latin to all KS2 pupils. Our Latin lessons give us the opportunity to explore the relationships between Latin root words and words we use today. A single Latin root word can generate over 100 English words. This means that just teaching 10 Latin roots can give children the meaning of more than 1,000 words in English! We make links to learning about Romans and Greeks and further embed expert vocabulary used in these history lessons. Also, Latin vocabulary is hugely beneficial in understanding scientific vocabulary. For example, the Latin word ‘ignis’, which means fire, unlocks the meaning of ‘igneous rock’ for children learning about volcanoes in Year 3."
        },
        {
            "text": "Strong and rigorous teaching of phonics using a validated SSP gives our pupils an excellent start to their learning and allows them to access the curriculum as they progress through school. We see the impact is strong outcomes at the end of KS1 and 2."
        },
        {
            "text": "Find out more about available support for your school "
        },
        {
            "text": "Visit gov.uk for more details on choosing a phonics teaching programme."
        },
        {
            "text": "Learn more about and find your nearest English Hub."
        }
    ]
}