{
    "url": "https://kingsawards.blog.gov.uk/2023/05/16/garadry-recognised-with-the-prestigious-kings-award-for-enterprise/",
    "title": "GaraDry® recognised with the prestigious King’s Award for Enterprise",
    "authors": [
        "sarahminney"
    ],
    "categories": [
        "Advice",
        "International trade",
        "King's Awards"
    ],
    "pub_date": "2023-05-16T18:06:42+01:00",
    "content": [
        {
            "text": "Lancashire-based product design company, GaraDry Ltd, celebrates after achieving the King’s Award for Enterprise for International Trade, following the official announcement on Friday 21st April 2023."
        },
        {
            "text": "The King’s Awards for Enterprise are the highest accolade UK businesses, being approved by His Majesty The King himself."
        },
        {
            "text": "Managing Director Ashley Smith said: “I became aware of the awards through dealings with other companies which had won an award in the past and decided to apply in order for the company to receive some recognition for its achievements over the past years and hopefully provide a springboard to push the business to the next level.”"
        },
        {
            "text": "GaraDry®, which designs, manufacturers, and sells a range of innovative threshold seals for garage doors and commercial doors, designed to prevent rainwater and other debris from being blown under a garage door during inclement weather. "
        },
        {
            "text": "Ashley, who has a degree in Industrial Design, had the idea to create his own range of thresholds due to the lack of options for solving the problem that were available to buy at the time. The products added much-needed safety features, such as high visibility yellow lines, which prevent trip hazards and are made from environmentally friendly materials."
        },
        {
            "text": "This year marks the first ever King’s Awards for Enterprise, with His Majesty The King’s desire to continue the legacy of HM Queen Elizabeth II, by recognising outstanding UK businesses. GaraDry® was selected for the award for achieving three consecutive years of outstanding growth in overseas markets, which totalled over 90%."
        },
        {
            "text": "Overseas sales now account for 33% of its UK business. It now exports its range of products to more than 40 countries including most European markets and as far away as Australia."
        },
        {
            "text": "Ashley, 43, continued by adding: “I’m delighted and humbled for our company to receive this accolade. It means the world to our team and receiving this acknowledgement from The King only encourages us even further to grow our business and continue designing innovative products manufactured in Great Britain. We’re a small business and hopefully this award will help to raise awareness of us, and the products that we supply globally”."
        },
        {
            "text": "Ashley founded the company in 2009, and the business now employs 11 people at offices and warehousing in Ormskirk, Lancashire. In 2017 the company opened a subsidiary in the United States (GaraDry LLC), to handle strong interest from Americans in the products and launched a fulfilment centre in Tennessee to ship transatlantic orders quickly. In 2022 GaraDry® set up a warehouse in Germany to better cater to the European market."
        },
        {
            "text": "The company now hopes to expand with a new, innovative product range which it hopes to launch later in the year."
        },
        {
            "text": "When asked for any tips for aspiring business owners thinking of applying for future years, Ashley said: “The past few years have been very difficult for many businesses due to myriad external world events, but hopefully we’ve shown that with good planning, drive, and determination that success can still be achieved.”"
        },
        {
            "text": "Ashley will attend a special reception along with other successful awardees, hosted by His Majesty The King, at Buckingham Palace in June. See https://uk.garadry.com/ for coverage."
        },
        {
            "text": " "
        },
        {
            "text": "Has your business got what it takes to achieve a King's Awards for Enterprise?"
        },
        {
            "text": "Applications are open now and close midday 12th September."
        },
        {
            "text": "Apply here: https://www.gov.uk/kings-awards-for-enterprise"
        },
        {
            "text": "Contact our helpline if you have any questions: kingsawards@beis.gov.uk or 020 7215 6880"
        }
    ]
}