{
    "url": "https://insidehmcts.blog.gov.uk/2023/05/16/helping-people-to-navigate-the-justice-system-and-access-the-support-they-need/",
    "title": "Helping people to navigate the justice system and access the support they need",
    "authors": [
        "Miriam Davidson - Head of User Inclusion and Engagement, HMCTS"
    ],
    "categories": [
        "Training and support"
    ],
    "pub_date": "2023-05-16T16:00:56+01:00",
    "content": [
        {
            "text": "Every year, we help thousands of people using the court and tribunals service. Some people need support to navigate the justice system whilst others need broader support for issues relating to issues such as debt, mental health or housing."
        },
        {
            "text": "Our role is to provide court and tribunal users with advice on court procedures, information about their case and to make sure safeguarding requirements are met. But we’re aware some court users have additional needs that we cannot meet, and that’s backed up by research by Revolving Doors: Identifying, understanding, and responding to the multiple complex needs of court service users."
        },
        {
            "text": "To help people navigate the system, we’ve created a signposting strategy. Our ambition is to direct people to the help and advice they need, when they need it. The strategy has 4 strands:"
        },
        {
            "text": "The aim is to support all court and tribunal users by providing a service that’s accessible and puts them at the heart of what we do."
        },
        {
            "heading": 2,
            "text": "Helping our staff signpost court users effectively"
        },
        {
            "text": "Every day our staff speak to many different people who use our services, whether it’s visitors to our courts and tribunals or people calling our Service Centres."
        },
        {
            "text": "Our research tells us that there’s great work being done every day to direct people to the help and support they need, but staff also tell us that people may be experiencing several issues at once and need more rounded support."
        },
        {
            "text": "Our staff want to be able to help people in a way that’s appropriate and gives everyone a consistent experience. To help our staff, we’ll provide training on identifying people’s needs and signposting them to support effectively. This will give them greater confidence to let people know about the support that’s available earlier in their conversations with us so that they have plenty of opportunities to seek help."
        },
        {
            "text": "We’re also giving staff and members of the public reassurance by creating a list of verified support providers. These organisations have been through basic check process and have national coverage so they can help wherever the person lives."
        },
        {
            "text": "An example of this is our work with Support Through Court who help people that may have to attend court alone. Karen Sng-Sugden, Chief Operating Officer (COO) at Support Through Court explains:"
        },
        {
            "heading": 2,
            "text": "Looking to the future"
        },
        {
            "text": "Once we’ve trained staff in our Service Centres, we’ll focus on frontline staff in courts and tribunals. We know there’s more complexity in a face-to-face setting and there’s greater variation in local advice and support provision, so we want to take time to get this right."
        },
        {
            "text": "We’ll update GOV.UK to embed links to support services for court users at important points of online and paper applications. We hope that people will see opportunities to seek support as and when they need it rather than when they reach crisis point."
        },
        {
            "text": "We’ll evaluate our performance regularly. We’ll be able to see how often people visit support sites (whilst individuals remain anonymous) to help us understand how useful the embedded guidance is."
        },
        {
            "text": "We’ll also analyse data to identify new support needs as they arise, making sure that services we signpost to remain relevant and are developed in line with the needs of people who rely on us."
        }
    ]
}