{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/05/16/join-the-cmas-digital-markets-unit/",
    "title": "Join the CMA’s Digital Markets Unit",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA"
    ],
    "pub_date": "2023-05-16T13:28:24+01:00",
    "content": [
        {
            "text": "Are you excited about the potential offered by digital technologies and interested in making a real difference for people and businesses?"
        },
        {
            "text": "Joining the CMA’s Digital Markets Unit offers you the opportunity to scrutinise digital markets and shape the future of regulation in relation to one of the biggest policy challenges faced by governments and regulators."
        },
        {
            "heading": 2,
            "text": "Making digital markets work well for everyone"
        },
        {
            "text": "Digital products and services are embedded in how we live our lives.  They provide critical support for UK businesses and are often at the heart of innovation. But despite the many benefits these markets offer, they can be prone to market power and to misleading practices."
        },
        {
            "text": "New legislation was introduced to Parliament last month, which proposes updating UK competition and consumer protection laws and creating a new pro-competition regulatory regime for digital markets."
        },
        {
            "text": "The new powers included in the Digital Markets, Competition and Consumer Bill will give the CMA the ability to work in a faster and more targeted way to improve competition and foster opportunities for innovation in digital markets. They will allow us to set targeted and proportionate conduct requirements for the most powerful digital firms to ensure other businesses aren’t at risk of being exploited and excluded, and to safeguard users against unfair terms and constrained choices."
        },
        {
            "text": "Read more about the CMA’s approach to promoting competition and innovation in digital markets."
        },
        {
            "text": "We are already working to improve these markets for consumers and businesses. For example, we are currently investigating Apple’s conduct in relation to developers’ access to the App Store and overseeing the implementation of remedies agreed with Google in relation to online privacy. We are also working at the cutting edge of digital technology, for example, together with our colleagues in the CMA’s Data, Technology and Analytics Unit we recently announced a review of artificial intelligence models."
        },
        {
            "heading": 2,
            "text": "Why join the DMU now?"
        },
        {
            "text": "We are building our team and are keen to hear from people with a diverse range of backgrounds and skills – you may have experience working in digital markets, or using data and technology, or you may have research, policy, regulatory, project management, legal or economics skills."
        },
        {
            "text": "We are currently recruiting for a range of roles to support our work to prepare for the new regime:"
        },
        {
            "heading": 3,
            "text": "If you’re interested in hearing more about these roles and the work of the DMU, please register for our online ‘open house’ event on Wednesday 24 May."
        },
        {
            "text": "We are a friendly and supportive team, passionate about making a difference through our work in digital markets. Learning and development are really important to us; we provide numerous training opportunities and regularly discuss key challenges and emerging trends in group sessions, including with world-renowned external .  The DMU, as part of the CMA, is a fantastic place to build your skills, knowledge and experience in digital markets."
        },
        {
            "text": "As we grow our team we are also actively building our presence across the UK. The CMA has offices in Belfast, Edinburgh and Cardiff as well as an economics unit in Darlington. We opened a new office in Manchester last year, which will be a key hub for the DMU."
        },
        {
            "text": "Find out more about building a career in the DMU and hear reflections from current team members on the CMA's LinkedIn channel."
        }
    ]
}