{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/05/16/mental-health-awareness-week-reflections-on-the-role-of-adult-social-work/",
    "title": "Mental Health Awareness Week: reflections on the role of adult social work",
    "authors": [
        "Lyn Romeo",
        "Jason Brandon"
    ],
    "categories": [
        "Care and support",
        "Events",
        "Mental health",
        "Our profession",
        "Safeguarding",
        "Society"
    ],
    "pub_date": "2023-05-16T12:27:17+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Anxious for more progress"
        },
        {
            "text": "It’s Mental Health Awareness Week, which this year takes a theme we can all relate to: anxiety (#ToHelpMyAnxiety). It's not only a chance to shine a light on our psychological wellbeing (and how to maintain it) but also take stock on mental health service provision and the evolution of societal attitudes to an issue which affects us all."
        },
        {
            "text": "Much progress has been made since the Time to Change national campaign, Time to Talk Day. This wonderful social movement’s continuing mission is to challenge and one day end the stigma and discrimination faced by those of us who experience mental health problems."
        },
        {
            "text": "These days, many more people understand the more common mental health problems, such as anxiety and depression, and are able to seek help. Research by the Mental Health Foundation, reaffirms the reality that everyone has a different experience of anxiety, which can be triggered by significant life events. These can include social isolation, work stress, domestic issues, education, and other physical or emotional problems, some caused or exacerbated by social or societal pressures including those experienced online."
        },
        {
            "text": "The global pandemic undoubtedly fuelled people’s anxieties and fears and many endured long periods of isolation, cut off from friends and family. Combined with a rise in the cost of living and the impact of global crises (some closer than others), this has resulted in an increase in mental health problems and additional pressure on the health and social care system. People do not always receive a timely response to their requests for help, as they seek to live independent, healthier and happier lives."
        },
        {
            "heading": 2,
            "text": "Progress towards peace of mind"
        },
        {
            "text": "That said, there have been improvements elsewhere, as employers recognise the need to support their staff’s wellbeing more generally. This is especially true of the health and social care workforce who need to be well supported, so they in turn can support the people and families whom we are here to serve. In the particular case of adult social work, it is essential to recognise the value of a trauma-informed approach within our workforce development arrangements and continuous professional development planning."
        },
        {
            "text": "Stigma and discrimination still exist, especially denying those with severe and long term mental health conditions the opportunities to work, access education and enjoy positive relationships. Mitigating or eliminating these barriers, is how we can help connect them to opportunities allowing them to live life to the full."
        },
        {
            "text": "The Chief Social Worker for Adults’ office works closely with ministers and policy colleagues to make sure the Department of Health and Social Care – and the wider care sector - supports the social care workforce and improves practice knowledge and skills for social workers working with people with mental health needs throughout the life course. This includes young people coming into their adulthood, older people and people with learning disabilities and autism."
        },
        {
            "text": "We have worked closely with the sector to promote best practice with people experiencing homelessness and transitional safeguarding practice and the role of social workers with young adults."
        },
        {
            "heading": 2,
            "text": "Social work's vital role"
        },
        {
            "text": "For those people experiencing a serious mental health crisis, the role of the Approved Mental Health Professional (AMHP) in our health and care system remains vital. Jason Brandon, our Mental Health Social Work lead, has supported the sector to increase the number of AMHPs and make sure, as far as possible, that people are assessed in a timely and appropriate fashion so they can access the care they need."
        },
        {
            "text": "There is always more we can do to increase awareness of mental health issues and maximise the support we can provide. As social workers, we have our skills, experience and training, but we also have bags of empathy, compassion and kindness."
        },
        {
            "text": "As professionals and in our lives away from work, the message is the same: be kind to ourselves, to others and be open to those who must be listened to, understood and supported. Together, we can help make stigma, prejudice and ignorance of mental health issues a thing of the past."
        }
    ]
}