{
    "url": "https://ukhodigital.blog.gov.uk/2023/05/16/showcasing-uk-seabed-mapping-to-british-maritime-community/",
    "title": "Showcasing UK seabed mapping to British maritime community",
    "authors": [
        "David Parker"
    ],
    "categories": [
        "Seabed mapping",
        "UK CSM"
    ],
    "pub_date": "2023-05-16T14:41:06+01:00",
    "content": [
        {
            "text": "Was there a more fitting venue for the UK Centre of Seabed Mapping (UK CSM) showcase event than at the International Maritime Organization (IMO), the beating heart of the global shipping industry?"
        },
        {
            "text": "Clearly not, as anyone who joined us and the Maritime and Coastguard Agency at the illustrious IMO headquarters in Central London would agree."
        },
        {
            "text": "Friends and colleagues across the maritime community discovered more about the UK CSM’s role and purpose and had the chance to hear from some of its experts throughout the evening."
        },
        {
            "text": "The UK CSM was launched in 2022 to enable UK public sector organisations involved in seabed mapping to build a community where members coordinate efforts to collect and share marine geospatial data."
        },
        {
            "text": "Enabling the ocean environment to be utilised in a safe and secure way"
        },
        {
            "text": "Following a warm welcome by UK National Hydrographer and Deputy Chief Executive of the UKHO, Rhett Hatcher, Peter Sparkes, Chief Executive of the UKHO, explained in his keynote speech how the UK CSM is an exciting evolution in the nation’s long and storied relationship with the ocean environment."
        },
        {
            "text": "Being an island nation enhances our understanding of the sea’s power and potential. Peter discussed how we rely on the ocean for trade and commerce, which is critical to our security and safety, and underpins the livelihoods of millions across these isles and beyond."
        },
        {
            "text": "The UK’s marine estate is fifth largest in the world"
        },
        {
            "text": "The UK’s marine estate, which includes Overseas Territories and Crown Dependencies, may be the fifth largest in the world, but only 2% of it has been mapped to modern standards. Peter attributed this to the inherent challenges of data collection, access, standards and coordination."
        },
        {
            "text": "It is the desire to solve these challenges, alongside the UK government’s understanding of how critical the marine environment is to our nation’s future, that led to the creation of the UK CSM. Peter explained how the UKHO, through its role as secretariat of the UK CSM, was relishing the opportunity to contribute by encouraging stakeholders in the UK maritime sector to join the seabed mapping community."
        },
        {
            "text": " UK CSM members are taking a more collaborative approach "
        },
        {
            "text": "Each member organisation brings its own world-beating expertise to the table, as all parties work together to solve the challenges of data standards and accessibility. Through a more collaborative, harmonious approach to data standards, data accessibility and data collection between members, the UK CSM will enable Armed Forces, scientists, and industry partners to utilise the ocean environment in a safe and secure way."
        },
        {
            "text": "Peter concluded by saying that UK CSM members will be able to collectively use marine geospatial information to usher in a new era of ocean stewardship, and policymakers will be able to set the agenda on the issues that really matter to the prosperity of our oceans."
        },
        {
            "text": "Having set the scene for the UK CSM’s exciting role in gathering and sharing critical data more effectively, Peter handed over to John Dillon-Leetch, Port Hydrographer at the Port of London Authority (PLA), who explained why the PLA invests so much in seabed mapping and what the return on that investment looks like."
        },
        {
            "text": "John was followed by Sally-Ann Hart, MP for Hastings and Rye, Chair of the All-Party Parliamentary Group for the Ocean, and Chair of the All-Party Group for Coastal Communities. Sally-Ann outlined the critical relationship between our oceans and climate, explaining why understanding and managing climate change is critical to our future prosperity, and how protecting and preserving our oceans helps support a thriving nation."
        },
        {
            "text": "Rhett thanked the keynote speakers for their insights into seabed mapping and marine geospatial data. He closed by inviting attendees to network over drinks and to meet some of the organisations already signed up to the UK CSM."
        },
        {
            "text": " "
        }
    ]
}