{
    "url": "https://ukhsa.blog.gov.uk/2023/05/16/ukhsa-science-strategy-a-vision-for-how-science-can-secure-health-and-prosperity/",
    "title": "UKHSA Science Strategy: A vision for how science can secure health and prosperity",
    "authors": [
        "Isabel Oliver"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-05-16T09:40:27+01:00",
    "content": [
        {
            "text": "The importance of health protection science to society has never been more apparent."
        },
        {
            "text": "It’s a tough job to protect health from infectious diseases and environmental hazards in an era of increasing risk of pandemics and other serious threats to health, but science is a powerful force to understand and tackle these challenges."
        },
        {
            "text": "The good news is that we have never had better tools to secure health than we do today, with even more exciting developments coming."
        },
        {
            "text": "We saw the art of the possible during the COVID-19 pandemic with genomic data allowing the rapid identification and characterisation of variants enabling quick development and evaluation of diagnostics, vaccines and therapeutics."
        },
        {
            "text": "The world had never seen such a rapid advancement and deployment of safe and effective vaccines which saved millions of lives allowing us to return to greater normality."
        },
        {
            "text": "Beyond COVID-19, we know that science will help us to secure health from other current and future challenges."
        },
        {
            "text": "Our climate is changing, which will exacerbate a wide range of threats including the risk of other pandemics. Hazards like air pollution and antimicrobial resistance cost many lives and increase the burden on our already stretched NHS."
        },
        {
            "text": "So the better we are at applying our scientific skills to protect people from health threats, the more effective we will be at keeping society moving and reducing pressure on vital public services."
        },
        {
            "text": "And we shouldn't forget that science also creates many exciting career opportunities and drives innovation making an important contribution to our nation’s prosperity."
        },
        {
            "heading": 3,
            "text": "A new science strategy for UKHSA"
        },
        {
            "text": "At UKHSA science powers everything we do so I’m delighted to announce the publication of a new science strategy setting out how we will harness the power of our science to secure health and prosperity over the next decade."
        },
        {
            "text": "The strategy highlights how UKHSA’s science can save more lives, secure major public health victories and contribute to the UK as a global science superpower."
        },
        {
            "text": "Through our science we can achieve great things, but we can’t do it alone."
        },
        {
            "text": "The pandemic demonstrated what can be achieved when Government, industry, and academia work together, so our strategy is focused on building deeper and stronger partnerships. We want to maintain the spirit of collaboration and momentum from the past few years to tackle all health threats."
        },
        {
            "text": "As well as investing in our partnerships, to make our vision a reality we will also invest in our people and facilities as the foundations of our science."
        },
        {
            "text": "The science strategy is an important companion piece to UKHSA’s strategic plan which will be published later this year to provide more information on our organisational priorities."
        },
        {
            "text": "UKHSA is a unique organisation. When I talk to people about our science, I’m extremely proud to highlight some of the exceptional work that we do and our capabilities."
        },
        {
            "text": "This includes our ability to combine science with our expertise in operational response and data analytics."
        },
        {
            "text": "Or our rare and unique expertise and capabilities in high containment, handling the world’s most dangerous pathogens, through to our end-to-end vaccine capability from vaccine development science to expertise in procurement and logistics."
        },
        {
            "text": "Our science is incredibly diverse. We are data scientists, microbiologists, epidemiologists, toxicologists, medical entomologists, radiation protection experts, medics, nurses, geographers, modellers, bioinformaticians, chemists, behavioural scientists, biomedical scientists, biologists, engineers and more."
        },
        {
            "text": "And I’m particularly proud that our science is always focused on real world action. The knowledge and evidence that we generate is directly used to protect health and in clinical practice, on the NHS front line and in our communities."
        },
        {
            "text": "It also informs the strategic policy advice we provide to the highest levels of government."
        },
        {
            "text": "Indeed, the scientific evidence we generate is used around the world because of its quality."
        },
        {
            "heading": 3,
            "text": "Join us in our work to secure health and prosperity"
        },
        {
            "text": "Our new strategy sets out our ambition to play a greater role than ever in life sciences, nationally and internationally."
        },
        {
            "text": "In developing our science strategy we’ve engaged a wide range of partners, most recently hosting a successful industry engagement event at our Porton Down campus."
        },
        {
            "text": "We are open for business and want to work with partners on shared agendas to protect the public’s health."
        },
        {
            "text": "Over the coming months and years, we will develop longer-term strategic partnerships with academia, industry, the NHS and fellow public sector research establishments who share our vision."
        },
        {
            "text": "Our strategy also reinforces the importance of our people. We do fantastic science here and we want UKHSA to be the best place in the world to work as a scientist so we need to retain, attract and develop the scientific leaders and workforce of the future."
        },
        {
            "text": "This means building a thriving multidisciplinary community of scientists with access to the best facilities, resources, high quality data and technology that help them make important scientific advances."
        },
        {
            "text": "Please do take a look at our new strategy on GOV.UK. If you share our ambition to protect health, save more lives and boost the nation’s prosperity through science, we look forward to working with you."
        }
    ]
}