{
    "url": "https://publicguardian.blog.gov.uk/2023/05/16/when-you-might-need-a-lasting-power-of-attorney/",
    "title": "When you might need a lasting power of attorney",
    "authors": [
        "kerstifourcin"
    ],
    "categories": [
        "Awareness day",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2023-05-16T13:27:47+01:00",
    "content": [
        {
            "text": "To mark dementia action, mental health, and action for brain injury awareness weeks, we look at three scenarios when a lasting power of attorney (LPA) might be helpful."
        },
        {
            "text": "An LPA makes it easier for the people you trust to support you with making decisions when you need it most. It could be a temporary or long-term need.  Lots of people think their partner or relative can legally make decisions for them if they lose mental capacity – but this isn’t the case. You would need an LPA in place with someone you trust, known as an attorney. They could then pay your bills (with a property and financial affairs LPA) or make decisions about your care (with a health and welfare LPA)."
        },
        {
            "heading": 2,
            "text": "Living with dementia and using an LPA"
        },
        {
            "text": "Dementia describes a set of symptoms which may include memory loss, problems with language, confusion and needing help with daily tasks. For people with dementia, everyday tasks like paying bills or buying groceries can be difficult."
        },
        {
            "text": "Jaina Engineer, Knowledge Services Manager at Alzheimer’s Society says:"
        },
        {
            "text": "“Sadly dementia gets worse over time so it’s likely that a person with the condition will need someone to make decisions on their behalf at some point in the future."
        },
        {
            "text": "“LPAs can make things easier and give peace of mind for those living with dementia. If they become unable to manage their affairs or pay bills, or make decisions about their care and treatment like whether to have surgery, someone they have chosen and trust can do this for them.”"
        },
        {
            "text": "Trudy Brown tells us of her and her mum’s experience with LPAs:"
        },
        {
            "text": "“During Covid, mum didn’t have enough capacity to understand why she needed to go to hospital in an emergency ambulance. As she was conscious, the paramedics needed her consent. As her health and welfare attorney, I was able to make the decision for her to go to hospital. When Mum gained a little more capacity, she thanked me for ‘saving her life."
        },
        {
            "text": "“As I’m also mum’s financial attorney, I could evidence mum’s self-funding capability to enable a hospital discharge into her preferred nursing home. Thankfully we’d chatted about this particular nursing home a few years before she lost mental capacity and she’s very happy as a permanent resident.”"
        },
        {
            "heading": 2,
            "text": "Long term mental health problems and using an LPA"
        },
        {
            "text": "Depression, anxiety disorders, bipolar disorder, and schizophrenia are all examples of long-term mental health problems. They’re ongoing and can have a big impact on someone's life. They can make it difficult for people to do everyday things."
        },
        {
            "text": "Someone with a long-term mental health problem might have short-term episodes where their symptoms worsen, so there might be cases where an LPA is needed for specific situations or events."
        },
        {
            "text": "Rheian Davies, Head of Mind’s Legal Unit said:"
        },
        {
            "text": "“An LPA can give assurance to someone that should they become too unwell to manage their finances themselves, people they trust will be looking after their money and making the choices that they would have made. There is also the reassurance that when they are feeling better, as most people do, they can take full control of their money again."
        },
        {
            "text": "“Managing bills for your household can be difficult at the best of times, never mind when your mental health is poor. Having an LPA means that they can make sure that your bills are settled. Or, if you run into financial difficulty that the person you have appointed can negotiate with suppliers or creditors so that you are not bothered by them on top of being unwell.”"
        },
        {
            "heading": 2,
            "text": "Brain injury and having an LPA in place"
        },
        {
            "text": "While many people recover quickly after a minor head injury, this isn’t always the case. Some people experience longer-term effects and may spend time in a coma, or a longer ‘reduced awareness state’. During the early stages of recovery, brain injury survivors often go through a stage called ‘post-traumatic amnesia’, where they have no continuous memory of day-to-day events and their behaviour may be very uncharacteristic and confused."
        },
        {
            "text": "Having an LPA in place protects the choices of the brain injury survivor, as someone they trust would be able to make decisions on their behalf. Often these are decisions that can be discussed and planned for ahead of needing them."
        },
        {
            "text": "Colin Morris, Communications Director at Headway – the brain injury association commented:"
        },
        {
            "text": "“During action for brain injury week, one of the key messages we are sharing is that brain injury can happen to anyone at any time."
        },
        {
            "text": "“Whether it is caused by a stroke, fall, car collision, tumour or assault, a brain injury can occur without warning and often leave the person with cognitive problems. This can impair their ability to understand consequences of decisions and potentially put them at risk of harm."
        },
        {
            "text": "“Long-term arrangements such as a lasting power of attorney are often imperative so brain injury survivors have someone who can make decisions in their best interests. It can be a great comfort to know that someone is there looking after their welfare.”"
        },
        {
            "text": "No individual’s experience is the same, but something that links all of these scenarios is that they are often unpredictable. Creating an LPA before you need it helps protect your future choices, and makes it easier for the people you trust to make decisions for you on your behalf. For more information and guidance visit www.gov.uk/opg."
        },
        {
            "text": "Thank you to Alzheimer’s Society, Mind and Headway for their support and advice for this blog."
        }
    ]
}