{
    "url": "https://companieshouse.blog.gov.uk/2022/12/12/companies-house-reform-identity-verification/",
    "title": "Companies House reform: identity verification",
    "authors": [
        "Andrew Williams - Identity Verification Implementation Lead"
    ],
    "categories": [
        "Companies House transformation",
        "Digital transformation",
        "Legislative reform"
    ],
    "pub_date": "2022-12-12T17:06:20+00:00",
    "content": [
        {
            "text": "Identity verification is one of the significant measures being introduced by the Economic Crime and Corporate Transparency (ECCT) Bill. But what is it? How will it help to increase transparency over UK companies and improve the accuracy of information on the Companies House register?"
        },
        {
            "heading": 2,
            "text": "What identity verification is"
        },
        {
            "text": "Identity verification is the process of confirming that a person is who they claim to be."
        },
        {
            "text": "Most of us will be familiar with needing to use an identity document, such as a passport or driving licence, to prove who we are when doing things like setting up a bank account or starting a new job. It’s not something new but previously we may have done it in person, taking the physical documents along to be checked or copied. But now, like most things in life, you can do it digitally and usually at any time, using just your smartphone."
        },
        {
            "text": "In recent years there have been lots of advancements in identity verification, including the use of biometrics. This is the use of unique physical characteristics to identify someone, like fingerprints, facial recognition, or even iris scanning."
        },
        {
            "text": "Despite these tech advancements, identity fraud in the UK is growing, with around 1 in 10 people affected each year. The most common type of identity fraud is credit card fraud, but the stealing of personal, medical or financial information to access services or benefits is also becoming more widespread."
        },
        {
            "text": "At Companies House, we will be implementing a new identity verification process to help deter those wishing to start companies for illegal purposes. Anyone setting up, running, owning or controlling a company in the UK will need to verify their identity to prove that they are who they claim to be."
        },
        {
            "text": "For new companies and other registerable legal entities, this will mean that all directors (or equivalent) and people with significant control (PSC), will need to complete identity verification before or as part of the company incorporation process."
        },
        {
            "text": "For existing companies on the register, all directors (or equivalent) and PSCs will need to verify their identity within a set period, to be set out within secondary legislation."
        },
        {
            "text": "Anyone acting on behalf of companies will also need to verify their identity before they’re able to file information with us."
        },
        {
            "heading": 2,
            "text": "How identity verification will work at Companies House"
        },
        {
            "text": "Our aim is for identity verification to be as easy as possible for people to do. There will be 2 routes to choose from and both will achieve the same level of identity assurance. You’ll be able to verify directly with Companies House or through an Authorised Corporate Service Provider (ACSP)."
        },
        {
            "text": "Verifying directly with Companies House will mainly be via a digital service that links a person with their primary identity document, such as a passport or driving licence. Alternative methods will be available for those who cannot use or access the digital service."
        },
        {
            "text": "The ACSP route will involve using an intermediary such as an accountant, legal adviser, or company formation agent. To become or act as an ACSP, the intermediary must be registered with a supervisory body for anti-money laundering (AML) purposes and already have an existing duty to carry out customer due diligence checks on all of their clients. Identity verification will simply build on these existing checks."
        },
        {
            "text": "ACSPs will need to register with Companies House, confirming their own AML supervised status, before they’re able to form new companies or file company information. They’ll also be required to declare that they’ve completed all the necessary identity verification checks on their clients before any filings can be made."
        },
        {
            "text": "Once complete, your verified status will be held by Companies House for all future filings. There may be some instances where re-verification is needed, for example if someone changes their name."
        },
        {
            "text": "There will be consequences for people who do not comply with the identity verification requirements - in the form of both criminal sanctions and civil penalties. The Companies House register will also be annotated to reflect where someone has an unverified status – using our delegated powers of annotation, which will also be introduced when the ECCT Bill becomes law."
        },
        {
            "heading": 2,
            "text": "Why identity verification is important for corporate transparency"
        },
        {
            "text": "Identity verification will make it much harder to register fictitious directors or beneficial owners, stopping the vast majority of fraudulent appointments from reaching the register. Businesses of all sizes will benefit from greater assurance that the information on the register is genuine. If you’re someone who uses the register to search for potential suppliers or partners, you’ll have greater assurance that the people behind the company are who they say they are."
        }
    ]
}