{
    "url": "https://environmentagency.blog.gov.uk/2022/12/12/creating-new-wetland-habitats-on-the-river-thame-buckinghamshire/",
    "title": "Creating new wetland habitats on the River Thame, Buckinghamshire  ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2022-12-12T10:41:35+00:00",
    "content": [
        {
            "text": "As we mark Biodiversity COP15, Hilary Phillips, Senior Project Officer for the River Thame Conservation Trust, explains how partnership working has transformed 32 hectares of floodplain grassland across two sites in Buckinghamshire into complex wetland habitats. At Eythrope on the Waddesdon Estate and on Manor Farm in Chearsley, the transformation has given multiple benefits, including flourishing wildlife, flood prevention, nutrient cycling and ecosystem resilience."
        },
        {
            "text": "I joined River Thame Conservation Trust in September 2020, following many years working with environmental partnerships, including Berks, Bucks and Oxon Wildlife Trust, and Wild Oxfordshire. I had previously hosted the Evenlode Catchment Partnership and managed Oxfordshire’s Biodiversity Advisory Group."
        },
        {
            "text": "I love working with people and wildlife, and through the Trust I am now lucky enough to work with volunteers, farmers and landowners to improve the biodiversity of the River Thame, and help the public better understand and enjoy this beautiful river and its wildlife."
        },
        {
            "text": "Partnership work has allowed the Trust to achieve ambitious floodplain restoration across the catchment, including our two new wetland complexes, one built in Eythrope in 2020 and our newest in Chearsley in 2022."
        },
        {
            "text": "Eythrope: our first-ever wetland and backwater construction project"
        },
        {
            "text": "When I joined the Trust in 2020, the floodplain restoration at Eythrope was already underway. This was our first-ever wetland and backwater construction project. It was made possible by working with the Freshwater Habitats Trust, Waddesdon Estate, Aylesbury Vale District Council, Thames Water and the Environment Agency. This restoration project was the first of its kind in the River Thame catchment and was the largest construction project the Trust had ever undertaken."
        },
        {
            "text": "The Eythrope project aimed to transform around 10 hectares of low-diversity floodplain meadow into a large wetland complex, with a range of wetland waterbodies of varying shapes and sizes designed specifically for wetland plants, aquatic and semi-aquatic invertebrates, and amphibians."
        },
        {
            "text": "Initially, the groundwork involved stripping off topsoil from the entire area (11,300m2) right down to the underlying clay. This might seem extreme, but stripping the topsoil removes built-up nutrients (pollutants) in the soil left over from past use of fertilizer, and ensures good water quality for the wetland. At the peak of the dig, we had four 22-tonne dump trucks, a bulldozer and two excavators (22 tonne and 13 tonne) working constantly.  It was quite a sight to behold!"
        },
        {
            "text": "At both Eythrope and later at Manor Farm, we wanted to incorporate a new backwater as part of the wetland creation. This is basically a large pool connected to the river channel which benefits the local fish populations. Backwaters like these occur naturally; however, many have been lost due to people modifying rivers. Constructing backwaters returns to the landscape important nursery grounds for young fish and refuges for adult fish. At the Eythrope Wetland, fish were seen in the backwater the next day – build it and they will come!"
        },
        {
            "text": "Manor Farm: our latest floodplain restoration project"
        },
        {
            "text": "The floodplain restoration at Manor Farm took place in summer 2022 and, as with Eythrope, this project was made possible through partnership work and collaboration. The landowner, local organic farmer Rose Dale, who is a member of the Thame Valley Farmer Cluster that the Trust facilitates, said: “The wetland project is a wonderful way to restore this landscape to a flourishing natural state. Since converting to an organic farm business, I have already seen exciting signs of life return to the farm and look forward to how this project will create further habitat for plants and wildlife.”"
        },
        {
            "text": "We have intentionally designed the Manor Farm site to have both groundwater-fed ponds that will not be impacted by flood waters, and pools that will fill with water from the adjacent River Thame. There has not yet been time for plants to take hold or winter floods to have an impact at Manor Farm, but our monitoring at Eythrope shows that the wetland there holds river water from flooding and also fills with low-nutrient rainwater during the year. In this context, nutrients are pollutants from past fertilizer use, so low-nutrient rainwater is important to encourage colonization by pollution-sensitive plants and invertebrates. I am pleased to say the ponds successfully held water even in prolonged dry weather."
        },
        {
            "text": "We hope the Manor Farm site will develop similarly to the Eythrope Wetland. Our volunteer bird-watching experts at Eythrope have reported a whole host of species using the site including large numbers of Wigeon, Teal, Lapwing, Greenshank, Ringed Plover, Gadwall, Shoveler, Little Egret, Snipe, Pintail, and even a couple of large bats flying around late one morning! This is great news and has become crucial in the case for making the Eythrope Wetlands a Local Wildlife Site, a designation we hope the site will receive in 2023."
        },
        {
            "text": "Find out more about the river restoration and habitat creation projects involving the Environment Agency on the River Thame at www.riverthame.org."
        }
    ]
}