{
    "url": "https://cddo.blog.gov.uk/2022/12/12/data-challenge-2023-the-semi-finals/",
    "title": "Data Challenge 2023: the semi-finals",
    "authors": [
        "Sue Bateman, Chief Data Officer, CDDO",
        "Vicki Chauhan, Head of Public Sector, NTT Data UK"
    ],
    "categories": [
        "DDaT",
        "DDaT community"
    ],
    "pub_date": "2022-12-12T15:11:26+00:00",
    "content": [
        {
            "text": "Innovation lays an exciting path for us as civil servants, enabling us to transform the way we deliver government services and policy. To quote Steve Jobs, innovation is the ability to see change as an opportunity - not a threat. We know that government has a vast array of data assets, but can often fail to make best use of them. "
        },
        {
            "text": "The best innovation is driven by real life experience, and the Civil Service Data Challenge champions just that. Run by the NTT DATA UK, the Cabinet Office, the Office of National Statistics (ONS) and Global Government Forum the Challenge seeks ideas from civil servants, across the whole of government, on how government can improve its use of data – and volunteers to work with senior leaders and technical specialists on taking forward the best ideas. Data Challenge’s winning idea will receive £50,000 cash funding, as well as both technical advice and development support from NTT DATA UK, and the backing of top Civil Servants to bring the idea to life."
        },
        {
            "heading": 3,
            "text": "Trial by dragon "
        },
        {
            "text": "Last week we held an in-person semi-final event in London. The teams for each of the eight ideas put forward their plans to the judges in a “Dragons’ Den” style pitching session. We’re delighted that the Civil Service Data Challenge has nurtured the shortlisted ideas into such strong proposals. The passion of front-line staff in bringing their real-life problems to life with exciting possible solutions made for a fantastic and challenging day of judging for the “dragons”! "
        },
        {
            "text": "From the eight ideas put to the judges, four have been selected to develop their proofs of concept for the grand final on 23 March 2023, the finalists are:"
        },
        {
            "text": "- Using artificial intelligence to refine Digital Mail Service\n- Developing a data dashboard to identify and tackle modern slavery\n- Using online gaming technology to conduct policy experiments in virtual worlds\n- Improve levels of compliance for child maintenance payments"
        },
        {
            "heading": 3,
            "text": "A history of success "
        },
        {
            "text": "We can’t wait to see what the top four ideas and teams  produce between now and March. From last year’s final, three ideas have demonstrated that they’re viable on the front line, with active sponsorship from senior digital and data leaders in the Civil Service and business cases for development amongst the next steps. The Data Challenge is truly showing us, and exemplifying  how to be an innovative, modern Civil Service, pioneered by data."
        },
        {
            "text": "About the authors\nVicki Chauhan is the Civil Service Data Challenge Lead Judge\nSue Bateman is a Civil Service Data Challenge Judge"
        }
    ]
}