{
    "url": "https://insidehmcts.blog.gov.uk/2022/12/12/designing-services-for-the-family-court/",
    "title": "Designing services for the family court",
    "authors": [
        "Leanne Draycott - Senior service designer"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-12-12T16:40:41+00:00",
    "content": [
        {
            "text": "I feel very privileged to work in an area where we can help people who are in extremely difficult circumstances. I've always worked in customer and user experience roles but I now work in Family Private Law, which includes child arrangements and applications relating to domestic abuse."
        },
        {
            "text": "My other service design colleagues working in the family jurisdiction at HMCTS could be helping families at important moments in their lives, such as going through divorce or adopting a child."
        },
        {
            "heading": 2,
            "text": "How I spend my time"
        },
        {
            "heading": 3,
            "text": "Planning"
        },
        {
            "text": "As a service designer, I spend a fair amount of time planning. From daily 15-minute team stand up calls, to more in-depth planning meetings where we prioritise what we need to do over the next 2 weeks."
        },
        {
            "text": "An important part of planning is booking workshops to have the space and time together to resolve complex issues. We recently held a workshop on how we serve applications to respondents. There’s lots to think about, especially for cases when applicants need to arrange for the papers to be handed over in person."
        },
        {
            "heading": 3,
            "text": "Design"
        },
        {
            "text": "I run a lot of co-design workshops. The purpose of these is to:"
        },
        {
            "text": "Leading these workshops is my favourite thing about my job, whether that's in person with snacks, on MS Teams, or in a hybrid format. I find it useful to have a visual way of structuring and recording our conversations, so I use an online whiteboard, and share the link so everyone can contribute and add their ideas."
        },
        {
            "text": "We work with a brilliant team, including people who are experts in legal and operational processes. As a minimum we have an hour-long meeting with them, 4 times a week. We use this time to ask how something works, check our assumptions, and share any work we’ve been doing so the product owners can sign it off. For example we recently used the time to walk through how a solicitor can draft a court order and send it to the judge for approval."
        },
        {
            "text": "I regularly catch up with other service designers to see how they’ve resolved similar issues, or to ask for their help. I used a recent catch up to understand how users sign up online for other services – it’s something we want to make as simple as possible and consistent across HMCTS.  It's always great to share and learn from each other."
        },
        {
            "heading": 3,
            "text": "Communicating and working together"
        },
        {
            "text": "Collaboration and regular communication are some of the most important aspects of service design."
        },
        {
            "text": "We’ve recently completed a lot of design work on how we can make sure judges can review cases in the most efficient way possible. We use service maps to talk through how this will work with our main stakeholders."
        },
        {
            "text": "Our team is a mix of civil servants and contractors, which provides a great mix of perspectives and approaches. Whenever new people join the team, I explain the overarching service design. I love talking to new starters as they’re a great reminder of how our services appear to someone less familiar with them."
        },
        {
            "text": "Reviewing the service in this way also reminds me of the importance of what we do, and our purpose as a user-centred design team – to design services that are simple and easy to use."
        }
    ]
}