{
    "url": "https://disabilityunit.blog.gov.uk/2022/12/12/disability-history-month-q-a-with-artist-christopher-samuel/",
    "title": "Disability History Month - Question and Answer with artist Christopher Samuel",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-12-12T11:20:31+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Christopher Samuel is a multi-disciplinary artist whose practice is rooted in identity and disability politics, often echoing facets of his own lived experience. Christopher’s works can be found in the Government Art Collection. The team from the Collection sat down with him to discuss art and access for Disability History Month."
        },
        {
            "text": " "
        },
        {
            "text": "Question (Q): How did you become an artist?"
        },
        {
            "text": "Christopher Samuel (CS): I stumbled into art. After spending a long time in hospital in my twenties, I was unsure where I fit in in the world. Eventually, I enrolled on an art and design course. Secretly I’ve always enjoyed art, but felt that it wasn’t for me, or for people like me. It did not feel accessible."
        },
        {
            "text": "During the course, I did everything I could to avoid drawing; I thought I would be disappointed, because of how my condition affects my hands. It wasn’t until my lecturer told me I had to create an ‘alternative self-portrait’ that I tried."
        },
        {
            "text": "This was the same week that I got my first electric wheelchair which had a big square armrest. I picked up a biro pen, I used the armrest to support both hands holding the pen and I drew myself."
        },
        {
            "text": "Q: What are the main themes of your art?"
        },
        {
            "text": "CS: I make work about disability and identity politics, often echoing my own lived experience. I work in lots of different mediums – from illustrations and installation, to print and video – in a way where I can take agency over the disabled or marginalised experience."
        },
        {
            "text": "I use redaction a lot in my work – the idea of revealing and concealing things by removing or blocking out certain information, to suggest a different narrative. I also use humour and poetic subversiveness to make work that is accessible to everyone."
        },
        {
            "heading": 3,
            "text": "I want to make work which opens up a dialogue about a lived experience which many people may not directly identify with."
        },
        {
            "text": "Q: How does your disability inform how you create art?"
        },
        {
            "text": "CS: When I first started to make art, I had a serious internal conflict about not being pigeon-holed as a ‘disabled artist who makes work about disability.’ Like lots of disabled people of my generation and culture, I was brought up to think ‘disabled people shouldn’t complain.’ And for a long time, I didn’t want to be identified as disabled. But I think it is important to make work about my real experiences and the politics around that because this is my lived experience. And the lived experiences of other disabled people too."
        },
        {
            "heading": 3,
            "text": "Our stories are underrepresented – historically and culturally – and that needs to change."
        },
        {
            "text": "Q: Do you have a piece of work that you feel is significant or important to you as an artist?"
        },
        {
            "text": "CS: Three pieces of work stand out to me as really important because they tackle issues that have affected disabled people for most of our history and continue to be contentious – care, access, agency and inclusion."
        },
        {
            "text": "The Welcome Inn (2019) was my first big commission where I redesigned a hotel room at Art Bed and Breakfast Blackpool to create a sleep-in installation that people can spend a night in. I designed the room to be inaccessible to able-bodied people, to allow them to experience a space that is not designed for them, and to challenge the culture of ‘one size fits all’ architecture."
        },
        {
            "text": "The Cared For Network (2021) is a digital artwork that takes the form of a carer’s logbook – a document which records what daily care is given by a carer to a cared for person, for the care company to track – and subverts it to reflect the cared for person's experience instead. It explores the power dynamics at play in a prescribed care relationship."
        },
        {
            "text": "The Archive of an Unseen (2022) is an interactive sculptural installation on display at the Wellcome Collection. It is a custom-built Microform reader, which visitors can explore the contents of. Inside, it tells the story of me growing up as a black, disabled, working class boy in the 1980s and 1990s in London. It aims to address some of the imbalances of representation that currently exist in medical and social archives."
        },
        {
            "text": "Q: What are you most proud of in your artistic career?"
        },
        {
            "text": "CS: I think it might be my mum seeing me at my first exhibition, shortly after I’d graduated. It opened the same night, and in the same gallery, as an exhibition by Yinka Shonibare, who is someone who I definitely look up to as an artist."
        },
        {
            "text": "I’d just finished university, and I’d just successfully won the right to live independently – and not in a care home – which that body of work (Housing Crisis, 2018) was about. My mum had watched me trying to get through university and then fighting when I was made homeless. I think this was the moment where I could see my mum’s pride in me, that her son had achieved the things that many said he couldn’t."
        },
        {
            "text": "Q: What motivates you to make art?"
        },
        {
            "text": "CS: The ability to have a voice. For a long time, I was not in control of lots of aspects of my life, and did not feel I had a voice (or was heard)."
        },
        {
            "heading": 3,
            "text": "Art allows me to speak for myself and for other people who are voiceless, and to speak about issues which affect the lives of the voiceless and that are unjust."
        },
        {
            "text": "I also love the process of research – investigating, interrogating and understanding why and how my experience is the way it is, and how other people perceive me or the disabled community."
        },
        {
            "text": "Q: What do you think the role of art in society should be?"
        },
        {
            "text": "CS: Art can allow people to think about things in a different way, or to invoke thoughts and ideas which can have a positive influence."
        },
        {
            "text": "I don’t expect everyone to have the same experience of my art, but that is the beautiful thing about it – it gives a space for others to engage with ideas and experiences in their own way."
        },
        {
            "heading": 3,
            "text": "Good art has the power to change people."
        },
        {
            "text": "Q: In your opinion, what can the arts and culture sector do to better support artists that identify as disabled?"
        },
        {
            "text": "CS: Working as a disabled artist can be a bit of a minefield – juggling benefits, working hours and practices, access support, managing your own health, travel… Some organisations are leading the field in considering access, equal opportunities and representation, while others seem to be playing catch-up."
        },
        {
            "text": "I work with a team of people that assist me with producing work and running my practice, day to day. My practice increasingly involves working collaboratively, especially as my projects get more ambitious. As someone who can’t work for long hours, it has been a challenge to work out how to navigate the sector to allow me to successfully make work and build a career, while also managing my condition."
        },
        {
            "text": "The most important thing I think is to ask questions – and not to be afraid to ask ‘what do you need to make this work for you?’"
        },
        {
            "text": "Christopher Samuel’s The Archive of the Unseen can be seen at the Wellcome Collection from 12 December. Find out more about his practice on his website and follow him on Instagram."
        },
        {
            "text": "The Government Art Collection is a national Collection of over 14,700 works, displayed in UK Government buildings in nearly every capital city."
        }
    ]
}