{
    "url": "https://environmentagency.blog.gov.uk/2022/12/12/flood-risk-management-plans-published/",
    "title": "Flood risk management plans published ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2022-12-12T10:57:04+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "(Photo credit: Cumbria - Johnny Kidd, West Cumbria Rivers Trust)"
        },
        {
            "text": "Over the last 3 years we have worked in partnership with lead local flood authorities and other partners to develop Flood Risk Management Plans (FRMPs). Today we have published them (here)"
        },
        {
            "text": "At least one in six people in England are at risk from flooding from rivers and the sea with many more at risk from surface water flooding. With a rapidly changing climate, adapting what we do and improving our overall resilience is more important than ever before."
        },
        {
            "text": "As Executive Director of Flood and Coastal Risk Management in the Environment Agency, my focus is working with a wide a range of partners to help deliver the ambitions of the Flood and Coastal Erosion Risk Management Strategy - ensuring that we are a nation that is ready for, and resilient to, flooding and coastal change.  Collaboration is key and the more we work and plan together, the more we can put communities at the heart of what we do."
        },
        {
            "text": "We listened to what people told us during the public consultation in October 2021 and we value what you value too. The importance of partnerships to deliver actions, the need to strengthen a catchment approach so we work with and better recognise the value of the natural environment and the places we live and work in.  In addition, we need to rise to the challenge of making infrastructure resilient to flooding while reducing carbon use."
        },
        {
            "text": "These plans will help us to:"
        },
        {
            "text": "There are great examples of this throughout the 10 FRMPs. For example"
        },
        {
            "text": "You can see what is planned for where you live and work on the Flood Plan Explorer. Please take a look and see how we are helping to manage flood risk in your local area."
        },
        {
            "text": "Author: Caroline Douglass"
        }
    ]
}