{
    "url": "https://dwpdigital.blog.gov.uk/2022/12/12/our-apprenticeship-journey-so-far/",
    "title": "Our apprenticeship journey so far",
    "authors": [
        "Fabien Henry"
    ],
    "categories": [
        "Apprenticeships",
        "Collaboration",
        "Digital DWP jobs"
    ],
    "pub_date": "2022-12-12T16:31:02+00:00",
    "content": [
        {
            "text": "Fabien Henry, Apprenticeship Lead"
        },
        {
            "text": "At DWP Digital we believe in nurturing talent. One way we do this is through a range of apprenticeships for people looking for a change in career or wanting to build their digital skill set.  "
        },
        {
            "text": "I’m an apprenticeship lead at DWP Digital. Digital apprenticeships are growing here, and the support, learning and development opportunities are just a few of the reasons that make them so rewarding.  "
        },
        {
            "text": "All of our apprentices get access to lots of learning and support they need while they do their apprenticeship, and they contribute to the delivery of real business outcomes.  "
        },
        {
            "text": "Along with the formal education and training, our apprentices also benefit from working with a team of experts. The interest and appetite to help from our colleagues is an indication of the invaluable experience our apprentices get from their teams. "
        },
        {
            "heading": 2,
            "text": "Meet the apprentices "
        },
        {
            "text": "Jennifer, Abbie and Rebecca joined DWP Digital earlier this year as Director Support apprentices. They support the work of senior leaders within the organisation.   "
        },
        {
            "text": "Jennifer  "
        },
        {
            "text": "“I love my team and the support I get from my colleagues. The culture in DWP Digital is so nurturing and friendly and even though I feel like I ask one million questions, I never feel shy to do so. So far, I’m learning so much and really getting the opportunity to develop my communication and professional skills. "
        },
        {
            "text": "I really like the variety of the role. Every single colleague I have asked for help from has been really supportive. Our cohort have developed such a bond and close working relationship, and we are always there to help each other out.” "
        },
        {
            "text": "Rebecca "
        },
        {
            "text": "“We meet up every two months for a face-to-face learning day, which I find really beneficial. It allows us to collaborate on learning and we’re able to develop together.   "
        },
        {
            "text": "My apprenticeship line manager is really supportive, and is always happy to help me whenever I need anything. All of my fellow apprentices are brilliant, and we have built strong working relationships, so we are always helping and supporting each other through our learning and development.” "
        },
        {
            "text": "Abbie "
        },
        {
            "text": "“The safety in knowing that you are in a cohort that are learning at the same time while still doing varied tasks and job roles within different placements is massively rewarding. We’re able to discuss our progress and support each other throughout both the job role and our learning.” "
        },
        {
            "heading": 2,
            "text": "Advice from the digital apprentices  "
        },
        {
            "text": "Jennifer"
        },
        {
            "text": "“If you're thinking of doing an apprenticeship with DWP Digital, I would say definitely go for it. I think the opportunities an apprenticeship provides are excellent, and can really aid you with your career skills and future goals.” "
        },
        {
            "text": "Rebecca"
        },
        {
            "text": "“Don’t be shy to ask questions, no question is a silly question and make sure you take on every learning opportunity you can, there will always be people around you to turn to if a task seems daunting or scary.” "
        },
        {
            "text": "Abbie  "
        },
        {
            "text": "“Don’t rule yourself out. I was very naïve before I started my apprenticeship, and had the view that apprenticeships were for school leavers or were capped by previous employment or educational experience.   "
        },
        {
            "text": "I’ve quickly realised that apprenticeships cover a wide range of qualifications and pay scales. There are many different areas for you to progress and continue your personal learning and development.” "
        },
        {
            "text": "To find out about our latest apprenticeship opportunities subscribe to our mailing list to get roles sent straight to your inbox.   "
        }
    ]
}