{
    "url": "https://educationhub.blog.gov.uk/2022/12/12/schools-closed-for-snow-days-information-for-parents/",
    "title": "Schools closed for snow days – information for parents",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Further education",
        "Schools"
    ],
    "pub_date": "2022-12-12T12:31:22+00:00",
    "content": [
        {
            "text": "On snowy days schools make every effort to stay open but it’s not uncommon for schools to close or operate at a reduced level, for example with individual classes suspended. Here we answer your questions about snow days."
        },
        {
            "heading": 3,
            "text": "Who decides if schools should close?"
        },
        {
            "text": "It’s up to schools and local authorities (councils) to decide based on their circumstances. This is the best approach as it allows them to take local issues into account.  Usually schools will have tried and tested policies in place to help them in adverse conditions."
        },
        {
            "heading": 3,
            "text": "How should schools and councils inform parents? "
        },
        {
            "text": "Schools will have their own approaches to contacting parents, in many circumstances they have their own apps and/or messaging services. Schools will try to give parents as much notice as possible but sometimes decisions will be made quite late as circumstances change."
        },
        {
            "heading": 3,
            "text": "What things should schools consider when deciding whether to close?"
        },
        {
            "text": "Decisions will be made locally based on common sense and there are a large range of things that schools will consider – including but not limited to: staffing levels (if transport issues prevent teachers from getting to work, for example), safety conditions around the school, temperatures in school buildings and more."
        }
    ]
}