{
    "url": "https://deframedia.blog.gov.uk/2023/07/10/coverage-of-new-higher-fines-for-litter-graffiti-and-fly-tipping/",
    "title": "Coverage of new higher fines for litter, graffiti and fly-tipping",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste",
        "Weekly stories"
    ],
    "pub_date": "2023-07-10T17:06:59+01:00",
    "content": [
        {
            "text": "There has been widespread coverage by the Sun, the Daily Mail, the Daily Express and Times Radio following our announcement that on-the spot fines for litter, graffiti and fly-tipping will rise as part of a crackdown on anti-social behaviour."
        },
        {
            "text": "To help strengthen councils in their fight against waste crime, government is laying a statutory instrument increasing the upper limits for various fixed penalty notices (FPNs) on Monday 10 July. This means:"
        },
        {
            "text": "Environment Secretary, Thérèse Coffey said:"
        },
        {
            "text": "Environment Minister Rebecca Pow said: "
        },
        {
            "text": "In addition to increasing the upper limit on fines, the government has launched a consultation on ringfencing the receipts from FPNs for litter and fly-tipping to fund local authorities’ enforcement and clean-up activities, such as spending the money raised from fining criminals on further enforcement officers. This would see the money paid by criminals go directly back into repairing the damage from their crimes, or into enforcement efforts to prevent similar incidents from happening again."
        },
        {
            "text": "The higher fines to crack down on littering and fly tipping comes alongside Defra’s wider work to tackle waste crime and take the fight to offenders."
        },
        {
            "text": "In April, grants totalling £775,000 will help councils roll out a range of projects to crack down on fly-tipping were announced. Twenty-one local authorities will benefit from the grants, with schemes including roadside CCTV and social media campaigns in Plymouth and targeted surveillance at hotspot areas in Pendle."
        },
        {
            "text": "Defra has also announced that fees for disposing of household DIY waste at recycling centres will be abolished – helping people to deal with their waste responsibly and removing a financial burden that gets in the way of people dealing with their waste responsibly."
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}