{
    "url": "https://educationhub.blog.gov.uk/2023/07/how-we-are-putting-apprenticeships-on-an-equal-footing-with-degrees/",
    "title": "How we are putting apprenticeships on an equal footing with degrees   ",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-07-10T10:00:34+01:00",
    "content": [
        {
            "text": "Apprenticeships are more important than ever in helping businesses to recruit the right people and develop the skills they need."
        },
        {
            "text": "Since 2015, we have transformed apprenticeships into a prestigious option that better meets the skills needs of employers across the country."
        },
        {
            "text": "And now, under new plans, young people will be able to use UCAS to search and apply for apprenticeships, alongside degrees – so that they can better decide which route best suits them."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What’s changing and when? "
        },
        {
            "text": "Over 1.5m students already use the UCAS Hub to access information on different education and training routes."
        },
        {
            "text": "From autumn 2023, students will be able to explore apprenticeship opportunities alongside undergraduate courses within the Hub, allowing them to discover and decide between their options in the same place for the first time."
        },
        {
            "text": "It will also show students the different routes into a single career destination, meaning if a student is interested in, for example, engineering, they will see the undergraduate and apprenticeship routes displayed side-by-side."
        },
        {
            "text": "From autumn 2024, students will then be able to apply for apprenticeships within the UCAS Hub and employers will be able to manage applications for their apprenticeship vacancies through UCAS too."
        },
        {
            "heading": 3,
            "text": "How will the application system work? "
        },
        {
            "text": "So that as many apprenticeship vacancies are advertised through the Hub as possible, the Government will collaborate with UCAS to share vacancy information collated through its Find an Apprenticeship Service, which already collates and advertises thousands of opportunities."
        },
        {
            "text": "Our aim is to develop a seamless ‘one-stop shop’ where a young person can explore all the high-quality options and learn about the skills and knowledge they need to develop and succeed in their chosen career, whether that’s through a level 2 apprenticeship, a T Level, a degree, a Skills Bootcamp, a higher technical qualification, or a degree apprenticeship."
        },
        {
            "heading": 3,
            "text": "Why has this been introduced? "
        },
        {
            "text": " Presenting students with all their choices in one place will not only transform the apprenticeship offering but create real parity by putting these options side-by-side with undergraduate courses."
        },
        {
            "text": "Almost half of people that register on UCAS say they would consider an apprenticeship, but currently there are not enough vacancies being advertised through the service to meet growing demand."
        },
        {
            "text": "The plans will help put technical and vocational education on an equal footing with traditional academic routes."
        },
        {
            "text": "By opening up the service to apprenticeship opportunities, thousands more young people will benefit from a wider choice of high-quality options."
        },
        {
            "text": "Employers will also benefit from better access to talent on UCAS and the ability to manage their apprentice recruitment process."
        },
        {
            "text": "Collaboration with UCAS is well underway and improvements to the Find an Apprenticeship site and the UCAS student Hub should be in place by autumn 2023."
        }
    ]
}