{
    "url": "https://nda.blog.gov.uk/important-mission-delivery-milestone-achieved-thanks-to-partnership-working-on-defueling-barry-hart-head-of-uk-contracts-nda/",
    "title": "Important mission delivery milestone achieved thanks to partnership working on defueling - Barry Hart, Head of UK Contracts, NDA",
    "authors": [
        "samfrench"
    ],
    "categories": [
        "Mission delivery"
    ],
    "pub_date": "2023-07-10T15:38:36+01:00",
    "content": [
        {
            "text": "The NDA’s mission is soon expanding to include the decommissioning of the 7 advanced gas-cooled reactor (AGRs) power stations that are currently operated by EDF Energy."
        },
        {
            "text": "Through collaboration with EDF and our operating companies, Sellafield Ltd, Magnox Ltd and Nuclear Transport Solutions we are delivering a programme of work to move us into the defueling phase."
        },
        {
            "text": "Read more from Barry Hart, our Head of UK Contracts below:"
        },
        {
            "text": "The NDA group is tasked with the clean-up and decommissioning of the UK’s legacy nuclear power stations. Our job is to deal with what these sites have left behind, removing the risks and hazards, so that eventually the sites can be released for other useful purposes."
        },
        {
            "text": "Over the next two decades, the NDA’s mission will expand to include the decommissioning of the 7 AGR power stations that are currently operated by EDF Energy.  Before this can happen, NDA, EDF Energy, Sellafield Ltd and Nuclear Transport Solutions (NTS) need to collaborate on a programme of work which will see electricity generation at the Power Stations end where we will transition into the “defuelling” phase.  This phase is expected to last for between 3 and 5 years and it is where all of the used nuclear fuel is safely and securely removed from reactors and then transported to Sellafield for long term safe and secure storage.  Once all of the spent nuclear fuel has been removed, each of the AGR power stations will transfer one by one into NDA ownership and, via Magnox Ltd, the necessary decommissioning activities will continue."
        },
        {
            "text": "It’s a long-term challenge, stretching into the next century, but the work is extraordinary and unlocks so many possibilities, especially for our people. In the spirit of our mission advancing further, we’re recognising a significant milestone being achieved in recent weeks."
        },
        {
            "text": "Over a sustained four-week period, an average of 9 spent fuel flasks per week have been received at Sellafield from EDF Energy’s AGR Power Stations, the first time this has been achieved in over 25 years. This has been a longstanding target and is something that we now need to sustain for several years to come.  This success is the culmination of years of preparation and planning between the NDA, Sellafield, Nuclear Transport Solutions (NTS) and EDF Energy."
        },
        {
            "text": "NTS is responsible for collecting the fuel and transporting it via the UK rail network to Sellafield, where it is then received at the Fuel Handling Plant (FHP). The fuel is dismantled at Sellafield to free-up empty skips that can then be returned to the power stations to enable a continuous stream of spent fuel to be transported to Sellafield for long term safe and secure storage."
        },
        {
            "text": "What makes this achievement particularly special is that despite fewer flasks than usual being available over recent months, teams at Sellafield within FHP have managed to support the increasing demands of EDF Energy’s defueling and electricity-generating power stations at pace, meaning that the flasks received from the AGRs have had to be processed for return much quicker than usual."
        },
        {
            "text": "We’re currently on track to complete defueling at Hunterston and Hinkley Point B in 2025 and soon after the ownership of the AGR power stations will transfer to Magnox Ltd, continuing the safe and secure decommissioning that we’re tasked in achieving. Whilst we’ve made a fantastic start to defueling, there is still more work to be done.  The NDA group is working at pace to maintain this level of performance for a number of years. By investing today in the challenges left over from the UK’s proud nuclear history, we can remove the burden for future generations and continue to deliver social and environmental benefits through our jobs, knowledge, skills, technology, and social investment."
        }
    ]
}