{
    "url": "https://vmd.blog.gov.uk/2023/07/10/operation-lascar-ancord-our-biggest-seizure-yet/",
    "title": "Operation LASCAR- ANCORD: Our biggest seizure yet",
    "authors": [
        "Kimberly Homer-Theodore"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2023-07-10T14:25:33+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Kimberly Homer-Theodore, one of our enforcement officers, talks about a recent case involving the seizure of a substantial quantity of veterinary medicines destined for export."
        },
        {
            "text": "A great result when we stopped the illegal export of over 6,700 veterinary medicines destined for the USA."
        },
        {
            "text": "Early one morning in June the latest crackdown effort of ‘Operation Lascar-Ancord’ was underway."
        },
        {
            "text": "Operation Lascar-Ancord is an operation run by the U.S. Food and Drug Administration (FDA) and UK Border Force, in conjunction with several other agencies, aimed at combatting the supply and importation of unauthorised medicinal products to the USA. These can include counterfeit products, fake medical devices and unauthorised veterinary medicines – and as the UK’s enforcement authority for veterinary medicines, that’s where we come in."
        },
        {
            "text": "At Heathrow’s Worldwide Distribution Centre, Border Force, acting on intelligence from the FDA, quarantined suspect packages. We were expecting a large number of parcels, however, even we were not quite anticipating what was waiting for us –thousands of boxes and jiffy bags."
        },
        {
            "heading": 2,
            "text": "Parcels upon Parcels"
        },
        {
            "text": "These parcels were destined for New York, Florida, California, Hawaii - every US state you could think of."
        },
        {
            "text": "Over 3 days the team opened the detained parcels. We ended up seizing over 2,500 parcels containing veterinary medicines."
        },
        {
            "text": "Back at the VMD office is where our work really began. For a further 3 days we unpacked each parcel, organising, and counting each product by brand and country of origin."
        },
        {
            "text": "Included in the haul were a variety of flea and wormer treatments for companion animals, such as Seresto, Hart Gard, Frontline, and Bravecto, which were manufactured in South Africa, Australia, and the UK with an estimated retail value of around £200,000."
        },
        {
            "heading": 2,
            "text": "Why were these medicines illegal?"
        },
        {
            "text": "Veterinary medicines must have the correct authorisations to be legitimately supplied and marketed in a particular country."
        },
        {
            "text": "Regulation 31 of the Veterinary Medicines Regulations 2013 (VMR) states:"
        },
        {
            "text": "“No person may export a veterinary medicinal product for use in another country unless the veterinary medicinal product may be lawfully supplied or administered in that country.”"
        },
        {
            "heading": 2,
            "text": "The investigation continues…"
        },
        {
            "text": "So far we have identified 12 websites worldwide involved in these consignments."
        },
        {
            "text": "We work with many enforcement authorities at home and abroad sharing intelligence and investigating illegal activities, which can result in prosecution of anyone carrying out illegal activities in the UK. We also have other tools including serving enforcement notices, seizing evidence and issuing police cautions. Find out more about these on VMD Connect."
        },
        {
            "heading": 2,
            "text": "Buyer Beware"
        },
        {
            "text": "Overall, this was a hugely successful operation. However, we must acknowledge that this is not a victimless crime. The financial loss to consumers who unwittingly bought these products may be thousands of pounds."
        },
        {
            "text": "Whilst it might be tempting to buy cheaper veterinary medicines from abroad, is it worth the risk? Products such as these may not just be unauthorised but also counterfeit and dangerous for your pets."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}