{
    "url": "https://forestrycommission.blog.gov.uk/2023/07/10/showcasing-the-work-of-defras-trees-and-forestry-team-the-forestry-commission-and-our-delivery-partners/",
    "title": "Showcasing the work of Defra’s Trees and Forestry Team, the Forestry Commission and our Delivery Partners",
    "authors": [
        "Bella Murfin and Naomi Matthiessen"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-07-10T14:26:38+01:00",
    "content": [
        {
            "text": "We‘re half-way through 2023 and another tree planting season is behind us, so a lot has happened since we last blogged back in January. This includes the news that the efforts of Team Trees, and our many partners, are starting to pay off."
        },
        {
            "text": "We were really pleased to see this year’s official tree planting statistics, released last month, show that over 3,600 new hectares of trees and woodland have been created since 2022/23, an increase of 40% on 2021/22. This represents the highest level in England for over a decade and it’s one of several milestones over the last 6 months, including:"
        },
        {
            "text": "To learn more about what the Trees and Forestry team have been up to, please do read on!"
        },
        {
            "heading": 2,
            "text": "New year, bolder targets"
        },
        {
            "text": "Defra ended 2022 with a new set of legally binding targets to protect our environment, clean up our air and rivers and boost nature. For our team, this means working to support the Government’s net zero ambitions and boost nature recovery by increasing tree and woodland cover to 16.5% of total land area in England by 2050 – that’s increasing tree cover in England by an area roughly the size of Cheshire by 2050."
        },
        {
            "text": "Further targets were set in January with the publication of Defra’s Environmental Improvement Plan 2023 (EIP23), setting out a plan of action to restore nature, reduce environmental pollution, and increase the prosperity of our country. EIP23 is our first revision of the 25 Year Environment Plan (25YEP), our vision to help the natural world regain and retain good health, with a commitment now set into law to refresh this every five years."
        },
        {
            "text": "A summary of the EIP23 is available."
        },
        {
            "text": "At the start of the year, we made several updates to our England Woodland Creation Offer, namely increasing the payment cap for Standard Cost Items by 20%, going from £8,500 per hectare to £10,200 per hectare, and increasing the maintenance payments from £300 per hectare per year, to £350 per hectare per year. This follows extensive analysis on capital costs which underpins the new rates, in recognition of the challenges of rising input costs and other pressures which are being felt across the sector."
        },
        {
            "text": "On 21 January, Red Squirrel Appreciation Day, we supported the UK Squirrel Accord (UKSA) with the launch of their England Red Squirrel Action Plan (ERSAP) 2023-2028, to help protect and enhance England’s endangered red squirrels. The plan will further support the dedicated conservation efforts already taking place."
        },
        {
            "text": "We also announced dates for the Seventh Woodland Carbon Guarantee, where £10 million was made available specifically for farmers and land managers to encourage new woodland creation to help tackle the effects of climate change and provide new income in the form of long-term payments for the amount of carbon a new woodland will store."
        },
        {
            "text": "The Forestry Commission’s Woods Mean Business campaign was rolled out in February, explaining the benefits of woodland creation to landowners who are considering diversifying their business. From timber and wood fuel to recreation and leisure activities, woodland creation can generate reliable revenue streams whilst delivering environmental benefits that support land management goals, nature, and society."
        },
        {
            "heading": 2,
            "text": "Re-opening two key tree planting funds"
        },
        {
            "text": "February also saw the reopening of two community planting funds, the Local Authority Treescapes Fund (LATF) and the Urban Tree Challenge Fund (UTCF). Over £14m was made available for local authorities and community groups to access funds for new tree planting projects that will provide many benefits:"
        },
        {
            "text": "The LATF enables local authorities to increase non-woodland tree planting across their local community, while the UTCF supports planting trees in socially deprived urban areas with low canopy cover."
        },
        {
            "text": "With trees and woods at the heart of nature recovery in England, we need a skilled diverse workforce to help deliver and maintain woodland creation. However, there currently aren’t enough foresters to grow and manage our woodlands at the planned scale over the coming decades."
        },
        {
            "text": "The Professional Forester Apprenticeship Programme with Forestry Commission and the National School of Forestry at the University of Cumbria offers a chance to study forestry to degree level whilst working. The ground-breaking apprenticeship programme reopened in February after a successful intake of apprentices in 2022. The apprenticeship is a three-year, paid development opportunity for passionate people looking to kickstart their careers in forestry. It’s the first time that a degree level forestry apprenticeship has been offered in the UK."
        },
        {
            "text": "Free practical forestry training courses, through our Forestry Training Fund, will give more people the chance to learn important skills - from entry level learning on chainsaw maintenance, coppicing and woodland management, to supporting people considering a change of career or those who are seeking to build and diversify their skills in forestry. Demand for the Forestry Training Fund has been extremely high, showing an encouraging level of interest across the country."
        },
        {
            "text": "Following the overwhelming success of the Forestry Training Fund – which has funded over 1,000 training places from 140 technical training providers across the UK, we are planning to re-open this fund later in the year."
        },
        {
            "heading": 2,
            "text": "Springing into summer"
        },
        {
            "text": "After the election period, Spring saw the launch of the Women in Forestry, The Lumberjills’ Story | Forestry England exhibition at Grizedale Forest. It was humbling to learn about the experiences of these pioneering women of two World Wars, who faced immense hardship and discrimination as they contributed to the war effort, taking traditionally male roles across the Forestry industry. It doubles as a celebration of women in forestry, past and present, and Naomi was privileged to join an incredible line-up of inspiring women who spoke at the launch event. A thriving, skilled forestry workforce must be inclusive and open to all. We hope the exhibition has inspired the next generation of women in forestry to expand, protect and improve our forests, woods and trees."
        },
        {
            "text": "Roles are available from apprenticeships to experienced positions. Just type ‘Forestry’ into the search box on the Civil Service Jobs website."
        },
        {
            "text": "The exhibition also includes a giant (12 square metre) photo mosaic commissioned by the Forestry Commission, Forestry England, Forest Research and supported by Defra. Earlier in the year we issued a photo callout, encouraging women to participate. We received over 2,000 publicly submitted photographs of women from across the forestry sector and the general public, illustrating the connection today’s women have with forests and woodlands."
        },
        {
            "text": "You can see the mosaic and all the wonderful images that make it up on The People’s Picture."
        },
        {
            "text": "We hope many people will find the time to visit this first-of-its-kind exhibition and celebrate the role of women in forestry."
        },
        {
            "text": "As we move into warmer weather, we unfortunately also move into peak season for certain pests and diseases. In March, Defra and the Forestry Commission updated the management zone boundaries used to control spread of Oak Processionary Moth (OPM). This was followed by new legislation in May for professional operators, which permits the movement of large oak trees and trade within the operational boundaries, providing certain biosecurity requirements are met. This included production of an OPM digital guide and video for traders."
        },
        {
            "text": "In the same month, we delivered seasonal public health awareness 'warning and informing’ messaging concerning the emergence of OPM caterpillars. This pest can affect the health of people and animals, as they contain hairs which can cause itchy rashes, eye and throat irritations and occasionally breathing difficulties."
        },
        {
            "text": "More recent updates include the reopening of the High Speed 2 Woodland Fund on 30 May. £3.25m has been made available to support woodland creation and the restoration of plantations of ancient woodland sites (PAWS) along the HS2 Phase One route. The fund will remain open year-round, and it has also been extended for two years, up until March 2025."
        },
        {
            "heading": 2,
            "text": "Blooming good news - where we're up to with planting"
        },
        {
            "text": "In recent weeks, all eyes were on the Forestry Commission’s published Key Performance Indicators (KPIs), including Official Statistics on tree planting and woodland creation over the last year. We were delighted to see the data confirm that there had been over 3,600 new hectares of trees and woodland planted, which is an increase of 40% on the previous year. This represents the highest level of tree planting in England in over a decade."
        },
        {
            "text": "The annual statistics reflect how our England Trees Action Plan has kickstarted tree planting across the country and our priorities to expand, protect, improve and connect England’s woodlands."
        },
        {
            "text": "While these statistics are wonderful news, there’s still plenty to be done and we’re taking on-going action by:"
        },
        {
            "text": "As you can see, it’s been an incredibly busy start to 2023 for the Defra’s Trees and Forestry Team, the Forestry Commission and our Delivery Partners, and we still have the rest of the year to go!"
        }
    ]
}