{
    "url": "https://insolvencyservice.blog.gov.uk/2023/07/10/thinking-of-starting-a-limited-company-heres-what-you-need-to-know-about-our-new-directors-information-hub/",
    "title": "Thinking of starting a limited company? Here’s what you need to know about our new Directors Information Hub",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Director Education",
        "Director Information",
        "Limited companies"
    ],
    "pub_date": "2023-07-10T11:38:14+01:00",
    "content": [
        {
            "text": "If you’ve got a great idea for starting a limited company and are keen to get started."
        },
        {
            "text": "To help make sure your business succeeds – and keeps succeeding – the government has created an information hub for company directors so you can access guidance and support you need to make the right decisions, at the right time, for your business."
        },
        {
            "heading": 3,
            "text": "Who is the hub for?"
        },
        {
            "text": "The hub is for directors of micro, small and medium-sized limited companies, although it will also be useful to others."
        },
        {
            "text": "Directors of limited companies, unlike sole traders, must comply with certain statutory obligations."
        },
        {
            "text": "These can range from hairdressers and builders with their own companies to directors of mid-sized companies in the IT sector, for example."
        },
        {
            "heading": 3,
            "text": "What is the hub for?"
        },
        {
            "text": "The hub provides a one-stop place, for you to find bitesize guidance and information to help you make the right decisions for your company at the right times."
        },
        {
            "heading": 3,
            "text": "What will the hub offer?"
        },
        {
            "text": "The hub will offer written and video guidance and information, all in one place, to support you to steer your company along the path to success and avoid potential pitfalls along the way."
        },
        {
            "text": "Use the hub to help you recognise:"
        },
        {
            "heading": 3,
            "text": "How will the hub work?"
        },
        {
            "text": "When you first access the hub, you will see a choice of different, clickable themes that make up the lifecycle of a typical limited company incorporation / start-up to closure and/or insolvency"
        },
        {
            "text": "Each theme contains sub-topics so that you can find the particular issue you need to explore. Here, you’ll find key information to help you make the right decisions, along with links to more detailed guidance."
        },
        {
            "text": "You can also watch short, animated videos exploring common scenarios that you or your company might be facing, to help you understand how you can move your company forward or avoid potential problems."
        },
        {
            "heading": 3,
            "text": "Why is the hub relevant to me?"
        },
        {
            "text": "The hub solves common problems that directors encounter when trying to find important information to help keep their business on the road to success."
        },
        {
            "text": "We’ve spoken to micro and small business directors, just like you, to understand what support and information small businesses need to make sure they thrive."
        },
        {
            "text": "We have worked with government departments that small businesses use, such as HMRC (His Majesty’s Revenue and Customs) and Companies House, to find out what information you need about them."
        },
        {
            "text": "And we have talked to other groups, including insolvency practitioner organisations, director helplines and banks, to discover information that directors need to keep their company’s finances on track."
        },
        {
            "text": "The hub brings together this relevant information in one easy-to-access place, to help you make the right decisions at any stage of your business’ development. On the hub you’ll find:"
        },
        {
            "heading": 3,
            "text": "When can I access the hub?"
        },
        {
            "text": "The hub is live from 10 July 2023"
        },
        {
            "heading": 3,
            "text": "Where can I access the hub?"
        },
        {
            "text": "You can access the Director Information Hub here: Director information hub - GOV.UK (www.gov.uk)."
        }
    ]
}