{
    "url": "https://ofqual.blog.gov.uk/2023/07/10/vocational-and-technical-qualifications-grading-in-2023/",
    "title": "Vocational and technical qualifications grading in 2023  ",
    "authors": [
        "Tom Bell"
    ],
    "categories": [
        "Uncategorized",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2023-07-10T09:30:01+01:00",
    "content": [
        {
            "text": "Students are at the heart of Ofqual’s work, and thousands take vocational and technical qualifications, such as BTEC Nationals or Cambridge Technicals. These qualifications are a passport for students to move on to further studies, an apprenticeship or employment.  Ofqual regulates to ensure that the arrangements for all qualifications are in the best interests of students, so that students can progress with confidence in their results.   "
        },
        {
            "heading": 2,
            "text": "Grading in 2023  "
        },
        {
            "text": "Many students taking vocational and technical qualifications take assessments throughout their course of study. Ofqual has been working with awarding organisations to make sure that their plans for all assessments taken at each stage in students’ courses were appropriate.   "
        },
        {
            "text": "In 2021 to 2022, Ofqual allowed awarding organisations to adapt their assessments, so that students studying vocational and technical qualifications could get the support they needed as we emerged from the pandemic. These adaptations were designed to free up time to recover lost teaching and learning. For many students, results from those assessments will be used towards qualifications this year.  "
        },
        {
            "text": "Some VTQ assessments are graded directly, using pre-set criteria. For other assessments awarding organisations set grade boundaries after students have taken the assessment.   As normal, senior examiners review student work and look at data on student performance. They balance this information to set grade boundaries. Awarding organisations will expect broadly the same quality of work at each grade as they did before the pandemic. However, where possible, senior examiners will monitor for any evidence of disruption and consider it when setting grade boundaries.  Awarding organisations have been taking this approach since assessments restarted after the pandemic. This means that students should not be advantaged or disadvantaged if they took assessments early in their course, or at the end.    "
        },
        {
            "heading": 2,
            "text": "Will grades look similar to 2019? "
        },
        {
            "text": "The range of qualifications available to students has changed since before the pandemic, and the impact of the pandemic itself means that students may be making different decisions about the qualifications they take.   Reformed Level 3 qualifications (such as BTEC Nationals or L3 Cambridge Technicals) were introduced shortly before the pandemic.  The reformed qualifications introduced external assessment, often in the form of traditional written exams, though a large percentage of assessment remains as coursework.  Schools and colleges have been moving across to the reformed qualifications over time, and funding for the old qualifications was removed for students starting qualifications from August 2020, so entry numbers have increased over time. For some schools and colleges, due to the use of teacher assessed grades in the pandemic, this will be the first year that students have taken external assessments for the reformed qualifications.  These changes mean that even though the approach to grading in 2023 may be similar to 2019, the pattern of grades achieved may look different from 2019.  As for all qualifications, the return to formal assessments means that outcomes are expected to be lower than outcomes in 2022.  Universities and employers are aware of this and have taken this into consideration when making offers to students. Awarding organisations are monitoring for evidence of disruption, as set out elsewhere in this blog, so that students are not advantaged or disadvantaged whatever qualification they are taking.  "
        },
        {
            "heading": 2,
            "text": "Technical Qualifications in T Levels "
        },
        {
            "text": "While there are important differences between Technical Qualifications (TQs) within T Levels, there is greater consistency of approach between them compared to other VTQs. TQs are at a relatively early stage of delivery. We have asked awarding organisations to be generous in awarding to reflect the fact that TQs are new qualifications, and that students and teachers are less familiar with the assessments.   "
        },
        {
            "text": "This is the first year that T Levels are based fully on formal assessments, whereas those awarded previously have included at least some contribution from teacher assessed grades. This means that the profile of results is likely to look different from last year, so it will be important not to compare them with last year’s results. Such comparisons will not be meaningful, because of the different assessment arrangements.   "
        },
        {
            "text": "We published information on the awarding of GCSEs, AS and A levels in a separate blog post. "
        },
        {
            "heading": 2,
            "text": "Why are there different approaches for different qualifications?  "
        },
        {
            "text": "Ofqual works with awarding organisations so that students are not advantaged or disadvantaged whatever qualifications they take.   Different qualifications have different structures, while some qualifications, like Technical Qualifications within T Levels, are relatively new.  This means that different approaches are appropriate for different qualifications.  Ofqual works to make sure that awarding organisations take the right approach for their qualifications.   "
        },
        {
            "heading": 2,
            "text": "Results on time this summer   "
        },
        {
            "text": "Following the issues with late and incorrect vocational and technical qualification results last summer, Ofqual designed a robust action plan to support the timely delivery of level 3 results in 2023. Ofqual has worked with awarding organisations, schools and colleges, FAB (Federation of Awarding Bodies) and JCQ (Joint Council for Qualifications) to monitor the progress of this action plan, and will continue to closely monitor awarding organisations from now until results days. Level 3 results will be released to students on or by August 17.    "
        },
        {
            "text": "VTQ results Action Plan: measures for 2023."
        },
        {
            "text": " "
        },
        {
            "text": "Tom Bell"
        },
        {
            "text": "Senior Manager, Standards and Technical Issues"
        }
    ]
}