{
    "url": "https://defrafarming.blog.gov.uk/2024/04/10/acting-on-the-recommendations-of-the-dartmoor-review/",
    "title": "Acting on the recommendations of the Dartmoor Review",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Future Farming and Countryside Programme"
    ],
    "pub_date": "2024-04-10T12:51:56+01:00",
    "content": [
        {
            "text": "Dartmoor is one of England’s most loved landscapes, with wide open moorland framed by steep woodland valleys and rolling hills. "
        },
        {
            "text": "People are drawn to Dartmoor to immerse themselves in its nature and history. Generations of farmers working with the natural landscape have created a truly special place.  "
        },
        {
            "text": "For farming on Dartmoor to achieve its aims, it needs healthy and varied habitats working in harmony with food production. "
        },
        {
            "text": "We will continue to support the agriculture sector to do what it does best; produce food hand in hand with preserving the diversity and abundance of nature.   "
        },
        {
            "text": "Last year, ministers commissioned an independent review into protected site management on Dartmoor."
        },
        {
            "text": "Chaired by David Fursdon, the review was undertaken with advice and input from a panel of expert advisers, local farmers and stakeholders. "
        },
        {
            "text": "The review aimed to help us better understand how we can work with farmers to deliver much-needed environmental improvements on Dartmoor, balancing this alongside agricultural production, public access and cultural and natural heritage. "
        },
        {
            "text": "The findings, presented in the Independent Review of Protected Site Management on Dartmoor, were published on GOV.UK in December."
        },
        {
            "text": "The review confirms that over recent years the relationship between farming, nature and other impacts like climate change are not in balance on Dartmoor. Wildlife and nature are declining in a way that may jeopardise the value that Dartmoor brings to local communities and visitors. The review makes recommendations on the future management of Dartmoor’s sites of special scientific interest (SSSIs)."
        },
        {
            "heading": 2,
            "text": "Our response  "
        },
        {
            "text": "Today, we published our response to the review. "
        },
        {
            "text": "Our response sets out how we plan to support farmers on Dartmoor to produce food sustainably and run viable businesses while protecting important habitats and species. "
        },
        {
            "text": "We’ve addressed each of the review’s 42 recommendations. These include boosting farmers’ confidence in our environmental land management schemes, including those transitioning from Higher Level Stewardship (HLS) agreements; encouraging collaborative relationships between Natural England and commoners; and backing a robust strategy and long-term governance for Dartmoor.   "
        },
        {
            "text": "In this post, we’ll give an overview of the next steps we are taking as a priority and those we plan to achieve in the longer term.     "
        },
        {
            "heading": 2,
            "text": "Strengthening partnership working in Dartmoor "
        },
        {
            "text": "One of our first steps, recommended in the report, is to create a Land Use Management Group (LUMG). "
        },
        {
            "text": "The group will support the robust strategy and governance for Dartmoor and encourage collaborative relationships between Natural England and Dartmoor’s commoners and stakeholders.   "
        },
        {
            "text": "Defra will help facilitate the implementation of the LUMG. Ministers will appoint an independent chair who will be supported by a secretariat, provided by the Dartmoor National Park Authority (DNPA) and funded by Defra in the day-to-day running of the group. "
        },
        {
            "text": "The group will be responsible for developing a multi-functional land use framework and land use plan for Dartmoor. It will also oversee the development and implementation of other recommendations in the government response.  "
        },
        {
            "text": "The group will run for 2 years. We expect the first meeting to be held no later than this autumn to help inform the next steps for future agri-environment agreements in 2025 and to start making progress more generally, as soon as possible.   "
        },
        {
            "text": "Defra and Natural England will take what they've learned from the review and the LUMG and explore how some mechanisms and solutions for Dartmoor could be shared for best practice at a national scale. "
        },
        {
            "heading": 2,
            "text": "Protected site management "
        },
        {
            "text": "We want to make it easier for land managers to understand site designations and associated requirements, such as for those farming on Site of Special Scientific Interests (SSSIs) and to make monitoring and evaluation of these sites more transparent.   "
        },
        {
            "text": "While the ecological characteristics of the SSSI features are standard across the site, the right management for achieving favourable conditions will vary across the landscape to take account of other factors.  "
        },
        {
            "text": "The existing feature-based approach allows for this variability and the agreement of tailored and bespoke approaches for individual agreements. "
        },
        {
            "text": "Natural England is carrying out a programme of SSSI monitoring and resurveying on Dartmoor, which will be completed by the end of 2024. Natural England will share its findings with stakeholders and agreement holders on each common and will explain how this data affects their views on the condition and management of SSSIs.  "
        },
        {
            "heading": 2,
            "text": "Higher Level Stewardship and environmental land management schemes "
        },
        {
            "text": "We're committed to supporting farmers on Dartmoor in this transition period through the extension of their Higher Level Stewardship (HLS) agreements so they can plan to adapt to any future changes to management. "
        },
        {
            "text": "All agreement holders in Dartmoor have been contacted to set out proposals for agreeing further annual extensions to HLS agreements, into 2025.   "
        },
        {
            "text": "Beyond HLS, farmers and land managers can apply for our environmental land management schemes."
        },
        {
            "text": "Following the review, but before publishing our response, we shared a list of new and updated actions that would be available in our environmental land management schemes.  "
        },
        {
            "text": "As a result, the offer for moorlands is being significantly enhanced and expanded by updating current Countryside Stewardship actions and the addition of 5 new actions. This includes, but is not limited to: "
        },
        {
            "text": "Having created an offer that has the potential to address many of those challenges, we need to help farmers and commoners move into updated agreements as soon as possible.  "
        },
        {
            "text": "We will work closely with agreement holders to help them to prepare to apply for a new Countryside Stewardship Higher Tier/SFI agreement at a point when the time is right for them to do so."
        },
        {
            "text": "Together with Natural England, we also want to work with agreement holders who want to agree further HLS extensions, with a plan of action and trajectory for further improvement of SSSI site condition.    "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "This post gives an overview of our response but it isn't exhaustive. You can read our response our full response on GOV.UK  "
        },
        {
            "text": "When the chair of the LUMG is announced, we'll update this post. We look forward to setting the group up in the autumn and sharing our progress along the way."
        }
    ]
}