{
    "url": "https://stratcommand.blog.gov.uk/2024/04/10/arriving-gear-up/",
    "title": "Arriving gear up",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-10T11:51:28+01:00",
    "content": [
        {
            "text": "It was on the 8th of April 1944 that an RAF Wellington Bomber crash landed on Gibraltar’s runway."
        },
        {
            "text": "Mystery surrounds exactly why the plane crashed just over a year before the end of World War II. But six members of the RAF’s 179 Squadron were lucky to survive thanks to the skilful landing of Flight Lieutenant Walter George Edward Becker."
        },
        {
            "text": "Now to help mark the 80th anniversary of the event, a painting of the crash landing was presented to RAF Gibraltar at Devil’s Tower Camp this week."
        },
        {
            "text": "Titled “Arriving Gear Up,” the painting came about with the help of Malcolm Bradburn, whose father, Air gunner Sergeant Charles Bradburn, was one of the survivors on board the plane."
        },
        {
            "text": "Malcolm recalled how his father would retell his war stories as he was growing up. But it was only after his father passed away in 1996 at the age of 78, that he became aware of his father’s logbook, where Charles had recorded the incident."
        },
        {
            "text": "Ten years ago, on the 70th anniversary of the crash, Malcolm visited RAF Gibraltar with his daughter Karen and has since maintained a strong relationship with the unit."
        },
        {
            "text": "In January this year, Malcom contacted RAF Gibraltar’s Station Commander, Wing Commander Thomas Harvey, to let him know that an aviation artist called Andrew Harris had commissioned an oil painting of the RAF Wellington Bomber crashing on the airfield."
        },
        {
            "text": "The artist was meticulous with the artwork and he and Malcom spent hours discussing how the image should be portrayed. Malcolm was keen to have the plane hitting the runway with all the dust flying in the air, exactly like it would have done on the day of the crash."
        },
        {
            "text": "They discussed how he wanted the serial number of the plane and the Rock of Gibraltar in the background included in the artwork."
        },
        {
            "text": "Intrigued by the artwork and the history behind the crash, RAF Gibraltar’s Wing Commander Thomas Harvey invited Malcolm and his friends and family to the Station Headquarters where they presented the artwork before placing it proudly upon the wall."
        },
        {
            "text": "Malcom Bradburn said: “It’s lovely for the RAF Gibraltar to allow us to come and visit them and I’m sure if my dad was here now, he would probably be embarrassed by it all."
        },
        {
            "text": "“I just wish I had asked more questions when I was a young lad.”"
        }
    ]
}