{
    "url": "https://hmlandregistry.blog.gov.uk/2024/04/10/can-6700-practice-and-process-subscribers-be-wrong/",
    "title": "Can 6,700 Practice and Process subscribers be wrong?",
    "authors": [
        "Gavin Curry, Digital Communications and Editorial Officer"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-04-10T11:57:09+01:00",
    "content": [
        {
            "text": "Launching any new publication is an anxious time for everyone involved. Have we got the format right, will the material be ready – and will anyone read it?"
        },
        {
            "text": "These questions were in all of our minds in the build-up to the launch of Practice and Process in March last year. We were confident our professional customers needed and wanted a regular summary of our practice guide updates, process changes and training initiatives. We’d done our research and user testing to define the content and presentation. But still, how many people would make the effort and commitment to subscribe to another email newsletter?"
        },
        {
            "text": "The answer 12 months on is that more than 6,700 practitioners working across the property industry have done just that, choosing to receive Practice and Process in their inboxes each month. We’re happy with the number but would like it to grow further as more customers discover why more than 90% of respondents to our recent reader survey rated it at either 4 or 5 out of 5."
        },
        {
            "heading": 2,
            "text": "‘Useful, concise and reliable’"
        },
        {
            "text": "The survey gave the people who matter, the readers, the chance to sum up the benefits of Practice and Process in their own words, with comments including ‘Useful, concise, regular updates’, ‘Great to have updates that tell you what has actually changed so that you don't have to compare the old against the new’, ‘Useful to know what's going on in one place’, ‘Easy and reliable’ and ‘Snappy’."
        },
        {
            "text": "We’d like to think those values run right through the newsletter. It always opens with a round-up of updates to our practice guides from the preceding calendar month. As users of our guides will know, the changes can range from something as simple as a single change of address to multiple amendments driven by legal or policy developments. Where previously we might simply have listed them, in Practice and Process we explain what’s changed and why. So far, we’ve featured 64 updates, presented in a handy, easily read format. For example:"
        },
        {
            "heading": 3,
            "text": "Which practice guide has changed?\nPractice guide 9: powers of attorney and registered land"
        },
        {
            "text": "When did it change?\n18 December 2023"
        },
        {
            "text": "What has changed?\nWe have amended section 7."
        },
        {
            "text": "What does it mean for customers?\nAs a result of the Powers of Attorney Act 2023, we have amended the guidance to clarify that, from 18 November 2023, we will accept a copy of a power of attorney if it has been certified by a chartered legal executive."
        },
        {
            "text": "The process section that follows is fully flexible, allowing us to keep readers informed about anything that affects the way we work with them, such as changes to our identity requirements, or ways they can help themselves, such as by using a checklist on lease extension applications."
        },
        {
            "text": "Under the customer training banner, we regularly promote our core material while highlighting new webinars and videos, including our Top 10 Tips series on avoiding requisitions, and introducing readers to useful pages, such as the Essentials training package or specialist support services hub."
        },
        {
            "text": "For Central Operations Manager David Linn, the newsletter has quickly established itself as a useful means of communication. \"As someone who leads the team responsible for maintaining the guidance for our customers and caseworkers I find Practice and Process to be an extremely valuable platform to enable the sharing of recent and forthcoming key changes with our customers,\" he said."
        },
        {
            "heading": 2,
            "text": "The next 12 months"
        },
        {
            "text": "In our survey we asked readers what they’d like to see in Practice and Process in the future. There were many great suggestions, including one we could act on almost immediately, as it chimed with an idea already taking shape."
        },
        {
            "text": "The request was for more question and answer features, and our new concept was for readers to put their own questions directly to our Customer Policy Manager Adam Hookway for him to answer in his authoritative style. The questions have already started coming in, in response to an invitation in the March issue, and Ask Adam is being inaugurated this month."
        },
        {
            "text": "To make sure you don’t miss an issue, subscribe now – if you haven’t already."
        },
        {
            "text": " "
        }
    ]
}