{
    "url": "https://environmentagency.blog.gov.uk/2024/04/10/farming-rules-for-water-the-importance-of-nutrient-management-planning-in-farming/",
    "title": "Farming rules for water: The importance of Nutrient Management Planning in farming",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Environment Agency",
        "Regulated industry",
        "Sustainability"
    ],
    "pub_date": "2024-04-10T07:34:58+00:00",
    "content": [
        {
            "text": "\n"
        },
        {
            "text": "Following last week’s blog about soil testing, we’re now looking at another area where we often find issues during a farm inspection – nutrient management planning. Around 30% of farms we inspected last year weren’t able to provide evidence of how they plan the spreading of manures or fertilisers, on their land. So, what do they need to know?  "
        },
        {
            "text": "The important part:  "
        },
        {
            "text": "What are the regulations? "
        },
        {
            "text": " There is no legal requirement to have a physical nutrient management plan, but it’s harder to demonstrate compliance without one. "
        },
        {
            "text": "That clarifies the rules – now we’ll look at what they mean in practice. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Our officers will want to discuss nutrient management plans during an inspection. They will need evidence that planning has been carried out ahead of nutrient applications and that weather conditions and pollution risk factors have been taken into account. "
        },
        {
            "text": "The kind of evidence they will be looking for includes: "
        },
        {
            "text": " What should a good plan include? "
        },
        {
            "text": "The Tried and Tested website has nutrient management plan guidance and templates available to download for free. The template includes sections on: "
        },
        {
            "text": " We can think of planning nutrient use in terms of the 4 Rs: "
        },
        {
            "text": "We expect a nutrient management plan to be used in conjunction with soil analyses and risk maps of your farm (showing water courses, bore holes, slopes and gradients). "
        },
        {
            "text": "How does having a good plan for nutrient use help?  "
        },
        {
            "text": "Having a good plan doesn’t just mean you’ll be complying with legislation and can relax when you have a farm inspection. And it’s not just about protecting the environment. Having a good plan in place means that you only use fertiliser when you need to, not because you think you should or just because you always have done. You can save money on buying fertiliser, vehicle use, maintenance and time spent spreading.  "
        },
        {
            "text": "And we’ll give the last word to our Senior Environment Officer in Devon and Cornwall, Rob Baker:  "
        },
        {
            "text": "“Armed with up-to-date soils analysies, farmers are then able to plan nutrient applications for crops in a much more precise way than ever before. Having a Nutrient Management Plan demonstrates the farmer has thought about what nutrients a crop will need, what is already in the soil and what the deficit is. "
        },
        {
            "text": "Any nutrient shortfall can be either made up of organic manures, manufactured fertiliser or a combination. "
        },
        {
            "text": " Having a proper “working” nutrient management plan means crop growth is optimised and pollution risk reduced. It also saves the farmer money from applications of bagged fertiliser that isn’t always needed! "
        },
        {
            "text": " My advice to farmers unsure about what’s required would be to talk, ask questions, speak to us – we are there to help. "
        },
        {
            "text": " The technology is out there as we enter an era of precision agriculture. If we make use of it, we will all benefit.”  "
        },
        {
            "text": "Farmers: don’t wait for your next inspection to get your nutrient management plan in order. Visit the Tried and Tested website for guidance and templates.  "
        },
        {
            "text": "To keep up to date with our activity, follow the Environment Agency on Twitter, and sign up for email alerts. "
        }
    ]
}