{
    "url": "https://environmentagency.blog.gov.uk/2024/04/10/reducing-methane-emissions-to-help-combat-climate-change/",
    "title": "Reducing methane emissions to help combat climate change",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Regulated industry"
    ],
    "pub_date": "2024-04-10T10:04:37+00:00",
    "content": [
        {
            "text": "The Environment Agency has set out in one place what it is doing to help reduce methane emissions in England, bringing together all their work in a new Methane Action Plan (2024-26). [Mark Ellis-Jones, the national Climate Change and Energy Manager], helps explain more. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why is methane important? "
        },
        {
            "text": "Methane (CH4) is the main component of natural gas, with 60% of global emissions coming from human activity (e.g. fossil fuels, waste) and 40% coming from nature (Global Methane Budget).  "
        },
        {
            "text": "This is important because methane is a potent greenhouse gas, and a major contributor to global climate change. Whilst short-lived in our atmosphere, it is 28 times stronger than carbon dioxide (CO2), with some estimates putting it much higher.  Methane can also contribute to deteriorating air quality and impacts on human health. According to the United Nation’s Intergovernmental Panel on Climate Change (IPCC), nearly half of the 1.1°C global temperature increase is attributable to methane. "
        },
        {
            "text": "Cutting methane emissions is therefore one of the most effective ways to reduce near-term global warming. Unfortunately, global concentrations of methane continue to increase (Global Methane Tracker 2023). Fortunately, global governments – including the UK – are committed to doing something about it. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "UK action on methane "
        },
        {
            "text": "The UK has long acknowledged the importance of reducing methane emissions as part of its broader climate change targets, and in meeting net zero by 2050. The UK Methane Memorandum details how UK methane emissions dropped by over 62% since 1990 and what more is being done to secure further progress. "
        },
        {
            "text": "In 2022, the UK signed the Global Methane Pledge to collectively reduce global methane emissions by at least 30% by 2030 compared to 2020 levels. And in 2023, the UNFCCC’s COP28 agreement called on all countries to accelerate efforts to reduce methane emissions by 2030.  "
        },
        {
            "text": "In the UK,  methane represented 14% of total greenhouse gas (GHG) emissions in 2022, with the main sources coming from agriculture, waste and fuel supply sectors (DESNZ 2024 ).  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Environment Agency’s role "
        },
        {
            "text": "The Environment Agency has an important regulatory role in reducing methane emissions in England. Our Methane Action Plan sets out how we will reduce methane emissions using our powers as an environmental regulator whilst also sharing knowledge and good practice to reduce methane emissions in the UK and internationally. "
        },
        {
            "text": "Methane is recognised as a priority pollutant requiring capture and control for certain sectors we regulate, such as landfill sites, and anaerobic digestors operating under Environmental Permitting Regulations (EPR). We also work with other sectors, including water companies and farmers, to reduce their methane emissions through their compliance with regulatory requirements that also help control methane or by supporting them to develop voluntary actions, such as industry codes of practice, or by sharing information and research on reducing emissions.  "
        },
        {
            "text": " "
        },
        {
            "text": "Our Methane Action Plan sets out three priority objectives:  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Our work in practice "
        },
        {
            "text": "Here are two case studies of how we’ve been working to put the Methane Action Plan into practice. "
        },
        {
            "heading": 4,
            "text": "Diffuse emissions from waste water treatment "
        },
        {
            "text": "Our Regulated Industry officers identified potential diffuse biogas emissions from a post anaerobic digestion (AD) storage tank at a waste water treatment works. The officers used an optical gas imaging (OGI) camera to identify the diffuse emissions of biogas as part of their investigation and identified that there was approximately 300 m3/day of biogas emitted to atmosphere. There is a significant proportion of the biogas that is comprised of methane. As a result of this work, the water company took steps to deal with this diffuse emission. The water company proposed to enclose the post AD storage tank to capture the gas as a fuel for the onsite combined heat and power (CHP) plant used to power site operations. This is a good example of how the Environment Agency has used the OGI cameras to help reduce greenhouse gas emissions and a potential odour source. "
        },
        {
            "heading": 4,
            "text": "Fugitive emissions from an onshore oil well  "
        },
        {
            "text": "The Environment Agency regularly reviews permits and as part of an improvement programme for the onshore oil and gas industry our regulatory teams conducted a review of waste gas management at several sites. A review of an oil well site in the south of England identified an unacceptable level of associated gas venting at the site. Using our guidance, we required the operator to assess whether the vented gas could be utilised, rather than wasted. As the site is remote and some distance from potential electrical and gas grid connections, the operator determined that a gas compression and bottling scheme would be feasible. The scheme would allow the export of gas in cylinders for use as a fuel at other sites. The gas utilisation system is now installed and operational, saving approximately 12,250 tonnes CO2e a year. "
        },
        {
            "text": "  "
        },
        {
            "text": "  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}