{
    "url": "https://socialcare.blog.gov.uk/2024/04/10/unpaid-carers-leave-your-right-to-look-after-yourself/",
    "title": "Unpaid carer's leave: your right to look after yourself",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Guidance",
        "Workforce"
    ],
    "pub_date": "2024-04-10T11:48:15+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Caring at home and work is tough"
        },
        {
            "text": "I know from my own experience how challenging it can be juggling a busy work life and looking after a family member, in my case my mum at the end of her life. Those six months were tough, emotionally and physically. I experienced every emotion you can imagine. I know many of my colleagues, past and present, have lived through similar times or are doing so right now. Supporting each other helps. We cannot care for others without taking care of ourselves, however difficult or impossible that feels."
        },
        {
            "text": "That's why I am very pleased the Carer’s Leave Act 2023 has now come into effect this month. This legislation means employees in any profession are now entitled to time off (without pay) to give or arrange care for dependants."
        },
        {
            "text": "For the first time, employees, who are also carers, will be able to take up to five days unpaid leave to better balance work with caring responsibilities, within any 12-month period. Employees can take time off in full or half days, or in a whole block of five."
        },
        {
            "text": "These strengthened employment rights will help millions of unpaid carers across the UK, allowing individuals to handle the practical aspects of caring and enabling both the carer and the cared for to enjoy more precious moments together."
        },
        {
            "heading": 2,
            "text": "Unpaid carers in the social care sector"
        },
        {
            "text": "Although these leave rights apply to all workers, I am keen to observe how it benefits colleagues who are employed within the social care sector. Despite paid carers supporting individuals during their daily occupations, many do come home to help loved ones in their private lives."
        },
        {
            "text": "The new rights are particularly important as previous Carers UK research shows around 600 people a day give up work to care due to a lack of flexibility and support. Having known the pressures across our profession, this act is welcome news. These measures aim to enhance the health and wellbeing of colleagues, improve employers’ staff retention rates, and reduce recruitment costs."
        },
        {
            "text": "It is vital we set an example as a profession and support our care colleagues with caring responsibilities outside work to use these new employment protections where they can."
        },
        {
            "text": "After all, being an unpaid carer comes with many challenges. In 2020, Carers UK published a survey which highlighted the following three common difficulties:"
        },
        {
            "heading": 2,
            "text": "Protecting our care colleagues"
        },
        {
            "text": "Considering existing pressures on the frontline, I am mindful how these factors impact those who also happen to be unpaid carers. I am hopeful this new law will assist in removing some of these burdens and have a positive impact on family lives, relationships, job satisfaction, and colleague morale."
        },
        {
            "text": "To find out how to access unpaid absences, visit GOV.UK."
        },
        {
            "text": "To make sure employers are aware of what is required of them, Carers UK has created a new guide. For more information, visit the Employers for Carers website."
        }
    ]
}