{
    "url": "https://deframedia.blog.gov.uk/2025/02/05/coverage-of-the-governments-record-investment-to-protect-uk-homes-and-businesses-from-flooding/",
    "title": "Coverage of the Government’s record investment to protect UK homes and businesses from flooding",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2025-02-05T13:11:47+00:00",
    "content": [
        {
            "text": "There has been widespread media coverage after the Government announced a record £2.65 billion investment to protect thousands of UK homes and businesses."
        },
        {
            "text": "Publications including the Financial Times, The Daily Mirror, Bloomberg, The Express, BBC, The Guardian among others covered the announcement, with further broadcast coverage from outlets such as Sky News, LBC, BBC Radio 4 Today and GMB who spoke with the Secretary of State for Environment, Food and Rural Affairs Steve Reed on Wednesday morning."
        },
        {
            "text": "As part of the Plan for Change, the Government is committing a record two-year investment of £2.65 billion with 52,000 properties set to benefit from new defences by March 2026. To shore up creaking defences in need of repairs, funding will be reprioritised for investment in much-needed maintenance, benefitting a further 14,500 properties. This means a total of 66,500 properties will benefit from this funding.   "
        },
        {
            "text": "As well as protecting families from the devastation of flooding, the investment supports economic growth by protecting businesses, supporting jobs, and supporting a stable economy in the face of the increasing risk of flooding as a result of climate change. The Express carries an op-ed from Farming Minister Daniel Zeichner, who explains how the new investment programme will also protect farmland which has been badly hit by recent storms, in turn helping to safeguard farm businesses and farmers’ profits. "
        },
        {
            "text": "Secretary of State for Environment, Food and Rural Affairs Steve Reed said:"
        },
        {
            "text": "Environment Agency Chair Alan Lovell said:  "
        }
    ]
}