{
    "url": "https://environmentagency.blog.gov.uk/2025/02/05/how-the-environment-agency-is-assessing-new-nuclear-power-station-designs/",
    "title": "How the Environment Agency is assessing new nuclear power station designs",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Nuclear",
        "Regulated industry",
        "Uncategorized"
    ],
    "pub_date": "2025-02-05T09:49:13+00:00",
    "content": [
        {
            "text": "As the UK government takes forward its plans for a low carbon future, the regulators of the nuclear industry, the Environment Agency, Office for Nuclear Regulation and Natural Resources Wales are currently assessing three new nuclear reactor designs."
        },
        {
            "text": "Teams of nuclear regulators and specialists at the Environment Agency, Natural Resources Wales and the Office for Nuclear Regulation are working together, scrutinising Rolls-Royce’s SMR, Holtec’s SMR 300 and GE-Hitachi’s BWRX-300 small modular reactor designs."
        },
        {
            "text": "Our enabling and innovative Generic Design Assessment (GDA) process also allows anyone to get involved by asking questions about the designs through the GDA comments process."
        },
        {
            "text": "In this blog Mike Webley and Andrew Pynn share insights from a recent ‘joint regulators’ trip to the United States, highlighting that assessment of nuclear reactor designs isn’t just a desk-based exercise."
        },
        {
            "text": "Nuclear power is likely to play a key role in decarbonisation and the Environment Agency is central to this. We want nuclear power to contribute to the government’s strategy in a way that embeds sustainability principles, considers the whole lifecycle of the power station, is designed to be decommissioned and protects people and the environment."
        },
        {
            "text": "The GDA process enables the UK’s nuclear regulators to assess new nuclear power station designs at an early stage of the regulatory process and crucially it provides an opportunity for us to feed back our views to the design companies. It is viewed as a world-leading process to provide reactor designers with early regulatory scrutiny. Our interaction with designers through GDA helps to support growth and fulfils one of our duties; to support sustainable development.  GDA can be carried out at a fundamental assessment level or at a detailed assessment level."
        },
        {
            "text": "At the Environment Agency our focus is an environmental assessment of the nuclear reactor design."
        },
        {
            "text": "This involves reviewing many submissions and meetings with the company that is designing the nuclear power station. Reviewing designs on paper before construction is important but it’s also extremely valuable to visit the design company, talk to engineers and, where possible, see their facilities and any existing operating sites. This provides a great opportunity to build our relationship with the company, develop a deeper understanding of the power station design and enhance the effectiveness of our assessment."
        },
        {
            "text": "During previous design assessments our team of assessors visited France, the United States, Japan and China."
        },
        {
            "text": "Visits to learn more about the Rolls-Royce SMR"
        },
        {
            "text": "During the Rolls-Royce SMR GDA, our assessment team has visited the Manufacturing Technology Centre in Coventry to see a prototype module and a demonstration of the Rolls-Royce SMR approach to modularisation which included a discussion on sustainable use of resources and decommissioning."
        },
        {
            "text": "We hope to visit their new module development facility at Factory 2050 in Sheffield in the near future to better understand how the Rolls-Royce SMR will be constructed."
        },
        {
            "text": "Learning more about Holtec’s work at their USA Headquarters"
        },
        {
            "text": "Back in November our Environment Agency and ONR assessors travelled to Holtec International’s headquarters in Camden, New Jersey (USA)."
        },
        {
            "text": "At Holtec’s advanced manufacturing facility we saw nuclear components and storage casks in production."
        },
        {
            "text": "Holtec told us they want to develop a similar factory in the UK, currently planned for South Yorkshire. It was useful to see Holtec’s manufacturing capability in action through the production of Multi-Purpose Canisters (MPCs) and HI-STORM (Holtec International Storage Module) for dry storage of used nuclear fuel."
        },
        {
            "text": "We spent time with Holtec’s engineers and design team – this included interactive workshop sessions on design management, management for safety and quality assurance and best available techniques. The sessions enhanced our knowledge of the design and the design management processes and raised Holtec’s awareness of our enabling regulatory approach to design assessment. We were particularly impressed with a session on Holtec International’s intelligent customer relationship with a contractor ENERCON and how Holtec identifies structures, systems and components that provide an environmental protection function."
        },
        {
            "text": "The workshop exceeded our expectations and provided a useful insight into Holtec’s design management processes and how the SMR-300 design incorporates environmental requirements. We were also pleased to see how well Holtec Britain as a rapidly growing company has been integrated into the wider Holtec organisation."
        },
        {
            "text": "Our team saw Holtec’s decommissioning in action at the Oyster Creek nuclear power station on the Atlantic coast near Philadelphia."
        },
        {
            "text": "Holtec’s team shared how learning gathered from decommissioning at that site is fed back into Holtec’s future SMR decommissioning strategy and influences the SMR-300 design."
        },
        {
            "text": "We take huge value from these meetings where we speak directly to the company’s designers and engineers and view their work in progress. It brings the process to life for the design teams and their active participation always enhances the effectiveness of our assessment. "
        },
        {
            "text": "Comparing notes with the US regulator"
        },
        {
            "text": "International collaboration between regulators has the potential to benefit regulatory approvals across multiple countries and enable sharing of assessment approaches. We signed a Memorandum of Understanding with the United States Regulatory Commission (US NRC) in 2024, which means we can meet our US NRC counterparts and discuss regulatory approaches and collaboration opportunities for the design assessment of new reactors."
        },
        {
            "text": "Whilst we were over in the USA we took the opportunity to meet with the US NRC in Washington DC. We talked about how we can share information and work better together on our assessment of designs that have plans to build in both the UK and the US."
        },
        {
            "text": "Have your say on new nuclear power station designs"
        },
        {
            "text": "We now have three GDA public comments processes open. We encourage anyone, including engineers, academics, scientists, environmental groups and those interested in nuclear reactor designs and their impact on the environment to take part and share comments or ask questions."
        },
        {
            "text": "In December we announced that GE-Hitachi had moved to Step 2 of the GDA process and launched its GDA website, as Holtec and Rolls Royce SMR have done previously."
        },
        {
            "text": "Our innovative and engaging requirement for a public comments process ensures that GDA is open and transparent. We ask the reactor design companies to publish the information that they send to us for assessment. Anyone can look at those documents and make comments and ask questions directly to the design companies. We’ll see the comments and answers and will consider relevant comments as part of our assessment."
        },
        {
            "text": "This additional scrutiny of designs enhances the process and we’re looking forward to seeing what comments the public and wider stakeholders are making. Take part in the comments process for:"
        },
        {
            "text": "GE-Hitachi’s BWRX-300 GE Hitachi BWRX-300 SMR: UK GDA"
        },
        {
            "text": "Holtec International’s SMR-300 Holtec Britain Generic Design Assessment"
        },
        {
            "text": "Rolls-Royce SMR Ltd’s 470Mwe small modular reactor Home | Rolls-Royce SMR - Generic Design Assessment"
        }
    ]
}