{
    "url": "https://defrafarming.blog.gov.uk/2025/02/05/local-nature-recovery-strategies-have-your-say/",
    "title": "Local Nature Recovery Strategies: have your say ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK",
        "Ways to get involved"
    ],
    "pub_date": "2025-02-05T12:07:09+00:00",
    "content": [
        {
            "text": "Climate change, biodiversity loss and food security are interconnected challenges. However, the pragmatism and innovation of farmers, growers and land managers provide reasons for optimism. "
        },
        {
            "text": "Local Nature Recovery Strategies (LNRSs) complement and focus these efforts by setting out where and how action can be taken to support nature. "
        },
        {
            "text": "There will be 48 LNRSs in total, covering the whole of the country, with no gaps or overlaps.  "
        },
        {
            "text": "Preparation for LNRSs is underway in all areas. The first LNRS for the West of England was published in November 2024 and the rest are expected in 2025. So, for most of you, there’s still time to shape your local strategy. "
        },
        {
            "text": "In this post, we’ll give an overview of LNRSs, share the benefits and explain how you can get involved. We’ll also include case studies from farmers and highlight the recently launched Land Use in England Consultation. "
        },
        {
            "heading": 2,
            "text": "Specific, targeted proposals "
        },
        {
            "text": "The intention is for each LNRS to suggest the best actions in the best locations, from small nature-friendly adjustments to farming practices to large-scale habitat restoration. "
        },
        {
            "text": "For example, an LNRS may suggest where and what trees could be planted on a piece of land to help slow the flow of water into rivers, which then reduces flooding of more productive land downstream. It might propose where wildflowers could best be planted to boost pollinators which will help crops. "
        },
        {
            "text": "This will make it easier for anyone to contribute to restoring our natural environment while also making local priorities for nature recovery clearer to funders. "
        },
        {
            "text": "Each LNRS comprises a written document and a map. Together, these set out local priorities for helping nature and improving the environment, alongside proposals for actions that could make the greatest contribution to achieving those priorities. "
        },
        {
            "text": "The strategies are developed collaboratively, linking the written priorities to mapped proposals for creating and improving habitat. "
        },
        {
            "text": "A responsible authority — a larger local authority, such as a county council or combined authority — leads the preparation of each LNRS. We’ll go into more detail about them later in the post.  "
        },
        {
            "text": "LNRSs will include proposals that will help us achieve the thriving natural environment we need for long-term food security.  "
        },
        {
            "text": "Each LNRS should explain why the proposed actions have been suggested. This way, if you choose to carry out any of the actions, you can be confident that they are evidence-based and will provide significant benefits for biodiversity and the wider environment. "
        },
        {
            "text": "These proposals may suggest changes to land use. Knowing where these changes would help most can support your decisions about land management, environmental improvements and food production. "
        },
        {
            "heading": 2,
            "text": "Supporting your decision-making "
        },
        {
            "text": "LNRSs won’t require you to change how you use your land or restrict development. They provide information to help you decide how to manage your land and make informed choices. "
        },
        {
            "text": "Likewise, if you want to do nature conservation work in an area that isn’t prioritised in the LNRS, you still can – LNRSs won’t prevent this and funding for nature recovery activities won’t only be available for areas mapped in an LNRS.  "
        },
        {
            "text": "The types of actions that LNRSs propose are intended to play an important role in meeting the government's targets and commitments for recovering nature and improving the environment. The government must track and report progress on these targets to determine where to focus efforts. "
        },
        {
            "text": "You can use LNRSs to help identify which environmental land management activities are most appropriate for your land and to see where there are opportunities for working with other land managers on landscape-scale nature recovery. "
        },
        {
            "text": "In future, LNRSs will help government when considering applications for funding specific nature recovery activities, by acting as criteria in applications for some schemes. LNRSs will also guide and incentivise landowners to create or enhance habitats for biodiversity net gain (BNG). "
        },
        {
            "heading": 2,
            "text": "Get involved  "
        },
        {
            "text": "The preparation for each strategy is led by a nominated responsible authority. "
        },
        {
            "text": "Each responsible authority is working with government agencies such as Natural England, the Environment Agency and the Forestry Commission. They are also engaging with local communities and farming groups, including the Country Land and Business Association (CLA) and the National Farmers Union (NFU), to develop their LNRS."
        },
        {
            "text": "They must also consult the public as part of the preparation process. "
        },
        {
            "text": "Across the country, many farmers and land managers have been sharing their views and helpful information about the land they manage at workshops and events led by responsible authorities. This is helping to ensure that LNRSs are developed with your priorities in mind.  "
        },
        {
            "text": "Many organisations and land managers have used LNRSs as an opportunity to connect with each other, local advice networks and other initiatives. Everyone has a stake in their local LNRS. Make sure your voice is heard and help shape the proposals for your area."
        },
        {
            "text": "You can find a map on GOV.UK which shows who is leading the preparation of the LNRS in your area and how to contact them. We hope that you will take the opportunity to shape your local LNRS.   "
        },
        {
            "heading": 2,
            "text": "Case studies"
        },
        {
            "text": " Matthew Darby, Kemerton Estate "
        },
        {
            "text": "Matthew Darby from Kemerton Estate in Worcestershire has already embraced the principles of the Worcestershire LNRS in his farming practices. His approach demonstrates how LNRSs can support farmers in making nature-friendly choices that also benefit their business. "
        },
        {
            "text": "Matthew has adopted regenerative mob grazing, a practice that has not only improved biodiversity on his farm but also boosted profitability. By focusing on soil health and environmental sustainability, he has seen significant benefits for both his land and livestock. "
        },
        {
            "text": "He explains, 'Regenerative mob grazing gives us excellent water retention, a huge amount of carbon going into the soil and rapid soil build-up. We also see a rise in invertebrates, insects and small mammals.' The shift to this system, he adds, was driven by cost. 'We have no winter feed costs, no building costs. Our vet and medication bills are much lower.' "
        },
        {
            "text": "At Kemerton, the emphasis is on improving soil quality, which benefits both the environment and the farm’s bottom line. Matthew has prioritised long-term sustainability, noting, 'For 40 years, we've had a philosophy on the farm to maximise biodiversity. Farmland bird and insect species are struggling nationally and we need a landscape-scale approach to tackle that.' "
        },
        {
            "text": "LNRSs are designed to help more farmers take this kind of approach by identifying local priorities and connecting land managers with opportunities to support nature recovery. By working at a landscape scale, they provide a framework for farmers like Matthew to make changes that contribute to wider environmental goals, ensuring that efforts to restore biodiversity are coordinated and more effective. "
        },
        {
            "text": "Allan Morris, Caddicroft Farm "
        },
        {
            "text": "Allan Morris’ family has been tenant farmers on Caddicroft Farm for over 100 years. Over the decades, they have witnessed changes in the landscape and adapted their farming practices in response. "
        },
        {
            "text": "Allan recalls, 'As a kid, we used to come and play in the Bow Brook. It was magic. But over time, we saw change. The brook was cleaned out, and there used to be fishermen every 10 yards. Now, the brook floods a lot more than it ever did before.' "
        },
        {
            "text": "Recognising the increasing environmental pressures, Allan and his family decided to move all their farming activities away from the brook. This has brought environmental benefits, with wildlife starting to return. "
        },
        {
            "text": "‘It’s coming back to life. We're no longer putting fertilisers and sprays near the brook, and we don’t use insecticides on the farm anymore. We used to, but that’s gone now.’ "
        },
        {
            "text": "By shifting their approach, the Morris family has not only helped nature recover, but also reduced reliance on costly inputs, improving the farm’s resilience. 'We’ve realised we’ve got to go with nature rather than battle against it,' Allan says. "
        },
        {
            "text": "This kind of nature-friendly approach is exactly what LNRSs are designed to encourage. By setting out local priorities for restoring nature and improving water quality, LNRSs can help more farmers like Allan make changes that benefit their land, their business and the environment. "
        },
        {
            "heading": 2,
            "text": "Land Use in England Consultation "
        },
        {
            "text": "The government recently launched the Land Use in England Consultation, to shape a new Land Use Framework for England."
        },
        {
            "text": "This consultation explores how commitments to restore nature, support food production, and build housing and infrastructure will impact land use. It also invites public discussion on how land should be used."
        },
        {
            "text": "Later this year, the government will publish a Land Use Framework, setting out the evidence, data, and tools needed to support national and local government, landowners, businesses, farmers and nature groups."
        },
        {
            "text": "The consultation runs from 31 January to 25 April 2025."
        }
    ]
}