{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/02/05/national-apprenticeship-week-2025-a-world-of-numbers-in-group-finance/",
    "title": "National Apprenticeship Week 2025: A world of numbers in Group Finance",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Learning & Development"
    ],
    "pub_date": "2025-02-05T09:40:17+00:00",
    "content": [
        {
            "text": "Starting my apprenticeship in Group Finance at 16 years old was a unique experience - especially as I found myself among colleagues who were much older and more experienced. While my friends were heading off to university, I was diving into the world of finance. It could have been overwhelming, but the supportive and welcoming environment made it easy to adapt. I quickly realised that Group Finance wasn’t just about numbers; it was a place where I could learn, grow, and build a meaningful career."
        },
        {
            "text": "The apprenticeship scheme’s structured learning programme provided hands-on experience from day one. It wasn’t just about completing tasks, it was about actively contributing to high-level projects that aligned with my career goals. I started working with the Group Finance senior leadership team early on, learning how to support strategic decision-making and understanding the broader vision of the department."
        },
        {
            "text": "The apprenticeship also gave me the chance to collaborate with external agencies, such as the Government Internal Audit Agency and His Majesty’s Treasury, where I was involved in publishing recommendations and learning about financial governance. These experiences laid a strong foundation for my day-to-day work, as I continue to work closely with senior leaders and contribute to impactful projects with external partners. The practical, real-world learning I gained during my apprenticeship continues to influence my role today and remains an essential part of my career in finance."
        },
        {
            "text": "I currently work in Group Finance, where I focus on counter-fraud initiatives and strategic projects. Beyond professional growth, I’ve built lasting friendships during my time in the department. My colleagues and I have travelled together to places like Spain and Egypt, and outside of work, they’ve become a key part of my life. Every day, I’m thankful for the department, for the connections I've made, and for the chance to work with such a supportive and inspiring team."
        },
        {
            "text": "For anyone currently on an apprenticeship or considering one, my biggest piece of advice is to embrace every opportunity that comes your way. Whether it’s working with senior leadership, presenting at meetings, or collaborating with external agencies, these experiences will lay the foundation for your future career."
        },
        {
            "text": "The opportunities you take on today will shape your career tomorrow, so don’t hesitate to challenge yourself and learn from every experience."
        },
        {
            "text": "If you're interested in getting in touch with Finley to find out more about Group Finance, or if you have any questions about apprenticeship programmes, please email gse@go-science.gov.uk"
        }
    ]
}