{
    "url": "https://healthmedia.blog.gov.uk/2025/02/05/new-opportunities-to-reclassify-medicines-what-you-need-to-know/",
    "title": "New opportunities to reclassify medicines: what you need to know",
    "authors": [
        "emilyhewat"
    ],
    "categories": [
        "Medicines",
        "Pharmacy"
    ],
    "pub_date": "2025-02-05T17:03:18+00:00",
    "content": [
        {
            "text": "The Department of Health and Social Care is issuing a list of medical conditions and categories where it is encouraging more reclassification applications to the Medicines and Healthcare products Regulatory Agency (MHRA)."
        },
        {
            "text": "What is medicine reclassification?"
        },
        {
            "text": "Medicines can be reclassified from available by prescription-only, to available in a pharmacy or over-the-counter. Removing prescription-only restrictions on certain medicines can mean patients can access more of the medicines they need without having to visit their GP. It can also give pharmacists the tools they need to support patients in self-care for common conditions."
        },
        {
            "text": "What is being published?"
        },
        {
            "text": "In 2024, a working group made up of government, NHS, clinicians, pharmacists, and industry identified a number of health conditions and medicine categories where more over-the-counter medicines could be beneficial for patients."
        },
        {
            "text": "We are now publishing that list and encouraging applications to the MHRA in these areas. The MHRA will assess each medicine product individually and will only grant reclassification if it considered safe and appropriate."
        },
        {
            "text": "Increasing the number of reclassifications in these areas will give more patients better access to much-needed medicines."
        },
        {
            "text": "Which health conditions and medicine categories have been identified?"
        },
        {
            "text": "The full list of conditions and medicine categories suitable for reclassification are:"
        },
        {
            "text": "Conditions"
        },
        {
            "text": "Indications"
        },
        {
            "text": "Gastro:"
        },
        {
            "text": "Skin:"
        },
        {
            "text": "Women’s Health:"
        },
        {
            "text": "Are there any exceptions to the list?"
        },
        {
            "text": "The MHRA will not consider any applications for medicines that include opioids or antibiotics. "
        },
        {
            "text": "Does this mean applications in the above categories will be automatically approved?"
        },
        {
            "text": "This announcement provides no guarantee that applications for reclassification in the above clinical areas will be approved by the MHRA. All applications are assessed independently by the MHRA against existing safety and efficacy criteria."
        },
        {
            "text": "How was the list produced?"
        },
        {
            "text": "These conditions have been identified following consultation between Government, NHS, clinicians, pharmacists, and industry."
        },
        {
            "text": "This group met under a ‘Reclassification Alliance’ chaired by the MHRA, with workstreams considering various areas of the reclassification process to understand where improvements or changes could be made to best serve patients."
        },
        {
            "text": "This conditions and categories workstream was chaired by PAGB, the consumer healthcare association, representing over-the-counter manufacturers. The list of conditions received additional scrutiny from Chief Pharmacists."
        },
        {
            "text": "How should companies apply?"
        },
        {
            "text": "For more guidance on how to apply to reclassify a product see Medicines: reclassify your product - GOV.UK. If you wish to write to the MHRA for further information on applying to reclassify medicines, please contact variationqueries@mhra.gov.uk. "
        },
        {
            "text": "For detailed scientific and regulatory advice on this or any other part of your medicines lifecycle, please see MHRAs recently refreshed scientific advice service at Medicines: get scientific advice from MHRA - GOV.UK."
        }
    ]
}