{
    "url": "https://defraenvironment.blog.gov.uk/2025/02/05/the-habitat-target-creating-and-restoring-habitats-across-england/",
    "title": "The Habitat Target: creating and restoring habitats across England",
    "authors": [
        "Iram Qureshi"
    ],
    "categories": [
        "Land use",
        "Nature",
        "Wetland",
        "Wildlife"
    ],
    "pub_date": "2025-02-05T10:32:20+00:00",
    "content": [
        {
            "text": "I’m Iram and I’m part of the Defra National Biodiversity Targets Team, supporting work on expanding wildlife-rich habitats so they can thrive.  "
        },
        {
            "text": "We are working towards reaching the Government’s legally binding biodiversity target to restore or create more than 500,000 hectares of wildlife-rich habitat by 2042 in England.  "
        },
        {
            "text": "The habitat target only counts actions taken on areas that were not already wildlife-rich. "
        },
        {
            "text": "In April last year, Defra and Natural England published a paper that includes definitions of restoration and creation, the list of wildlife-rich habitats, and the actions that will count toward the target. Examples include woodland, coastal and freshwater habitats. "
        },
        {
            "text": "Good quality habitats are crucial for wildlife, plants and humans. They provide shelter, food and water, plus wider benefits like supporting pollination and clean water. Access to nature can also improve people’s health and wellbeing. "
        },
        {
            "text": "In this post, I’m going to discuss how we’re reaching this target by improving habitats through programmes like the Species Survival Fund. "
        },
        {
            "text": "Enhancing Somersets coastal wetlands through restoration and creation of wildlife-rich habitat "
        },
        {
            "text": "To achieve the habitat target, Defra is working with partners. "
        },
        {
            "text": "In March 2024, Defra awarded a share of £25 million to 20 projects under the Species Survival Fund. The Species Survival Fund, administered by the National Lottery Heritage Fund on Defra’s behalf, aims to create and restore habitats including heathland, grassland, and wetlands.  "
        },
        {
            "text": "One of these projects is ‘Wetter for Waders: Enhancing Somerset’s Coastal Wetlands’.  This project is led by The Wildfowl and Wetland Trust (WWT), and is being delivered in partnership with Natural England, the Environment Agency and Blue Carbon Farming.  "
        },
        {
            "text": "This project is taking place at WWT’s Steart Marshes and on the adjacent Bridgwater Bay National Nature Reserve, which lie along the Somerset coast. The project is working to enhance, restore and create habitat, plus providing engagement activities to connect more people with nature.  "
        },
        {
            "text": "So far, the project has built multiple wetlands features, including 12 ponds and the restoration of one ‘ghost pond’. (Ghost ponds are sites of old ponds that have been lost due to deliberate infilling.) "
        },
        {
            "text": "As well as the benefits to local biodiversity, the project is also delivering positive impacts for local communities. The WWT has held two mural workshops, led by local artists and helped by local people, charitable organisations and volunteers. "
        },
        {
            "text": "The project has also delivered two days to promote wetland creation across local landowner and farming communities, demonstrating techniques for creating or restoring wetland habitats.  "
        },
        {
            "text": "Jessie Casey, Project Manager for the Species Survival Fund at WWT Steart Marshes said: “Feedback from our engagement events has been overwhelmingly positive.  "
        },
        {
            "text": "The Wetter for Waders project legacy will continue to connect people to nature, increase local wetland biodiversity and directly contribute to Defra’s habitat target.” "
        },
        {
            "text": "Measuring progress towards the habitat target "
        },
        {
            "text": "We are working closely with Natural England to develop the reporting that will capture how much wildlife-rich habitat has been created or restored across England, to measure progress towards this target. "
        },
        {
            "text": "In December last year, Defra published an overview of what data is required for reporting progress towards the target.  "
        },
        {
            "text": "Find out more  "
        },
        {
            "text": "If you would like to find out more on the Habitat Target, read our definitions and descriptions paper or information on our reporting model.  "
        },
        {
            "text": "And if you’re interested in the restoration and creation of ponds, read the University College London and Freshwater Habitats Trust guidance.  "
        }
    ]
}