{
    "url": "https://naturalengland.blog.gov.uk/2025/02/05/three-churrs-for-the-heathland-bird-survey/",
    "title": "Three churrs for the heathland bird survey",
    "authors": [
        "Alison Giacomelli"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Monitoring",
        "Natural Capital",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Science and evidence"
    ],
    "pub_date": "2025-02-05T09:19:57+00:00",
    "content": [
        {
            "text": "By Alison Giacomelli, Senior Specialist – Ornithology, Natural England"
        },
        {
            "text": "Heathlands are home to the eerie sound of churring Nightjars, sweet melody of singing Woodlarks and the rattling song of Dartford Warblers. This year teams of volunteers and fieldworkers will be out enjoying these sounds whilst taking part in a national survey of these three species."
        },
        {
            "text": "This is long overdue as it has been around 20 years since the last national surveys for breeding Woodlark, Dartford Warbler and Nightjar. Therefore, Natural England is partnering with the British Trust for Ornithology (BTO) and the Royal Society for the Protection of Birds (RSPB), who are leading on the work to update our understanding of their range and populations."
        },
        {
            "text": "Population trends "
        },
        {
            "text": "Historic declines in the Nightjar population were driven by losses of heathland habitat due to agriculture, construction, and afforestation. But national surveys in 1992 and 2004 showed a partial recovery due to the creation of clear-fell areas within forestry and due to the restoration of heathland habitats. "
        },
        {
            "text": "This survey will show us whether the recovery has continued over the last 20 years, and whether the range has continued to expand northwards, or whether it has been limited by habitat availability as newly restocked forests grow, or by human disturbance.  "
        },
        {
            "text": "The last national survey of Dartford Warblers also showed a population in recovery.  Two successive severe winters in the early 1960s caused their population to drop to just 11 pairs. By the 2006 national survey, they had increased substantially to an estimated 3,214 pairs but were knocked back again by the severe winters of 2008-10 and by the ‘Beast from the East’ in 2018. It will be interesting to see whether the population has recovered back to 2006 levels yet. "
        },
        {
            "text": "Woodlarks show a similar pattern to Nightjars in that they have expanded their range to exploit new bare ground habitat in forestry areas and heathland restoration. And like Dartford Warblers they benefit from mild winters but can suffer in severe weather.  "
        },
        {
            "text": "How you can get involved"
        },
        {
            "text": "If you own or manage an area that supports heathland birds and would like to discuss the survey, please contact me: alison.giacomelli@naturalengland.org.uk"
        },
        {
            "text": "If you would like to get involved with the survey and experience the evocative heathland soundscape, please visit the BTO website for more information and to sign up to survey a 1km square. Please also share with your friends, colleagues, and networks – the more people out surveying the better!"
        }
    ]
}