{
    "url": "https://hmlandregistry.blog.gov.uk/2023/01/05/avoiding-the-simple-errors-that-cause-delays/",
    "title": "Avoiding the simple errors that cause delays",
    "authors": [
        "Mike Harlow, Deputy Chief Executive and Director of Customer and Strategy"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-01-05T13:47:11+00:00",
    "content": [
        {
            "text": "Improving the speed of our services is our top priority. We continue to make every effort to achieve this, including building our capacity through recruitment, developing digital application processes to make land registration quicker and easier, and making strides to increase our underlying productivity. We are seeing the results of this: HM Land Registry’s output has increased for the past two years and at the end of 2022 our productivity was higher than any time in the previous three years."
        },
        {
            "text": "But one of the main obstacles we face in delivering quicker processing times – and a cause of considerable time cost for customers – is the avoidable errors in applications we receive to register property transactions."
        },
        {
            "heading": 2,
            "text": "What’s the issue?"
        },
        {
            "text": "We frequently need to go back to applicants to seek to correct an easily avoidable mistake or ask for missing information (known as raising a request for information or ‘requisition’). In general, requisitions stop just over 1 in 5 applications being processed first time. Including complex issues, we send around 1 million requisitions a year and, in 2022, over half of these (579,000) involved one or more issues that could have been avoided – more than 845,000 points between them."
        },
        {
            "text": "We spend a lot of time checking for – and clarifying – basic administrative errors, from names spelled differently between the documents and the register, to undated deeds, missing pages, incomplete addresses or handwritten dates and so on that are impossible to read. We know how frustrating this can be for applicants."
        },
        {
            "heading": 2,
            "text": "What’s the impact of this? "
        },
        {
            "text": "When our caseworker spots an error or omission in the application, they must contact the applicant who submitted the application to correct it or seek the missing information. This delays the application for an average of two weeks in the simplest cases and more than six weeks for complex applications. Sometimes it can be significantly longer, particularly if we need to go back and forth a few times over several months until we have received all the information we need from the applicant to complete the application."
        },
        {
            "text": "We must follow this process until all the details are correct as it is vital we keep an entirely accurate and secure record of property ownership."
        },
        {
            "text": "This to-ing and fro-ing between HM Land Registry and the applicant not only has an impact on how quickly the customer can have their application completed, but also takes its toll on our processing times for all applications. Basic errors or omissions in applications like these create a bottleneck in the system and a drain on time and resources."
        },
        {
            "text": "Sometimes we do get things wrong. We know we can send unnecessary or incorrect requisitions, but this really is a minority of cases. A recent audit of our accuracy, which has been quality checked and assured, found that 97% of the time we raise requisitions correctly."
        },
        {
            "text": "We know from our published data on requisitions that some firms do a much better job in submitting clean and complete applications. Firms doing very similar work can have vastly different requisition rates. That must make post-completion work easier for those who ensure the application is high quality. Their investment also pays dividends in the speed and efficiency of land registration generally. I would like to thank them for their efforts."
        },
        {
            "heading": 2,
            "text": "What is HM Land Registry doing to help conveyancers? "
        },
        {
            "text": "We are taking steps to tighten up our procedures even further and reduce unnecessary requisitions through increased, improved in-house training and workshops."
        },
        {
            "text": "As well as this, we are working on a range of improvements to our application processes that will reduce the number of requisitions we need to send. Applications made in the proprietary application platforms used by many firms and those sent direct through our Digital Registration Service will increasingly validate data before the application is submitted."
        },
        {
            "text": "We are also looking at faster ways to clarify errors and omissions, such as quick telephone calls to the applicant."
        },
        {
            "heading": 2,
            "text": "What can conveyancers do to help?"
        },
        {
            "text": "We are asking everyone who submits applications to work with us and please make sure that applications are free of avoidable errors when they are lodged. This simple quality control makes life easier and faster for all of us. It averts potential headaches such as cancellation of the application and the risk of errors in the register."
        },
        {
            "text": "We are already seeing that many conveyancing firms have taken steps to reduce errors in their applications and we are looking at how we can recognise and thank these firms for their efforts."
        },
        {
            "heading": 2,
            "text": "Want to check on your application?"
        },
        {
            "text": "The vast majority of applicants use a conveyancer. Ask your conveyancer to check on the status of your application."
        },
        {
            "text": "If your application is urgent, consider using our free fast-track service for urgent applications."
        }
    ]
}