{
    "url": "https://ukhsa.blog.gov.uk/2023/01/05/back-to-school-5-things-to-do-to-help-manage-winter-illness/",
    "title": "Back to school - 5 things to do to help manage winter illness",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-01-05T11:21:00+01:00",
    "content": [
        {
            "text": "As students start to return to school, it’s important to be aware of the winter illnesses currently circulating and the best ways to protect your child and others. In this blog, we set out some of the  simple actions that parents of school age children can take to help protect their families and those around them."
        },
        {
            "heading": 2,
            "text": "What’s the current situation?"
        },
        {
            "text": "We are seeing high levels of flu and COVID-19, which is likely to continue in coming weeks. We are also still seeing high numbers of scarlet fever, which is caused by the bacteria Group A streptococcus. You can read more information about strep A here.  Read more about the symptoms of scarlet fever here."
        },
        {
            "text": "There are things we can all do to help stop the spread of infections; teaching young people to do these things will help them to stay well and protect others."
        },
        {
            "heading": 2,
            "text": "1 - Staying home when unwell"
        },
        {
            "text": "Knowing when your child should stay at home from school or nursery if they are poorly can help slow the spread of many winter illnesses."
        },
        {
            "text": "Adults should try to stay home when unwell too."
        },
        {
            "text": "Children with a runny nose, sore throat, or slight cough who are otherwise well and do not have a high temperature can continue to attend their education or childcare setting."
        },
        {
            "heading": 2,
            "text": "2 - Hand hygiene"
        },
        {
            "text": "Hand-washing is one the most effective ways to stop germs from spreading."
        },
        {
            "text": "Regularly washing hands in soap and warm water for 20 seconds or using hand sanitiser when out and about can help you and your child to stay well and not pass on germs."
        },
        {
            "heading": 2,
            "text": "3 - Catching coughs and sneezes"
        },
        {
            "text": "Using a tissue to catch coughs and sneezes and then binning it before washing your hands with soap and water or hand sanitiser can help to stop infection from spreading."
        },
        {
            "text": "Teaching children this habit and providing them with tissues will help them to not pass on germs when they are unwell. Our e-bug resources for Early Years can help you to explain to your child what good hygiene habits are, how they can practice them and why they are important."
        },
        {
            "heading": 2,
            "text": "4 – Get vaccinated"
        },
        {
            "text": "Flu vaccination is still available for all eligible age groups and is the best protection against the virus."
        },
        {
            "text": "We have seen good uptake in older age groups but vaccination among young children remains low. Flu can be very unpleasant and in some cases can lead to more serious illness."
        },
        {
            "text": "Getting your child vaccinated protects them and others they come into contact with. Children are offered the quick and painless nasal spray vaccine."
        },
        {
            "text": "Children eligible include:"
        },
        {
            "text": "You can find more information on getting your child vaccinated against flu, here."
        },
        {
            "text": "For adults, both flu and COVID-19 vaccinations remain available. You can read about who is eligible on the NHS UK website."
        },
        {
            "heading": 2,
            "text": "5 – Use NHS resources for more information about winter illnesses"
        },
        {
            "text": "Most winter illnesses can be managed at home and NHS UK has lots of information available to parents:"
        },
        {
            "heading": 2,
            "text": "Education resources on stopping the spread of germs"
        },
        {
            "text": "For teachers and those who work in education settings, our e-Bug resource has lots of free resources on educating children about stopping the spread of infection. This includes lesson plans on topics like hand hygiene and how coughs and sneezes spread illness."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}