{
    "url": "https://ruralpayments.blog.gov.uk/2023/01/05/capital-grants-2023/",
    "title": "Capital Grants 2023",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2023-01-05T11:20:14+00:00",
    "content": [
        {
            "text": "We know how important Countryside Stewardship (CS) Capital Grants are to farmers in further protecting our landscape. That’s why for 2023 we’ve introduced further improvements building on the rolling application window we introduced last year which we hope will provide additional flexibility to farmers and land managers."
        },
        {
            "text": "You can read the full updated guidance which has been published on GOV.UK but the main changes are set out below."
        },
        {
            "text": "Farmers have told us that they feel that they need more time to complete the capital works. To support this, the duration of agreements has increased for those that start on or after 5 January 2023. Agreement Holders will now have 3 years to complete the capital works in their agreement, so there is less pressure to complete actions straight away."
        },
        {
            "text": "Existing agreement holders with a Site of Special Scientific Interest (SSSI) told us how important it was to be able to carry out capital works around an SSSI. Based on this feedback we have made it so that land in a SSSI is now eligible for capital items if the land is already covered by an existing Countryside Stewardship or Environmental Stewardship (ES) agreement."
        },
        {
            "text": "In the event a claim is received late, we are also now applying more proportionate reductions. So, instead of a 100% reduction for being one day late, the reduction will be scaled according to how late the claim is, making the process fairer."
        },
        {
            "text": " "
        },
        {
            "text": "New Higher Tier Capital Grants"
        },
        {
            "text": "We’ve opened Countryside Stewardship Higher Tier Capital Grants which offers a selection of specialist Higher Tier capital items."
        },
        {
            "text": "Agricultural Transition Director Rozanne Kidd said;"
        },
        {
            "text": "“The outcomes achieved through capital grants are a really important part of the Countryside Stewardship offer, so it’s great to be able to offer the new Higher Tier Capital Grants to help support our most environmentally significant sites and woodlands.”"
        },
        {
            "text": " "
        },
        {
            "text": "Further enhancements"
        },
        {
            "text": "To encourage public access, eligibility for several items has been expanded to encourage their use within a woodland setting. These changes give the opportunity to improve accessibility to woodlands and enhance educational visits and provide training and accreditation to support learning visits to woodland."
        },
        {
            "text": "Changes have also been included to support the management of mature trees and flood management."
        },
        {
            "text": "Capital items which require support from Catchment Sensitive Farming are now available in High, Medium and Low Priority Areas for Water and Air Quality."
        },
        {
            "text": "We’ve increased the maximum amount allowable for a single application to £80,000, with a limit of £20,000 for each of these groups:"
        },
        {
            "text": "This is the latest set of improvements we have made to Countryside Stewardship in recent years, and we want to continue to encourage farmers to consider CS as a means to deliver great environmental outcomes."
        },
        {
            "text": "You can apply for Capital Grants and Higher Tier Capital Grants all year round."
        },
        {
            "text": "The majority of CS capital payments - one-off grants for things like hedgerow creation – have increased from 5 January, with rates up by an average of 48%. You can read the Capital Payment rates on GOV.UK."
        },
        {
            "text": "Capital and annual maintenance payments for the England Woodland Creation Offer (EWCO) and Tree Health Pilot (THP) will also be updated this year, helping to incentivise farmers to incorporate more trees as a valuable natural resource on farms."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}