{
    "url": "https://dragonsden.blog.gov.uk/2023/01/05/dragons-den-episode-1-series-20/",
    "title": "Dragons' Den Episode 1 Series 20",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-01-05T21:05:43+00:00",
    "content": [
        {
            "text": " New year brings high hopes, exciting beginnings, and a gripping new series of Dragons Den. Welcome back to all our readers as we kick off series 20 with our five favourite investors."
        },
        {
            "text": "I can’t quite believe Dragons’ Den has reached series 20 already- I was in primary school back when it started. But the last few series have been most memorable for me as we’ve continued to uncover the intellectual property in each episode."
        },
        {
            "heading": 3,
            "text": "Breaking the ‘Tabuu’"
        },
        {
            "text": "Kicking things off was entrepreneur Lucy Rout, showcasing her durable and sleek pill case. Lucy found a gap in the market for a stylish pill case when she started taking regular medication. This inspired her new product and the name of her brand ‘Tabuu’ as she hopes to help remove the taboo around taking medication in public."
        },
        {
            "text": "One of the reasons Lucy was looking for investment was that she was worried that someone could copy her idea. This got me thinking how can Lucy protect her product from any copiers?"
        },
        {
            "text": "As she mentioned in the episode, she may be able to patent her product, but only if it does something new and inventive."
        },
        {
            "heading": 3,
            "text": "The fantastic four"
        },
        {
            "text": "Back to the show and Lucy was looking for an offer to boost her business. Not only this, but she’d been given a rare offer of a job from Peter Jones!"
        },
        {
            "text": "Peter joined forces with Touker and Lucy brought Sara in too for a three-way deal. With a combined offer for £50,000 for 40% of the company, Lucy accepted- leaving the den as a fantastic four in business."
        },
        {
            "heading": 3,
            "text": "Trying to bag a deal"
        },
        {
            "text": "Another enthusiastic entrepreneur trying their luck was Paola Farino. Paola was looking for £75,000 for 15% of her business the Farino Carrier- a lightweight, top-loading travel bag."
        },
        {
            "text": "As someone who has depended on the same weekend bag for countless years, my ears were open at the idea of a lightweight and easy to transport suitcase. The stylish design and ease of carrying the Farino bag around seemed like a great alternative to heavy rucksacks."
        },
        {
            "text": "Peter Jones was first to begin questioning Paola. The pair locked horns as Peter was certain he’d seen this design before- his grandmother’s shopping trolley sparking some memories!"
        },
        {
            "text": "Paola stood firm that this type of product didn’t already exist on the market, but sadly this wasn’t enough to convince Peter. Despite a confident pitch, and a product that caught my eye, there was no deal for Paola today."
        },
        {
            "heading": 3,
            "text": "Zen in the Den"
        },
        {
            "text": "With one more pitch to go, I was excited to see who see who else would dare to tread into the Den. Manifesting positivity, dynamic duo Jayne Wallace and Grace Frost entered with their wellness business and collection of crystals, candles, and incense"
        },
        {
            "text": "Bringing me back to the summer at Glastonbury, I was on board with anything that would create some zen during a frosty winter and couldn’t wait to hear from Jane and Grace."
        },
        {
            "text": "With a £1.2 million turnover and stockists including ASOS, Boohoo, and Holland & Barrett, there was plenty to get the Dragons interested. Social media pro Steven Bartlett starting the questioning, asking Jayne and Grace how they used digital marketing for their direct sales."
        },
        {
            "text": "Despite their small social media presence, Steven was keen to support the duo in improving their digital presence and made them an offer."
        },
        {
            "text": "At this point, my IP hat was firmly on, and I started to ask whether the pair had registered for a trade mark to protect their business name and logo. A quick search on the trade mark register shows that Jayne made sure to trade mark Psychic Sisters in 2020."
        },
        {
            "heading": 3,
            "text": "A foretold future? "
        },
        {
            "text": "Reading the positive energy of Sara and Deborah, the Psychic Sisters asked if the two Dragons would come on board for a joint deal- sharing the investment of £50K for a 5% stake in the business each."
        },
        {
            "text": "This was a deal destined to happen, and I cannot wait to see where things will go from here."
        },
        {
            "text": "Pill boxes, suitcases, wellbeing and not to be forgotten drag queens- the entrepreneurs really brought style this week."
        }
    ]
}