{
    "url": "https://educationhub.blog.gov.uk/2023/01/05/how-we-are-helping-to-inspire-primary-school-children-about-their-future-careers/",
    "title": "How we are helping to inspire primary school children about their future careers",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Careers",
        "Primary Schools"
    ],
    "pub_date": "2023-01-05T09:16:27+00:00",
    "content": [
        {
            "text": "Evidence shows that children start to form ideas about their future as they start primary school and it is crucial that we help inspire them in doing so."
        },
        {
            "text": "That’s why we have announced a new careers programme that will encourage primary school children to think about future jobs while nurturing aspirations and challenging stereotypes."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the new programme? "
        },
        {
            "text": "As part of our drive to make sure all young people get high quality advice to make informed choices on the skills needed for a successful career, we have developed a primary school careers programme."
        },
        {
            "text": "By linking lessons in an age-appropriate way to different careers, training and skills, the scheme will bring learning alive and inspire pupils about the world of work."
        },
        {
            "text": "It will also provide opportunities for pupils to meet role models from a range of industries, helping to raise aspirations and link their learning to future skills."
        },
        {
            "heading": 3,
            "text": "Will every school take part in this scheme? "
        },
        {
            "text": "The primary school scheme will be rolled out across 55 disadvantaged areas of the country where school outcomes are the weakest and have been for some time. The scheme delivers on a commitment in the Schools White Paper and is backed by £2.6 million."
        },
        {
            "text": "It will support more than 600,000 pupils in over 2,200 primary schools, giving them the kick start they need to boost their ambitions."
        },
        {
            "heading": 3,
            "text": "What else are you doing to help young people think about their future careers? "
        },
        {
            "text": "From 1 January 2023, young people will also benefit from strengthened careers advice through a change in the law that will see all year 8-13 pupils have at least six opportunities to meet a range of providers of technical education."
        },
        {
            "text": "By hearing directly from training providers, pupils will get to understand the full range of opportunities available to them, including apprenticeships, T Levels and Higher Technical Qualifications, not just a traditional academic route."
        },
        {
            "text": "This builds on the requirement that every secondary school should offer their pupils at least one experience of a workplace by age 16 and a further work experience by age 18, giving them the opportunity to get a sense of the skills that are valued in the workplace to forge a great career."
        },
        {
            "text": "This also builds on the new legal requirement introduced in September which means schools must provide independent careers guidance to all secondary aged pupils in all state funded secondary schools so they have access to opportunities that will help them to thrive not only in school, but into adulthood."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}