{
    "url": "https://ruralpayments.blog.gov.uk/2023/01/05/improving-countryside-stewardship-content-on-gov-uk/",
    "title": "Improving Countryside Stewardship content on GOV.UK",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2023-01-05T14:40:24+00:00",
    "content": [
        {
            "text": "The beginning of a new year is always an important time for the Countryside Stewardship (CS) scheme, and this is reflected in the number of farmers visiting the scheme pages on GOV.UK. At RPA, we know farmers don’t have the time to spend hours wading through information, and we’re also aware there have sometimes been challenges in accessing the relevant scheme content."
        },
        {
            "text": "We have a duty to provide clear guidance and ensure you have a positive experience, and it’s important that guidance on GOV.UK tells you what you need to know, what you need to do and how to do it. Using your feedback about the key issues, we’ve made some changes to the CS pages to make content easier to find and understand, and to support you through the CS process. We’ve considered how the CS content and format on GOV.UK can be more user-friendly and accessible, and you’ll notice these improvements the next time you visit the CS pages on GOV.UK."
        },
        {
            "text": "What you’ve told us"
        },
        {
            "text": "Your insight is integral to our work and helps to ensure we’re improving the right things. You told us that manuals are difficult to navigate and having multiple manuals for each CS scheme made it harder to find the information relevant to you. It was difficult to know if you’d read everything and there was often duplication. You also told us that the format wasn’t always user-friendly, the language was sometimes complex and there was too much information to consume."
        },
        {
            "text": "Improvements you will see to CS pages on GOV.UK as the schemes open"
        },
        {
            "text": "We’re now creating accessible HTML (web page) documents instead of using the manuals format, and we’ve removed the need for duplicate PDFs."
        },
        {
            "text": "For each CS scheme there will be one HTML guide for applicants and one HTML guide for agreement holders. This means there’s one page link (URL) per scheme, which will make it easier to find the information and quicker to complete your task."
        },
        {
            "text": "We will publish in HTML wherever possible as it’s the most accessible format on both desktop and mobile devices. We’ve also removed repetition and simplified the writing style. A big focus has been on using plain English and breaking up the text, making it easier to understand, scan and digest."
        },
        {
            "text": "We’ve also collated generic information into a general CS guide, including short definitions of the schemes, how CS fits in with Agricultural Transition, registering on the Rural Payments service, authorising an agent, site visits, keeping records, reductions to payments, preventing fraud and how we handle your data and complaints."
        },
        {
            "text": "We will continue to welcome your feedback and work with you to improve the information available on GOV.UK. We’d love to hear from farmers who’d be interested in taking part in research to help us improve the information for them on GOV.UK. Contact RPAInsight@rpa.gov.uk. If you’d like to take part in regular research, you can sign up to our Research & Insight Network Group (RING)."
        }
    ]
}