{
    "url": "https://defrafarming.blog.gov.uk/2023/01/05/introducing-sfi-management-payments-and-changes-to-countryside-stewardship-rates/",
    "title": "Introducing SFI Management Payments and changes to Countryside Stewardship rates",
    "authors": [
        "Jonathan Baker"
    ],
    "categories": [
        "Countryside Stewardship",
        "Sustainable Farming Incentive",
        "Things we've learned"
    ],
    "pub_date": "2023-01-05T11:44:20+00:00",
    "content": [
        {
            "text": "In this, the first blog post of the year, I’d like to share 2 updates with you and explain the rationale behind them. "
        },
        {
            "text": "The first update is a change to Countryside Stewardship payment rates."
        },
        {
            "text": "The second is the introduction of the Sustainable Farming Incentive Management Payment. "
        },
        {
            "text": "Both of these updates follow feedback from farmers. Prices across agricultural markets have increased. We want the payment rates to better reflect that and ensure we are covering scheme running costs."
        },
        {
            "text": "So, along with the improvements we're making to the administration of our schemes and the fairer application of rules, we're working to make sure that being in an environmental land management scheme is viable and attracts all farm businesses. "
        },
        {
            "text": "This will, in turn, help us to achieve our environmental commitments. "
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship payment rates"
        },
        {
            "text": "At the Oxford Farming Conference, Minister for Food, Farming and Fisheries, Mark Spencer announced that the payment rates for both Countryside Stewardship revenue options and capital items will change. "
        },
        {
            "text": "The new revenue rates will be introduced for all new and existing Mid Tier and Higher Tier Countryside Stewardship agreements from 1 January 2023."
        },
        {
            "text": "On average, there will be a 10% increase in revenue rates. However, this will differ between agreements and not all revenue rates will increase if the evidence suggests current rates reflect market conditions. "
        },
        {
            "text": "This change will benefit the 30,000 Countryside Stewardship agreement holders across England."
        },
        {
            "text": "We’ll continue to review payment rates across our environmental land management offers. Later this year, we’ll publish how we will routinely review payment rates from 2024 onwards."
        },
        {
            "text": "We have not applied this increase to farmers with legacy Environmental Stewardship agreements as, on average, payment in that scheme is higher than those in Countryside Stewardship. "
        },
        {
            "text": "We also made changes so that Environmental Stewardship agreement holders can move into Countryside Stewardship smoothly, when they have a successful application. We blogged about this in summer."
        },
        {
            "text": "Capital payments for items including one-off projects such as hedgerow creation or concrete yard renewal to reduce diffuse water pollution have been updated. On average, capital rates will increase by 48% with a small proportion staying the same or decreasing."
        },
        {
            "text": "Capital payment rate changes will apply to new Countryside Stewardship agreements only and not to existing agreements. Updated revenue rates will be introduced for all new and existing Mid Tier and Higher Tier CS agreements."
        },
        {
            "text": "You can apply for Capital Grants and Higher Tier Capital Grants."
        },
        {
            "text": "Colleagues at the Rural Payments Agency have written more about the 2023 Capital Grants over on their blog."
        },
        {
            "text": "Capital and annual maintenance payments for the England Woodland Creation Offer (EWCO) and the Tree Health Pilot will also increase this year. This will help to incentivise farmers to incorporate more of these valuable natural resources on farms."
        },
        {
            "heading": 2,
            "text": "Sustainable Farming Incentive Management Payment "
        },
        {
            "text": "We are also introducing a new Sustainable Farming Incentive (SFI) Management Payment of £20 per hectare, for up to 50 hectares of land entered in the scheme. This means farmers will receive up to £1,000 per year in addition to their agreement to cover the administrative costs of participation."
        },
        {
            "text": "For a 50-hectare farm this represents a potential increase of as much as 50%. This reflects evidence from farmers already in the scheme that the current payments don’t fully account for the costs of entering and implementing an agreement. "
        },
        {
            "text": "Making the SFI offer financially attractive will increase uptake to the level we need to achieve our outcomes. It will benefit small farms in particular. They are currently half as likely as the average farm to be in an environmental land management scheme. We need that to change, if we are to achieve our challenging environmental targets."
        },
        {
            "text": "We don’t want to disadvantage early adopters, so we will apply this payment to those already in the Sustainable Farming Incentive and it will be applied from this point on."
        },
        {
            "text": "The Sustainable Farming Incentive Management Payment will be available for all SFI agreements that include substantive actions, such as changing land management activities. "
        },
        {
            "text": "Planning or preparation activities such as the moorland standard are not eligible. We will provide further information about when and how the Sustainable Farming Incentive Management Payment will be applied in due course. "
        },
        {
            "text": "We do not propose to apply the increase to those in the pilot programme as they receive a payment of £5,000 a year for participating in learning activities. We are reviewing this payment before the third year of the pilot programme starts later this year. "
        },
        {
            "text": "Over the next 2 years, we will keep the Sustainable Farming Incentive Management Payment under review, along with all other elements of scheme design and delivery. We'll do this to make sure the offer works for users, provides value for money and helps us to achieve our outcomes."
        },
        {
            "heading": 2,
            "text": "Coming up "
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship "
        },
        {
            "text": "Later this year, we will open the next round of Countryside Stewardship Mid Tier, Higher Tier and Wildlife Offers for farmers and land managers wanting to start their agreements in January 2024. "
        },
        {
            "text": "We will continue to take what we learn from the Sustainable Farming Incentive to improve and simplify the application process. "
        },
        {
            "heading": 3,
            "text": "Sustainable Farming Incentive "
        },
        {
            "text": "This year, we will increase the number of SFI standards so that more farmers can benefit. We will publish further details of this expanded offer for 2023 in the coming weeks. "
        },
        {
            "text": "We'll share more details about the actions we will pay for across our schemes up to the end of 2024, so you can plan accordingly. Don’t forget, you can also get free business advice from independent advisers."
        },
        {
            "text": "At the end of last year, we blogged about our progress with the Animal Health and Welfare Pathway. We will expand our funded vet visits and adding animal welfare grants to our package of support in the spring. "
        },
        {
            "heading": 3,
            "text": "Landscape Recovery "
        },
        {
            "text": "The second round of applications for Landscape Recovery will open this year. We're looking forward to featuring more first round projects here on the blog."
        },
        {
            "heading": 3,
            "text": "Innovation and productivity"
        },
        {
            "text": "We will also continue to support farmers by rolling out our one-off payments to support innovation and productivity – starting with the Slurry Infrastructure grant which is available now. The water management grant will follow. "
        },
        {
            "text": "Subscribe to the Future Farming blog for the latest from across the Future Farming and Countryside Programme."
        }
    ]
}