{
    "url": "https://mojdigital.blog.gov.uk/2023/01/05/measuring-our-justice-digital-story/",
    "title": "Measuring our Justice Digital Story",
    "authors": [
        "Maxine Paintain"
    ],
    "categories": [
        "Justice Digital Strategy",
        "Our services",
        "strategy"
    ],
    "pub_date": "2023-01-05T11:49:33+01:00",
    "content": [
        {
            "text": "The Justice Digital 2025 Strategy was published earlier this year to provide a common direction of how we transform our services and deliver great outcomes for our users."
        },
        {
            "text": "This is our vision, providing simpler, faster and better services for all our users, whenever they need them."
        },
        {
            "text": "Telling the story of how we’re delivering against our strategy is really important, we are now 8 months since it was first released and need to develop consistent metrics around how we are making progress."
        },
        {
            "text": "There is great work happening in teams and functions to develop a narrative around our progress so far, but we recognise there is a need to develop more holistic evidence to tell our complete story."
        },
        {
            "text": "Metrics is a part of a much wider conversation and we need to be mindful we are solving a whole problem."
        },
        {
            "text": "Goals and metrics are a “prescription strength medication that requires careful doing… and close supervision”.\nSource: Harvard Business Review - “Goals Gone Wild” paper. 2009."
        },
        {
            "text": "Being considerate not to overwhelm busy delivery teams with disparate and continuous asks for measurement, we have started a Metrics Expert Group (MEG) to co-create a focussed set of core metrics that help us to tell our story. Made up of a diverse group of professions that offer perspectives and their expert experience to continually test measurements, to advise upon and expand them, as our story evolves."
        },
        {
            "text": "Using the key pillars of our strategy as the basis: Simpler, Faster, Better, and combining them with our strategic themes of Driven by data, Flexible organisation, and Led by users - this was the catalyst to ignite the first discussion within the MEG."
        },
        {
            "text": "We have come together as a collective to define the purpose and North Star of the group, as well as ways of working. We are proposing we use Objective Key Results (OKRs) as our framework. We then want to empower teams & business areas to suggest their own ‘Key Results’ which hang off the objectives."
        },
        {
            "text": "Having ensured that our approach supports the amplification of key areas of the focus for our leadership team, we have agreed on a number of prioritised areas to initially drive forward."
        },
        {
            "text": "We’re looking forward to sharing more in the New Year on how we’ll be engaging teams, as well as kicking off a small pilot. We are exploring how we evolve the metric group too. It's really important that the MEG is representative of the diversity of thought and expertise that is core to telling our Justice Digital story."
        },
        {
            "text": "If you’d like to find out more in the meantime, please contact either Chris Nichols, Giulio Folino, Maxine Paintain, Nicole Gomes, or Zoe Walker."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}