{
    "url": "https://insidedio.blog.gov.uk/2023/01/05/putting-batus-to-bed-how-we-prepare-the-british-armys-canada-estate-for-the-winter/",
    "title": "Putting BATUS to bed: how we prepare the British Army’s Canada estate for the winter",
    "authors": [
        "WO2 Terry Wood"
    ],
    "categories": [
        "BATUS",
        "British Army",
        "Canada"
    ],
    "pub_date": "2023-01-05T10:06:53+00:00",
    "content": [
        {
            "text": "An armoured battlegroup conducts a mock dawn attack at BATUS [Crown Copyright/MOD 2016]The British Army Training Unit Suffield (BATUS) in Canada is home to one of the largest training estates that the British Army operates on, and it is used to deliver some of the most complex and testing training exercises that our soldiers undertake."
        },
        {
            "text": "There are 17 training villages on the Suffield Military Training Area (MTA) with a total of 803 assets, ranging from shipping containers to fence lines and trenches, which are used to provide a realistic training environment. At the end of every training season, the Prairie Infrastructure Team (PIT) is tasked with the ‘winterisation’ of the training area. This is a challenging but vital task that involves closing down the training villages and preparing them for the extreme weather conditions that the Canadian winter can bring."
        },
        {
            "heading": 2,
            "text": "Preparing for the winter extremes  "
        },
        {
            "text": "In the coldest months of the year, January and February, temperatures in Alberta can drop as low as -30 to -40°C (-22 to -40°F). The extreme cold alone can have a destructive impact on training infrastructure, so it’s vital that repairs are carried out ahead of the winter season, as well as providing buildings and assets in the training villages with sufficient protection to prevent them from being damaged by the elements."
        },
        {
            "text": "The PIT has a short window in which it deploys to the MTA to prepare it for the re-commencement of training in the new year. All winterisation work needs to be completed by the end of September, before the extreme winter conditions set in. The work is wide-ranging and can call for extensive repairs, as you might expect following months of training exercises!"
        },
        {
            "text": "The Prairie Infrastructure Team carres out repairs and maintenance to a section of trench used for training [Crown Copyright/MOD 2022]In addition to the extreme colds, the MTA can experience powerful winds over the winter months. There have been occasions in the past where doors on shipping containers used for training have been left open and as the wind passes through, it has flipped the containers onto their sides, as well as destroying some smaller buildings. Preventing potentially dangerous incidents such as these through careful maintenance work is a key part of our year-round mission to provide a ‘Safe Place to Train’ at BATUS."
        },
        {
            "heading": 2,
            "text": "Balancing wildlife protection with military training "
        },
        {
            "text": "To maintain our consent to train in Canada, it’s essential that all UK and Canada directives and policies are followed, including those which relate to the protection of wildlife."
        },
        {
            "text": "Due to the extremes of winter, the buildings on the MTA can attract shelter-seeking wildlife, including several Species at Risk (SAR). One of the team’s main efforts year-round, and especially prior to the winter months, is to make sure that the buildings on the MTA are as inaccessible as possible, as wildlife can enter through the smallest of gaps. It’s important to prevent any SAR from nesting in one of the buildings as unfortunately this can severely restrict training within the area, or even force exercising units to re-plan and re-locate to another area of the MTA."
        },
        {
            "text": "Soldiers from the Royal Dragoon Guards take part in a training exercise during Ex Iron Strike at BATUS in 2016 [Crown Copyright/MOD 2016]Each year, the DIO Canada team’s work to winterise the Suffield MTA helps to ensure the continued delivery of world class training at BATUS. Though much of this work happens behind-the-scenes, it’s instrumental in providing a training environment that’s both realistic and safe for training personnel, as well as maintaining the consent to train that the British Army has held in Canada since 1972."
        }
    ]
}