{
    "url": "https://openpolicy.blog.gov.uk/2023/01/05/spotlight-on-our-2022-23-design-placements/",
    "title": "Spotlight on our 2022/23 design placements",
    "authors": [
        "Dr Pina Sadar"
    ],
    "categories": [
        "News",
        "Policy Lab"
    ],
    "pub_date": "2023-01-05T13:45:50+01:00",
    "content": [
        {
            "text": "Since 2014, Policy Lab has brought in design and research placements to get first hand experience in the growing field of Policy Design. Over the years our placements have contributed significantly to the Policy Lab's dynamic and inclusive DNA. "
        },
        {
            "text": "We are hosting four inspiring designers that work within our multidisciplinary project teams tackling high-profile policy challenges. They leverage their creative and diverse skills when applying cutting edge design methods that support innovation and delivery across the public sector. This blog shines a light on the practice of these four designers."
        },
        {
            "text": "Chloe Wybrant, a recent design graduate from Kingston University, gravitates towards people-centred design and social research. “I enjoy interacting with people to understand a subject area from their firsthand experience of it, and then embedding these insights throughout a project to ensure the outcome is appropriate.” "
        },
        {
            "text": "Largely informed by her own personal experiences, Chloe has been applying design thinking to a number of social issues, ranging from women’s health to the socio-economic diversification of the creative industries. Her favourite personal project, ‘The 12%’, focused on unravelling the potential for people from working class backgrounds to pursue careers in the cultural and creative industries- a timely issue, with recent research showing a steady decline in the socio-economic diversity of the sector. Chloe addressed the challenge through a range of workshops, tailored to school leavers in her hometown of Doncaster."
        },
        {
            "text": "Whilst at Policy Lab, Chloe has been working on the project which is applying co-design approaches to explore the future of fishing regulation in England and Wales. Chloe says of her experience so far: “I have enjoyed working in an environment where the whole team is open to learning and therefore creates many opportunities to do so.” "
        },
        {
            "text": "She is hoping to continue learning from colleagues with unique backgrounds and journeys and gain more experience in applying experimental methods to real-world problems -  a skillset  which she believes will be invaluable for her quest to continue using design to “start conversations and tell stories about various issues.” "
        },
        {
            "text": "Grace Caroll is a Glasgow School of Art and Communication Design graduate whose practice spans graphic design, sculpture, installation work and interaction design. “I’m interested in landscape, specifically the political, cultural and historic relationship we have with our environment,” says Grace about the central premise of her practice."
        },
        {
            "text": "Grace works as a young art advisor at Templar Arts and Leisure Centre in Tarbert where she previously completed her traineeship. One of her favourite creative endeavours includes a collaboration with marine scientist Charlotte Findlay from The Scottish Association for Marine Science on an installation titled  ‘Sea Sound Pollution’. In this interactive and sound-based project, Grace investigated the effect of anthropogenic noise pollution in the sea and its negative effects on sea mammals."
        },
        {
            "text": "In her design placement, Grace has been working on the Land Use Change project, in which Policy Lab is helping the Department for Environment Food and Rural Affairs understand different perspectives on land use. “This project aligns with my interests concerning our relationship to landscape and the cultural, historical and political importance of nature sites,” says Grace."
        },
        {
            "text": "Throughout her placement she is hoping to gain further insights into how design can influence policy surrounding the usage of land. “I am learning how design can help facilitate a better understanding of the land and its people, and influence better policy making that dictates our future relationship with our environment and climate,” she explains."
        },
        {
            "text": "Sarah Macbeth is a designer, researcher and community activist with a background in graphic design and communications for social justice, environment and arts sectors. “I’m passionate about design justice, commoning practices, building regenerative economies and enabling systemic change”. "
        },
        {
            "text": "Sarah’s practice is place-based and participatory, and she strives to engage people in co-creating regenerative futures. Talking about her creative approaches, she says: “I use design artefacts, DIY making and organising and research to foster a commons culture.” "
        },
        {
            "text": "One of her recent projects, informed by transition design, systems and human-materials thinking, is ‘Walk in Search of the Commons’, which aimed to activate women to manage urban spaces for themselves. “I created a walking practice for women in my local area of Hastings to identify land currently under-utilised but with potential as urban growing space. They would then design space using permaculture principles,” explains Sarah. "
        },
        {
            "text": "Since joining Lab, Sarah has been enhancing her skills and experience on systems thinking and innovation as well co-design practices with a focus on regenerative futures. “Working at Policy Lab has reminded me of the joy of working within a team and learning from each other as much as learning with project stakeholders,” she concludes."
        },
        {
            "text": "Britt van den Berg is designer and design-researcher. Following her studies in Product Design in the Netherlands, she moved to the UK to pursue a Master’s in Industrial Design at Central Saint Martins, which helped her deepen the social, ecological and political implications of her practice. "
        },
        {
            "text": "“I consider myself a critical designer that, with the use of three-dimensional objects and storytelling, aims to tackle wicked problems. My interests lie in food systems, social and environmental design, digital fabrication methods and ceramics,” she describes her design practice. "
        },
        {
            "text": "Britt’s key interests came together in her recent graduation project on farming in the Netherlands, which explored different aspects of sustainability in agriculture in a close collaboration with farmers. She worked with soil as a material and used it to communicate her findings in a practical and tangible manner."
        },
        {
            "text": "Her interests in innovation and impact-driven thinking continue to be fostered and inspired through her work at Policy Lab. Britt particularly enjoys learning about and applying a range of human-centred methods. “Not only do I gain this knowledge, being involved in Policy Lab’s projects allows me to bring it into practice and experience the outcomes of it first-hand. This allows me to reflect on how design can contribute to social innovation,” she concludes."
        },
        {
            "text": "From zooming in on the relationship between humans and nature, to utilising creative practices to help design new social realities, Chloe, Grace, Sarah and Britt’s skills and experience continue to develop, challenge and refine Policy Lab’s methodologies and values. They expand our creative horizons and help us ensure that we are designing policies in a future-focused manner.  "
        },
        {
            "text": "Are you interested in joining Policy Lab as our new design placement in late spring/ summer 2023? Please send us your expression of interest by filling out this form and we will keep you updated about any upcoming opportunities."
        }
    ]
}