{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/01/05/the-si-just-got-bigger-the-recent-expansion-to-the-range-of-si-prefixes/",
    "title": "The SI just got bigger: the recent expansion to the range of SI prefixes",
    "authors": [
        "goscomms"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2023-01-05T13:47:39+00:00",
    "content": [
        {
            "text": "By Richard Brown, Head of Metrology at the National Physical Laboratory (NPL)"
        },
        {
            "text": "The International System of Units (SI) is the only system of measurement units accepted worldwide. Its study, curation and development are at the heart of National Metrology Institutes’ mission. Within the SI there are three pillars: the SI base units, the SI derived units and SI prefixes. Not only do prefixes permeate our everyday weights and measures – the kilogram, centimetre and millilitre – but they are also adopted in non-technical terms that we all use such as nanotechnology, micro-scooter and Gigafactory."
        },
        {
            "text": "The SI prefixes are a key part of what distinguishes a decimal-based measurement system from non-decimal systems. When measurements become very big or very small, the SI continues to use the same units and just adds decimal prefixes: 1 kilometre = 1,000 metres = 1,000,000 millimetres. On the other hand, non-decimal systems invent new names for units to address changes in measurement size: 1 mile = 1,760 yards = 5,280 feet = 63,360 inches."
        },
        {
            "text": "Our system of SI prefixes has expanded over the years in response to advances in science and technology requiring access to an increased range of orders of magnitude relating to measurement. The last such expansion, and the only one in my lifetime to date, was 31 years ago in October 1991. Little did I know then that I would be heavily involved in the next update to the SI prefixes. The change in 1991 increased the range to cover between 1024 (yotta, Y) and 10-24 (yocto, y), principally to meet the needs of chemistry to express molecular quantities in SI units. Those 31 years that have passed since then represent the longest gap between extensions to the range of prefixes since they were first adopted by the Metre Convention in 1879, four years after the treaty was signed. Back then only the range from 1000 to 1/1000 was covered: kilo to milli."
        },
        {
            "text": "As the global datasphere continues to grow at an increasing rate, rapidly approaching 1 yottabyte, the clamour for what comes next becomes driven by a real application in the near future and speculation becomes closer to reality. I first came across this issue in 2017 whilst listening to a BBC More or Less programme. This contained the revelation that unofficial names for ‘1027 bytes’ were gaining traction and stood a chance of being adopted de facto. These were brontobyte (from ‘brontosaurus’) and hellabyte (from ‘hell of a big number’). Not only were these names distressingly unsystematic when compared to the Metre Convention’s traditionally sober approach to naming prefixes, but they would also be confusing because ‘B’ and ‘H’ were already in use as symbols for well-known units."
        },
        {
            "text": "The SI had to act. I started the process of proposing new names and symbols for an extension to the SI prefix range and steering this through the relevant metrology committees. An analysis demonstrated that the only letters left largely unused in the English alphabet were ‘q’ and ‘r’. Most recently the names for the prefixes had been based – incredibly loosely – on the Latin and Greek numbers for the power of 1000 in question; therefore, nine and ten in this case. Throw in the requirement that prefix multiples should end in an ‘a’ and sub-multiples in an ‘o’ and my suggestions were:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "For over four years this proposal has wended its way through metrology committees. First the Consultative Committee for Units Working Group on Strategy, then the Consultative Committee for Units, and finally the International Committee for Weights and Measures. It was ultimately approved as Resolution 3 of the 27th General Conference on Weights and Measures (CGPM), which took place in Versailles from 15 to 18 November 2022."
        },
        {
            "text": "As a result, the SI has grown by four new SI prefixes, covering an increased range between:"
        },
        {
            "text": "1 000 000 000 000 000 000 000 000 000 000       and       0.000 000 000 000 000 000 000 000 000 001"
        },
        {
            "text": "Expect to hear of ‘ronnabytes’ and ‘quettabytes’ sometime in the future!"
        },
        {
            "text": "Find out more about the NLP here."
        }
    ]
}