{
    "url": "https://naturalengland.blog.gov.uk/2026/01/22/balancing-nature-and-development-the-humber-estuary-protected-site-strategy-pilot/",
    "title": "Balancing Nature and Development: The Humber Estuary Protected Site Strategy Pilot ",
    "authors": [
        "Katherine Carson"
    ],
    "categories": [
        "Development",
        "Evidence",
        "Growth",
        "Landscapes",
        "Natural England",
        "Nature",
        "Protected sites and species",
        "Special Protection Area",
        "Wildlife"
    ],
    "pub_date": "2026-01-22T16:35:12+00:00",
    "content": [
        {
            "text": "By Katherine Carson, Senior Officer, Sustainable Development, Yorkshire and Northern Lincolnshire Area Team"
        },
        {
            "text": "When you think of the Humber Estuary, you might picture big stretches of mudflats full of wading birds like curlew and lapwing. Or maybe you think of the busy docks and industrial sites that make this region a hub for business. Both are true. Here, wildlife and industry share the same busy landscape, and that’s what makes the Humber such an interesting, and sometimes tricky, place to work. "
        },
        {
            "text": "The estuary is internationally important for birds, supporting species like golden plover, curlew, and lapwing. But these birds don’t just stick to the protected area. They also rely on surrounding farmland and grassland for feeding and roosting. These areas, called Functionally Linked Land (FLL), are essential for their survival. As the Humber grows as a centre for offshore wind, hydrogen production, and carbon capture, these habitats are under more pressure than ever. "
        },
        {
            "text": "So how do we make sure nature and development can thrive side by side? "
        },
        {
            "heading": 4,
            "text": "What is the Humber PSS Pilot? "
        },
        {
            "text": "The Humber PSS Pilot is a team effort led by Natural England, working with local authorities, universities, conservation groups, developers, and other partners. Our goal is simple: build a stronger evidence base and find a smarter, more strategic way to manage FLL around the Humber. "
        },
        {
            "text": "Right now, planning decisions involving FLL can be slow, costly, and uncertain. A lot of time and money goes into figuring out how important a site is for birds and what needs to be done if habitat is lost. This process isn’t great for anyone, and it doesn’t always give the best results for nature. That money could be better spent creating bigger, better-connected habitats rather than lots of small, isolated ones."
        },
        {
            "text": "The Humber Pilot is looking for a better way: a clear, consistent framework that gives confidence to planners, developers, and conservationists alike. "
        },
        {
            "heading": 4,
            "text": "Our Long-Term Vision"
        },
        {
            "text": "We’re working towards a future where:"
        },
        {
            "text": "This is about finding solutions that work better for everyone, and approaches that give developers more certainty and efficiency, while delivering better outcomes for nature."
        },
        {
            "heading": 4,
            "text": "Why This Matters"
        },
        {
            "text": "The Humber is one of the UK’s most important estuaries for wildlife, supporting around 135,000 waterbirds each year. While the estuary itself is protected, many of these birds rely on surrounding farmland and grassland for feeding and roosting, especially at high tide when mudflats are underwater. Much of this land is productive arable farmland, so any approach needs to consider how wildlife and food production can work side by side."
        },
        {
            "text": "These areas of Functionally Linked Land (FLL) provide safe places for birds to rest and forage when intertidal zones are submerged or disturbed."
        },
        {
            "text": "If birds lose access to these sites, they have to fly further to find food and shelter, using more energy and reducing their chances of survival. This can affect their ability to get through the winter, migrate successfully, or breed in future seasons. Loss of FLL has already been linked to population declines on the Humber, so finding ways to protect and restore these areas is essential."
        },
        {
            "text": "At the same time, the Humber is critical to the UK’s transition to a low-carbon economy, with major investment in offshore wind, hydrogen, and carbon capture. Without a strategic approach, these priorities can clash. With the right plan, we can make better decisions and avoid unnecessary conflict, protecting wildlife while supporting sustainable growth."
        },
        {
            "heading": 4,
            "text": "Building the Evidence Base"
        },
        {
            "text": "To make this happen, the pilot is developing some practical tools:"
        },
        {
            "text": "This is research and development work, and it hasn’t been done on this scale before. There’s a lot of learning ahead, and much of the thinking is still at an early stage. At this point, feasibility and practical details haven’t been pinned down. What proves to be workable will emerge over time through conversations with stakeholders and partners. However, we are excited to see what we will be able to achieve."
        },
        {
            "heading": 4,
            "text": "Working Together"
        },
        {
            "text": "The Humber Estuary might be a protected site, but it doesn’t stand alone. It’s part of a much bigger, connected landscape where everything interacts. What happens in the wider area, whether farming, development, or industry, affects the estuary, and the estuary influences those activities too. They’re all part of the same system, which means we need to work together and plan as one if we want nature and development to thrive."
        },
        {
            "text": "We’ve already spoken to more than 70 stakeholders, from local planning authorities to industry representatives and conservation organisations. Together, we’re building the evidence base and testing ideas. Natural England is dedicated to building relationships, aligning shared objectives, elevating collective ambition, and finding positive solutions that ensure that growth and nature can and will go together hand in hand."
        }
    ]
}