{
    "url": "https://companieshouse.blog.gov.uk/2026/01/22/becoming-the-trusted-guardian-of-corporate-transparency/",
    "title": "Becoming the trusted guardian of corporate transparency",
    "authors": [
        "Andy King - Chief Executive and Registrar of Companies for England and Wales"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2026-01-22T14:38:39+00:00",
    "content": [
        {
            "text": "Since joining Companies House in September, I’ve been impressed by colleagues' commitment to our mission to become the trusted guardian of corporate transparency."
        },
        {
            "text": "2025 saw major progress in delivering on that mission and setting out our strategy for the next 5 years."
        },
        {
            "heading": 2,
            "text": "Launching identity verification"
        },
        {
            "text": "We took a huge step forward in November 2025 with the start of the 12-month transition period for all company directors and people with significant control (PSCs) to verify their identities. This can be done through GOV.UK One Login, or through an Authorised Corporate Service Provider (ACSP).  "
        },
        {
            "text": "The introduction of identity verification will make it harder to use the register to create anonymous corporate structures that enable fraud, corruption or other criminal activity."
        },
        {
            "text": "Businesses use our data to carry out due diligence, access finance and add value to their products and services. So, making that data more accurate, up-to-date and reliable will support the government’s broader mission for economic growth."
        },
        {
            "heading": 2,
            "text": "Doing more for customers"
        },
        {
            "text": "We know the changes we’re going through as an organisation mean changes for all our customers. We will continue to put the people who use our services at the heart of what we do. And we will continue to invest significant resources in optimising processes and services for users and in supporting companies to meet their responsibilities.  "
        },
        {
            "text": "I'm proud of our commitment to customers which has included:"
        },
        {
            "heading": 2,
            "text": "Helping to disrupt economic crime"
        },
        {
            "text": "2025 also saw significant progress in our efforts to tackle misuse of the register. We embedded the use of new powers introduced under the Economic Crime and Corporate Transparency Act the previous year."
        },
        {
            "text": "This enabled us to act against more than 100,000 companies and reject thousands of suspicious filings. Since we got the power to do so in March 2024, Companies House has changed more than 140,000 company addresses to a default address to prevent misuse and protect the public from the harms these companies pose."
        },
        {
            "text": "We added more tools to our kit last year, including the ability to strike off companies more quickly if they've been registered on a false basis. We also deepened our cooperation and data-sharing with other agencies, such as the Insolvency Service and National Crime Agency. This included playing a significant role in the coordinated crackdown on high-street crime through our involvement in Operation Machinize 2."
        },
        {
            "heading": 2,
            "text": "What’s in store for 2026"
        },
        {
            "text": "A key focus this year is to complete identity verification for everyone required to do so, and we’re on track to achieve that. More than 2.5 million people have already been issued personal codes following a successful verification."
        },
        {
            "text": "We will also start compliance activity against those who have failed to verify their identity, taking a fair and proportionate approach to enforcing the law."
        },
        {
            "text": "We’re working on introducing identity verification of people who file documents with us later this year. This will begin no earlier than November 2026. We will give those affected plenty of notice of when this change will happen. Look out for emails from Companies House or visit our Changes to UK Company Law website."
        },
        {
            "text": "Some of our fees are changing next month. This will enable us to continue the work we’re doing to build a more trustworthy environment for consumers and legitimate businesses."
        },
        {
            "heading": 2,
            "text": "Using AI responsibly"
        },
        {
            "text": "Like other parts of government, Companies House is keen to lever the opportunities of artificial intelligence (AI) in a responsible and ethical way."
        },
        {
            "text": "We’re already using AI to help our integrity and enforcement teams identify anomalies and potential risks and we have plans to use it more widely across the organisation in future."
        },
        {
            "heading": 2,
            "text": "Delivering on our mission"
        },
        {
            "text": "I'm determined that we continue to deliver on our mission, and as a result, support the economy, give users a high-quality service, and reduce burdens on companies and citizens from those who act with criminal intent."
        }
    ]
}