{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/22/coverage-of-our-design-and-placemaking-planning-practice-guidance/",
    "title": "Coverage of our Design and Placemaking Planning Practice Guidance",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2026-01-22T17:08:56+00:00",
    "content": [
        {
            "text": "Temple Gardens, North Somerset ©Historic England"
        },
        {
            "text": "Yesterday we announced our new design guidance, giving councils and developers a clear rulebook to deliver better‑designed, safer and healthier neighbourhoods that complement local areas. This forms part of the biggest planning rewrite in a decade, designed to speed up local planning decisions and support the delivery of 1.5 million high-quality homes. "
        },
        {
            "text": "There has been prominent national coverage of the announcements, including The Times and The Sun reporting that the new guidance is designed to end “cookie‑cutter”, “identikit” neighbourhoods as well as highlighting the shift towards homes that support modern life.  Coverage in the i Paper and The Guardian focus on the nature and climate elements of the guidance’s seven principles, referencing greater emphasis on new homes supporting hedgehog highways, swift bricks and shared green spaces.  "
        },
        {
            "text": "Trade outlets also picked up the announcement including Inside Housing and Housing Today reporting about the new design guidance’s role within the government’s proposed revamp of the National Planning Policy Framework. Architects’ Journal also highlighted how the guidance is intended to shape the next generation of housing and support high‑quality placemaking.   "
        },
        {
            "text": "Over on our Instagram channel we asked what the public thought about new‑build developments. After being shown multiple images of case-studies, many responses loved the green spaces as well as the importance of identity and conscientious living. "
        },
        {
            "text": "Housing and Planning Minister Matthew Pennycook said: "
        },
        {
            "text": "\"Exemplary development should be the norm not the exception so that more communities feel the benefits of new development and welcome it.  "
        },
        {
            "text": "“As we act to boost housing supply, we are also taking steps to improve the design and quality of the homes and neighbourhoods being built.  "
        },
        {
            "text": "“These standards will help ensure new homes and neighbourhoods are attractive, well-connected, sustainable, and built to last”.   "
        },
        {
            "text": "Reaction from the industry:  "
        },
        {
            "text": "Chris Williamson, RIBA President, said: "
        },
        {
            "text": "\"Today's updates to national design guidance should have a positive impact on our future homes and neighbourhoods.  "
        },
        {
            "text": "It's encouraging to see the guidance taking a holistic approach to good design, emphasising the importance of accessible amenities and green, high-quality spaces, while acknowledging the vital role of local context and culture.  "
        },
        {
            "text": "The unique skills of architects will be crucial in bringing this guidance to life. We look forward to continuing to work alongside the Government and sector to shape places that truly meet people's needs.\"   "
        },
        {
            "text": "Dr Jeanelle de Gruchy, Deputy Chief Medical Officer for England said:  "
        },
        {
            "text": "“Well-designed neighbourhoods make it easier for people to live healthier lives.   Good‑quality homes, nearby green spaces, and safe places to walk, cycle and play all help children and adults stay active, build healthier habits, and reduce risks that contribute to ill‑health. They also enable older people to remain independent for longer.  By building these features into new developments, we can create communities that support people’s health at every age.\" "
        },
        {
            "text": "Anna Rose, Head of the Planning Advisory Service, said: "
        },
        {
            "text": "“This updated guidance provides a clear and welcome benchmark for good design. Through our work supporting councils and regional design advocates, PAS sees how strong local design leadership can raise standards and deliver more liveable neighbourhoods. This guidance will be an invaluable tool in helping local authorities embed quality early in the planning process and support the delivery of high-quality homes and places.” "
        },
        {
            "text": "Sam Goss, Founding Director, Barefoot Architects, said: "
        },
        {
            "text": "“This new national design guidance is a welcome step in raising expectations for the quality of new neighbourhoods. At Hazelmead, the UK’s largest community-led cohousing project, we’ve seen how clear principles around walkability, shared green space, climate resilience and adaptable homes create places that genuinely improve people’s lives. The focus on liveability, identity and public space is crucial. Community-led housing has long shown that when residents help shape places from the outset, the result is healthier, more sociable and more resilient neighbourhoods. With the right support, this guidance can help unlock high-quality, people-centred housing at scale.” "
        },
        {
            "text": "Joe Stenson, Head of Urban Design at Barratt Redrow, said:  "
        },
        {
            "text": "“We know that strong, thoughtful design is essential to creating great places to live over the long term. We therefore support the ambition of government’s proposed update to national design guidance, putting people at the heart of placemaking and creating a consistent approach that will help to speed up local decision-making.” "
        },
        {
            "text": "Hilary Satchwell, Director Tibbalds and Co-chair of Design South East, said: "
        },
        {
            "text": "“This important guidance is there to help everyone involved in the built environment focus on the principles, tools and processes needed to make well-designed places that work for all those that will use them.   “It's great that this new and updated guidance is about placemaking as well as design, an emphasis that reminds us that places are made up of buildings, landscape, streets, and a wide range of land uses, activities and infrastructure - and that it is the combination of how these elements are put together well that makes somewhere truly successful.” "
        },
        {
            "text": "Martyn Craddock, Chief Executive, United St. Saviour’s Charity, said: "
        },
        {
            "text": "“We welcome this guidance wholeheartedly. Appleby Blue's Stirling Prize and Housing Design Award wins prove that high-quality social housing can lead the way in design excellence. The principles outlined here, liveability, climate resilience, nature integration, and social connectivity, are exactly what we embedded at Appleby Blue, and we've seen the transformative impact on residents' health and wellbeing. As the government works with housing providers and developers to deliver 1.5 million homes, we cannot accept subpar design for social housing. Well-designed, light-filled homes in the heart of our cities that prioritise accessibility and reflect their local context are essential for creating lasting value and thriving communities.”  "
        },
        {
            "text": "Hazel Rounding, Managing Director at Shedkm, said: "
        },
        {
            "text": "This new design guidance is most welcome to endorse the importance of quality design choices in the development of our homes, promoting resilience for the end user and environment.  Architecture has a responsibility to protect humans and create appropriate and lasting neighbourhoods for our communities in an ever-changing world.  This a huge and complex subject which strives to balance future innovation, whilst preserving identity through our urban grain, so support by the creation of simple and effective guidance is most welcome. "
        },
        {
            "text": "Dav Bansal, Partner at Howells, said:  "
        },
        {
            "text": "“We welcome the new design guidance which focuses on the creation of high-quality neighbourhoods that are safe, healthy and sustainable. Our project at Paradise is a blueprint for local integrated urban planning, restitching the city core and reconnecting Birmingham’s centre with the west and north to unlock future growth. It has reimagined a defining place — celebrating the historic assets that once shaped the city’s civic pride — while delivering generous public realm, thousands of jobs and vibrant city living to support economic prosperity. "
        },
        {
            "text": "It also demonstrates the importance of partnership - working alongside Birmingham City Council and Federated Hermes / MEPC, this exemplary public-private partnership has created a world-class destination for the city.” "
        },
        {
            "text": "Keith Bradley, Founding Partner, Feilden Clegg Bradley Studios said:   "
        },
        {
            "text": "“Good design is not an optional extra; it is fundamental to creating places where people want to live, stay and invest in. Developments like Accordia, Cambridge set a new benchmark for high-density housing in the UK, representing a paradigm shift in housing quality and design and winning the 2008 Stirling Prize. It is widely acknowledged as an exemplary neighbourhood, with integrated landscaping that responds to place, quintessentially Cambridge.”"
        }
    ]
}