{
    "url": "https://defrafarming.blog.gov.uk/2026/01/22/making-our-funded-vet-visits-work-better-for-pig-farmers/",
    "title": "Making our funded vet visits work better for pig farmers",
    "authors": [
        "Chris Maxwell"
    ],
    "categories": [
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2026-01-22T10:32:47+00:00",
    "content": [
        {
            "text": "Porcine Reproductive and Respiratory Syndrome (PRRS) testing has always been a required part of the animal health and welfare review for pigs. "
        },
        {
            "text": "Currently, the only way to test for PRRS is by using oral fluid samples. You told us this approach can be impractical and unreliable for some systems, particularly outdoor herds. "
        },
        {
            "text": "From 22 January, vets will be able to take blood samples as an alternative to oral fluid samples when testing pigs for PRRS."
        },
        {
            "text": "This change follows feedback from across the pig sector, including farmers, vets, producers and integrators."
        },
        {
            "text": "Including blood samples as an additional testing option should make it easier for pig farmers to take part in the animal health and welfare review."
        },
        {
            "heading": 2,
            "text": "Porcine Reproductive and Respiratory Syndrome (PRRS)"
        },
        {
            "text": "PRRS remains one of the most significant diseases affecting pig health and productivity. It is a viral disease that affects pigs of all ages and can be difficult to control once it is on a unit."
        },
        {
            "text": "In breeding herds, PRRS can affect reproduction, with higher losses and weaker piglets. In growing pigs, it affects the immune system and lungs, leading to slower growth, poorer feed efficiency and a higher risk of secondary infections. "
        },
        {
            "text": "For farmers, this means higher mortality, increased medicine use and more labour, often even when clinical signs are mild. PRRS also spreads easily within and between herds, so a single introduction can have long-lasting effects."
        },
        {
            "text": "Understanding PRRS status helps farmers and vets make informed decisions on biosecurity, vaccination and herd health planning, which is why testing plays an important role in managing the disease."
        },
        {
            "heading": 2,
            "text": "Animal health and welfare review"
        },
        {
            "text": "The animal health and welfare review supports farmers to work with their vet to better understand disease risks and take action."
        },
        {
            "text": "Fewer pig farmers are making use of the benefits of the review. One of the reasons raised by the sector was the lack of flexibility in sampling methods."
        },
        {
            "text": "For many, blood sampling is a familiar and well-established method for PRRS testing. Allowing this option should:"
        },
        {
            "text": "The intention isn’t to replace oral fluid testing, but to give vets and farmers the flexibility to choose the most appropriate method for their herd and business."
        },
        {
            "text": "Feedback from the sector has directly informed this change, and the expectation is that it will help more pig keepers benefit from the scheme."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "If you have looked at the animal health and welfare review before and felt it was not right for your system, this change may make it more workable."
        },
        {
            "text": "If you have not taken part yet, look at the guidance, which has been updated to reflect the change. "
        },
        {
            "text": "It's worth having a conversation with your vet to see whether the review could now work for you."
        },
        {
            "text": "Finally, payment rates for both the animal health and welfare review and the endemic disease follow-up will increase from today."
        },
        {
            "text": "Read our blog post on the payment uplift for vet visits for more information and the rates for other species."
        },
        {
            "heading": 2,
            "text": "Increased rates"
        }
    ]
}