{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/22/misleading-reporting-on-election-postponement/",
    "title": "Misleading reporting on election postponement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2026-01-22T13:58:27+00:00",
    "content": [
        {
            "text": "There has been some misleading reporting in a number of media outlets today claiming some local elections have been “cancelled”. That is not the case."
        },
        {
            "text": "Elections in 29 areas are being postponed — not cancelled. Those councils provided evidence that postponement would help them deliver reorganisation."
        },
        {
            "text": "Once reorganisation is agreed, residents in all 29 areas will vote for new councils in May 2027, with those councils operating from April 2028. This is how reorganisation works, and is the same approach we're taking in Surrey this year."
        },
        {
            "text": "No one is losing their vote. Elections are moving, not being scrapped."
        },
        {
            "text": "Why this matters"
        },
        {
            "text": "Replacing the outdated two-tier system means an end to duplication — two chief executives, two sets of councillors, two finance directors. Instead, more money for what people actually want: caring for older people, fixing potholes, better local services."
        },
        {
            "text": "The reform will cut around 5,000 councillor posts and eliminate highly-paid senior roles, freeing up cash for frontline priorities. Services like housing, planning and roads will sit under one roof, speeding up decisions on things like housebuilding."
        },
        {
            "text": "Secretary of State for Housing, Communities and Local Government, Steve Reed said:  "
        },
        {
            "text": "This is a once-in-a-generation reform that will transform local government for the better.  "
        },
        {
            "text": "Cutting through two-tier bureaucracy means faster decisions on housing, simpler access to services, and more money going to potholes, tackling crime and caring for older people instead of being lost to duplication. That’s what residents want and that’s what reorganisation will achieve.”"
        }
    ]
}