{
    "url": "https://publicpolicydesign.blog.gov.uk/2026/01/22/tackling-violence-against-women-through-whole-system-design/",
    "title": "Tackling violence against women through whole system design",
    "authors": [
        "Olumide Adisa"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2026-01-22T12:00:00+00:00",
    "content": [
        {
            "text": "The design of policies does not occur in a vacuum. It requires systems thinking to understand the interconnected issues that policy is trying to tackle."
        },
        {
            "text": "Wicked problems necessitate a sharper toolkit to grapple with the complex forms of violence against women and girls (VAWG) we are seeing – from online harms, to stalking, to teenage relationship abuse."
        },
        {
            "text": "Some mayoral combined authorities and police and crime commissioners have recognised this and are reimagining their VAWG strategies through a whole systems redesign approach."
        },
        {
            "text": "My policy and commissioning work for the Mayor of London is helping to shape system-level change thinking in the VAWG sector workforce and grassroots community."
        },
        {
            "heading": 2,
            "text": "Thinking in systems"
        },
        {
            "text": "But first, what is a system? I, and many others, have tried to bring to the forefront accessible definitions of systems. One of my favourites is that of the late Donella Meadows. She provides a useful analogy: ‘an animal is a system, a tree is a system, and a forest is a larger system that encompasses subsystems of trees and animals’. A system is made up of interconnected parts, the sum of which is greater than the whole."
        },
        {
            "text": "There is a growing appetite for the introduction of systems thinking in government departments and policy spaces. The Centre for Complexity Across the Nexus have done incredible work in bringing systems thinking into complex systems such as food systems, transport, and now through my work at VISION Consortium, can engage with violence and abuse issues. Civil Service’s Policy Design Community also teach systems thinking as an important part of public design practice."
        },
        {
            "text": "I developed a complexity-informed systems change framework to guide systems change efforts in the context of tackling violence and abuse. This framework began with evaluation to inform violence prevention pathways, and has advanced into informing and enhancing delivery of VAWG strategy development."
        },
        {
            "heading": 2,
            "text": "Not just systems, but whole systems"
        },
        {
            "text": "A whole system approach emphasises the interconnectedness within a system, which is crucial for addressing complex societal issues effectively and sustainably."
        },
        {
            "text": "It focuses on dynamic, flexible collaboration among local stakeholders. It encourages communities to understand challenges, analyse local systems, and identify opportunities for change. Stakeholders agree on actions and work together to achieve sustainable, long-term systemic change as part of commissioning practices and systems, as well as convening practices."
        },
        {
            "text": "…this is about changing the system in a holistic way, rather than in piecemeal fashion."
        },
        {
            "heading": 2,
            "text": "Purposeful engagement with systems"
        },
        {
            "text": "While most whole systems maps focus on interconnections, long term goals, and multi-level engagement, they need to pay more attention to the role of complexity."
        },
        {
            "text": "Complexity emphasises that aspects of systems are unpredictable and uncertain, but change can be achieved through coordinated reforms taking place in interconnected structures and institutions. For example, we can prevent VAWG by shifting the systems and structures that cause violence, this includes considering ways that multiple systems cause violence too."
        },
        {
            "text": "We must emphasise purposeful engagement with systems - be it social, economic, or organisational - to address challenges, realign goals and strategies, or improve interconnections."
        },
        {
            "text": "This approach builds greater equity and better outcomes for victims and survivors, while tackling the root causes and structural aspects of violence. "
        },
        {
            "text": "In a nutshell, it is time to redesign systems through a whole systems approach, and as a community think through what that means for whole-of-society change."
        }
    ]
}