{
    "url": "https://ipo.blog.gov.uk/2026/01/22/the-evolution-of-trade-marks-from-brewery-triangles-to-digital-titans/",
    "title": "The evolution of trade marks: from brewery triangles to digital titans",
    "authors": [
        "Kelly Saliger, CITMA President"
    ],
    "categories": [
        "Business",
        "The Chartered Institute of Trade Mark Attorneys",
        "Trade marks"
    ],
    "pub_date": "2026-01-22T12:05:47+00:00",
    "content": [
        {
            "text": "As part of our ongoing celebration for 150 years of trade marks, we're honoured that Kelly Saliger, president of CITMA has taken up our invitation to be guest blogger today:"
        },
        {
            "text": "The celebration of 150 years since the first registered UK trade mark is the perfect opportunity to remember how trade marks have shaped the world we live in."
        },
        {
            "text": "At its core a trade mark is a sign that says “this is ours” but the way in which we use, protect and exploit these signs has changed over time."
        },
        {
            "text": "As an origin story the UK trade mark has a brilliant one – with companies scrambling to be the first to file. Bass & Co succeeded filing its iconic red triangle in 1876. It’s a simple lesson in what a good trade mark looks like – it’s distinctive and bold and instantly reminds you of the company behind the brand."
        },
        {
            "text": "That red triangle is still a registered trade mark to this day - its value enduring the test of time."
        },
        {
            "heading": 3,
            "text": "The modern trade mark"
        },
        {
            "text": "Fast forward 150 years. We're in an era where companies' most valuable assets aren't factories, warehouses, or even offices – they're intangible. When you look at the world's most valuable companies, their worth lies not in physical property but in intellectual property: their brands, their technology, their creative works."
        },
        {
            "text": "When you buy from a company online, you never touch their premises, meet their staff, or see their stock. You're buying based on their reputation – signposted by their registered trade mark. In our digital economy, your trade mark might be the only tangible connection between you and your customers. It's your handshake, your storefront, and your guarantee rolled into one."
        },
        {
            "text": "AirBnb doesn’t own the accommodation it lets and Uber doesn’t own cars – their business is built around trade mark registrations. A symbol of trust and origin. You can travel to unfamiliar countries, but as long as you’re in one of the more than 15,000 cities Uber operates in you can use a service that you know and trust – and you’ll be able to get that 6am ride to the airport."
        },
        {
            "text": "This is why we see companies of all sizes investing in developing and protecting strong brands. A trade mark registration doesn't just protect a logo – it protects customer relationships, market position, and business value. It's an investment that, unlike machinery or property, doesn't depreciate. Maintain and use it properly, like Bass, and that trade mark can protect your business forever and be the catalyst for growth."
        },
        {
            "heading": 3,
            "text": "A tool for the consumer"
        },
        {
            "text": "Trade marks aren’t only about marketing - they’re a frontline consumer‑protection tool and have always been since the first registered trade marks of 1876.  "
        },
        {
            "text": "Take food and drink – trade marks signal provenance, hygiene standards and ingredient control. Many of the early trade mark registrations in the 1870s were for food and drink brands – not just because they were some of the most well-known items, but it was also about keeping people safe."
        },
        {
            "text": "In Victorian Britain, consumers needed to know their beer hadn't been watered down, their medicine wasn't poison, and their food was safe to eat. Trade marks became guarantees of quality and origin. When you saw that Bass red triangle, you knew exactly what you were getting."
        },
        {
            "text": "Counterfeits and copycats can confuse shoppers into picking unsafe products, whether that’s mislabelled spirits, look‑alike baby formula or snacks without proper allergen warnings. Registered trade mark rights make it easier to stop misleading “get‑ups,” seize dangerous fakes at the border and secure platform takedowns before harm spreads."
        },
        {
            "text": "Pharmaceuticals show the stakes even more clearly, trade marks are fundamental in ensuring patient safety."
        },
        {
            "text": "Trade marks help patients and pharmacists distinguish genuine packs from imitations, and they underpin rapid enforcement alongside regulatory tools."
        },
        {
            "text": "The IPO has highlighted the consumer angle in recent anti‑counterfeiting campaigns, including warnings about unsafe counterfeit toys and non‑genuine car parts. Those efforts underline a simple point: when a trade mark is enforced, it’s not only brand value that’s protected - it’s product safety and public confidence too."
        },
        {
            "heading": 3,
            "text": "Unusual trade marks"
        },
        {
            "text": "It’s not just words and logos that can show origin and can act as trade marks, colours, sounds and shapes are some of the more unusual filings that have made their way onto the UK’s trade mark register in recent decades."
        },
        {
            "text": "The 'Cadbury purple', 'Barbie pink' colours and the shape of the iconic Coca-Cola bottle are some of those registered trade marks that you’ll have encountered without realising their significance in the world of intellectual property."
        },
        {
            "text": "Iconic audio cues - the Netflix “ta‑dum,” the Intel bong, the Nokia ringtone - show how a tiny sonic signature can carry big brand meaning, but they remain niche compared to words and logos."
        },
        {
            "heading": 3,
            "text": "Make trade marks work for you"
        },
        {
            "text": "Trade marks aren’t just legal decorations; they’re practical tools. If you’re building a product, your mark is the signpost that helps customers find you again. If you’re expanding, it’s the legal perimeter that stops others from free‑riding. And if you ever sell, it can be a big slice of the valuation."
        },
        {
            "text": "Every day I see the benefit businesses have from speaking to a qualified legal professional about their IP – it’s vital to protect what you are creating, and in many cases is the most valuable part of your business. You can find a directory of Chartered Trade Mark Attorneys at citma.org.uk"
        }
    ]
}