{
    "url": "https://ukhsa.blog.gov.uk/2026/01/22/what-is-measles-and-why-is-it-so-important-were-up-to-date-with-our-vaccines-to-protect-against-it/",
    "title": "What is measles and why is it so important we're up to date with our vaccines to protect against it?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2026-01-22T11:49:32+01:00",
    "content": [
        {
            "text": "Measles is highly contagious so even a small decline in vaccine uptake can lead to a rise in cases. There has been a resurgence of measles in England and around the world in recent years. In 2024 there were 2,911 laboratory confirmed measles cases in England, the highest number of cases recorded annually in decades. Figures reported for 2025 to date record 957 laboratory-confirmed measles cases. Most of these cases have been in unvaccinated children under the age of 10.  "
        },
        {
            "text": "Uptake of the routine childhood vaccinations is the lowest it has been in a decade and is well below the 95% uptake needed to protect the population and prevent measles outbreaks. This is giving measles a chance to get a foothold in our communities. Achieving high vaccination coverage across the population is important as it also indirectly helps protect very young infants (under 1) and other vulnerable groups. "
        },
        {
            "heading": 2,
            "text": "What is the MMRV vaccination, and how is it different from the MMR?"
        },
        {
            "text": "Due to the introduction of a varicella (chickenpox) vaccination programme the measles, mumps, rubella and varicella (MMRV) vaccine replaced the MMR vaccine in the routine childhood programme from the 1 January 2026. If your child was born on or after 1 January 2025, they will be offered their first dose of MMRV at 12 months old and their second dose of MMRV at 18 months old."
        },
        {
            "text": "You can find out more about the reasons for the change and what vaccinations children should receive when, in this blog post."
        },
        {
            "text": "Older children and adults born on or before 31 December 2019 who are not up to date can be caught up for free on the NHS whatever their age using the MMR vaccine.  "
        },
        {
            "heading": 2,
            "text": "What are the symptoms of measles?"
        },
        {
            "text": "Measles is caused by a virus and spreads very easily, it used to be common in childhood but is now rare due to the childhood vaccination programme."
        },
        {
            "text": "When you catch it, at first it can feel like you have a cold with a runny nose and a cough, sore red eyes (conjunctivitis) and a fever, but this is followed a few days later by a rash that spreads all over the body. See images of the measles rash on the NHS website."
        },
        {
            "text": "Measles can lead to complications such as ear and chest infections, fits and diarrhoea and dehydration in younger children. On rare occasions, measles can also lead to infection of the lining of the brain and spinal cord (meningitis) or the brain itself (encephalitis) which can lead to long term disabilities or even death."
        },
        {
            "text": "People in certain risk groups including babies and young children, pregnant women, and people with weakened immune systems, are at increased risk of complications from measles."
        },
        {
            "heading": 2,
            "text": "What is the incubation period for measles?"
        },
        {
            "text": "The measles incubation period is typically 10 to 12 days from exposure to the first symptoms, but can range from 7 to 18 days, with the characteristic rash usually appearing around day 14. An infected person is contagious from about 4 days before the rash starts until 4 days after.  "
        },
        {
            "heading": 2,
            "text": "How long does measles last?"
        },
        {
            "text": "Most people will feel better after 7 to 10 days."
        },
        {
            "heading": 2,
            "text": "Is measles an issue if I travel abroad?"
        },
        {
            "text": "Since the introduction of the measles vaccine in 1968, more than 20 million measles cases and 4,500 deaths have been prevented in the UK. However, countries around the world with low MMR vaccine uptake continue to experience large measles outbreaks and epidemics."
        },
        {
            "text": "It is especially important to check you are up to date with your 2 doses of MMR or MMRV before you travel. Not only would it be unpleasant to become ill while abroad, but you may risk bringing the infection back with you and exposing your family and friends."
        },
        {
            "heading": 2,
            "text": "Two doses of MMRV for full protection"
        },
        {
            "text": "The MMRV vaccine is a simple way to protect yourself against measles, mumps, rubella and varicella (chickenpox). Over 99% of those who have 2 doses of the MMRV vaccine will be protected against measles and rubella. Although mumps protection is slightly lower, cases in vaccinated people are much less severe."
        },
        {
            "text": "The MMRV vaccination will protect your child against 4 serious infections. It will also help to protect others who can’t have the vaccine. These include unborn babies, infants who are too young to have the vaccine and those who can’t have the vaccine because they have weakened immune systems. This will help to prevent large outbreaks of disease."
        },
        {
            "text": "Since the MMR vaccine was introduced in 1988, these conditions have become rare in the UK. However, outbreaks of disease, especially measles, have occurred when the number of people having the vaccine has dropped. The fall in MMR uptake over the last decade explains the rise in measles cases we have seen in the UK since 2023."
        },
        {
            "heading": 2,
            "text": "What role does UKHSA play?"
        },
        {
            "text": "We play a central role in the national vaccination programme, including developing guidance for healthcare professionals, creating public information resources, supporting programme design and delivery, and monitoring coverage and effectiveness. You can see the latest case numbers for measles in England published monthly on our Data Dashboard."
        }
    ]
}