{
    "url": "https://defradigital.blog.gov.uk/2023/06/03/am-i-a-cyclist-or-just-a-person-on-a-bike/",
    "title": "Am I a cyclist (or just a person on a bike)?",
    "authors": [
        "Wieke Wicks"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Open data"
    ],
    "pub_date": "2023-06-03T08:00:55+01:00",
    "content": [
        {
            "text": "On World Bicycle Day, Wieke Wicks celebrates the benefits – including the joys – of cycling and asks the question ‘what makes a cyclist’?"
        },
        {
            "text": "In a way, World Bicycle Day is a day when all cycling enthusiasts get to be even worse than normal, and unashamedly boast about their hobby. I apologise to all those who’ve already heard enough about it!"
        },
        {
            "text": "To introduce myself: I’m the one who rocks up in the office peeling off the dripping waterproofs on a rainy day; who’ll park the bike outside the pub when we go out, and who’s always confused when someone asks, “did you come in on your bike?”, because how else would I get around?"
        },
        {
            "text": "I’m a Product Manager in Defra's Digital Data and Technology Services Data and Information function, where I work in data management, and particularly governance, striving to make our data accessible and useable in consistent, standardised ways."
        },
        {
            "text": "I’m an enthusiast who always likes to share my passions and encourage others to try new things, whether this is work-related training, or taking up a creative hobby. Maybe that’s why I chose to write this blog; if I can inspire one reader to enjoy riding a bike, I’m glad I did."
        },
        {
            "heading": 2,
            "text": "Bikes are nothing new though, right?"
        },
        {
            "text": "It would be easy to overlook the uniqueness, longevity and versatility of the bicycle, and the fact that they have been in use for two almost centuries."
        },
        {
            "text": "Vehicles with two wheels, and which require balancing by the rider, are thought to date back to the early 19th century. The first means of transport making use of two wheels arranged consecutively, and thus the first bicycle, was the German draisine, or dandy horse, dating back to 1817. A few years later the term bicycle is believed to have been coined in France, in the 1860s."
        },
        {
            "text": "Bikes remain a simple, affordable, reliable, clean, and environmentally fit, sustainable means of transportation."
        },
        {
            "heading": 2,
            "text": "A cyclist (or just a person on a bike)?"
        },
        {
            "text": "Do I consider myself as a “cyclist”? Well I love to go out into the countryside on my road bike (yes, all kitted out, I’m one of those). After an hour on the road I’ve had every thought in my head, remembered (and forgot), every errand, mulled over every work problem, and had every silly idea that’ll never be followed up. After that, it’s just the road, the landscape, me, and my bike, and maybe the odd pothole. Those are the days when I’m a cyclist."
        },
        {
            "text": "But day to day cycling is a different thing - it’s not a hobby, or a leisure choice: it’s simple logistics. I’m just a person on a bike. I fully appreciate that for many it’s pretty daunting, or practically unfeasible - often due to the (lack of) infrastructure, bad experiences or near misses."
        },
        {
            "text": "I’m not saying everyone is better off on a bike, but I also hope more and more of us can see the possibilities. Every little helps, and I have seen for myself that the more people normalise doing a quick errand on a bike rather than a car, the more familiar cyclists become as part of the road users. There’s some safety in numbers, and then there won’t be cyclists, there will be persons - motorists, pedestrians, mums, dads, kids, colleagues - on bikes."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Cycling benefits"
        },
        {
            "text": "This is the cycling that I would like to celebrate on World Bicycle Day: the cycling that becomes part of our daily routines, as a simple, clean, affordable transport option. That contributes to our health, both by keeping active and contributing to cleaner air in our streets. That leaves our cars on the driveway to let traffic flow for buses and those who really need it."
        },
        {
            "text": "To be honest, although I wholeheartedly agree with the above, and I’m grateful to be contributing, I see much clearer benefits much closer to home. I live in York and frankly, taking the bike is just the quicker option. No getting stuck in traffic. No searching (and paying) for parking. The ease of cycling past a shop and just stopping off for a pint of milk - a few minutes. Or popping to the supermarket during rush hour without this being a problem."
        },
        {
            "text": "I could go on, but I think you get the gist. There’s one element though that I haven’t mentioned yet, and that’s the opportunities it presents for how I can raise my kids. I grew up in the Netherlands, where it went without saying that kids from a young age could go about their town independently - to school, to friends, to a sports club, back home again."
        },
        {
            "text": "This level of responsibility, independence, and also freedom, is what I want for my kids. In York, I can see this working, I can see it happening, and the bikes play a big part in that."
        }
    ]
}