{
    "url": "https://environmentagency.blog.gov.uk/2023/05/31/a-council-view-of-the-fly-tipping-curse/",
    "title": "A council view of the fly tipping curse",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-05-31T13:29:02+00:00",
    "content": [
        {
            "text": "Fly tipping is more than a nuisance. It isn’t just ‘a bit of dumped waste’ for the local council to clear."
        },
        {
            "text": "It’s an Environmental Health Officer sent to investigate. It’s a Waste Operative (or two) the council can ill-afford to spare during these times of staff shortages. It’s a vehicle and all the related maintenance and fuel costs, not to mention emissions. It’s time spent by Customer Support Officers that could be used in helping other customers with pressing needs."
        },
        {
            "text": "A constant problem"
        },
        {
            "text": "In the first quarter of 2023, Exeter City Council attended 298 incidents of fly tipping. 166 of these were van loads, with the majority being ‘other household waste’ (such as furniture)."
        },
        {
            "text": "Exeter City Council is responsible for clearing fly-tipped waste on public land within its boundaries, unless the incident is ‘Big, Bad or Nasty’. The Council is required to contact the Environment Agency where: the dumped waste is heavier than 20 tonnes (about 20 cubic metres in size); is fibrous asbestos in an amount larger than 5 cubic metres; or is hazardous liquid in drums and containers totalling more than 75 litres."
        },
        {
            "text": "The onus is also on the Council to inform the Environment Agency where officers suspect the incident is linked to criminal business activity or organised crime."
        },
        {
            "text": "Our Environmental Health Officers will look for evidence in black bags to find out who the offenders are, but for your average case of a dumped mattress in a back alley there is little chance of turning up any evidence of the culprits at the scene."
        },
        {
            "text": "There are CCTV cameras around Exeter, but it isn’t possible to monitor every nook and cranny of the city and it wouldn’t go down too well with residents even if it were an option logistically."
        },
        {
            "text": "The Council has placed warning signs at fly tipping hot spots, but determined fly tippers know the likelihood of them being caught in the act is low and the lack of incriminating evidence means they are not put off by perceived empty threats of punishment."
        },
        {
            "text": "Ignorance contributes to the problem"
        },
        {
            "text": "Fly tipping isn’t only enacted by the devious, the criminal or the unwilling-to-pay. It’s also performed by those who may not be aware that what they are doing is an offence."
        },
        {
            "text": "It’s a significant issue at recycling points. Despite signs instructing people not to leave glass on the ground when the banks are full, they still do. This is still fly tipping. Leaving bags on the ground at recycling points might seem reasonable and like the right place for collection, but the problem is it encourages others to do the same, which in turns leads to other types of waste being left by the recycling banks – including chests of drawers, mattresses, clothes, general household rubbish and builders’ waste. People see it as unwritten permission to leave their waste there for the council to ‘do its job’ and clear the mess."
        },
        {
            "text": "As a result of persistent fly tipping at their recycling sites, two major supermarkets in the city have instructed Exeter’s Waste Team to remove the glass banks from their land. While this has reduced instances of fly tipping, shoppers now have to travel further to recycle their glass and this generates complaints to Customer Support and to the Waste Team."
        },
        {
            "text": "The significant time spent by Council staff fielding reports of fly tipping incidents, then investigating and clearing fly-tipped waste, results in time lost for the provision of other important public services. The cost of clearing up illegally dumped waste inevitably impacts upon service delivery, too – and with local authority budget constraints already hitting services hard, this is a more significant problem than ever."
        },
        {
            "text": "You can help"
        },
        {
            "text": "You are legally responsible for the waste you are throwing away."
        },
        {
            "text": "If waste you have passed to someone else for disposal on your behalf is fly tipped and traced back to you, you could be held responsible and face prosecution and a fine up to £5000 for fly tipping."
        },
        {
            "text": "To avoid this, there are simple steps you can take when finding a waste collection service."
        },
        {
            "text": "By acting responsibly, we can all help to ensure our waste is disposed of legally and safely, keeping our streets and green spaces clean and safe for our communities."
        },
        {
            "text": "Exeter City Council"
        }
    ]
}