{
    "url": "https://deframedia.blog.gov.uk/2023/05/31/coverage-of-river-wye-roundtable-meeting/",
    "title": "Coverage of River Wye roundtable meeting",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Pollution",
        "water"
    ],
    "pub_date": "2023-05-31T15:40:24+01:00",
    "content": [
        {
            "text": "Yesterday (Tuesday 30 May), Environment Secretary Thérèse Coffey met local farmers, councillors, environmental groups, MPs and the Welsh government in Hereford to discuss actions to improve the state of the River Wye. The meeting came as Natural England updated the Site of Special Scientific Interest (SSSI) condition assessment for the River Wye Special Area of Conservation (SAC) from ‘unfavourable recovering’ to ‘unfavourable declining’, due to a decline in certain types of key wildlife."
        },
        {
            "text": "The Hereford Times ran an interview with the Environment Secretary in which she outlined the importance of a coordinated approach to driving improvements in the Wye across governments, regulators and the local community. The Environment Secretary also noted that £1.2 million of the £34 million in funding available through the Slurry Infrastructure Grant Scheme has been allocated directly to farms in the Wye catchment, in order to expand storage and prevent unnecessary spreading – ultimately helping to reduce pollution arising from run-off."
        },
        {
            "text": "There has been further coverage in outlets including The Times, The Guardian, Evening Standard, BBC West Midlands and Perspective Magazine."
        },
        {
            "text": "The roundtable sought to discuss local concerns and ongoing implementation of actions to address the status of the river, particularly in light of its impact on wildlife. While the River Wye is known as one of the country’s most important sites for salmon fishing and nature conservation, pollution arising from run-off and other sources are leading to formation of algal blooms, harming delicate habitats and nature."
        },
        {
            "text": "Hosting the meeting, the Environment Secretary set out how restoring the Wye was a priority for both her and all of those in attendance, and outlined how it was important to address each river catchment according to its unique pressures, as part of a consistent approach across the country. She was particularly keen to see how the local council could help facilitate local initiatives to help reduce pollution and to work with the Welsh government too."
        },
        {
            "text": " "
        },
        {
            "text": "Environment Secretary Thérèse Coffey said: "
        },
        {
            "text": "As part of the interim condition assessment of the River Wye SAC, Natural England assessed four key features across a number of units throughout the watercourses: Atlantic salmon, macrophytes (aquatic plants), native white-clawed crayfish and water quality. While the latter was found to be stable, numbers of the three species are declining. In accordance with the Common Standard Monitoring Guidance, if any one of the features is classed as ‘unfavourable - declining’, irrespective of the status of the other interest features, the whole unit of the river is reclassified. For more information, go to: Assessing the health of the River Wye and its catchment."
        },
        {
            "text": "Emma Johnson, Area Manager for the West Midlands, Natural England said:"
        },
        {
            "text": "Call to action: Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}