{
    "url": "https://mojdigital.blog.gov.uk/2023/05/31/creating-psychological-safety-in-our-ways-of-working/",
    "title": "Creating psychological safety in our ways of working",
    "authors": [
        "Mahnaz Yusaf",
        "James Halliday",
        "Claire Waterworth"
    ],
    "categories": [
        "a great place to work",
        "Our Culture",
        "Our People",
        "psychological safety"
    ],
    "pub_date": "2023-05-31T13:03:18+01:00",
    "content": [
        {
            "text": "The original 'It's okay to' poster was created by GDS to communicate the 'unofficial' ways of working and to help create a safe psychological environment for new team members."
        },
        {
            "text": "At Justice Digital (the digital arm of the Ministry of Justice), our teams had grown over the lockdown period, and hybrid working became our new normal. Our teams were often no longer co-located, and this brought new ways of working and unwritten rules."
        },
        {
            "text": "We revised the GDS 'It's okay to' poster to reflect our new ways of working at Justice Digital, and we wanted to share this with you."
        },
        {
            "heading": 3,
            "text": "Creating psychological safety in our ways of working:"
        },
        {
            "text": "GDS played an essential role in setting direction and opening possibilities for doing government services well. Part of this was understanding the importance of - and taking steps to support - a positive workplace culture. The early pioneers recognised the importance of this by considering workplace culture and making it explicit. Since its publication, Giles Turnball's classic blog and the poster that resulted from his team's attempt 'to communicate the unofficial stuff' has been a touchstone for many of us working on public services. This was an obvious starting point when we wanted to look at our culture and refresh it for post-covid hybrid working and rapid growth."
        },
        {
            "text": "We held workshops and discussions about our culture and which aspects we wanted to protect and extend. The importance of psychological safety and the connection between well-being and performance were recurrent themes. Collaboration is at the heart of everything we do, and psychological safety is at the heart of effective collaboration. The extent to which we can effectively collaborate in multidisciplinary teams sets the bar for what we can achieve."
        },
        {
            "text": "We want to build a culture where people feel safe, a culture of trust and openness. We want to create a relaxed and comfortable space, to act as the foundation for unrestrained creativity. "
        },
        {
            "text": "Our teams work in often fast-paced environments, building services for people within complex spaces in their lives. Also, we work on serious issues at MoJ, things that matter. That's why it's essential to support psychological safety. When deadlines are near, living up to your shared values is more challenging than you might hope. A big poster on the wall can help."
        },
        {
            "text": "\"I found the community poster a timely and helpful reminder that 'it is OK to.'\"\n\n“I was having some childcare issues, which I'm aware that I can take time off for, but I did not need to. Therefore, reading the contract earlier in the week reassured me and prompted me to define my way of working for the couple of days when I had the issue. This enabled me to work flexibly, knowing that the team were aware and supportive of my circumstances at that point in time.\""
        },
        {
            "heading": 3,
            "text": "Our statements:"
        },
        {
            "text": "While these statements reflect our ways of working, we wanted to include editable poster versions to be tailored by our wider teams and departments across Justice Digital. It’s why we created editable versions of the poster and included these files further down the blog (in Figma). We encourage teams to download these and tailor them to their organisations or teams and their ways of working! "
        },
        {
            "text": "(We’ve starred the new ones we curated from our cross-discipline teams.) "
        },
        {
            "text": "It’s ok to…"
        },
        {
            "heading": 3,
            "text": "You can download the posters here:"
        },
        {
            "text": "We have shared the original Figma file so you can further tailor the ‘It’s okay to’ poster for your organisation or team. Here’s the editable Figma file.\n\nIf you’d like to print the PDF version of our posters, you can download the PDF files here."
        },
        {
            "text": "P.S. We always welcome people to find out more about our open roles. Take a look at our open positions here. "
        }
    ]
}