{
    "url": "https://deframedia.blog.gov.uk/2023/05/31/cutting-edge-farming-projects-to-get-share-of-30-million-of-government-funding/",
    "title": "Cutting edge farming projects to get share of £30 million of government funding",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-05-31T15:32:14+01:00",
    "content": [
        {
            "text": "Today (31st May), the government announced that up to £30 million has been awarded to more than 50 cutting-edge farming projects that will help boost food production, move towards net zero, and create a more resilient and sustainable agricultural sector. This was announced alongside the launch of a new £12.5 million competition to kickstart even more innovative solutions for sustainable and resilient farming. The announcement received positive coverage in the Yorkshire Post, Farming UK, Agriland, and the East Anglian Daily Times. The BBC also wrote about one of the successful projects in detail."
        },
        {
            "text": "The successful projects announced today include genetic research to reduce methane emissions from cows and the use of drones to monitor animals."
        },
        {
            "text": "The funding is all part of the Farming Innovation Programme, run in partnership with UK Research & Innovation (UKRI) and delivered by Innovate UK, which is making £270 million in grants available before the end of the agricultural transition to fund research and development projects to help farmers and growers produce food more sustainably."
        },
        {
            "text": "These grants, alongside the government’s new flexible and accessible farming schemes, will ensure that farmers remain at the heart of the rural economy and putting food on our tables. It follows the Farm to Fork Summit earlier this month where the government announced a package of support for the farming sector, including new measures to ensure the sector remains at the forefront of adopting new technologies and techniques. This includes substantial investment to unlock the potential of precision breeding following royal assent for the Genetic Technology (Precision Breeding) Act, and a working group to bring plant breeders, food manufacturers and retailers together to agree an approach that enables these products to reach our shelves."
        },
        {
            "text": " "
        },
        {
            "text": "Secretary of State for Agriculture Thérèse Coffey said:"
        },
        {
            "text": " "
        },
        {
            "text": "Katrina Hayter, Executive Director Healthy Living and Agriculture of Innovate UK, said: "
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}