{
    "url": "https://environmentagency.blog.gov.uk/2023/05/31/everything-you-need-to-know-about-duckweed-on-the-river-witham/",
    "title": "Everything you need to know about duckweed on the River Witham",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-05-31T08:51:06+00:00",
    "content": [
        {
            "text": "Periods of hot and dry weather can be busy times for the Environment Agency as we work to protect not just our water resources; but our precious environment and the wildlife that depends on it."
        },
        {
            "text": "During these conditions we receive a lot of calls about duckweed in Lincolnshire, particularly on the River Witham. This blog explains what duckweed is, why it is a problem in dry weather and the challenges of managing it."
        },
        {
            "text": "What is duckweed? "
        },
        {
            "text": "Duckweed is a mass of small plants that group together to form larger “carpets” that we see on rivers. Most varieties of duckweed you are likely to see are native to the UK and are often put into ponds in gardens. Though they can quickly get out of hand, as any gardener will know. The mass of plants can double in size every two or three days meaning it can spread quickly. In a river environment during normal conditions this is not an issue. The plants are eaten by aquatic animals, washed down through the system during heavy rain or die off during winter conditions."
        },
        {
            "text": "Why can duckweed become a particular problem in the summer?"
        },
        {
            "text": "Many rivers in Lincolnshire are slow flowing and liable to grow surface weed quickly and easily even in normal summer conditions."
        },
        {
            "text": "Duckweed grows particularly well when it is hot, like the weather experienced during the summer of 2022. This is when we are more likely to see these carpets of weed on the Witham."
        },
        {
            "text": "It becomes even more of a problem during prolonged periods of dry weather when levels in rivers are very low and, in particular on systems like the Witham, where water is managed for a number of needs, from water resources to wildlife benefits."
        },
        {
            "text": "Who is responsible for removing the duckweed?"
        },
        {
            "text": "Duckweed is one of the aquatic plants that can cause problems on our rivers. By its nature, it will bloom and grow excessively in hot weather. Whilst we can intervene when oxygen levels in the water are impacting fish, removing the duckweed itself is not an activity the Environment Agency is funded to do. The process of removing the weed can also make the situation worse for wildlife. The removal process can disturb silt which can cause oxygen levels to plummet even further."
        },
        {
            "text": "Maintenance, such as weed and grass cutting, is carried out where there is a risk of flooding to people, homes and businesses. We must focus our resources where they are needed most. Floating vegetation does not increase the risk of flooding, and we will only remove it on the rare occasion when it may affect a structure, like a sluice, operating. This is done by using the sluice gates to ‘flush’ weed from the river intermittently, though this decision is dependent on the conditions at the time."
        },
        {
            "text": "Where rivers are used for navigation, the Navigation Authority may also carry out maintenance to remove weed. The navigation authority on the River Witham is the Canal and Rivers Trust. However, this is not a legal requirement and is assessed on a case-by-case basis."
        },
        {
            "text": "Duckweed can also impact other river users, such as those fishing. However, the Environment Agency cannot remove floating weed for this reason alone. Please note that the Environment Agency is unable to process any rod licence refunds based on condition of individual local fisheries."
        },
        {
            "text": "Is duckweed good for wildlife?"
        },
        {
            "text": "Duckweed can be good for fish and other wildlife in our rivers, providing an important source of food."
        },
        {
            "text": "However, if the amount of duckweed is too high, then it can reduce dissolved oxygen levels in the water. This starves the organic matter in the water of oxygen, leaving it to decompose and cause spikes in ammonia in the water. If these spikes are severe, this can be life-threatening for fish living in the river."
        },
        {
            "text": "The Environment Agency works with fisheries across Lincolnshire to manage the impact of hot, dry weather. When the situation becomes severe, the Environment Agency will look to intervene to prevent the deaths of fish where possible."
        },
        {
            "text": "Why don’t you always use the sluice gates to flush the weed out?"
        },
        {
            "text": "During normal conditions, when weed builds up we work with partners such as the Canal and Rivers Trust to flush excess vegetation through navigation locks and sluices. This is not to benefit flood risk but navigation and is carefully managed for when river flows and tidal conditions allow. However, when weed covers vast areas of the river as we saw last summer, periodic flushing has little effect."
        },
        {
            "text": "For example, the sluice gates at Grand Sluice can be raised or lowered to allow water through. The draw of the water pulls the weed under the safety booms and flushes it into the sea where it will break down in salt water."
        },
        {
            "text": "When river levels are low, it’s not always possible to do this."
        },
        {
            "text": "During periods of drought, the levels on the Witham can become very low. When this happens it’s important that the gates remain lowered to retain as much water as possible. This means that the rivers can’t go over the top of the gates and weed can’t be flushed from the river. The only way to release water would be to lift the guillotine gate which would only increase flows at the bed level and not affect the surface weed. Lifting the gate completely out of the river cannot be done during a drought due to the impact on water levels along the system and the risk to water resource need and wildlife."
        },
        {
            "text": "The Canal and Rivers Trust sometimes remove vegetation from the channel for navigation purposes using a mechanical method like a weed boat. However, the removal of weed by boat must be carefully managed as weed clearance can cause dissolved oxygen levels to drop even further, thereby increasing the risk of environmental issues, especially for fish."
        },
        {
            "text": "How can you tell the difference between algae, floating pennywort and duckweed?"
        },
        {
            "text": "Algae, floating Pennywort and duckweed can look very similar to the naked eye. All can cause issues during hot weather due to their ability to grow and spread quickly but they also have different impacts and risks. The pictures here will help you identify them."
        },
        {
            "text": "As duckweed is made up of lots of small plants together, when it is disturbed it will break apart."
        },
        {
            "text": "Algae, however, will stay together. Algae also has a slimier appearance when compared to duckweed which has tiny, smooth leaves."
        },
        {
            "text": "Floating pennywort is also a collection of smaller plants with kidney shaped leaves. It is classed an Invasive Non-Native Species and can spread incredibly quickly, up to 20cm a day, blocking light and reducing oxygen in the water for species living there. If you suspect Floating Pennywort in the watercourse, please let us know as soon as possible so we can begin to treat it."
        },
        {
            "text": "This is because floating pennywort is a plant species not native to the UK, with specific legislation in place to ensure its responsible management. Find out more about the work being done to tackle Floating Pennywort ‘Wonder Weevil’ released in fight against invasive floating pennywort - GOV.UK (www.gov.uk)."
        },
        {
            "text": "Who should I contact if I’m concerned about the river?"
        },
        {
            "text": "If you have concerns about navigation, please contact your Navigation Authority. For the Witham this is the Canal and Rivers Trust."
        },
        {
            "text": "If you are concerned about an immediate risk of flooding, contact the Environment Agency 24-hour incident number on 0800 807060."
        }
    ]
}