{
    "url": "https://defrafarming.blog.gov.uk/2023/05/31/funding-available-for-environmentally-resilient-farming-solutions/",
    "title": "Funding available for environmentally resilient farming solutions",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-05-31T10:05:33+01:00",
    "content": [
        {
            "text": "Domestic food production is vital to national resilience, but it can be impacted by a range of factors. "
        },
        {
            "text": "From the weather to geopolitical tensions, pests to water scarcity, ensuring a continued supply of nutritious food is hugely important."
        },
        {
            "text": "So, if you have an ambitious research and development project which supports productivity and sustainability in the sector, you can apply for a share of £12.5 million to fund it. "
        },
        {
            "text": "In this post, I’ll share an overview."
        },
        {
            "text": "I’ll also shine a light on some of the exciting projects to receive support through previous rounds of innovation funding. "
        },
        {
            "heading": 2,
            "text": "Overview "
        },
        {
            "text": "Through the Farming Futures competition, which is part of the Farming Innovation Programme, we want to target one or more of the following 3 industry subsectors:  "
        },
        {
            "text": "The competition addresses the challenges to plants, crops and farmed animals, from both their biological (biotic) and physical environments (abiotic). "
        },
        {
            "text": "Biotic stresses can include pests, weeds, destructive fungi and grazing herbivores."
        },
        {
            "text": "Abiotic stresses can include extreme temperatures, flooding, drought and water toxicity.  "
        },
        {
            "text": "The competition will support ways to manage these challenges. Meaning food production that is more resilient and/or has a lower environmental impact. "
        },
        {
            "text": "We want to fund collaborative projects with ambitious solutions. These projects will align with the Genetic Technology (Precision Breeding) Act 2023 and the government’s food strategy.  "
        },
        {
            "heading": 2,
            "text": "Competition structure"
        },
        {
            "text": "The Farming Futures competition is split into 2 strands."
        },
        {
            "text": "Evaluating emerging solutions. These projects cost between £200,000 and £500,000. They will last 12 to 24 months.    "
        },
        {
            "text": "Progressing emerging solutions to new products, processes and services. These projects cost between £500,000 and £1 million. They will last 24 to 36 months. Breeding projects will last up to 60 months."
        },
        {
            "text": "You can apply now using the links above."
        },
        {
            "text": "The deadline is 19 July 2023. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "Innovate UK KTN will host a competition Q&A and consortium building event on 8 June at 10:00 am. Register to attend.  "
        },
        {
            "text": "Together with UK Research and Innovation (UKRI), we recorded a briefing about the competition. Watch the session.   "
        },
        {
            "heading": 1,
            "text": "Innovating with chickpeas, onions and fungal strains "
        },
        {
            "text": "I’m pleased to share a few successful applicant projects within the 4 previous competition streams. "
        },
        {
            "text": "These include projects from the first 2 competition rounds in which government set the challenge: climate-smart farming and sustainable farm-based protein production, as well as those identified by the industry. "
        },
        {
            "text": "These projects include:  "
        },
        {
            "text": "Project: Novel dual-action biopesticide for wheat "
        },
        {
            "text": "This project aims to identify fungal strains that act against both insect and fungal pests and will build on existing ones to develop novel biofungicides, by developing a dual-action biofungicide and bioinsecticide to target pests and diseases in UK cereals.   "
        },
        {
            "text": "Project: Extracting value from onion waste - Evaluation of pyrolysis (gasification) to improve the sustainability of onion production and reduce costs on the journey to net zero "
        },
        {
            "text": "This project will establish if pyrolysis can add value to the onion waste and/or reduce costs associated with waste disposal. "
        },
        {
            "text": "Project: Climate Smart Beef Genetics - Innovative approaches to reduce the environmental impact of the UK beef supply chain "
        },
        {
            "text": "This project will look at methane reduction from the beef sector through innovative ruminal microbiome-driven breeding.  "
        },
        {
            "text": "Project: Cicero - Developing chickpeas as a novel source of domestic protein "
        },
        {
            "text": "At the heart of 'Cicero' is an agronomy and variety screening programme which identifies how to maximise performance from the best available chickpea varieties for UK growers and end-users.  "
        },
        {
            "text": "UKRI published the full list of projects today, so do take a look."
        }
    ]
}