{
    "url": "https://dataarchitecture.blog.gov.uk/2023/05/31/invitation-to-present-at-dataconnect23/",
    "title": "Invitation to present at DataConnect23",
    "authors": [
        "Sue Bateman"
    ],
    "categories": [
        "About the Government Data Architecture Community",
        "Data architecture",
        "Data governance",
        "Government Digital Service",
        "Office for National Statistics",
        "Transformation"
    ],
    "pub_date": "2023-05-31T15:47:46+01:00",
    "content": [
        {
            "text": "Sue Bateman, Chief Data Officer at Central Digital and Data Office (CDDO) discusses DataConnect23 following its launch event on 23 May 2023."
        },
        {
            "heading": 4,
            "text": "Bringing data experts together"
        },
        {
            "text": "Mark your calendars for 25-29 September 2023 for the third DataConnect conference. It is a partnered event by the Central Digital and Data Office (CDDO) and the Data Quality Hub (DQHub) at the ONS."
        },
        {
            "text": "We created the event to highlight the interesting data initiatives that often don't get deserved attention."
        },
        {
            "text": "DataConnect brings together data experts from across government. It has a diverse agenda created for, and led by, the public sector data community."
        },
        {
            "text": "DataConnect is known for cross team collaboration and innovation. This week of free events offers an arena for anyone working with data in the public sector to:"
        },
        {
            "text": "This year’s theme #BringItTogether centres on the storytelling nature of the event. Led by colleagues at all grades, it will offer:"
        },
        {
            "text": "To realise our data ambitions, we need to work together as multidisciplinary teams, bridge different systems and maximise interoperability."
        },
        {
            "text": "DataConnect23 offers a unique opportunity to enable service delivery across organisations, and for all to share data, skills and insights."
        },
        {
            "heading": 4,
            "text": "Launch event "
        },
        {
            "text": "The launch event on 23 May offered a flavour of the topics and subject matter experts we are keen to involve in September."
        },
        {
            "text": "Highlights included:"
        },
        {
            "heading": 4,
            "text": "Benefits of attending "
        },
        {
            "text": "There are many advantages to attending or presenting at DataConnect23."
        },
        {
            "text": "Benefits of presenting include:"
        },
        {
            "text": "Benefits of attending as a delegate:"
        },
        {
            "text": "This conference is an opportunity to enrich what you are doing as a data professional. We encourage you to bring your passion project or ideas, and share your learnings with others. By showcasing your work, you will enhance content, and broaden understanding for others."
        },
        {
            "heading": 4,
            "text": "Curating September’s event "
        },
        {
            "text": "As one team, CDDO and DQHub will help interested speakers curate, lead and take part in varied sessions. Previous sessions have seen enthusiastic participants create content ranging from API platforms to data ethics."
        },
        {
            "text": "This is an invitation to ask engaging speakers to present/run a talk or interactive session at this year's DataConnect. We are keen for you to take part, engage and network, and come away feeling inspired."
        },
        {
            "text": "We know the ground-breaking work you do, now it’s time to shout about it, and discuss how you overcome challenges."
        },
        {
            "text": "To register to attend or propose a session at DataConnect23 from 25 - 29 September 2023, please email dataconnect@digital.cabinet-office.gov.uk or go to https://dataconnect.api.gov.uk."
        }
    ]
}