{
    "url": "https://opss.blog.gov.uk/2023/05/31/taking-up-the-challenge-of-regulating-online-shopping-working-as-an-enforcement-manager-at-the-opss/",
    "title": "Taking up the challenge of regulating online shopping: Working as an Enforcement Manager at the OPSS",
    "authors": [
        "Rod Lissaman – Enforcement Manager, OPSS"
    ],
    "categories": [
        "Online and Supply Chain Enforcement",
        "Regulatory Compliance"
    ],
    "pub_date": "2023-05-31T14:42:23+01:00",
    "content": [
        {
            "text": "Hi, I’m Rod and I would like to share my experience of working at the Office for Product Safety and Standards."
        },
        {
            "text": "I enjoyed my previous role; I got to do and see things I wouldn’t have experienced anywhere else and it gave me some great work and life experiences. I wasn’t really looking for another role, but, sometimes you think what if I can do something else? I thought I would at least have a look to see what was out there. Nothing piqued my interest until I saw the Enforcement Manager role, it sounded interesting and certainly on paper I could tick all the boxes for what they were looking for. I attended the virtual open evening and that sold it to me!"
        },
        {
            "heading": 2,
            "text": "My application experience"
        },
        {
            "text": "I set aside time to put lots of effort into my application, paying attention to all the details and trying to cover everything within the allotted word count.  In submitting my application, I was as confident as I could be, and I really did feel like I had something to offer. So it was gratifying in itself secure an interview. Interviews are not my natural forte, always nervous, and it was hard to tell how the interview went, I think they often can be. The panel put me through my paces, but I answered the questions, gave the required examples. I then had to wait for the panel to finish the recruitment exercise, so I put it mostly out of my mind whilst waiting for the result."
        },
        {
            "text": "I was then informed that I had been successful! I was delighted, but then I got a bit scared; I’d been working the same department 25 years, what if I couldn’t do this new job? I think probably those feelings are not unusual. I then dusted myself off and looked forward to a new challenge."
        },
        {
            "heading": 2,
            "text": "My experience in the role so far"
        },
        {
            "text": "I’ve been in the role nearly six months now and I find the job interesting. In the Online and Supply Chain Enforcement Team that I’m in, it really makes you think of all the unsafe products from unreliable online sources! My team work to ensure that shopping online will be as safe as shopping on the high street. It’s really important that the OPSS tries to protect society in the best way we can from harmful products. Working on this team has influenced me to be more wary and unwilling to take risks about what I buy online."
        },
        {
            "text": "It’s been made easier that everyone in my team has been really helpful, and I’ve been supported by my manager. Other colleagues across OPSS I  have found welcoming and friendly. I like the culture in OPSS, I have no regrets about moving."
        },
        {
            "text": "I have been able to offer the benefit of my past skills, knowledge and experience in some respects, and I’ve learnt (and still learning) lots of new things not only in my job but across regulation and the wide variety of areas OPSS deals with. Regulation is a powerful Government tool to address market failures, influence behaviour and promote positive action. Crafted and delivered well, regulation can be an enabler of growth, innovation and efficiency."
        },
        {
            "text": "I’ve been impressed that senior managers are really quite visible, and I like the fact there is an all staff once a week for 30 minutes which is hosted by a senior leader that features a particular work area, with presentations from colleagues in that work area. In my own area we have a monthly in person meeting between the two offices and I like that chance to mix with colleagues. Everyone attends from the apprentices to the Deputy Director, open communication and contribution of ideas are encouraged."
        },
        {
            "text": "In conclusion, I have found OPSS a great place to work and it is developing and growing all the time. I would encourage anyone who has the right experience, is interested in the work and looking for a new challenge to think about joining us!"
        },
        {
            "text": "Further information on our primary purpose and some of the work that we have undertaken can be found on our website here"
        },
        {
            "text": " "
        }
    ]
}