{
    "url": "https://defrafarming.blog.gov.uk/2023/01/17/further-funding-available-to-improve-productivity-sustainability-and-resilience/",
    "title": "Further funding available to improve productivity, sustainability and resilience",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-01-17T11:09:08+00:00",
    "content": [
        {
            "text": "At the end of this month, farmers, growers and foresters in England will be able to apply for a share of £850,000 to improve productivity, sustainability and resilience. "
        },
        {
            "text": "The Research Starter competition will open on 30 January."
        },
        {
            "text": "The competition is designed to further develop bold, collaborative, ambitious ideas which move the agricultural sector towards net zero. "
        },
        {
            "text": "This is the third round of the competition. We launched the first round of the Research Starter competition in October 2021. "
        },
        {
            "text": "Since then, we’ve funded a range of exciting and innovative projects. They range from digital solutions for vineyard planning to soil benchmarking and automated insect protein for poultry. "
        },
        {
            "text": "In this post, I’ll share an overview of the competition, the application process and links to help you prepare."
        },
        {
            "heading": 2,
            "text": "Research Starter projects"
        },
        {
            "text": "Research Starter projects are small research and development projects. "
        },
        {
            "text": "They are designed to be an entry point to the innovation process for farmers, growers or foresters who have great early-stage ideas to solve major problems that impact their businesses. "
        },
        {
            "text": "They are particularly aimed at supporting those who haven’t previously received Innovate UK funding."
        },
        {
            "text": "Innovation in this space should benefit both you and the wider farming and growing communities. These small projects could have a big impact."
        },
        {
            "text": "Full details can be found on the Research Starter competition page. "
        },
        {
            "heading": 2,
            "text": "The application process "
        },
        {
            "text": "As mentioned, the competition opens 30 January 2023."
        },
        {
            "text": "Step 1: Applicant submits an expression of interest. The deadline is 8 March 2023. "
        },
        {
            "text": "Step 2: All applications will be assessed and scored by independent expert assessors, with relevant industry or academic expertise."
        },
        {
            "text": "Step 3: Successful applicants will be invited to submit a full stage competition application. "
        },
        {
            "text": "We expect projects to start 1 November 2023."
        },
        {
            "heading": 2,
            "text": "Scope "
        },
        {
            "text": "As with all competitions within the Farming Innovation Programme, your proposal must be able to demonstrate how your project will benefit farmers, growers or foresters in England. "
        },
        {
            "text": "Your project should address a significant industry challenge or opportunity in at least one of the four industry subsectors:"
        },
        {
            "text": "Your proposal should also investigate new solutions to challenges identified by industry, or opportunities for farmers, growers or foresters that have the potential to significantly improve: "
        },
        {
            "text": "Your project must focus on developing on-farm or immediate post farmgate solutions and technologies."
        },
        {
            "text": "We want to fund a wide portfolio of projects, across a variety of technologies, industry sectors, and business sizes.  "
        },
        {
            "text": "If at the end of your project, it is delivering some promising results, you and your new consortium could also apply into one of the bigger funding opportunities in the Farming Innovation Programme. "
        },
        {
            "heading": 2,
            "text": "Dates for your diary "
        },
        {
            "text": "30 January: Competition opens "
        },
        {
            "text": "1 February: UKRI and Innovate UK KTN will host a briefing webinar "
        },
        {
            "text": "8 March: Expressions of interest close"
        },
        {
            "heading": 2,
            "text": "More from the Farming Innovation Programme "
        },
        {
            "text": "The Farming Innovation Programme is delivered in partnership with UK Research and Innovation. "
        },
        {
            "text": "On 20 February, we plan to open a further round of large research and development (R&D) partnerships. "
        },
        {
            "text": "We'll share more details with you here on the blog and on the Farming Innovation Programme website."
        }
    ]
}