{
    "url": "https://civilservice.blog.gov.uk/2023/01/17/game-on/",
    "title": "Game on!",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-01-17T09:09:33+00:00",
    "content": [
        {
            "heading": 3,
            "text": "From street cleaning, stewarding, a scorching summer to security, the Birmingham Commonwealth Games Delivery Unit pulled out the stops to bang the drum and deliver the Games in Brum!"
        },
        {
            "text": "Having delivered a magnificent sporting spectacle on time and on budget, the 2022 Birmingham Commonwealth Games Delivery Unit were one of the worthy winners at this year’s Civil Service Awards."
        },
        {
            "text": "The chilly December weather outside Lancaster House, where they received their Project Delivery Award, felt a world away from the balmy summer weather of the Games when 4,500 elite athletes competed across 19 sports and eight para sports."
        },
        {
            "text": "All the nominees met the Project Delivery Award’s requirement of delivering complex work to a high standard, but it was the Games team that won on the night."
        },
        {
            "text": "The Award aims to recognise skilled programme, project or portfolio management in line with the Government Functional Project Delivery Standard."
        },
        {
            "text": "“On behalf of our whole team, this feels amazing,” Marie Alexandri, head of sponsorship, said at the awards ceremony held at Lancaster House."
        },
        {
            "text": "“We’re really excited that our efforts over the last four years have been recognised. We are really chuffed.”"
        },
        {
            "text": "Success was far from guaranteed when the Delivery Unit began their work with the Games just four-and-a-half years away, much closer than the usual seven-year lead-in time."
        },
        {
            "text": "Global workforce and supply chain challenges, sweltering summers and wet winters - not to mention the Covid-19 pandemic - all had to be overcome."
        },
        {
            "text": " “The thing that really made these Games stand out was us working as a team across the public sector,” Dean Creamer, Director of the Commonwealth Games, said."
        },
        {
            "text": "“We worked together, as one team, to deliver almost certainly the largest event that has been held in the West Midlands.”"
        },
        {
            "text": "In fact it took 60 functions, from street-cleaning to stewarding and security, to deliver what proved to be the highest ever attendance for a UK Commonwealth Games."
        },
        {
            "text": "Lucy Stedman, head of the programme management office, said the moment she knew for certain that the Games would be a success was when she first saw local Birmingham residents getting involved and having great fun doing so."
        },
        {
            "text": "“Everything we’d been doing had led up to that point,” Lucy remembered. “It was having a meaningful, tangible impact on the city and the region. And that for me was priceless.”"
        },
        {
            "text": "Long after the closing ceremony celebrated the region’s cultural diversity, the Games will be remembered for having been the first to award more medals to women than men; for having left a carbon-neutral legacy; and for having seen more para sports than ever before."
        },
        {
            "text": "For the 30,000 people who were at the Alexander Stadium for the closing ceremony, Ozzy Osbourne’s surprise performance of the Black Sabbath classic ‘Paranoid’ will take some forgetting too."
        },
        {
            "text": "Find out more about the awards and the nominations at www.civilserviceawards.com."
        }
    ]
}