{
    "url": "https://naturalengland.blog.gov.uk/2023/01/17/towards-a-sustainable-future-for-penwith-moors/",
    "title": "Towards a sustainable future for Penwith Moors",
    "authors": [
        "Mark Beard"
    ],
    "categories": [
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2023-01-17T09:04:08+00:00",
    "content": [
        {
            "text": "This is a follow up to the Natural England blog of 07 October 2022 which outlines the designation of Penwith Moors as an SSSI."
        },
        {
            "text": "By Mark Beard - Penwith Moors SSSI designation project manager"
        },
        {
            "text": "At the UN Biodiversity Conference (COP 15) in Montreal just before Christmas, the UK signed up to global targets to protect at least 30% of the world’s land and at least 30% of the global ocean by 2030, and to see natural systems restored, species populations recovering and extinctions halted. The UK government has acknowledged that this will be challenging and will require swift action if it is to be achievable."
        },
        {
            "text": "For more than 70 years Sites of Special Scientific Interest (SSSIs) have safeguarded our most important areas of natural heritage and have a vital role if the UK is to play its part in the COP15 agreement. Penwith Moors in West Cornwall was notified as an SSSI on 07 October 2022 and is the latest addition to the SSSI series. This new SSSI is located in an iconic landscape containing a wealth of historic and archaeological interests and characterised by family-run farms."
        },
        {
            "text": "SSSIs are of national importance for nature. Under the Wildlife and Countryside Act Natural England has a duty to notify as an SSSI any land which in its opinion is of special interest for its flora, fauna, geology or landform. They are designed to conserve sites from damage for the benefit of present and future generations and help to promote appropriate land management to maintain and enhance their value for wildlife. Public funding, such as through agri-environment schemes, is prioritised to support this."
        },
        {
            "text": "At 3,152 ha Penwith Moors is one of the largest expanses of semi-natural habitat in the South West and includes one of the largest areas of lowland heathland habitat in Britain (around 1,200 ha), locally known as rough land. It also supports wetlands, areas of unimproved grassland and a diversity of species including plants, lichens, invertebrates and a breeding population of Dartford warbler. The SSSI also includes enclosed farmland, locally known as clean land, to protect the supply of groundwater to the rare and ecologically sensitive wetland habitats."
        },
        {
            "text": "The responsibility for protecting SSSIs is shared by many, but farmers and other land managers arguably play the most important role in protecting and managing these special places. Away from the coast most SSSIs in England are located in farmed landscapes where farming and the protection of wildlife go hand in hand. Many farmers have benefited from their SSSI status through greater access to funding for sustainable farming practices, enabling nature-friendly farming to be a core part of their farming business."
        },
        {
            "text": "Natural England understands that farmed land fulfils a range of needs beyond its value for nature. Managing SSSIs, such as Penwith Moors, farmers and landowners will have wider considerations relating to their businesses or personal aspirations. Our approach has always been to work with landowners and land managers to help them achieve their business and other aspirations alongside maintaining the special features of the SSSI. At first the SSSI legislation may look daunting, and we are reaching out to the farming community and other interested parties to offer advice on the management of land within Penwith Moors SSSI. We can help to understand what financial support might be available and how to make written representations either in support of, or to object to, the SSSI designation."
        },
        {
            "text": "Penwith Moors SSSI designation is a recognition that this landscape is already rich in nature. By working in partnership with farmers and others we want to secure this rich wildlife heritage for the future. We see opportunities to support nature’s recovery, such as through supporting extensive seasonal cattle grazing on the heathlands and the sympathetic management of enclosed farmland that supplies water into the valley wetlands. Financial support through schemes such as Countryside Stewardship or the forthcoming Environmental Land Management schemes (ELMs) will be a key mechanism in supporting sustainable management of the SSSI alongside securing thriving farm businesses."
        },
        {
            "text": "We understand that landowners and farmers have concerns and questions about the implications of SSSI designation. Experience with other SSSI designations, however, tells us that Natural England, private landowners and the farming community can work together to achieve great outcomes for nature’s recovery for the benefit of everyone."
        },
        {
            "text": "The formal consultation period following the SSSI designation of Penwith Moors runs until 07 February 2023 and written representations regarding the SSSI can be submitted via:"
        },
        {
            "text": "On-line (Citizen Space): https://consult.defra.gov.uk/natural-england/penwith-moors"
        },
        {
            "text": "Email: penwithmoorscornwall@naturalengland.org.uk"
        },
        {
            "text": "By post: Penwith Moors SSSI designation team, Natural England, Polwhele,Truro, TR4 9AD"
        }
    ]
}