{
    "url": "https://onsdigital.blog.gov.uk/2023/01/17/welcome-to-the-ons-digital-data-and-technology-blog/",
    "title": "Welcome to the ONS digital, data and technology blog",
    "authors": [
        "Martin O'Brian"
    ],
    "categories": [
        "ONS digital people",
        "People and skills",
        "Ways of working"
    ],
    "pub_date": "2023-01-17T15:09:27+00:00",
    "content": [
        {
            "text": "Welcome to the new blog for the Digital, Data and Technology (DDaT) community at the Office for National Statistics."
        },
        {
            "text": "Where better to start the first blog than with a statistic? As of March 2022, the Civil Service statistics bulletin shared that there were 20,010 civil servants working in the DDaT profession across government representing 4.2% of all civil servants. A significant workforce with common purpose, functional standards for DDaT, and a shared vision for digital government, generating a huge amount of experience and learning every day."
        },
        {
            "text": "The gov.uk blogs are a great platform to share and celebrate, providing valuable insight into government departments and for those considering a DDaT career in government. (A great example of a recent post that we found most valuable was the design in government blog about designing for people with dyscalculia and low numeracy.)"
        },
        {
            "heading": 2,
            "text": "Sharing makes things better"
        },
        {
            "text": "\"We should share what we’re doing whenever we can. With colleagues, with users, with the world. Share code, share designs, share ideas, share intentions, share failures.\" - Government design principles."
        },
        {
            "text": "There is an ONS digital blog on our website but as avid readers, searchers, and subscribers of gov.uk blogs, we want to share what we do with the widest possible audience and this new blog will help us do that."
        },
        {
            "text": "We’re often in the news, even more so since we’ve started releasing data from the 2021 Census and our DDaT people have tremendous stories to tell of our experiences behind the headlines."
        },
        {
            "text": "The success of the first digital Census in 2021,  shows that large government digital services can be securely delivered in-house using cloud architecture and Agile development, and we’re building on that success, improving and building new digital services to deliver high quality data to inform the UK, improve lives and build for the future.  Indeed, the IDS platform we’re building will be a key part of delivering mission 3 of the government DDaT road map: better data to power decision making."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "You’ll be hearing from people from across the DDaT job family, who are all working on one of the biggest digital estates in government. For example, product managers, data analysts, interaction designers, architects, performance analysts, user researchers, content designers, delivery managers, and business analysts, among others."
        },
        {
            "text": "We’re delighted that we have this platform to share our stories, learnings and successes further.  These will include how we are:"
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We hope this blog will become the first port of call for anybody interested in what the ONS is doing in digital, data and technology.  We’ll be showcasing our career opportunities as well. We’ll be posting regularly, and we hope that you'll contribute your views regularly too."
        }
    ]
}