{
    "url": "https://defradigital.blog.gov.uk/2023/01/17/why-i-enjoy-being-a-mentor/",
    "title": "Why I enjoy being a mentor",
    "authors": [
        "Joya Snowden, Capability Development lead"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-01-17T07:30:43+00:00",
    "content": [
        {
            "text": "On International Mentoring Day, Joya Snowden shares her own mentoring journey, including her motivations for becoming a mentor, how she got started and some tips for finding your own mentor."
        },
        {
            "text": "Have you ever chased your tail, trying to get things done, or hit a brick wall when trying to do certain things?  If you feel that way, you might find it helpful to stop, breathe, and reflect on whether there is another way of going forward.  As Henry Ford and others have said “If you always do what you always did, you'll always get what you always got”."
        },
        {
            "heading": 2,
            "text": "What is mentoring?"
        },
        {
            "text": "Mentoring is learning from others who have had the experience that they are willing to share with you.  With a background in learning and development, education, and training, I suppose I have been mentoring for quite a few years, more than I’d care to mention!  I’ve also had mentors, and have often come out of mentoring sessions inspired and full of ideas."
        },
        {
            "text": "Mentoring offers a safe place to have a conversation, in confidence and without judgement, with someone who is willing to share their experience. Providing an objective view, conversations with a mentor give you different perspectives.  They ask you questions that you may not have considered and provide you with ideas from their own experiences that you might like to explore."
        },
        {
            "heading": 2,
            "text": "Mentoring and coaching are not the same"
        },
        {
            "text": "I realised the value of mentoring when I became a coach, which made me aware of the power of the mind that becomes enlightened through the questions a coach or mentor asks.  A coach does not suggest solutions, rather, through their questioning, thoughts and ideas are triggered to make the coachee resolve their own barriers. A mentor shares their experience with the mentee – a coach would not do that."
        },
        {
            "text": "Some of my mentees have had one off sessions, others four, or six, or more, although four tends to be the most common.  It’s very important to establish the “ground rules” in the initial introductory or chemistry session.  The mentee is responsible for setting the agenda and for arranging the meetings.  They will come up with ideas around what they would like to do next and set actions for themselves.  They are accountable for completing these actions."
        },
        {
            "heading": 2,
            "text": "My role is to help, but not to ‘fix’ problems"
        },
        {
            "text": "One point to stress is that a mentor can’t fix things for the mentee.  The mentor might share resources and provide contacts for the mentee, but the mentee sets the agenda and follows it through.  The mentor does not “rescue” the mentee."
        },
        {
            "text": "Instead, the mentor listens, asks questions, provides options, for example by sharing what has worked for them. The conversation empowers the mentee to view their thinking more objectively and to manage that, rather than reacting to a situation."
        },
        {
            "text": "Discussion topics that have come my way have been around career development, interviews, leadership and management, conflicting relationships at work, and many others."
        },
        {
            "text": "Topics don’t always fall into a “box” so development sessions could include self-perception, confidence, management etc. At the start of the session the mentee calls out what they would like from the session, and what they would like to achieve by the end of it."
        },
        {
            "heading": 2,
            "text": "Mentoring provides two-way benefits"
        },
        {
            "text": "Research by the Chartered Institute of Personnel and Development (CIPD) has shown that those with a mentor progress more rapidly and confidently through their goals.  Mentors benefit too, through their mentoring conversations, as they also get insights from the questions that the mentees ask."
        },
        {
            "text": "I find it personally rewarding when those I mentor “develop wings and fly”. Sometimes it might be a bumpy ride, especially when you’re outside your comfort zone, but that brings rich opportunities to build and grow."
        },
        {
            "heading": 2,
            "text": "How to get started"
        },
        {
            "text": "If you are reading this and thinking that you would like a mentor, look for someone who is good at whatever you would like to do better, and ask them directly if you could have a conversation.  Bear in mind high workloads though, as that person might not have the capacity to be a mentor."
        },
        {
            "text": "Another option is to see if the organisation you work for, or your professional body has a mentoring scheme, as I can through CIPD. Alternatively, it’s worth looking across your own professional networks."
        },
        {
            "text": "There are mentors within Defra. For example, I’m on a Defra mentoring list and I sometimes receive requests through that route.  On the Defra list, colleagues can see pen pictures of mentors, select a mentor, check whether they have the capacity, and then arrange an introductory session with them. If the chemistry works, they continue. If not, they can select another mentor."
        },
        {
            "text": "Bon voyage – there is a big world out there – make the most of the opportunities that mentoring will give you. Good luck."
        }
    ]
}