{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/01/24/achieving-change-in-adult-social-care/",
    "title": "Achieving change in adult social care",
    "authors": [
        "Sarah McClinton"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Communities",
        "Viewpoint"
    ],
    "pub_date": "2025-01-24T15:50:35+00:00",
    "content": [
        {
            "text": "January is always a good time to sort your ‘stuff’ out and before starting my new role, I took the opportunity to clear out my cupboard. It was interesting to see what I had kept over the years from the days when policy documents came in bound hard copy - it is easy to think that some things don’t change! Amongst other papers, I found a CQC special study on hospital discharge from 2004, the 2008 End of Life Care strategy (another hot topic as the Assisted Dying Bill progresses) and from 2009, a vision to reform our care and support system to establish a National Care Service.  Perhaps it is not that things don’t change, rather that knotty challenges take thoughtful, long-term and consistent work to achieve change."
        },
        {
            "text": "The government is launching an independent commission into adult social care, led by Baroness Casey of Blackstock. The Commission, which is expected to begin in April 2025, will recognise the importance of what we do and take the first steps towards delivering a National Care Service."
        },
        {
            "text": "In the meantime, there is lots of innovation happening across the country. We must build on this with shorter term reforms to address the ongoing challenges facing Social Workers and social care leaders. I am keen we work together to use the evidence from practice wisdom, the expertise of people with lived experience, data and research to enable people to live good lives."
        },
        {
            "heading": 3,
            "text": "Starting my role as Chief Social Worker for Adults"
        },
        {
            "text": "We now have vibrant leadership networks of Principal Social Workers, Principal Occupational Therapists, Approved Mental Health Professionals and NHS Mental Health Social Work. Many of you have contributed to a strong legacy of valuable work. Lyn Romeo did a great job over many years in this important role, and I am privileged to be succeeding her, to represent your views within government."
        },
        {
            "text": "I am delighted to be working alongside Robert Lewis as the Mental Health Social Work Lead who has a head-start on me, having joined the Department at the end of August last year.  Since Lyn left, I am grateful for the work Jason Brandon continued."
        },
        {
            "text": "I join DHSC from the Royal Borough of Greenwich where I was the Deputy Chief Executive and Director of Health and Adult Services, an integrated role across the Council and the South East London Integrated Care Board. My journey as a social worker started working with children and families and veered towards adults when, early in my career, I worked with people with HIV/AIDs, who at the time were facing huge stigma, discrimination and usually end of life.  I have over 30 years’ experience of working in local authorities in different roles, both operational and commissioning.  My first DASS role was in Camden, and I served as the President of ADASS. I am returning to DHSC, having worked previously as a civil servant responsible for policy on mental health, learning disabilities, autism and dementia. "
        },
        {
            "heading": 3,
            "text": "Working together to support people who draw on care and unpaid family carers"
        },
        {
            "text": "I am pleased to join the Department at a time when Adult Social Care is gaining prominence. Despite all the difficulties, you all do excellent work day-in-day-out, making a big impact on those who draw on care and their carers.  The difference you make to enabling people to live their lives with the support they need, those in crisis, people at risk of abuse or facing life-changing decisions, cannot be underestimated. "
        },
        {
            "text": "I will work with you and with people with lived experience to understand what matters most to you, to support strengths based, relational practice and champion the impact of social work on people’s lives.  The strong networks I have grown across my career will be vital and I look forward to meeting more people as I get out across the country to hear your experiences. Working with key leaders in the profession, experts by experience and wider colleagues, together, we will drive forward important improvement and reform to support people to live the lives they choose."
        },
        {
            "text": "Whilst every year brings different challenges, I look forward to facing these together and to working closely with you in 2025."
        }
    ]
}