{
    "url": "https://extremismcommission.blog.gov.uk/2025/01/24/commissioner-robin-simcox-visits-southport/",
    "title": "Commissioner Robin Simcox visits Southport",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog",
        "Commissioner opinion"
    ],
    "pub_date": "2025-01-24T09:28:55+00:00",
    "content": [
        {
            "text": "In July 2024, our nation was shattered by the murder of three children in Southport. The perpetrator, Axel Rudakubana, had attempted to kill even more. This week, Rudakubana pleaded guilty to all charges facing him.  "
        },
        {
            "text": "The impact that terrible day will have – especially on the families impacted – will endure. Therefore, as the Prime Minister says, “Britain will rightly demand answers” as to how and why these murders happened. He is right to commit to leaving “no stone unturned in that pursuit.” "
        },
        {
            "text": "In the days following the murders, grief turned to protest, and protests became riots, as the strong emotions evoked by a crime of this nature spilled over into unacceptable acts of violence which then spread across the country.  "
        },
        {
            "text": "Tragedies of this nature will often stir strong emotions and be the flame to a tinderbox of a wider feeling of grievances. However, the answer is not – and never will be – violence, intimidation, and disorder.   "
        },
        {
            "text": "Last week, I visited senior leaders from Sefton council, counter extremism professionals, and community representatives to learn more about how Southport has attempted to recover from the events of last summer.  "
        },
        {
            "text": "I heard a clear, ongoing and admirable desire to tackle racism. The presence of extremist groups or individuals on the ground seeking to recruit others to their cause and inflame tensions is clearly only making that task more challenging. It is also making it even more vital.  "
        },
        {
            "text": "That is because, first and foremost, we must be unflinching in our attempts to combat racism. However, there is an additional component that concerns me. As I warned in a 2023 speech, when the Extreme Right latches onto issues of mainstream concern – in this case, immigration – and filters them through a toxic extremist lens, ultimately making them un-discussable.  "
        },
        {
            "text": "As the Extreme Right looks to undermine trust in our democratic institutions and present themselves as the solution to the issues our nation faces, they cannot be allowed to dominate the discourse on a series of shared public policy questions.   "
        },
        {
            "text": "There was also a shared recognition in Sefton that there were deep-rooted, structural, localised issues that required addressing.  "
        },
        {
            "text": "Clearly, online disinformation was a key factor in the unrest that occurred in Southport. However, this influx of disinformation found fertile ground in some parts of the country more than others.  "
        },
        {
            "text": "Therefore, to be most effective, any governmental response to extremism must be rooted in a keen awareness of the local dynamics at play. It is crucial that government has that awareness – in communities up and down the country, not just Southport – to give it the best opportunity to address local concerns and prevent simmering tensions spilling over into acts of extremist violence. "
        },
        {
            "text": "A governmental response must also understand the drivers of extremism. Over the past two years, the CCE has developed a training package in response to practitioner desire up and down the country to understand more about any threat posed by those with multiple or conflicted ideologies. We will continue to roll out this training package as we undertake our mission to provide independent advice and scrutiny regarding the government’s approach to countering extremism. "
        },
        {
            "text": "As events of this week show, the need is as pressing as it ever was. "
        }
    ]
}