{
    "url": "https://deframedia.blog.gov.uk/2025/01/24/coverage-of-pesticide-emergency-authorisation-being-denied-to-protect-pollinators/",
    "title": "Coverage of pesticide emergency authorisation being denied to protect pollinators",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2025-01-24T12:29:36+00:00",
    "content": [
        {
            "text": "There has been widespread media coverage of the government’s announcement that an application for the emergency use of a neonicotinoid pesticide on sugar beet in England will not be granted."
        },
        {
            "text": "An application for emergency authorisation to use Cruiser SB on the sugar beet crop in England for 2025 to control aphids carrying the virus yellows complex was received from British Sugar and the National Farmers’ Union."
        },
        {
            "text": "Defra took the decision based on robust assessments of environmental, health and economic risks and benefits, and advice from its economists and Chief Scientific Adviser, the Health and Safety Executive and the UK Expert Committee on Pesticides.  "
        },
        {
            "text": "This neonicotinoid is extremely toxic to pollinators, and even at doses that are not directly fatal to bees, it can cause cognitive problems impacting foraging abilities and the productivity of hives.    "
        },
        {
            "text": "The government has provided research funding through the Farming Futures Fund to look at the potential for precision breeding in producing virus-resistant varieties of sugar beet. Defra will continue to help farmers to use Integrated Pest Management (IPM) techniques through the Sustainable Farming Incentive – IPM can help reduce the need for chemical pesticides while boosting crop health and resilience."
        },
        {
            "text": "Publications such as The Times, The Guardian, Evening Standard, Farmers Weekly, Farmers Guardian, Hort Week, Eastern Daily Press and the Express & Star covered the announcement. There was also broadcast coverage on BBC Radio 4 Today and BBC Radio 4 Farming Today."
        },
        {
            "text": "Environment Minister Emma Hardy said:  "
        }
    ]
}