{
    "url": "https://mhclgdigital.blog.gov.uk/2025/01/24/digital-planning-directory-launches-a-milestone-moment-for-the-uks-planning-sector/",
    "title": "Digital Planning Directory launches: a milestone moment for the UK’s planning sector  ",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2025-01-24T11:56:10+00:00",
    "content": [
        {
            "text": "The UK’s planning sector took a major leap forward this week with the launch of the Digital Planning Directory – a ground-breaking new platform set to transform how we access and use digital planning services. "
        },
        {
            "text": "The Directory is a ‘one-stop shop’ for digital planning services, bringing together state-of-the-art tools and resources in one accessible location. It has been designed to meet the diverse needs of all public and private sector stakeholders in planning. "
        },
        {
            "text": "The resource currently contains essential information about almost half of the digital planning service provider market, including their areas of expertise, services, case studies, and contact details. It offers search and filtering functions to facilitate the discovery of tools and expertise that meet specific needs and challenges being faced.  "
        },
        {
            "text": "The Directory has been seed-funded by the Ministry of Housing, Communities and Local Government (MHCLG), and is delivered and managed by the Digital Task Force for Planning, an innovation-led not-for-profit organisation. "
        },
        {
            "text": "It aims to:  "
        },
        {
            "heading": 2,
            "text": "Why is it needed?  "
        },
        {
            "text": "MHCLG's first annual survey of local authority planning capacity and skills, published this month, pinpoints the need for this resource.  "
        },
        {
            "text": "Only 17% of staff said they had the necessary skills/knowledge to identify the right available digital planning tools and just 15% of Local Planning Authorities (LPAs) felt they have the necessary skills and knowledge to source and procure new digital planning tools. "
        },
        {
            "text": "Importantly, as the Digital Task Force for Planning has found, 90% of LPA’s surveyed expressed enthusiasm for a dedicated digital planning resource, to help them identify the right available digital planning tools for their needs, and to make well-informed procurement decisions. "
        },
        {
            "heading": 2,
            "text": "Co-hosted launch event  "
        },
        {
            "text": "This week a joint event took place, hosted by MHCLG and the Digital Task Force for Planning, bringing together this highly innovative sector for the first time and representing a significant milestone in the evolution of the digital planning ecosystem. "
        },
        {
            "text": "Over 100 delegates, including a diverse range of digital planning service providers and key stakeholders from the public, private, and third sectors, gathered at the Local Government Association’s Bevin Hall to commemorate the landmark occasion."
        },
        {
            "text": "The event which was livestreamed to an audience of over 200 viewers, included presentations from (left to right in the picture below) Louise Welham, Innovation Lead, MHCLG; Councillor Adam Hug, Chair of the Local Government Association and Leader of Westminster Council; Dr Wei Yang OBE, CEO, Digital Task Force for Planning; Caroline Crowther, Director Leasehold, Private Rented Sector and Digital, MHCLG; Mick Dunn, Business Development Specialist, Nottingham City Council and Bridget Wilkins, Head of Adoption, Engagement and Innovation, MHCLG.  "
        },
        {
            "heading": 2,
            "text": "What’s next? "
        },
        {
            "text": "Now that the Directory is live, the team is looking to widely promote it and ensure it is well used.  "
        },
        {
            "text": "In addition to company profiles held on the Directory, the collection of case studies on the platform is a key destination for sharing digital planning best practices, and inspiring examples of the art of the possible. Throughout the year, we will host free online themed events with Digital Task Force for Planning based on these case studies, sharing digital planning knowledge and making the Directory a space to watch and a great opportunity to follow.  "
        },
        {
            "text": "We will continue to work together to develop new features and plan regular events to share and promote digital planning best practices across the sector. "
        },
        {
            "heading": 2,
            "text": "Get involved "
        },
        {
            "text": "There are multiple ways to be part of this digital transformation:  "
        }
    ]
}