{
    "url": "https://mhclgmedia.blog.gov.uk/2025/01/24/public-accounts-committee-report-on-homelessness/",
    "title": "Public Accounts Committee report on homelessness",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2025-01-24T12:29:02+00:00",
    "content": [
        {
            "text": "Today the Public Accounts Committee published a report on homelessness, with several recommendations to the government to build a cross-government strategy to tackle homelessness and invest in preventive measures. This was featured in PA media, Sky News, The Independent and Big Issue."
        },
        {
            "text": "The government has announced nearly £1 billion of new funding for councils this year, with a record investment in preventative services to get the country back on track to tackle, reduce and prevent homelessness and rough sleeping."
        },
        {
            "text": "This will mean more resources for workers on the frontline who provide essential services to get rough sleepers off the street and into secure housing as well as seeing more homeless families out of temporary accommodation."
        },
        {
            "text": "The Deputy Prime Minister is chairing the first cross-government group on tackling homelessness, which will develop a long-term strategy to tackle all forms of homelessness, bringing together the healthcare, justice and education systems. "
        },
        {
            "text": "This is alongside government investment in housing increasing to £5 billion for this year, including an extra £500 million for the existing Affordable Homes Programme to build tens of thousands of new affordable and social homes across the country."
        },
        {
            "text": "Through overdue reforms to the Right to Buy scheme councils can now retain all receipts from sales to build and buy more homes as well as receiving an additional £450 million last year to secure and create homes for families at risk of homelessness.  "
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "“These figures are completely unacceptable and demonstrate the devastating homelessness crisis we have inherited."
        },
        {
            "text": "“This is why we are taking urgent and decisive action to end homelessness for good, including committing £1 billion in additional support for homelessness services and address the use of emergency accommodation."
        },
        {
            "text": "“We’re talking the root causes of homelessness, committing in our Plan for Change to build 1.5 million new homes, which includes building the social and affordable homes this country needs, and are changing the law to abolish Section 21 ‘no fault’ evictions – immediately tackling one of the leading causes of homelessness.”"
        }
    ]
}