{
    "url": "https://civilservice.blog.gov.uk/2026/02/17/a-snapshot-of-lunar-new-year-celebrations-in-east-south-east-asia/",
    "title": "A Snapshot of Lunar New Year Celebrations in East & South East Asia",
    "authors": [
        "Aggie Michael"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-02-17T09:37:12+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Ministry of Housing, Communities and Local Government civil servant Aggie Michael shares the meaning of the Lunar New Year on 17 February, drawing parallels between the Chinese Zodiac and traditional Civil Service values."
        },
        {
            "text": "This February, I’ll be joining the largest human migration on Earth, travelling home to celebrate the Lunar New Year. In 2025, an estimated 3 billion journeys were made globally for Chun Yun (Spring Travel)."
        },
        {
            "text": "Lunar New Year is the biggest festival celebrated by people of East Asian heritage, though it goes by different names across different cultures. In Mongolia, it’s Tsagaan Sar, in Korea – Seollal, in Vietnam, Tết Nguyên Đán. Thailand, Malaysia, Singapore, the Philippines and Indonesia refer to it as Chinese New Year, while Taiwan and China call it Spring Festival."
        },
        {
            "text": "The day shifts each year, usually falling on the second new moon after the winter solstice (Dong-Zhi), reflecting the lunar calendar traditionally used across Asia to guide agriculture and festivals."
        },
        {
            "heading": 3,
            "text": "Renewal, family reunion, and welcoming prosperity"
        },
        {
            "text": "The festival centres on sweeping out the old and inviting good fortune, health, and happiness for the year ahead. Families gather for traditions like deep house cleaning, feasts, ancestor worship and vibrant decorations. "
        },
        {
            "text": "I’m Chinese on both sides – born in Singapore to a Singaporean Father and Malaysian Mother. Both sets of grandparents left China and settled in Malaya in the early 1900s. Chinese New Year has always been a big deal in my household. "
        },
        {
            "text": "Festivities begin with Reunion Dinner on New Year’s Eve, when everyone who lives or works away returns home. My Dad was a sailor, often away for months, so having him at the table always felt special. "
        },
        {
            "text": "We’d present food at the ancestors’ altar first, offering prayers of thanks. Then we’d stay up late, turn up the radio, sing along to New Year tunes, throw crackers and watch fireworks on TV. "
        },
        {
            "text": "According to Chinese legend, a beast called Nian emerged at midnight to wreak havoc, but was scared away by loud noises and the colour red – hence firecrackers, lion dances and red decorations. Celebrations end on the 15th day, Yuan-Xiao (the Lantern Festival), when riddles and poems are written on lanterns and displayed in public gardens for all to enjoy."
        },
        {
            "heading": 3,
            "text": "Chinese Zodiac and Civil Service values"
        },
        {
            "text": "The Chinese zodiac’s 12 animal signs embody distinct traits that resonate with qualities we value in the Civil Service. The Snake symbolises wisdom, the Ox represents perseverance and diligence, and the Dog stands for loyalty and reliability. "
        },
        {
            "text": "2026 is the Year of the Horse, associated with integrity and energy – qualities that mirror the Civil Service Code’s core values of integrity, honesty, objectivity and impartiality. As we enter the New Year, it’s a fitting moment to reflect on how these ancient traditions align with our commitment to public service with both purpose and principle."
        },
        {
            "text": "Xin Nian Kuai Le – Happy New Year – and Shēn Tǐ Jiàn Kāng – Good Health to all!To join the East and South East Asian (ESEA) Working Group, or to learn more about ESEA Working Group’s Lunar New Year events across the UK, email stuart.sanders@dhsc.gov.uk"
        }
    ]
}