{
    "url": "https://opss.blog.gov.uk/2026/02/17/driving-pro-consumer-regulatory-reform-in-partnership-with-asean/",
    "title": "Driving Pro-Consumer Regulatory Reform in partnership with ASEAN",
    "authors": [
        "The Evaluation and Research Team"
    ],
    "categories": [
        "OPSS Research Insights"
    ],
    "pub_date": "2026-02-17T12:00:07+00:00",
    "content": [
        {
            "heading": 4,
            "text": "This blog post explores how recent research from OPSS is contributing to shaping inclusive economic growth in the Philippines."
        },
        {
            "text": "The Office for Product Safety and Standards (OPSS) is the UK's national product regulator, yet our commitment to research and impact extends far beyond our borders. Through The Association of Southeast Asian Nations (ASEAN)-UK Economic Integration Programme (EIP), OPSS is leading on work to foster economic growth and tackle development barriers alongside ASEAN member states. "
        },
        {
            "heading": 2,
            "text": "Delivering Change through the Role of OPSS in the Regulatory Reform Pillar"
        },
        {
            "text": "As the delivery lead for the Regulatory Reform Pillar (RRp) within the four-year UK-ASEAN Economic Integration Programme, OPSS has recently undertaken research to identify best practices for establishing pro-consumer institutional frameworks in the Philippines. The research reviews current challenges, the  role of consumer organisations, issues in e-commerce and offers tailored recommendations to empower consumers and build safer markets. This work is informing the design, implementation, and evaluation of reforms that put consumers first. This has also guided the development of a Philippines specific implementation toolkit, to support translating these recommendations into practical action."
        },
        {
            "heading": 2,
            "text": "Why focus on the Philippines?"
        },
        {
            "text": "OPSS has been involved in research to support the broader ASEAN economic community. This research focused on the Philippines as according to the ASEAN Consumer Empowerment Index (ACEI) 2020, consumer awareness and access to redress mechanisms in the country remain moderate. As the Filipino government expressed a desire to better engage with consumer organisations and to improve consumer empowerment scores, this research aims to strengthen consumer protection in the Philippines."
        },
        {
            "heading": 2,
            "text": "What did the research find?"
        },
        {
            "text": "The research provides key recommendations for the Philippines government to support consumers in the region, including:"
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "Following publication of the research, this March OPSS will support a formal launch event for the research and accompanying toolkit. This event will be for the relevant government agencies as well as consumer organisations representing all 17 provinces across the Philippines. This activity will socialise findings and seek commitment from stakeholders to implement recommendations."
        },
        {
            "heading": 2,
            "text": "A shared vision for inclusive growth"
        },
        {
            "text": "UK Ambassador to ASEAN, Helen Fazey, reflected on the wider context of the research:"
        },
        {
            "heading": 3,
            "text": "Interested in learning more?"
        },
        {
            "text": "Read the full research report to discover how OPSS and its partners are shaping a more equitable future for consumers across Southeast Asia. You can also check out our other research publications, including on gender inclusive regulatory reforms, here. "
        },
        {
            "heading": 3,
            "text": "Are you passionate about consumer rights or working within the ASEAN community?"
        },
        {
            "text": "Please share this blog post with your network to spark conversations."
        },
        {
            "heading": 3,
            "text": "Want to be kept up to date with other OPSS research and activities?"
        },
        {
            "text": "Subscribe to our monthly newsletter by emailing ‘opssnews@businessandtrade.gov.uk’ with the subject 'Subscribe to OPSS News'  "
        },
        {
            "heading": 3,
            "text": "Any questions?"
        },
        {
            "text": "Email OPSS.Research@businessandtrade.gov.uk"
        }
    ]
}