{
    "url": "https://defrafarming.blog.gov.uk/2026/02/17/help-shape-the-farmer-collaboration-fund/",
    "title": "Help shape the Farmer Collaboration Fund",
    "authors": [
        "Alice Brown"
    ],
    "categories": [
        "Ways to get involved"
    ],
    "pub_date": "2026-02-17T12:17:07+00:00",
    "content": [
        {
            "text": "Through the Farmer Collaboration Fund, government wants to support farmers and land managers to turn best practice into common practice by making it easier for them to share knowledge with each other. "
        },
        {
            "text": "We’re inviting farmers and land managers to hear our latest plans and share their thoughts at a series of in-person workshops.  "
        },
        {
            "heading": 2,
            "text": "Working together for better outcomes"
        },
        {
            "text": "Working together can help reduce costs, spread risk, upskill people and inform better business planning."
        },
        {
            "text": "It enables those who manage the land to test new approaches collectively, share evidence about what works, and access opportunities that are difficult to reach alone. "
        },
        {
            "text": "Across the country, farmers and land managers are already joining forces to tackle challenges and seize opportunities beyond the farm gate. "
        },
        {
            "text": "Neighbouring holdings are working as one to improve soil and water management across whole catchments, coordinating action along rivers that run through multiple farms. "
        },
        {
            "text": "By sharing knowledge and pooling resources, they can make more targeted, cost-effective decisions that benefit their own businesses as well as the wider landscape. "
        },
        {
            "text": "Collaboration also strengthens their position when seeking private investment. Groups can make a clearer, more compelling case for support for outcomes like cleaner water, nature recovery and carbon storage – funding that is far harder to secure farm by farm. "
        },
        {
            "text": "Others are restoring hedgerows and habitat networks at scale, reconnecting wildlife corridors and creating more resilient landscapes. In some places, groups are pooling data and effort to test new approaches, share what is working and what is not, and reduce risk for individual businesses."
        },
        {
            "text": "This collective learning helps them to upskill, adopt new practices with confidence and build more robust long-term plans. "
        },
        {
            "text": "Over the next 3 years, the £30 million fund will support these existing networks and help new ones get started, so more can benefit from shared expertise, stronger bargaining power and better business resilience. "
        },
        {
            "heading": 2,
            "text": "Join our workshops"
        },
        {
            "text": "The in-person workshops will begin with a short presentation from our team to talk through our thinking, then we’ll move into a guided workshop discussion."
        },
        {
            "text": "Each event lasts 2 hours, and refreshments will be provided."
        },
        {
            "text": "Places are limited, so if you’re interested in a practical discussion and sharing your views, we encourage you to register."
        },
        {
            "text": "We look forward to seeing you there!"
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming Blog"
        },
        {
            "text": "To keep up to date as plans develop, and for future opportunities to work with us, subscribe to the Farming Blog for the latest updates. "
        }
    ]
}