{
    "url": "https://environmentagency.blog.gov.uk/2026/02/17/launching-blueprint-expanding-citizen-science-across-englands-waterways/",
    "title": "Launching BluePrint: Expanding citizen science across England's waterways ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Citizen Science",
        "Fisheries and biodiversity",
        "Rivers",
        "Science",
        "Sustainability",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2026-02-17T12:24:00+00:00",
    "content": [
        {
            "text": "We’re delighted to announce the launch of a new digital tool that lets you report on the health of your local rivers, lakes and beaches in real-time, directly from your phone. "
        },
        {
            "text": "BluePrint, developed by the Environment Agency in partnership with Hello Lamp Post, builds on the success of WaterWatch - a year-long pilot that gathered public observations at five bathing water sites. Now, the concept is going national. "
        },
        {
            "text": "Shared views on shared environments England's waterways are constantly changing. While the Environment Agency carries out extensive monitoring, measurements alone can't capture how these changes are felt by the people who swim, walk and paddle there. "
        },
        {
            "text": "That's where you come in. We're working with citizen scientists to gather insights from communities who visit their local waters most often -perspectives that can help us spot changes earlier and support more responsive environmental decision-making. "
        },
        {
            "text": "To build this richer picture of people’s experiences, we are continuing our partnership with Hello Lamp Post and developing their digital AI tool, in our new pilot project BluePrint. The new national digital conversation tool will allow the public to share real‑time observations from rivers, lakes, beaches and streams anywhere in England. It builds on the success of WaterWatch, a site‑based pilot that used QR signs to engage people at five bathing water locations between October 2024 and October 2025. Their input gave us unique insights into water clarity, levels of activity and visible signs of pollution. "
        },
        {
            "text": "BluePrint expands the concept from five sites to pilot a national, remote‑access tool, ensuring anyone can participate without needing to locate a sign, giving us a way to hear directly from people whenever they are out enjoying their local waters, and helping us understand how places are being used and what changes people are noticing.  "
        },
        {
            "text": "What is the BluePrint pilot?  "
        },
        {
            "text": "Unlike the WaterWatch pilot, BluePrint does not rely on physical signs and QR codes at set locations. Instead, BluePrint will be testing the use of geolocation so you can share your observations from any river, lake, beach or stream, anywhere in England. "
        },
        {
            "text": "With BluePrint, you can record information such as water clarity, how many people are in or near the water, what activities are taking place, and any visible signs of pollution. The platform also brings in live Environment Agency data, including pollution risk forecasts, tidal heights and river gauge levels. You can then ask any questions about local environmental conditions or the Environment Agency’s work. "
        },
        {
            "text": "Running from February to July 2026, this project aims to create a clearer national picture of how our waterways are used, supporting our ongoing monitoring and helping strengthen our response to environmental pressures. "
        },
        {
            "text": "What we learned from you "
        },
        {
            "text": "WaterWatch was our first step in exploring how people’s experiences can add value to our environmental work. This year-long pilot invited people at five bathing water sites across England to share simple observations about local conditions through Hello Lamp Post. Their input gave us unique insights into water clarity, levels of activity and visible signs of pollution. "
        },
        {
            "text": "By working with local citizen science groups, we were able to increase the amount of data we received, with some groups taking part in the conversation on a regular basis. This helped to highlight issues such as seaweed accumulation and dog waste, which can affect water quality. "
        },
        {
            "text": "WaterWatch is now expanding to seven locations and will continue until July 2026. Existing signage will remain in place at the River Nidd, the Ribble at Edisford Bridge and Lake Windermere, while new signage is being introduced at the River Teme, the River Dart and additional sites in London and Worthing. New features, including photo uploads with automatic anonymisation, will further enhance the quality of the citizen generated data. "
        },
        {
            "text": "Get involved "
        },
        {
            "text": "Anyone can take part! Simply use BluePrint on your phone from any river, lake, beach or stream to share real-time information.  "
        },
        {
            "text": "To find out more about WaterWatch, head to one of our selected Bathing Waters and scan the QR code on the Hello Lamp Post signs and share your observations.  "
        },
        {
            "text": "Together, BluePrint and the expanded WaterWatch network will open up more opportunities than ever for the public to engage with environmental protection. With national coverage, real-time data integration and enhanced functionality, these projects will support better decision-making and help the Environment Agency respond more effectively to environmental challenges. "
        },
        {
            "text": "To learn more about the Environment Agency’s citizen science work and how to get involved, please visit our WaterHub page. "
        }
    ]
}