{
    "url": "https://charitycommission.blog.gov.uk/2026/02/17/ramadan-and-lent-celebrating-generosity-protecting-good-intentions/",
    "title": "Ramadan and Lent: Celebrating generosity, protecting good intentions",
    "authors": [
        "David Holdsworth, Chief Executive Officer"
    ],
    "categories": [
        "Safer giving"
    ],
    "pub_date": "2026-02-17T09:42:34+00:00",
    "content": [
        {
            "text": "As Ramadan begins for Muslims - and as many Christians observe Lent, another period of reflection, fasting and charitable giving - I want to start with a simple message: thank you."
        },
        {
            "text": "The generosity of Britain's faith communities is extraordinary. Every year, millions of pounds are donated during Ramadan – a remarkable contribution that speaks to the deep-rooted traditions of zakat and sadaqah, and to the commitment of millions of people to help those in need."
        },
        {
            "text": "Similarly, we know that for many Christians, Lent is a time where money is diverted from some of life’s luxuries towards charitable giving."
        },
        {
            "text": "This generosity should be celebrated by everyone, as it provides a genuine lifeline to people facing hardship, supporting charities that work locally, nationally and overseas. As I heard vividly at the Muslim Charities Convention last summer, money raised during Ramadan funds food banks, supports refugees, provides clean water, and sustains countless other vital causes. It represents something profoundly good about our society."
        },
        {
            "text": "And it is precisely because religiously motivated giving matters so much that I want to talk about protecting it."
        },
        {
            "text": "Keeping good intentions on track"
        },
        {
            "text": "The reality is that most fundraising is genuine. Whatever time of year it is, the vast majority of appeals comes from legitimate, hardworking charities doing important work."
        },
        {
            "text": "But we know that criminals and fraudsters try to take advantage of times of increased giving, so we all need to be vigilant. They set up fake charities, create convincing but fraudulent websites, and send messages designed to divert your generosity into their own pockets."
        },
        {
            "text": "This isn't about casting suspicion on donors or on the thousands of wonderful, genuine charities serving communities. It's about making sure that when you give – with the sincere intention of helping others – your money actually reaches those you want to help."
        },
        {
            "text": "That's why we are working closely with the Muslim Charities Forum and the Fundraising Regulator to raise awareness of this risk and how to avoid being caught out. Together, we want to ensure that the incredible generosity shown during religious seasons has the greatest possible impact."
        },
        {
            "text": "As Fadi Itani, CEO of the Muslim Charities Forum says, “British Muslims give generously throughout the year, especially during the month of Ramadan, to UK and international causes. Giving intentionally helps maximise spiritual reward and ensure donations make the greatest impact. Checking a charity’s registration and how you donate helps support genuine, effective organisations.”"
        },
        {
            "text": "A few simple safer giving steps"
        },
        {
            "text": "The good news is that giving safely doesn't require complicated checks. A few straightforward steps can make all the difference:"
        },
        {
            "text": "For more information, visit our Donate with Confidence campaign website."
        },
        {
            "text": "Making generosity go further"
        },
        {
            "text": "Our focus is about ensuring that when you give, whoever you are and whatever time of year it is, your donation has the impact you intend. By taking these simple steps, you help ensure that your donations reach those who need them most."
        },
        {
            "text": "To everyone observing Ramadan, I wish you a blessed and peaceful month. And to everyone who gives – whether during these religious seasons or at any time of year – thank you. Your generosity strengthens our society and improves lives. We at the Charity Commission are here to help protect that good work."
        },
        {
            "text": "For more information visit our Donate with Confidence website or check the charity register."
        }
    ]
}