{
    "url": "https://earlyyears.blog.gov.uk/2026/02/17/what-to-know-before-applying-to-register-with-ofsted-choosing-names-for-your-childcare-setting-and-legal-entity/",
    "title": "What to know before applying to register with Ofsted: choosing names for your childcare setting and legal entity",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Childminder registration",
        "Early years",
        "Nannies",
        "Registration"
    ],
    "pub_date": "2026-02-17T09:40:18+00:00",
    "content": [
        {
            "text": "Selecting a name for your childcare business is an important early decision. Getting this right from the outset helps us process your application more quickly and limits the need for follow-up questions. "
        },
        {
            "text": "In this blog, we explain what your legal entity name means for your Ofsted registration, how this differs from the name you give to your childcare setting and the common points providers ask us about when registering. "
        },
        {
            "heading": 2,
            "text": "Naming your legal entity "
        },
        {
            "text": "Your legal entity name is the official name of the organisation that is legally responsible for the childcare you provide. This could be a company, a charity, a committee, a partnership or a sole trader. "
        },
        {
            "text": "Examples might include Oakbridge Childcare Services Ltd for a company or Oakbridge Childcare Services CIO for a charity. Sole traders will usually register in their own name but may operate under a different business name, such as Joe Bloggs trading as Little Stars Childcare. "
        },
        {
            "text": "If a subcommittee will run the childcare provision on behalf of the legal entity, its name must make that clear, for example Oakbridge Childcare Services CIO Subcommittee. "
        },
        {
            "heading": 2,
            "text": "Naming your childcare setting "
        },
        {
            "text": "Your setting name is the name that parents, children and your local community will recognise. It refers to the specific location where childcare is delivered, such as your nursery or pre-school. "
        },
        {
            "text": "Your setting name must be different from your legal entity name. For example, if your company is registered as Bishopsgate House Childcare Group Ltd, your settings cannot also be called Bishopsgate House Childcare Group Ltd. Instead, you might use names such as Bishopsgate House Nursery Prestbury or Bishopsgate House Nursery Pittville. "
        },
        {
            "text": "Each setting should have its own unique name and it must not be offensive, discriminatory or inappropriate. "
        },
        {
            "heading": 2,
            "text": "Understanding the difference "
        },
        {
            "text": "When you apply to register with Ofsted, you can register either as an individual (a sole trader) or as an organisation. Whichever you choose, that individual or organisation becomes the registered person responsible for providing childcare. "
        },
        {
            "text": "Your legal entity will be given a unique reference number (URN) which is different to your setting’s URN. If you have more than one setting, each individual setting will also have its own URN.  "
        },
        {
            "heading": 2,
            "text": "Settings in shared facilities "
        },
        {
            "text": "Some childcare providers work from shared buildings such as children’s centres, schools or community hubs. If this is the case for you, it is worth thinking carefully about the name you choose. Using the exact same name as the building can sometimes create confusion for families and for Ofsted when we review your application. "
        },
        {
            "text": "A name that is linked to the building but clearly identifies your own provision can help people understand who you are and what you offer. "
        },
        {
            "text": "For example, if your daycare provision is based inside a children’s centre called Hollywood House, you might choose something like "
        },
        {
            "text": "You do not have to use a different name. However, adding something that distinguishes your provision can make it easier for families to recognise you and can help us process your application more smoothly. "
        },
        {
            "heading": 2,
            "text": "Naming rules set by other bodies "
        },
        {
            "text": "Your chosen name will also need to comply with rules set by other regulatory bodies. "
        },
        {
            "text": "Some words are considered sensitive and can only be used with approval from the relevant authority. Companies House publishes a list of these sensitive words and explains how to apply for approval if you need it. "
        },
        {
            "heading": 2,
            "text": "Registering with Ofsted as a group or school-based provider "
        },
        {
            "text": "Once you have selected suitable names for both your setting and your legal entity, you can apply to register your nursery, pre-school or out-of-school-setting with Ofsted. "
        },
        {
            "heading": 2,
            "text": "Registering with Ofsted as a childminder or nanny "
        },
        {
            "text": "Childminders and nannies can only register with Ofsted as individuals. You can set up a company for business purposes if you choose to, but your Ofsted registration will still be in your own name. Any company you create will not appear on the Ofsted website because it is not the registered legal entity for the childcare. "
        },
        {
            "heading": 2,
            "text": "After you are registered "
        },
        {
            "text": "If you operate in a non-domestic building, your setting name and address will be published on Ofsted’s reports website so that parents can find inspection reports and other information about your setting. For childminders and providers operating on domestic premises, this information is only published if you have consented to this either during registration or afterwards, because it relates to a home address. "
        },
        {
            "text": "Once you are registered, you must tell Ofsted about certain changes, including changes to your setting or legal entity’s name. You can tell us that your name has changed by emailing us on enquiries@ofsted.gov.uk. You must have officially changed your name with Companies House, HMRC or the Charity Commission before notifying us. "
        },
        {
            "text": "If your organisation changes in a way that creates a new legal entity, such as receiving a new company or charity registration number, you must apply for a new Ofsted registration. "
        }
    ]
}