{
    "url": "https://ukhsa.blog.gov.uk/2022/02/11/a-career-in-science-past-present-and-future/",
    "title": "A career in science - past, present and future",
    "authors": [
        "Vicki Chalker"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2022-02-11T10:07:41+01:00",
    "content": [
        {
            "text": "I was told aged 13 that I should consider becoming a biology teacher by my school careers advisor."
        },
        {
            "text": "Biology was one of my favourite lessons and this planted the seed that I could go on to study it in higher education."
        },
        {
            "text": "I was the first in my family to go into science and knew little about the career path so I chose to do a Biology deferred choice degree – this let me study many topics from psychology to mycology, and then decide after one year what to specialise in."
        },
        {
            "text": "I chose medical microbiology as it was the topic I liked the most. I loved pathogens and learning about them and what they do."
        },
        {
            "text": "Following my degree I did a PhD that took me to Sweden and then worked for the Royal Veterinary College discovering pathogens causing disease in animals."
        },
        {
            "text": "After this I moved to work in external quality assessment for microbiology and now I am part of the UK Health Security Agency where my work has included respiratory and sexually transmitted pathogens and supporting outbreaks including the pandemic response."
        },
        {
            "text": "This all sounds quite varied and it has been!"
        },
        {
            "text": "Starting out things were not always easy. The reality of my home life after university meant I had no fixed address, so I accepted the first role I was offered."
        },
        {
            "text": "Financial restraints I faced meant I focused my search where I could easily get to the interview and communicate with the employers - mobile phones were not common at that time and telephone interviews very unusual. I was 25 before I got my first mobile!"
        },
        {
            "heading": 3,
            "text": "The people and networks that shape a life in science"
        },
        {
            "text": "I have worked with some amazing and inspirational people from all over the world, which is one of the privileges of being a scientist."
        },
        {
            "text": "For example, at the moment, I am mentoring a junior scientist in Ghana, implementing antibiotic resistance screening and surveillance in his hospital and applying for grants and I even taught him to play tennis when he visited the UK (he was astoundingly good for a first ever player)."
        },
        {
            "text": "Something that has been a long-term project for me is setting up networks. I often think of my role as a connector, signposting individuals and teams to others to progress work together. I enjoy working with the different groups we have, helping where I can to advocate for positive change."
        },
        {
            "text": "At UKHSA I work with several networks such as the outreach network, women in science and engineering network, bioinformatics network and more. On a wider scale I Chair for the Government Science and Engineering Team the Diversity and Inclusion Action Group Board. As part of this work we are connecting networks across government, working to improve the diversity within STEM."
        },
        {
            "text": "One network I am really proud to have helped establish is the social mobility group within government science and engineering diversity and inclusion action group. There is huge disparity in this country for young people and the more we can support talent into science and engineering the better for the future workforce and society."
        },
        {
            "text": "We should be embracing neurodiversity in our recruitment methods and teams going forward and there is so much more we can do to help welcome people into our profession."
        },
        {
            "heading": 3,
            "text": "Women in science"
        },
        {
            "text": "There was not really support for women specifically when I started out."
        },
        {
            "text": "I have experienced difficulties over the years and I think it is important that women are able to talk about situations such as sexism, micro-aggressions and pay inequality. Some of the behaviours I have faced in the past like sexism are certainly not specific to just science but are unacceptable."
        },
        {
            "text": "Equity is vitally important for the future of science professions and something I am proud to champion."
        },
        {
            "text": "I have met and worked with many women scientists and I strive to make sure that women and girls see the future of science as positive, exciting and full of potential, which I truly believe it is. The next generation of scientists are entering into a time of incredible innovation and opportunities."
        },
        {
            "text": "To women, girls and all young people considering a career in science I’d say please do go for it – we need you, your enthusiasm and your skills. Organisations like UKHSA can help build interesting and rewarding careers where you really feel you are making a difference."
        },
        {
            "heading": 3,
            "text": "Guiding a profession"
        },
        {
            "text": "The Head of Science and Engineering Professions Role is really important for UKHSA. It gives colleagues a voice to highlight things of importance to those at the top when needed and helps us link our work internally and externally."
        },
        {
            "text": "Within UKHSA we have a Heads of Professions group which meets regularly. I have been pleased over the past few years to be able to listen to colleagues and implement more support wherever we can."
        },
        {
            "heading": 3,
            "text": "The future is bright"
        },
        {
            "text": "I have many creative ideas I’d love to pursue with colleagues and I am full of enthusiasm for the future and the work that future scientists will be able to do to promote our profession and assist others to follow their passion. Scientifically I have a list of future projects as long as my arm I would like to progress, including developing a PhD student project into a product for use. I would like to see improvements in childhood and maternal infection and am looking forward to seeing UKHSA's climate change work progress."
        },
        {
            "text": "The future scientists will be more highly skilled than my generation. Ingenuity, novel ideas and better data linkage, learning and implementation will all come from the younger generation. I think going forward people would like greater career flexibility regarding home working and hours of work. However, there will still be those that love to be in the lab working with real samples and systems to help society."
        },
        {
            "text": "I learn a lot from younger people I work with. They keep me in check and challenge me. I am in constant awe of their brilliance, skill and their natural ability to come together in challenging times. The support provided to the pandemic by our junior scientists has been huge."
        },
        {
            "heading": 3,
            "text": "Resources for shaping careers"
        },
        {
            "text": "There are so many varied science careers within government and UKHSA. As part of the GSE Profession diversity and inclusion strategy, we in UKHSA are working with other government partners to increase the diversity of evidence and expertise used and to  develop a diverse STEM talent pipeline."
        },
        {
            "text": "UKHSA  contributes submissions to the All-Party Parliamentary Group on Diversity and Inclusion in Science, Technology, Engineering and Maths (STEM) which aims to promote the inclusion and progression of people from diverse backgrounds in STEM, and to encourage government, parliamentarians, academics, businesses and other stakeholders to work towards a STEM sector that is representative of the population."
        },
        {
            "text": "I don’t think there could be a better time to get into science than now. There is so much happening and that needs to happen to assist current and future populations."
        }
    ]
}