{
    "url": "https://planninginspectorate.blog.gov.uk/2022/02/11/apprenticeships-at-the-planning-inspectorate/",
    "title": "Apprenticeships at the Planning Inspectorate",
    "authors": [
        "Duncan Phillpotts"
    ],
    "categories": [
        "Equality Diversity and Inclusion",
        "People",
        "Public service",
        "Recruitment"
    ],
    "pub_date": "2022-02-11T11:07:18+00:00",
    "content": [
        {
            "text": "This week is the 15th annual National Apprenticeship Week, a celebration of the exceptional work being done by employers and apprentices across the country, highlighting the positive differences that apprenticeships can make to individuals, employers and to the wider economy."
        },
        {
            "heading": 3,
            "text": "The Planning Inspectorate Apprenticeship Programme"
        },
        {
            "text": "The basic principles of the Planning Inspectorate’s approach to apprenticeships are:"
        },
        {
            "text": "To ensure a successful apprenticeship experience the approach also highlights the requirements of the apprentice, the role of the line manager and the responsibility of the training provider and how we can measure this success."
        },
        {
            "heading": 3,
            "text": "Chartered Town Planners Apprenticeship"
        },
        {
            "text": "This week also celebrates the first anniversary of our initial intake of Chartered Town Planners Apprentices."
        },
        {
            "text": "Ken Taylor is a Planning Inspector and the Chartered Town Planner Apprentice Manager."
        },
        {
            "text": "Apprentice Sarah said:"
        },
        {
            "text": "Max said:"
        },
        {
            "text": "Maddie said:"
        },
        {
            "heading": 3,
            "text": "My HR apprenticeship"
        },
        {
            "text": "Recruitment Support Officer Elizabeth details her apprenticeship experience with the Planning Inspectorate."
        },
        {
            "text": "Since graduating in English and History from the University of Southampton, I have worked in law, administration and internationally as an English Teacher and au-pair in Thailand and Australia respectively."
        },
        {
            "text": "I chose the apprenticeship route because I wanted to gain further qualifications while earning an income. The apprenticeship scheme offered by the Planning Inspectorate appeared beneficial for the opportunity to gain exposure to different HR functions through shadowing colleagues."
        },
        {
            "text": "I have recently achieved my HR Support Level 3 Chartered Institute of Personnel and Development (CIPD) qualification through my apprenticeship at the Planning Inspectorate. The apprenticeship is 16 months long, however the CIPD qualification can be achieved within 12 months. I have one day per week (20% of my contracted working hours) dedicated towards my study. I have used this time to complete module reading, arrange meetings with my academic tutor and work on assessment material where required."
        },
        {
            "text": "The apprenticeship has helped achieve my goal of pursuing a career in HR; since gaining my CIPD qualification, I have obtained a promotion to an executive officer position with the recruitment team. The scheme allowed me to gain the core skills necessary to perform in this role – gaining this experience would not have been possible through academic study alone."
        },
        {
            "text": "I would recommend an apprenticeship at the Planning Inspectorate for several reasons. Firstly, the work-life balance is very good with every effort being made to promote employees’ wellbeing. The structure of my apprenticeship has also been well-considered. My line manager has allocated me work gradually to align with my apprenticeship goals. I have not felt overloaded but instead introduced to new tasks in a steady, progressive manner. This has contributed to an overall positive apprenticeship experience."
        },
        {
            "heading": 3,
            "text": "Want to find out more?"
        },
        {
            "text": "The Planning Inspectorate is an employer with a supportive culture. If you would like to find more about apprenticeship opportunities at the Planning Inspectorate please contact Duncan Phillpotts, Recruitment Officer – Apprenticeships and Outreach at pins.recruitment@planninginspectorate.gov.uk."
        }
    ]
}