{
    "url": "https://educationhub.blog.gov.uk/2022/02/11/dr-alex-georges-five-top-tips-for-good-mental-health-and-wellbeing/",
    "title": "Dr Alex George's five top tips for good mental health and wellbeing",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Families",
        "Mental Health"
    ],
    "pub_date": "2022-02-11T14:48:29+00:00",
    "content": [
        {
            "text": "To help mark Children’s Mental Health week, Dr Alex George, the Government’s Youth Mental Health Ambassador has set out his top five tips top tips for good mental health and wellbeing."
        },
        {
            "heading": 3,
            "text": "Get outside "
        },
        {
            "text": "It’s so important that you get out and get some natural light. We often spend so much time indoors (often staring at a screen) but natural light can really lift our moods. Getting out for a walk and getting fresh air in our lungs can help us to feel better."
        },
        {
            "heading": 3,
            "text": "Movement"
        },
        {
            "text": "It’s easy to feel like you can’t be bothered to be active but we know that moving around helps us to feel better. Making time in our daily routines for a 20-minute workout at home, a spot of gardening, or a walk outside with some music, a podcast, friends or family can make all the difference. It boosts blood flow to your brain and increases the happy hormones, endorphins, to make us feel good."
        },
        {
            "heading": 3,
            "text": "Call a friend "
        },
        {
            "text": "I know how frustrating it’s been over the last year not being able to hang out with mates and do the things you enjoy, but we can use tech to help us. Pick up your phone, have a video call. It feels good to open up and share how you’re feeling with your friends. They’re probably feeling the same way. I always make sure I call at least one friend a day. It can really make their week!"
        },
        {
            "heading": 3,
            "text": "Eat well"
        },
        {
            "text": "It’s not always easy to keep up a healthy routine but a good, wholesome diet can have a really positive impact on how you feel. So make sure you’re getting your regular meals and you’re having as much green on your plate as possible – remember it’s all about balance. Doctor’s orders!"
        },
        {
            "heading": 3,
            "text": "Get enough sleep"
        },
        {
            "text": "Sleep is so important for how we feel. We all know that if you’ve had a bad night’s sleep it affects how you feel. Try to make sure you have a routine about when you go to bed and make sure you get up at a regular time each morning. Don’t stay up late on your phone. It really helps to regulate our mood and ensure we’re getting enough rest for the day ahead."
        },
        {
            "heading": 3,
            "text": "And don’t forget if you’re struggling reach out for help"
        },
        {
            "text": "It’s so important to talk about how you’re feeling. Whether it’s a family member, friend, teacher or GP, there are always people out there to support you. The Samaritans are there 24 hours, seven days a week too and can be contacted on 116 123. Additional sources of mental health support are available here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}