{
    "url": "https://food.blog.gov.uk/2022/02/11/international-day-of-women-and-girls-in-science-2022-fsa/",
    "title": "Celebrating #WomenInScience at the FSA",
    "authors": [
        "Julie Pierce, Director of ODD, Wales and Science"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2022-02-11T09:03:36+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "On International Day of Women and Girls in Science, Julie Pierce, Director of ODD, Wales and Science at the Food Standards Agency introduces 8  of the many women in the FSA who use science every day to keep food safe."
        },
        {
            "text": "Today, Friday 11 February 2022, is International Day of Women and Girls in Science - a global acknowledgement of the role played by women and girls who work and contribute, either directly or indirectly, to the science that helps us live our everyday lives."
        },
        {
            "text": "Women are under-represented at all levels in science, technology, engineering and mathematics (STEM) disciplines, but there is such a variety of roles out there and ways we can make a difference. For me, science has provided a varied and exciting career, spanning roles in oil exploration and anti-submarine warfare, the corporate world of banks, aircraft and telecoms, before bringing me to an area that interests me most – ensuring food is safe and what it says it is."
        },
        {
            "text": "In the FSA, everything we do to fulfil our mission of food we can trust is rooted in science and I’m proud to work alongside lots of brilliant women in science roles within our organisation, helping to protect animal and public health."
        },
        {
            "text": "The science we do is world-leading and fascinating. But also, it’s immediately relevant to people in the real world. It’s often taken up and used very quickly. We have access to the best scientists around the UK and the world, and we fundamentally operate across scientific disciplines to deliver the best science. Oh, and we have fun while doing it!"
        },
        {
            "text": "To mark International Day of Women and Girls in Science, I’m delighted to introduce some of our women in science in the FSA, providing a snapshot of the work we deliver, the routes we’ve taken into science and how we support our mission of food we can trust."
        },
        {
            "text": "Julie Pierce, Director of ODD (Openness, Data, and Digital), Wales and Science."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Lucy King, Principal Social Science Research Officer"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I’m a Principal Social Science Research Officer. It’s my role to provide high-quality evidence to support FSA policy decision-making. I’m part of the FSA’s Analytics Unit which is made up of Social Scientists, Economists, Statisticians and Operational Researchers. We sit within the FSA’s Science, Evidence and Research Division."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "Putting the consumer first is core to the work of the FSA. But in order to do that, we have to understand consumers’ food-related attitudes, behaviour and knowledge. I manage the FSA’s flagship survey, Food and You 2, which provides the FSA with robust evidence on what the public does and thinks when it comes to food. As part of this survey, we monitor consumers’ trust in food safety and the food system, including the key actors involved. The information we collect is used to monitor the FSA’s progress against its strategic goal of ‘food we can trust’. It also helps us to identify and prioritise where there is further work to be done."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "I think I was destined to have a career in science after being awarded my school ‘Science Cup’ at the age of 11! My interest in science grew when studying for my A-Levels (Biology, Psychology, Geography and Food Technology) and I later went on to study Psychology at university. After graduating I joined the Civil Service as a Psychologist. I worked in the Ministry of Defence for four years conducting research with military personnel before joining the FSA as a Social Researcher in 2018."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "The best thing about working for the FSA is the emphasis that is placed on high-quality science and evidence. In addition, the FSA prides itself on being open and transparent which means all our research and evidence is published and available for anyone to use in their own work or analysis."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Ayah Wafi, Food Allergen Risk Assessor"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I work as an allergen risk assessor. My role includes conducting quantitative allergen risk assessments to assess risks posed due to the unintentional presence of allergens in food in order to protect public health. I also act as a project officer, managing academic research in food allergy and other food hypersensitivities, as well as reviewing scientific reports and papers."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "My role protects those who have food allergies. It allows them to trust that the food they eat does not contain unintentional allergens not present on the label. In other words, the ingredient list reflects what is in the product, including any allergens."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "Growing up I was always curious about my food allergies. My curiosity in all things allergy led me to pursue a Genetics integrated master’s degree and research the genetic determinants of food allergy. This led me into a career in science which has equipped me with the tools to protect allergic consumers. From a personal perspective of having food allergies, I understand how important it is that consumers know exactly what is in their food to be safe."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "For me, the best thing is the opportunity to be involved in world-leading academic research in food allergy and other food hypersensitivities. And protecting allergic consumers."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Bethan Davies, Science Assurance and Capability Manager"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I’m a Science Assurance and Capability Manager working within the Science Strategy, Capability and Research Unit. My role is to provide assurance that scientific experts are sought appropriately and that scientific analysis and advice is used effectively. I oversee the governance of the FSA’s Scientific Advisory Committees and ensure they have the capability they need to run effectively."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "The work my team does ensures the FSA has access to the right scientific advice and expertise at the right time to help inform our food safety advice, and ultimately to shape policy."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "I always loved science at school and finding out about how and why things worked. I had the best careers advice when choosing my A-Levels which was to take Chemistry, Physics and Maths as it would open up the most opportunities. I was a bit unsure to start with as I also loved languages, but when I found out it was mostly boys who took this combination I was determined to do it! I then studied Biochemistry at university and was fascinated by the molecular workings of nature and I’ve been fortunate enough to enjoy working in science ever since."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "The best thing is knowing I work for an organisation that puts science and evidence at the heart of everything they do and of course being able to use my expertise and training to help keep food safe!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Aoibheann Dunne, Nutritional Science Adviser"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I’m a Nutritional Science Adviser for the Dietary Health team in Northern Ireland. I work closely with policy leads, mainly focusing on research projects. I use my expertise to pull out and analyse scientific data, which I then interpret with the policy leads."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "I was always drawn to the nexus between academia and public health – we know a lot about nutrition from a research point of view, but it is more difficult to put this knowledge into practice for people at national level. I am interested in both nutrition and psychology, and I believe to some degree public health nutrition is a cross between these two disciplines. To combat obesity we must look at how factors such as our food environment can impact dietary health."
        },
        {
            "text": "My role as a nutrition science advisor cuts across several different policy areas within the FSA. I aid in interpreting data from various projects, and I help ensure that the information is readily interpreted by a diverse range of stakeholders. Most of my work focuses on the dietary health surveillance in Northern Ireland. For example, the National Diet and Nutrition Survey allows us to look at the dietary intake and nutritional status of people in Northern Ireland, showing us people are generally consuming too much sugar and saturated fat and not enough fibre."
        },
        {
            "text": "Our Kantar research is also very telling – what are people buying and bringing into their homes? It can also look at potential trends in certain demographics or look at the purchasing of high fat, sugar, salt products on promotion. This evidence-based research is integral to monitoring the dietary health of individuals in Northern Ireland. It also allows us to inform the progress of programmes such as the FSA’s The Eating Well Choosing Better programme which aims to reduce the calorie, sugar, saturated fat and salt content of foods produced in Northern Ireland."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "I have known since I was young that I was drawn to science and wanted to work in research. I initially studied pharmacy but in my free time, I was reading up about nutrition, so I eventually decided to switch courses. I ended up completing my PhD in 2021 – it focuses on the link between low-calorie sweeteners and dietary health. My expertise is in participant recruitment and data analysis, I have a lot of academic experience but would like to get more public sector experience. With the FSA, I have learned a lot about the government, its inner workings, how things are structured, business cases, things like that. I would never have encountered these things before."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "For me, it’s the interchange of experience – it’s quite an uplifting environment to work in, we learn from each other and the teamwork is great. It’s how women in science progress, 100%."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Michelle Patel, Acting Deputy Director, Science Evidence and Research"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I’m the Acting Deputy Director of Science Evidence and Research Directorate with responsibility for analysis and insight. That’s a mouthful but it means that I share the running of the directorate with Rick Mumford and my side of the team covers operational analysis, social science, economics, statistics and horizon scanning."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "We know from our consumer research that much of why people trust us – and because of us, the food they eat – is because what we do is based on independent science and evidence. The evidence my teams produce gives us a picture of the world we're operating in which helps everyone make better decisions."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "In a roundabout way! I spent most of my civil service career in communications, but in 2018 I got the opportunity to bring the consumer insight function – which was in comms - together with our social science function in our science team, and combine the overlapping skillsets to build something really great which uses the best of both. Since then I’ve pursued my PhD (in how deliberative social science methods are applied to food regulation) and found my place in the science team."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "I go to so many cross-Government meetings where the scientists and analysts are starved of resources, or politically pressured not to publish, or can’t commission work that’s desperately needed. I’ve worked in a few, too. It’s refreshing to work in a department which genuinely cares about openness, good evidence and trustworthiness. And, food is fascinating. It touches everything."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Emma French, Exposure Risk Assessor"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I am an Exposure Risk Assessor. I provide consumption and exposure estimates and advice to other Risk Assessors to help produce risk assessments for incidents or contribute towards scientific advisory committee papers e.g. Committee of Toxicity (COT)."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "The exposure assessment team works a lot with the data produced from dietary surveys such as the National Diet and Nutrition Survey which enables us to build consumption and exposure estimates. Our work is quite reactive, particularly when responding to food-related incidents from the allergy, chemical, microbiology and trade risk assessment teams. Our work helps build robust risk assessments which will help to estimate the overall risk to human health from food. Because of the work we do, risk management decisions can be taken to protect consumers from food hazards."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "I’ve always loved that light bulb moment, where something makes sense. That tended to occur quite frequently in my science lessons at school. I chose science-based A-Levels (Biology, Sport, Psychology) and studied Biology at Aberystwyth University followed by a Masters at Queen’s University Belfast in Parasitology and Pathogen Biology. Since then I have worked in various laboratory-based roles as a Microbiologist and more recently, working within a large dairy factory before beginning my career in the FSA."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "The best thing about working in science for the FSA is that everyone I work with is working towards the same goal of protecting consumer safety. My colleagues strive to help each other which makes the FSA such a rewarding and friendly place to work and allows people to learn and develop within their roles."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Johann Trotter, Regulated Products Risk Assessor"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "I am a Regulated Products Risk Assessor, working as part of the Risk Assessment Unit, which sits within the Science, Evidence and Research Division. My role is to evaluate applications for certain food and feed products that are seeking authorisation before they can be sold in the UK. An assessment is required in order to determine whether the food or feed product is safe and therefore eligible to be placed on the market."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "Assessing the risk of food and feed products to consumers is an essential part of ensuring that the food you eat is safe and that it is what it says it is. We evaluate food composition and manufacturing processes, as well as the toxicological risks for consumers, animals and the environment."
        },
        {
            "text": "We will also assess other factors, such as the potential for allergenicity and the proposed conditions of use. Every decision we make is based on research and evidence. Through this process of risk assessment and by evaluating all the potential sources of risk using an objective, scientific approach, we are able to ensure you can trust the food you eat."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "Surprisingly I didn’t like science until I had amazing Biology and Chemistry teachers at GCSE Level – both of them ignited my passion for science! I knew I wanted to get involved in research, so completed a Pharmacy degree with the intention of going back and pursuing my PhD."
        },
        {
            "text": "My PhD was based on developing infection-resistant coatings for urinary catheters. After this, I had a few postdoctoral positions, before moving towards food science and deciding to leave academia and pursue a career elsewhere. The FSA stood out to me because it’s held in such high regard and I loved the fact I would get to use my research skills in a new environment that directly influences public health."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "Unlike a lot of areas of academia, the impact of your work is seen relatively quickly, and it feels like you are contributing to public health in a meaningful way. Everything we do is also research-led, so there is the guarantee that our suggestions and decisions are evidence-based. It also means that I still get to flex my research skills on a daily basis but in a new and exciting way!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Natalie Sampson, Head of Veterinary and Meat Hygiene Policy"
        },
        {
            "heading": 3,
            "text": "What is your job title and role in FSA?"
        },
        {
            "text": "My team cover two areas of food safety – the first being meat hygiene policy, in other words, looking at how the processes we use to produce meat from slaughterhouse to plate are safe. It's very broad but encompasses microbiology, animal husbandry and welfare, slaughterhouse processes, trade and incidents risk management advice amongst other things."
        },
        {
            "text": "The second area of work involves veterinary advice across not only our own unit but across the policy directorate with any product of animal origin.  We work closely with our colleagues in the field and other government departments on a wide array of topics from official regulations and ensuring they are fit for the future to veterinary resourcing challenges at profession level, supporting incidents management and notifiable disease responses."
        },
        {
            "heading": 3,
            "text": "How does it fit into our mission of food you can trust?"
        },
        {
            "text": "The FSA mission of ‘food you can trust’ is integral to my role as a vet who leads on veterinary and meat hygiene policy.  When looking at the policies surrounding meat, both meat hygiene and vets are essential in ensuring it is safe and what it says it is."
        },
        {
            "heading": 3,
            "text": "How did you get into science?"
        },
        {
            "text": "I was quite focused from an early age working on my Grandparent’s farm and knew I wanted to be a vet.  This gave me the steer through school to focus on the sciences – albeit Chemistry, Biology and Maths over Physics.  These subjects gave me a fabulous grounding, supported by practical on the ground experience on farms to see how science is relevant in real-world applications and I continue to use the building blocks of science every day."
        },
        {
            "heading": 3,
            "text": "What is the best thing about working in science for the FSA?"
        },
        {
            "text": "I would say the best thing is being part of a bigger picture that impacts on so many areas of daily life – from food to trade – and working with so many other professional disciplines, not just scientists but communications, policy, trade and field experts, we can learn a lot from each other and enhance our personal and collective skills."
        },
        {
            "heading": 1,
            "text": "Dathlu #MenywodMewnGwyddoniaeth yn yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Ar Ddiwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth, mae Julie Pierce, Cyfarwyddwr Bod yn Agored, Data, Digidol, Cymru a Gwyddoniaeth yn yr Asiantaeth Safonau Bwyd (ASB) yn cyflwyno 8 o blith llawer o fenywod yn yr ASB sy’n defnyddio gwyddoniaeth bob dydd i gadw bwyd yn ddiogel."
        },
        {
            "text": "Heddiw, ddydd Gwener 11 Chwefror 2022, yw Diwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth. Y nod yw cydnabod rôl menywod a merched ledled y byd sy’n gweithio ac yn cyfrannu, naill ai’n uniongyrchol neu’n anuniongyrchol, at y wyddoniaeth sy’n ein helpu i fyw ein bywydau bob dydd."
        },
        {
            "text": "Mae menywod heb gynrychiolaeth ddigonol ar bob lefel ym meysydd gwyddoniaeth, technoleg, peirianneg a mathemateg (STEM), ond mae amrywiaeth helaeth o rolau ar gael a ffyrdd y gallwn ni wneud gwahaniaeth. Yn fy achos i, mae gwyddoniaeth wedi cynnig gyrfa amrywiol a chyffrous. Rwyf wedi gweithio ym maes chwilio am olew a rhyfela yn erbyn llongau tanfor, ym myd banciau corfforaethol, awyrennau a thelathrebu, cyn cyrraedd y maes sydd o’r diddordeb mwyaf i mi – sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label."
        },
        {
            "text": "Yn yr ASB, mae gwyddoniaeth wrth wraidd popeth a wnawn i gyflawni ein cenhadaeth, sef bwyd y gallwn ymddiried ynddo. Rwy’n falch o weithio ochr yn ochr â llawer o fenywod rhagorol sydd â rolau gwyddonol yn ein sefydliad, gan helpu i ddiogelu iechyd anifeiliaid ac iechyd y cyhoedd."
        },
        {
            "text": "Mae gwyddoniaeth yr ASB yn arloesol ac yn hynod ddiddorol. Ond hefyd, mae’n berthnasol i bobl yn y byd go iawn. Mae gwyddoniaeth yr ASB yn aml yn cael ei mabwysiadu a’i gweithredu’n gyflym iawn. Rydym ni’n gweithio gyda gwyddonwyr gorau’r Deyrnas Unedig a’r byd gan weithredu ar draws disgyblaethau gwyddonol i sicrhau’r wyddoniaeth orau – ac rydym ni’n cael hwyl ar yr un pryd!"
        },
        {
            "text": "I nodi Diwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth, mae’n bleser gennyf gyflwyno rhai o’r menywod sy’n gweithio ym maes gwyddoniaeth yn yr ASB, gan roi cipolwg o’r gwaith rydym ni’n ei gyflawni, y llwybrau sydd wedi ein harwain at wyddoniaeth a sut rydym ni’n cefnogi ein cenhadaeth, sef bwyd y gallwn ymddiried ynddo."
        },
        {
            "text": "Julie Pierce, Cyfarwyddwr Bod yn Agored, Data, Digidol, Cymru a Gwyddoniaeth"
        },
        {
            "heading": 2,
            "text": "Lucy King, Prif Swyddog Ymchwil y Gwyddorau Cymdeithasol"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n gweithio fel Prif Swyddog Ymchwil y Gwyddorau Cymdeithasol. Fy rôl i yw darparu tystiolaeth o ansawdd uchel i gefnogi penderfyniadau polisi’r ASB. Rwy’n rhan o Uned Ddadansoddi’r ASB sy’n cynnwys Gwyddonwyr Cymdeithasol, Economegwyr, Ystadegwyr ac Ymchwilwyr Gweithredol. Rydym ni’n rhan o Is-adran Gwyddoniaeth, Tystiolaeth ac Ymchwil yr ASB."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae rhoi’r defnyddiwr yn gyntaf wrth wraidd gwaith yr ASB. Ond er mwyn gwneud hynny, mae’n rhaid i ni ddeall agweddau, ymddygiad a gwybodaeth defnyddwyr am fwyd. Rwy’n rheoli arolwg blaenllaw yr ASB, Bwyd a Chi 2, sy’n rhoi tystiolaeth gadarn i’r ASB ar yr hyn y mae’r cyhoedd yn ei wneud ac yn ei feddwl mewn perthynas â bwyd. Fel rhan o’r arolwg hwn, rydym ni’n monitro ymddiriedaeth defnyddwyr yn y system fwyd a diogelwch bwyd, gan gynnwys y prif ddylanwadau sydd ar waith. Defnyddir yr wybodaeth a gasglwn i fonitro cynnydd yr ASB yn erbyn ei nod strategol sef, ‘bwyd y gallwn ymddiried ynddo’. Mae hefyd yn ein helpu i nodi a blaenoriaethu’r meysydd lle mae angen gwneud rhagor o waith."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Roeddwn i bob amser yn mynd i ddilyn gyrfa mewn gwyddoniaeth ar ôl i mi ennill y ‘Cwpan Gwyddoniaeth’ yn yr ysgol pan oeddwn i’n 11 oed! Tyfodd fy niddordeb mewn gwyddoniaeth wrth astudio ar gyfer Safon Uwch (Bioleg, Seicoleg, Daearyddiaeth a Thechnoleg Bwyd). Es i ymlaen i astudio Seicoleg yn y brifysgol. Ar ôl graddio, ymunais â’r Gwasanaeth Sifil fel Seicolegydd. Gweithiais yn Y Weinyddiaeth Amddiffyn am bedair blynedd yn gwneud gwaith ymchwil gyda phersonél milwrol cyn ymuno â’r ASB fel Ymchwilydd Cymdeithasol yn 2018."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Y peth gorau am weithio i’r ASB yw’r pwyslais a roddir ar wyddoniaeth a thystiolaeth o ansawdd uchel. Hefyd, mae’r ASB yn ymfalchïo mewn bod yn agored ac yn dryloyw sy’n golygu bod ein holl waith ymchwil a thystiolaeth yn cael eu cyhoeddi a’u bod ar gael i unrhyw un eu defnyddio yn eu gwaith neu eu dadansoddiadau eu hunain."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Ayah Wafi, Asesydd Risg Alergenau Bwyd"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n gweithio fel asesydd risg alergenau. Mae fy rôl yn cynnwys cynnal asesiadau risg meintiol o alergenau i asesu’r risgiau a achosir gan bresenoldeb anfwriadol alergenau mewn bwyd er mwyn diogelu iechyd y cyhoedd. Rwyf hefyd yn gweithio fel swyddog prosiect, yn rheoli ymchwil academaidd ym maes alergedd bwyd a gorsensitifrwydd i fwyd yn ogystal ag adolygu adroddiadau a phapurau gwyddonol."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae fy rôl yn diogelu’r rhai sydd ag alergeddau bwyd. Mae’n sicrhau eu bod yn gallu ymddiried nad yw’r bwyd y maent yn ei fwyta yn cynnwys alergenau anfwriadol nad ydynt wedi’u cynnwys ar y label. Mewn geiriau eraill, mae’r rhestr gynhwysion yn adlewyrchu’r hyn sydd yn y cynnyrch, gan gynnwys unrhyw alergenau."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Pan oeddwn i’n iau, roeddwn i bob amser yn chwilfrydig am fy alergeddau bwyd. Arweiniodd fy chwilfrydedd ynghylch alergeddau at ddilyn gradd meistr integredig ym maes Geneteg ac ymchwilio i benderfynyddion genetig alergedd bwyd. Areweiniodd hyn at yrfa mewn gwyddoniaeth sydd wedi fy mharatoi i allu diogelu defnyddwyr sydd ag alergeddau. O safbwynt personol fel un sy’n dioddef o alergeddau bwyd, rwy’n deall pa mor bwysig yw hi bod defnyddwyr yn gwybod beth yn union sydd yn eu bwyd er mwyn aros yn ddiogel."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "I mi, y peth gorau yw’r cyfle i fod yn rhan o ymchwil academaidd o’r radd flaenaf ym maes alergedd bwyd a gorsensitifrwydd i fwyd - a diogelu defnyddwyr sydd ag alergeddau."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Bethan Davies, Rheolwr Sicrwydd a Gallu Gwyddoniaeth"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n Rheolwr Sicrwydd a Gallu Gwyddoniaeth yn yr Uned Strategaeth, Gallu ac Ymchwil Wyddoniaeth. Fy rôl i yw rhoi sicrwydd y ceisir arbenigwyr gwyddonol mewn modd priodol a bod gwaith dadansoddi a chyngor gwyddonol yn cael eu defnyddio’n effeithiol. Rwy’n goruchwylio’r gwaith o lywodraethu Pwyllgorau Cynghori Gwyddonol yr ASB ac yn sicrhau bod ganddynt y gallu sydd ei angen arnynt i redeg yn effeithiol."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae’r gwaith y mae fy nhîm yn ei wneud yn sicrhau bod yr ASB yn gallu manteisio ar y cyngor a’r arbenigedd gwyddonol cywir ar yr adeg iawn i helpu i lywio ein cyngor ar ddiogelwch bwyd, ac yn y pen draw, i lunio polisi."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Roeddwn i bob amser yn hoffi gwyddoniaeth yn yr ysgol a dysgu sut a pham roedd pethau’n gweithio. Ces i’r cyngor gorau pan oeddwn i’n dewis pa bynciau i’w hastudio ar gyfer Safon Uwch sef, i astudio Cemeg, Ffiseg a Mathemateg gan y byddai’r pynciau hyn yn cynnig y nifer mwyaf o gyfleoedd. Roeddwn i braidd yn ansicr i ddechrau gan fy mod i hefyd yn caru ieithoedd. Ond pan ddysgais mai bechgyn yn bennaf oedd yn astudio’r pynciau penodol hyn, roeddwn i’n benderfynol o fynd amdani! Es i ymlaen i astudio Biocemeg yn y brifysgol ac roeddwn i’n dwlu ar ymddygiad molecwlar byd natur. Rwyf wedi bod yn ddigon ffodus i fwynhau gweithio mewn gwyddoniaeth ers hynny."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Y peth gorau yw gwybod fy mod i’n gweithio i sefydliad sy’n rhoi gwyddoniaeth a thystiolaeth wrth galon popeth y mae’n ei wneud, ac wrth gwrs, gallu defnyddio fy arbenigedd a’m hyfforddiant i helpu i gadw bwyd yn ddiogel!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Aiobheann Dunne, Cynghorydd Gwyddor Maeth"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n gweithio fel Cynghorydd Gwyddor Maeth i’r tîm Iechyd Deietegol yng Ngogledd Iwerddon. Rwy’n gweithio’n agos gydag arweinwyr polisi, gan ganolbwyntio’n bennaf ar brosiectau ymchwil. Rwy’n defnyddio fy arbenigedd i ddethol a dadansoddi data gwyddonol. Rwyf wedyn yn dehongli’r data hwn gydag arweinwyr polisi."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Roeddwn i bob amser yn cael fy nenu at y cysylltiad rhwng y byd academaidd ac iechyd y cyhoedd – rydym ni’n gwybod llawer am faeth o safbwynt ymchwil, ond mae’n anoddach rhoi’r wybodaeth hon ar waith i bobl a’r genedl. Mae gen i ddiddordeb mewn maetheg a seicoleg, ac rwy’n credu, i ryw raddau, fod maetheg iechyd y cyhoedd yn bont rhwng y ddwy ddisgyblaeth hyn. Er mwyn brwydro yn erbyn gordewdra, rhaid i ni ystyried sut y gall ffactorau fel ein hamgylchedd bwyd effeithio ar iechyd deietegol."
        },
        {
            "text": "Mae fy rôl fel cynghorydd gwyddor maeth yn cwmpasu sawl maes polisi gwahanol o fewn yr ASB. Rwy’n cynorthwyo cydweithwyr i ddehongli data o brosiectau amrywiol, ac rwy’n helpu i sicrhau bod yr wybodaeth, sydd wedi’i dehongli gan ystod amrywiol o randdeiliaid, ar gael yn hawdd. Mae’r rhan fwyaf o fy ngwaith yn canolbwyntio ar wyliadwriaeth iechyd deietegol yng Ngogledd Iwerddon. Er enghraifft, mae’r Arolwg Cenedlaethol o Ddeiet a Maeth yn ein galluogi i edrych ar gymeriant dietegol a statws maeth pobl yng Ngogledd Iwerddon. Mae wedi dangos bod pobl, yn gyffredinol, yn bwyta gormod o siwgr a braster dirlawn, a dim digon o ffeibr."
        },
        {
            "text": "Mae ein hymchwil gan Kantar hefyd yn drawiadol iawn – beth mae pobl yn ei brynu a’i fwyta yn eu cartrefi? Gall yr ymchwil hefyd edrych ar dueddiadau posibl mewn carfannau demograffig penodol neu dueddiadau o ran prynu cynhyrchion sy’n cael eu hyrwyddo sy’n cynnwys lefelau uchel o fraster, siwgr a halen. Mae’r ymchwil hon, sy’n seiliedig ar dystiolaeth, yn hanfodol i fonitro iechyd deietegol unigolion yng Ngogledd Iwerddon. Mae hefyd yn ein galluogi i lywio cynnydd rhaglenni fel rhaglen Bwyta’n Dda, Dewis Gwell yr ASB sy’n ceisio lleihau calorïau, siwgr, braster dirlawn a halen mewn bwydydd a gynhyrchir yng Ngogledd Iwerddon."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Rwyf wedi gwybod ers pan oeddwn i’n blentyn fy mod i’n hoffi gwyddoniaeth ac eisiau gweithio ym maes ymchwil. Astudiais fferylliaeth i ddechrau ond yn fy amser hamdden, roeddwn i’n darllen am faetheg, felly penderfynais newid fy nghwrs yn y pen draw. Gwnes i gwblhau fy noethuriaeth yn 2021 – mae’n canolbwyntio ar y cysylltiad rhwng melysyddion calorïau isel ac iechyd deietegol. Rwy’n arbenigo mewn recriwtio cyfranogwyr a dadansoddi data. Mae gen i lawer o brofiad yn y byd academaidd ond hoffwn i ennill mwy o brofiad yn y sector cyhoeddus. Wrth weithio yn yr ASB, rwyf wedi dysgu llawer am y llywodraeth, sut mae’n gweithredu, sut mae pethau wedi’u strwythuro, achosion busnes, ac yn y blaen. Ni fyddwn i erioed wedi dod ar draws y pethau hyn cyn hynny."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "I mi, y peth gorau yw cael cyfle i rannu profiadau – mae’n amgylchedd cefnogol i weithio ynddo. Rydym ni’n dysgu oddi wrth ein gilydd ac mae’r gwaith tîm yn wych. Dyma sut mae menywod mewn gwyddoniaeth yn datblygu, heb amheuaeth."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Michelle Patel, Dirprwy Gyfarwyddwr Dros Dro y Gyfarwyddiaeth Tystiolaeth ac Ymchwil Wyddoniaeth"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Fi yw Dirprwy Gyfarwyddwr Dros Dro y Gyfarwyddiaeth Tystiolaeth ac Ymchwil Wyddoniaeth ac rwy’n gyfrifol am ddadansoddi a mewnwelediad. Mae hynny’n llond ceg ond mae’n golygu bod Rick Mumford a finnau’n rhedeg y gyfarwyddiaeth ar y cyd, a bod fy nhîm yn ymdrin â dadansoddi gweithredol, gwyddor gymdeithasol, economeg, ystadegau a gwaith sganio’r gorwel."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Rydym ni’n gwybod o’n hymchwil defnyddwyr fod pobl yn ymddiried ynom ni, ac felly, y bwyd maen nhw’n ei fwyta, a hynny oherwydd bod ein gwaith yn seiliedig ar wyddoniaeth a thystiolaeth annibynnol. Mae’r dystiolaeth y mae fy nhimau yn ei chynhyrchu yn rhoi darlun i ni o’r maes rydyn ni’n gweithredu ynddo ac yn helpu pawb i wneud penderfyniadau gwell."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Trwy fynd y ffordd hir! Treuliais y rhan fwyaf o’m gyrfa yn y gwasanaeth sifil ym maes cyfathrebu. Fodd bynnag, yn 2018, cefais gyfle i mi gyfuno’r ddwy agwedd - deall safbwyntiau defnyddwyr ym maes cyfathrebu â’r ochr gwyddor gymdeithasol yn ein tîm gwyddoniaeth. Trwy wneud hyn, gwnes i fanteisio ar yr elfennau gorau o’r ddwy set o sgiliau i greu rhywbeth gwirioneddol wych. Ers hynny, rwyf wedi bod yn astudio ar gyfer fy noethuriaeth (sy’n edrych ar y modd y mae dulliau gwyddor gymdeithasol ystyriol yn cael eu defnyddio i reoleiddio bwyd) ac wedi ymsefydlu yn y tîm gwyddoniaeth."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Rwy’n mynd i gynifer o gyfarfodydd traws-lywodraethol lle mae’r gwyddonwyr a’r dadansoddwyr yn brin iawn o adnoddau, neu dan bwysau gwleidyddol i beidio â chyhoeddi, neu’n methu â chomisiynu gwaith sydd ei angen yn fawr. Rwyf wedi gweithio mewn rhai o’r timau hyn hefyd. Mae’n braf gweithio mewn adran sy’n rhoi pwyslais ar dystiolaeth dda, dibynadwyedd a bod yn agored. Ac, mae bwyd yn hynod ddiddorol – mae’n effeithio ar bopeth."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Emma French, Asesydd Risg Cysylltiad"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n gweithio fel Asesydd Risg Cysylltiad. Rwy’n darparu cyngor ac amcangyfrifon ar ddefnydd a chysylltiad i Aseswyr Risg eraill er mwyn helpu i lunio asesiadau risg ar gyfer digwyddiadau neu gyfrannu at bapurau pwyllgor cynghori gwyddonol, er enghraifft, Pwyllgor ar Wenwyndra (COT)."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae’r tîm asesu cysylltiad yn defnyddio’r data a gynhyrchir o arolygon deietegol fel yr Arolwg Cenedlaethol o Ddeiet a Maeth, sydd yn ei dro, yn ein galluogi i lunio amcangyfrifon o ran defnydd a chysylltiad. Mae ein gwaith yn eithaf adweithiol, yn enwedig wrth ymateb i ddigwyddiadau bwyd gan y timau asesu risg alergedd, cemegol, microbioleg a masnachol. Mae ein gwaith yn helpu i lunio asesiadau risg cadarn a fydd yn helpu i amcangyfrif risg gyffredinol bwyd i iechyd pobl. Oherwydd ein gwaith, gellir gwneud penderfyniadau rheoli risg i ddiogelu defnyddwyr rhag peryglon bwyd."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Rwyf bob amser wedi dwlu ar y foment honno lle mae rhywbeth yn gwneud synnwyr. Roedd hynny’n dueddol o ddigwydd yn weddol aml yn fy ngwersi gwyddoniaeth yn yr ysgol. Dewisais astudio Safon Uwch mewn gwyddoniaeth (Bioleg, Chwaraeon, Seicoleg). Astudiais Fioleg ym Mhrifysgol Aberystwyth ac wedyn, gwnes i radd Meistr ym Mhrifysgol Queen’s Belfast mewn Parasitoleg a Bioleg Pathogenau. Ers hynny, rwyf wedi gweithio mewn gwahanol rolau mewn labordai fel Microbiolegydd ac yn fwy diweddar, mewn ffatri laeth fawr cyn dechrau fy ngyrfa yn yr ASB."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Y peth gorau am weithio i’r ASB ym maes gwyddoniaeth yw bod pawb yn gweithio tuag at yr un nod, sef diogelu defnyddwyr. Mae fy nghydweithwyr yn ymdrechu i helpu ein gilydd sy’n gwneud yr ASB yn lle cyfeillgar a gwerth chweil i weithio ynddo ac mae’n galluogi pobl i ddysgu a datblygu o fewn eu rolau."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Johann Trotter, Asesydd Risg Cynhyrchion wedi’u Rheoleiddio"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Rwy’n gweithio fel Asesydd Risg Cynhyrchion wedi’u Rheoleiddio. Rwy’n rhan o’r Uned Asesu Risg, sy’n rhan o’r Is-adran Tystiolaeth ac Ymchwil Wyddoniaeth. Fy rôl i yw gwerthuso ceisiadau ar gyfer awdurdodi rhai cynhyrchion bwyd a bwyd anifeiliaid cyn y gellir eu gwerthu yn y Deyrnas Unedig. Mae angen cynnal asesiad er mwyn penderfynu a yw’r bwyd neu’r cynnyrch bwyd anifeiliaid yn ddiogel ac felly, a ydyn nhw’n gymwys i’w rhoi ar y farchnad."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae asesu risg cynhyrchion bwyd a bwyd anifeiliaid i ddefnyddwyr yn rhan hanfodol o sicrhau bod y bwyd rydych chi’n ei fwyta yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Rydym ni’n gwerthuso cyfansoddiad bwyd a phrosesau gweithgynhyrchu, yn ogystal â’r risgiau gwenwynegol i ddefnyddwyr, anifeiliaid a’r amgylchedd."
        },
        {
            "text": "Byddwn hefyd yn asesu ffactorau eraill, fel y potensial o natur alergenaidd a’r amodau arfaethedig o ran defnydd. Mae pob penderfyniad a wnawn yn seiliedig ar ymchwil a thystiolaeth. Drwy’r broses hon o asesu risg a gwerthuso’r holl ffynonellau posibl o risgiau gan ddefnyddio dull gwrthrychol a gwyddonol, gallwn ni sicrhau y gallwch chi ymddiried yn y bwyd rydych chi’n ei fwyta."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Yn rhyfedd iawn, doeddwn i ddim yn hoffi gwyddoniaeth nes i mi gael athrawon Bioleg a Chemeg anhygoel ar lefel TGAU – fe wnaeth y ddau ohonyn nhw danio fy angerdd am wyddoniaeth! Roeddwn i’n gwybod fy mod i eisiau chwarae rôl mewn ymchwil, felly fe wnes i gwblhau gradd mewn Fferylliaeth gyda’r bwriad o fynd yn ôl a gwneud doethuriaeth."
        },
        {
            "text": "Roedd fy noethuriaeth yn canolbwyntio ar ddatblygu haenau sy’n gallu gwrthsefyll heintiau ar gyfer cathetrau wrinol. Ar ôl hyn, ces i ychydig o swyddi ôl-ddoethurol, cyn symud tuag at wyddoniaeth bwyd a phenderfynu gadael y byd academaidd a dilyn gyrfa mewn maes arall. Roedd yr ASB yn sefyll allan i mi gan ei bod mor uchel ei pharch ac roeddwn wrth fy modd â’r ffaith y byddwn yn cael defnyddio fy sgiliau ymchwil mewn amgylchedd newydd sy’n dylanwadu’n uniongyrchol ar iechyd y cyhoedd."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Yn wahanol i lawer o feysydd academaidd, mae effaith eich gwaith i’w gweld yn gymharol gyflym, ac mae’n teimlo fel eich bod chi’n cyfrannu at iechyd y cyhoedd mewn ffordd ystyrlon. Mae popeth a wnawn hefyd yn cael ei arwain gan ymchwil, felly mae sicrwydd bod ein hawgrymiadau a’n penderfyniadau yn seiliedig ar dystiolaeth. Mae hefyd yn golygu fy mod i’n dal i gael defnyddio fy sgiliau ymchwil yn ddyddiol ond mewn ffordd newydd a chyffrous!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Dr Natalie Sampson, Pennaeth Polisi Milfeddygol a Hylendid Cig"
        },
        {
            "heading": 3,
            "text": "Beth yw teitl eich swydd a’ch rôl yn yr ASB?"
        },
        {
            "text": "Mae fy nhîm yn ymdrin â dau faes diogelwch bwyd – y cyntaf yw polisi hylendid cig, sef mewn geiriau eraill, edrych ar sut mae’r prosesau yr ydym yn eu defnyddio i gynhyrchu cig, a hynny o’r lladd-dy i’r plât, yn ddiogel. Mae’n faes eang iawn ond mae’n cwmpasu microbioleg, magu anifeiliaid a’u lles, prosesau lladd-dai, masnachu a chyngor rheoli risg digwyddiadau ymhlith pethau eraill."
        },
        {
            "text": "Mae’r ail faes gwaith yn ymwneud â rhoi cyngor milfeddygol ar unrhyw gynnyrch sy’n dod o anifeiliaid, nid yn unig i’n huned ein hunain ond i’r holl gyfarwyddiaeth bolisi.  Rydym ni’n gweithio’n agos gyda’n cydweithwyr yn y maes ac adrannau eraill y llywodraeth ar amrywiaeth eang o bynciau. Mae hyn yn amrywio o reoliadau swyddogol a sicrhau eu bod yn addas ar gyfer y dyfodol i heriau adnoddau milfeddygol ar lefel proffesiwn, helpu i reoli digwyddiadau ac ymateb i glefydau hysbysadwy."
        },
        {
            "heading": 3,
            "text": "Sut mae eich rôl yn cyd-fynd â’n cenhadaeth, sef bwyd y gallwch ymddiried ynddo?"
        },
        {
            "text": "Mae cenhadaeth yr ASB sef, ‘bwyd y gallwch ymddiried ynddo’ yn rhan annatod o’m rôl fel milfeddyg sy’n arwain ar bolisi milfeddygol a hylendid cig. Wrth edrych ar y polisïau sy’n ymwneud â chig, mae rheoliadau hylendid cig a milfeddygon yn hanfodol i sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label."
        },
        {
            "heading": 3,
            "text": "Sut daethoch chi i fyd gwyddoniaeth?"
        },
        {
            "text": "Pan oeddwn i’n ifanc iawn, roeddwn i’n gweithio ar fferm fy Nain a’m Taid ac yn gwybod fy mod i eisiau bod yn filfeddyg. Roedd hyn yn golygu fy mod i’n canolbwyntio ar y gwyddorau – ond gwnes i ddewis Cemeg, Bioleg a Mathemateg dros Ffiseg. Rhoddodd y pynciau hyn sylfaen wych i mi, a ategwyd gan brofiad ymarferol ar ffermydd, er mwyn gweld sut mae gwyddoniaeth yn berthnasol yn y byd go iawn ac rwy’n parhau i ddefnyddio hanfodion gwyddoniaeth bob dydd."
        },
        {
            "heading": 3,
            "text": "Beth yw’r peth gorau am weithio i’r ASB ym maes gwyddoniaeth?"
        },
        {
            "text": "Byddwn i’n dweud mai’r peth gorau yw bod yn rhan o’r darlun ehangach sy’n effeithio ar gymaint o feysydd o fywyd bob dydd – o fwyd i fasnach – a gweithio gyda chymaint o ddisgyblaethau proffesiynol eraill, nid dim ond gwyddonwyr ond arbenigwyr cyfathrebu, polisi, masnachu a maes. Gallwn ni ddysgu llawer oddi wrth ein gilydd a gwella ein sgiliau personol a chyfunol."
        }
    ]
}