{
    "url": "https://teaching.blog.gov.uk/2022/02/11/managing-attendance-in-the-face-of-the-covid-19-pandemic/",
    "title": "Managing attendance in the face of the COVID-19 pandemic",
    "authors": [
        "Andria Singlehurst"
    ],
    "categories": [
        "Attendance",
        "COVID-19 support"
    ],
    "pub_date": "2022-02-11T12:28:40+00:00",
    "content": [
        {
            "text": "Andria Singlehurst is the principal at Rivers Academy, a mixed, comprehensive secondary school in West London. In this blog, Andria shares how her school has supported pupils and their families to maintain good levels of attendance throughout the COVID-19 pandemic. "
        },
        {
            "text": "Engaging parents in the process"
        },
        {
            "text": "Whenever a pupil is absent, our attendance officer or pastoral team will phone a family member immediately. We regularly look at every pupil’s attendance and identify those who might be at risk of becoming persistently absent. We discuss the attendance of individual students and the reasons for their absence daily. Depending on the circumstances, we will produce a personal plan for each pupil requiring one."
        },
        {
            "text": "Buy-in from parents has also been very important. We use home-school agreements and our academic mentors and pastoral team regularly keep parents informed about improvements, emphasising the important responsibility that they have to work closely with us."
        },
        {
            "text": "Maintaining a positive and supportive environment"
        },
        {
            "text": "We are very careful with the language we use around our pupils about COVID-19. We avoid phrases like ‘’what you have missed’’, or pupils ‘’being behind’’. Instead, we say ‘’let’s build on what we already know’’, ‘’master skills’’, and make clear that “everyone is in a similar position because we’ve all been away’’. Using the right language has been a powerful tool to maintain positivity."
        },
        {
            "text": "We use student diaries, assemblies, class notice boards and positive letters to recognise good and improved attendance amongst our students, which creates a sense of achievement for them."
        },
        {
            "text": "Regular check-ins with students"
        },
        {
            "text": "During lockdown we conducted daily or weekly phone calls home (depending on need) so that our students always knew a member of staff was available to help or answer questions. We knew how important it was for our students to have that time to check in, but we also wanted to maintain the momentum we’d achieved on attendance pre-COVID. These calls played a crucial role in ensuring children were keen to return to school as they knew they would be supported."
        },
        {
            "text": "Following a period of Covid related absence we have spent time with each pupil working on a gradual reintegration back to school life. In September, all pupils had a one-to-one meeting with their academic mentors before returning to school and then spent the following week in activities aimed at strengthening relationships with their peers."
        },
        {
            "text": "We also continue to work with pupils to support developing their emotional and social skills following the impact of the pandemic. One-to-one interactions with pupils are regular and teachers take the time to really listen to a student. Staff are adept at noticing when a child is struggling even though they might say they are fine. Staff are astute at knowing what lies behind a child coming in with the wrong bag or being late and will take the time to find out how they really are. It’s these small but significant gestures or actions that make a big difference to the happiness and sense of belonging of our students."
        },
        {
            "text": "We take pride in building strong relationships with our students and our families. The concerted effort by all our staff to ensure that these relationships are maintained is the heart of our approach to attendance."
        },
        {
            "text": " "
        },
        {
            "text": "Find guidance and resources to support attendance in your school"
        },
        {
            "text": "For general information and guidance on how schools, trusts and local authorities can maintain high levels of school attendance, you can read our guidance on school attendance, as well as our attendance best practice framework. "
        }
    ]
}