{
    "url": "https://deframedia.blog.gov.uk/2022/02/11/minister-pow-visit-to-the-river-wye/",
    "title": "Minister Pow visit to the River Wye",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-02-11T16:45:24+00:00",
    "content": [
        {
            "text": "There has been coverage on BBC Midlands Today, ITV Central and the Hereford Times of Environment Minister Rebecca Pow’s visit to a farm in Fownhope near the River Wye in Herefordshire yesterday (10 February)."
        },
        {
            "text": "Representatives from the Environment Agency, Natural England and Wye and Usk Foundation also attended the visit along with Bill Wiggin, MP for North Herefordshire, and Elissa Swinglehurst and David Hitchiner from Herefordshire Council, to see an example of positive farming practices in action and how these can make a difference to tackling water pollution."
        },
        {
            "text": "The Wye catchment is an iconic location and hugely important for biodiversity, principally due to the wide range of rare river wildlife. Over 60% of the phosphate load in the catchment is from diffuse agricultural pollution from livestock manure and nutrients washing into the river during heavy rain."
        },
        {
            "text": "The group discussed the issues affecting the area to gain a further understanding of the challenges and opportunities for working together at both a local and national level on solutions to restore it to favourable condition and create capacity for development, without harming the natural environment."
        },
        {
            "text": "Defra is committed to improving the water environment and has convened a cross-Government taskforce with the Department for Levelling up, Housing and Communities (DLUHC) to identify methods for sustainable development around the river. The Environment Agency has also recently secured additional funding to increase regulatory activity on the Wye."
        },
        {
            "text": "We will continue to work with Natural England and the Environment Agency on the wider issue of underlying sources of pollution, considering upgrades to wastewater treatment works and ways of reducing pollution from agriculture. We have also almost doubled the budget for Catchment Sensitive Farming, providing free advice to farmers to help them reduce pollution through management of farmyard manure and soils."
        },
        {
            "text": "More widely, we are going further and faster than any other government to protect and enhance our rivers. Our Environment Act puts in place more protections against water pollution than ever before and we are the first government to instruct water companies to take steps to significantly reduce storm overflows, which we have also put into law."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}