{
    "url": "https://insidedio.blog.gov.uk/2022/02/11/national-apprenticeship-week-2022-being-a-chartered-surveyor-apprentice-at-dio/",
    "title": "National Apprenticeship Week 2022: being a chartered surveyor apprentice at DIO",
    "authors": [
        "Sam Rix"
    ],
    "categories": [
        "Apprentices",
        "RAF Lakenheath",
        "United States Visiting Forces Infrastructure Programme",
        "Working at DIO"
    ],
    "pub_date": "2022-02-11T15:13:09+00:00",
    "content": [
        {
            "text": "My name is Sam Rix and I have been working with the DIO for over three and a half years now, including various apprenticeships. I spent the first two and a half years of my career working in the DIO’s accommodation team to achieve my Level 3 surveying technician diploma and my associate chartership with the Royal Institute of Chartered Surveyors (RICS)."
        },
        {
            "text": "I currently work as a cost manager apprentice for the Major Projects & Programmes (MPP) team within DIO where I am working towards a level 6 Quantity Surveying degree and full chartership with the RICS. Working with DIO has provided me with an expansive variety of opportunities to develop my professional skills and since working in the MPP team the opportunities have continued to stretch and challenge me. With MPP I have worked on projects spanning from runways to hospitals to high schools, all of which present different challenges and new experiences that have allowed me to develop the professional skills required to further improve on my workplace and academic achievements."
        },
        {
            "text": "Having several large projects to work on in the same location has been very useful for quickly developing my construction technology skills.Due to the amount of work required across each project, there has always been something new to look at each week. There have always been challenges and areas I’ve had to improve on, but working through these challenges has helped me to become not only the professional I am today but the person I am too. The more difficult the challenge has been, the greater the skills I have come out of it with, and the greater personal satisfaction I have achieved."
        },
        {
            "heading": 2,
            "text": "Working at RAF Lakenheath"
        },
        {
            "text": "My apprenticeship with MPP has also enabled me to work with multiple contractors. I have just completed an excellent secondment with Mott MacDonald, our delivery partner on the US Air Force F-35 programme at RAF Lakenheath, in which I have been able to gain a full view of their operations and the collaborative practice we abide by on our projects. Mott MacDonald gave me an outstanding work experience with their team, allowing me to speak to people at all levels and demonstrating to me the key differences in operations between an external contractor and DIO to help me recognise how public and private practices interlink. I spent the majority of my time learning the ins and outs of Quantity Surveying in the private industry with Mott MacDonald’s F-35 Commercial team."
        },
        {
            "text": "Although my primary outtake from work is to develop my professional and academic skills, I have also had experiences incomparable to those I could imagine anywhere else. Whilst working on the runways at Lakenheath I was able to witness the fighter jets taking off and landing first-hand, including up-close experience on the taxiway waiting for the jets to move past before I was able to cross the runway myself. This was a surreal experience I will never forget, and I continue to look forward to more of these experiences with my team in MPP."
        },
        {
            "text": "For anyone considering an apprenticeship I highly recommend working with  DIO in a large team such as MPP as the opportunities are unlimited and the large number of colleagues provide an endless variety of skills, wisdom and advice to help you develop as a professional and assist you with your academic goals."
        }
    ]
}