{
    "url": "https://healthcareleaders.blog.gov.uk/2022/02/11/our-plans-to-tackle-the-covid-19-backlog/",
    "title": "Our plans to tackle the Covid-19 backlog",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Supporting NHS staff"
    ],
    "pub_date": "2022-02-11T18:29:07+00:00",
    "content": [
        {
            "text": "No institution has felt the burden of the Covid-19 pandemic more than the NHS. While you have met the challenges of the pandemic with great skill, dedication and resilience, it is clear that there are ongoing pressures which need addressing urgently."
        },
        {
            "text": "We know that waiting lists will continue to rise before they fall. The latest data shows that the number of people waiting for elective care in England now stands at 6 million, and we estimate that during the pandemic around 10 million people did not come forward for the care they need."
        },
        {
            "text": "I know that this means additional pressures on you and how you deliver care for your patients."
        },
        {
            "text": "This week, the NHS published a new, ambitious plan for tackling the Covid-19 backlog of elective care."
        },
        {
            "text": "It shows how we will help this country’s health and care system to recover from the disruption of this pandemic but also how we will make reforms that are so important for the long-term."
        },
        {
            "text": "It will allow the NHS to perform at least 9 million extra tests and checks and procedures by 2025 and around 30% more elective activity each year in 3 years’ time than it was doing even before the pandemic."
        },
        {
            "text": "The Delivery Plan is built around four key areas: increasing health service capacity, prioritising diagnosis and treatment, transforming the way elective care is provided and improving information and support for patients. Investing in these areas gives us the best opportunity to reduce these long waiting times and deliver real benefits for patients."
        },
        {
            "text": "It is the first of these areas which I want to expand on here: increasing health service capacity."
        },
        {
            "text": "Recovering elective services and bringing down waiting lists means addressing workforce shortages across the NHS. While our workforce continues to grow, and we now have more doctors and nurses working in the NHS than ever before, we must ensure that we are able to meet the demand on services with the right staffing levels."
        },
        {
            "text": "We are working at pace to tackle these shortages by identifying and addressing gaps across staff groups, including recruiting over 10,000 international nurses and an additional 5,000 healthcare support workers in total this financial year. Our plans also include the recruitment of an additional 3,000 NHS reservists to join the 17,000 who have already been deployed across the country"
        },
        {
            "text": "Alongside bringing in new staff, it is vital that we also support existing staff. All staff, from consultants to cleaners, physios to porters, are the lifeblood of the NHS and work incredibly hard, particularly over the last two years."
        },
        {
            "text": "We are taking action through the People Plan to enable staff to work more flexibly, recognising this can be a barrier to people remaining in the NHS, particularly towards the end of their careers. These plans will address issues around how different people experience working in the NHS, to ensure it is the best possible place to work, regardless of someone’s background. Finally, we have established mental health and wellbeing hubs and introduced self-help apps and helplines to support you with your own mental and physical health and wellbeing."
        },
        {
            "text": "Beyond growing and supporting the workforce, I’m also determined to provide you with the right tools and technology to tackle the growing demand for elective services."
        },
        {
            "text": "For example, we’re investing in digital technology such as Robotic Process Automation, which can reduce the time spent on the paperwork typically needed for patient registration, admission and discharge."
        },
        {
            "text": "Throughout the pandemic you have responded with distinction by adapting and delivering care in new and innovative ways. Through our plans for elective recovery, we will make sure that you have the support and investment you need, now and in the future."
        }
    ]
}