{
    "url": "https://dfedigital.blog.gov.uk/2022/02/11/podcast-s1-ep7/",
    "title": "Podcast – Think digital, act human: neurodiversity is a superpower",
    "authors": [
        "Adaobi Ifeachor, Product Manager"
    ],
    "categories": [
        "accessibility",
        "culture",
        "neurodiversity",
        "podcast"
    ],
    "pub_date": "2022-02-11T09:31:13+00:00",
    "content": [
        {
            "text": "Here is our seventh episode of the ‘Think digital, act human’ podcast. It’s the last one in our pilot series."
        },
        {
            "text": "We asked the question can neurodiversity be a super power on a product delivery team?"
        },
        {
            "text": "Content Designer Laura Croft and Lead User Researcher Simon Hurst, give us some fascinating insight about how the wiring in their brains helps them to flourish in their digital and technology roles."
        },
        {
            "text": "But it’s not always plain sailing – listen to them tell it like it is."
        },
        {
            "text": "They explain what ADHD, autism and dyslexia feel like in the workplace, and how their openness is making a big difference to others."
        },
        {
            "text": "Let us know what you think."
        },
        {
            "text": "If you’re short on time, you can fast forward."
        },
        {
            "text": "1:33   Simon explains what neurodiversity is\n4:19   Laura talks about how her dyslexia is her superpower\n6:16   Simon talks about how his ADHD can help or hinder his work\n12:52 debate about whether everyone should get a reasonable adjustment if only one person needs it\n18:13 Simon talks about why it’s important to think of neurodiversity as a superpower\n24:32 Laura talks about applying her strengths to the digital world\n27:39 Simon talks about being Accessibility lead for Digital and Technology\n31:27 Simon talks about being tested for autism at work and employers or peers spotting signs\n37:12 the neurodiversity community at DfE\n40:39 building a community by being open, creating a manual of me and talking about your neurodiversity"
        },
        {
            "text": "Read the podcast transcript and subscribe to future DfE Digital and Technology podcasts on Podbean."
        }
    ]
}