{
    "url": "https://educationhub.blog.gov.uk/2022/02/vaccinations-for-clinically-vulnerable-children-and-young-people-your-questions-answered/",
    "title": "Vaccinations for clinically vulnerable children and young people– your questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Families"
    ],
    "pub_date": "2022-02-11T12:48:17+00:00",
    "content": [
        {
            "text": "This post was last updated on Tuesday 26 April 2022 to reflect the latest guidance."
        },
        {
            "text": "We understand that some parents and carers have concerns about COVID-19 vaccinations for children and young people. We have listened carefully to their worries and, in partnership with the UK Health Security Agency (UKSHA), NHS England and the Department of Health and Social Care, we have sought to provide some reassurance and clarification below, including for children who are clinically vulnerable."
        },
        {
            "text": "Our priority is for the delivery of face-to-face, high-quality education to all pupils and students. We are confident that vaccinating children and young people will increase their protection against COVID-19."
        },
        {
            "heading": 3,
            "text": "Why should my child get vaccinated?"
        },
        {
            "text": "Vaccines remain our best weapon against this virus. By getting vaccinated, children and young people can increase their protection against Covid-19."
        },
        {
            "text": "While most children infected usually have mild symptoms from COVID-19 some may go on to develop more serious symptoms including ‘long Covid’. Doctors are still learning about these long-term effects but we know that vaccination helps to protect against these risks."
        },
        {
            "heading": 3,
            "text": "Which children and young people are eligible for vaccinations?"
        },
        {
            "text": "All young people aged 5 and over are now eligible for two doses of the coronavirus (COVID-19) vaccine. Children aged 5-15 who are not in a risk group should have the two doses a minimum of 12 weeks apart. Those aged 5-15 in a risk group or who live with someone with a weakened immune system should have their two doses a minimum of 8 weeks apart."
        },
        {
            "text": "Those aged 12 to 15 who are at higher clinical risk, or who live with someone with a weakened immune system can also receive a booster dose from three months (91 days) after their second dose."
        },
        {
            "text": "Anyone aged 12 and over who was severely immunosuppressed at the time of their first or second dose, should also receive a third dose as part of their primary course, and a follow up booster dose after three months."
        },
        {
            "text": "The Joint Committee on Vaccination and Immunisation has now advised that those aged 12 and over who are immunosuppressed, which includes the severely immunosuppressed, should also receive a Spring booster between three and six months after their last dose. Everyone who is eligible will be offered a top up dose over the Spring and early Summer before the end of June."
        },
        {
            "text": "If your child is eligible for vaccination your local NHS team will be in touch. If your child is in a risk group and has not been invited, please call NHS 119 or contact your GP to make an appointment as soon as possible."
        },
        {
            "text": "More information is available here: NHS expands COVID vaccinations to the most vulnerable 5 to 11 year olds  or you can read the guide for parents here: COVID-19 vaccination guide for parents of children aged 5 to 11 years."
        },
        {
            "text": "The description of higher clinical risk is set out in the UK Health Security Agency (UKHSA) Green Book. This includes those with:"
        },
        {
            "text": "If you are unsure, call 119 or alternatively your GP (family doctor) or specialist should advise you about the COVID-19 vaccinations for your child. Some parents may receive a letter, or a phone call to invite them to make an appointment for their child to be vaccinated."
        },
        {
            "text": "The table below sets out eligibility for children and young people:"
        },
        {
            "heading": 3,
            "text": "How can my child get a vaccine?"
        },
        {
            "text": "Getting a vaccine is free and takes just a few minutes."
        },
        {
            "text": "Eligible children or their parents/carers can book an appointment through the National Booking Service and there are hundreds of convenient sites across the country, including community pharmacies, GPs and large vaccination centres. Walk-in centres are also available - find your nearest here www.nhs.uk/vaccine-walk-in. You do not need an NHS number to attend a walk-in. You may be able to get different members of your family vaccinated at a walk in at the same time – check the walk-in website to see which sites can vaccinate people of different ages."
        },
        {
            "text": "Severely immunosuppressed 12 to 15 year olds may get a third primary dose at a walk-in site when they present evidence about their condition or medication. Evidence may include recent hospital letters that describe the condition or treatment that caused the child to have a severely weakened immune system at the time of the first or second dose, or a prescription or medicine box with their name and date when the medicine was prescribed. If they think they are eligible but do not have a suitable letter, prescription or medicine box, they may still be able to receive their vaccination. They can speak to an on-site clinician who can make an assessment of their eligibility. Sites who are offering this service will have indicated 'third dose availability' under their profile on the walk-in vaccination site finder and must also have indicated availability for this age group."
        },
        {
            "text": "NHS leaflets provide information for parents and young people on the vaccine, including how it works and what to expect after COVID-19 vaccination:"
        },
        {
            "text": "It is not too late for a first vaccine, so we urge all who have not yet come forward to do so – to get the best protection for themselves, for their families and their communities."
        },
        {
            "text": "Many local clinical commissioning groups (CCGs) and local authorities (LAs) publish information on walk-in and pop-up vaccination sites availability, including special quiet sessions or sessions for those who have learning disabilities, or where reasonable adjustments need to be made."
        },
        {
            "text": "The NHS encourages parents, or those with parental responsibilities, to attend vaccination appointments with their child as consent is collected on the day so this is the best way to make sure they can be vaccinated by going through questions together on site."
        },
        {
            "heading": 3,
            "text": "Is the vaccine safe? My child takes other medication and I am worried about how their current medication will interact with the vaccine.  "
        },
        {
            "text": "Yes. Serious allergic reactions to vaccination are very rare but tend to happen within a few minutes of the injection. Vaccination teams are trained to spot and manage allergic reactions and all children with specific allergies may be asked to wait and be observed for a period after vaccination."
        },
        {
            "text": "If you have further questions about potential vaccine side-effects, please refer to the what to expect after your child’s COVID-19 vaccination guidance here: https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1045901/COVID-19-what-to-expect-5-11years.pdf"
        },
        {
            "text": "A guide for parents of children aged 5 to 11 years of age at high risk - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 3,
            "text": "Which vaccination will be offered to children aged five to eleven?"
        },
        {
            "text": "They will be offered 2 x 10-microgram doses of the Pfizer COVID-19 paediatric vaccine, which is a third of the strength of the adult dose."
        },
        {
            "text": "Following the decision to vaccinate at risk children aged five to eleven, the Medicines and Healthcare products Regulatory Agency (MHRA) liaised closely with other international regulators and public health bodies and carefully considered global data on use in children aged five to eleven. It found that an overwhelming majority of side effects related to mild symptoms."
        },
        {
            "heading": 3,
            "text": "I worry that there is not enough long-term data about the vaccine and its effects. What reassurance can you give me? "
        },
        {
            "text": "Contracting COVID-19 presents a risk to a small proportion of children and young people, in particular those with underlying conditions. The burden of long-term effects from COVID-19 in children remain under investigation."
        },
        {
            "text": "Having the vaccine makes your child less likely to catch and get very ill from COVID-19."
        },
        {
            "text": "All vaccines have had 3 stages of clinical trials and were tested on tens of thousands of people around the world. The trial phases were run in parallel, speeding up the overall time of vaccine production, but not the critical research time. Since December 2020 the Pfizer vaccine has been given to millions of people in the UK and has an excellent safety record."
        },
        {
            "text": "The experience reported in under 18s is similar to that identified in the general population and review of these reports does not raise any additional safety concerns specific to this age group. The UK has benefited from having data from the US, Canada and Israel, which have already offered vaccines universally to young people aged 12 to 15 years. These NHS videos explain this in more detail:"
        },
        {
            "text": "The Medicines and Healthcare products Regulatory Agency (MHRA) closely monitor any adverse drug reactions to approved COVID-19 vaccines, and produce a weekly report."
        },
        {
            "heading": 3,
            "text": "What additional support is there for children with SEND whilst they get vaccinated? Are home visits available / are vaccination staff trained to accommodate any additional needs they may have? "
        },
        {
            "text": "Vaccination sites are minimising any waiting times at the site for children, and should be able to support any child or adult with additional needs by making the reasonable adjustments they require. In addition, there have also been other initiatives including local public webinars for autism and learning disability groups and family events at walk-ins and pop-ups to enable families to get vaccinated together. Please look at your local NHS provider website to find out more."
        },
        {
            "text": "Easy-read guides for adults and Easy Read guide for children and young people providing information on coronavirus (COVID-19) and vaccination have been published for individual and families."
        },
        {
            "text": "The NHS has worked with the UK Health Security Agency (UKHSA) and other partners to ensure all vaccination offers  consider the communication and access needs of individuals and their families. Advice, training and guidance has been given to all vaccination sites and practitioners to ensure best practice and a positive patient experience.  This includes guidance on supporting people with disabilities and making reasonable adjustments."
        },
        {
            "heading": 3,
            "text": "My child is scared of needles. Are there alternative options to the vaccine, or adjustments that can be put in place to make them feel at ease? "
        },
        {
            "text": "There is currently no nasal spray COVID-19 vaccine approved for use in the UK."
        },
        {
            "text": "Your child (or you) should tell the person who is delivering the injection about their worries. They may be able to answer any specific questions and make adjustments to help make the process easier."
        },
        {
            "text": "The following leaflet explains more about needle phobia and provides practical advice on how to overcome it Overcoming your fear of needles.doc (guysandstthomas.nhs.uk)."
        }
    ]
}