{
    "url": "https://companieshouse.blog.gov.uk/2022/02/11/why-i-chose-to-be-a-data-scientist/",
    "title": "Why I chose to be a data scientist",
    "authors": [
        "Savitri Pandey - Senior Data Scientist"
    ],
    "categories": [
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2022-02-11T09:35:03+00:00",
    "content": [
        {
            "text": "I joined Companies House during the coronavirus (COVID-19) pandemic with remote working arrangements. The data science team is very small, and I'm the only woman in the team. Despite this, I've always felt valued, and know my seniors always consider my opinion. My colleagues are friendly, helpful and approachable and give me constructive feedback which helps me to improve my performance."
        },
        {
            "text": "My dream has always been to work in the Civil Service. It’s something I’ve worked hard for and I’m now a Senior Data Scientist in Companies House. I feel that the organisation provides an opportunity for me to grow and solve real-world business problems."
        },
        {
            "text": "I was born and brought up in India, and before moving to the UK in 2006 under the Highly Skilled Migrant Programme, I worked as a lecturer for over 10 years in various Indian universities and colleges. It was while doing my MSc in Mathematics & Computer Science I developed a great passion for Natural Language Processing (NLP) and Artificial intelligence (AI)."
        },
        {
            "text": "From an early age, I've been fascinated by numbers. This led me to gain a higher degree in mathematics and a unique interest in computer science and data science. I followed my curiosity and quickly became fascinated with machine learning."
        },
        {
            "text": "My passion with language drove me to explore NLP in depth. I was lucky to explore the application of NLP and worked as a text mining specialist for more than 8 years. I worked on multiple data science projects building various models to tackle business problems such as document prioritisation, classification, automation, and extracted named entity (a technique in NLP) from their data."
        },
        {
            "text": "My current role is to develop a cost-effective automation tool that will reduce manual work. By resolving critical business problems, it means users do not have to manually update hundreds of spreadsheets every month."
        },
        {
            "text": "This automated tool can:"
        },
        {
            "text": "I’m also involved in other major projects that focus on studying the impact of real-time indicators, such as social media and other micro-economic factors on the growth in the UK economy. This is done by analysing the incorporation and dissolution of the company’s data on the Companies House register."
        },
        {
            "text": "I have a great interest in gaining new knowledge and learning new skills due to the rapid growth and constantly changing characteristics of data science. The desire to learn and acquire understanding on new data science techniques is a significant element that constantly helps me to enhance my analytical capabilities."
        },
        {
            "text": "Data science is currently a very much in-demand area and there’s a lot of excitement about advances in this field. However, the participation of women in this sector is still very low - only 15%."
        },
        {
            "text": "The role is exciting but can be at times challenging - 80% of the data scientist's time is spent on data cleaning. More often than not, data is very messy. There’s a lot of groundwork that goes into preparing data. We must make sure it’s good enough for the analysis we want to use it for, to enable us to get the results needed. To address any specific business need, such as looking for trends, opportunities, and hidden weaknesses, multiple and complex data science approaches are used."
        },
        {
            "text": "Examples of data science approaches are:"
        },
        {
            "text": "In turn, I need to communicate the findings to management and recommend a cost-effective approach, linking existing strategies and procedures in a clear and relevant way so that they can make the best data-driven decision."
        },
        {
            "text": "Outside of work I love travelling and my dream is to buy a sports car and go racing. I also have a great passion for DIY and spend my time creating new things with recycled items. The supportive and flexible working culture at Companies House enables me to continue to follow these passions and gain a good work-life balance."
        }
    ]
}