{
    "url": "https://aphascience.blog.gov.uk/2022/02/11/women-in-science-2022/",
    "title": "Celebrating our female scientists",
    "authors": [
        "Kath Webster",
        "Heather O'Sullivan"
    ],
    "categories": [
        "Women in science"
    ],
    "pub_date": "2022-02-11T09:00:22+00:00",
    "content": [
        {
            "text": "International Day of Women and Girls in Science falls each year on 11 February and is an occasion we mark annually on the APHA science blog. This year, we hear from APHA Director or Scientific Services, Dr Kath Webster, as she reflects on her own career and highlights the important work of our female scientists in the current avian influenza (AI) outbreak."
        },
        {
            "text": "In a world where Science, Technology, Engineering and Mathematics (STEM) careers have traditionally been male dominated, at APHA we are proud of the fact that 60% of our scientific workforce are female, from a spectrum of different backgrounds, working in a range of different roles. We offer career opportunities in a range of specialisms from front-line field work and veterinary investigation to research roles and scientific project management. Not all scientists wear white coats!"
        },
        {
            "text": "I am told that “why” was a word I used a lot as a child. I grew up on a farm in Yorkshire and was curious to understand how things worked and why some animals (and people) became ill and others did not. I enjoyed science and maths at school, particularly practical experiments and had very encouraging parents and teachers."
        },
        {
            "text": "My interest grew and eventually took me through university in Newcastle where I studied Agricultural Zoology. I learnt about a broad range of subjects including agriculture, biochemistry, plant science and specialised in microbiology, studying insects (entomology) and parasitology."
        },
        {
            "text": "Parasites have evolved some brilliant strategies to survive and many have elegant and complex life cycles which had me hooked. I studied for a Ph.D. in Veterinary Parasitology in Scotland, looking at sheep ticks as vectors of disease working both in the lab and on farms, before undertaking postdoctoral research on the causes of type 1 diabetes in people."
        },
        {
            "text": "In 1990, I moved to work at one of APHA’s predecessors, the Central Veterinary Laboratory, at Weybridge and set up the molecular parasitology research group, later also taking responsibility for routine diagnostic and surveillance parasitology. This provided opportunities to undertake and publish research with academic colleagues in the UK and international partners."
        },
        {
            "text": "In 1998, I became Head of Specialist Scientific Services, establishing the system for test validation. This meant we had detailed evidence about how tests the agency undertake work in reality and, crucially, what the results mean. We run a portfolio of about 600 different tests that we use to understand disease in animals and add new methods as needed. I also led on the production of specialist reagents (the ingredients we use to do a test) and vaccine production. This also meant that I managed complex facilities such as high containment laboratories and ensured our teams were well trained and supported."
        },
        {
            "text": "During this time bovine spongiform encephalopathy (BSE), or mad cow disease, grew in numbers of cases both in the UK and internationally and we started to understand links to human disease. Weybridge became the European Reference Laboratory for these diseases and I was the TSE European Reference Laboratory and National Reference Laboratory consultant on rapid tests, which involved overseeing testing in the EU and UK. As a leading consultant, I provided advice to UK and EU governments and National Laboratories and participated in various European Food Safety Authority (EFSA) and World Organisation for Animal Health (OIE) working groups."
        },
        {
            "text": "In 2014, I was appointed Director of Scientific Services, giving me responsibility for all areas of science across APHA. It is a role that I find extremely interesting, rewarding and all-encompassing in its nature."
        },
        {
            "text": "I thoroughly enjoy working at APHA, which has not only seen me work across many multidisciplinary teams across the agency, but also in collaboration with policy and science teams in UK government and many international colleagues. I have also been fortunate to have been able to travel extensively in my different roles which has provided me with many opportunities to continue to learn."
        },
        {
            "text": "Working in government science I have been able to “flex” my working pattern around family commitments and am very proud to have two grown up daughters who are also scientists."
        },
        {
            "text": "The Covid19 pandemic has brought scientific roles to the fore. I would really encourage all people with an interest to pursue a career in science."
        },
        {
            "text": "That is my personal career story but I would now like to highlight the work of some of the other women scientists at the agency, who are currently dealing with the largest AI outbreak in the UK to date."
        },
        {
            "heading": 3,
            "text": "How big is big?"
        },
        {
            "text": "This year’s AI outbreak has been unprecedented in its size and impact on the poultry industry and on wild birds. In fact, the current outbreak is almost 300% larger than during the previous winter which was, at the time, the largest we had seen. Staff at APHA have been working tirelessly to contain the spread of the disease in the UK. Our work also extends internationally, working with other governments and research institutes to understand the global spread."
        },
        {
            "text": "You will be able to see from the map below just how widespread the AI outbreak has been across Europe and in the UK."
        },
        {
            "text": "The outbreak of high pathogenicity AI (HPAI) virus in Great Britain from November 2020 to March 2021 consisted of 22 cases of which 19 were in England, two in Scotland and one in Wales. At the time of writing this blog, during the outbreak there have been 86 cases of HPAI of which 77 have been in England, six in Scotland and three in Wales."
        },
        {
            "text": "In peacetime, we carry out constant surveillance so that we are alerted at the earliest opportunity to new or potential cases of not just AI but a number of other animal and zoonotic diseases."
        },
        {
            "heading": 3,
            "text": "APHA’s female staff working on the outbreak"
        },
        {
            "text": "There are a number of teams working on the current AI outbreak including virologists, people delivering laboratory tests, field vets and animal health officers, veterinary advice teams, pathologists and members of the National Emergency Epidemiology Group (NEEG)."
        },
        {
            "text": "The NEEG is part of APHA’s disease response and is rapidly formed when a disease incident occurs. The NEEG is a multi-disciplinary virtual team of APHA specialists that investigate, measure and describe the causes, size and distribution of a disease outbreak. The team also provide rapid expert epidemiological analysis, evidence and advice to the Chief Veterinary Officers across the UK and policy teams in Defra, Scottish and Welsh Governments, enabling rapid response to protect the UK from disease threats."
        },
        {
            "text": "There are a variety of roles within the NEEG team, all including women who are expert in their roles, from coordination and management; field investigation of infected premises; epidemiological reporting; risk analysis; contact tracings to identify potential spread of bird flu; lab diagnostics; data analysis and modelling – and many more! One of our next APHA Science blogs will explain more."
        },
        {
            "text": "Let us now hear from a small selection of some of our female staff who have been heavily involved in the current AI outbreak as they each tell us a little about what their role entails."
        },
        {
            "text": "We hope that through raising awareness of the opportunities available to women at APHA, we might encourage a new generation of female scientists to challenge the stereotype that science is something women and girls should not be interested in."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "You may be interested in reading more of our catalogue of blogs on the work of women in science at APHA."
        },
        {
            "text": "All APHA vacancies are advertised on Civil Service Jobs."
        }
    ]
}