{
    "url": "https://naturalengland.blog.gov.uk/2022/02/11/women-in-science-a-reflection/",
    "title": "Women in Science: A Reflection",
    "authors": [
        "Rebecca Jackson"
    ],
    "categories": [
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2022-02-11T13:00:14+00:00",
    "content": [
        {
            "text": "Gender equality is integral to achieving thriving nature for people and planet and addressing the twin crisis of biodiversity loss and climate change, yet fewer than 30% of the worlds scientific researchers are women (UNESCO Science Report). Despite the efforts made to engage more women and girls in science, we continue to be underrepresented in many scientific fields."
        },
        {
            "text": "Women and Girls in Science Day (11th of February) aims to promote full and equal access to, and participation in, science for women and girls. This February, I’ve been asking women working within Natural England - and beyond, to reflect upon their life in science, and sharing those reflections across the organisation. A few of them are featured in this blog."
        },
        {
            "text": "I also want to use this opportunity to share a bit about my own experience in the hope it will provide a source of empowerment and inspiration to women at all stages of their career."
        },
        {
            "text": " "
        },
        {
            "text": "“I’ve always wanted to work in conservation, but my careers teacher thought girls didn’t do outdoors, so I set out to prove him wrong. My science journey has taken me from ecology to teaching, using the environment as therapy, to management advice. …Science has kept me curious and let me share my enthusiasm, there’s a place for everyone whether you like looking down a microscope or through binoculars”"
        },
        {
            "text": "Hannah Rigden, Historic Environment Senior Adviser, Natural England"
        },
        {
            "text": " "
        },
        {
            "text": "Ever since I was young, I have had a curiosity for nature. I remember reading books and watching David Attenborough documentaries and being completely amazed at the diversity of life on the planet. This curiosity inevitably led me to learn about the threats biodiversity faced, and as a child I was shocked and angry that no one else around me seemed to be doing anything to help."
        },
        {
            "text": "I decided to take matters into my own hands and wrote a letter to the Prime Minister. I carefully copied pictures of animals from my books and vented my concerns about the destruction of the rainforest onto two sides of A4. I’m not certain that my letter had any direct impact on policy at the time, but 10-year-old me felt a bit better for trying."
        },
        {
            "text": "I didn’t know it at the time, but I would spend the following years working towards a career that offered me the same satisfaction and empowerment that my letter had given when I was younger."
        },
        {
            "text": "Throughout my school years I followed that feeling of curiosity and concern for all things environmental or wild. It wasn’t always an easy journey, and to be honest, until very recently I had no real certainty of where I wanted to take my career."
        },
        {
            "text": " "
        },
        {
            "text": "“Don’t be afraid to change your mind and your direction within science… the interconnectivity between disciplines provides endless opportunities…”"
        },
        {
            "text": " Dr Dee Rawsthorne, Science Advisory Board Member – The Morley Agricultural Foundation"
        },
        {
            "text": " "
        },
        {
            "text": "Early career guidance offered suggestions of jobs in veterinary science or zookeeping. No one told me I could be a field researcher, an ornithologist or a lab manager – endless possibilities! Even after I made the decision to study ecology at university, I felt pressured to have a simple, definitive answer when asked what I was going to do with my degree, and where exactly I was going to work for the next 40 or 50 years. But when a child says they want to be a doctor, nobody asks them if they’re going to specialise in heads, shoulders, knees or toes. So why can’t you explore the world of science on your own terms?"
        },
        {
            "text": " "
        },
        {
            "text": "“My passion for plants was prompted by my mother; my passion for biology by a (female) teacher. I don’t think the 18-year-old me was consciously following a science career when I studied Environmental Biology at Liverpool University. I was simply doing what these two inspiring women had helped me to love.…”"
        },
        {
            "text": " Marian Spain, Chief Executive, Natural England"
        },
        {
            "text": " "
        },
        {
            "text": "Natural England provides widespread opportunities in science, from local area team advisers working with landowners, to wildlife licensing and evidence-based projects. The diversity of opportunities within the organisation enables those interested in science roles to explore numerous career possibilities. You just have to find the right opportunities for you."
        },
        {
            "text": "My career in science has taken me to some of the amazing places that I used to read about as a child – including the rainforest, of which I was so concerned. My advice to women and girls interested in science is to find the thing you feel most passionate about and follow it to wherever it takes you. If you don’t like the idea of working in a lab wearing a white coat, then THAT IS OK! Not all scientists fit that stereotype - some of us get to work outdoors and wear walking boots with muddy jeans!"
        },
        {
            "text": " "
        },
        {
            "text": "“I keep telling my young nieces that a career in science will guarantee a life of adventures and discovery. I’d also say to people “be curious” – go to talks on all aspects of STEM, reach out to potential employers, build networks, ask questions. There’s a huge world of career options out there in STEM, I’ve only scratched the surface during my career.”"
        },
        {
            "text": " Sarah Dawkins, Director – Transformation, Natural England"
        },
        {
            "text": " "
        },
        {
            "text": "Now more than ever, we need women in science to help in tackling the global environmental crisis and explore ways we can aid nature’s recovery. With so many career possibilities out there, what are you waiting for?"
        }
    ]
}