{
    "url": "https://healthmedia.blog.gov.uk/2024/07/30/enhertu-everything-you-need-to-know/",
    "title": "Enhertu: Everything you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Cancer",
        "Life Sciences",
        "Medicines"
    ],
    "pub_date": "2024-07-30T09:23:37+01:00",
    "content": [
        {
            "text": "You may have seen recent reports about the decision to not recommend a life-extending drug called Enhertu (Trastuzumab Deruxtecan) for the treatment of breast cancer on the NHS."
        },
        {
            "text": "Following ongoing commercial discussions between NICE, the NHS and the drug manufacturer, Daiichi Sankyo (and partner, AstraZeneca), a decision was made by NICE not to recommend the drug, based on unreasonable and unaffordable pricing."
        },
        {
            "text": "If you or a family member are affected by the decision, you may have some questions. The following guide may help to answer some of those."
        },
        {
            "heading": 2,
            "text": "Why would NICE not recommend Enhertu?"
        },
        {
            "text": "These are very difficult decisions to make and they are taken independently by NICE on the basis of an assessment of the available evidence of costs and benefits and through extensive engagement with the NHS, drug manufacturers and others."
        },
        {
            "text": "Treatments should be provided at a price that is fair to the NHS and the taxpayer."
        },
        {
            "heading": 2,
            "text": "How many people will be affected by this decision?"
        },
        {
            "text": "According to NICE, it is estimated around 1,000 people would have been eligible for Enhertu if it had been recommended."
        },
        {
            "heading": 2,
            "text": "Why is this available in Scotland and not England?"
        },
        {
            "text": "UK health is devolved, which means Scotland can make its own decisions on the drugs it uses on the NHS. In this case, the Scottish Medicines Consortium (SMC) used its own methodology to reach its decision."
        },
        {
            "text": "NICE updated the methodology it uses to evaluate medicines back in 2022 to ensure greater weighting could be given to medicines that address severe diseases. Despite this, Enhertu was still found to be too expensive at the price being offered by manufacturers. NICE and NHS have discussed this at length with Daiichi Sankyo (and partner, AstraZeneca) and tried to be as flexible as possible to accommodate the drug manufacturer’s commercial requests, but they have not been willing to offer Enhertu at a price that NICE could agree to."
        },
        {
            "text": "NICE has made clear that they will consider re-engaging in commercial discussions if the companies propose a fair and reasonable commercial offer."
        },
        {
            "heading": 2,
            "text": "How can I find out more?"
        }
    ]
}