{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/07/30/gse-profession-at-civil-service-live-2024/",
    "title": "GSE Profession at Civil Service Live 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Collaborating & Networking",
        "GSE Profession Updates",
        "Latest Stories"
    ],
    "pub_date": "2024-07-30T15:58:43+01:00",
    "content": [
        {
            "text": "Civil Service Live is an annual staff-learning conference, designed to allow civil servants to network, listen to thought-provoking sessions and share experiences and expertise. It is also an opportunity for civil servants to demonstrate leadership, learn new skills and improve their working environment to provide better public services. This year, the Government Science and Engineering (GSE) Profession team attended Civil Service Live in five locations across the UK: Edinburgh, Birmingham, Blackpool, Newport and London. "
        },
        {
            "heading": 3,
            "text": "Spotlighting Government Science and Engineering "
        },
        {
            "text": "Society faces many challenges which science and engineering can help to solve and the GSE Profession is helping to achieve this. The profession is a hub of highly talented, innovative and inspiring science and engineering leaders, who are delivering on exciting and challenging work that will make a difference to the lives of people across the UK. "
        },
        {
            "text": "This year, we aimed to spotlight examples of ground-breaking work delivered by our scientists and engineers across organisations through presentation sessions and live demonstrations to emphasise how the GSE is building science capability across government. "
        },
        {
            "text": "This year’s sessions included: "
        },
        {
            "text": "We were also joined by Government Chief Scientific Adviser and Head of the GSE Profession, Professor Dame Angela McLean, who delivered a session on the potential of engineering biology. "
        },
        {
            "heading": 3,
            "text": "Getting hands on at the GSE stand "
        },
        {
            "text": "In all locations, the GSE Profession had a stand in the main exhibition area. There, we showcased a range of demos, interacting with conference delegates and sharing the GSE Profession offer to show the benefits of membership. In Edinburgh, Professor Dame Angela McLean, demonstrated the Reed-Frost model, a visual demonstration of how to model a pandemic and see the spread of infectious diseases with the use of marbles. Civil Service Chief Operating Officer, Cat Little, stopped by to try out the demonstration. "
        },
        {
            "text": " "
        },
        {
            "text": "Across the other locations, we spotlighted a range of demonstrations, including: "
        },
        {
            "text": "Virtual reality kit from the Health and Safety Executive agency, which showed a virtual tour of their laboratories and explosive sites.  "
        },
        {
            "text": "National Nuclear Laboratory Lego model, which depicted a hypothetical UK city in 2050, showing the various sources of low-carbon energy generation and the different forms of energy generated along with energy storage and the use of nuclear material​.  "
        },
        {
            "text": "National Physical Laboratory Dolls of Confusion, which were 6 dolls that all had various weights and sizes. The task was to organise the dolls in order of weight – highest to lowest and then to use the scale to accurately measure them to see how close you were.​ This was more difficult than it sounds! "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Wrapping up Civil Service Live 2024"
        },
        {
            "text": "As we round up Civil Service Live for another year, we have welcomed over 700 new members to the GSE Profession but spoke to countless more civil servants to share what we do and how we support building science capability across government. Civil Service Live 2024 was a great success and we look forward to meeting more of you next year."
        },
        {
            "text": "If you are interested in how the GSE Profession can support you, visit our blog. If you are a civil, crown or public servant and would like to sign up to the profession, please click here or contact us on gse@go-science.gov.uk for any further information."
        }
    ]
}