{
    "url": "https://kingsawards.blog.gov.uk/2024/07/30/lord-lieutenant-for-west-yorkshire-visits-accu-to-present-the-kings-award-for-enterprise-in-international-trade/",
    "title": "Lord-Lieutenant for West Yorkshire Visits Accu to Present The King’s Award for Enterprise in International Trade",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Recipients"
    ],
    "pub_date": "2024-07-30T15:54:24+01:00",
    "content": [
        {
            "text": "Accu, a leading precision engineering components supplier, was honoured with The King’s Award for Enterprise in International Trade last Friday (19/07). The prestigious award was presented by the Lord-Lieutenant for West Yorkshire, Ed Anderson, in recognition of Accu’s outstanding achievements in international trade."
        },
        {
            "text": "The ceremony, held at Accu’s new headquarters, celebrated the company’s significant growth in overseas sales, which have increased by 383% over the last six years. This remarkable achievement highlights Accu’s commitment to providing high-quality products and exceptional customer service to its global clientele."
        },
        {
            "text": "As part of the celebration, Accu showcased some of its latest innovations and products, highlighting its ability to meet the evolving needs of the engineering industry. The event was attended by local dignitaries, industry partners and employees, all of whom joined in celebrating this milestone achievement."
        },
        {
            "text": "Accu’s CEO, Martin Ackroyd (pictured on the left in the below image), expressed his gratitude: “We are immensely proud to receive The King’s Award for Enterprise in International Trade. This award is a testament to the hard work and dedication of our entire team. We have always focused on innovation, quality and customer satisfaction, and this recognition is a reflection of those values.”"
        },
        {
            "text": "The Lord-Lieutenant, Ed Anderson, praised Accu for its contribution to the local economy and international trade. “Accu’s success is a shining example of what can be achieved with vision, hard work and a commitment to excellence. They are a credit to West Yorkshire and the UK’s engineering sector.”"
        },
        {
            "text": "   Accu’s UK Director, Alastair Morris (pictured above), praised the entire team saying: “I couldn’t be prouder of our team. Their hard work, innovation and commitment to quality have not only fueled our growth but have also set new standards in the industry. This award belongs to each and every one of them.”"
        },
        {
            "text": "Accu has established itself as a trusted supplier of precision engineering components, offering over 500,000 products to customers in more than 100 countries, including over 50% of the world's top manufacturers. The company’s dedication to continuous improvement and customer-centric approach has set it apart in a competitive market."
        },
        {
            "text": "Find out more about Accru here: https://www.accu.co.uk/"
        },
        {
            "text": " "
        },
        {
            "text": "Apply for the next round of King's Awards for Enterprise here: https://www.gov.uk/kings-awards-for-enterprise"
        }
    ]
}