{
    "url": "https://naturalengland.blog.gov.uk/2024/07/30/national-conversation-needed-on-how-to-turbo-charge-nature-recovery-while-building-the-homes-the-country-needs/",
    "title": "National conversation needed on how to turbo-charge Nature recovery while building the homes the country needs",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Development",
        "Environment Act",
        "Environmental Improvement Plan",
        "Green Infrastructure",
        "Natural England",
        "Nature-based solutions",
        "Nutrient Neutrality"
    ],
    "pub_date": "2024-07-30T12:05:31+01:00",
    "content": [
        {
            "text": "England doesn’t have enough houses, and also doesn’t have enough Nature. If we are to succeed in meeting our national needs, we require more of both. For too long we’ve been told that the only way to build more homes is to lose space for Nature while the only way to protect it is through a ‘ring of green steel’ around our towns and cities, known as the green belt.\nBut this isn’t working for people, Nature, or the environment."
        },
        {
            "text": "Time for a nature positive planning"
        },
        {
            "text": "We need to look at the planning system differently. Currently planning applications are dealt with in a reactive site by site way, which is inefficient, resource intensive for all parties, and can cause delays to the development of housing and infrastructure. Building millions of homes while accelerating Nature recovery requires a joined-up approach that avoids environmentally harmful development while harnessing the contribution housing can make to restoring our natural world."
        },
        {
            "text": "Stepping away from the current piecemeal approach and adopting a broader landscape view would enable the state of Nature, health of river catchments, water resources, climate change adaptation, levels of pollution and spaces for public enjoyment to be considered and planned in an integrated way, alongside the design of new residential areas. This would not only enable new homes to be built, but also create beautiful and healthy places."
        },
        {
            "text": "Such an approach could be used across the country, including in what is presently greenbelt. For many the greenbelt has taken on totemic status and become sacrosanct, but parts of the greenbelt around England are pretty bereft of wildlife, have little value in terms of food production, and are closed off to the public. It seems to me though in many areas it could be made better than it is now - a greener and wilder belt."
        },
        {
            "text": "Green infrastructure at the heart "
        },
        {
            "text": "Development could unlock the vital funding needed to turbo-charge recovery in these areas. New developments that are designed with good quality green infrastructure from the outset – for example with extensive mosaics of new wetlands, grasslands, native shrublands and woods, connected to new housing with footpaths and cycle ways – would create good places to live, from land that is at present not providing huge value to society. This, in turn, attracts skills and investments and improves the lives and wellbeing of the local community. This is supported by a growing wealth of evidence."
        },
        {
            "text": "To do this, we need to go further with an ambitious and robust green infrastructure framework in local policy plans and design codes. This will ensure that development contributes positively toward Nature recovery, benefiting people, and contributing to the legal Environment Act targets. Ecologists, planners and developers working together can pull this off, so long as the direction of travel is clear and we move beyond the mindset of ‘the environment or houses’ and into one of ‘environment and houses’."
        },
        {
            "text": "This has to be done correctly. It needs to involve everyone that has a stake and should not undermine areas where greenbelt is preventing urban sprawl."
        },
        {
            "text": "It is right that the government should be focused on the so-called ‘grey belt’ - the lower quality land which has limited value for nature and wildlife. For example, a disused car park or petrol station that happens to be in the greenbelt. This should not be about reducing the protection of nature, rather it is about maintaining and going beyond those protections in ways that are quicker, more strategic, and more efficient."
        },
        {
            "text": "Work is underway "
        },
        {
            "text": "There are growing examples where we are already delivering for nature while sustainable development goes ahead. In the Chilterns where demand for additional housing is putting pressure on the region’s protected sites and nationally important woodlands, we have created Sustainable Alternative Natural Greenspace for the community to use for recreation which has eased the pressure on the areas protected for wildlife and accommodated more homes for local people."
        },
        {
            "text": "Another strategic solution we have in place is the nutrient mitigation scheme which has enabled more than 3,500 homes to be built in the Tees Valley. This pragmatic solution has stopped pollution from new homes entering our internationally important rivers and estuaries with the creation of new nature recovery sites which has enabled wildlife to thrive. We recently secured further nutrient mitigation at Lyscombe Farm in Dorset, where 3,700 homes can now be built within the Poole Harbour catchment while numerous rare birds, such as avocets, spoonbills and black-tailed godwits will be protected from additional pollution. Our position has not changed on the need to continue to act to secure nutrient neutrality and to maintain the environmental protection that underpins it. But there may be ways to deliver it that could be faster and more certain for developers and deliver even more for nature. We look forward to working on this with government so we can fulfil environmental and legal obligations while achieving the policy ambitions of Ministers."
        },
        {
            "text": "Biodiversity Net Gain – a key part of the Environment Act – will also now ensure that new developments deliver at least a 10% gain for nature and leave the environment in a better state than it was found. Multiple developers have adopted this approach long before it became a mandatory requirement and gone far beyond the minimum 10% to deliver a legacy for nature and future generations. The Kidbrooke Village development in south east London has delivered over 100% Biodiversity Net Gain already, creating a real opportunity to halt and reverse species decline."
        },
        {
            "text": "These solutions are pieces of the same puzzle which need to be used together in order to see the bigger picture and achieve the overarching aim of sustainable development which delivers for both people and nature."
        },
        {
            "text": "It is time for the start of a national conversation about how to turbo-charge Nature recovery while building the homes the country needs. Our role at Natural England in this process is to advise the government on how to achieve its ambitious environmental targets through sustainable development. For example, we provided advice to the previous government on various options on how to achieve nutrient neutrality and received a direction to operate the Nutrient Mitigation Scheme."
        },
        {
            "text": "We are one of the most Nature-depleted countries in the world and have a steep hill to climb to halt Nature decline by 2030 as the government has committed to doing. Making a change will not be easy, and these are difficult conversations – not least because we are an island which needs to balance different priorities competing for finite space, whether that’s land needed to produce food, energy or set aside for nature or housing."
        },
        {
            "text": "Concerted action is needed from all parts of society to put Nature on the road to recovery, and a new approach toward how we plan new housing landscapes could be one powerful way for making progress."
        },
        {
            "text": "This blog is a longer version of an opinion article first published on Sunday 28 July in the Sunday Telegraph."
        }
    ]
}