{
    "url": "https://ruralpayments.blog.gov.uk/2024/07/30/steve-from-the-grants-service-team-tells-us-about-his-work-as-an-rpa-ambassador/",
    "title": "Steve from the Grants Service team tells us about his work as an RPA Ambassador",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement",
        "Grants"
    ],
    "pub_date": "2024-07-30T09:54:19+01:00",
    "content": [
        {
            "text": "RPA offers a range of grants and rural payments to farmers and businesses. In this blog, Steve France from the Grants Service team writes about his work attending shows as an RPA Ambassador. The Ambassadors represent RPA by engaging with a wide variety of external audiences including farmers and stakeholders and get the chance to gain an increased appreciation of the farming industry. "
        },
        {
            "text": "Hi, I’m Steve and I’m in the Grants Service Development Team - a fast-paced role focused on the development of published products to support the launch of new grant schemes. I’ve been to several shows and events this summer as an RPA Ambassador, which is a great opportunity to learn more about what we do and meet those we support."
        },
        {
            "text": "Representing RPA at shows is the connection you need to hear and better understand how our work impacts on farmers, and where there is scope for change or learning for the future."
        },
        {
            "text": "Attending the Lincolnshire and Great Yorkshire shows recently provided opportunities to meet and chat with farmers, agents and even those who supply services and equipment to farm businesses through our grants and schemes."
        },
        {
            "text": "It’s interesting to hear people’s stories, the genuine passion and care for the environment and the desire to create a sustainable future business for others. It’s amazing what you can learn from those around you in a very short time at these events. My knowledge and ability to answer questions grew from observing others in action and vice versa for others when I was answering enquires about my area of the business, which is Grants."
        },
        {
            "text": "We do get asked some common questions which are around ‘what’s available?’, ‘how do I find out more about it?’, ‘is it hard to apply?’, ‘how much could I get?’ and ‘when will the next round be?’."
        },
        {
            "text": "When you’re in the office, it’s easy to get caught up in the everyday processes, but to hear from those we’re ultimately there to support is the reality. Those we support have a hard job and to hear positive feedback about what our team has worked on is really satisfying."
        },
        {
            "text": "There’s also time given to look around and explore the events and, in my case, following the recent General Election an opportunity to meet our new Secretary of State for the Environment Steve Reed, who held a press event at the Defra/RPA stand at the Great Yorkshire Show."
        },
        {
            "text": "I’ve also taken a lead role with the Grants Development Team to support in all aspects of creating scripts and narrating external pre-recorded presentations and webinars for YouTube about the grants schemes we launch, so do check these out if you’re interested."
        }
    ]
}