{
    "url": "https://stratcommand.blog.gov.uk/2024/07/30/we-are-strategic-command-with-lily-lotay/",
    "title": "We Are Strategic Command with Lilly Lotay",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-07-30T12:43:18+01:00",
    "content": [
        {
            "text": "Discover how Lilly ensures compliance with critical procedures, adapts to diverse locations, and promotes UK Defence through Strategic Command's support and leadership."
        },
        {
            "text": "Interviewer: Could you introduce yourself and tell us about your background?"
        },
        {
            "text": "Lilly: I'm Lilly Lotay, and I've been with the Directorate of Overseas Bases (DirOB) since 2018."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What is your role within the Directorate of Overseas Bases?"
        },
        {
            "text": "Lilly: I work as the Assurance Lead, which means I provide the Senior Leader Team with assurance that all procedures and processes are being followed."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What kind of procedures and processes do you ensure are followed?"
        },
        {
            "text": "Lilly: It could be civilian claims, travel and subsistence claims, overtime claims, and so on. We check if the processes have been followed and if the necessary approvals are in place."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: It sounds like a diverse range of tasks. How do you adapt to different locations?"
        },
        {
            "text": "Lilly: One size doesn't fit all. It's about determining what is suitable for each location and what isn't, and working with each location to figure out how we can move ahead and embed some of the procedures there."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How do these procedures impact the overseas bases and their perception of UK Defence?"
        },
        {
            "text": "Lilly: All the overseas bases are promoting what Defence is. If people are not aware of UK Defence, they do get some perception from our efforts."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does Strategic Command support its key organisations?"
        },
        {
            "text": "Lilly: Strategic Command provides a structure and coordination to its nine key organisations, offering leadership to ensure everything operates smoothly."
        }
    ]
}