{
    "url": "https://food.blog.gov.uk/2024/07/30/what-are-bamboo-plastic-composites-and-why-they-shouldnt-be-used-for-food-or-drink/",
    "title": "What are bamboo plastic composites and why they shouldn’t be used for food or drink",
    "authors": [
        "Allan Shivembe, Senior Food Policy Adviser - Food Contacts Materials"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-07-30T09:53:56+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Food products made from this mix of bamboo and plastic can leak substances including formaldehyde and melamine into food or drink, especially if the product is heated up or comes into contact with acidic foods. Usually harmless, when consumed at high levels or over a long period of time they can be potentially harmful to health."
        },
        {
            "text": "Bamboo food containers have become increasingly popular, as consumers and retailers look to move away from single use plastic in search of sustainable alternatives. Sometimes branded as ‘eco-friendly’ or ‘biodegradable’, these products can include re-usable coffee cups, and plates and bowls which have often been sold for children and young people."
        },
        {
            "text": "Although consumers and retailers might believe these products are made from pure bamboo, sometimes, these products are made from a mix of both bamboo and plastic, which is used to help mould the item into shape and give it volume. These products are known as bamboo plastic composites, and it's the addition to plastic which has been a cause for concern for the Food Standards Agency (FSA) and Food Standards Scotland (FSS)."
        },
        {
            "text": "So, why’s this a concern for the FSA and FSS? Well, our role, along with FSS, is to ensure food is safe and what it says it is and that also includes ensuring the products that come into contact with our food are safe for use too."
        },
        {
            "text": "As always, we have put consumer safety first by asking retailers and businesses to stop selling these products whilst we carried out our investigations. And we advised consumers to stop using them while we came to a decision about their safety."
        },
        {
            "text": "After a thorough investigation, based on information provided to us by industry, the independent scientific advisory committee, the Committee on Toxicity, advising us, has found that the presence of plant-based material in plastic could lead to substances that are commonly used in the production of plastic materials, and are usually harmless, leaking into the food or drink at levels that could be potentially harmful to health."
        },
        {
            "heading": 2,
            "text": "Formaldehyde and melamine"
        },
        {
            "text": "These substances include formaldehyde and melamine, which can leak into food or drink, especially if the product is heated up or comes into contact with acidic foods."
        },
        {
            "text": "Though formaldehyde is naturally produced by the body, when consumed at high levels, it can lead to gastrointestinal symptoms. Long-term exposure to melamine at high levels can result in kidney and urinary tract, and so both are best avoided at high levels or, if you consume them over long periods of time."
        },
        {
            "text": "Although we have extensively reviewed the evidence provided by industry, the truth is that there simply isn’t enough evidence available to assure us that these products are safe. It’s for this reason, in partnership with our own findings and analysis, that we have taken the decision to continue to advise consumers not to use them for storing or serving food, but instead, to dispose of them if you still have them in the home."
        },
        {
            "text": "Many of these products have often been marketed as ‘compostable’ or ‘biodegradable’, due to the plastic components in them, they cannot be recycled, making them even less eco-friendly than solid plastic. Instead, they should be discarded in general waste or if you don’t want to throw them away, they can be repurposed for use with non-food items, such as for decorative purposes."
        },
        {
            "text": "It may be difficult to tell whether a product is made from a bamboo-composite material, once it has been removed from its packaging, but such products will have a smooth surface and feel plasticky."
        },
        {
            "heading": 2,
            "text": "Just bamboo is safe to use"
        },
        {
            "text": "It's important to say however that products that are made solely from bamboo or other plant-based materials are safe to use and it’s only those products which use a combination of plastic and plant-based materials which we believe to be unsafe."
        },
        {
            "text": "If you’d like to read more about our work when it comes to food contact material and keeping consumers safe, our latest guidance and advice can be found on Food.gov."
        },
        {
            "heading": 1,
            "text": "Beth yw cyfansoddion plastig bambŵ a pham na ddylid eu defnyddio ar gyfer bwyd neu ddiod"
        },
        {
            "text": "Gall cynhyrchion bwyd a wneir o gymysgedd o fambŵ a phlastig ollwng sylweddau yn cynnwys fformaldehyd a melamin i mewn i fwyd neu ddiod, yn enwedig os yw’r cynnyrch yn cael ei gynhesu neu’n dod i gysylltiad â bwydydd asidig. Gallant fod yn niweidiol i iechyd pan gânt eu bwyta ar lefelau uchel neu dros gyfnod hir o amser."
        },
        {
            "text": "Mae cynwysyddion bwyd bambŵ wedi dod yn fwyfwy poblogaidd, wrth i ddefnyddwyr a manwerthwyr geisio symud i ffwrdd o blastig untro i chwilio am ddewisiadau amgen cynaliadwy. Byddant weithiau’n cael eu brandio fel cynhyrchion ‘eco-gyfeillgar’ neu ‘bioddiraddadwy’, ac maent yn cynnwys cynhyrchion fel cwpanau coffi y gellir eu hail-ddefnyddio, a phlatiau a phowlenni sydd fel arfer yn cael eu gwerthu ar gyfer plant a phobl ifanc."
        },
        {
            "text": "Gall defnyddwyr a manwerthwyr gredu bod y cynhyrchion hyn wedi’u gwneud o bambŵ pur, ond weithiau, byddant yn cael eu gwneud o gymysgedd o bambŵ a phlastig, a ddefnyddir i helpu i atgyfnerthu a mowldio siâp yr eitemau. Gelwir y cynhyrchion hyn yn gyfansoddion plastig bambŵ, a phresenoldeb plastig sydd wedi peri pryder i’r Asiantaeth Safonau Bwyd (ASB) a Safonau Bwyd yr Alban (FSS)."
        },
        {
            "text": "Pam mae’r ASB ac FSS yn pryderu? Ein rôl ni, ynghyd ag FSS, yw sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Mae hynny hefyd yn cynnwys sicrhau bod y cynhyrchion sy’n dod i gysylltiad â’n bwyd yn ddiogel i’w defnyddio hefyd."
        },
        {
            "text": "Yn ôl ein harfer, rydym wedi rhoi diogelwch defnyddwyr yn gyntaf trwy ofyn i fanwerthwyr a busnesau beidio â gwerthu’r cynhyrchion hyn wrth i ni gynnal ein hymchwiliadau. Gwnaethom hefyd gynghori defnyddwyr i beidio â’u defnyddio tra roedden ni’n dod i benderfyniad am eu diogelwch."
        },
        {
            "text": "Ar ôl ymchwiliad trylwyr, yn seiliedig ar wybodaeth a ddarparwyd i ni gan y diwydiant, mae ein pwyllgor cynghori gwyddonol annibynnol, y Pwyllgor ar Wenwyndra, wedi canfod y gallai presenoldeb deunyddiau sy’n seiliedig ar blanhigion mewn plastig achosi i sylweddau a ddefnyddir yn gyffredin wrth gynhyrchu deunyddiau plastig, ac sydd fel arfer yn ddiniwed, ollwng i’r bwyd neu’r ddiod ar lefelau a allai fod yn niweidiol i iechyd."
        },
        {
            "heading": 2,
            "text": "Fformaldehyd a melamin\n"
        },
        {
            "text": "Mae’r sylweddau hyn yn cynnwys fformaldehyd a melamin, sy’n gallu gollwng i mewn i fwyd neu ddiod, yn enwedig os yw’r cynnyrch yn cael ei gynhesu neu’n dod i gysylltiad â bwydydd asidig."
        },
        {
            "text": "Er bod fformaldehyd yn cael ei gynhyrchu’n naturiol gan y corff, gall arwain at symptomau gastroberfeddol pan gaiff ei fwyta ar lefelau uchel. Gall dod i gysylltiad hirdymor â melamin ar lefelau uchel arwain at niwed i’r arennau ac i’r llwybr wrinol, ac felly mae’n well osgoi’r ddau ar lefelau uchel neu osgoi eu bwyta dros gyfnodau hir o amser."
        },
        {
            "text": "Er ein bod wedi adolygu’r dystiolaeth a ddarparwyd gan y diwydiant yn helaeth, nid oes digon o dystiolaeth ar gael i ni fod yn hyderus bod y cynhyrchion hyn yn ddiogel. Oherwydd hyn, yn ogystal â’n canfyddiadau a’n dadansoddiad ein hunain, rydym wedi penderfynu parhau i gynghori defnyddwyr i beidio â’u defnyddio ar gyfer storio neu weini bwyd, ac i gael gwared arnynt os ydynt yn dal i fod gennych yn y cartref."
        },
        {
            "text": "Dywedir yn aml wrth farchnata llawer o’r cynhyrchion hyn fod modd eu compostio neu eu bod yn ‘fioddiraddadwy’, ond oherwydd y cydrannau plastig sydd ynddynt, ni ellir eu hailgylchu, gan olygu eu bod hyd yn oed yn waeth i’r amgylchedd na phlastig solet. Yn lle hynny, dylid eu taflu gyda’r gwastraff cyffredinol. Os nad ydych am eu taflu, gellir eu hailddefnyddio at ddibenion heblaw bwyd, fel at ddibenion addurniadol."
        },
        {
            "text": "Efallai y bydd yn anodd gwybod a yw cynnyrch wedi’i wneud o ddeunyddiau cyfansawdd bambŵ ar ôl iddo gael ei dynnu o’i ddeunydd pecynnu, ond bydd gan cynhyrchion i’r fath arwyneb llyfn a byddant yn teimlo fel plastig."
        },
        {
            "heading": 2,
            "text": "Mae cynhyrchion a wneir o bambŵ yn unig yn ddiogel i'w ddefnyddio\n"
        },
        {
            "text": "Mae’n bwysig nodi bod cynhyrchion a wneir o bambŵ, neu ddeunyddiau eraill sy’n seiliedig ar blanhigion yn unig, yn ddiogel i’w defnyddio, a dim ond y cynhyrchion hynny sy’n cynnwys cyfuniad o blastig a deunyddiau sy’n seiliedig ar blanhigion sy’n anniogel yn ein barn ni.   \n"
        },
        {
            "text": "Os hoffech ddarllen mwy am ein gwaith ar ddeunyddiau a ddaw i gysylltiad â bwyd a chadw defnyddwyr yn ddiogel, mae ein canllawiau a’n cyngor diweddaraf ar gael ar food.gov."
        }
    ]
}