{
    "url": "https://nda.blog.gov.uk/apprenticeship-journey-qa-bethany-mckee/",
    "title": "Apprenticeship Journey Q&A  – Bethany McKee",
    "authors": [
        "Kate Parr - Early Years Career Advisor"
    ],
    "categories": [
        "Skills"
    ],
    "pub_date": "2023-02-06T14:47:11+00:00",
    "content": [
        {
            "text": "The Government has made it clear that it sees the nuclear industry as vital to the country’s future security of energy supply and as an essential part of our net zero ambitions in the UK. And this is starting to attract talented young people into careers in this sector."
        },
        {
            "text": "One of the avenues available to begin a career in the nuclear industry is via an apprenticeship. An apprenticeship not only allows an individual to learn technical aspects but also have real life experience working on projects, work with current industry experts and apply their learning in a practical and dynamic setting. If we don’t support and prepare the generation of today, we leave our future at a disadvantage."
        },
        {
            "text": "This week is National Apprenticeship Week and to mark the occasion we interviewed Bethany McKee a Senior Project Controls Engineer and former apprentice here at Nuclear Waste Services to share what opportunities an apprenticeship at NWS provides."
        },
        {
            "heading": 2,
            "text": "What apprenticeship did you complete?"
        },
        {
            "text": "Level 3 Business Management"
        },
        {
            "heading": 2,
            "text": "Why did you choose an apprenticeship at the time of deciding?"
        },
        {
            "text": "I was unsure of what I wanted to do and so kept my options open and applied for several apprenticeship opportunities I was interested in, including project controls.  I went through the interview process which was narrowed down to being offered Project Controls which I’m happy I received. I chose the apprenticeship route as I still felt too young to travel away for university and the option to learn as I gained experience sounded really appealing. At the time apprenticeships were not as widely spoken about or awareness raised but I feel this has grown more now, with career fairs being held for people to join and find out more."
        },
        {
            "heading": 2,
            "text": "How has completing an apprenticeship supported your career and achievements?"
        },
        {
            "text": "Completing an apprenticeship with Nuclear Waste Services has opened doors for me. I had a lot of opportunities to be involved with throughout my apprenticeship and have also gone onto completing further education such as an ECITB In Project Controls, HNC In Business Management, and have recently finished an Integrated Degree Apprenticeship in Project Management. I didn’t truly know what project controls was at first, but my apprenticeship grew my knowledge, skills and opened a path to being more technical then when I first started my apprenticeship. There have been many new challenges but all worthwhile."
        },
        {
            "heading": 2,
            "text": "What skills or behaviours did you develop during your apprenticeship that you still use now?"
        },
        {
            "text": "The biggest skills I developed were confidence and communication skills. I feel like I was nervous with my apprenticeship being my first professional role. The apprenticeship exposed me to speaking to a mixture of different people, which at first is daunting but within the first year of my apprenticeship, I felt I grew so much, even outside of work. I felt more confident and communicated better. These skills allowed me to be confident to take on challenges and opportunities that were offered."
        },
        {
            "heading": 2,
            "text": "What advice would you give to someone considering an apprenticeship?"
        },
        {
            "text": "Go for it. You are gaining learning at the same time as experience. When I left school, people who chose university didn’t necessarily get work experience so adjusting to working life after was a challenge. I’ve completed a degree apprenticeship whilst getting experience, all in one go."
        },
        {
            "text": "The Nuclear Industry have a host a great range of apprenticeships, all of which will allow apprentices to put their learning into perspective through practical application."
        },
        {
            "heading": 2,
            "text": "What is the importance of an apprentice within a business?"
        },
        {
            "text": "Many of the benefits to an apprentice I’ve mentioned in earlier questions but to summarise, outside of learning and gaining experience, you grow skills and as a person. You can go into different areas of the business and be supported by people with experience and can help. A lot of apprentices have new ideas, creativity, and contribute to projects and the wider business. Both an apprentice and organisation gain from sharing of knowledge from the different experiences each person has had."
        }
    ]
}