{
    "url": "https://nda.blog.gov.uk/apprenticeship-journey-qa-howard-falconer/",
    "title": "Apprenticeship Journey Q&A  – Howard Falconer",
    "authors": [
        "Kate Parr - Early Years Career Advisor"
    ],
    "categories": [
        "Skills"
    ],
    "pub_date": "2023-02-06T14:51:12+00:00",
    "content": [
        {
            "text": "The Government has made it clear that it sees the nuclear industry as vital to the country’s future security of energy supply and as an essential part of our net zero ambitions in the UK. And this is starting to attract talented young people into careers in this sector."
        },
        {
            "text": "One of the avenues available to begin a career in the nuclear industry is via an apprenticeship. An apprenticeship not only allows an individual to learn technical aspects but also have real life experience working on projects, work with current industry experts and apply their learning in a practical and dynamic setting. If we don’t support and prepare the generation of today, we leave our future at a disadvantage."
        },
        {
            "text": "This week is National Apprenticeship Week and to mark the occasion we interviewed Howard Falconer a Senior Lead for customer management and expert services and a former apprentice here at Nuclear Waste Services to share what opportunities an apprenticeship at NWS provides."
        },
        {
            "heading": 2,
            "text": "What apprenticeship did you complete?"
        },
        {
            "text": "Scientific apprenticeship"
        },
        {
            "heading": 2,
            "text": "Why did you choose an apprenticeship at the time of deciding?"
        },
        {
            "text": "I originally completed a work experience placement, which was with Ian Wills (Nuclear Waste Services’ - Nuclear Safety Case Team Manager), through the Engineering Education Scheme, where schools partnered up with businesses on a project.  I then completed a summer placement with Sellafield while doing my A-Levels. Sellafield offered a sponsored university programme after the placement, which was a 4-year commitment, to lead onto continuing my development with Sellafield for another 5 years. At the time, I wasn’t sure if I wanted to go to university, therefore decided to defer for a year. Due to this, it opened my eyes up to apprenticeships as an opportunity, which had a more appealing practical approach to learning, earning, and gaining experience."
        },
        {
            "heading": 2,
            "text": "How has completing an apprenticeship supported your career and achievements?"
        },
        {
            "text": "Completing my apprenticeship gave me a solid foundation into the working world. I feel like I worked through all levels and types of roles to reach where I am today, and this has helped give me an inner sense of credibility throughout my experiences. I was given a wide range of opportunities and placements in other areas, which helped broaden my knowledge, experience, and exposure to the Nuclear Industry."
        },
        {
            "text": "I have also been able to give back to apprentices, through being a guest lecture on the waste management module for apprentices through Energus, allowing me to help develop those at the beginning of their career journey."
        },
        {
            "heading": 2,
            "text": "What skills or behaviours did you develop during your apprenticeship that you still use now?"
        },
        {
            "text": "People skills. You learn to work with a multitude of different people, presenting to building managers, contacting other departments and functions. The exposure and practice of people skills helped character build and grow my ability to interact with different people. Many apprentices can start without experience of balancing different priorities and deadlines but throughout an apprenticeship you learn to balance, manage time between work, learning and personal life as well as take on your own responsibilities."
        },
        {
            "heading": 2,
            "text": "What advice would you give to someone considering an apprenticeship?"
        },
        {
            "text": "Just go for it. Personally, if you are interested in seeing how things work and practical things, an apprenticeship is such good way to grow transferable skills you can use in your work life and personal. You can complete high level education without any debt and gain working life experience while learning. Through my experience, there was a lot more opportunity in completing an apprenticeship, not just through the choice of qualification but other initiatives I could complete and advance myself, then I otherwise would have gotten going down another route."
        },
        {
            "text": "Following the successful completion of my apprenticeship, I have gone on to complete further education in the form of a HNC, HND and then onto a BSc Honours in Nuclear Decommissioning. As I progressed throughout my career, I have learnt about many other things such as business management and a wider array of business knowledge. An apprenticeship has opened other functions and areas, not just that to which my qualification is linked too as an apprenticeship provides you with transferable skills, you are not narrowed into one area."
        },
        {
            "heading": 2,
            "text": "What is the importance of an apprentice within a business?"
        },
        {
            "text": "The importance of apprenticeships is that it is a pathway to allow an organisation to keep a constant pipeline of talent through the business who we can learn from, through new ideas and innovation. Apprentices can bring a fresh pair of eyes and teach us advancements or insight into the real world.  It also allows an organisation to bring in talent at all levels who all contribute to achievements. Apprentices can become ambassadors for the business, who we can support in growing their personal development and ambitions."
        }
    ]
}