{
    "url": "https://civilservice.blog.gov.uk/2023/02/06/celebrating-the-joy-of-nature/",
    "title": "Celebrating the joy of nature",
    "authors": [
        "Beatrice Finch"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-02-06T15:41:08+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Below Bea Finch, a co-chair of the Civil Service Network 4 Nature shares what they’re doing to bring nature a little closer for us all."
        },
        {
            "text": "A quarter life crisis led me to help set up Network 4 Nature, a network for civil servants. "
        },
        {
            "text": "I feel like I’ve had a quarter life crisis… halfway through my twenties 20’s I made a decision.  I needed to know more about the countryside I grew up in, and the wildlife that surrounded me, I felt ashamed that I couldn’t list of the tree species as I walked past them on my country walks.  So, I went back to college and trained in Countryside Management, I did this while working part-time at HMP Winchester. After qualifying I discovered a small but passionate team looking after ecology on the Ministry of Justice estate, I volunteered for them as well as working in the prison and eventually it led to me getting a job in the MoJ Sustainability Team… I truly found my niche! "
        },
        {
            "text": "We know that nature brings incalculable benefits to us."
        },
        {
            "text": "The evidence is growing that there are significant health and wellbeing benefits of access to green and blue spaces. Connecting people with the environment improves both our health and our wellbeing."
        },
        {
            "text": "Having access to nature has been a key part of my wellbeing, especially over the last couple of years. Only last week, I gazed out of my office window (or corner of my son’s bedroom while I work from home) only to see a white-tailed eagle flying past. What a magical sight.  In my excitement I tried to record it using my phone but ended up pressing the wrong button!  My kids also spotted a common shrew building its nest in our garden recently, it was so preoccupied with carrying the leaves I managed to capture get some wonderful slow-motion videos of it."
        },
        {
            "text": "We know that communities of common purpose matter. We are, after all, social creatures. Connection – in this case with nature – is a natural desire. Staff networks make a significant contribution to the Civil Service’s strategic aspiration to be the UK’s most inclusive employer. They inform how we increase representation and create a more inclusive culture to ensure we become the brilliant Civil Service we aspire to be and a great place to work."
        },
        {
            "text": "Birth of the Civil Service Network 4 Nature"
        },
        {
            "text": "In 2019 – the Year of Green Action – we soft launched the Civil Service Network for Nature (N4N) at Civil Service Live in Exeter. Back then, we believed that there was an as yet un-connected community of civil servants who loved nature and wanted to express their values about nature both at work and as well as at home. When the lockdown struck just only a few months later, that belief proved more timely than we could have ever imagined."
        },
        {
            "text": "Unable to deliver in- the-flesh events, we embraced our virtual connection and celebration of nature through a series of newsletters and seminars. Our membership grew organically, reflecting our values to be as inclusive as we possibly could. We recognised the importance of biodiversity in nature to ensure a healthy environment as well as the importance to the Civil Service of cultivating a diverse and more inclusive workplace."
        },
        {
            "text": "We have membership across the country, reaching around 40 government departments and ALBs. Our committee membership includes BEIS, the Ministry of Justice, Natural England, the Department of International Trade, Defra, HM Land Registry, the Ministry of Defence, and the Advisory, Conciliation and Arbitration Service (ACAS). Our dedicated Committee members volunteer because we believe in nature, and we believe in the power of staff networks."
        },
        {
            "text": "N4N is a community of civil servants who love nature and want to connect with, protect and enhance nature. N4N aims to;"
        },
        {
            "text": "Over the last two years, we’ have run a series of virtual seminars, including on wildlife photography, the Big Butterfly Count, urban biodiversity, the RSPB Big Garden Birdwatch, pollinators, and enabling equal access to nature. With many more to come as well as some face-to-face events too…"
        },
        {
            "text": "So, are you a Civil Servant and a nature lover? If so, why don’t you join us – we are on Knowledge Hub"
        }
    ]
}