{
    "url": "https://nda.blog.gov.uk/gdf-sustainability-futureproofing-our-world/",
    "title": "GDF Sustainability - Futureproofing our world",
    "authors": [
        "Simon Hughes - Community Engagement and Siting Director at Nuclear Waste Services"
    ],
    "categories": [
        "Waste management"
    ],
    "pub_date": "2023-02-06T11:03:54+00:00",
    "content": [
        {
            "text": "Today, we have published the Geological Disposal Facility (GDF) programme sustainability ‘first look’ paper setting out how sustainability is, and will"
        },
        {
            "text": "continue to be, at the heart of the GDF programme."
        },
        {
            "text": "As a nationally significant infrastructure project which will span decades, there is scientific consensus and international agreement that a GDF is the best solution for permanently and safely managing the most hazardous radioactive waste – protecting our environment and future generations."
        },
        {
            "heading": 2,
            "text": "The challenge"
        },
        {
            "text": "Nuclear technology has now been part of our lives in the UK for over 60 years."
        },
        {
            "text": "It is, and was, used in industry, medicine and defence, and nuclear power generation provides around 15% of the UK’s electricity. The use of this technology over the years means we now have more than 4 million cubic metres of waste still to be recovered and treated to complete the UK’s decommissioning programme, comprising more than 1,300 different streams of radioactive waste."
        },
        {
            "text": "Higher activity radioactive waste – the most hazardous type - needs to be managed safely and securely for the hundreds of thousands of years some of it will remain a hazard."
        },
        {
            "heading": 2,
            "text": "GDF - a sustainable solution"
        },
        {
            "text": "It is this generation’s responsibility to ensure this waste is made permanently safe and not left behind for future generations to manage, store and repackage every 50 – 100 years."
        },
        {
            "text": "A GDF will not only be one of the UK’s biggest infrastructure projects but will also make a major contribution to the environment."
        },
        {
            "text": "It will safely and finally dispose of higher activity radioactive waste in a highly engineered facility, between 200 – 1000 metres underground in an appropriate geological setting. This facility will isolate and contain the waste removing the need for human interaction once closed."
        },
        {
            "text": "Geological and man-made barriers will work together to keep the radioactivity contained far below the surface, securing it for future generations.  This will utilise the natural long-term"
        },
        {
            "text": "protection of an appropriate geological setting and the natural process of radioactive decay, to work with nature rather than against it."
        },
        {
            "heading": 2,
            "text": "Sustainability focus"
        },
        {
            "text": "Here at NWS, we take our environmental responsibility incredibly seriously and managing the GDF programme in a sustainable way, both for communities and the environment, is fundamental and integral to our success.  This, at heart, is a very long-term environmental protection project."
        },
        {
            "text": "As part of the GDF programme we have developed a sustainability approach which builds on the UN Sustainable Development Goals and considers where the most significant impact on the environment and the communities we are engaging with could be made."
        },
        {
            "text": "We have established three key priority areas of focus:"
        },
        {
            "heading": 2,
            "text": "Just the start"
        },
        {
            "text": "At this stage our priority is to continue working closely with communities already engaged in the process and I’m pleased to say that this work is progressing well."
        },
        {
            "text": "Our aim is to ensure the programme maximises long-term sustainable benefits for communities by assessing environmental impact through flood risk reviews, climate change forecasting and emissions ‘footprinting’. We also anticipate benefits associated with long-term, high-quality jobs and local skills development, along with developments to transport infrastructure and other associated economic development. This will all play a part in guiding our sustainability strategy and leave behind a positive lasting legacy for all communities involved."
        },
        {
            "text": "We are also committed to working with colleagues in nuclear and engineering industries, the supply chain and international environmental experts. This collaborative knowledge sharing will help to drive forward our development and application of carbon net zero science and innovative approaches for GDF design and construction."
        },
        {
            "text": "The GDF programme will last upwards of 150 years. It is a long-term and crucial project, one that will have a huge impact not only on the host region but also nationally."
        },
        {
            "text": "We are now engaged with four communities across England, three in Cumbria, Mid-Copeland, South-Copeland and Allerdale and one in Lincolnshire around Theddlethorpe, about what hosting a GDF could mean for them."
        },
        {
            "text": "We know we cannot do this alone and input, engagement, and collaboration from local communities already engaged in the process, our stakeholders, the supply chain and our international colleagues are all vital as we make progress in delivering a sustainable GDF."
        },
        {
            "text": " "
        },
        {
            "text": "*These commitments will also form part of work being further developed by NWS on sustainability as well as a formal policy, which will be available in Spring/ Summer 2023."
        }
    ]
}