{
    "url": "https://dataarchitecture.blog.gov.uk/2023/02/06/how-our-apprenticeship-scheme-is-developing-home-grown-talent/",
    "title": "How our apprenticeship scheme is developing home grown talent",
    "authors": [
        "James Evans"
    ],
    "categories": [
        "About the Government Data Architecture Community",
        "Data architecture",
        "Office for National Statistics"
    ],
    "pub_date": "2023-02-06T09:31:51+00:00",
    "content": [
        {
            "text": "To celebrate National Apprenticeship Week (6 to 12 February), we explore the Office for National Statistics’ (ONS) Data Architecture and Engineering Apprenticeship scheme. "
        },
        {
            "text": "James Evans, ONS’ Head of Data Architecture Strategy and Coordination, tells us what it is, why it was developed, and its impact so far. "
        },
        {
            "heading": 4,
            "text": "Addressing the UK digital skills shortage "
        },
        {
            "text": "The Data Architecture Apprenticeship Scheme is an initiative we’ve started in Data Growth and Operations at the ONS. We saw our first cohort of apprentices in March 2022.  "
        },
        {
            "text": "It’s well reported that there’s a digital skills shortage in the UK. We developed the scheme to support recruitment within the design, data and technology (DDaT) field. "
        },
        {
            "text": "The course is a level three and level four data technician apprenticeship run over two years. Once completed, it is the same as two A level passes. "
        },
        {
            "text": "You don't need any experience or qualifications in data architecture or engineering to apply, just a desire to learn.  "
        },
        {
            "heading": 4,
            "text": "Developing home-grown talent "
        },
        {
            "text": "Not only are we training people to our high standards, but also helping to tackle the wider digital skills shortage.  "
        },
        {
            "text": "We include interview techniques and job applications as part of the training. This ensures our apprentices have the right tools for their next step, wherever that may be.  "
        },
        {
            "text": "Of course, we hope they choose to stay with us at the ONS after they’ve completed the apprenticeship. But there’s nothing stopping anyone from applying for roles elsewhere. And they'll have the knowledge and skills to do so. "
        },
        {
            "heading": 4,
            "text": "We swapped external contractors for apprentices  "
        },
        {
            "text": "Like other organisations, The ONS was experiencing unsustainable recruitment shortages. We were spending £600 to £900 a day on external data engineer and data architect contractors.   "
        },
        {
            "text": "We realised the money we spent on contractors for one financial quarter would fund 10 apprentices on a two-year apprenticeship. "
        },
        {
            "text": "With help from the central talent team, we made a business case. After going through various checks and processes, it was approved. The first cohort received around 70 applications. "
        },
        {
            "heading": 4,
            "text": "How it works "
        },
        {
            "text": "The talent team identified training providers of that specialism. The government then funds the theory and assessment side of the training.  "
        },
        {
            "text": "The apprentices spend one day a week on theory-based learning, such as data modelling. This is until they have completed a portfolio of work.  "
        },
        {
            "text": "Their portfolio includes evidence of skills and behaviours, such as cloud technology. This side of the training is what the government funds. The rest of the week is ‘on the job’ experience, which the ONS pays as a salary to the apprentice.  "
        },
        {
            "text": "In our first cohort, we had 10 apprentices who we are training under the scheme for two years.  "
        },
        {
            "text": "For the first year, where possible, apprentices are on a four-month rotation between data engineering and architecture. Then, the second year focusses on which specialism they wish to pursue.  "
        },
        {
            "heading": 4,
            "text": "The next phase "
        },
        {
            "text": "The ONS plans to recruit 10 apprentices in its next cohort, which starts in March 2023.  "
        },
        {
            "text": "We’re also hoping to recruit a somebody who has industry experience to be a mentor and coach. They will support our established engineers in maintaining best practice, provide one-to-one development for apprentices and develop coding classes. The entire office, regardless of grade or experience, can get partake.   "
        },
        {
            "text": "We’re also exploring if we could ‘exchange’ apprentices to other government bodies, such as HMRC or Ordnance Survey, for six months or so as part of the scheme. "
        },
        {
            "text": "It would be a win: win for everyone: "
        },
        {
            "text": "I’m excited to welcome future talent to the ONS and see where the scheme goes in the future. "
        },
        {
            "heading": 4,
            "text": "Ben Moscrop shares his experience of the apprenticeship "
        },
        {
            "text": "Ben is a 25-year-old maths and statistics graduate from Locks Heath. He started his apprenticeship with the ONS in March 2022.  "
        },
        {
            "text": "He said: "
        },
        {
            "text": "“I’ve always wanted to work in the Civil Service, and at the ONS in particular. "
        },
        {
            "text": "“I’ve always heard good things about the benefits of the Civil Service, like its pension and flexi time. I want to work somewhere that helps people, not help line someone's pockets.  "
        },
        {
            "text": "“I’ve always been interested in statistics so when I saw the apprenticeship scheme at the ONS, I raced to apply. "
        },
        {
            "text": "“I’m loving it so far. The people I work with are always supportive and friendly. The projects I’m working on are also really varied and involve lots of coding, which I love. "
        },
        {
            "text": "“Being more of a night owl, I often take advantage of the flexi time to start and finish my work later.  "
        },
        {
            "text": "“I’m also moving to Lincoln soon, so the flexi time will be really useful for the move. "
        },
        {
            "text": "“Despite moving to practically the other side of the country, the only thing that will change jobwise is the office I’ll be based in. I’ll certainly miss my 20-minute walk commute on the days I don’t work from home. "
        },
        {
            "text": "“When my apprenticeship ends, I’ll definitely stay at the ONS if I can – assuming they’ll have me.” "
        }
    ]
}