{
    "url": "https://services.blog.gov.uk/2023/02/06/join-services-week-2023/",
    "title": "Join Services Week 2023",
    "authors": [
        "Kara Kane – Head of Profession for Design, GDS",
        "Marc O’Connor - Senior Service Designer, HMRC",
        "Imran Hussain - Community Designer, GDS",
        "Dani Barge - Strategy and Content Officer, Cabinet Office",
        "Lisa Jeffery – Senior Engagement and Content Lead, Cabinet Office"
    ],
    "categories": [
        "Events",
        "Service community"
    ],
    "pub_date": "2023-02-06T16:19:50+00:00",
    "content": [
        {
            "text": "Services Week, the cross-sector event series for people working in the UK public sector, is back. Returning for the fifth time, Services Week 2023 will take place 20 to 24 March 2023. The theme for this year is Designing for Uncertain Times. So, if you are a public or civil servant, why not join in and join up with others during Services Week 2023?  "
        },
        {
            "heading": 2,
            "text": "What is Services Week?"
        },
        {
            "text": "Services Week is an annual cross-organisational event series focused on improving public services. In Services Week 2022, 24 different public sector organisations ran 50 events online. These sessions connected people across professions to grow skills and knowledge about user-centred service design. "
        },
        {
            "text": "Once again, from local and central government to health and education services, we want to showcase all that is good about public services. We want to make good work more visible and enable connection, collaboration and learning. We want to create value together that will help us and benefit the public. "
        },
        {
            "text": "As in previous years, the Services Week 2023 planning group wants to grow service literacy. Together, we will run the Introduction to Service Design training during the week. And we encourage all sessions that teach skills. "
        },
        {
            "heading": 2,
            "text": "Designing for uncertain times"
        },
        {
            "text": "The last few years have seen a lot of uncertainty and change in the world, and the public sector is no exception. It has not always been easy to adapt in this fast-changing environment. Sometimes, it can be difficult to test all of our assumptions when designing at scale or pace, or when things are unpredictable. "
        },
        {
            "text": "We especially welcome sessions that relate to this year’s theme of Designing for Uncertain Times. Sessions might relate to end-to-end design across boundaries. They might focus on a team’s flexibility, impact and metrics, or share success stories that cut through in today’s context. "
        },
        {
            "text": "You might want to showcase how you have adapted to change in a user-centred way. You might want to share how you’ve done agile delivery. How to grow agility and prepare for uncertainty in the future. You might want to share how you’ve reused patterns, designs or capabilities. It might benefit others to know how you’ve prototyped at pace or built for resilience. "
        },
        {
            "text": "As a community, we are all at different stages of design maturity. We can all learn from each other and be great sources of support for each other. "
        },
        {
            "heading": 2,
            "text": "How to join in "
        },
        {
            "text": "Services Week is for all UK public and civil servants who are interested in good services. You can join in as much as you choose, and in ways that suit your work, your context and organisation. The format and theme are deliberately open and flexible by design. "
        },
        {
            "text": "You can host or co-host a session, attend sessions, or share information about sessions with others in your organisation. We also want to publish related blog posts here during the week, so get in touch if you want to write something.   "
        },
        {
            "text": "You could connect the theme to your current organisational priorities. You could run something live, between 20 to 24  March 2023, or pre-record something and release it during the week. You could make an internal meeting open to other organisations, to get feedback and connect with others working on similar projects. "
        },
        {
            "text": "Session formats change every year and have previously featured: "
        },
        {
            "text": "As always, in the community spirit of learning and sharing, we want to make this a safe and inclusive space that centres accessibility and wellbeing. Do consider formats, channels, tools, timings, and how people will sign up to and engage with your sessions. There is GOV.UK guidance on Accessible communication formats. Sessions can be run online, hybrid or in person. We will also add as many recorded sessions as possible to a Services Week playlist to increase access.  "
        },
        {
            "text": "Use this Services Week 2023 slide deck to promote Services Week inside your organisation, or make a copy and adapt it as needed. The deck includes virtual backgrounds to use during meetings, promotions or sessions. Use these Services Week 2023 posters to promote the event series. "
        },
        {
            "text": "If you are planning a session, you can add the session to this document.  "
        },
        {
            "text": "There is a #ServicesWeek channel on the cross-government Slack to find out more and connect with others. You can also email us directly to find out more or we can add your event to the schedule. "
        },
        {
            "text": "Thanks to everyone who has previously taken part in Services Week. We hope you will pay it forward this year by sharing these details with people who could benefit from attending Services Week 2023. "
        },
        {
            "text": "We look forward to seeing you all soon. "
        }
    ]
}