{
    "url": "https://defrafarming.blog.gov.uk/2023/02/06/large-research-and-development-partnerships-further-innovation-funding-available/",
    "title": "Large Research and Development Partnerships: further innovation funding available",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-02-06T10:43:27+00:00",
    "content": [
        {
            "text": "Later this month, the second round of the Large Research and Development (R&D) Partnerships fund will open. "
        },
        {
            "text": "From 20 February, agri-businesses, farmers, growers and foresters in England will be able to apply for a share of £8 million to improve productivity, sustainability and resilience. "
        },
        {
            "text": "This opportunity follows the Research Starter competition which I blogged about last month. "
        },
        {
            "text": "In this post, I’ll give an overview of the competition and details of events for you to find out more."
        },
        {
            "heading": 2,
            "text": "Large R&D Partnerships competition "
        },
        {
            "text": "The Large R&D Partnerships competition funds Industrial Research and Experimental Development projects. These range from those that will accelerate the development and demonstration of new agricultural solutions, to those that can be integrated into existing agricultural practices.  "
        },
        {
            "text": "They should help address major challenges and opportunities on-farm, or those immediately post farmgate.  "
        },
        {
            "text": "Your project must address a significant industry challenge or opportunity in at least one of the industry subsectors below:     "
        },
        {
            "text": "Your solutions or project outputs must also significantly improve: "
        },
        {
            "text": "Businesses are encouraged to come together as a partnership to solve these major challenges or opportunities. "
        },
        {
            "text": "Projects will last up to 4 years and be valued between £3 million to £5 million. Businesses will be expected to provide match funding for the projects.  "
        },
        {
            "text": "We want to fund a wide portfolio of projects, across a variety of technologies, industry sectors, and business sizes. "
        },
        {
            "text": "Your projects should have a significant focus on demonstration and enable the commercialisation and adoption of new solutions by sharing knowledge and ideas.     "
        },
        {
            "text": "UKRI will host a Q&A session on 21 February.  Innovate UK KTN will host a consortium building event on 2 March."
        },
        {
            "text": "I'll add the links to attend at the bottom of this post."
        },
        {
            "heading": 2,
            "text": "The application process "
        },
        {
            "text": "The competition opens 20 February and closes 19 April 2023."
        },
        {
            "text": "Stage 1: Submit an application through the Innovation Funding Service website"
        },
        {
            "text": "Stage 2: After the competition closes, you'll be told the outcome. If you make it through, you will be invited to an interview"
        },
        {
            "text": "Stage 3: After the interviews conclude, you'll be told the outcome. Feedback will be released for all projects"
        },
        {
            "heading": 2,
            "text": "Dates for your diary "
        },
        {
            "text": "20 February: Competition window opens for you to submit an application through IFS website"
        },
        {
            "text": "21 February: UKRI will host a Q&A session "
        },
        {
            "text": "2 March: Innovate UK KTN will host a consortium building event "
        },
        {
            "text": "19 April: Application window closes"
        },
        {
            "text": "More from the Farming Innovation Programme   "
        },
        {
            "text": "The Farming Innovation Programme is delivered in partnership with UKRI. More competitions to follow in the months ahead. Stay in the know by subscribing to the Future Farming blog. "
        }
    ]
}