{
    "url": "https://food.blog.gov.uk/2023/02/06/national-apprenticeship-week-2023-fsa-podcast/",
    "title": "National Apprenticeship Week 2023 - FSA Podcast",
    "authors": [
        "Catherine Hardy, Communications Manager (Northern Ireland)"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-02-06T09:45:30+00:00",
    "content": [
        {
            "text": "Transcript of the National Apprenticeship Week 2023 Podcast"
        },
        {
            "text": "“I would just encourage anybody, if you’ve got an opportunity, to go and do something like this!”"
        },
        {
            "text": "The FSA in Northern Ireland is proud to be participating in the Boardroom Apprentice scheme. The scheme provides an apprentice with opportunities to learn about what goes into ensuring our food is safe, healthy, sustainable and is what it says it is. The programme has just expanded to include Great Britain after several successful years operating in Northern Ireland."
        },
        {
            "text": "To mark National Apprenticeship Week (Monday 6 to Sunday 12 February 2023), the FSA’s Director for Northern Ireland Andy Cole, and Judith Hanvey the FSA in NI’s Boardroom Apprentice, discuss together the journey so far."
        },
        {
            "text": "It’s been an eventful few months for Judith, starting with the death of Her Majesty the Queen and continuing with the complex situation around the Northern Ireland Protocol. Andy and Judith also touched on the theme of the week this year - “Skills for Life” - and talked through how an apprenticeship can help people develop the skills, knowledge and expertise needed for a rewarding career and help businesses discover new talent, build new partnerships and connect with the local community."
        },
        {
            "text": "As Judith explains, it has been a demanding but rewarding, worthwhile and enriching experience."
        }
    ]
}