{
    "url": "https://buyingforschools.blog.gov.uk/2023/02/06/rpa-members-if-an-incident-were-to-happen-is-your-school-cyber-secure-and-are-you-covered/",
    "title": "RPA members – if an incident were to happen, is your school cyber secure and are you covered?",
    "authors": [
        "Katy O’Connor, RPA Future Projects Strategy and Delivery Lead"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2023-02-06T13:19:47+00:00",
    "content": [
        {
            "text": "In April 2022 the department included cyber cover as part of its Risk Protection Arrangement (RPA). We are almost a year on and Katy O’Connor, RPA Future Projects Strategy and Delivery Lead thought it was a good time to check in and see if all members are taking full advantage of this vital cover."
        },
        {
            "text": "Cybercrime has no boundaries; nothing is off limits and that includes all our schools. Cyber security should be high on the agenda for any school with a reliance on IT and online system."
        },
        {
            "text": "A cyber security incident can affect your schools ability to function, it can be very costly and time consuming to put right, which is why the cover included as part of the RPA is so important. But what is also important is to make sure that your school has met the required conditions to claim should an incident occur."
        },
        {
            "text": "Let’s start with a quick reminder about what the conditions of cyber security cover are – there’s only four. To make sure your school is covered, you must:"
        },
        {
            "text": "We want to make sure you are taking full advantage of this cover to protect your school, so we’re going to look at each of the conditions little more closely to try and answer any questions and/or concerns you may have."
        },
        {
            "text": "Let’s get started ..."
        },
        {
            "heading": 2,
            "text": "Condition 1. Must have offline backups"
        },
        {
            "text": "I want you to take a moment to think about how much of your school business is reliant on IT systems and the data stored in there, I would imagine it will be most of it. Now, take a moment to think about how you would continue to function if something were to happen to that data."
        },
        {
            "text": "The purpose of an ‘offline backup’ is to minimise disruption (or as much as possible) should any incident impact your live environment. Making sure you have and take regular backups of your data is incredibly important so it can be restored as quickly as possible."
        },
        {
            "text": "Here are a few tips from the NCSC website for you to consider:"
        },
        {
            "text": "Your cyber cover as an RPA member includes any actual or suspected unauthorised access to any computer or systems. If you have any concerns, no matter how small contact the 24/7 dedicated helpline 0800 368 6378 or RPAresponse@CyberClan.com. Taking action immediately, could save your school time and money."
        },
        {
            "heading": 2,
            "text": "Condition 2. All employees or Governors who have access to the Member’s information technology system must undertake NCSC Cyber Security Training"
        },
        {
            "text": "It’s important to ensure all staff members have cyber security awareness as this will help keep them vigilant towards the latest threats. This is why it is a requirement condition for all employees and Governors to undertake the free NCSC Cyber Security training."
        },
        {
            "text": "The NCSC Cyber Security training material uses real-life case studies to help you understand how cyber incidents can affect a school environment. It comes in two formats, you don’t have to do both, they deliver the same material so you can choose which will work best for your school. Choose from either:"
        },
        {
            "text": "I know there has been some concern about how long this training will take and difficulties fitting this in an already busy day. Be assured, the training should take no longer than 30 minutes. At the end of the training, it is important to complete the training certificate so you can demonstrate your cyber security awareness training."
        },
        {
            "text": "All employees or governors who have access to the Member’s information technology system must undertake NCSC training annually."
        },
        {
            "heading": 2,
            "text": "Condition 3. Must register with Police CyberAlarm"
        },
        {
            "text": "I want to dispel any concerns about this condition and whether you need to install the Police CyberAlarm software tool."
        },
        {
            "text": "You do not need to install anything unless you want to, the RPA condition of cover is to just to register with Police CyberAlarm.  By registering it will connect your school to the local Police Cyber Protect team who will ensure you are notified of any known threats by email. When you register, you will receive email confirmation. This confirmation will also include the option for you to install CyberAlarm Software, you do not have to do this, as long as you have registered, you will be covered as an RPA member."
        },
        {
            "text": "If you did want to install the CyberAlarm software, it is free and gathers data that can identify any malicious activity or if an attack has taken place. There are of course advantages to installation, for example some schools were identified to have misconfigured firewalls that left virtually all ports open to allowing suspicious traffic through. Because they had installed the software, the Local Force/Regional Protect Teams contacted them to highlight the issue."
        },
        {
            "text": "Installation was not made a condition of RPA cover because there are a number of technical circumstances where it is not possible."
        },
        {
            "text": "The Police CyberAlarm issued this public statement in June 2022 that will hopefully allay any concerns you may have  and they can be contacted directly by emailing enquiries@cyberalarm.police.uk."
        },
        {
            "heading": 2,
            "text": "Condition 4. Must have a Cyber Response Plan in place"
        },
        {
            "text": "Effectively detecting, responding, and resolving cyber incidents can be stressful. Putting a plan in place on how to handle cyber incidents will help you to make good decisions under pressure should a cyber incident occur. It will help to identify if there are any gaps in your incident handling capabilities and is a critical step towards a robust and effective incident management and technical response."
        },
        {
            "text": "A basic plan should include:"
        },
        {
            "text": "You need to make sure the cyber response plan, in whatever format it takes, works for you and the key members of staff that will be required to act. There is a template available to download from RPA Information & Documents or by emailing RPA.DFE@education.gov.uk."
        },
        {
            "text": "As an RPA member, your cyber cover includes any actual or suspected unauthorised access to any computer or systems. If you have any concerns, no matter how small contact the 24/7 dedicated helpline 0800 3686378 or RPAresponse@CyberClan.com they are there to help you."
        },
        {
            "heading": 3,
            "text": "….. and finally"
        },
        {
            "text": "If the worst happens and you need to make a cyber claim, there is a range of support designed to simplify the claims process for you."
        },
        {
            "text": "You can call the 24-hour 365-day emergency helpline to start the process and you’ll be provided with a named account manager to help you through the claims process, plus access to a dedicated portal for claims handling. Subject to the conditions being met and consequently a valid claim, your RPA cyber cover will provide expert loss adjusters and legal advisers and the incident response service may determine that on-site support is appropriate."
        },
        {
            "text": "Whilst we have only stipulated four conditions for RPA cover, there are many other measures that you can carry out to improve your cyber security, including registering with the NCSC Early Warning Service."
        },
        {
            "text": "If you have any questions or would like more information, contact: RPA.DFE@education.gov.uk"
        },
        {
            "heading": 2,
            "text": "Join the RPA today "
        },
        {
            "text": "If you have read this and you are a public sector school that is not currently an RPA member, joining is simple and takes less than 5 minutes."
        },
        {
            "text": "If you would like to know more or have any questions, you can contact the DfE’s Schools Commercial Team."
        },
        {
            "text": "The team also run regular webinars providing additional information about the RPA, the benefits of being a member and real-life case studies where membership has saved schools time and money and most importantly reduced the risk of lost school days. If you follow the Buying for schools LinkedIn page, it contains details of all these webinars and much more."
        },
        {
            "text": "There are no forms and RPA operates on a no material fact disclosure basis, so we don’t need estate, buildings or contents valuations and we don’t review your schools risk rating. There is also no annual renewal process – your membership will just roll over to the next year."
        }
    ]
}