{
    "url": "https://environmentagency.blog.gov.uk/2023/02/06/take-part-in-our-survey-to-help-stop-waste-criminals-faster/",
    "title": "Take part in our survey to help stop waste criminals faster",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-02-06T10:54:46+00:00",
    "content": [
        {
            "text": "Waste crime can take on many different forms from the very visible dumping of waste to fraudulent producer responsibility claims, deliberate breaches of permits, metal theft and the growing issue of the waste industry being used to launder money."
        },
        {
            "text": "It’s estimated to cost the UK economy £1 billion per year – that’s the same as the combined starting salary of over 38,000 newly-qualified nurses."
        },
        {
            "text": "We work to stop waste criminals impacting on our environment and communities, the legitimate waste management industry, and the economy. It’s a big job and we’ve learned we can stop criminals faster with help from others."
        },
        {
            "text": "That’s why we are part of the Joint Unit for Waste Crime (@JUWC_WasteCrime) that launched in January 2020. The JUWC is the first multi-agency taskforce of its kind to formally bring together environmental regulators and law enforcement agencies to stop serious and organised waste crime."
        },
        {
            "text": "Our aspiration is to reduce the impact of serious and organised crime in the UK waste industry, protecting the economy, environment, infrastructure, and communities by targeting those criminals posing the greatest risk."
        },
        {
            "text": "We have discovered that waste criminals are often involved in other types of offending such as drugs, firearms, theft, money laundering and modern slavery. We are working with all our partner agencies, using the powers available to each organisation, to stop these people."
        },
        {
            "text": "We are making progress, but we can be even more successful if everybody (including industry) tells us what is going on, and what the next crime trend might be. We are trying to stay one step ahead, but we need your help."
        },
        {
            "text": "An easy and anonymous way to do this is to respond to our National Waste Crime Survey. In the 2021 survey, you told us that nearly 20% of waste is suspected to be handled illegally but only 25% of waste crime incidents are reported to the Environment Agency."
        },
        {
            "text": "Your information is vital in helping us stop waste criminals. Share what you know and your experiences by completing our new survey: Snap Surveys (welcomesyourfeedback.net)"
        },
        {
            "text": "We want to hear from victims of waste crime such as landowners, insurance companies and residents as well as from those who can provide us with important information such as industry."
        },
        {
            "text": "This will help us to refine our approach to stopping waste criminals by focusing our efforts where they are needed most and to ensure the powers we currently have are adequate to stop them."
        },
        {
            "text": "The survey aims to:"
        },
        {
            "text": "Please respond to the survey by 27th February: Snap Surveys (welcomesyourfeedback.net)"
        }
    ]
}