{
    "url": "https://cddo.blog.gov.uk/2023/02/06/transforming-for-a-digital-future-six-month-update/",
    "title": "Transforming for a Digital Future - six month update",
    "authors": [
        "Megan Lee Devlin, Chief Executive, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT community",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-02-06T10:43:28+00:00",
    "content": [
        {
            "text": "The six months since we launched Transforming for a Digital Future, our cross-government digital and data strategy for 2022-25, have been eventful. On top of the enduring impacts of COVID-19 and Russia’s war on Ukraine, we’ve faced the funeral of Her Late Majesty the Queen, an energy crisis, inflationary pressures and a health system that’s come under strain. "
        },
        {
            "text": "Thousands of our colleagues in the Digital, Data and Technology (DDaT) function across government have been creating policy and services powered by technology and data to respond to these challenges, and many more. "
        },
        {
            "text": "The digital strategy for government, Transforming for a Digital Future, not only equips us with the digital capabilities to respond well in crises, it’s also about improving the day-to-day operation of government. That means streamlining existing services to eliminate manual processing, strengthening our digital capabilities, better equipping civil servants to use data, and replacing cumbersome and costly legacy technology - including systems used for key public services - with modern infrastructure."
        },
        {
            "heading": 4,
            "text": "Busy building foundations and momentum"
        },
        {
            "text": "Strong foundations are key to long-lasting change. Since June, CDDO, in partnership with departments, has been putting the foundations in place for the strategy and delivering initial milestones. There is a huge breadth of activity happening across government to deliver against the six missions set out in the strategy. "
        },
        {
            "text": "Some of the key highlights from the last six months are set out below:"
        },
        {
            "text": "Mission One: Transformed Public Services that Achieve the Right Outcomes "
        },
        {
            "text": "We’ve created a single definition for what a ‘great’ government service looks like and baselined many of the Top 75 services against it. We’re currently refreshing the Top 75 service list to reflect government’s highest priorities and have built a Transformation Leaders Group of business leaders to oversee delivery and share best practice. We’re working to embed single service owners, better performance data culture and increase the prevalence of cross-functional teams. For example, in the Home Office, we're bringing policy, operations and DDaT skills together to collaboratively design and deliver policy outcomes through our Digital Pathway initiative; at the Department for Education we’re embedding digital, data and technology leads and their service teams into all policy teams; and CDDO is working with colleagues across government to build a ‘digital readiness check’ to ensure that new legislation can be implemented through digital means. "
        },
        {
            "text": "Mission Two: GOV.UK One Login"
        },
        {
            "text": "The Government Digital Service (GDS)' GOV.UK One Login is progressing and, in parallel, the GDS team is working with departments to agree high-level plans for the onboarding of all central government services between now and April 2025, supported by CDDO and HM Treasury’s Quarterly Business Review process. "
        },
        {
            "text": " "
        },
        {
            "text": "Mission Three: Better Data to Power Decision Making"
        },
        {
            "text": "We’ve been developing the first components of the Data Marketplace, including a prototype cross-government data catalogue. This improves the discoverability of our data, enabling civil servants to understand what data exists that meets their business and service needs. Alongside this, the Chief Data Officer Council has been shaping a common data ownership model which sets out the core responsibilities and roles to support consistent data governance. Our API Catalogue, which helps users find and access data exchanges, continues to grow, with registered APIs increasing by 15% in the last six months. Furthermore, we’ve developed a Data Maturity Assessment for government which helps departments understand their capability, effectiveness and readiness to use data to deliver their priorities, and helps identify areas for improvement. "
        },
        {
            "text": "Mission Four: Efficient, Secure and Sustainable Technology"
        },
        {
            "text": "CDDO has worked with colleagues across the Chief Technology Officers network to identify the greatest opportunities for our technology reuse programme, ‘buy once, use many’. We’ve rolled out a single Microsoft 365 blueprint to improve interoperability and collaboration across departments, and are partnering with the Grants Management function to create a cross-government approach to grants management. We’ve launched a legacy IT risk framework that is enabling us to identify and assess the highest risk legacy systems across government and ensure funding is prioritised accordingly - including the £2.6bn allocated at the last Spending Review. Alongside this, we’ve seen a number of remediation programmes reach key milestones, for example in Defra and HM Courts & Tribunals Service. Through the Chief Technology Officer Council, we’ve begun to more systematically capture the benefits of emerging technology with quarterly “Innovation Days” in partnership with external organisations at the frontier of new technologies. Meanwhile work on our Mobile App Strategy has just begun, in partnership with GDS.  "
        },
        {
            "text": "Mission Five: Digital Skills at Scale"
        },
        {
            "text": "The DDaT profession has grown by 12% (between April and October 2022), with almost 2,200 new colleagues who have either joined government or retrained from another profession. We’ve widened the roll out of our pay framework to departments, with 28 departments now onboarded, ensuring we can pay more competitive salaries for scarce technical skills. We’ve also trained hundreds of senior government executives on Digital, Data and Technology Essentials, both through central programmes and department-specific ones, such as HMRC’s Spotlight on Digital Learning and the MoJ’s Innovation Month. In addition, we’ve further strengthened our DDaT profession through a Software Developer Graduate Programme, grown our Apprenticeship community through initiatives including at the Department for International Trade, and added new competencies to our professional frameworks, such as crucial Accessibility and Assurance roles."
        },
        {
            "text": "Mission Six: A System that Unlocks Digital Transformation"
        },
        {
            "text": "We’ve begun addressing some of the systemic barriers to digital transformation. This includes working with HM Treasury on updates to budgeting guidance to help make it simpler for teams to manage their allocations including the way they account for spend on key services such as Cloud. In addition, we’re partnering with the Commercial function to develop new guidance on managing investment in Cloud."
        },
        {
            "text": "Vital to our continued success are our communities of leaders across government who are driving each of these missions forwards - our Permanent Secretary Digital and Data Board, Functional Leadership Group of Chief Digital and Information Officers, as well as our Chief Technology Officer and Chief Data Officer councils. We’ve kicked off some specialist communities recently, including our Government Technical Cloud community, and we are expanding our connections into broader government business leadership through our Service Transformation boards, both at a practitioner and leadership level. "
        },
        {
            "text": "Accelerating delivery"
        },
        {
            "text": "Personally I’m hugely encouraged by how much we’ve collectively achieved over the last six months, a testament to the continued dedication of digital, data and technology colleagues in all corners of government. "
        },
        {
            "text": "However, delivery has not been without its challenges and sustained focus on transformation will be necessary to achieve our collective aims. As CDDO Chair Paul Willmott commented: "
        }
    ]
}