{
    "url": "https://deframedia.blog.gov.uk/2023/02/06/uk-government-set-to-host-major-international-finance-event-in-support-of-un-nature-cop15/",
    "title": "UK government set to host major international finance event in support of UN Nature COP15",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-02-06T16:49:20+00:00",
    "content": [
        {
            "text": "The Sunday Times on the 5th February covered plans for the UK government hold a major multinational event to drive forward action on the COP15 Global Biodiversity Framework. His Majesty The King is also set to host a reception at Buckingham Palace on Friday 17th February in support of Global Biodiversity."
        },
        {
            "text": "A new deal to protect nature was agreed by countries around the world at the COP15 UN biodiversity summit in Montreal in December where the UK government played a leading role in driving negotiations and securing international commitments."
        },
        {
            "text": "The UK is continuing to support the effective implementation of  the agreement and will be hosting an event at Lancaster House in London, scheduled for 17th February to drive forward global financing."
        },
        {
            "text": "Almost 200 countries signed up to Kunming-Montreal Global Biodiversity Framework (GBF) agreement which sets the framework for the next decade of action to protect nature with a global commitment to halt and reverse biodiversity loss by 2030 and to protect 30% of the world’s land and ocean by the same date."
        },
        {
            "text": "This includes a major push to increase the amount of money invested in tackling  nature loss and restoring threatened habitats such as mangroves, rainforests and grasslands. The agreement set out that the total finance required for biodiversity is $200bn per year by 2030, including $20bn in flows to developing countries by 2025, rising to $30bn by 2030."
        },
        {
            "text": "The Environment Secretary, Dr Thérèse Coffey MP said:"
        },
        {
            "text": " Tony Juniper, Chair of Natural England said."
        }
    ]
}