{
    "url": "https://healthmedia.blog.gov.uk/2023/02/06/world-cancer-day-how-the-government-is-tackling-cancer/",
    "title": "World Cancer Day: How the government is tackling cancer",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-02-06T17:11:29+00:00",
    "content": [
        {
            "text": "Cancer impacts on the lives of everyone, either directly or through a family member or friend."
        },
        {
            "text": "The government is fully focused on fighting cancer on all fronts – prevention, diagnosis, treatment, research and funding – to deliver the best possible outcomes for patients."
        },
        {
            "text": "Following on from World Cancer Day – on Saturday 4 February – here are details on just some of the work the government is involved in to improve those outcomes."
        },
        {
            "text": "More patients are being diagnosed and being treated. We have already opened 92 community diagnostic centres since 2021 delivering over 2.9 million tests, scans and checks including for cancer."
        },
        {
            "text": "We have partnered up with some of the best and brightest minds who created the Covid vaccine to develop cancer vaccines and are investing hundreds of millions of pounds in exciting trials."
        },
        {
            "text": "Ultimately we all want to find a cure but while work continues on research and new therapies it is vital we scan, diagnose and treat those with cancer as soon as possible."
        },
        {
            "text": "Prevention"
        },
        {
            "text": "Prevention is key. The government remains committed to its Smokefree ambition by 2030, and the action we are taking means smoking rates in England are at an all-time low, currently at 13% and down from 20% in 2010."
        },
        {
            "text": "We continue to enforce strong regulations around the sale of cigarettes which help smokers to quit and protect future generations from starting this lethal addiction."
        },
        {
            "text": "Last year alone, we provided £35 million to support the NHS Long Term Plan commitments on smoking. The NHS has committed that all smokers admitted to hospital will be offered NHS-funded tobacco treatment services."
        },
        {
            "text": "We have also provided £72.7 million to local authority stop smoking services through the public health grant."
        },
        {
            "text": "More than 100,000 people quit with the support of a stop smoking service in 2020-21."
        },
        {
            "text": "Detection"
        },
        {
            "text": "Where we cannot prevent early detection is important."
        },
        {
            "text": "For cervical cancer we are improving screening uptake with appointments available from any primary care setting, via sexual health clinics and during evenings and weekends."
        },
        {
            "text": "The number of women taking part in the NHS Cervical Screening Programme in 2021/22 rose and combined with the HPV vaccination and there are an estimated 5,000 lives saved each year."
        },
        {
            "text": "For breast cancer more than a million breast cancer scans were carried out last year with an estimated 1,300 lives saved."
        },
        {
            "text": "We also increased funding by £10 million to provide 29 new mobile breast screening units and over 60 life-saving upgrades to services in the areas where they are most needed."
        },
        {
            "text": "To increase screening even further and clear the mammogram backlog breast screening offices are working with patients to offer more sessions with patients also being reminded and encouraged to attend via text message and more screening facilities are available."
        },
        {
            "text": "Bowel cancer screening is being extended to people aged 50 to 74 by 2024/25 following the recommendation by the UK National Screening Committee."
        },
        {
            "text": "The government is also considering a recommendation from the UK National Screening Committee to introduce screening for high risk people – mainly smokers or former smokers -  aged 55 to 74."
        },
        {
            "text": "And a review on prostate cancer screening will take place in 2023/24."
        },
        {
            "text": "Treatment"
        },
        {
            "text": "Once cancer is detected it is important treatment begins as soon as possible and we are determined to reduce the time between cancer referral and consultation."
        },
        {
            "text": "More patients had their first consultation following a GP referral for cancer in November 2022 than any previous month."
        },
        {
            "text": "More than 50,000 cancer treatments were provided in November 2022 - the highest since data began being collected almost five years ago."
        },
        {
            "text": "Over 320,000 people received their first treatment for cancer in the 12 months to November 2022 - up by more than 10,000 on the same period pre-pandemic."
        },
        {
            "text": "In November 2022 over 91% of cancer patients started their first treatment within one month of a decision to treat. 98% received subsequent chemotherapy treatment within 31 days and 90% for radiotherapy."
        },
        {
            "text": "We are working to reduce the 62 day cancer backlog - which has fallen 20% since peaking in 2020 and we know more needs to be done."
        },
        {
            "text": "The NHS Long Term Plan includes a target that 75% of patients who have been urgently referred by their GP for suspected cancer will be diagnosed or have cancer ruled out within 28 days by March 2024."
        },
        {
            "text": "We also know how important it is to make sure treatment and diagnosis is available to all no matter where you live or what your background. World Cancer Day has the message #closethecaregap and we want to share advancements to benefit everybody."
        },
        {
            "text": "The statistics show a disparity between diagnosis and treatment and ethnicity. The NHS Help Us Help You awareness campaign includes advertising targeted to reach Black, Asian and Minority Ethnic groups to address challenges to earlier diagnosis such as fear of what might be found."
        },
        {
            "text": "Research and funding"
        },
        {
            "text": "Investment now, in staffing and facilities, and in the future, through research into therapies or vaccines, are also key components in the battle against cancer."
        },
        {
            "text": "The NHS has allocated around £2.3 billion to expand diagnostics and £1.5 billion for treatment with a focus on cancer."
        },
        {
            "text": "Scientists & clinicians will receive £47.5 million over the next 5 years from a partnership between Cancer Research UK, NIHR and the Little Princess Trust to deliver early phases of clinical research, generating new treatments for future generations."
        },
        {
            "text": "The Health and Social Care Secretary signed a Memorandum of Understanding with BioNTech SE to bring innovative vaccine research to England with the potential to transform outcomes for cancer patients. The collaboration will aim to deliver 10,000 doses of personalised therapies to UK patients by 2030 through a new research and development hub creating jobs and strengthening the UK’s positions as a leader in global life sciences."
        },
        {
            "text": "In November, we announced that using a Vaccine Taskforce style approach, £22.5 million will go into cancer research to develop new immune-based cancer therapies, including cancer vaccines, which are targeted to a patient’s specific cancer."
        },
        {
            "text": "Funding will also support the development of technologies that enable earlier, more effective cancer diagnosis.  This announcement also launched Innovate UK’s new £30 million fund to advance life-changing cancer therapeutics delivered through the Biomedical Catalyst (BMC) programme. This new programme directly supports the UK government’s cancer mission, combining expertise in immuno-oncology and the vaccine capabilities developed throughout the pandemic."
        },
        {
            "text": "By working together with world leading scientists, charities, stakeholders, the NHS and the government we all have the best chance of preventing cancer or, when people become a patient, of diagnosing and treating it as early as possible with the latest treatment offering the best chance of recovery."
        }
    ]
}