{
    "url": "https://rpc.blog.gov.uk/2024/10/28/15-years-of-independent-rpc-scrutiny-of-government-regulation-2009-2024/",
    "title": "15 years of Independent RPC Scrutiny of Government Regulation 2009-2024",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-10-28T16:17:55+00:00",
    "content": [
        {
            "text": "The Regulatory Policy Committee has been in existence for 15 years – having originally been set up by the Labour government in 2009. To recognise this milestone, we have updated our summary of the committee’s history (originally published in 2019 to commemorate the committee’s 10th anniversary). The new version can be found on our website – here."
        },
        {
            "text": "Our 15 year review document details the changes to the role of the RPC over the last decade and a half, provides some case studies of the regulatory measures we have worked on, and includes suggestions to the new Government on how to make our role even more effective."
        },
        {
            "text": "Over the past 15 years, the RPC has issued over 4,600 formal and informal opinions on regulatory impact assessments, post-implementation reviews and cost-to-business calculations produced by teams across government on a huge range of policy areas. We are proud to have helped successive governments to improve the evidence-base and analysis underpinning regulatory proposals and through this to help them improve the quality of their policy choices."
        },
        {
            "text": "Delivering our independent, impartial, evidence-based scrutiny of the case for and potential impacts of regulatory proposals will continue to be our primary focus in the years ahead. We welcome the new Secretary of State’s comment (in his foreword to our recent recruitment campaign) that: “The Government is committed to the role the Better Regulation Framework plays in ensuring that regulatory decisions are based on evidence and sees the RPC's role as a key part of the process. The Committee will continue to be critical in informing our approach to regulation”."
        },
        {
            "text": "We also appreciate the strongly supportive comments in the document from our stakeholders at the Institute of Directors, UK Hospitality, Confederation of British Industries, Trades Union Congress, Federation of Small Businesses, Office of Environmental Protection and Make UK."
        }
    ]
}