{
    "url": "https://moderncivilservice.blog.gov.uk/2024/10/28/dataconnect-2024-the-power-of-data-community-connection/",
    "title": "DataConnect 2024: The power of data community connection",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Digital and data",
        "Innovation",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-10-28T11:53:31+00:00",
    "content": [
        {
            "heading": 6,
            "text": "Guest blog by Rachael Richards, Data Community Lead, Central Digital and Data Office."
        },
        {
            "text": "DataConnect, Government's largest virtual data conference, has successfully drawn to a close, after bringing together thousands of cross-government, local government, academic and data professionals for one week, in late September. "
        },
        {
            "heading": 2,
            "text": "Who attended the DataConnect event?"
        },
        {
            "text": "The ‘for the community, by the community’ data event was launched by Peter Kyle, Secretary of State for Science, Innovation and Technology, and recorded its highest level of engagement consistently across all sessions since its inception in 2021. It welcomed over 3,200 unique attendees who attended multiple sessions from over 40 programmes and was delivered by over 100 speakers from the Met Office, GCHQ, Ada Lovelace Institute, Alan Turing Institute, British Council, the Open Data Institute, Oxford University, Transport for London and the Estonian Government."
        },
        {
            "text": "The audience spent on average over seven hours on the virtual events platform where the conference was delivered for the first time, watching and interacting with speakers, viewing replays and networking. Registrants joined from many different departments and disciplines, including the Independent Office for Police Conduct, NHS Transformation Directorate, National Highways, Queen Mary University of London, Department for Education, Department of Business and Trade, Home Office, Department for Culture, Media and Sport, Local Government Association, Scottish Government, Welsh Government and the Department for Environment, Food & Rural Affairs."
        },
        {
            "text": "Mat from GCHQ, a speaker who presented several sessions on data sharing, said:                                                                                                                                                                        “I received some brilliant questions that really made me think. In particular, it was reassuring to hear familiar issues coming at me from a fresh and incredibly diverse community. "
        },
        {
            "text": "“I’m a massive believer in the power of communities. There is so much knowledge and expertise across government that we simply must tap into. What a waste it would be if we didn’t. There is a huge opportunity to deliver security, prosperity and happiness for our fellow citizens here.”"
        },
        {
            "text": "He continued: “I implore everyone who went to DataConnect to provide feedback…on the connections you made and the things you learned. Because I guarantee that someone, somewhere, will do something brilliant in the next 12 months because of something they heard or someone they met at the conference.”"
        },
        {
            "text": "Craig Suckling, Chief Data Officer for Government, said:"
        },
        {
            "text": "“Our programme of upskilling across data communities will continue. We believe in the power of professional connection, and professionals from diverse departments listening to current thinking around Gen AI, data sharing, and governance is important, as there are many approaches to solve common challenges."
        },
        {
            "text": "“We hope that this community will then work together on future projects, and enable better data sharing, improve knowledge sharing across government, and ultimately transform public services and support economic growth.”"
        },
        {
            "heading": 2,
            "text": "Re-watch your favourite sessions"
        },
        {
            "text": "The most popular events included:"
        },
        {
            "text": "To rewatch sessions from this year's DataConnect, please go to the ‘replay’ section on Hopin, the virtual events platform. (You will need to have registered on Hopin previously)."
        }
    ]
}