{
    "url": "https://educationhub.blog.gov.uk/2021/09/01/back-to-school-experts-underline-the-importance-of-minimising-disruption-in-schools/",
    "title": "Back to School: Experts underline the importance of minimising disruption in schools",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Returning to school"
    ],
    "pub_date": "2021-09-01T16:58:19+01:00",
    "content": [
        {
            "text": "Experts agree that it is important for young people go back to schools and colleges for a range of reasons and it remains crucial that they have as normal an experience as possible."
        },
        {
            "text": "The World Health Organization (WHO) and Unicef have asked that schools across Europe must stay open. Hans Kluge, the head of the WHO’s Europe region comments in the Guardian that schools are “places of learning, safety and play at the heart of our communities. When they close, children miss out on learning and being with their friends”"
        },
        {
            "text": "Phillipe Core, deputy regional director of the UN children’s fund for Europe and central Asia, reinforces this message saying “Children and youth cannot risk having another year of disrupted learning. [They] have been the silent victims of the pandemic, and the most marginalised have been amongst the hardest hit.”"
        },
        {
            "text": "That is why the majority of restrictions have been lifted as pupils begin to return to classrooms after the summer break. Now that there are fewer restrictions, pupils will be able to experience a fuller education experience, including; access to more group activities, team sports, playing with friends, plays, and taking part in musical groups."
        },
        {
            "text": "Schools and colleges are maintaining proportionate protective measures such as testing, ventilation and extra hygiene precautions that help keep children and staff safe and minimise disruption to face-to-face education."
        },
        {
            "text": "Kluge adds: “Vaccination is our best line of defence against the virus, while continuing to continue to follow the public health and social measures we know work, including testing, sequencing, tracing, isolation and quarantine.” "
        },
        {
            "text": "Coronavirus hasn’t gone away so there will still be a need for schools, pupils and students to follow basic measures to avoid the spread of the virus and to ensure the return to school is achieved as safely as possible, parents have a responsibility to make sure that their children are tested regularly."
        },
        {
            "text": "Chief Executive of the UK Health Security Agency Jenny Harries commented:"
        },
        {
            "text": "“Around one in three people who have coronavirus have no symptoms, so it is vital that we continue rapid testing in schools to help uncover hidden cases of the virus at the start of term."
        },
        {
            "text": "“We encourage children to come into school to take their first tests in-person and then to continue testing twice a week from home. We will continue to work closely with schools to ensure that all children can get back to the classroom and enjoy learning with less interruptions."
        },
        {
            "text": "“We also encourage all children eligible for the vaccine to get their jabs when offered. Alongside testing, this will help to keep children in the classroom and their families safe”"
        },
        {
            "text": "Parents are encouraged to visit gov.uk/backtoschool for information and practical guidance to help them plan for their children’s return to school."
        },
        {
            "text": " "
        }
    ]
}