{
    "url": "https://environmentagency.blog.gov.uk/2021/09/01/how-do-we-monitor-and-try-to-fix-the-pressures-on-freshwater-ecology/",
    "title": "How do we monitor and try to fix the pressures on freshwater ecology?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Other areas of our work"
    ],
    "pub_date": "2021-09-01T10:54:30+00:00",
    "content": [
        {
            "text": "Story by: Richard Chadd, Senior Environmental Monitoring Officer, Analysis and Reporting, Lincolnshire and Northamptonshire Area."
        },
        {
            "text": "The animals and plants which depend on freshwater are under threat. Most people will be aware of all of the issues caused by the activities of the human race, with the global climate emergency at the forefront. In Britain, we live on a small, highly populated island and the need to provide homes and the services on which they depend reduces the provision of resources for the natural environment. So the animals and plants living in rivers and lakes suffer the consequences. Climate change makes this worse by causing more droughts and floods."
        },
        {
            "text": "So what do we do to monitor the effect of such pressures as water abstraction, storm overflow discharges and the physical impact of the way we use the land? And, more importantly, what do we do to try to make things better?"
        },
        {
            "text": "I have worked as a freshwater ecologist with the Environment Agency in a team of ecologists for over 30 years. Essentially, I’m a bug man – I analyse samples of insects, shrimps, leeches, snails and all the other weird and wonderful panoply of things which live in rivers and lakes, including plants. You can see one of them in the picture – this is a big stonefly which needs clean, fast-flowing water and stony, mud-free riverbeds to survive."
        },
        {
            "text": "Samples of these creatures are taken in a standard way, using a pond net. You put the frame of the net on the bed of the river and kick at the stones – it’s called ‘kick-sampling’. You also add to your sample by sweeping the net through the marginal weeds and more sluggish bits of the river or lake. The sample is analysed in a laboratory and we identify what’s there and count the relative numbers. We do something similar with plants, but in this case, we record the species and their cover out by the riverside."
        },
        {
            "text": "The species and their abundance can give us lots of information about the state of a river – is the water quality good enough, is there enough water flowing through it, is the physical habitat the way it should be? Species like the Dinocras in the picture rapidly die when any of these things aren’t right. If it isn’t there when we would expect it to be, the alarm bells ring."
        },
        {
            "text": "What can we do? With something like a one-off pollution incident, our findings are used to identify the problem. This may result in the polluter going to court and getting a fine, with our data being presented as evidence of the damage caused. For more subtle things, such as abstraction from the river being more than the ecology can cope with, or a permitted discharge which is of a poor standard, our findings are used to influence licencing strategies to make things better. We can also assess habitat enhancement projects and make sure that the features we have built to improve the habitat have had the effect we want."
        },
        {
            "text": "I mentioned the climate emergency. With more floods and droughts happening, we can use our ecological data to track the severity of natural events. We may be able to offset the effects of these events by ensuring that companies are getting water from other places, reducing discharges when the dilution is low, or building habitats which can cope with the ever-increasing changes to our climate."
        },
        {
            "text": "It’s not easy – but we are doing our level best to try to preserve rivers for future generations using the species which live there as the best indicators of whether we are succeeding."
        },
        {
            "text": "Follow the Environment Agency on Twitter."
        }
    ]
}