{
    "url": "https://mhrainspectorate.blog.gov.uk/2021/09/01/mhra-and-us-fda-tackle-challenging-data-integrity/",
    "title": "MHRA and US FDA tackle challenging data integrity",
    "authors": [
        "Hayley Dixey",
        "Paula Walker"
    ],
    "categories": [
        "Compliance matters",
        "Events and symposia",
        "Good clinical practice"
    ],
    "pub_date": "2021-09-01T12:26:01+01:00",
    "content": [
        {
            "text": "The second Medicines and Healthcare products Regulatory Agency (MHRA) and US Food and Drug Administration (FDA) joint Good Clinical Practice (GCP) symposium was held in London in February 2020, covering international collaboration, sponsor oversight, electronic source documents, protocol deviations and data quality in novel clinical trial designs. This followed the first joint event back in 2018, which resulted in the following paper: https://mhrainspectorate.blog.gov.uk/2020/06/30/mhra-and-fda-joint-paper-data-integrity-in-global-clinical-trials/"
        },
        {
            "text": "We are pleased to say that, while the event seems like a world away from current times, our second joint paper resulting from this event has now been published and can be found here in Clinical Pharmacology & Therapeutics: Tackling Challenging Data Integrity. The 2020 event was also supported by our tripartite working agreement partner Health Canada."
        },
        {
            "text": "Working on the paper together provided a forum to discuss emerging trends and compliance issues as the COVID-19 pandemic evolved, and the paper evolved with it. The paper discusses both agencies’ considerations on data integrity topics, from decentralised clinical trials, adaptive design trials and management of protocol deviations to real-world data. It was great working on this with our FDA colleagues and keeping up with them throughout the pandemic. We hope the output provides a useful insight to readers."
        },
        {
            "text": "International collaboration has never been as important to the medicines lifecycle development as it has proved to be over the last 18 months, and it is great to see the published outcome of our collective thoughts on the challenges of data integrity in Good Clinical Practice. Such issues have also proved far more complex than any of us could have envisaged just before the pandemic hit, and the collaboration with stakeholders, industry, national and international regulators has challenged and supported us all. Great to see this now in print!"
        },
        {
            "text": " "
        }
    ]
}