{
    "url": "https://forestrycommission.blog.gov.uk/2021/09/01/two-years-on-from-our-centenary-milestone/",
    "title": "Two years on from our Centenary milestone",
    "authors": [
        "Sir William Worsley"
    ],
    "categories": [
        "Climate change and resilience",
        "Woodland creation"
    ],
    "pub_date": "2021-09-01T18:16:20+01:00",
    "content": [
        {
            "text": "Two years ago the Forestry Commission celebrated its Centenary year. On the day that marked 100 years since the Forestry Act was passed in Westminster, I wrote on this blog in celebration of that milestone while in my role as the Government’s Tree Champion."
        },
        {
            "text": "I looked at the challenges we faced back in 1919 and how they differ from those we face today, as well as what we were doing to act and respond to them."
        },
        {
            "text": "At that time none of us had any idea that one of the biggest challenges we would face was just around the corner, and when coronavirus hit us in 2020 we all had to rethink what was important.  For the Forestry Commission, this included continuing to carry out our function as industry regulator, plant health inspector and government adviser, as well as supporting the forestry sector to continue its work."
        },
        {
            "text": "I am so pleased that we successfully put processes in place to help us maintain our critical work while many staff were forced to work from home, including tree health management and port inspections, approving felling licenses and processing grant applications."
        },
        {
            "text": "Two years after I wrote that blog post, and on our 102nd anniversary, I wanted to reflect back on how much we have achieved in the last two years despite those incredibly challenging circumstances."
        },
        {
            "text": "In June 2020 the England Tree Strategy consultation launched, and conversations with foresters, farmers, scientists, environmental organisations and members of the public were started to shape the future vision for trees in England."
        },
        {
            "text": "Then in May this year the England Trees Action Plan was published in response to the consultation. The Forestry Commission has a key role to play in helping deliver the plan’s objectives and important work has already started on this, backed up by £500 million as part of Defra’s Nature for Climate Fund ."
        },
        {
            "text": "Bella Murfin and Naomi Matthiessen, job share Directors for the funds Tree Programme summarise the achievements so far in their blog post, Might Oaks from little Acorns grow? These include a range of new grant schemes and partnerships that have launched including our flagship new grant scheme, the England Woodland Creation Offer. This exciting new scheme offers increased payment rates for woodland creation, particularly where new woodlands will create additional benefits such as biodiversity and water quality."
        },
        {
            "text": "The Forestry Commission itself continues to evolve to meet these new demands, and over the last two years new roles have been created, including establishing a delivery director to focus on the tree planting programme and roles to develop sector capacity and enhance our relationships with those looking to create woodland. This has gone alongside growing our delivery workforce who are on the ground establishing and enabling new planting projects."
        },
        {
            "text": "Forestry England have continued their work as exemplar land managers maintaining the nation’s forests for all to enjoy whilst looking at new ways to grow them, such as through the Forestry England Woodland Partnership; a leasehold scheme creating new woodlands across England in partnership with private and public landowners."
        },
        {
            "text": "Forest Research have continued their incredible work, leading the way on research to inform sustainable forestry practices and developing tools to help forest managers consider the long-term impacts of climate change."
        },
        {
            "text": "In my 2019 blog post I said that resilience was the focus for the next 100 years, and this has not changed. In the year of COP26, when the UK is playing a key role internationally and it’s an exciting time on the domestic front for trees and forestry, we must not lose sight of the challenges that climate change brings."
        },
        {
            "text": "Tomorrow we launch a new digital communication campaign to highlight the importance of considering resilience when planning new woodlands and species choice, and when thinking about management options. Look out for further blog posts and information across our Twitter and LinkedIn channels over the next month."
        },
        {
            "text": "To many of us, these two years have felt much longer. It is remarkable that we have managed to achieve so much despite all the challenges that we have faced. We have worked together to show the resilience of the Forestry Commission in times of crises, and by doing so have put ourselves in an excellent position to achieve even more in the future."
        },
        {
            "text": " "
        }
    ]
}