{
    "url": "https://defradigital.blog.gov.uk/2021/09/01/waste-not-want-not-how-digital-is-playing-a-key-role-in-waste-reforms/",
    "title": "Waste not, want not: How Digital is playing a key role in waste reforms",
    "authors": [
        "Peter Collins"
    ],
    "categories": [
        "Defra digital",
        "Defra Science and Innovation",
        "Digital transformation",
        "User centred design",
        "User research"
    ],
    "pub_date": "2021-09-01T08:25:44+01:00",
    "content": [
        {
            "text": "A multi-disciplinary digital delivery team in Defra’s Environmental Quality Directorate is driving an exciting initiative which is central to the Government’s ambition to reduce packaging waste and improve the way we use material resources."
        },
        {
            "heading": 2,
            "text": "Chris Preston, Deputy Director, Resources and Waste Division"
        },
        {
            "text": "In 2019 the Government published the Resources and Waste Strategy for England, setting out how we will preserve our stock of material resources by minimising waste, promoting resource efficiency, and moving towards a more circular economy. In that strategy, the Government committed to several actions, particularly three that are together known as the Collection and Packaging Reforms."
        },
        {
            "text": "These reforms include introducing an Extended Producer Responsibility (EPR) scheme for packaging in the UK, introducing a Deposit Return Scheme (DRS) for drinks containers in England, Wales, and Northern Ireland, and increasing the consistency of materials collected for recycling, for both households and businesses, in England. The success of these reforms, particularly EPR and DRS, hinges on the ability to collect and managing data, which is why the digital infrastructure is so critical in their delivery."
        },
        {
            "text": "The planned reforms are crucial in the mission to build a more sustainable economy. Between 2001 and 2013 recycling rates increased from around 11% to 45%, but they have since stalled. The reforms will help drive this higher, using economic incentives to drive sustainable design decisions. An estimated 80% of the environmental damage from managing waste can be mitigated through more considered decisions at the production stage."
        },
        {
            "text": "Existing producer responsibility schemes operate on a UK-wide basis, which recognises that many manufacturers and retailers operate as part of UK-wide supply chains. As we progress the planned reforms to these schemes and develop new schemes we work closely with the governments of the devolved administrations to work towards a unified approach across the United Kingdom."
        },
        {
            "text": "The Collection and Packaging Reforms are the first wave of reforms, but in the Resources and Waste Strategy, the Government committed to extending producer responsibility beyond packaging and into other sectors, with the legal powers to do so residing in the Environment Bill which is currently proceeding through Parliament. Consultations on policy proposals have recently concluded."
        },
        {
            "text": "While current schemes have been successful in meeting recycling targets, they can do more to drive the sustainable design decisions essential to creating an efficient, circular economy, minimising the waste we generate and ensuring an environmentally sustainable future for the UK. Digital solutions, and the ongoing collaboration between the policy team and the digital team is at the heart of what we are doing to achieve a successful policy outcome."
        },
        {
            "heading": 2,
            "text": "Peter Collins, Collection and Packaging Reforms Digital Delivery Team"
        },
        {
            "text": "EPR for packaging will require obligated producers to pay the full net costs of managing packaging when it becomes waste. It will provide financial incentives through variation of the fees charged to packaging producers to encourage sustainable design, production and use of packaging."
        },
        {
            "text": "A DRS would see a redeemable deposit placed on each drink container in-scope. When a consumer purchases a drink, they will pay this deposit. The consumer will redeem their deposit when they return the drink container to a return point for recycling. This provides a financial incentive for consumers to recycle in-scope containers."
        },
        {
            "text": "And finally, through improved collection provision at home and at work, as well as the adoption of mandatory labelling on packaging to indicate whether it can be recycled or not, this policy is expected to help change behaviours and to reduce confusion over the materials that can and cannot be recycled, as well as improving the quality and increasing the quantity of materials collected for recycling, which the Government is committed to doing."
        },
        {
            "text": "As the policy position is finalised, the Digital team are meeting the challenge head on, working closely with the various policy teams. For example, business analysts in the team support their wider programme colleagues in stakeholder workshops. Similarly, digital prototypes are regularly demonstrated to policy teams to make sure that they are aligned with the proposed policy. Feedback from user research sessions is also factored into the policy making process."
        },
        {
            "text": "The delivery of these three reforms will be underpinned by digital infrastructure, particularly for EPR and DRS. Although much of the administration will be conducted by Scheme Administrators, it will be supported by the provision of IT infrastructure."
        },
        {
            "text": "For example, in Extended Producer Responsibility, parts of the infrastructure are required to be in place prior to the appointment of a Scheme Administrator. This infrastructure will facilitate the collection of packaging data required by multiple parties, including the regulators."
        },
        {
            "heading": 2,
            "text": "Maria Anthony, Defra DDTS (Digital Data and Technology Services)"
        },
        {
            "text": "As the Programme Manager responsible for delivery of this work, to me it’s vital that we use all the skills available to us. The Digital team delivering the infrastructure that underpins the reforms is a multi-disciplinary team. Currently the team is made up of designers, business analysts, user researchers and architects, though there’s an expectation that we will bring in additional skills, for example software engineers, as the project proceeds."
        },
        {
            "text": "All the work will be delivered in-house, utilising existing applications where they can meet requirements. This collaboration enables the policy teams to benefit from the digital team’s expertise, and keeps both teams aligned towards delivering the reforms as effectively as possible, tackling highly complex problems in implementation."
        },
        {
            "heading": 2,
            "text": "Jonathan Wild, Defra DDTS Fast Streamer (one of the two Delivery Managers on the project)"
        },
        {
            "text": "Since joining Collection and Packaging Reforms as a Delivery Manager in March I’ve seen some fantastic work on both EPR and DRS and been impressed at the strength and quality of the team. We have a wide-ranging set of skills which will lend itself well to ensuring that each aspect of the service is carefully implemented from the design to the infrastructure that supports it."
        },
        {
            "text": "The team is focused on delivering a high-quality service that will succeed in minimising waste and improving resource efficiency. We have encouraged a strong user focus throughout all the design work so far, and this will continue as we progress through the programme, with continuous user testing planned with each iteration of the design."
        },
        {
            "text": "Find out more about the proposed reforms to boost recycling and fight plastic pollution."
        }
    ]
}