{
    "url": "https://space.blog.gov.uk/2025/09/19/train-like-an-astronaut-with-mission-x/",
    "title": "Train like an astronaut with Mission X",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space"
    ],
    "pub_date": "2025-09-19T01:00:00+01:00",
    "content": [
        {
            "text": "There’s an opportunity for children across the country to take part in Mission X – a programme that uses the excitement of space exploration to encourage engagement with science, technology, engineering, and mathematics (STEM), while promoting fitness and teamwork."
        },
        {
            "text": "This year, John McFall, a member of the European Astronaut Reserve, has given his backing to the programme. Through astronaut-inspired activities, students complete physical and scientific challenges, that earn them steps to help Mission X Mascots, Luna, and Leo, walk 384,400 km, the distance from Earth to the Moon."
        },
        {
            "text": "The challenge, which opens today (19 September), connects classrooms to the real-world science of space exploration and encourages curiosity, problem-solving, and collaboration."
        },
        {
            "text": "Last year, UK students collectively earned enough steps to support Luna and Leo to walk an impressive 29,128,000 steps – the equivalent of 21,846 km. This year, schools and groups across the country are aiming to walk even further, making their contribution to the global challenge bigger than ever."
        },
        {
            "text": "Mission X: Train Like an Astronaut, is an international project by the European Space Agency (ESA) and the UK Space Agency delivered in the UK by STEM Learning and the European Space Education Resource Office (ESERO UK). "
        },
        {
            "text": "UK ESA astronaut Tim Peake, who flew to the International Space Station in 2015, has been a long-time supporter of Mission X. His Principia mission inspired millions of young people across the UK and continues to highlight how space can motivate the next generation of scientists and engineers."
        },
        {
            "text": "If you would like to register your school or group to take part in Mission X: Train Like an Astronaut, please visit: https://www.stem.org.uk/esero/primary/competitions-and-challenges/mission-x"
        }
    ]
}