{
    "url": "https://naturalengland.blog.gov.uk/2026/02/02/a-new-mapping-tool-to-support-beaver-reintroductions-and-dispersal-across-england/",
    "title": "A new mapping tool to support beaver reintroductions and dispersal across England",
    "authors": [
        "Heather White",
        "Daveron Smith"
    ],
    "categories": [
        "Biodiversity",
        "Science and evidence",
        "Species re-introductions",
        "Species recovery"
    ],
    "pub_date": "2026-02-02T12:10:32+00:00",
    "content": [
        {
            "text": "By Heather White - Senior Data Scientist and Daveron Smith - Principal Data Scientist"
        },
        {
            "text": "In this blog, we launch the Beaver Considerations Assessment Toolkit (BCAT), a new mapping tool that has been developed by Natural England (NE), in collaboration with the Environment Agency (EA). The toolkit has been designed to help people understand the potential impacts and suitability of reintroducing beavers to different watercourses or waterbodies across England, as well as the potential effects of existing wild populations."
        },
        {
            "text": "Important note: The BCAT is a guide only. It is not a decision-making tool, you must use it alongside expert judgement, site-specific knowledge, and scientific literature."
        },
        {
            "text": "Who can use the toolkit and where can I access it?"
        },
        {
            "text": "The BCAT is openly accessible for anyone to use. The BCAT, associated guidance, and video demonstrations can be accessed from the Beaver Management website."
        },
        {
            "text": "It might be useful to those exploring wild beaver reintroduction projects, beaver management groups, beaver advocacy groups, environmental NGOs, charities, landowners, and for educational purposes."
        },
        {
            "text": "What might beaver activity have an impact on?"
        },
        {
            "text": "In February 2025, the Government announced its commitment to wild beaver reintroductions in England, marking a historic day for nature recovery. Beaver presence is known to bring clear benefits to the surrounding environment by enhancing biodiversity, improving water quality, alleviating flooding, and helping to reduce droughts. Nevertheless, wild beaver activity might have an impact, positively or negatively, on many environmental and socio-economic factors (“considerations”). "
        },
        {
            "text": "A list of potential considerations that might be affected by beaver activity was drawn from the 2021 evidence review and fine-tuned through workshops and discussions with Natural England and Environment Agency technical experts, as well as external stakeholders (e.g., Beaver Trust). Datasets reflecting these considerations were sourced at a national scale, providing a range of considerations that are included within the toolkit and grouped into five categories: designated sites, habitat and species, hydrology, infrastructure, and land use. Some examples of considerations include urban areas, agricultural land, designated sites, national grid structures, ancient woodland, and many more!"
        },
        {
            "text": "Where might impacts occur?"
        },
        {
            "text": "The BCAT can be used to identify which considerations are present in any given area across England. Users can draw and create custom areas of interest. The toolkit then provides a summary of the custom area, including the type and number of considerations present (Figure 1). These flagged considerations can be visualised on a map. "
        },
        {
            "text": "All consideration datasets can be visualised at a landscape-scale on the map. Because it is subjective as to whether the possible impacts from beaver activity are thought to be positive or negative, the toolkit simply flags any potential consideration within a given area and does not ascribe these to being positive or negative. Users must, instead, apply technical expertise and local knowledge to determine whether the flagged considerations require further investigation."
        },
        {
            "text": "Assessing suitability for beavers In addition to highlighting considerations that beaver activity might affect, the BCAT incorporates two key data layers to explore habitat suitability: the Beaver Dam Capacity (BDC) and the Beaver Foraging Index (BFI) layers (Graham et al. 2020). These layers can be used to assess the likelihood of dam construction and the distribution of predicted habitat suitability in river reaches, in terms of foraging including broadleaved woodland and other sources of forage. "
        },
        {
            "text": "For any custom-drawn area, the BCAT provides a pie chart summary of the likelihood of damming and the suitability for foraging (Figure 2). Understanding the suitability of foraging habitat and the likelihood of dam-building is crucial for identifying areas where beavers are likely to settle and where their activities might have an effect."
        },
        {
            "text": "Details of the NE beaver mailbox is provided within the guidance of the toolkit and can be used to provide any feedback for future developments of the toolkit. We hope you find the BCAT useful and enjoy exploring its capabilities!"
        }
    ]
}