{
    "url": "https://defrafarming.blog.gov.uk/2026/02/02/first-precision-breeding-and-low-emissions-projects-awarded-funding/",
    "title": "First precision breeding and low emissions projects awarded funding ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2026-02-02T12:09:48+00:00",
    "content": [
        {
            "text": "We’re awarding funding to 15 projects across England that will help turn cutting‑edge research into practical, ready‑to‑use tools for farmers."
        },
        {
            "text": "In total, around £21.5 million is being invested in innovative precision -breeding and low‑emissions projects."
        },
        {
            "text": "This funding forms part of Defra’s Farming Innovation Programme, delivered in partnership with Innovate UK, which supports practical ideas that can help make farming more productive and profitable."
        },
        {
            "text": "In this post, we'll share the full list of successful applicants and highlight a selection in more detail."
        },
        {
            "heading": 2,
            "text": "Precision breeding"
        },
        {
            "text": "Precision breeding describes a range of technologies, such as gene editing, that can make the same type of genetic changes as traditional breeding but in a more efficient and precise way.  "
        },
        {
            "text": "This means that breeders can make use of new technologies to introduce beneficial characteristics in a targeted way, where traditional breeding would otherwise take longer to achieve the same results. It’s different from genetic modification, which involves moving genes between different species in ways that wouldn’t happen naturally.  "
        },
        {
            "text": "Precision breeding has the potential to help farmers produce food more efficiently and sustainably. It can support higher yields, help reduce costs on farms, and make it easier to grow crops that cope better with drought, disease and changing weather. "
        },
        {
            "text": "It also opens the door to crops that are more nutritious, need fewer treatments, and are better suited to local conditions. "
        },
        {
            "text": "Used alongside good farm management, precision breeding offers another practical tool to support productive farming while also delivering environmental benefits. "
        },
        {
            "heading": 3,
            "text": "Successful applicants"
        },
        {
            "heading": 3,
            "text": "Project spotlight: Sunshine Tomatoes: using precision breeding to improve nutrition  "
        },
        {
            "text": "The Precision Breeding Competition required projects to show the clear benefits for farmers and growers in England. According to the Tomato Growers Association, British growers produce around 70,000 tonnes of tomatoes each year."
        },
        {
            "text": "During the summer, homegrown tomatoes can make up around half of those sold in supermarkets. For the rest of the year, most tomatoes are imported, with approximately 400,000 tonnes imported from overseas. "
        },
        {
            "text": "By supporting innovation that helps UK production, precision breeding has the potential to help growers meet consumer demands, while reducing reliance on imports, and in turn the impact on the environment. "
        },
        {
            "text": "John Innes Enterprises Ltd is leading a project to bring the Sunshine Tomato closer to commercial production. The Sunshine Tomato has been developed using precision breeding to contain higher levels of provitamin D₃. "
        },
        {
            "text": "Our bodies make vitamin D when sunlight shines directly on our skin. However, in some countries like ours there isn’t enough sunlight to make enough vitamin D between October and March. "
        },
        {
            "text": "The long-term goal is to help address low vitamin D intake by making more nutritious tomatoes available to consumers. "
        },
        {
            "text": "With £967,797 funding, the project could build on earlier field trials and now focus on moving the crop from research into real-world growing. "
        },
        {
            "text": "John Innes Enterprises Ltd is the commercial arm of the John Innes Centre, a leading plant and microbial research institute in Norwich. "
        },
        {
            "heading": 3,
            "text": "Project spotlight: backing innovation in high-value, low-input climate-resilient industrial hemp "
        },
        {
            "text": "Hemp is a highly versatile crop. It is used in food, construction, and sustainable materials. "
        },
        {
            "text": "Its seeds are used to make oil, protein, and other food products, while its fibres are used in textiles, rope and packaging. "
        },
        {
            "text": "It’s also used in building materials, including hempcrete, which provides insulation and stores carbon, and in biomaterials and bioplastics that can replace products made from fossil fuels.  "
        },
        {
            "text": "Because hemp can grow on poor quality land and needs few inputs, it offers environmental benefits and new income opportunities for growers.  "
        },
        {
            "text": "With an award of £912,259, Precision Plants Ltd, partnering with the University of Hertfordshire and supported by Rothamsted Research, can move forward with the development of high value, climate resilient industrial hemp."
        },
        {
            "heading": 3,
            "text": "Project spotlight: a climate-resilient source of natural rubber in the UK "
        },
        {
            "text": "Natural rubber is found in a huge number of everyday products. Yet almost all global supply comes from Hevea rubber trees grown in south-east Asia, leaving production highly vulnerable to climate change, extreme weather, and fungal disease. As global demand continues to rise, these risks threaten supply and price stability. "
        },
        {
            "text": "QuBOOSTR will develop a new, resilient source of natural rubber by precision-breeding dandelions to produce high levels of latex in temperate climates like the UK.  "
        },
        {
            "text": "By creating a reliable, climate-resilient alternative crop, QuBOOSTR reduces dependence on overseas supply chains while opening the door to sustainable rubber production here in the UK. "
        },
        {
            "heading": 2,
            "text": "Lowering emissions  "
        },
        {
            "text": "Lowering emissions helps the climate and farming profitability."
        },
        {
            "text": "It also complements efficiency. For example, by using less fertiliser, fuel or feed to cut costs, while healthier soils and livestock improve productivity and reduce losses. "
        },
        {
            "text": "Climate change is already affecting farmers with droughts and flooding. Reducing emissions help slow these impacts and encourages practices that make farms more resilient to changing conditions. "
        },
        {
            "heading": 3,
            "text": "Successful applicants"
        },
        {
            "heading": 3,
            "text": "Project spotlight: lower-emission dairy diets using UK-grown faba beans "
        },
        {
            "text": "McArthur Agriculture Ltd’s Innovative Faba Bean Feed Ingredients project shows how UK-grown faba bean feed ingredients could cut greenhouse gas emissions from English dairy farming by up to 1.6 million tonnes of CO₂e per year. "
        },
        {
            "text": "Dairy cows produce methane during digestion. It’s a major source of emissions in the sector and contributor to climate change. Faba beans co-products are naturally rich in condensed tannins, which reduce the amount of methane cows produce without affecting their health or milk yield.  "
        },
        {
            "text": "Even a 10% reduction could save 875,000 tonnes of CO₂e annually. "
        },
        {
            "text": "By using UK-grown feed, reliance on imported protein sources is reduced, therefore creating a more sustainable, climate-friendly approach to dairy farming that benefits farmers, the environment and the wider food system.  "
        },
        {
            "heading": 3,
            "text": "Project spotlight: Cutting dairy emissions by using biological alternatives to fertiliser "
        },
        {
            "text": "BIO-PHAGE-UK is a project led by Terrafarmer Ltd, working with Citadel Environmental Solutions, Fera Science and the University of Nottingham. "
        },
        {
            "text": "The project looks at how UK dairy farms could cut greenhouse gas emissions by replacing around half of their synthetic nitrogen fertiliser with proven biological alternatives. Instead of relying as heavily on manufactured fertiliser, the focus is on improving soil health and managing nutrients more efficiently. "
        },
        {
            "text": "This approach aims to reduce nitrous oxide emissions, a powerful greenhouse gas linked to fertiliser use, while still supporting productive dairy farming. "
        },
        {
            "text": "In the long term, this could be good for farming because it helps reduce reliance on expensive synthetic fertilisers while keeping soils healthy and productive. Healthier soils can hold nutrients better and cope more effectively with extreme weather such as drought or heavy rainfall. "
        },
        {
            "text": "By using fewer synthetic inputs, farms could lower costs, improve resilience and cut emissions at the same time. That supports farm profitability as well as environmental goals, helping dairy farms remain productive and sustainable into the future. "
        },
        {
            "heading": 3,
            "text": "Rewetting peat soils to cut emissions while keeping farms productive "
        },
        {
            "text": "RePeat is a project led by Pollybell Farms Ltd that explores new ways of farming England’s peatlands. "
        },
        {
            "text": "The project shows how rewetting peat soils can cut greenhouse gas emissions while still allowing farms to produce food and energy. Instead of draining peat, which releases large amounts of carbon, RePeat tests practical alternatives that work with wetter soils. "
        },
        {
            "text": "The project brings together peatland restoration, wet-farming crops, indoor food production and renewable fuel in one joined-up system that could be scaled up in other peatland areas. "
        },
        {
            "text": "In the long term, this approach could help farms on peat soils remain viable while protecting the land they depend on. Rewetting peat helps stop soil loss and carbon emissions, preserving peat for future generations. At the same time, combining food, energy and fuel production offers new income opportunities and reduces reliance on fossil fuels. "
        },
        {
            "text": "By showing that peatland farms can cut emissions and stay productive, RePeat offers a more sustainable future for farming on peat soils. "
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog "
        },
        {
            "text": "These projects are just a small sample of how innovation funded through the Farming Futures R&D Fund is helping to support productive, resilient and sustainable farming."
        },
        {
            "text": "We’ll continue to share updates as these projects develop, including what they’re learning and how their work could benefit farmers and growers across England."
        },
        {
            "text": "To keep up with future posts, from project stories to funding updates and details of upcoming schemes and competitions, you can subscribe to the Farming blog. Subscribers receive an email notification whenever a new post is published."
        }
    ]
}