{
    "url": "https://educationhub.blog.gov.uk/2026/02/free-breakfast-club-roll-out-everything-you-need-to-know/",
    "title": "Free breakfast club roll out: everything you need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "breakfast clubs",
        "Childcare",
        "Free School Meals",
        "Schools"
    ],
    "pub_date": "2026-02-02T00:01:00+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What is the new free breakfast club scheme?  "
        },
        {
            "text": "We have introduced free breakfast clubs - 30-minute sessions before school where children get a free breakfast so they to start every day ready to learn. "
        },
        {
            "text": "Currently more than 180,000 pupils in the most disadvantaged communities are able to access free breakfast clubs. As children return from the 2026 Easter holidays, over 500 new clubs will launch, meaning free breakfast clubs will be operating in 1,250 schools and available to more than 300,000 children."
        },
        {
            "text": "These schools are based across nine regions in England and are being funded to provide this service – available to all children in each setting.  "
        },
        {
            "text": "This is part of a national roll out which will see free breakfast clubs in every primary school in England in due course "
        },
        {
            "text": "Free breakfast clubs will help ensure pupils start every day ready to learn, and in turn will improve behaviour, attendance and attainment."
        },
        {
            "heading": 3,
            "text": "What will my child get for breakfast? "
        },
        {
            "text": "Schools will provide healthy, nutritious and varied breakfasts that follow the School Food Standards.  "
        },
        {
            "heading": 3,
            "text": "What are the benefits of free breakfast clubs? "
        },
        {
            "text": "Free breakfast clubs mean no child starts school hungry and will help set children up for the day by providing a nutritious breakfast as well as time with friends to enjoy activities such as reading and crafts. "
        },
        {
            "text": "Breakfast clubs, such as those already run by the Magic Breakfast programme have been shown to boost children’s reading, writing, and maths by an average of two months.   "
        },
        {
            "text": "For parents, free breakfast clubs mean help with childcare at the start of the school day – at no extra costs. It means those parents can drop their children off half an hour earlier – helping parents get into work, giving them up to 95 additional hours back to juggle busy mornings, and saving working families up to £450 a year."
        },
        {
            "text": "We know many families are feeling the impact of the cost-of-living crisis and that is why we have prioritised schools with the highest proportion of pupils on free school meals to ensure that the real-life impact of free breakfast clubs goes first to where it is most needed."
        },
        {
            "heading": 3,
            "text": "Which schools are part of the first phase of free breakfast clubs? "
        },
        {
            "text": "Schools joining the programme will contact families directly about how to sign up for the free breakfast club. As well as prioritising disadvantaged schools, the chosen schools represent different types, sizes and geographical areas across England. "
        },
        {
            "heading": 3,
            "text": "What if my school isn't part of the scheme yet? "
        },
        {
            "text": "We’ve always been committed to rolling out free breakfast clubs to every primary school in England because we know how powerful the benefits are!"
        },
        {
            "text": "Our early adopter test and learn phase has been a huge success, with over 7 million breakfasts served so far, and we want to build on that momentum – that is why we are onboarding an additional 2000 schools between April 2026 and March 2027."
        },
        {
            "text": "This next phase builds on this great work already happening and we continue to receive excellent feedback from schools, parents and pupils on the positive impact that the free breakfast clubs are already having. "
        },
        {
            "text": "If you have specific questions about how the new free breakfast club programme will work in your child's school, we recommend speaking directly with the school once they confirm their participation. "
        },
        {
            "heading": 3,
            "text": "How much funding will schools get?"
        },
        {
            "text": "All schools new to the programme will receive a £1,000 start-up grant to purchase the equipment and materials they need to run their club."
        },
        {
            "text": "Each mainstream school will then receive £25 a day to cover fixed costs like staffing, along with £1 per pupil per day that attends the free breakfast club."
        },
        {
            "text": "An average sized mainstream school with 50% take-up is expected to receive a total of £29,500 annually."
        }
    ]
}