{
    "url": "https://food.blog.gov.uk/2020/09/29/antimicrobial-resistance-amr-in-the-food-chain/",
    "title": "Antimicrobial Resistance (AMR) in the food chain",
    "authors": [
        "Food for Thought"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2020-09-29T14:36:09+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "In our latest Food for Thought seminar, we explore the impact of Antimicrobial Resistance (AMR) in the agri-food chain."
        },
        {
            "text": "Dr Edward Haynes (Fera) and Dr Erin Lewis (Food Standards Agency) present the latest research and insights into the most important form of AMR, antibiotic resistance among bacteria. This Food for Thought seminar was recorded on Tuesday 15 September 2020."
        },
        {
            "text": "Antimicrobial Resistance (AMR) describes the evolution of microbes to become resistant to the antimicrobial agents used to control them. At its broadest, this encompasses a wide range of organisms, including:"
        },
        {
            "text": "AMR in bacteria is increasingly recognised as a critical global public health emergency. It has the potential to render treatable diseases untreatable. It may also make medical techniques such as chemotherapy and organ transplants dangerous."
        },
        {
            "text": "AMR has the potential to evolve anywhere along the agri-food chain. This can be in response to chemical treatments used to control microbes, or for other purposes. At the agricultural end of the chain, livestock agriculture it is often considered most important in terms of AMR evolution. This is due to the volumes of veterinary antibiotics used in animal production."
        },
        {
            "text": "Yet, crop agriculture also has the potential to contribute to the evolution of AMR, as a recent literature review has demonstrated. We will also show results from High Throughput Sequencing (HTS) testing of samples from food manufacture and retail sale. These results show the application of HTS for simultaneously screening for the presence of multiple AMR genes and the microbes associated with a range of foods."
        },
        {
            "heading": 3,
            "text": "​Food for Thought is a series of seminars to improve understanding of the food space and share the latest insight on matters concerning the food industry."
        },
        {
            "text": "We invite experts and external speakers to present their research to FSA staff. We will be publishing a selection of Food for Thought seminars on our blog to share knowledge and encourage conversations among consumers, the food industry and the scientific community."
        },
        {
            "text": "Views expressed are those of the external speakers and do not necessarily represent those of the FSA."
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "\nYmwrthedd Gwrthficrobaidd (AMR) yn y gadwyn bwyd-amaeth"
        },
        {
            "text": "Yn ein seminar ‘Food for Thought’ diweddaraf, rydym ni’n archwilio effaith Ymwrthedd Gwrthficrobaidd (AMR) yn y gadwyn bwyd-amaeth."
        },
        {
            "text": "Dr Edward Haynes (Fera) a Dr Erin Lewis (Asiantaeth Safonau Bwyd) yn cyflwyno'r ymchwil a'r mewnwelediadau diweddaraf ar y ffurf bwysicaf o ymwrthedd gwrthficrobaidd, neu AMR, sef ymwrthedd gwrthfiotig ymysg bacteria. Cafodd y seminar ‘Food for Thought’ hwn ei recordio ddydd Mawrth 15 Medi 2020."
        },
        {
            "text": "Mae Ymwrthedd Gwrthficrobaidd (AMR) yn disgrifio esblygiad microbau i allu gwrthsefyll yr asiantau gwrthficrobaidd a ddefnyddir i'w rheoli. Ar ei ehangaf, mae hyn yn cwmpasu amrywiaeth eang o organebau, gan gynnwys:"
        },
        {
            "text": "Mae AMR mewn bacteria yn cael ei gydnabod fwyfwy fel argyfwng iechyd cyhoeddus byd-eang critigol. Mae’r posibilrwydd y gall wneud afiechydon triniadwy yn rhai na ellir eu trin. Efallai y bydd hefyd yn gwneud technegau meddygol fel cemotherapi a thrawsblaniadau organau yn beryglus."
        },
        {
            "text": "Mae gan AMR y potensial i esblygu unrhyw le ar hyd y gadwyn bwyd-amaeth. Gall hyn fod mewn ymateb i driniaethau cemegol a ddefnyddir i reoli microbau, neu at ddibenion eraill. Ar ben amaethyddol y gadwyn, amaethyddiaeth da byw sydd yn aml yn cael ei ystyried yn bwysicaf o ran esblygiad AMR. Mae hyn oherwydd y lefelau o wrthfiotigau milfeddygol a ddefnyddir wrth gynhyrchu anifeiliaid."
        },
        {
            "text": "Ac eto, mae gan amaethyddiaeth cnydau hefyd y potensial i gyfrannu at esblygiad AMR, fel y mae adolygiad llenyddiaeth diweddar wedi’i ddangos. Byddwn ni hefyd yn dangos canlyniadau profion Dilyniannu Trwybwn Uchel (HTS) o samplau o weithgynhyrchu a manwerthu bwyd. Mae'r canlyniadau hyn yn dangos y broses o ddefnyddio profion HTS ar gyfer sgrinio ar yr un pryd am bresenoldeb genynnau AMR lluosog a'r microbau sy'n gysylltiedig ag ystod o fwydydd."
        },
        {
            "heading": 3,
            "text": "Cyfres o seminarau yw Food for Thought i wella dealltwriaeth o'r gofod bwyd a rhannu'r mewnwelediad diweddaraf ar faterion sy'n ymwneud â'r diwydiant bwyd."
        },
        {
            "text": "Rydym ni’n gwahodd arbenigwyr a siaradwyr allanol i gyflwyno eu hymchwil i staff yr ASB. Byddwn ni’n cyhoeddi detholiad o seminarau Food for Thought ar ein blog i rannu gwybodaeth ac annog sgyrsiau ymhlith defnyddwyr, y diwydiant bwyd a'r gymuned wyddonol."
        }
    ]
}