{
    "url": "https://childrenssocialcare.blog.gov.uk/2022/10/27/care-experienced-lives-can-be-changed-by-just-one-person/",
    "title": "Care experienced Lives can be changed by just one person",
    "authors": [
        "Mark Riddell"
    ],
    "categories": [
        "Care Leavers"
    ],
    "pub_date": "2022-10-27T11:53:19+01:00",
    "content": [
        {
            "text": "Mark Riddell MBE is the National Implementation Adviser for Care Leavers at the Department for Education."
        },
        {
            "text": "As the National Adviser for Care Leavers, it is a real celebration that every year, we have Care Leavers’ week.  This brings together care experienced people to celebrate, have fun and attend events.  But we also have to remember that being in care and leaving care are the biggest challenges that these children and young people face.  I know this all too well from my own care experience."
        },
        {
            "heading": 4,
            "text": "Your history is yours, be proud of it"
        },
        {
            "text": "I spent my early years with my two brothers, my mum and dad and all seemed well. When I was about eight years old, my mother would frequently sleep at the bottom of my bed. I had no idea why that was.  One day, I came home from school to find her packing stuff into suitcases and then my auntie’s car. She told me to get my favourite toys as we were going to live with my aunt. My mother had been planning this for a while as she was in a domestic violent relationship fuelled by my alcoholic father. She had suffered years of abuse, but I never saw any of it, as she hid it well. After about six months, my mother became unwell and died shortly after. This was huge for me and my brothers.  After many changes, living with family members and finally with my father, we entered public care in 1980. This was due to neglect; my father was not able to look after us."
        },
        {
            "text": "You never really forget these things and they will form the person you are today."
        },
        {
            "heading": 4,
            "text": "Being in care and leaving care"
        },
        {
            "text": "My experience of care was neither good nor bad, I suppose. That does not mean to say it was easy, as being in care carries with it a huge stigma. The system is inherently environmentally challenging particularly as I lived in children’s homes. I didn’t want a foster family as I already had a family. At that time, children’s homes were large institutions with around 15 bedded units with 15 children and young people with very different needs. Getting through the system was tough, but for me, it made me more determined to be someone and not a statistic or a stigma. This led to some very interesting experiences and at times down some very challenging roads. One of those roads was using solvents to escape from my emotions, mostly related to the death of my mother. Fortunately, as I approached 16 years of age, new roads emerged with better opportunities. One of which was meeting Alex, the manager of the last children’s home I lived in."
        },
        {
            "heading": 4,
            "text": "Just one person changed my life"
        },
        {
            "text": "Alex’s approach was firm but fair. He instilled the belief in me to never give up and, that a mistake is something you learn from. That’s the approach he expected his staff to work to and most did. Working in that way removed the barriers of stigma and disadvantage within the home, but in the outside world that was a bigger challenge. One weekend when I had used solvents, I began to smash up the windows of the children’s home and was taken to police cells overnight; my road to custody was almost sealed. The turning point was when Alex asked for me to be returned to the unit so he could discuss what had happened. I returned to the home, prepared to go into custody.  Alex came into the office and said, ‘you are going nowhere this is your home.’ At that point that changed my whole life. I stopped using solvents and encouraged others to stop as well. Alex gave me another chance and the benefits of that is what led me to where I am today."
        },
        {
            "heading": 4,
            "text": "‘Is what we offer good enough for my child or young person?’"
        },
        {
            "text": "When I travel across the country, I tell this story to the fantastic people I meet in local authorities, voluntary organisations, charities and the business sector, who go that extra mile to support those who are care experienced, to reinforce to them how important their role is in shaping lives. The starting point when supporting young people who are care experienced is the fundamental question ‘is what we offer good enough for my child or young person’. Local authorities and partners are beginning to work more closely to develop bespoke offers for those who are care experienced. For example, Bolton have a dedicated housing worker in their leaving care team who prevents care leavers becoming homeless. Southend place their Department for Work and Pensions Single Point of Contact (SPOC) in the leaving care team. They engage care leavers who are nearing their 18th birthday in a conversation that starts with ‘you are not claiming Universal Credit as I will find you work’. Barking and Dagenham have an emotional wellbeing worker based in their leaving care team who supports the care experienced with emotional and mental health related issues. All of these roles are more than just roles in supporting those leaving care. They are based on trust and established relationships. These examples illustrate how the thinking is evolving to the mentality that ‘this is what I would offer my child or young person’."
        },
        {
            "text": "On a recent visit to the London Borough of Barnet where they have a well-established multi-disciplinary approach, I heard how a young, black woman wanted to become a ballet dancer. Her foster carer and ballet teacher saw her potential and supported her through some very challenging times.  Eventually, she was offered a place at the Royal Ballet School and is a ballet dancer today living her dream.  She told me that it would have been so easy just to quit, but she stuck with it as people believed in her."
        },
        {
            "text": "With the right support and self-belief, care leavers can achieve anything they want."
        },
        {
            "text": "To find out more about how we are supporting care leavers, visit Care Leaver Covenant, Become and the Children's Commissioner for England Help At Hand website."
        }
    ]
}