{
    "url": "https://environmentagency.blog.gov.uk/2022/10/27/how-we-use-your-information-to-stop-waste-criminals/",
    "title": "How we use your information to stop waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2022-10-27T10:07:15+00:00",
    "content": [
        {
            "text": "By Pete Booth, Senior Intelligence Officer"
        },
        {
            "text": "In my role as a Senior Intelligence Officer, I can tell you the information you give to us about waste crime is vital. We identify, investigate, and prosecute cases from the intelligence you provide."
        },
        {
            "text": "Intelligence is the lifeblood of any enforcement body"
        },
        {
            "text": "It’s crucial we gather the right information to have the greatest impact on waste criminals. The more relevant information we have, the better decisions and impact we will have."
        },
        {
            "text": "Intelligence can provide the jigsaw pieces we are missing. Such as the location of an illegal waste site, the details of vehicles dumping waste or the description of a waste criminal."
        },
        {
            "text": "We turn your information into intelligence through a process of evaluation, analysis, and risk-assessment. We prioritise that intelligence according to our crime priorities."
        },
        {
            "text": "We build up a picture of offending using various crime systems, covert assets and working with law enforcement partners."
        },
        {
            "text": "Our intelligence comes from a variety of sources, but the most crucial for investigating crime is human intelligence. People know when something isn’t right, it’s a feeling in your gut that says ‘this is suspicious’. You have the power to make a difference and help us drive criminals out of the waste sector."
        },
        {
            "text": "How my team uses intelligence"
        },
        {
            "text": "I lead a team of Intelligence Officers, Researchers & Analysts responsible for intelligence in the North of England. Every day my team reviews newly received information and incidents. We look for emerging threats and new information about our current targets and locations of interest. Officers then conduct enquiries to develop our understanding and support our objectives."
        },
        {
            "text": "To give an example, we received information about a previously unknown illegal waste site in the Greater Manchester area. We established a business was operating in the area and dispatched local officers to substantiate the information. A criminal investigation and intervention strategy was then initiated. During that investigation we supported investigators with targeted intelligence work. This included identifying suspects and tracking down one who had fled abroad."
        },
        {
            "text": "We work closely with local officers, covert assets, and law enforcement partners to ensure our investigators and decision-makers are armed with accurate and up to date information."
        },
        {
            "text": "Why tell the Environment Agency?"
        },
        {
            "text": "Firstly, we are likely to be the only organisation who can put a stop to waste crime. For those working in the waste sector, it makes commercial sense to report it, as legitimate operators are financially undermined by waste criminals. Plus, you have responsibility as an operator to the communities and customers you serve. If nothing else, morally it’s the right thing to do as a citizen."
        },
        {
            "text": "What will we do?"
        },
        {
            "text": "The action we take will vary and will not always be immediate and visible. Often the information we receive will become part of a collection of information that we can turn into good enough intelligence or sufficient evidence to enable us to take decisive action."
        },
        {
            "text": "Work with us to fight environmental crime and don’t be discouraged if you don’t see immediate and visible action. Our work often involves working covertly, building a case before we take overt action."
        },
        {
            "text": "Will you protect my identity?"
        },
        {
            "text": "We have robust procedures to protect the sources of our information and you always have the option to remain anonymous."
        },
        {
            "text": "Who should I contact?"
        },
        {
            "text": "You can contact us direct on our incident hotline, or contact our partner, Crimestoppers online or via telephone:"
        },
        {
            "text": "Environment Agency incident hotline"
        },
        {
            "text": "Crimestoppers. 100% anonymous. Always"
        }
    ]
}