{
    "url": "https://educationhub.blog.gov.uk/2022/10/how-young-people-can-access-environmentally-friendly-period-products-at-school/",
    "title": "How young people can access environmentally friendly period products at school ",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Period Products Scheme"
    ],
    "pub_date": "2022-10-27T15:00:25+01:00",
    "content": [
        {
            "text": "Nobody should have to miss out on education because of their period. That’s why we’re ensuring this doesn’t happen through the Period Products Scheme which provides pupils with period products when they need them."
        },
        {
            "text": "Since its launch in January 2020, 97% of secondary schools and 92% of post 16 organisations have ordered products using the scheme."
        },
        {
            "text": "We are also now providing environmentally friendly period pants and reusable period pads as part of the scheme too. "
        },
        {
            "text": "Here we provide information on the scheme and how your schools and colleges can get involved."
        },
        {
            "heading": 3,
            "text": "What is the Period Products Scheme?"
        },
        {
            "text": "The Period Products Scheme provides pupils with period products when they need them. "
        },
        {
            "text": "It provides access to tampons, pads and more through schools or colleges if, for example, pupils can’t afford period products, have forgotten to bring them to school or college or have come on their period unexpectedly."
        },
        {
            "text": "What are schools saying about the Period Products scheme? "
        },
        {
            "text": "We visited Gillas Lane Primary Academy in Sunderland for World Menstrual Hygiene Day and spoke to teacher, Emma Monaghan."
        },
        {
            "text": "Emma discussed how they have implemented the scheme successfully in their school. She mentioned how the scheme can eradicate any barriers to learning and make a real impact on outcomes for children."
        },
        {
            "heading": 3,
            "text": "Which environmentally friendly products are available at my child’s school? "
        },
        {
            "text": "There has been a surge in environmentally friendly and sustainable products being ordered. "
        },
        {
            "text": "The proportion of organisations ordering environmentally friendly or reusable products was higher in 2022 than in earlier years - in 2022, 44% of ordering organisations had bought environmentally friendly or reusable products, compared with 35% of organisations in both 2020 and 2021."
        },
        {
            "text": "All schools have the option to order period pants and reusable period pads, which are designed for long-term use and offer a sustainable alternative to other period products."
        },
        {
            "text": "All reusable products pants require additional care at home, including the need to wash them in a washing machine. The pupil or their parents will need to ensure they have clean products available for their period."
        },
        {
            "heading": 3,
            "text": "Who is eligible for the scheme?"
        },
        {
            "text": "All state-funded schools and 16-19 colleges in England are eligible to access the scheme, providing period products to girls, women, and non-binary and transgender learners who have periods. "
        },
        {
            "heading": 3,
            "text": "How does the scheme work?"
        },
        {
            "text": "To make sure organisations have access to a wide range of period products in the most cost-effective and efficient way, we have a national contract with Personnel Hygiene Services Limited (phs). This allows organisations to order period products and have them delivered when they need them."
        },
        {
            "text": "Schools and colleges then choose how the products are made available to pupils. Some have them in the welfare room, others in toilets. Some organise drop-in sessions where learners can go to collect products."
        },
        {
            "heading": 3,
            "text": "I don’t think my school/college offers this – what should I do?"
        },
        {
            "text": "Speak to your school or college and make sure they are aware of the scheme – if they are not, explain that they should look online at how to get involved."
        },
        {
            "heading": 3,
            "text": "How long does the scheme run for?"
        },
        {
            "text": "The scheme has been extended until at least 2024 as part of the Government’s drive to end period poverty and support disadvantaged pupils."
        },
        {
            "text": "More information on the Period Product scheme can be found here."
        }
    ]
}