{
    "url": "https://lifeathmrc.blog.gov.uk/2022/10/27/mentoring-and-me-celebrating-davids-silver-award-for-mentor-of-the-year/",
    "title": "Mentoring and me: celebrating David’s Silver Award for Mentor of the Year",
    "authors": [
        "fayemines"
    ],
    "categories": [
        "Culture & Values",
        "General",
        "Recruitment"
    ],
    "pub_date": "2022-10-27T12:49:19+00:00",
    "content": [
        {
            "text": "Today is National Mentoring Day, and we are very pleased to announce that our very own David Foster has been successful in achieving a Silver Award in the 'Mentor of the Year' category at the UK Social Mobility Awards 2022."
        },
        {
            "text": "David works for the Valuation Office Agency (VOA), which is an executive agency of HM Revenue and Customs (HMRC). He joined the VOA in February 2019 as a temporary Administrative Officer. David then successfully achieved a permanent position and moved to the Bangor office in Wales, before successfully gaining a promotion in January 2021."
        },
        {
            "text": "David is a Mentor on Stride, HMRC and VOA’s Social Mobility Mentoring Scheme. Since 2019, the scheme has helped over 1000 staff achieve their goals through one-to-one mentoring supported by a group development sessions and peer support. It also won the 2020 UK Social Mobility Awards for the category 'Progression Programme of the Year.'"
        },
        {
            "text": "David’s Mentees recognised the fantastic work he was doing as their Stride Mentor and nominated him for 'Mentor of the Year' at this year’s UK Social Mobility Awards which were held on 13th October 2022. We were thrilled to hear that David received the Silver Award, so we caught up with him to ask him a few questions about what it means to be a Stride Mentor and to help understand his views on social mobility and mentoring."
        },
        {
            "heading": 2,
            "text": "Why did you apply to be a Stride Mentor?"
        },
        {
            "text": "Having 30 plus years of experience of people, processes, and leadership prior to joining the VOA, I felt I could ‘put something back’ for all the development I’d received over the years. I’m from a lower social economic background but with strong family values of “work hard and the rewards are there”. I am secondary school educated. I held several positions whilst developing my career path which took me into the corporate banking sector, spanning 33 years, between two high profile banking organisations, having been headhunted from one to the other."
        },
        {
            "text": "I was based in Bangor when I first became a mentor and I have since moved to Wrexham office. The Stride cohorts are 6-month placements which can be extended with mutual approval of mentor/mentee. My mentees requested an extension to their mentoring time with me. I was happy to do this given how their confidence had grown and coincidentally both had applied for and been successful in gaining promotions."
        },
        {
            "heading": 2,
            "text": "How do you help your mentees progress?"
        },
        {
            "text": "I’ve led large teams of people in my past career and come across a lot of people who seem to think they never deserve a place at the ‘Top Table’, or they think they are being held back for reasons of where they come from, how they speak or the level of education they received etc."
        },
        {
            "text": "The first thing I always ask people who have doubts over becoming high achievers is this “do you really want that next job?” If they do, then I always go about getting them to believe in themselves before trying to convince others. Then I always like to review with them their previous two failed applications so we can understand why they didn’t get over the line. Then build on this and start to look at what they could have done differently if they were applying for that same role today. In my opinion, this is how you grow that confidence and belief in a person. Over the years I’ve always remembered the fact that someone once spotted potential in me, and I went on to have a fantastic career. I am truly enjoying my years in the VOA because of that."
        },
        {
            "heading": 2,
            "text": "How did you feel after winning the Silver Award?"
        },
        {
            "text": "I was originally blown away just by the nomination from the mentees but also following the shortlisting in the SOMO 2022 awards for Mentor of The Year. I felt immensely proud to have been recognised for my mentoring on the night and for the recognition the STRIDE Programme received at the awards ceremony."
        },
        {
            "heading": 2,
            "text": "Come work for us!"
        },
        {
            "text": "At HMRC, we’re committed to creating a great place to work for all our colleagues. We want everyone to feel valued, supported, and comfortable being their true self at work."
        },
        {
            "text": "We’re proud to be a diverse and inclusive employer, supporting social mobility by giving opportunities to people no matter what their background is. We want to maximise the potential of everyone who chooses to work for us and offer a range of flexible working patterns and support."
        },
        {
            "text": "We have a wide range of roles available, with vacancies being added to Civil Service Jobs each week. Look at our current vacancies and apply now!"
        }
    ]
}