{
    "url": "https://thebluebeltprogramme.blog.gov.uk/voyage-of-discovery-9000-mile-expedition-to-ascension-island-and-st-helena-finally-sets-sail-third-time-lucky/",
    "title": "Voyage of Discovery: 9,000-mile expedition to Ascension Island and St Helena finally sets sail",
    "authors": [
        "Dr Paul Whomersley"
    ],
    "categories": [
        "Blue Belt Programme",
        "Science",
        "UK Overseas Territories"
    ],
    "pub_date": "2022-10-27T06:15:32+01:00",
    "content": [
        {
            "text": "With planning fully underway in 2020 and the crew ready to set sail in November 2021, a global pandemic stopped us in our tracks. Now we’re ready to go again!"
        },
        {
            "text": "Last year Cefas scientists and key partners were prepared to embark on a 9,000 mile journey to explore the remote waters around the Overseas Territories of Ascension Island and St Helena. Supported by the UK Government’s Blue Belt Programme, our mission was to:"
        },
        {
            "text": "The RRS Discovery, a purpose build research vessel measuring 100m long and weighing 6000 tonnes, was to be our home for the next 6 weeks. Named after the original Discovery which in 1901 carried Robert Falcon Scott and Ernest Shackleton on their highly successful voyage to the Antarctic, our modern-day Discovery is fitted with the most up-to-date equipment and perfectly designed for underwater exploration. With our underwater cameras packed and our luggage stowed away, we were ready to roll."
        },
        {
            "text": "Then an outbreak of COVID-19 struck."
        },
        {
            "text": "Despite the many precautions we had put in place, several of our crew became infected. It was decided that the risk of sailing with COVID-19 onboard posed too great a risk for the ship’s crew and to the populations of Ascension Island and St Helena. Disappointed, it was back to dry land and back to the drawing board."
        },
        {
            "heading": 3,
            "text": "RRS Discovery ready to set sail (again!)"
        },
        {
            "text": "It’s 2022 and after months of pre-planning, we are excited to say that the RRS Discovery will finally depart from Southampton on the 27th October."
        },
        {
            "text": "There will be 27 scientists onboard from several different agencies and academic institutes, such as the Centre for Environment, Fisheries and Aquaculture Science, British Antarctic Territory, Marine Management Organisation, Natural History Museum, Agri-food and Biosciences Institutes, as well as PhD students from Plymouth University and the University of Western Australia.  It seems that even 12 days isolating in a ships cabin has not deterred any of the original scientific crew from joining."
        },
        {
            "text": "A small contingent of the scientific party will be sailing from Southampton, with the rest joining in Cape Verde before we continue our journey south to Ascension Island and St Helena. Once the scientific work is completed, the crew will transit across the Atlantic Ocean to Uruguay where our expedition ends."
        },
        {
            "text": "The expedition would not be possible without the support of the RRS Discovery crew, NERC and technical and engineering staff from National Marine Facilities."
        },
        {
            "heading": 3,
            "text": "Understanding the ocean"
        },
        {
            "text": "So why travel 9,000 kilometres from the UK to some of the remotest islands on the planet?"
        },
        {
            "text": "Ascension Island and St Helena are home to large Marine Protected Areas (MPAs) and zones, yet much of the ocean and seabed around these Islands remain unexplored and data-poor. Our scientific surveys, which include the mapping of hydrothermal vents and deep-water seabed systems, will gather important data to increase our understanding of how these important ecosystems function. This data will then directly support the Governments of Ascension and St Helena in their work to protect and manage these MPAs."
        },
        {
            "text": "Filling these evidence gaps is also important in a global context. The data collected and findings from this survey will help to collect baseline environmental data from these remote locations, which will help the UK Overseas Territories to better understand and mitigate against the impacts of global ocean threats, such as climate change."
        },
        {
            "text": "Choosing the right equipment"
        },
        {
            "text": "Much of the equipment is specifically designed to help us meet the scientific objectives of this expedition. For example, to collect data from the vast surface waters , my favourite piece of equipment is our Baited Underwater Remote Video Systems (BRUVS) which will be deployed to assess the presence and abundances of large species such as sharks and tuna."
        },
        {
            "text": "Other specialist equipment will allow us to:"
        },
        {
            "text": "An exciting addition to this survey is an Uncrewed Surface Vehicle or a USV (we scientists love an abbreviation) developed by AutoNaut, our vessel is called Jura. This vehicle can be deployed on data-collection missions and operated remotely from either land or the ship. If used successfully, we hope that in the future these vehicles can be deployed and used  in the Overseas Territories to collect new sets of data from the vast network of MPAs."
        },
        {
            "text": "Sharing lessons learnt"
        },
        {
            "text": "As we collect our data, it’s important to share and exchange relevant knowledge and experiences. Colleagues from both the Governments of Ascension Island and St Helena will be joining Discovery for parts of the expedition and given training on the use of various scientific survey equipment and survey methodologies. This knowledge exchange will help us collectively to further our understanding of the marine systems and to build capacity on island for future management, monitoring and research activities."
        },
        {
            "text": "Once the data and specimens have been collected, experts in Ascension, St Helena and the UK will analyse and write up the key findings, with a report expected in 2023.  On return to the UK, the physical specimens collected will be housed in the Natural History Museum and will be available for further scientific research."
        },
        {
            "text": "Join us on board"
        },
        {
            "text": "We want take you on a voyage of a life time! This year we have a professional videographer to capture life onboard and document all of our amazing discoveries. This will culminate in the creation of a documentary, to be released in 2023."
        },
        {
            "text": "Follow us on the Blue Belt Programme blog, via our social media channels at #DY159 (Twitter, Facebook, and Instagram) and our newsletter for the latest news, updates and images."
        }
    ]
}