{
    "url": "https://movingon.blog.gov.uk/2022/12/07/buying-part-worn-tyres-what-operators-need-to-know/",
    "title": "Buying part worn tyres – what operators need to know",
    "authors": [
        "Christopher Lowe"
    ],
    "categories": [
        "Enforcement",
        "Features",
        "Guides and reports"
    ],
    "pub_date": "2022-12-07T10:37:26+00:00",
    "content": [
        {
            "text": "Knowing about and understanding tyre condition is very important. It’s even more important when it comes to issues surrounding part-worn tyres. "
        },
        {
            "heading": 2,
            "text": "What are part-worn tyres? "
        },
        {
            "text": "Part-worn tyres are in use every day. If you buy a second-hand vehicle and do not replace the tyres with a new set immediately you are, in effect, buying part-worn tyres.  "
        },
        {
            "text": "But some tyres are sold as part-worn without the second-hand vehicle! It is not illegal to sell and fit these part-worn tyres. "
        },
        {
            "text": "The Tyre Industry Federation estimates around 5 million, or 10% of all tyres purchased in the UK are in the part-worn category.  "
        },
        {
            "text": "New tyres are manufactured to a very high standard and are designed to be safe down to the legal tread limit.  "
        },
        {
            "text": "Tyres removed from vehicles and re-sold with minimal tread wear are not immediately unsafe. However, there could be serious risks if there is an underlying issue with a second-hand tyre someone has bought. "
        },
        {
            "text": "If you buy part-worn tyres, you should expect that they have been properly inspected and tested before sale.  "
        },
        {
            "heading": 2,
            "text": "The role of the Market Surveillance Unit (MSU) and part-worn tyres "
        },
        {
            "text": "The MSU monitors vehicles, products and components in the UK automotive sector to monitor compliance with the relevant regulations including environmental and safety standards. "
        },
        {
            "heading": 2,
            "text": "What to look out for when buying part-worn tyres "
        },
        {
            "text": "Look out for the general condition of any part-worn tyres you are thinking of buying. You should check: "
        },
        {
            "text": "All part-worn tyres which have not been re-treaded must clearly show the relevant ‘E’ mark, with “PART-WORN” in uppercase letters at least 4mm high permanently and legibly applied to the tyre.  "
        },
        {
            "heading": 2,
            "text": "Joint work with Trading Standards and Environmental Health "
        },
        {
            "text": "DVSA carries out joint operations with Trading Standards in GB and the Environmental Health Service in Northern Ireland. These focused on the supply of tyres at point of sale.  "
        },
        {
            "text": "MSU also investigates the sale of part-worn tyres purchased from online retailers. "
        },
        {
            "heading": 2,
            "text": "What have we found? "
        },
        {
            "text": "All the part-worn tyres bought during our investigations have complied with the minimum tread depth requirement with 96% having a tread depth exceeding 4mm.  "
        },
        {
            "text": "However, 85% were not correctly marked and were therefore non-compliant. "
        },
        {
            "text": "Also, 11% of tyres bought during the exercises were more than 10 years old. "
        },
        {
            "text": "Issues we have found include:  "
        },
        {
            "text": "If we continue to be able to buy unsafe tyres or there are continued breaches of the marking regulations, we will investigation thoroughly and take action against the businesses concerned. "
        },
        {
            "text": "We want to reassure operators that we are monitoring the sale of part worn tyres to help keep vehicles on our roads safe and compliant.  "
        },
        {
            "text": "Tyres bought should meet the legal requirements and MSU will continue to monitor suppliers to ensure they meet rules and regulations.  "
        },
        {
            "heading": 2,
            "text": "Reporting illegal part-worn tyre sales "
        },
        {
            "text": "If you believe a manufacturer or supplier is illegally supplying part-worn tyres you should contact your local Trading Standards office. "
        }
    ]
}