{
    "url": "https://educationinspection.blog.gov.uk/2022/12/07/inspecting-the-initial-stages-of-the-early-career-framework-and-national-professional-qualifications/",
    "title": "Inspecting the initial stages of the early career framework and national professional qualifications",
    "authors": [
        "Helen Matthews, Senior HMI for Teacher Development"
    ],
    "categories": [
        "professional development",
        "teacher training",
        "teachers"
    ],
    "pub_date": "2022-12-07T09:40:52+00:00",
    "content": [
        {
            "text": "Recruiting, training and retaining high-quality teachers and leaders is fundamentally important. It forms the foundation for giving pupils the very best experience in education."
        },
        {
            "text": "In March, we published our new framework for inspecting lead providers of the early career framework (ECF) and national professional qualifications (NPQs). These programmes complete the ‘golden thread’ of professional development for teachers. This golden thread is made up of: high-quality initial teacher education (ITE), support for early career teachers through the ECF, and professional development qualifications (NPQs) for experienced teachers and leaders."
        },
        {
            "text": "The ECF is designed to help early career teachers develop their practice, knowledge and working habits. NPQs enable teachers to develop their expertise in specialist areas of teaching or leadership."
        },
        {
            "text": "Under this framework, we inspect the lead providers who are delivering the ECF and NPQ programmes. We evaluate the lead providers’ curriculum design, and how well they ensure the effective delivery of the programmes."
        },
        {
            "text": "Lead provider monitoring visits (LPMVs)"
        },
        {
            "text": "In the first year of delivery of these programmes, lead providers receive a monitoring visit known as an LPMV. During the summer term, all 10 lead providers had a LPMV. The visits check how well the lead providers are implementing the programmes. The 10 LPMV letters are on our reports website."
        },
        {
            "text": "We were encouraged to find that almost all the lead providers were taking effective action to establish and deliver high-quality training programmes."
        },
        {
            "text": "We saw some common features of good practice:"
        },
        {
            "text": "Most ECTs and NPQ participants we spoke to were positive about the training. They believe that it is delivered effectively and builds on what they already know. NPQ participants found that what they were learning was highly applicable to their role and was helping them improve their practice. Some ECTs said they would like further examples of how what they were learning related to their own subject or phase. We were encouraged to see that most lead providers had noted this and were responding."
        },
        {
            "text": "Some school leaders had concerns about the workload of the ECF programme for ECTs and school mentors. Our inspections did find that workload pressures affected the quality of mentoring. Mentors need to have the curriculum expertise and experience and be given appropriate time to provide effective support. This will help ECTs become confident and competent to teach their chosen subjects and phases."
        },
        {
            "text": "Some lead providers could have given more support to mentors. This would enable mentors to use their knowledge and experience to contextualise what ECTs are learning. This would help those new to teaching make the link between theory and what they find in their schools."
        },
        {
            "text": "Preparing for full inspections "
        },
        {
            "text": "During the summer term, we ran a series of evaluation events with lead providers and inspectors. The events reflected on the LPMVs and considered any aspects of the inspection process we needed to change or improve. For example, we have now streamlined the information we require before inspection. This will help to reduce the burden on the lead provider."
        },
        {
            "text": "Following this, we conducted 2 full inspection pilots, one for ECF and one for NPQ, in the autumn term. We wanted to test some revisions we have made to make sure the inspection process works well for everyone involved. Both inspectors and lead providers were positive about our updated approach."
        },
        {
            "text": "Changes we are making ahead of full inspections"
        },
        {
            "text": "As a result of this testing and engagement, we have made some updates to our inspection handbook. We have refined the outstanding criteria to draw a greater distinction between good and outstanding. For instance, we have made it clear that outstanding providers must demonstrate meticulous curriculum planning."
        },
        {
            "text": "We have also added further clarification to the notification letter to lead providers. The letter explains how to share information about the inspection with stakeholders. This includes how to distribute our 4, survey links. The views we gather through the surveys provide valuable insights, and we received a high number of responses during the LPMVs. The responses help inspectors to form an accurate picture of the quality of the ECF and NPQ programmes."
        },
        {
            "text": "Looking ahead to full inspections "
        },
        {
            "text": "We will begin full inspections of the lead providers delivering ECF and NPQ programmes from the spring term 2023."
        },
        {
            "text": "To help with preparation for this, we will be holding webinars during December. These will be for delivery partners, trainers and facilitators, mentors and programme participants. We would like to encourage school leaders to join one of the webinars. You can get in touch with your delivery partner or lead provider for details of how to attend these events."
        }
    ]
}