{
    "url": "https://ruralpayments.blog.gov.uk/2022/12/07/new-partnership-based-approach-to-rpa-site-visits-and-mapping-improvements-round-up/",
    "title": "New partnership-based approach to RPA site visits and mapping improvements: Round-up",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2022-12-07T13:07:03+00:00",
    "content": [
        {
            "text": "During November we have published a series of blogs focussing on the RPA’s new partnership-based approach to site visits and the improvements made to RPA’s geospatial mapping process. You can find below a summary of the content with links to each of the blogs."
        },
        {
            "text": "Mapping"
        },
        {
            "text": "In this blog we talk about how RPA uses digital maps to record physical land parcel boundaries and features, so accurate payments can be made to farmers. We hear how RPA will explore digital options that can be accessed online, whilst ensuring we maintain accessibility for all."
        },
        {
            "text": "It also highlights how you can help us by making sure all the required fields are completed within the RLE1 form, making clear and accurate annotations on any maps, responding promptly to RPA requests for further information and following the guidance when emailing RLE1 forms. You can read more about the role of the Operational Mapping team in David’s blog."
        },
        {
            "text": "Site visits"
        },
        {
            "text": "In this blog, we talk about how RPA has introduced a more supportive, partnership-based approach to inspections, moving away from the penalty-based system under the EU, to farmer-focused visits for schemes such as the Sustainable Farming Incentive and Countryside Stewardship."
        },
        {
            "text": "To reflect this change, inspections are now referred to as visits, a broad term covering inspection, monitoring and environmental outcome visits. Inspectors are now referred to as Field Officers and the Inspectorate is known as the Regulatory and Advice Service."
        },
        {
            "text": "The RPA Field Officer’s role is to visit farm premises to ensure farmers and claimants are complying with UK and legacy EU legislation, scheme rules, and agreement options. You can read blogs from Field Officers Jackie, Nathalie and Ben."
        },
        {
            "text": "Our Field Officers are a source of advice and guidance on holdings as well as remotely, supporting farmers, livestock and landowners with their applications and compliance. Going forward, our advice and guidance activity will increase as we work with farmers and land managers to help them secure the outcomes of their agreements, prior to checking compliance with scheme controls. In this blog, you can find some ‘top tips’ on how to prepare for a visit."
        },
        {
            "text": "Farmers and rural communities are at the heart of what we do, as we strive to provide excellent delivery and outcomes that are in the public interest. We’ll continue to support farmers and land managers through the agricultural transition, seeking to place profitable and sustainable farming and food production at the forefront of environmental good practice. We share your passion for high quality food production and a flourishing environment and will continue to seek ways to help you meet scheme obligations in a way that reflects your commitment and our duties in managing public funds."
        },
        {
            "text": " "
        }
    ]
}