{
    "url": "https://educationhub.blog.gov.uk/2022/12/strep-a-and-scarlet-fever-what-are-they-and-what-are-the-symptoms-information-for-parents-schools-colleges-and-early-years-providers/",
    "title": "Strep A and scarlet fever – what are they and what are the symptoms? Information for parents, schools, colleges and early years providers",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools",
        "Strep A"
    ],
    "pub_date": "2022-12-07T11:55:39+00:00",
    "content": [
        {
            "text": "We are seeing an increased number of cases of Group A streptococcus (Strep A) compared to normal at this time of year. There is no evidence that a new strain is circulating and the increase is most likely related to high amounts of circulating bacteria and social mixing."
        },
        {
            "text": "If you suspect your child may have Strep A they should not attend school and you should contact your doctor (or 999 in an emergency). If there are confirmed or suspected cases in an education setting there is no reason for children to be kept at home if they are well."
        },
        {
            "text": "There are some circumstances where a school or provider may need to contact their local UK Health Security Agency (UKHSA) healthcare protection teams (HPTs) for advice. HPTs will provide advice on what steps to take on a case-by-case basis depending on specific circumstances."
        },
        {
            "text": "Further information for staff on how and when to do this can be found here: Managing outbreaks and incidents - GOV.UK (www.gov.uk)."
        },
        {
            "text": "As a precaution, here we provide information for schools and early years providers and parents on the signs and symptoms of Strep A infections and what to do if you think a child has developed these."
        },
        {
            "heading": 3,
            "text": "What are scarlet fever and Strep A?"
        },
        {
            "text": "Scarlet fever is caused by bacteria called Group A streptococci (Strep A). The bacteria usually cause a mild infection that can be easily treated with antibiotics."
        },
        {
            "text": "In very rare occasions, the bacteria can get into the bloodstream and cause an illness called invasive Group A strep (iGAS)."
        },
        {
            "heading": 3,
            "text": "How can I prevent Strep A?"
        },
        {
            "text": "Good hand and respiratory hygiene are important for stopping the spread of many bugs."
        },
        {
            "text": "By teaching children how to wash their hands properly with soap for 20 seconds, using a tissue to catch coughs and sneezes, and keeping away from others when feeling unwell, they will be able to reduce the risk of picking up or spreading infections."
        },
        {
            "heading": 3,
            "text": "What are the symptoms of Strep A/scarlet fever?"
        },
        {
            "text": "Symptoms can include a sore throat, headache, and fever, along with a fine, pinkish or red body rash with a sandpapery feel. On darker skin, the rash can be more difficult to detect visually but will have a sandpapery feel."
        },
        {
            "heading": 3,
            "text": "My child is unwell and may have scarlet fever – what should I do?"
        },
        {
            "text": "If your child becomes unwell with these symptoms, you should contact your GP practice or contact NHS 111 (which operates a 24/7 service) to seek advice."
        },
        {
            "text": "It is important to contact NHS 111 or your GP if you suspect your child has scarlet fever, because early treatment of scarlet fever with antibiotics is important to reduce the risk of complications such as pneumonia or a bloodstream infection."
        },
        {
            "text": "You must tell NHS 111 or your GP if you or your child have been in contact with someone who has had Strep A recently."
        },
        {
            "text": "If your child has scarlet fever, keep them at home until at least 24 hours after the start of antibiotic treatment to avoid spreading the infection to others."
        },
        {
            "heading": 3,
            "text": "As a parent, if you feel that your child seems seriously unwell, you should trust your own judgement. Contact NHS 111 or your GP if:"
        },
        {
            "heading": 3,
            "text": "Call 999 or go to A&E if:"
        },
        {
            "heading": 3,
            "text": "Where can I get the latest information?"
        },
        {
            "text": "The most accurate and up-to-date information can be found on the UKHSA website: UKHSA update on scarlet fever and invasive Group A strep - GOV.UK (www.gov.uk)."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}