{
    "url": "https://environmentagency.blog.gov.uk/2022/12/07/weevils-to-the-rescue-how-a-beetle-could-help-win-the-fight-against-invasive-plants/",
    "title": "Weevils to the rescue! How a beetle could help win the fight against invasive plants",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-12-07T10:15:14+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Trevor Renals is the senior technical advisor on invasive species for the Environment Agency. He started his career working on Japanese knotweed management in his native Cornwall, which led to an interest in biological control solutions, using co-evolved natural enemies of invasive species to manage biological invasions instead of widespread herbicide applications. He has over 30 years’ experience of invasive species management, both in the UK and its Overseas Territories. Here, he explores how the Environment Agency is using tiny beetles called weevils to manage a huge pest – floating pennywort."
        },
        {
            "text": "Ever heard of the Water Fern, Azolla filiculoides?"
        },
        {
            "text": "Probably not, and there’s one good reason why that might be; a tiny weevil called Stenopelmus rufinasus."
        },
        {
            "text": "Water fern has the potential to form dense mats of floating weed over lakes, canals, ditches and slow-flowing watercourses. It can profoundly alter the ecology of waterbodies, degrade amenity and aesthetic value, and potentially increase flood risk. The mats consist of millions of tiny floating ferns, which are hard to remove and can deplete oxygen levels in the water when treated with chemicals. Thankfully, a tiny weevil does the job for us and does it brilliantly, saving us an estimated £8.4-16.9 million per annum. Water fern is a headache we never had, thanks to biological control."
        },
        {
            "text": "Water fern is one of many exotic plants that we have introduced to our ponds and subsequently, to our wider environment. Sadly, many of these invasive species don’t have a convenient solution and cause huge environmental and socio-economic harm. Few people realise the damage that comes from allowing the exotic plants and animals from your pond or aquaria into the wild. These organisms have been removed from their native range and the natural enemies that control their growth and abundance. They have an unfair advantage over our native species. Biological control seeks to reassert that natural pressure."
        },
        {
            "text": "Biological invasions are one of the ‘big five’ causes of biodiversity loss (along with land use change, over-exploitation, climate change and pollution) and cost the GB economy at least £1.7 billion per annum (Defra, 2010). Preventing biological invasions through robust biosecurity is our best option, but where that fails, nature-based options such as biological control have the potential to provide safe and sustainable controls."
        },
        {
            "text": "Which is where we find ourselves now. Because the green carpet of Azolla has already been replaced by another carpet-forming invasive aquatic plant – Floating Pennywort (Hydrocotyle ranunculoides)."
        },
        {
            "text": "It’s an ornamental aquatic plant imported from South America in the 1990s for ponds and aquaria but now it has escaped from garden ponds and spread to approximately 500 water bodies."
        },
        {
            "text": "The dense floating rafts of weed can grow up to 20cm a day and become over a metre thick. It chokes channels, degrades ecological quality and amenity use, and potentially increases flood risk."
        },
        {
            "text": "Floating pennywort costs the GB economy at least £25 million per annum. Despite current management efforts the problem continues to spread. The Environment Agency has spent up to £600,000 per annum in recent years to protect selected high value assets, removing over 1,000 tonnes of pennywort in 2017."
        },
        {
            "text": "Currently, it is most invasive in the southern parts of the UK, and as I’ve already touched on, it’s a problem for nature, putting our native ecology at risk."
        },
        {
            "text": "But it’s also a problem intrinsically linked with climate change. As our climate warms and we have increasing frequencies of frost-free winters, the large rafts of floating pennywort will cease dying back overwinter and start the new growth season in rude health. The combination of mild winter weather, increased nutrient loads due to drought conditions and low summer flow rates will create a perfect storm of conditions that will encourage floating pennywort to extend its range further north and cover our waterbodies in dense rafts of vegetation. Current management efforts are expensive and time-consuming, and they are already failing to keep pace with the spread of floating pennywort."
        },
        {
            "text": "But once again – it could be a weevil to the rescue."
        },
        {
            "text": "Defra has funded research into to the floating pennywort invasion and, once again, it looks like it’s a weevil that could be the sustainable solution. Researchers at CABI, a global, not-for-profit organisation keen to find natural solutions to the biological threats that endanger our environment, food security and economy, have investigated a weevil that attacks floating pennywort in its native range; Listronotus elongatus."
        },
        {
            "text": "CABI and their South American collaborators have spent the last ten years finding a natural enemy specific to floating pennywort and ensuring that it is safe to release into our environment. The weevil spends its entire life cycle on floating pennywort – the adults graze the pennywort leaves, but the real damage is done by the larvae, that bore through the stems and collapse the dense rafts."
        },
        {
            "text": "The process of approving a new biological control release is strict, very demanding, and rightly so. No one wants another damaging invasive species in our environment. The pennywort weevil has met the strict safety criteria and has been released at a few select sites in England. Early results are very encouraging. The pennywort weevil is already beginning to impact floating pennywort and we hope that this might be one invasive plant that will not exacerbate the future pressures on our rivers and canals."
        },
        {
            "text": "The battle against invasive species is an ongoing one – and an important one in our fight to tackle the climate and nature crises. The Environment Agency and partners are working hard to improve the environment, fight natural decline, and support nature recovery. And embracing natural solutions – for everything from flood defence, to habitat management, to pest control – is a key strategy. So for now, it’s weevils to the rescue as they continue to play a vital role in helping us protect the ecology of our precious British rivers."
        }
    ]
}