{
    "url": "https://history.blog.gov.uk/2022/12/07/what-the-butler-saw-britain-and-the-abadan-crisis-1950-51/",
    "title": "What the Butler saw: Britain and the Abadan Crisis, 1950-51",
    "authors": [
        "Dr Richard Smith"
    ],
    "categories": [
        "FCDO Historians",
        "Foreign affairs and diplomacy",
        "What's the context? series"
    ],
    "pub_date": "2022-12-07T11:41:49+00:00",
    "content": [
        {
            "text": "In March 1962 a secret report landed on the desks of senior officials in the Foreign Office. Written by Foreign Office Historian Rohan Butler it was a forensic and critical account of the loss in 1951 of Britain’s single biggest overseas asset: the Anglo-Iranian Oil Company’s refinery at Abadan."
        },
        {
            "text": "The episode was not only a huge commercial loss and a humiliating blow to British prestige but also exposed weaknesses both in Middle Eastern policy and in crisis management. Butler identified a range of factors responsible for the debacle including a weakened Labour government and complacent thinking by company and government officials. He also highlighted an inability to project military power following the loss of India, and a lack of support, as well as adverse interference, from the United States government."
        },
        {
            "text": "Butler expressed disappointment that, due the confidential nature of the topic, his work would never see the light of day and be published. After 60 years, this has been remedied. A new publication by the Foreign, Commonwealth & Development Office (FCDO) Historians reproduces the full report along with associated documents and contextual essays by contemporary historians."
        },
        {
            "text": "This prompted discussion as to whether British diplomacy needed ‘a new look’ in the post-imperial age, one based more on national self-interest, like that of the French. Sir Harold Caccia, Permanent Under-Secretary at the Foreign Office, posed this question to British ambassadors in February 1963. Coming just after the rejection of Britain’s first application to join the European Economic Community (EEC), it prompted plenty of response."
        },
        {
            "text": "Butler was asked to analyse and synthesise the replies, which he completed in May 1963 as ‘A New Perspective for British Diplomacy.’ He made several recommendations: increased public relations at home in mobilising support for British foreign policy, ‘sharper thinking and plainer speaking’ in its execution; the strengthening and modernisation of representation abroad. He also suggested establishing a high-level ‘Positive Planning Committee’ to review possibilities for imparting ‘extra thrust’ into diplomatic effort. This latter recommendation was to lead to the formation of the Foreign Office Planning Staff (today the FCDO Strategy Unit). This fulfilled Butler’s wish that his study might make a ‘small but constructive’ contribution towards strengthening British foreign policy ‘for the great tasks and great opportunities’ which lay ahead."
        },
        {
            "text": "Even today the report’s penetrating analysis and recommendations for improved policy implementation remain relevant. In the words of former FCO chief historian Gill Bennett, it stands as ‘a singular testament to the potential influence, on both policy and administration, of an historical case study’."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Britain and the Abadan Crisis, 1950-51, is freely available online, and you can buy a printed copy."
        }
    ]
}