{
    "url": "https://traderemedies.blog.gov.uk/2024/10/25/being-there-how-we-conduct-verification-visits/",
    "title": "Being there: How we conduct verification visits ",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Analysis",
        "Engagement",
        "Investigations"
    ],
    "pub_date": "2024-10-25T15:02:46+01:00",
    "content": [
        {
            "text": "The Trade Remedies Authority was established as a non-department public body of the Department for Business and Trade in 2021 and therefore well-placed to quickly design processes and procedures that were “pandemic proof”. These included the use of remote verification.As the world reverts to a post-pandemic normal, it is a good time to consider the importance of in-person verification visits."
        },
        {
            "text": "The following blog outlines some of the challenges encountered during the pandemic period and introduces the reader to some background about verification, what an in-person verification visit entails, and some comparisons between the features of in-person and remote visits."
        },
        {
            "heading": 3,
            "text": "Why we verify information"
        },
        {
            "text": "When conducting an investigation into alleged dumping, subsidy, or any other injurious action, it is a fundamental part of the Trade Remedies Authority’s (TRA) case work to verify information and data we receive from a host of interested parties.    "
        },
        {
            "text": "Find out more about the verification process:  "
        },
        {
            "heading": 3,
            "text": "What is a verification visit?"
        },
        {
            "text": "The World Trade Organisation’s Anti-Dumping Agreement specifies provisions regarding \"on-the-spot investigations\" (in-person visits) to interested parties that have submitted information to the investigating authority.  "
        },
        {
            "text": "The advantage of an in-person verification visit is that it enables verification procedures to be performed to consider the accuracy of data provided in questionnaire responses and other submissions against primary data sources, mainly the firm's internal accounting records.   "
        },
        {
            "text": "At the TRA, an in-person verification visit varies depending on the size of the interested party in question, as well as the complexity of a case or industry, but in line with WTO expectations, they typically last 2-3 days and involve 2-4 “case handlers” (TRA staff attending an interested party’s premises). These case handlers form part of the TRA’s extended verification team and include personnel with experience in audit and assurance and/or the industry in question, as well as knowledge of the investigation as a whole. The combination of people with case familiarity and expert verification knowledge and experience means that visits are efficient and well-planned.  "
        },
        {
            "text": "Overseas visits mean that case handlers will be operating in an unknown environment, often working with documents in a foreign language.  As such, planning is critical to ensure language barriers can be overcome and that the right people are in the room at the right time.  "
        },
        {
            "text": "The most critical aspect of any visit is to ensure that verification procedures focus on the elements and issues that will have the greatest impact on the dumping margin calculation (or any other assessment or calculation needed to progress a case and be used to determine recommended tariff rates or other trade policy responses).   "
        },
        {
            "heading": 3,
            "text": "Remote verification: what works and what doesn’t"
        },
        {
            "text": "Verification visits were handled differently during the COVID-19 pandemic, and technological advancements in areas such as video calls meant that procedures could be performed remotely.  "
        },
        {
            "text": "Using a remote means of verification is challenging as it cannot replicate the access to evidence, explanations and systems, nor the ability to observe and scrutinise, afforded during an in-person visit. These challenges are exacerbated when remote visits take place across borders, often limiting the amount of time a remote call can reasonably last (due to time differences) and intensifying language barriers in a setting devoid of micro gestures and similar non-verbal cues.  "
        },
        {
            "text": "To counter these difficulties, remote verification typically requires a larger number of calls, each lasting only a short amount of time in comparison to an in-person alternative (e.g., 2-3 hours over many days, compared with 7-8 hours for 2-3 consecutive days). The shorter calls need to be designed with efficiency in mind and should focus on a narrower range of queries to ensure they are not attended by an unnecessarily large audience and do not begin or end during overly unsocial working hours.  "
        },
        {
            "text": "The pandemic did expedite the use of file sharing systems and enabled more frequent contact via video call during the planning stages of verification. These technologies enabled higher quality contact before verification proper and proved helpful to us as we were better able to perform risk assessments and other planning considerations. It also proved helpful for interested parties, as we were able to explain to them what was coming next, share presentations and other infographics and introduce them to key verification terms and procedures, as well as how we would conduct our work. These video sessions replaced what typically would have been performed via telephone or email and were richer as a result.  "
        },
        {
            "heading": 3,
            "text": "A topical issue "
        },
        {
            "text": "The way that verification is performed is a very topical issue, and something the WTO member community has recently discussed as part of their lessons learned from the pandemic during April 2024 Rules Week. For us at the TRA, it means navigating a normal environment for the first time (as our early experiences of verification coincided with the beginning of the pandemic). As such, now is an ideal time to reflect on the need to access explanations, personnel and systems, alongside the convenience of recent technological advancements including the likes of Microsoft Teams.  "
        },
        {
            "heading": 3,
            "text": "Case Study: China "
        },
        {
            "text": "As part of our investigation into bus and lorry tyres from China, we visited China between 23 January - 4 February 2024 for in-person verification. This visit meant we avoided the need for many short remote discussions with the interested parties and we were also able to see production facilities in-person, which enabled us to contextualise the financial and other business information submitted.  "
        },
        {
            "text": "As our very first visit beyond Europe for verification, the trip put a spotlight on some of the practical issues that need to be overcome by rigorous pre-planning. For example, a flight between the UK and China takes between 12–14 hours across several time zones, which requires adjustment at the other end of the journey: the effects on the human body should not be underestimated!"
        },
        {
            "text": " Visa applications and ensuring availability of interpreters are fundamentally important. Our first experience of this means that we are much better placed for the future. We also encountered some expected differences in culture and everyday life that highlighted the importance of doing your research ahead of an overseas trip – thankfully, we came equipped with Alipay apps to overcome the fact that paying for everyday items is not typically settled via cash or card in China.  "
        }
    ]
}