{
    "url": "https://deframedia.blog.gov.uk/2024/10/25/coverage-following-government-crackdown-on-single-use-vapes/",
    "title": "Coverage following Government crackdown on single-use vapes",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2024-10-25T11:44:39+01:00",
    "content": [
        {
            "text": "There has been widespread positive media coverage following the laying in Parliament of new legislation to ban the sale of single-use vapes from 1 June 2025."
        },
        {
            "text": "Publications including the Sun, Daily Mirror, BBC, Sky News, New York Times, ITV News, Joe and LADBible amongst others covered the announcement, which delivers on the Government’s commitment to act on this important issue, kick-starting the push towards a circular economy and helping to curb the rise of young people taking up vaping, while also protecting our natural environment and town streets from a tide of litter.   "
        },
        {
            "text": "Single-use vapes are not rechargeable or refillable and are typically discarded as general waste in a bin or littered, rather than recycled – contributing to a flood of litter on our streets."
        },
        {
            "text": "Even when they are sent to recycling facilities, they usually must be disassembled by hand – a slow and difficult process which will struggle to keep up with the pace of vape production. Their lithium-ion batteries can also present a fire risk to waste industry workers. "
        },
        {
            "text": "Circular Economy Minister Mary Creagh said:"
        },
        {
            "text": "“Single-use vapes are extremely wasteful and blight our towns and cities. "
        },
        {
            "text": "“That is why we are banning single use vapes as we end this nation’s throwaway culture."
        },
        {
            "text": "“This is the first step on the road to a circular economy, where we use resources for longer, reduce waste, accelerate the path to net-zero and create thousands of jobs across the country.”"
        },
        {
            "text": "Minister for Public Health and Prevention, Andrew Gwynne, said:"
        },
        {
            "text": "“It’s deeply worrying that a quarter of 11-15-year-olds used a vape last year and we know disposables are the product of choice for the majority of kids vaping today."
        },
        {
            "text": "“Banning disposable vapes will not only protect the environment, but importantly reduce the appeal of vapes to children and keep them out of the hands of vulnerable young people."
        },
        {
            "text": "“The government will also introduce the Tobacco and Vapes Bill – the biggest public health intervention in a generation – which will protect young people from becoming hooked on nicotine and pave the way for a smoke-free UK.”"
        }
    ]
}