{
    "url": "https://prisonjobs.blog.gov.uk/2024/10/25/michaels-journey-from-osg-to-account-manager-in-the-prison-service-part-one/",
    "title": "Michael's Journey: From OSG to Account Manager in the Prison Service (Part one)",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "OSG",
        "Personal stories"
    ],
    "pub_date": "2024-10-25T17:38:44+01:00",
    "content": [
        {
            "text": "Michael has been with the Prison Service for 21 years, beginning as an operational support grade (OSG) at HMP Rochester. He progressed through various roles, including prison officer, supervising officer, and custodial manager, before moving to HMPPS headquarters as an account manager for the Prison Performance Support Programme. Michael now helps drive improvements across some of the most challenging prison sites."
        },
        {
            "text": "How did you become an OSG in the Prison Service? "
        },
        {
            "text": "I left school halfway through my A-Levels and got a job in retail. If you want to be put off retail, work at Toys-R-Us during Christmas! I didn’t want to do that anymore, and my dad, who used to work in the Prison Service, told me there were OSG jobs available at HMP Rochester. So, I signed up for it. I managed to get through, but it was only a temporary role at first. After four months, I secured a permanent job. "
        },
        {
            "text": "What was the most rewarding part of being an OSG? "
        },
        {
            "text": "Ensuring the safety of others was incredibly rewarding. I worked in the communications area, where you're responsible for the radio network, CCTV, and other crucial systems. If an alarm bell rang, I had to ensure staff were sent to the right place with the right instructions. It was a lot of responsibility, but knowing I was contributing to the safe and smooth running of the prison was extremely satisfying. "
        },
        {
            "text": "What career progression opportunities did you have as an OSG? "
        },
        {
            "text": "I progressed from OSG to prison officer, then from officer to supervising officer (SO), and later from SO to custodial manager (CM). After that, I moved into a Band 7 headquarters role, and now I’m in a Band 9 position, leading prison performance improvement nationally. There are plenty of opportunities for progression, and it doesn’t have to be in an operational capacity. I’ve met many OSGs who have moved into administrative or headquarters roles. In fact, some people in my current team started in security or other roles before transitioning into different areas. "
        },
        {
            "text": "Once you’re through the door, you realise just how many opportunities are available. There are so many functions within each prison that you can explore. My current role involves acting as a link between prisons and headquarters, which means I get to work with a variety of teams across the service. The range of career paths is vast. "
        },
        {
            "text": "How did you manage the challenges of shift work and night work as an OSG? "
        },
        {
            "text": "If this is the work you're looking for, there's a strong likelihood you’ll need to work nights and weekends. Since prisons operate 24/7, shifts need to cover all hours. Flexibility is sometimes possible, especially if the work is covered. I knew people who had football season tickets, so they would swap their shifts to ensure they could attend the football regularly. However, it’s important to be realistic – don’t sign up expecting complete flexibility. "
        },
        {
            "text": "Personally, I didn’t mind shift work too much. My wife joined as an OSG not long after I started so we were both working shifts. Your social life tends to revolve around the people you’re working with, and you end up building camaraderie with your colleagues during these unusual hours. It’s a unique environment and you form strong bonds with those around you. "
        },
        {
            "text": "Reflecting on your time as an OSG, how do you feel your role contributed to making a positive impact on the lives of prisoners? "
        },
        {
            "text": "Prisons simply don’t function without OSGs. For example, to move a prisoner from A Wing to work or education, I need someone in the communications area to facilitate it. I need someone to open the gate or drive a prisoner to the hospital – these are all OSG responsibilities. OSGs are the linchpins of the prison, ensuring everything runs smoothly and safely. Direct rehabilitation work, like reducing reoffending or helping prisoners gain an education, can only happen because OSGs enable the processes. We’re the people ensuring the right conditions are there for all that good work to take place. "
        },
        {
            "text": "Conclusion "
        },
        {
            "text": "Michael’s journey shows the essential role OSGs play in the smooth and safe operation of prisons and the vast opportunities available for career development within the Prison Service and more widely in HMPPS. Whether you're interested in an operational or non-operational career, the pathways and opportunities for career development are numerous. From maintaining security to supporting rehabilitation, OSGs are the backbone of a prisons’ daily operations. "
        },
        {
            "text": "If Michael’s journey has inspired you, why not explore the opportunities avaialble in the Prison Service? If you want a varied role, working with a diverse and supportive team, start your journey today and see where it could take you."
        }
    ]
}