{
    "url": "https://food.blog.gov.uk/2023/12/14/a-christmas-message-from-the-fsa/",
    "title": "A Christmas message from the FSA",
    "authors": [
        "Emily Miles, Chief Executive",
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-12-14T12:55:20+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "As we approach the end of 2023 and look back over another busy year, everyone at the FSA and the FSA Board would like to thank you for your support for our work."
        },
        {
            "text": "Throughout the year the FSA meets and works with people who bring care and dedication to their businesses and organisations to maintain high food standards. We look forward to continuing to work with you across the food system so that we can all have food we can trust."
        },
        {
            "text": "We wish you and your loved ones a happy Christmas and New Year."
        },
        {
            "text": "Emily Miles\nProf Susan Jebb"
        },
        {
            "heading": 1,
            "text": "Neges Nadoligaidd gan yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Wrth i'r flwyddyn ddirwyn i ben ac wrth i ni fyfyrio ar flwyddyn brysur arall, hoffai pawb yn yr Asiantaeth Safonau Bwyd (ASB) a Bwrdd yr ASB ddiolch i chi am gefnogi ein gwaith eleni."
        },
        {
            "text": "Drwy gydol y flwyddyn mae’r ASB yn cyfarfod ac yn gweithio gyda phobl sy’n gofalu ac yn ymroi i’w busnesau a’u sefydliadau, a hynny er mwyn cynnal safonau bwyd uchel. Rydym yn edrych ymlaen at barhau i weithio gyda chi ar draws y system fwyd fel y gall pob un ohonom gael bwyd y gallwn ymddiried ynddo."
        },
        {
            "text": "Dyma ddymuno Nadolig Llawen a Blwyddyn Newydd Dda i chi a’ch teulu."
        },
        {
            "text": "Emily Miles\nYr Athro Susan Jebb"
        }
    ]
}