{
    "url": "https://supportingfamilies.blog.gov.uk/2023/12/14/a-familys-journey-one-mums-journey-to-find-a-safe-place-for-her-children-and-finally-call-a-house-a-home/",
    "title": "A Family’s Journey: One Mum’s journey to find a safe place for her children and finally call a house a home    ",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Financial Frameowrk",
        "Financial Framework",
        "Health",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict",
        "Transformation"
    ],
    "pub_date": "2023-12-14T15:01:53+00:00",
    "content": [
        {
            "text": "Family Details"
        },
        {
            "text": "Mum, Emily, lives with her 3 Children, Jo aged (13), Cathy (11) and Ruth (9)"
        },
        {
            "text": "What happened and What services were involved?"
        },
        {
            "text": "The family was open to a child protection plan and social care were involved following concerns from Education Welfare officer. This was regarding Jo and Cathy’s lack of attendance at school."
        },
        {
            "text": "Dad was initially referred to the Perpetrator Programme with concerns of domestic abuse and children being home schooled with minimum engagement with professionals."
        },
        {
            "text": "Dad disengaged with the programme and focused support work began with mum Emily.   "
        },
        {
            "text": "What support and actions were put in place?"
        },
        {
            "text": "For mum, Emily, to feel safe and build a trusting relationship she was allocated a Lead Professional: Sarah, who was part of the Domestic abuse team."
        },
        {
            "text": "Sarah engaged with the allocated social worker, Family Support Worker and the Educational Welfare officer. Due to the sensitive nature, the case was referred to the Multi Agency Risk Assessment Conference (MARAC) to discuss a coordinated community response to the domestic abuse. Sarah spoke to Emily’s before the meeting and shared her views on her behalf."
        },
        {
            "text": "The next stage was to work in partnership with the police to safely remove mum and her children from the family home. Sarah was able to work with the Housing Officer to secure property for Emily and the children to move into (despite being in significant rent arrears)."
        },
        {
            "text": "This was a big step for Emily as she had tried to leave the family home in the past but as the family was in debt, she could not cope financially and felt she had no option but to return home. This time was different as she had shared all her financial circumstances with Sarah. Emily’s bank account was frozen as her partner had access to all her bank accounts. Sarah managed to help Emily access a Household Support Fund which was used to support with food and essential items and apply for funding to support with other items (freezer, beds, extra curriculum activities for children and laptops to support children during their education)."
        },
        {
            "text": "Sarah liaised with all the debt services and advocated on behalf of Emily and managed to support in clearing previous rent arrears and council tax arrears that resulted from financial abuse. She has continued to provide support with financial assistance and help Emily become financially independent.  "
        },
        {
            "text": "What progress has been made?"
        },
        {
            "text": " "
        },
        {
            "text": "Quote from mum"
        },
        {
            "text": "This is just to say a big thank you to the team who were amazingly supportive during our dramatic and emotional move. It all started from my very first contact with Sarah, after completing the spotlight programme ,their support has been an all-rounder from dealing with my accommodation issues, debt solutions, financial support and our welfare in general."
        },
        {
            "text": "We are on our way to settling down and the adjustments have been a challenge but manageable with the support of the professionals involved. We were made to feel comfortable, welcome, appreciated and never the sense of being judged, which is always everyone's fear, and we have since built a good rapport between the team and my kids and this has made it easier to work together."
        },
        {
            "text": "The kids would like to specifically thank Sarah for remembering their birthdays, the presents and other little things and just how they felt cared for."
        },
        {
            "text": "Above all l would like to say a big thank you the original team and manager we worked with, it's sad l never saw her again but nevertheless l have had the best support from Sarah who has worked tirelessly with me in putting all the pieces together for us, driving back and forth once every week. I could have never done half by myself and projects like these are doing wonders without even knowing that's why l think testimonies and reviews play such a big role in helping to improve the cause."
        }
    ]
}