{
    "url": "https://socialcare.blog.gov.uk/2023/12/14/adult-social-care-workforce-reform-a-meeting-of-minds/",
    "title": "Adult social care workforce reform: a meeting of minds",
    "authors": [
        "Nigel Taylor",
        "Gareth Young",
        "Olivia Rutherford"
    ],
    "categories": [
        "Care and support",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-12-14T16:30:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Walk and talk"
        },
        {
            "text": "Nigel Taylor, CareTech's Head of Learning and Development:"
        },
        {
            "text": "The CareTech Senior Adults team hosted colleagues from the Department of Health and Social Care (DHSC) recently. This included a meeting to discuss current workforce initiatives for the social care sector and then visiting services to meet with front line staff, managers and those we support."
        },
        {
            "text": "It was an opportunity to discuss current initiatives and their implications and also an opportunity for DHSC colleagues to observe front line practice in a variety of settings."
        },
        {
            "text": "This was a positive visit for DHSC and CareTech, both sides learning from each other and gaining a better understanding of how we can work together to improve workforce capabilities and retain skilled and competent staff."
        },
        {
            "text": "The initiatives discussed were all focused on attraction, recruitment and retention, how best to implement them and the expected impact they could have in developing our workforce. The Care Workforce Pathway, the new Care Certificate and the development of a skills passport all form part of the DHSC team’s portfolio."
        },
        {
            "text": "Our senior leadership team set out our position, supporting the view that investment in our workforce through quality training provides a return on investment, with positive impacts on commercials, quality and our people."
        },
        {
            "heading": 2,
            "text": "Positive pathways"
        },
        {
            "text": "Care career pathways were a main point of discussion. If we get the leadership and management right in our sector then this will help form the culture of the service: clear pathways so that staff and new entrants can see their possible career journey."
        },
        {
            "text": "CareTech have invested in developing our own leadership and management academy. This has had an impact on our frontline leaders in retaining our managers, supporting performance and improving service quality."
        },
        {
            "text": "Nigel Taylor, group head of LD at CareTech and Chair of the ASC Apprenticeship Trailblazer group, was keen to see how these initiatives fit with the current review of apprenticeship standards “it was good to see real engagement with an employer and practitioners, so that both teams can see the benefits and where everything can fit together.”"
        },
        {
            "text": "It has been agreed further engagement between our teams will continue. This is an opportunity for the sector to help shape these initiatives to make sure they have a positive impact on our workforce. This is about establishing social care as a career, delivering quality care through continuity and consistency."
        }
    ]
}