{
    "url": "https://naturalengland.blog.gov.uk/2023/12/14/allonby-bay-coastal-connections-project-exploring-and-celebrating-our-coastal-heritage/",
    "title": "Allonby Bay Coastal Connections Project: exploring and celebrating our coastal heritage",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Coast and access",
        "Education",
        "Marine environment",
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2023-12-14T10:39:51+00:00",
    "content": [
        {
            "text": "Our vision at Natural England, is of thriving nature for people and planet. Our aim is for everyone is able to enjoy nature’s benefits and act for the environment, wherever they live. We want to support people in recognising the true value of our natural and cultural heritage and to inspire them to undertake actions to benefit and protect nature."
        },
        {
            "text": "This includes creating opportunities to help people increase their sense of nature connectedness through ‘pathways to nature’ - activities that engage our senses, emotions, appreciation of beauty, and create personal meaning."
        },
        {
            "text": "As part of this ambition, Natural England funded and supported a recent project at Allonby Bay on the north Cumbrian Coast. Using art-based activities and workshops, and linking with local schools, children were able to explore, celebrate and connect with their local coastal habitat around the bay, and with the creatures that have made this stretch of coastline their home."
        },
        {
            "text": "The project was led by The Laal Collective and took place between April and July 2023. The aim was to connect local young people and their families to the unique coastal heritage and nature around both Allonby and Maryport. The Laal Collective worked alongside the teachers and children at Allonby Primary, Crosscanonby St. John Primary and Holme St. Cuthberts Primary, to turn the project’s ambitions into reality."
        },
        {
            "heading": 3,
            "text": "THE TALE OF THREE HERRINGS"
        },
        {
            "text": "The small parish of Allonby has on its flag, the image of three herrings. The herrings celebrate the town’s cultural heritage around the industry of fishing and herring smoking. This became the focus point of an idea for our three schools’ project."
        },
        {
            "text": "We embarked on a project which would teach children about the unique, local natural environment; the creatures that live within it and the impact humans have had on the area. They then went on to create a story around one of ‘The Three Herrings’ featured on the flag. Their stories were informed by the factual knowledge that the children learnt through the project, but also brought a wonderful magical and imaginative approach to their tales."
        },
        {
            "text": "As well as stories, each school designed and brought to life puppets of creatures found around Allonby and those that appear in their story, using recycled plastic bottles and fabrics. This was complemented by the creation of their own school banner that celebrated local nature and wildlife."
        },
        {
            "text": "The highlight of the project was a fantastic presentation on Allonby Green at our King Charles III England Coast path celebration event, one of a series of events across England celebrating the opening of this new national trail around England’s coastline."
        },
        {
            "text": "Children and their families gathered together and proceeded around the green with their banners and puppets, stopping at three locations to read and share their stories with friends, families and the visiting public."
        },
        {
            "text": "With grateful thanks to the wonderful work of the Haltwhistle Film Project, we are really pleased to share with you a short film that celebrates and documents the project."
        },
        {
            "text": "Enabling schools to explore at first hand the fabulous and sometimes unique nature close to home, this project supported local children to use the creative arts to build an understanding and connection with the nature and heritage of Allonby Bay."
        },
        {
            "text": "This project demonstrates just one of the many underway within local communities that Natural England are leading. We are dedicated to fostering partnerships and projects which allow for recreational activities, creating opportunities for people from all walks of life to connect with nature, in and around their local communities. We are working with partners to highlight the importance of time spent in the nature, and the many physical and mental benefits that come from being outdoors. Following on from the launch of the Environmental Improvement Plan (EIP) last year, we are committed to ensuring that we find ways to tackle the many barriers people face in accessing nature, which we hope will result in more people deepening their love and respect for our incredible natural world."
        },
        {
            "text": "If you would like to know more details about the project and our work in this area, please contact Claire Green, Cumbria Inclusion Senior Advisor, claire.green@naturalengland.org.uk"
        }
    ]
}