{
    "url": "https://teaching.blog.gov.uk/2023/12/14/flexible-working-in-our-school/",
    "title": "Flexible working in our school",
    "authors": [
        "Emily Crow"
    ],
    "categories": [
        "Flexible working",
        "Teacher wellbeing"
    ],
    "pub_date": "2023-12-14T11:22:44+00:00",
    "content": [
        {
            "text": "Charles Dickens Primary school, in central London, is part of The Charter Schools Education Trust and is one of the 12 Flexible Working Ambassador Multi Academy Trusts and schools appointed by the Department for Education to help school leaders implement flexible working."
        },
        {
            "text": "Emily Crow, deputy director at London South Teaching School Hub, shares Charles Dickens’ approach to flexible working and her experience of the benefits it has brought to the school community. "
        },
        {
            "text": "Our approach to flexible working "
        },
        {
            "text": "As an organisation, we understand that colleagues’ commitments and demands on their time will change throughout their careers, and that it’s important we are in a position to provide support when needs and wants arise."
        },
        {
            "text": "We’ve strived to normalise flexible working and have worked hard to create a culture where we champion flexible working for all."
        },
        {
            "text": "We’ve achieved really strong retention as a result of this approach, and staff wellbeing has increased. This is evidenced through surveys, staff meetings, and a wellbeing steering group."
        },
        {
            "text": "What flexible working looks like in our school"
        },
        {
            "text": "This academic year,13 of our 69 colleagues have formal flexible working arrangements, mainly part time and compressed hours, and all our staff benefit from informal flexible working."
        },
        {
            "text": "We have examples of colleagues working flexibly for caring reasons. For example, a senior male colleague is working part time, initially as shared maternity/ paternity leave, and then a four-day week achieved through flexible PPA and compressed hours to share parenting and to support a work/ life balance. He coined these “Daddy Fridays”."
        },
        {
            "text": "Of course, flexible working is not just for those with caring responsibilities. We have an example of a colleague who worked flexibly to pursue their field of study. This colleague worked part time to complete a PhD in Creative Arts. She’s now returned to teaching full time and this CPD is really enriching her practice as well as equipping her to offer broader CPD to our school, and more widely across our trust. This example highlights that flexible working can be for a fixed amount of time, if that’s what works for the individual."
        },
        {
            "text": "We also offer informal or ad-hoc flex. For example, within the Trust, one colleague wanted to run the London marathon but was not keen on training in the dark during the winter months. So, we supported informal flex arrangements to support her to balance her training with teaching commitments."
        },
        {
            "text": "‘We care’ offer "
        },
        {
            "text": "We also have a whole school, full time flexible working offer, which we call our “We care” offer."
        },
        {
            "text": "Every colleague benefits from gifted days, and these might be used to attend a child’s sports day, pursue an interest or travel. These days are a reason-neutral offer and acknowledge the additional commitment, ‘the above and beyond’ that colleagues invest into making our organisation rich e.g., parents’ evenings, school discos, international fairs, school performances etc."
        },
        {
            "text": "This offer extends to all colleagues."
        },
        {
            "text": "‘Stay meetings’"
        },
        {
            "text": "The headteacher ensures that we have one to one conversations with staff about how to support them to stay in the trust, and we call these “stay meetings”. These happen regularly throughout the year and aren’t part of performance management, but provide an opportunity for the headteacher to really understand the needs and wants for each of our colleagues. It also supports us to plan staffing and resource in a really helpful, sustainable way."
        },
        {
            "text": "An evolving journey"
        },
        {
            "text": "I think it’s really important to say that this culture change and perception shift hasn’t happened overnight. It really has been a journey that we’ve been committed to. And it is a journey that we will continue on."
        },
        {
            "text": "I can honestly say that this has made our organisation richer and has helped us to make better decisions, underpinned by our ‘we care’ culture."
        },
        {
            "text": "Hear more from Emily about flexible working in Charles Dickens, by listening to this podcast"
        },
        {
            "text": "Find out how to access support with flexible working About | Flexible working in Multi-Academy Trusts and schools (flexibleworkingineducation.co.uk)"
        }
    ]
}