{
    "url": "https://ofsi.blog.gov.uk/2023/12/14/ofsi-publishes-details-of-frozen-asset-reporting-for-financial-year-2022-23/",
    "title": "OFSI Publishes Details of Frozen Asset Reporting for Financial Year 2022-23",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial Sanctions",
        "Frozen Assets",
        "Implementation",
        "Statistics"
    ],
    "pub_date": "2023-12-14T10:20:28+00:00",
    "content": [
        {
            "text": "On 14 December 2023, the Office of Financial Sanctions Implementation (OFSI) published its Annual Review for the financial year 2022 to 2023 containing reporting on assets frozen under UK financial sanctions regulations. This blog explains more about the two separate reporting exercises: the Annual Frozen Asset Review and Russian Frozen Assets In-Year Reporting.  "
        },
        {
            "text": " "
        },
        {
            "text": "Annual Frozen Asset Review "
        },
        {
            "text": "Each year OFSI conducts a comprehensive exercise known as the Annual Frozen Asset Review, published within OFSI’s broader Annual Review. This exercise aims to gain insights into assets that have been frozen due to UK financial sanctions regulations within the specified timeframe. To facilitate this process, individuals with possession of, or control over, assets, encompassing funds and economic resources subject to freezing under UK financial sanctions, are mandated to provide OFSI every year with detailed reports outlining the nature and assessed value of these assets. This figure includes the value of funds frozen in the UK, such as funds in UK bank accounts, as well as overseas where those funds or economic resources are subject to UK financial sanctions legislation. The Annual Frozen Asset Review does not include any assets where their value is approximate. "
        },
        {
            "text": "The Annual Frozen Asset Review for 2022 reported £21.6 billion* of funds frozen as at 30 September 2022 across all of our regimes. "
        },
        {
            "text": "This is a substantial increase of £9.2 billion since 2021 demonstrating the sustained pressure that the UK’s financial sanctions have had."
        },
        {
            "text": " "
        },
        {
            "text": "Russian Frozen Assets In-Year Reporting "
        },
        {
            "text": "In addition to the Annual Frozen Asset Review, relevant firms are also obliged to report to OFSI as soon as practicable, information concerning funds or economic resources belonging to, owned, held, or controlled by a designated person. This is known as Frozen Asset In-Year Reporting.  "
        },
        {
            "text": "Under Frozen Asset In-Year Reporting, OFSI announced in its Annual Review that as of October 2023, £22.7 billion worth of assets frozen in relation to the Russia regime have been reported frozen to OFSI since the beginning of Russia’s large-scale invasion of Ukraine in February 2022. "
        },
        {
            "text": "The importance of Frozen Asset In-Year Reporting is that it enables OFSI to build a picture of the value of assets as they were frozen, rather than monitoring changes over time. The In-Year Reporting figure provided above for Russia comprises the value of all reported frozen assets, including bank accounts, payments, real estate, bullion, and other tangible and intangible assets. As Frozen Asset In-Year Reporting is a cumulative value of frozen assets at the time of freezing and does not determine or record subsequent changes, the published values as part of In-Year Reporting are likely to be higher than their actual value as the assets subsequently depreciate. For example, valuations of shares at the point of reporting will fluctuate, and funds may be legitimately drawn down through licensing. Unlike the annual Frozen Asset Review, In-Year Reporting identifies the last known value of shares reportedly held at the point of designation, where not already reported. Similarly, valuations of tangible assets reported as part of In-Year Reporting are made through publicly available information where not included in submitted reports. Collectively, this represents a significant proportion of assets reported as frozen throughout the year. "
        },
        {
            "text": "Across all financial sanctions regimes, the total value of frozen funds or economic resources reported under either exercise to OFSI is susceptible to fluctuation. Reasons include: changes in share, market, or currency values, and new designations or sanctions being lifted, or licensed financial activity. Therefore, the value of frozen assets reported to OFSI as part of the Annual Frozen Asset Review or as part of Frozen Asset In-Year Reporting do not provide a complete picture of assets frozen as a result of UK financial sanctions.  "
        },
        {
            "text": "The OFSI Annual Review 2022-23: Strengthening our Sanctions is available to read now on GOV.UK. "
        },
        {
            "text": "* This figure does not include the value of all assets reported to OFSI as part of the annual frozen asset review due to difficulties in defining their values with accuracy. This may include the contents of safety deposit boxes or tangible assets. "
        }
    ]
}