{
    "url": "https://defradigital.blog.gov.uk/2023/12/14/opportunity-diversity-and-our-shadow-executive-board/",
    "title": "Opportunity, diversity, and our Shadow Executive Board",
    "authors": [
        "Laurie Doyle",
        "Rich Stanley",
        "Stephen Jenkins"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-12-14T07:30:43+00:00",
    "content": [
        {
            "text": "At the conclusion of Disability History Month, Stephen Jenkins, Rich Stanley, and Laurie Doyle reflect on the value of a key staff forum which encourages inclusivity and diversity, and which has provided each of them with a vital learning and development opportunity."
        },
        {
            "text": "In Defra Digital Data and Technology, we operate a Shadow Executive Board (SEB). SEB comprises a diverse group of volunteers  at Grade 7 or below who bring equality and inclusion to the forefront of senior managers’ thoughts through offering  advice on upcoming initiatives before they reach our Executive Board (EB)."
        },
        {
            "text": "Volunteers join a cohort which lasts for six months before being refreshed with new members, the aim being to encourage a diverse range of insights. Colleagues with protected characteristics are especially encouraged to get involved as a means of sharing their unique perspectives and experiences."
        },
        {
            "text": "This includes, but isn’t limited to, colleagues with disabilities (visible or hidden), women, ethnic minorities, and those who may be from disadvantaged backgrounds. A member of our Talent, Wellbeing and Inclusion Team supports SEB members in their roles, holding regular meetings with the two SEB co-chairs and ensuring that the platform used for fortnightly group meetings is accessible to everyone."
        },
        {
            "heading": 2,
            "text": "Rich Stanley"
        },
        {
            "text": "I joined SEB for a few reasons. First and foremost, I wanted to contribute to fostering inclusivity in the workplace. Having observed instances of discrimination related to disabilities on numerous occasions, both in educational settings and the workplace, and recognising the profound impact it has on the individuals affected, I believe that promoting a collaborative and innovative environment will enhance well-being and provide equal opportunities for individuals, regardless of their background."
        },
        {
            "text": "Additionally, having recently joined Defra, the SEB presented an opportunity to explore the broader organisational landscape, meet new colleagues, and expand my professional network. Lastly, it offered a unique chance to gain insights into strategic decision-making processes at a higher level, aligning with a personal development goal I had set for myself."
        },
        {
            "text": "During my time on SEB, I played a role in reviewing papers and providing constructive feedback on presentations before they reached the EB. This involved considering aspects from an Equality, Diversity, and Inclusion (EDI) perspective, scrutinising data presentation, and thinking about the wider implications to the organisation. I also engaged with EB members directly, seeking ways to promote SEB initiatives, and communicating key insights from previous meetings."
        },
        {
            "text": "Overall, I have greatly valued my time with the SEB. The experience has deepened my understanding of the wider organisation and its various functions, helping to foster a more holistic and open-minded approach to how I think about my work. Moreover, knowing that my input has positively contributed to advancing EDI initiatives and creating a thriving culture where everyone has opportunities to succeed been a particularly gratifying and rewarding aspect of my engagement."
        },
        {
            "heading": 2,
            "text": "Stephen Jenkins"
        },
        {
            "text": "Being a member of SEB has been an enlightening and gratifying experience, providing myself and other SEB members with unique insights into the inner workings of decision-making processes within our organisation. As a part of this select group tasked with reviewing papers and initiatives before they reach Exec Board itself, I found great satisfaction in contributing to the shaping of a variety of strategies and policies."
        },
        {
            "text": "One of the most rewarding aspects of this role has been the exposure to cross-team working methods. Collaborating with diverse individuals from various teams has not only broadened my professional network but has also allowed me to witness the synergies that emerge when different perspectives and expertise converge. This cross-functional collaboration, combined with a further review for those presenting at Exec Board, I believe further ensures a comprehensive and well-rounded approach to decision-making."
        },
        {
            "text": "I believe my time on the SEB has not only empowered me to actively participate in steering this organisation’s direction but has also provided me with a valuable education in leadership strategies through being privy to the prelude of executive discussions."
        },
        {
            "text": "As such it has given me a deeper understanding of the responsibilities and variety of different decisions and proposals faced by senior leadership. The experience has undoubtedly shaped my professional growth and deepened my appreciation for the complexities involved in high-level decision making. I would recommend this kind of opportunity to anyone wishing to see a bit more about what is happening at the senior leadership level in their organisation."
        },
        {
            "heading": 2,
            "text": "Laurie Doyle"
        },
        {
            "text": "As a member of SEB, I acted as co-chair from May 2023 through to the end of November, which was a fantastic experience as a new starter with Defra. I had never taken on a co-chair position before but was motivated to apply as, being autistic myself, I was passionate about supporting the development of a more diverse, inclusive workplace."
        },
        {
            "text": "One of my main activities as co-chair was contacting colleagues who would be attending upcoming DDTS Executive Board meetings to invite them to present their papers to SEB in advance of these. This was so that SEB members were able to offer advice on where they might be able to improve areas to make them more inclusive."
        },
        {
            "text": "I chaired these meetings, encouraging discussion between SEB members and presenters, who all engaged with enthusiasm. SEB members asked questions and made thoughtful suggestions, and the presenters who attended were delighted to receive our input. These meetings provided not only the opportunity to offer new ideas on how to raise awareness of inclusivity practices, but to develop my understanding of what was happening across our wider organisation."
        },
        {
            "text": "To help make presenting at SEB more accessible, I developed a document outlining the process, which can be found on SEB’s SharePoint. This laid out what would take place before the meeting, with SEB members receiving papers to make notes on in advance, during the meeting, where we engaged in discussion and offered suggestions, and after, with meeting notes circulated to both presenters and the Executive Board, detailing our suggestions."
        },
        {
            "text": "This experience, combined with hearing suggestions from other SEB members helped me develop my understanding of how to improve inclusivity in the workplace."
        },
        {
            "text": "SEB also engaged directly with members of the Exec Board, which gave our members a chance to ask questions and learn about opportunities to get involved with, including upcoming initiatives. This gave me the opportunity to learn more about how decisions are made across Defra and was an invaluable experience."
        }
    ]
}