{
    "url": "https://insidehmcts.blog.gov.uk/2023/12/14/our-year-in-focus/",
    "title": "Our year in focus",
    "authors": [
        "Nick Goodwin - Chief Executive, HMCTS"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2023-12-14T15:00:53+00:00",
    "content": [
        {
            "text": "With the festive season just around the corner (and perhaps well underway for many), I wanted to reflect on another year that has passed in the blink of an eye in our courts and tribunals. Not for the first time in recent years, they’ve been 12 months that have brought their fair share of challenges to the justice system, but at the same time seen colleagues at HMCTS and everyone working in the system achieve a lot, even when times have been tough.  "
        },
        {
            "text": "As ever, I’m immensely grateful to you all for all you’ve done in 2023. "
        },
        {
            "heading": 2,
            "text": "Our Reform Programme "
        },
        {
            "text": "We’re now in the final phase of delivering the Reform Programme we started in 2016, and are fulfilling the vision of a just, proportionate, accessible justice system that places people’s needs and expectations at its heart. We’ve made good progress in 2023, as people have made more and more applications through our modernised systems across the jurisdictions – from online civil money claims and digital divorce, through to the single justice service and social security appeals.  "
        },
        {
            "text": "Earlier this month, we published, for the first time, data, which showed that between April 2019 and September 2023 there were 2.4 million digital applications across our online services. The data shows a trend towards increased use of digital services, with, for example, the number of people opting for the digital platform over paper for their probate applications more than quadrupling since 2019. Satisfaction scores from those using the services directly, or contacting our Service Centres about a case, remain reassuringly high, with nearly all services scoring between 74% and 94% for ‘very good’ or ‘good’ ratings in the first half of this financial year. "
        },
        {
            "text": "Not only are reformed services making a difference directly to those who use them, they’re now giving us the quality insights we need for the first time, to support evidence-based decisions around further improving services.  This has made it possible for us to publish, in November, assessment reports that measured how effectively 4 of our reformed services – online civil money claims, divorce, probate and the Social Security and Child Support Tribunal – are performing against pre-defined access to justice criteria. In other words, reformed services themselves are enabling us to collect protected characteristics information which allows us to identify barriers which may otherwise have been hidden. "
        },
        {
            "text": "Our focus now is on looking at the work of HMCTS holistically, considering what we need to do in the final phase of the Reform Programme alongside the day-to-day business of courts and tribunals, to give us the best chance of performing at our best here and now, and creating a stable environment where we can continue to improve.  "
        },
        {
            "heading": 2,
            "text": "Operational milestones "
        },
        {
            "text": "We’ve continued to achieve a lot on the frontline too. After a difficult year for the probate service, driven by an increase in the number of receipts, we’re now seeing sustained improvements. October saw a record number of grants issued at nearly 28,000. We know there’s more to do, but we’re on the right track thanks to our staff and the support of charities and probate professionals. "
        },
        {
            "text": "In the Crown Court we sat more days (10,033) in March 2023 than any other single month since July 2015, testimony to the collective efforts of everyone working in the criminal justice system. "
        },
        {
            "text": "This year saw us move past the milestone of 1 million cases accepted onto our criminal case management system, Common Platform. Following completion of the rollout of the platform into all Crown and magistrates’ courts which we achieved in August, the numbers of cases managed through the system have been rising rapidly in recent months. "
        },
        {
            "text": "And when we published our revised Welsh Language Scheme in the spring, we ensured that we continue to improve our Welsh language provision when providing our services in Wales. "
        },
        {
            "text": "We’ve also hit 3 significant anniversaries this year. April marked a year since our redesigned divorce service began supporting new ‘no fault’ divorce legislation, with around 134,000 sole and joint applicants using the reformed service in the year since this was introduced, and around 62,000 since. In July, we celebrated 12 months since the first Deaf juror was able to participate in a Crown Court trial through the use of a British Sign Language interpreter, with nearly 40 Deaf people being able to do the same since. And television cameras have now been broadcasting judicial sentencing remarks in the Crown Court for over a year, with over 35 broadcasts from across the country reaching millions of viewers in a major advancement of open justice. "
        },
        {
            "heading": 2,
            "text": "Accessibility progress "
        },
        {
            "text": "Lots of the work that’s been done this year has often been behind the scenes, and this certainly applies to how we’re making the courts and tribunals system more accessible, where we’ve made solid progress.  "
        },
        {
            "text": "You may have seen we joined the national Hidden Disabilities Sunflower Network which helps people visiting court and tribunal buildings discreetly access any additional support or help they might need. We’ve been routinely working to support users who are unable to or find it difficult to use our online services, and our free national digital support service has now supported more than 3,500 since it launched in June 2022, offering face-to-face or remote support. Elsewhere staff at the Royal Courts of Justice have been working to improve support for court users with accessibility needs and as part of that, we recently relaunched our Disability Contact Officer network. "
        },
        {
            "text": "Looking ahead, we know the full accessibility of some of our buildings can sometimes be challenging. In the summer, the Lord Chancellor announced that he had secured £220 million to invest in a court maintenance programme up until March 2025 which will improve and modernise our buildings. This will remain a top priority as we move into 2024. "
        },
        {
            "text": "Finally, as a sign of our ongoing commitment to open justice, we’ll soon be publishing a new guide to help members of the public understand their rights and the practicalities of observing court or tribunal hearings, or accessing information about cases. "
        },
        {
            "heading": 2,
            "text": "Doing this together "
        },
        {
            "text": "As always, it should be underlined that none of this – the challenges we have faced and the achievements realised – can ever be delivered in isolation.  "
        },
        {
            "text": "Day in, day out we’ve worked shoulder to shoulder with the people who use and work in the system. Whether that be the with the judges and other professionals working on the frontline, the people we partner with and learn from through a network of strategic engagement activity, the partnerships we’ve built this year with our counterparts in Europe and internationally  – it has all been built on relationships that centre around our common goal of access to justice for all. "
        },
        {
            "text": "Thank you, once more, for the part you have played this year. I very much hope that you’re able to take at least some time this festive period to rest, relax and recuperate. And I look forward to meeting 2024 head on, together once again. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Ein blwyddyn mewn ffocws"
        },
        {
            "text": "Gan Nick Goodwin, Prif Swyddog Gweithredol, Gwasanaeth Llysoedd a Thribiwnlysoedd EF"
        },
        {
            "text": "Gyda thymor yr ŵyl rownd y gornel (ac efallai yn mynd rhagddo’n barod i lawer ohonoch), roeddwn i eisiau myfyrio ar flwyddyn arall sydd wedi mynd heibio yn ein llysoedd a'n tribiwnlysoedd. Nid am y tro cyntaf yn y blynyddoedd diwethaf, maen nhw wedi bod yn 12 mis sydd wedi dod â'u cyfran deg o heriau i'r system gyfiawnder, ond ar yr un pryd gwelwyd cydweithwyr yn GLlTEF a phawb sy'n gweithio yn y system yn cyflawni llawer, hyd yn oed pan fo amseroedd wedi bod yn anodd."
        },
        {
            "text": "Fel erioed, rwy'n ddiolchgar iawn i chi gyd am bopeth rydych chi wedi'i wneud yn 2023."
        },
        {
            "heading": 2,
            "text": "Ein Rhaglen Ddiwygio"
        },
        {
            "text": "Rydym bellach yng ngham olaf cyflwyno'r Rhaglen Ddiwygio a ddechreuwyd gennym yn 2016, ac rydym yn gwireddu'r weledigaeth o system gyfiawnder gyfiawn, gymesur a hygyrch sy'n gosod anghenion a disgwyliadau pobl wrth ei gwraidd. Rydym wedi gwneud cynnydd  da yn 2023, wrth i bobl wneud mwy a mwy o geisiadau trwy ein systemau moderneiddio ar draws yr awdurdodaethau - o hawliadau arian sifil ar-lein a’r gwasanaeth ysgaru digidol, i'r gwasanaeth un ynad a'r apeliadau nawdd cymdeithasol."
        },
        {
            "text": "Yn gynharach y mis hwn, gwnaethom gyhoeddi data, am y tro cyntaf, a ddangosodd fod 2.4 miliwn o geisiadau digidol wedi dod i law rhwng Ebrill 2019 a Medi 2023  ar draws ein gwasanaethau ar-lein. Mae'r data'n dangos tuedd tuag at fwy o ddefnydd o wasanaethau digidol, gyda, er enghraifft, y nifer y bobl sy'n dewis y platfform digidol dros bapur ar gyfer eu ceisiadau am brofiant wedi cynyddu bedair gwaith ers 2019. Mae sgoriau boddhad gan y rhai sy'n defnyddio'r gwasanaethau'n uniongyrchol, neu'n cysylltu â'n Canolfannau Gwasanaeth am achos, yn parhau i fod yn galonogol o uchel, gyda bron pob gwasanaeth yn sgorio rhwng 74% a 94% ar gyfer sgôr 'da iawn' neu 'dda' yn hanner cyntaf y flwyddyn ariannol hon."
        },
        {
            "text": "Nid yn unig y mae gwasanaethau diwygiedig yn gwneud gwahaniaeth uniongyrchol i'r rhai sy'n eu defnyddio, maent bellach yn rhoi'r mewnwelediadau sydd eu hangen arnom am y tro cyntaf, i gefnogi penderfyniadau ar sail tystiolaeth ynghylch gwella gwasanaethau ymhellach. Mae hyn wedi ei gwneud hi'n bosibl i ni gyhoeddi, adroddiadau asesu a oedd yn mesur pa mor effeithiol oedd 4 o'n gwasanaethau diwygiedig - hawliadau arian sifil ar-lein, ysgariadau, profiant a'r Tribiwnlys Nawdd Cymdeithasol a Chynnal Plant – yn perfformio yn erbyn meini prawf mynediad wedi'u diffinio ymlaen llaw, ym mis Tachwedd. Mewn geiriau eraill, mae’r gwasanaethau diwygiedig eu hunain yn ein galluogi i gasglu gwybodaeth am nodweddion gwarchodedig sy'n ein galluogi i adnabod rhwystrau a allai fod wedi'u cuddio fel arall."
        },
        {
            "text": "Rydym yn canolbwyntio nawr ar edrych ar waith GLlTEF yn gyfannol, gan ystyried yr hyn y mae angen i ni ei wneud yng ngham olaf y Rhaglen Ddiwygio, ochr yn ochr â busnes llysoedd a thribiwnlysoedd o ddydd i ddydd, i roi'r cyfle gorau i ni berfformio ar ein gorau, a chreu amgylchedd sefydlog lle gallwn barhau i wella."
        },
        {
            "heading": 2,
            "text": "Cerrig milltir gweithredol"
        },
        {
            "text": "Rydym wedi parhau i gyflawni llawer ar y rheng flaen hefyd. Ar ôl blwyddyn anodd i'r gwasanaeth profiant, wedi'i sbarduno gan gynnydd yn nifer y ceisiadau, rydym bellach yn gweld gwelliannau parhaus. Ym mis Hydref, cyhoeddwyd y nifer uchaf erioed o grantiau gyda bron i 28,000. Gwyddom fod mwy i'w wneud, ond rydym ar y trywydd iawn diolch i'n staff a chefnogaeth elusennau a gweithwyr proffesiynol ym maes profiant."
        },
        {
            "text": "Yn Llys y Goron fe eisteddon ni fwy o ddiwrnodau (10,033) ym mis Mawrth 2023 nag unrhyw fis arall ers mis Gorffennaf 2015, sy’n tystiolaeth o ymdrechion pawb sy'n gweithio yn y system cyfiawnder troseddol."
        },
        {
            "text": "Eleni fe wnaethom symud heibio'r garreg filltir o 1 miliwn o achosion a dderbyniwyd ar ein system rheoli achosion troseddol, y Platfform Cyffredin. Ar ôl cwblhau'r broses o gyflwyno'r platfform i holl lysoedd y goron a llysoedd ynadon ym mis Awst, mae nifer yr achosion a reolir drwy'r system wedi bod yn cynyddu'n gyflym yn ystod y misoedd diwethaf."
        },
        {
            "text": "A phan gyhoeddwyd ein Cynllun Iaith Gymraeg diwygiedig yn y gwanwyn, gwnaethom sicrhau ein bod yn parhau i wella ein darpariaeth Gymraeg wrth ddarparu ein gwasanaethau yng Nghymru."
        },
        {
            "text": "Rydym hefyd wedi cyrraedd tri phen-blwydd sylweddol eleni. Mae mis Ebrill yn nodi blwyddyn ers i'n gwasanaeth ysgariadau newydd ddechrau cefnogi deddfwriaeth ysgariad 'no fault' newydd, gyda thua 134,000 o geiswyr unigol ac ar y cyd yn defnyddio'r gwasanaeth diwygiedig yn y flwyddyn ers iddo gael ei gyflwyno, a thua 62,000 ers hynny. Ym mis Gorffennaf, gwnaethom ddathlu 12 mis ers i'r rheithiwr byddar cyntaf allu cymryd rhan mewn treial Llys y Goron trwy ddefnyddio cyfieithydd Iaith Arwyddion Prydain, gyda bron i 40 o bobl fyddar yn gallu gwneud yr un peth ers hynny. Ac mae camerâu teledu bellach wedi bod yn darlledu sylwadau dedfrydu barnwrol yn Llys y Goron ers dros flwyddyn, gyda dros 35 o ddarllediadau o bob cwr o'r wlad yn cyrraedd miliynau o wylwyr mewn datblygiad mawr o gyfiawnder agored."
        },
        {
            "heading": 2,
            "text": "Cynnydd mewn hygyrchedd"
        },
        {
            "text": "Mae llawer o'r gwaith sydd wedi'i wneud eleni yn aml wedi bod y tu ôl i'r llenni, ac mae hyn yn sicr yn berthnasol i'r ffordd rydym yn gwneud y system llysoedd a thribiwnlysoedd yn fwy hygyrch, lle rydym wedi gwneud cynnydd cadarn."
        },
        {
            "text": "Efallai eich bod wedi gweld ein bod wedi ymuno â’r rhwydwaith Blodyn Haul Anableddau Cudd cenedlaethol sy'n helpu pobl sy'n ymweld ag adeiladau'r llys a'r tribiwnlys i gael mynediad at unrhyw gymorth neu help ychwanegol y gallai fod ei angen arnynt. Rydym wedi bod yn gweithio'n rheolaidd i gefnogi defnyddwyr nad ydynt yn gallu defnyddio ein gwasanaethau ar-lein neu'n ei chael yn anodd eu defnyddio, ac mae ein gwasanaeth cymorth digidol cenedlaethol am ddim bellach wedi cefnogi mwy na 3,500 ers ei lansio ym mis Mehefin 2022, gan gynnig cefnogaeth wyneb yn wyneb neu o bell. Mewn mannau eraill mae staff yn y Llysoedd Barn Brenhinol wedi bod yn gweithio i wella'r gefnogaeth i ddefnyddwyr y llysoedd sydd ag anghenion hygyrchedd, ac fel rhan o hynny, gwnaethom ail-lansio ein rhwydwaith Swyddog Cyswllt Anabledd yn ddiweddar."
        },
        {
            "text": "Wrth edrych ymlaen, rydym yn gwybod y gall hygyrchedd llawn rhai o'n hadeiladau weithiau fod yn heriol. Yn yr haf, cyhoeddodd yr Arglwydd Ganghellor ei fod wedi sicrhau £220 miliwn i'w fuddsoddi mewn rhaglen cynnal a chadw’r llysoedd hyd at fis Mawrth 2025 a fydd yn gwella ac yn moderneiddio ein hadeiladau. Bydd hyn yn parhau i fod yn brif flaenoriaeth wrth i ni symud ymlaen i 2024."
        },
        {
            "text": "Yn olaf, fel arwydd o'n hymrwymiad parhaus i gyfiawnder agored, byddwn yn cyhoeddi canllaw newydd cyn bo hir i helpu aelodau'r cyhoedd i ddeall eu hawliau ac ymarferoldeb arsylwi gwrandawiadau llys neu dribiwnlys, neu gael gafael ar wybodaeth am achosion."
        },
        {
            "heading": 2,
            "text": "Gwneud hyn gyda'n gilydd"
        },
        {
            "text": "Fel bob amser, dylid cyfleu na ellir cyflawni dim o hyn – yr heriau yr ydym wedi'u hwynebu a'r cyflawniadau a wireddwyd – ar ei ben ei hun."
        },
        {
            "text": "O ddydd i ddydd, rydym wedi gweithio ysgwydd wrth ysgwydd gyda'r bobl sy'n defnyddio ac yn gweithio yn y system. Boed hynny gyda'r barnwyr a gweithwyr proffesiynol eraill sy'n gweithio ar y rheng flaen, y bobl yr ydym yn partneru â nhw ac yn dysgu oddi wrthynt trwy rwydwaith o weithgarwch ymgysylltu strategol, y partneriaethau rydym wedi'u meithrin eleni gyda'n cymheiriaid yn Ewrop ac yn rhyngwladol  – mae'r cyfan wedi'i adeiladu ar berthnasoedd sy'n canolbwyntio ar ein nod cyffredin o gael mynediad at gyfiawnder i bawb."
        },
        {
            "text": "Diolch unwaith eto am y rhan rydych chi wedi'i chwarae y flwyddyn hon. Rwy'n gobeithio'n fawr y gallwch chi gymryd o leiaf ychydig o amser y Nadolig hwn i orffwys ac ymlacio. Edrychaf ymlaen at wynebu 2024, gyda'n gilydd unwaith eto."
        }
    ]
}