{
    "url": "https://dluhcmedia.blog.gov.uk/2023/12/14/the-times-on-housebuilding/",
    "title": "The Times on housebuilding",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2023-12-14T12:26:44+00:00",
    "content": [
        {
            "text": "Today’s leading article in the Times claims that the government has failed to deliver on its manifesto pledge to deliver a million homes over the course of this Parliament. We entirely reject this claim."
        },
        {
            "text": "We are building more homes and are on track to deliver our manifesto commitment to deliver 1 million homes over this Parliament – we have delivered over 90% of this target already."
        },
        {
            "text": "Claims we have dropped targets are completely false. Our goal of delivering 300,000 homes a year remains, and local authorities will continue to have to calculate and justify their local housing need, informed by the standard method. Last year alone we delivered over 234,000 homes which was higher than at any point between 1997 and 2010."
        },
        {
            "text": "Since April 2010, over 2.5 million additional homes have been delivered; the four highest annual rates of housing supply in 30 years have all come since 2018. This is all clear evidence of a government that has consistently delivered on its promise to build more homes. At the same time, the number of non-decent homes has fallen by two million since 2010."
        },
        {
            "text": "Our push to deliver these homes is backed by £10 billion investment in projects to increase housing supply across the country. We are launching a new planning super squad to help speed up large scale developments. To tackle backlogs in the planning system, we’re supporting the sector with the £29m Planning Skills Delivery Fund – which received an extra £5m at the Autumn Statement, as part of a £17m package of planning measures to make it easier to get new homes approved and built."
        },
        {
            "text": "Our Levelling Up and Regeneration Act has new laws in place to speed up the planning system further and cut unnecessary red tape. Importantly, it will ensure we do not just build more homes but that we build the right type of homes in the right places, and put local communities at the heart of decision-making about developments. This will help create proper neighbourhoods that enhance the environment, and are built beautifully alongside GP surgeries, schools and transport links."
        },
        {
            "text": "In July the Housing Secretary set out his long-term plan for housing, which outlined a new era of regeneration, inner-city densification and housing delivery across England. This included ambitious plans to accelerate developments in the heart of three cities that will: transform Cambridge into Europe’s science capital complete with a new housing quarter; deliver a ‘docklands 2.0’ vision in East London creating 65,000 homes; and regenerate Leeds City Centre, removing barriers to help deliver up to 20,000 homes."
        },
        {
            "text": "We have always been clear we want to protect the Green Belt for future generations and to prioritise building on brownfield sites – we have no intention of changing the rules on what development can and cannot occur on the greenbelt. The National Planning Policy Framework is already clear changes to Green Belt boundaries should only take place if exceptional circumstances have been demonstrated. We consulted on clarifying that Green Belt boundaries are not required to be reviewed and altered by local authorities - but that they can still choose to do so where they can evidence that this is warranted."
        },
        {
            "text": "The five-year land supply is an important tool to ensure there is adequate provision for the homes that are needed. Local authorities have to demonstrate they have such a five-year supply when they adopt their local plan. We consulted on a change that would mean authorities that have an up to date plan in place, with such a supply, will be freed from having to make annual updates - with a new supply required to be shown when the plan is updated."
        },
        {
            "text": "We know we need to continue our drive to build the homes we need which is why the Housing Secretary is considering responses to the National Planning Policy Framework consultation and will announce further details on this next week."
        },
        {
            "text": "A Department for Levelling Up, Housing and Communities spokesperson said:"
        }
    ]
}