{
    "url": "https://educationhub.blog.gov.uk/2023/12/14/the-advanced-british-standard-everything-you-need-to-know/",
    "title": "The Advanced British Standard: Everything you need to know ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "A Level",
        "Skills",
        "T Levels"
    ],
    "pub_date": "2023-12-14T06:40:02+00:00",
    "content": [
        {
            "text": "The Prime Minister has announced plans to develop a new qualification framework called the Advanced British Standard for 16 to 18-year-olds which will bring together the best of A levels and T levels into a single qualification framework."
        },
        {
            "text": "The Advanced British Standard will ensure technical and academic education are placed on an equal footing, with every student also studying some form of maths and English to age 18."
        },
        {
            "text": "We have launched a consultation on the new qualification framework and are inviting feedback from education providers and other stakeholders on how best to design and implement the Advanced British Standard."
        },
        {
            "text": "You can find the consultation here on Gov.uk. It will close on 20 March 2024."
        },
        {
            "text": "For now, A levels and T levels will continue to be studied and remain high quality qualifications recognised by employers and universities."
        },
        {
            "text": "Here, we tell you everything you need to know about the Advanced British Standard and what it will involve."
        },
        {
            "heading": 3,
            "text": "How many subjects will the Advanced British Standard include?"
        },
        {
            "text": "While most A level students only take three subjects, students who take the Advanced British Standard will typically study a minimum of five subjects."
        },
        {
            "text": "Some of these subjects will be studied in more detail as ‘majors’, while others will be ‘minors’. For example, a student could take three majors alongside two minors."
        },
        {
            "text": "Students will also spend more time in the classroom, increasing taught hours to a minimum of 1,475 hours over two years. This is almost 200 more taught hours than a typical A level student in England studying three subjects currently receives, and will bring teaching time closer to countries like Denmark, the Netherlands, and Norway."
        },
        {
            "heading": 3,
            "text": "Does this mean everyone will have to study English and maths to the age of 18?"
        },
        {
            "text": "Yes, every student will study some form of maths and English to age 18, making sure that fewer young people leave school without achieving the basics of literacy and numeracy."
        },
        {
            "text": "This change will bring England further into line with other major western economics such as France, Germany, Japan and the USA."
        },
        {
            "heading": 3,
            "text": "Does this mean A levels and T levels are being replaced?"
        },
        {
            "text": "Once rolled out, we anticipate the Advanced British Standard will supersede the current varied qualification offer, building on the best of A levels and T levels and bringing them into a single qualification framework."
        },
        {
            "text": "We will continue the rollout of T levels as a robust and well-respected technical option."
        },
        {
            "text": "From this September, 18 T level courses are available at over 160 schools and colleges across England, in subjects as diverse as health and science, agriculture, digital, and legal services, and T levels remain a great option for young people."
        },
        {
            "heading": 3,
            "text": "When will the Advanced British Standard be introduced?"
        },
        {
            "text": "It will take around a decade to fully roll out the Advanced British Standard."
        },
        {
            "text": "Until then, A levels and T levels will continue to be offered as rigorous, high-quality options for 16- to 18-year-olds and we will work closely with schools and colleges to support them to offer them."
        },
        {
            "text": "We will work closely with the sector, taking account of the results and outcome of the consultation, to develop and deliver this important reform in the most effective way possible."
        },
        {
            "heading": 3,
            "text": "How will you make sure that schools and colleges are prepared for these changes and that there are enough teachers?"
        },
        {
            "text": "These changes will take time to put in place, and will be developed in close consultation with parents, pupils and teachers."
        },
        {
            "text": "An initial funding boost of £600 million over two years will help to lay the groundwork for the Advanced British Standard."
        },
        {
            "text": "This includes an additional £30,000 for teachers teaching key STEM and technical shortage subjects and working in disadvantaged schools and all FE colleges in their first 5 years of their career."
        }
    ]
}