{
    "url": "https://hodigital.blog.gov.uk/2023/12/14/the-benefits-of-joining-the-home-office-data-profession/",
    "title": "The benefits of joining the Home Office Data Profession",
    "authors": [
        "Sophie Stewart, Head of Data Sciences, Data Services and Analytics"
    ],
    "categories": [
        "Data",
        "Recruitment"
    ],
    "pub_date": "2023-12-14T11:16:51+00:00",
    "content": [
        {
            "text": "Data Science is a fascinating and fast-growing profession, taking all the best bits from analytics and programming to gaining insights from big datasets."
        },
        {
            "text": "At Home Office, our data scientists work on a variety of projects, ranging from helping support the efficiency of our operational systems, to providing insights on crime for our law enforcement colleagues."
        },
        {
            "text": "Ethics is a vital part of the work we do, and we make sure we’re following the highest standards when it comes to the analytical quality and ethical implications of our work. This can make for some challenging but rewarding discussions as we strive to ensure our work benefits our users."
        },
        {
            "heading": 2,
            "text": "The Data Profession at the Home Office: Sophie Stewart"
        },
        {
            "text": "As Head of Data Sciences, I’m responsible for the strategic direction of Data Science in Digital, Data and Technology (DDaT). I lead on how we add value to products and on horizon scanning for new approaches, such as the explosion of public interest in AI."
        },
        {
            "text": "I spend much of my time making sure the Home Office is a great place to work for Data Scientists. This includes making our recruitment process fairer and more accessible. I ensure we offer a great learning and development programme, including the opportunity to take part in hackathons and mentoring schemes. I advocate at senior level so that Data Scientists can use their skills to get the most insight out of our data."
        },
        {
            "text": "Data is recognised as a Profession under the DDaT Profession Capability Framework. Working within this framework, the Data Profession ensures there are clear career paths for every role and access to relevant continuous professional development for our Data Scientists."
        },
        {
            "text": "Personally, I’ve been pleased to see increased support and visibility of women in senior leadership roles, especially in technical areas. We have some way to go, but it’s great to see my senior management team of lead data scientists being 50:50 split by gender. It’s also been great to be so well supported as I prepare for maternity leave – I know that I have been treated fairly and will have a great role to return to after my leave is complete."
        },
        {
            "heading": 2,
            "text": "What's it like to start work as a Data Scientist at the Home Office?: Seb Creighton"
        },
        {
            "text": "During the second lockdown from early November to early December 2020, I started my role not only in the Civil Service, but also the Home Office. Once security clearance was granted, I was given a starting date, and then a couple of weeks was needed to arrange accounts and IT. I then received the official job offer and contract."
        },
        {
            "text": "During this time, my line manager arranged plans for the first day with me, discussing working hours and etiquette."
        },
        {
            "text": "The induction spanned over my first weeks. My previous tech background and skills were mapped to some of the projects I became involved in. The main elements of my tailored induction plan were:"
        },
        {
            "text": "My manager connected me with other Data Scientists and diverse communities both inside the Home Office and externally too, such as groups in the Government Statistical Service (GSS).  It’s been helpful to hear a wide range of opinions and find out what other work is being done in Data Science."
        },
        {
            "text": "I was eager to develop my technical skills during my onboarding process. I was encouraged to expand my previous technical knowledge of SQL and Python through Home Office’s recommended free resources such as Datacamp. I learnt so much on the Python Programmer pathway, which includes courses like Git."
        }
    ]
}