{
    "url": "https://insidehmcts.blog.gov.uk/2023/06/01/benefits-of-international-collaboration-on-modernising-justice-systems/",
    "title": "Benefits of international collaboration on modernising justice systems",
    "authors": [
        "Amar Morjaria - Senior Project Manager, HMCTS Strategy and Change"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Customer experience and research",
        "Digital services"
    ],
    "pub_date": "2023-06-01T13:05:48+01:00",
    "content": [
        {
            "text": "We know that effective court processes, which includes the use of technology, can significantly enhance access to justice as well as provide better support to the people using our services. Indeed, this is one of the drivers which underpins the HMCTS Reform Programme, currently reaching its final stages of completion."
        },
        {
            "text": "HMCTS is not alone in its ambitions to use technology to improve access and support. I’ve previously blogged about sharing our reform knowledge with the Indian justice system, who we’ve worked with on modernising justice systems, under MoJ’s Rule of Law Programme. The Indian e-Courts project, which started in 2005, shares a number of similar aims with our own reform programme."
        },
        {
            "text": "My last blog prompted an invitation from the Home Office to join a UK mission to a conference organised by UN Office on Drugs and Crime, Commission on Crime Prevention and Criminal Justice, held in Vienna last week."
        },
        {
            "text": "The event supports the UN Sustainable Development Goal 16 on access to justice for all and building effective, accountable and inclusive institutions at all levels."
        },
        {
            "text": "Alongside a High Court judge from England, and counterparts from the Indian Department of Justice and Supreme Court Committee, the panel session discussed video evidence and the use of video hearings in the wider context of digital reform."
        },
        {
            "text": "We demonstrated the benefits of working together to develop innovative solutions to shared challenges, improving the efficiency and fairness of our criminal justice systems."
        },
        {
            "text": "Panel Chair Justice Jeremy Johnson, Judge of the High Court of England & Wales, highlighted his experiences of the progress and benefits of using video evidence in court:"
        },
        {
            "text": "The session was sponsored by EU, Germany, Ghana, Thailand, Canada and Australia. The week-long conference provided further opportunities for bilateral engagement with a number of countries, international justice organisations and the UK mission to the UN in Vienna."
        },
        {
            "text": "These engagement opportunities not only help to promote international cooperation, exchange expertise and foster best practice, but raise the profile of the UK justice system around the world."
        },
        {
            "text": "HMCTS was also represented last week at the European Cyberjustice Network Conference about digital civil courts."
        },
        {
            "text": "Development Director, Jason Latham reflected on the importance of our participation:"
        },
        {
            "text": "For more information about HMCTS’ involvement in international work please contact the communications team in the first instance."
        }
    ]
}