{
    "url": "https://lifeathmrc.blog.gov.uk/2023/06/01/celebrating-pride-month-at-hmrc-stephs-story/",
    "title": "Celebrating Pride Month at HMRC: Steph’s story",
    "authors": [
        "Steph"
    ],
    "categories": [
        "Diversity and inclusion",
        "Employee support",
        "General"
    ],
    "pub_date": "2023-06-01T08:05:54+00:00",
    "content": [
        {
            "text": "Psst, can I let you into a secret?"
        },
        {
            "text": "I don’t really like having a lot of attention. By preference, I’m quiet and like things very low-key. If there’s a party, I either don’t go or you can find me in the kitchen talking to the cat/dog/pot plant."
        },
        {
            "text": "So, what am I doing writing a blog on visibility?"
        },
        {
            "text": "Good question."
        },
        {
            "text": "I’m doing my own little bit to show that being a lesbian (or whatever term you prefer) is fine, normal (if not completely common) and definitely not a barrier to whatever you want to do or achieve at HMRC."
        },
        {
            "text": "Can I honestly say that?"
        },
        {
            "text": "Yes, 100%. I’ve been here 10 years now and the issues I have encountered have been mild, very isolated, and have not impacted my career in any way. In fact, I have achieved a few promotions to my current Deputy Director role and had a lot of good roles and fabulous colleagues along the way."
        },
        {
            "text": "The 15 years prior to joining HMRC varied greatly. In my early career as a civil servant, I definitely encountered homophobia and hostility and have had to fight prejudice of various kinds. But, at HMRC, I can say with complete honesty that being gay is no barrier to achievement."
        },
        {
            "text": "But we cannot be complacent. We need to ensure we do not lose the progress of the last decade or so. Lesbians, gay women, sapphics, we need to be much better about shouting out and supporting ourselves. So, let’s start now and worry about ourselves as much as everyone else: affix your own mask before helping others, as the traditional airline safety message says!"
        },
        {
            "text": "As a wider HMRC community we need you to see us in our lovely rainbow colours but not treat us as “other”. We come in as many hues as any other part of the community and, if as a group we’re a little quieter, we still need your help to include us, support us and lift the whole of HMRC up as a result. So, when you meet someone new, please don’t assume their gender or, if they have a partner, the gender of that partner. Don’t stand for “jokes” or “banter” that probably don’t feel that way for some of us. Keep HMRC, and the Civil Service, a welcoming, wonderful and diverse place to work."
        },
        {
            "text": "If making that happen means me scuttling out from under my West Country rock to blink in the spotlight for a few minutes, then it will be worth it."
        }
    ]
}