{
    "url": "https://ukhsa.blog.gov.uk/2023/06/01/come-rain-or-shine-adverse-weather-matters-for-our-health/",
    "title": "Come rain or shine, adverse weather matters for our health",
    "authors": [
        "Lea Berrang Ford",
        "Agostinho Moreira Sousa"
    ],
    "categories": [
        "Climate change",
        "Health in a changing climate",
        "UKHSA science"
    ],
    "pub_date": "2023-06-01T10:21:57+01:00",
    "content": [
        {
            "text": "Adverse weather matters for our health: there is a strong evidence base showing us that periods of very hot or cold weather or flooding present a wide range of direct and indirect health risks."
        },
        {
            "text": "We know that climate change is making these problems worse, increasing the number of adverse weather events, with these events becoming more frequent and intense in the years ahead."
        },
        {
            "text": "But there’s plenty we can do to tackle this problem, by taking action to reduce health risks and adapting our behaviours and environments to our changing climate."
        },
        {
            "text": "Here at UKHSA, we play a key role in providing evidence and advice to help policy makers, organisations and individuals do just that."
        },
        {
            "heading": 2,
            "text": "The risks to our health from adverse weather"
        },
        {
            "text": "Summer is approaching and most of us will be looking forward to some sunshine and warmer weather."
        },
        {
            "text": "But as scientists working to protect people’s health, we know that not everyone copes well as the temperature rises, and periods of hot weather are linked to increasing health risks, as well as increased pressure on our health and social care system."
        },
        {
            "heading": 2,
            "text": "The health hazards of heat"
        },
        {
            "text": "Temperatures above 25ºC are associated with excess heat-related deaths, with higher temperatures associated with even greater numbers of excess deaths. The risks are greatest for people with certain conditions:"
        },
        {
            "text": "At 27ºC or over, people with impaired sweating mechanisms find it especially difficult to keep their bodies cool (for instance the very young, people with long term health conditions or older people, particularly people taking certain medications)."
        },
        {
            "text": "Heat can exacerbate long term cardiovascular and respiratory conditions, but equally increase the chances of other serious and sudden health issues such as heart attacks, strokes or breathing problems."
        },
        {
            "text": "The impacts on mortality during periods of hot weather are generally seen within 24 hours of the onset of high temperatures, with daily deaths increasing as the temperature increases and then falling back as temperatures fall back to their average levels."
        },
        {
            "text": "During periods of hot weather last year – the hottest on record – we saw thousands of heat-related deaths, each one a human tragedy, also leading to significant pressure on our health and care services."
        },
        {
            "heading": 2,
            "text": "The dangers of cold weather"
        },
        {
            "text": "There is an equally strong evidence base on the risk to health from cold weather, again with older people (people of 65 and over) and those with some long-term medical conditions facing the greatest risk. Fuel poverty exacerbates this situation."
        },
        {
            "text": "Direct effects of cold weather include: increased incidence of heart attacks, strokes, respiratory disease, influenza, falls and injuries and hypothermia."
        },
        {
            "text": "The onset of cold weather leads to an almost immediate increase in weather-related deaths which can remain raised for up to four weeks after. Deaths from cardiovascular conditions peak first, followed by stroke and then respiratory conditions. Negative health effects start at relatively moderate outdoor mean temperatures of 4 to 8°C."
        },
        {
            "heading": 2,
            "text": "Flooding and health"
        },
        {
            "text": "Flooding also has extensive and significant impacts on health including direct effects like skin and gut infections from exposure to contaminated flood water."
        },
        {
            "text": "And whilst the immediate and direct impacts of very hot or cold weather and flooding are perhaps the most obvious, we should not forget the longer term or indirect impacts."
        },
        {
            "text": "Heat, cold and flooding are linked to mental health problems for instance (in England, most of the health burden associated with flooding is due to the impacts of flooding on mental health and wellbeing, ranging from stress and anxiety to serious long-term impacts)."
        },
        {
            "text": "Living in cold homes is linked with reduced education and employment attainment."
        },
        {
            "text": "Both cold weather and flooding are linked to respiratory disease from mould and damp."
        },
        {
            "heading": 2,
            "text": "What’s the impact of our changing climate?"
        },
        {
            "text": "The last decade has seen warmer and wetter weather than previous decades. It is projected that numbers of heat related deaths will triple by 2050, with the hottest summers on record that we have observed in recent years, becoming simply “normal” summers."
        },
        {
            "text": "Last year in Lincolnshire the temperature reached 40.3C exceeding the previous UK record by 1.6C, and the hot period in July saw the Met Office issue its first ever red warning for extreme heat."
        },
        {
            "text": "At the time Dr Mark McCarthy of the Met Office National Climate Information Centre noted that “In a climate unaffected by human-induced climate change, it would be virtually impossible for temperatures in the UK to reach 40°C but climate change is already making UK heatwaves more frequent, intense and long-lasting.”"
        },
        {
            "text": "In terms of flooding, the third UK Climate Change Risk Assessment in 2021 identified flooding as one of the most important climate change adaptation challenges facing the UK. In all future climate change scenarios, direct and indirect flood risks are projected to rise over the course of the 21st century."
        },
        {
            "text": "Many people might be wondering if a warming UK climate means that there will be less illness and death caused by cold weather in future."
        },
        {
            "text": "The effects of climate change on cold-related illness and deaths could have some benefits, but projections suggest that the total number of cold-related deaths each year is unlikely to decline significantly due to issues like poor housing and fuel poverty."
        },
        {
            "text": "This means that even though average temperatures are expected to increase, cold will remain a significant public health problem in the years to come."
        },
        {
            "heading": 2,
            "text": "Protecting communities and public services from adverse weather"
        },
        {
            "text": "An important role for UKHSA is to monitor the health effects of adverse weather, and our changing climate more generally, and provide advice and guidance on how we can adapt to meet these challenges head on."
        },
        {
            "text": "It’s really important to reinforce that the harm to health associated with adverse weather is not inevitable. There are things we can do all year round, and during periods of adverse weather, to minimise the impact."
        },
        {
            "text": "We recently published a new Adverse Weather and Health Plan as part of our commitment under the second National Adaption Programme for the UK to bring together and improve existing guidance on weather and health."
        },
        {
            "text": "We also publish a series of ‘action cards’ advising the NHS, social care organisations and professionals about the actions they should take to keep the public healthy and safe under different levels of alert."
        },
        {
            "text": "Our guidance also includes advice that the public can act on to stay safe and as always, our most important call to action during adverse weather is to look out for people who might struggle to cope, particularly older people, young children and people with long term health conditions."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "Across the world climate change poses one of the greatest health security threats we face, potentially impacting the air we breathe, the quality and availability of our food and water, the risk of infectious diseases and wider impacts on our mental health and wellbeing."
        },
        {
            "text": "This summer UKHSA will publish the Health Effects of Climate Change, a landmark report produced periodically and last published in 2012. This will bring together the latest UK climate change projections and an assessment of the range of health risks."
        },
        {
            "text": "And alongside publishing this evidence on climate health threats, UKHSA’s new Centre for Climate and Health Security will continue to provide a focus for our climate health partnerships, offering scientific advice and support to ensure that the impacts of climate change are considered and embedded in the design and delivery of climate change policies across local and national government and the NHS as well as with international partners."
        }
    ]
}