{
    "url": "https://hmlandregistry.blog.gov.uk/2023/06/01/meet-the-land-registration-lawyers/",
    "title": "Meet the land registration lawyers",
    "authors": [
        "Nicole Eastwood, Deputy Director of Land Registration Lawyers"
    ],
    "categories": [
        "Law and practice",
        "Working at HM Land Registry"
    ],
    "pub_date": "2023-06-01T15:19:22+01:00",
    "content": [
        {
            "text": "Land registration lawyers play a vital role in ensuring applications are completed correctly and our practice and procedures are being followed accurately. As part of the Service Delivery Group, the team advise on complex, sensitive, and contentious land registration applications in order to provide the very best services to our customers."
        },
        {
            "text": "Some members of our current team, Jonathan, Andrea and Kate, tell us about their day-to-day roles and why they decided to join HM Land Registry."
        },
        {
            "heading": 2,
            "text": "Jonathan Hughes, Assistant Land Registrar"
        },
        {
            "text": "Joined HM Land Registry in 2022."
        },
        {
            "text": "You’ve recently joined HM Land Registry having spent more than 25 years working in private practice. What persuaded you to make the move?"
        },
        {
            "text": "Despite gaining significant experience within the private practice, I knew for quite some time that I wanted a new challenge. I knew I had a lot more to give and I wanted to put the vast legal skills that I’d learned over the years to better use. I spent a lot of time researching the type of role I wanted and when I saw the Assistant Land Registrar role advertised, I knew that was exactly what I was searching for."
        },
        {
            "text": "What do you enjoy most about your role?"
        },
        {
            "text": "I really enjoy the variety of the complex legal points. Finding the right answers and making the decision on how to proceed can be difficult, however, I’m fortunate to work with colleagues who are extremely supportive of each other and we’re able to seek advice and discuss practice and procedures to inform our decisions."
        },
        {
            "text": "Secondly, no two days are ever really the same. I could start by considering a complex property fraud referral then the next challenge might involve referring to a legal easement. I enjoy the variety and I’m happy and engaged in my work."
        },
        {
            "heading": 2,
            "text": "Andrea Barr, Land Registrar"
        },
        {
            "text": "Joined HM Land Registry in 1997."
        },
        {
            "text": "You joined HM Land Registry as an Assistant Land Registrar and you now currently manage the lawyer team at our Birkenhead office – can you tell us a bit about what that involves?"
        },
        {
            "text": "As a Land Registrar, myself and my team undertake new recruits into their training. It is intensive – normally taking between 9-12 months, with each lawyer having a dedicated training manager and support who takes them through our training syllabus. Each lawyer’s training is carried out in line with our Land Registration Academy principles, following a standardised training programme with support tailored to their individual needs. The emphasis is on learning by doing, so lawyers are very quickly advising on land registration applications, under the watchful eye of their trainer."
        },
        {
            "text": "In addition, I’m the Change Facilitator for any change affecting the whole of the Land Registration Lawyer group and I’m also the Sustain Lead for Continuous Improvement. It keeps me busy!"
        },
        {
            "heading": 2,
            "text": "Kate Upton, Assistant Land Registrar"
        },
        {
            "text": "Joined HM Land Registry in 2022."
        },
        {
            "text": "Why did you apply to HM Land Registry?"
        },
        {
            "text": "I qualified as a barrister in a general common law set undertaking crime, civil and family work before transferring to HM Courts and Tribunals Service where I worked as a legal adviser in the magistrates courts dealing with criminal matters. Fourteen years later, I wanted a new challenge and to develop my legal skills in a different area of law. Joining HM Land Registry gave me the perfect opportunity to do this, and I haven’t looked back since."
        },
        {
            "text": "Can you tell us a bit about your day-to-day role?"
        },
        {
            "text": "Each day is incredibly different, but a typical day consists mainly of casework – this can be either new cases or matters previously advised on as well as taking verbal referrals from colleagues across the organisation. The work is both intellectually challenging and varied meaning that I am always learning and developing."
        },
        {
            "text": "What would you say to others who may be considering applying to HM Land Registry? "
        },
        {
            "text": "I would encourage anyone thinking about joining HM Land Registry to apply, even if, like me, they don’t come from a property law background. The in-house training is extremely comprehensive and there is plenty of support and guidance available. Not having any previous property law experience sometimes feels like it helps as I find I often approach problems and issues from a different angle. The work is interesting, varied and challenging, and there are regular opportunities to develop your legal knowledge and skills by taking on work from other parts of the organisation."
        },
        {
            "heading": 2,
            "text": "How do I apply?"
        },
        {
            "text": "We’re currently looking for 12 assistant land registrars to join our Land Registration Lawyer team across six of our offices – Croydon, Hull, Leicester, Peterborough, Telford and Weymouth."
        },
        {
            "text": "If you’re qualified to practise as a solicitor or barrister in England and Wales (or to be a Fellow of the Chartered Institute of Legal Executives by the date of your appointment), check out our current roles on Civil Service Jobs."
        }
    ]
}