{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/06/01/nowt-so-queer-as-design/",
    "title": "Nowt so queer as design",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2023-06-01T16:00:58+01:00",
    "content": [
        {
            "text": "When the opportunity to work at the Department for Education arose many years ago, I greeted it with a sense of morbid curiosity. On the one hand education is something I treasure and it is the most progressive of all public services; on the other hand it is an organisation that administrated a system which traumatised me as child."
        },
        {
            "text": "Section 28 prohibited the promotion of homosexuality in schools from 1993 to 2003. From Margaret Thatcher’s conference speech in 1987 where she protested that children were being “taught that they have an inalienable right to be gay …are being cheated of a sound start in life” (for which she received an 11-minute standing ovation), through to David Cameron apologising in 2009, “I’m sorry for Section 28… we got it wrong”, this is a tragic story that marginal communities might recognise. But it is not the purpose of this post to set out the story of Section 28 and the damaging effect it had on the lives of millions of LGBTQ+ people in the UK. Twenty years after these regulations were quashed, I think it is fair to say that the British public currently have different attitudes and feel disquiet when they see the same policy enacted elsewhere, like in Putin’s Kremlin."
        },
        {
            "text": "Because of this early experience, I did have to justify working in government to myself, and I have stayed. I’m certainly not the first person to weigh up this dilemma. There have been many generations of thinkers who have grappled with how queer people might deal with the state. Personally, I believe that you must participate in the system to affect change."
        },
        {
            "text": "So in that spirit, I offer queer people two ways that you can shape the future of our society through design …and not forgetting our queer allies, a call for action for you too."
        },
        {
            "heading": 2,
            "text": "Queer in the most inclusive sense"
        },
        {
            "text": "Queer originally meant ‘not normal’ and became a derogatory term in Victorian times, but it has now been reclaimed by the community (although quite when and how to use it is a live debate). It commonly refers to all those who don’t fit within societal norms of sexual orientation and gender identity. In this post I mean it in the widest sense. Think of all nine of the protected characteristics. Everyone fits into them somewhere – a straight, white, 53-year-old man has gender, sexual identity, age and ethnicity. However, if you feel that you don’t completely fit in the mainstream norm, then you might consider yourself a little bit queer. Here are a couple of reasons why you might be a powerful agent for change in government."
        },
        {
            "heading": 2,
            "text": "Necessity is the mother of invention"
        },
        {
            "text": "Queer people often become experts in failure. For LGBTQ+ people living in a straight (heteronormative and cisnormative) world, they can feel they need to conform to the standards of others to access what society has to offer, so they must adapt. That might be through creating an ‘outsider’ role or space, or they might have to iterate their behaviour or lifestyle to fit in."
        },
        {
            "text": "Here is poet Ocean Vuong speaking about queer failure..."
        },
        {
            "text": "Of course, creating a society where outsiders feel like they have a place and a stake is the aspiration of many people, but it is often not the lived experience of those outsiders. One of the by-products of this survival instinct to adapt is that LGBTQ+ people are the masters of re-invention."
        },
        {
            "text": "These are learned and practiced design skills that often don’t come readily to other people because ‘the rules’ already work for them."
        },
        {
            "text": "The vast majority of what governments do is system stewardship: it’s keeping the lights on, it’s maintaining the status quo - and there is no doubt how important that is in the turbulent times we live in. But there is also a smaller section of public work: to make and re-make public policy and services. This is where design skills are important. These are skills like empathy, creative response to adversity, trial and error – queer people have these skills in spades."
        },
        {
            "heading": 2,
            "text": "Outside-in perspective"
        },
        {
            "text": "In July 2017, the government conducted a survey to learn about the experiences of LGBTQ+ people in the UK. Over 108,000 people participated, making it the largest national survey of LGBT people in the world ever. It found that:"
        },
        {
            "text": "These outcomes are far worse for LGBTQ+ people than for straight people in the UK. But why?"
        },
        {
            "text": "Part of the answer, particularly those that relate to public services, might lie in the how the Civil Service has at times gone about its work in the past. In her 2020 report on the Windrush scandal, Wendy Williams concluded that the Home Office demonstrated “institutional ignorance and thoughtlessness towards the issue of race and the history of the Windrush generation”. Home Office accepted these findings and have written on this blog about how they are responding. Might there be lessons here for how to treat people with other types of protected characteristics too?"
        },
        {
            "text": "She reported that, “It is not clear that the department has learned the wider lesson that it should be engaging meaningfully with the communities it serves. The true test will be whether stakeholders, including those considered to represent critical voices, are firstly invited to participate in developing the department’s policies, and also in designing, implementing and evaluating them. And, while acknowledging that consensus might not always be possible, the test will also be whether the range of stakeholders, including community groups, consider they have been heard”."
        },
        {
            "text": "Clearly co-designing public policies and services with the communities they are targeted at would help, but it is just as important to ensure that the teams of officials who make those policies and services mirror the characteristics of the communities they serve. This acts as a safety valve for ignorance."
        },
        {
            "text": "Travis Alabanza’s 2023 Royal Court Theatre show, Sound of the Underground, explores the tension between the public being interested in a community (in this case queer drag performers) and the other reality of their lived experience. The show rails against RuPaul’s Drag Race which has created unprecedented demand for drag performance, but those performers now feel hostage to an army of hen parties and (as the show puts it) their ‘love of bingo and vomiting prosecco on each over brunch’. There is now a broader public understanding of drag but it is superficial, and the original subversive, perhaps healing, purpose of its performance is being lost."
        },
        {
            "text": "Similarly, well-meaning officials might have an appreciation of the lives of other types of people, but that is a far cry from the actual lived experience of those people themselves. Public services for the Windrush generation and LGBTQ+ people were often built on general assumptions and rules of thumb about the public that that are not true for those specific communities, so they can fail them."
        },
        {
            "text": "When you consider the type of choices that governments are making, you might recall your economics lessons on the different ways to treat people. The distinction between horizontal and vertical equity goes right back to Aristotle, who said “equals should be treated equally and unequals unequally”. For example, all children get free education (horizontal equity), some children get extra funding for their education like those with special needs (vertical equity). This is a fundamental basic for how we divide the equity share within our society. People in the Civil Service are generally well equipped to develop policies and services on the basis that everyone gets the same, but where they have to differentiate those services for different people it gets much more difficult. This is where it is important to be conscious of assumptions and biases and to prove or disprove them during the policymaking process."
        },
        {
            "text": "Where this is done poorly it can lead to public services seeming like they require LGBTQ+ people to mimic heteronormative and cisnormative lives to engage with them. This is the Hobson’s choice that Renton ranted against in Trainspotting:"
        },
        {
            "text": "Queer people are different, have different needs and need to be treated differently. One of the best ways to influence the outcomes for queer people is through representation."
        },
        {
            "text": "And our system of government does attempt to do that. Decision makers (our elected representatives) reflect society through the democratic process. We need to ensure that their advisers and those who operationalise their strategic decisions (the officials) also reflect the characteristics of the communities they serve – queer people helping to make public services that are used by queer people."
        },
        {
            "heading": 2,
            "text": "Two good reasons you are needed"
        },
        {
            "text": "Let’s pause and reflect. Here are the two ways in which queer people might find they can have an impactful public design career (…and these are notes to myself, just as much as for anyone else!):"
        },
        {
            "heading": 2,
            "text": "We need allies for queer people"
        },
        {
            "text": "The Civil Service, historically, does not have a great record on being a friend to queer people. Until as recently as 1991, the Civil Service had a checklist for “spotting a homosexual” (for your information, they are always smoking and going to the theatre!), and LGBTQ+ people were deemed unsuitable for some official roles."
        },
        {
            "text": "Civil Service now says it wants to become the UK’s most inclusive employer. It certainly has made great progress towards that goal over the past 30 years. But it is not good enough to only have equal opportunities recruitment (which it does)."
        },
        {
            "text": "Alongside the brilliant queer community network inside Civil Service, we need allied officials to create the conditions where different people can thrive and their ideas can be included. There are plenty of examples of outsider ideas being lost or nearly lost because they came from people who don’t fit the normal mould – this is how privilege operates."
        },
        {
            "text": "Action for allies: as an ally you should take positive action to create conditions where all types of officials can fully participate, so you can get most value from their work."
        },
        {
            "heading": 2,
            "text": "Join government design"
        },
        {
            "text": "Governments everywhere need more queer designers because they are practiced in design and because they represent a significant part of society. Ultimately, this leads to governments making better public policies and services that provide more public value and more meaningful outcomes for citizens."
        },
        {
            "text": "Now of course there are many ways in which queer designers (or wannabe designers) can realise a better future for queer people. You might choose the arts like Ocean Vuong or Travis Alabanza. You might even try stepping into futures research like Faraoyść who are helping communities to see beyond oppression and imagine what a liberated, joyful future might hold for them. There is a myriad of possibilities."
        },
        {
            "text": "But I want to make the case clear for another option: for you to be part of the team who develop public policy and services. To me, this seems the most direct action you can take to help ensure that queer people get what they need from society. Come and join …and be yourself."
        },
        {
            "text": "There is a generation of survivors of Section 28 who are still trying to make sense of what happened to them. This often starts with telling their own story, like in the Don’t Say Gay film that is currently being crowdfunded and made. My own Section 28 journey has felt far more manageable when I’ve been proactive. I’ve done that by spending time shaping public policy and services. I also went back to my old secondary school as a governor and co-designed their mental health service with today’s students, and helped establish the school’s first LGBTQ+ staff society (the absence of having one being a hangover of Section 28, even 20 years after the law was abolished). Maybe this is a salve, or perhaps insurance."
        },
        {
            "text": "Queer design can and should be used for the good of everyone, so I would encourage you to find your own way to make a difference and know that you can make a great impact in the Civil Service."
        }
    ]
}