{
    "url": "https://nationalscreening.blog.gov.uk/2023/06/01/progress-on-practical-projects-to-support-the-uk-nsc-in-making-newborn-blood-spot-screening-recommendations/",
    "title": "Progress on practical projects to support the UK NSC in making newborn blood spot screening recommendations",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-06-01T11:32:10+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) set up the blood spot task group (BSTG) to help identify practical and innovative approaches to the development and evaluation of evidence, and the facilitation of research, in newborn blood spot screening."
        },
        {
            "text": "The group’s work will support the UK NSC in making robust screening recommendations within the constraints of limited evidence bases."
        },
        {
            "text": "BSTG members have a wealth of experience from a range of disciplines and organisations, including public and patient voice (PPV) groups."
        },
        {
            "text": "The meeting focused primarily on one of these projects:"
        },
        {
            "text": "Three speakers gave thought-provoking presentations on the challenges of getting good outcome data for conditions the UK already screens for – sickle cell and thalassaemia, congenital hypothyroidism, maple syrup urine disease, homocystinuria, isovaleric acidaemia and glutaric aciduria type 1."
        },
        {
            "text": "The meeting also received updates on progress of 3 of its other core projects:"
        },
        {
            "text": "The next BSTG meeting is due to take place this summer and we will again publish a summary note of the discussions shortly afterwards. Watch this space."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}