{
    "url": "https://dwpdigital.blog.gov.uk/2023/06/01/successful-shortlisting-at-the-digital-leaders-100-awards/",
    "title": "Successful shortlisting at the Digital Leaders 100 Awards",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Digital Leaders",
        "Digital With Purpose",
        "DWP Digital"
    ],
    "pub_date": "2023-06-01T14:42:06+01:00",
    "content": [
        {
            "text": "DWP Digital is proud to announce the shortlisting of 6 projects and individuals at this year's Digital Leader 100 Awards (DL100). The DL100 list, in its 11th year, celebrates the teams and individuals who are working hard behind the scenes to secure the UK’s Digital Transformation. This will also be the first time the awards have been held in the north.  "
        },
        {
            "text": "There are 11 categories including The People’s Choice Award, offering the public the opportunity to vote on their favourite finalist. We are proud to announce that we have 6 shortlisted entrants across 4 categories.  "
        },
        {
            "heading": 2,
            "text": "The nominees "
        },
        {
            "heading": 3,
            "text": "Digital Public Service Innovation of the Year (Product or Service)   "
        },
        {
            "heading": 3,
            "text": "AI and Data Innovation of the Year (Product or Service)  "
        },
        {
            "heading": 3,
            "text": "Young Leader of the Year    "
        },
        {
            "heading": 3,
            "text": "Digital Leader of the Year "
        },
        {
            "text": "“Winning this award would inspire many others like me to continue working hard and pursuing your dreams. It would demonstrate a success story, that women leaders and women from ethnic minority backgrounds can get recognised for our hard work and you can push through the barriers.” "
        },
        {
            "heading": 2,
            "text": "A note from the CDIO "
        },
        {
            "text": "DWP Digital CDIO Rich Corbridge said: “I am delighted to see so many of our wonderful people and projects shortlisted in this year's awards. It’s a true testament to the hard work, dedication and innovation of our teams and individuals.  "
        },
        {
            "text": "\"Our people provide digital transformation that enables millions of users to access the help, advice and financial support they need."
        },
        {
            "text": "\"I’m looking forward to attending the prestigious Digital Leaders 100 event in Leeds on June 22. This is the first time the ceremony has taken place in the North and is an opportunity to celebrate the achievements and hard work the UK’s digital leaders.” "
        }
    ]
}