{
    "url": "https://cddo.blog.gov.uk/2023/06/01/the-digital-leaders-download/",
    "title": "The Digital Leaders’ Download",
    "authors": [
        "Megan Lee Devlin, Chief Executive, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT community",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-06-01T10:13:29+01:00",
    "content": [
        {
            "text": "Last week saw the launch of Digital Leaders’ Download, a new interview series in collaboration with PublicTechnology, where I’ll be interviewing some of government’s most impressive digital leaders such as some of our Permanent Secretary Mission Sponsors. These are Jo Farrar, the former Second Permanent Secretary to the Ministry of Justice who has been recently appointed Chief Executive at NHS Blood and Transplant; Cat Little, the Head of the Government Finance Function at HM Treasury; and Sir Ian Diamond from the Office of National Statistics."
        },
        {
            "text": "To kick off the series, I was interviewed by PublicTechnology Editor Sam Trendall and discussed the raison d’etre of the Central Digital and Data Office (CDDO): to put in place the conditions for the digital transformation of government by delivering our Transforming for a Digital Future Roadmap 2025. "
        },
        {
            "heading": 4,
            "text": "From disruptive to collaborative"
        },
        {
            "text": "There are six defined missions of the Roadmap, and crucial to delivery is instilling a collaborative approach across government to deliver digital transformation. As I mentioned in my interview with Sam,"
        },
        {
            "text": "We want to create that shift from digital being a disruptive force, to being collaborative partners that help to translate the government priorities into digital tools, solutions and services that help the public, and civil servants, access the outcomes they need quicker and with greater precision."
        },
        {
            "text": "In my first interview with Jo Farrar she talks about how at the Ministry of Justice they are tackling legacy tech, an issue common with all government departments and which can create obstacles to transformation. "
        },
        {
            "text": "You can read my interview in PublicTechnology and find out more about the Digital Leaders’ Download, which will be published on a monthly basis. "
        }
    ]
}