{
    "url": "https://educationhub.blog.gov.uk/2021/08/07/exam-appeals-what-can-i-do-if-i-think-my-grade-is-wrong-how-do-i-appeal-what-will-happen-if-i-appeal-your-questions-answered/",
    "title": "Grade Appeals: What can I do if I think my grade is wrong? How do I appeal? What will happen if I appeal? Your questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2021-08-07T15:37:19+01:00",
    "content": [
        {
            "text": "Earlier this year, the government announced that students will not take formal GCSE, AS and A level exams this summer and will instead be awarded grades determined by their teachers' judgements, based on a range of evidence like mock exams, coursework, in class tests and more."
        },
        {
            "text": "Schools and colleges will take multiple steps to make sure these grades reflect students’ performance. Teachers have received clear guidance and support with grading and making objective decisions to enable grades to be fair."
        },
        {
            "text": "There is also a rigorous system to ensure fairness is in place, including checks in schools and colleges, and by exam boards."
        },
        {
            "text": "Students will have been made aware of the evidence teachers used to determine grades so students should have been able to raise any issues, errors or circumstances relating to particular evidence before grades were submitted."
        },
        {
            "text": "For more information on how grades will be awarded and the process that will ensure they are fair, click here."
        },
        {
            "text": "If a student thinks an error has been made in their grade, an appeals system will be in place as a safety net for exceptional circumstances, and to fix any genuine errors that were not identified earlier in the process."
        },
        {
            "text": "Here we answer students’ questions:"
        },
        {
            "heading": 3,
            "text": "What can I do if I think there has been an error with my grade?"
        },
        {
            "text": "Teachers will have told you what evidence is being used to determine your grades and you would have had the chance to raise any issues before your grades were submitted. Schools and colleges should have taken into account any reasonable adjustments and access arrangements."
        },
        {
            "text": "If you think a grade is incorrect when you receive your results, speak to your school or college in the first instance and request a centre review – an internal review by your school or college - so they can check for any errors."
        },
        {
            "text": "If you still think your grade is incorrect after your school or college has checked it, you can ask them to appeal to the exam board. You should be aware that on appeal, grades could go up, down, or stay the same and the exam board’s decision will be final."
        },
        {
            "text": "You should consider carefully if appealing is the right course of action for you. An appeal will only be successful if either an error is found or the grade awarded or the selection of evidence are found to be an unreasonable exercise of academic judgement."
        },
        {
            "text": "The exam boards will not be able to consider appeals that are based solely on differences of opinion. If you want to improve your grade you might want to consider entering for the autumn exam series."
        },
        {
            "heading": 3,
            "text": "If I think there has been an error and want to appeal my grade, do I do that with my school or college or exam board?"
        },
        {
            "text": "You should raise any request with your school or college who have been encouraged to support students and follow the process that your school or college has defined."
        },
        {
            "text": "Your school or college will conduct a centre review to check if there were any administrative errors when the grade was submitted and to check they have followed their procedures correctly.  If you still think your grade has been awarded in error after the result of the centre review, your school or college must submit an appeal to the exam board on your behalf, if you ask them to do so."
        },
        {
            "text": "Depending on the grounds submitted the exam board will review the process followed and/or whether the overall grade awarded or the selection of evidence on which the grade was determined was a reasonable exercise of academic judgement."
        },
        {
            "text": "In some cases, the exam board may need to ask your school or college to reassess your grade. If they find there was an unreasonable exercise of academic judgement, they will determine the alternative grade if necessary and inform the centre."
        },
        {
            "text": "Once the grade has been issued after the review, it will be final. If the final grade is lower than the original teacher assessed grade, it will go down. If the result is higher, it will go up."
        },
        {
            "heading": 3,
            "text": "What might happen to my grade during the centre review and appeals process?"
        },
        {
            "text": "If you request a centre review or an exam board appeal, there are a range of possible outcomes:"
        },
        {
            "text": "Once a finding has been made you cannot withdraw your request for a centre review or appeal. If your grade has been lowered, you will not be able to revert back to the original grade you received on results day."
        },
        {
            "heading": 3,
            "text": "What are the deadlines for centre reviews and appeals?"
        },
        {
            "text": "There are priority and non-priority appeal routes. Priority appeals are only for students applying to higher education who did not attain their firm choice (i.e. the offer they accepted as their first choice) and wish to appeal an A level or other Level 3 qualification result. All other appeals must follow the non -priority route."
        },
        {
            "text": "For priority cases (where students have missed out on their ‘firm’ higher education choice and wish to appeal an A level or other Level 3 result), students should request a centre review by 16 August. For non-priority cases, students should request a centre review by 3 September. Please note these are suggested timescales only to enable centres to submit appeals within the awarding organisations’ deadlines. Centres may set their own deadlines for centre reviews so students should talk to their school or college about its deadline."
        },
        {
            "text": "Centres will need to submit priority appeals to the awarding organisation by 23 August 2021. Students should be informed of the outcome of priority appeals in most cases by 8 September 2021. If a centre submits a priority appeal after 23 August, awarding organisations will prioritise processing these as quickly as possible, but it will not be possible to guarantee an outcome by 8 September."
        },
        {
            "text": "Centres will need to submit non-priority appeals by 17 September 2021. Students should be informed of the outcome in most cases by the end of October."
        },
        {
            "heading": 3,
            "text": "Does that mean teachers and school staff are working over summer holidays for appeals?"
        },
        {
            "text": "In most cases subject teachers won’t be needed for centre review during the summer holidays, as much of the work needed can be prepared in advance of summer."
        },
        {
            "text": "In a minority of cases where a previously unforeseen issue or error arises, a teacher may need to input to help to resolve the appeal swiftly. This would only be in the summer for priority appeals – where a student needs the outcome of their appeal to take up their ‘firm’ higher education offer."
        },
        {
            "text": "We are incredibly grateful for teachers’ hard work to help students get their qualifications and exceptionally for this year, we are providing £75 for each priority appeal which exam centres can use to compensate staff for the work involved in processing those appeals this summer. "
        },
        {
            "heading": 3,
            "text": "How will this affect my university or college place?"
        },
        {
            "text": "If you have not met the conditions of your firm choice on a higher education course you are eligible for a priority appeal. You should submit your request for a centre review by 16 August to enable this process to happen swiftly. Centres may set their own deadlines for centre reviews so you should talk to your school or college about its deadline."
        },
        {
            "text": "UCAS has encouraged HE providers to move their advisory deadline to 8 September, giving students additional time to meet the academic terms of their offer. Students who do decide to appeal, should contact their preferred higher education provider to make them aware."
        }
    ]
}