{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/07/gse-opportunities-raeng-policy-officer-roles-x3/",
    "title": "GSE Opportunities : RAEng Policy Officer Roles ×3",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-08-07T14:36:54+01:00",
    "content": [
        {
            "text": "The Royal Academy of Engineering (RAEng) are looking for three high-calibre Policy Officers to them harness the power of engineering to build a sustainable society and an inclusive economy that works for everyone.  Live policy areas they are working on include: net zero and decarbonisation, resilience, risk and security, engineering and public health, digital and data sharing, safety and ethics of autonomous systems."
        },
        {
            "text": "As a Policy Officer in the Engineering Policy Team at the Academy, you will drive forward public policy with impact, underpinned by evidence-based engineering advice that will shape and influence government policy. You will draw upon the best expertise and insights from the NEPC, leaders in engineering through our Fellowship and have access to wider networks, such as our sister National Academies."
        },
        {
            "text": "The RAEng are looking for someone who can build connections and collaborate across professional boundaries, and proactively develop and nurture networks which span government, industry and academia, bringing a diversity of perspectives and expertise to strengthen our advice. A dynamic individual who will help us to collect, analyse and synthesise data and evidence from multiple sources and translate these engineering insights, evidence into credible and independent policy advice."
        },
        {
            "text": "The RAEng supports and encourages flexible working and would be happy to discuss working patterns including remote working with candidates. They are open to offering this post as a secondment opportunity for a minimum of 12-18 months."
        },
        {
            "text": "First interviews will be held week commencing 6th September via video conference (e.g. Zoom)."
        },
        {
            "text": "If you would like to know more, please download the role profile."
        },
        {
            "text": "Vacancy reference: 77 - Policy Officer, Various; closing date: 12:00 on Sunday 22nd August 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}