{
    "url": "https://educationhub.blog.gov.uk/2022/02/how-we-are-levelling-up-education-all-over-the-country/",
    "title": "How we are levelling up education all over the country",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Curriculum",
        "Families",
        "Schools",
        "Skills"
    ],
    "pub_date": "2022-02-01T00:01:35+00:00",
    "content": [
        {
            "text": "Every person should have the same opportunity to make the most of their abilities and succeed in life. But, currently, too many people’s chances of getting on in life are adversely affected by where they live."
        },
        {
            "text": "The government’s central mission is to reverse this unfairness and end the postcode lottery of life by spreading opportunity more equally across the country and bringing left behind communities up to the level of more prosperous areas."
        },
        {
            "text": "In education, ability is evenly spread but opportunity is not. We need to ensure that all children are able to access excellent schools, progress to high quality technical and higher education, and go on into good jobs."
        },
        {
            "text": "Here we explain what we’re doing to improve schools, deliver high quality training and level the educational playing field."
        },
        {
            "heading": 3,
            "text": "Every child will be given the best start in primary school and equipped with the skills that will help them flourish"
        },
        {
            "text": "At the moment, 35% of pupils leave primary school not meeting the expected standard in reading, writing and maths."
        },
        {
            "text": "By 2030 we want at least 90% of pupils to leave primary school meeting that expected standard. We will achieve this by ensuring we have excellent teachers, trained in the very best literacy and numeracy approaches in all areas of the country."
        },
        {
            "text": "We will support our teachers to deliver high standards for all pupils in every classroom, including supporting behaviour and attendance, alongside targeted support for those furthest behind due the pandemic, the most vulnerable and disadvantaged."
        },
        {
            "text": "Underpinning this, we will ensure a stronger school system, with every school able to access the support they need to improve."
        },
        {
            "text": "More detail will be set out by the Secretary of State in the Spring."
        },
        {
            "heading": 3,
            "text": "Currently there are big regional differences in schools – some people simply don’t access to a good school – and we will fix that"
        },
        {
            "text": "We’ve identified 55 ‘cold spots’ of the country where school outcomes are the weakest to target intensive investment, support and action to level up – these areas include Suffolk, Isle of Wight and County Durham."
        },
        {
            "text": "Here is the full list:"
        },
        {
            "text": "In these areas schools that have been judged less than Good in successive Ofsted inspections could be moved into strong multi-academy trusts, so they can better access the support they need to improve, including by attracting the best teachers."
        },
        {
            "text": "We’ll be asking teachers and other stakeholders for their views on how best to do this in the Spring."
        },
        {
            "heading": 3,
            "text": "We’re also making sure that more young people get the opportunity to learn the skills that will lead to jobs"
        },
        {
            "text": "Having the skills that employers value helps people get jobs and drives up their earning potential."
        },
        {
            "text": "We’ve made great strides but it’s still too often the case that young people leave education without skills that match the needs of employers."
        },
        {
            "text": "By 2030 we want 200,000 more people successfully completing high-quality training each year."
        },
        {
            "text": "This includes 80,000 more people completing courses in areas of England with the lowest skills levels. To better understand why these gaps in skills exist we’re establishing a new Unit of Future Skills, which will look at the data and evidence of where skills gaps exist and in what industries."
        },
        {
            "text": "Thousands more adults will also soon be able access free, flexible training and get the skills needed to secure careers in sectors including logistics, green, digital and construction as part of an additional £550million boost to expand popular Skills Bootcamps across the country."
        },
        {
            "text": "Skills Bootcamps form part of the government’s drive to support more adults to upskill or retrain and get a better job. Funding was settled in the Spending Review, and they offer free courses of up to 16 weeks, giving people the opportunity to build up sector-specific skills, with a fast-track to an interview with an employer. Recent figures show that more than half of adults who completed Skills Bootcamps between September 2020 and March 2021 went on to secure a new job, an apprenticeship, or boosted their career opportunities."
        },
        {
            "heading": 3,
            "text": "But we recognise that support must go beyond the classroom"
        },
        {
            "text": "Children’s life chances can be impacted by their circumstances."
        },
        {
            "text": "That’s why investing an extra £200 million to expand the Supporting Families programme in England, bringing total investment to £695 million, to improve the lives of up to 300,000 vulnerable families."
        },
        {
            "text": "The programme will help local areas tackle the challenges families face that can hold back children from attending and achieving at school or put them at risk of neglect or harm."
        },
        {
            "text": "Children and young people with special educational needs and disabilities (SEND), their families and caregivers will also be better supported with respite care and internship opportunities."
        },
        {
            "text": "Councils will be funded £30 million for the next three years to set up more than 10,000 additional respite placements, helping to provide families with short-term relief or breaks to give them a rest and supporting them with their caring responsibilities for vulnerable children."
        },
        {
            "text": "The new funding for respite and Supported Internships come alongside more than £45 million of continued targeted support for families and parents of children and young people with special educational needs and disabilities (SEND). These programmes will:"
        },
        {
            "text": " "
        }
    ]
}