{
    "url": "https://educationhub.blog.gov.uk/2022/02/if-we-give-children-a-quality-education-and-a-fair-shot-i-believe-they-can-and-will-do-incredible-things-children-and-families-minister-will-quince-on-new-send-support/",
    "title": "\"If we give children a quality education and a fair shot, I believe they can and will do incredible things\". Children and Families Minister Will Quince on new SEND support",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Families"
    ],
    "pub_date": "2022-02-01T14:50:36+00:00",
    "content": [
        {
            "text": "If we give children a quality education and a fair shot, I believe they can and will do incredible things."
        },
        {
            "text": "Talented, ambitious young people are found in every corner of our country, from the coasts of Cornwall to the streets of Derby and the villages of Northumberland."
        },
        {
            "text": "But the fact is that opportunity is not spread far and wide, and that those growing up in some areas – or with certain characteristics – are at a systemic disadvantage compared to others."
        },
        {
            "text": "Since my appointment in September I have had the pleasure to meet with many children and young people with special educational needs and disabilities (SEND) across the country. They have their whole lives in front of them. They are ambitious, talented, determined. They are like any other children or young people I meet, they just sometimes need more support in achieving their dreams and fulfilling their potential."
        },
        {
            "text": "My mission as Children’s Minister is to make sure they get this support, levelling the playing field and unlocking that future they rightly deserve."
        },
        {
            "text": "Already, we are ploughing huge sums into funding for children and young people with more complex needs, which will increase to £9.1 billion in the next financial year. When combined with great teachers who have high aspirations for these students, this investment can achieve incredible outcomes."
        },
        {
            "text": "While not every student with SEND requires additional support, we need to go further for those who do."
        },
        {
            "text": "To help, today I am announcing a further £18 million to increase the capacity of the Supported Internship programme – to help more young people with an Education, Health and Care plan to secure and sustain paid employment."
        },
        {
            "text": "More than 2,000 young people between the ages of 16 – 24 are already enrolled in Supported Internship placements in a wide variety of sectors, from healthcare and administration to hospitality and customer service. And this funding will go further, helping even more young people improve their skillset and thrive in a work environment."
        },
        {
            "text": "And if we want the best for children with SEND, we also need to support their families."
        },
        {
            "text": "It is for this reason we are giving £30 million to councils to pay for 10,000 additional respite placements, giving family members a break from caring – allowing parents to give their children the love and care they need over the longer term."
        },
        {
            "text": "These programmes come on top of more than £45 million for a combined 3-year package, to help all councils deliver quality public services and provide direct support to schools and families."
        },
        {
            "text": "All these interventions are designed with the direct involvement of young people with SEND themselves."
        },
        {
            "text": "The Sun’s Give It Back campaign has made a massive difference here too, raising awareness and highlighting that sometimes not every child gets the support that they need."
        },
        {
            "text": "Whether it’s through funding more internships or respite placements, or improving school SEND provision overall, young people deserve the opportunity to shape their future. That’s why we will be seeking their input in our SEND Review which aims to best ensure children and young people, as well as parents and carers, get the support that they need, when they need it regardless of where they live, and will publish the findings in the first three months of this year."
        },
        {
            "text": "Closing the gap between children with SEND and their peers requires more than compassion. It requires action. That is why we must go even further, which is where the Levelling Up White Paper will come in."
        },
        {
            "text": "It will be a blueprint for improving public services, including giving everyone –   including those with SEND – access to quality schools and training. It will be a masterplan for reversing our country’s geographical inequalities, as well as those that exist between students with SEND and their peers."
        },
        {
            "text": "And ultimately, it will help deliver on the promise that all children show: that when given the support they need to level the playing field, they can achieve amazing things."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}