{
    "url": "https://defrafarming.blog.gov.uk/2022/02/01/landscape-recovery-first-round-now-open-for-applications/",
    "title": "Landscape Recovery: first round now open for applications",
    "authors": [
        "Sam Burford"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2022-02-01T12:44:52+00:00",
    "content": [
        {
            "text": "The Landscape Recovery scheme is for landowners and managers who want to take a more radical and large-scale approach to producing environmental and climate goods on their land.  "
        },
        {
            "text": "Last month, we shared more information about the pilot, both here on the blog and on GOV.UK. I'll add links at the end of this post."
        },
        {
            "text": "I’m pleased to say that the application window for the first round of Landscape Recovery pilot projects is now open. It will close on Tuesday 24 May 2022."
        },
        {
            "text": "The first round will focus on 2 themes:  "
        },
        {
            "heading": 2,
            "text": "Before you apply "
        },
        {
            "text": "You can find more information about the Landscape Recovery on GOV.UK and the detailed guidance for applicants on the applications site, Bravo. "
        },
        {
            "text": "If you have any questions on the scheme you can post them on Bravo. We will publish answers so that everyone has access to the same information. "
        },
        {
            "text": "We held a webinar which you can watch too. "
        },
        {
            "text": "You can also read our previous blog posts on Landscape Recovery. I've linked to our most recent one at the bottom of this post. "
        },
        {
            "heading": 2,
            "text": "Applying "
        },
        {
            "text": "We look forward to receiving applications and proposals from individuals and groups of land managers (I have shared a recap on eligibility below and there’s more detail in the guidance). "
        },
        {
            "text": "To begin your application, you will need to create an account on Bravo.  You will then need to complete the application forms to provide more detail on your bid. "
        },
        {
            "text": "We are running a competitive process to select the most ambitious and impactful pilot projects. This means we will assess and score all the bids using the assessment criteria set out in our scheme guidance. We aim to get back to all applicants with a decision by early July.  "
        },
        {
            "text": "The highest scoring projects will be awarded development funding. This will support them through the project development phase, which we expect to last up to 2 years. "
        },
        {
            "text": "Projects that meet all our requirements will then proceed to the implementation phase with agreed funding from Defra and the private sector. "
        },
        {
            "text": "Implementation agreements will be bespoke and will set out the land management activity and/or outcomes that the project will deliver, and how this will be funded. These agreements could last for 20 years or more. "
        },
        {
            "heading": 2,
            "text": "A recap on Landscape Recovery"
        },
        {
            "text": "Landscape Recovery is 1 of 3 new environmental land management schemes, alongside the Sustainable Farming Incentive and Local Nature Recovery scheme. "
        },
        {
            "text": "Landscape Recovery will initially focus on biodiversity, water quality and net zero. We will fund projects that contribute to these outcomes over a long period and through substantial changes to land use and habitats. "
        },
        {
            "text": "As I mentioned above, the first round of Landscape Recovery projects will focus on species recovery and river restoration. Species recovery projects will be administered by Natural England and river restoration projects by the Environment Agency. "
        },
        {
            "text": "Example projects could include:   "
        },
        {
            "heading": 2,
            "text": "A recap on pilot eligibility "
        },
        {
            "text": "The first round of Landscape Recovery is open to any individuals or groups who want to come together to deliver large-scale, long-term projects of 500-5,000 hectares.  "
        },
        {
            "text": "In this first pilot round, we will take forward up to 15 projects with a roughly even split across the 2 themes. "
        },
        {
            "text": "Ideally, we would like each project to be fully contiguous (or connected in other words), but we recognise that habitats and land ownership in England are sometimes fragmented, so we will apply a pragmatic approach and allow project areas to have some gaps. "
        },
        {
            "text": "Any individuals or groups who think they can deliver the ambitious impact we seek will be able to submit bids for development funding. This means that: "
        },
        {
            "heading": 2,
            "text": "Find out more "
        },
        {
            "text": "The application process for Landscape Recovery will be competitive and we want to ensure that everyone interested in the scheme has a fair chance to apply. "
        },
        {
            "text": "We are being very careful to supply everyone with the same level of information and guidance as they make their bids so that no one gets an unfair advantage. Do take a look at the guidance in the first instance. "
        },
        {
            "text": "If you can’t find an answer to your question in the guidance, then you can submit your question through Bravo. The questions and answers will then be published for everyone to see.  "
        },
        {
            "text": "Defra policy leads went through the details of the first round of Landscape Recovery pilot projects in a webinar which you can watch. "
        }
    ]
}