{
    "url": "https://insidehmcts.blog.gov.uk/2022/02/01/making-hearing-lists-more-accessible-to-court-and-tribunal-users/",
    "title": "Making hearing lists more accessible to court and tribunal users",
    "authors": [
        "Jasbir Chahal"
    ],
    "categories": [
        "Court and tribunal reform",
        "Customer experience and research",
        "Digital services"
    ],
    "pub_date": "2022-02-01T08:00:43+00:00",
    "content": [
        {
            "text": "As part of our commitment to open justice, we're developing a new service that will modernise and improve how members of the public, the media and legal professionals find court and tribunal hearing lists."
        },
        {
            "text": "Every year we publish thousands of lists, setting out the cases courts and tribunals are hearing. Currently, we do not publish these lists in one place or in a consistent format, which can make it harder for users to find the information they need."
        },
        {
            "text": "The new service will make it easier to find hearing lists and will be available on GOV.UK in one place and in a standardised format. We’ll be moving courts and tribunals to this new service in phases which means the number of hearing lists on the service will build over time."
        },
        {
            "heading": 2,
            "text": "How we’re developing our service "
        },
        {
            "text": "We’re working with focus groups representing the media, legal professionals and the Litigants in Person Engagement Group to ensure we understand the needs of different of court users."
        },
        {
            "text": "Each group has different needs. For example, making hearing list information available online will make it easier for members of the public to make arrangements to attend a hearing. This is important whether they are participating  as a witness, victim or  observer to court proceedings."
        },
        {
            "text": "Legal professionals usually know their hearing date and location but knowing the specific court rooms means they can book consultation rooms nearby to speak with their clients. They want an efficient, reliable service that enables them to find hearing information from specific courts or tribunals quickly and allows them to manage their time effectively."
        },
        {
            "text": "Justice must be seen to be done, and local and national journalists are key to this. They need to see what’s happening in courts and tribunals so that they can decide when to attend and report on proceedings. They need the lists in good time, before hearings take place."
        },
        {
            "text": "These needs inform the practical design of the new service. We’re including predictive search boxes to help members of the public find the information quickly. Legal professionals and the media can become verified users and subscribe to receive specific hearing lists by email, removing the need to contact courts or tribunals to be added to multiple distribution lists."
        },
        {
            "heading": 2,
            "text": "Testing the service "
        },
        {
            "text": "In November 2021 we began testing the service with members of the public, legal professionals and the media. We received positive feedback, with one tester saying, \"I think it's good, easy to use and easy for someone who has no knowledge or experience dealing with courts or tribunals\"."
        },
        {
            "text": "We’re now responding to users’ suggestions. We’ve adapted the service to make finding information simpler and present it in a way that all users will find easy to understand."
        },
        {
            "heading": 2,
            "text": "Next steps – taking a phased approach "
        },
        {
            "text": "We’ll test the service throughout early 2022 to ensure the changes we’ve made meet the needs of court users and provides the accessible and consistent service we have promised."
        },
        {
            "text": "The publications service should be available to be used by a small number of courts from Spring 2022. We'll then expand the number of courts and tribunals available on the service throughout the year. As courts adopt the service, they'll contact subscribers to listing information to ensure a smooth transition. We’ll also share updates in our weekly operational summary, which you can subscribe to and keep up to date as the service expands and helps all court users find the information they need."
        }
    ]
}