{
    "url": "https://ipo.blog.gov.uk/2022/02/01/one-ipo-transformation-update-how-ip-attorneys-and-ip-rights-owners-help-shape-our-future/",
    "title": "One IPO Transformation update – how IP attorneys and IP rights owners help shape our future",
    "authors": [
        "David Holdsworth"
    ],
    "categories": [
        "Transformation",
        "User research"
    ],
    "pub_date": "2022-02-01T10:53:52+00:00",
    "content": [
        {
            "text": "The ‘One IPO Transformation’ programme, our five-year plan to revolutionise services for our customers, is now well under way.  "
        },
        {
            "text": "As the first of our new services enter their testing stage, we are offering IP rights holders, IP professionals and their clients an opportunity for a glimpse of our systems of the future.  The feedback we receive from you will help us define what it is that you, our customers, want and need from our systems to make your professional lives easier.  "
        },
        {
            "text": "All we ask of you is one hour of your time.  "
        },
        {
            "text": "We spoke to the IPO’s Deputy CEO David Holdsworth about the input the organisation is already receiving from IP rights holders, IP professionals and their clients. We asked him to outline why this is vital to delivering the new services that will completely transform the way customers interact with the IPO. "
        },
        {
            "heading": 3,
            "text": "Why your feedback is so important "
        },
        {
            "text": "As individuals we are bombarded with requests for feedback every day, in our era of ‘always on’ communication, I’d be the first to admit that I tend to move on to the communication about the shiny 20% off voucher or similar positive offer. "
        },
        {
            "text": "But what if that feedback request could have offered so much more value than that money-off voucher ever could?"
        },
        {
            "text": "What if spending just one hour with us could make your job easier for years to come? "
        },
        {
            "text": "These days, as I lead the One IPO Transformation Programme to design new IP services,  the shoe is on the other foot.  How can we transform effectively if we don’t know what our customers want? How can we catch people’s attention and compete for their time to help make our services better? "
        },
        {
            "text": "Your help is essential to making the programme a success. Put simply, we can’t do this without you.  "
        },
        {
            "text": "Find out more about becoming an important part of our One IPO Transformation by viewing this video:"
        },
        {
            "heading": 3,
            "text": "We’re taking this work very seriously "
        },
        {
            "text": "For you to take this seriously, it’s only fair that I prove that we are serious, too. "
        },
        {
            "heading": 3,
            "text": " We’re listening… "
        },
        {
            "text": "Our transformation programme is based on listening and understanding your needs – it is built into the fabric of our approach. For each new service, our starting point is speaking to a range of customers to understand what they need.  "
        },
        {
            "text": "We share our ideas and early prototypes to check we’re on the right track. Every time, we get invaluable nuggets of information that we never would have thought of on our own. This can range from small things like the language we’re using, to more fundamental changes to our original design. "
        },
        {
            "heading": 3,
            "text": "And learning… "
        },
        {
            "text": "We’re not just paying lip service. It’s not a tick box exercise. We’re acting on your feedback every day.  "
        },
        {
            "text": "Following customer feedback, we’ve made some substantial changes of direction. Some attorneys told us they didn’t want to have to log in to a separate IPO account. They use IP management software to keep track of all of their IP across the globe.  "
        },
        {
            "text": "So, we started speaking to software companies about Application Programming Interfaces (APIs), so attorneys can pull data from our systems. This means customers could access many features of the new IPO accounts through their existing software, and view UK IP alongside IP from other countries. "
        },
        {
            "heading": 3,
            "text": "Why am I telling you this?"
        },
        {
            "text": "Because getting people to take part isn’t always easy. We know your time is valuable – but your feedback and influence are essential - for you as well as for us."
        },
        {
            "text": "Whatever your professional role, we need to hear from you to shape our new services.  "
        },
        {
            "text": "IP attorneys - we would also love to hear from your clients so that we’re improving their experience too. Can you help put us in touch? Your assistance is invaluable in helping us to reach them. "
        },
        {
            "heading": 3,
            "text": "How you can help "
        },
        {
            "text": "To take part in our user research please email usertesting@ipo.gov.uk. Typically, you can expect us to speak to you one-to-one for about 60 to 90 minutes. "
        },
        {
            "text": "This is about making the services you use, day in, day out, better. Better for you as a customer as well as for our transformation upgrade. Spending one hour with us to make your job easier for years to come seems like a good use of time to me. So please help us build services that work for you. Thank you.  "
        }
    ]
}