{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/02/01/public-consultation-on-new-clinical-trials-legislation/",
    "title": "Public Consultation on new Clinical Trials Legislation",
    "authors": [
        "Gail Francis",
        "Martin O'Kane"
    ],
    "categories": [
        "Events and symposia",
        "Good clinical practice"
    ],
    "pub_date": "2022-02-01T09:54:03+00:00",
    "content": [
        {
            "text": "The MHRA has launched an  8-week public consultation on proposals for legislative changes for clinical trials."
        },
        {
            "text": "Following the UK’s exit from the European Union, the Medicines and Medical Devices Act allows us the opportunity to update our current legislation in relation to clinical trials (Statutory Instrument 2004/1031, and its numerous amendments). The new proposals are based on feedback from our stakeholders and an Expert Working Group, which included representatives from academia, industry, and patient groups."
        },
        {
            "text": "We would like to update current legislation to allow us to streamline the regulation of clinical trials approvals, enable innovation, enhance clinical trials transparency, enable greater risk proportionality, and promote patient and public involvement in clinical trials."
        },
        {
            "text": "We recognise that this cannot be achieved by legislation alone and will be developing guidance to ensure appropriate interpretation of the legislation. The legalisation is one aspect of the UK vision for clinical research delivery:  Saving and improving lives: the future of UK clinical research delivery, a key theme of which is to deliver streamlined, efficient and innovative research – so the UK is seen as the best place in the world to conduct fast, efficient and cutting-edge clinical research."
        },
        {
            "text": "We are seeking the views of clinical trial participants, researchers, developers, manufacturers, sponsors, investigators, healthcare professionals and the wider public to help shape improvements to the legislation for clinical trials."
        },
        {
            "text": "The consultation will close at 11pm on Monday, 14 March 2022 – we look forward to receiving your comments."
        }
    ]
}