{
    "url": "https://ukhsa.blog.gov.uk/2022/02/01/what-do-i-need-to-know-about-the-mmr-vaccine/",
    "title": "What do I need to know about the MMR vaccine?",
    "authors": [
        "Vanessa Saliba"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2022-02-01T10:50:52+01:00",
    "content": [
        {
            "text": "More than one in ten eligible children under the age of five in England haven’t had the MMR vaccine or are only partially vaccinated."
        },
        {
            "text": "This leaves these children unprotected and increases the risk of measles outbreaks occurring in nurseries and schools. We are reminding parents and guardians to ensure their children are protected by taking up two doses of the MMR vaccine at the right time."
        },
        {
            "text": "Since the start of the COVID-19 pandemic in March 2020, there has been a significant drop in the number of parents and carers getting their children vaccinated against MMR and taking up other childhood vaccines."
        },
        {
            "text": "Measles is highly contagious so even a small decline in MMR uptake can lead to a rise in cases.  As international travel resumes, there is more chance for measles to be brought in from countries where it is common. Catching-up children who missed out on their MMR vaccines during the pandemic is a priority, in order to help prevent a rise in measles cases."
        },
        {
            "text": "Vaccinations remain the best defence against infection, so it is very important that children attend their routine vaccination appointments and catch up on any they may have missed. You can see the NHS vaccination schedule here."
        },
        {
            "heading": 2,
            "text": "What is measles and why is it so important we're all up to date with our MMR vaccine?"
        },
        {
            "text": "Measles is a very contagious viral illness that used to be common in childhood but is now rare due to the MMR vaccination programme."
        },
        {
            "text": "When you catch it, at first it can feel like you have a cold with a runny nose and a cough, sore red eyes (conjunctivitis) and a fever, but this is followed a few days later by a rash that spreads all over the body. Most people will feel better after 7 to 10 days, however measles can lead to complications such as ear and chest infections, fits and diarrhoea and dehydration in younger children. On rare occasions measles can also lead to infection of the lining of the brain and spinal cord (meningitis) or brain itself (encephalitis) which can lead to long term disabilities or even death."
        },
        {
            "heading": 2,
            "text": "What is the MMR vaccine?"
        },
        {
            "text": "The MMR vaccine protects against 3 infections - measles, mumps and rubella. These are viral infections that can quickly spread to non-immune children and adults who have not had their vaccinations or been previously infected."
        },
        {
            "text": "The first MMR dose is offered to infants when they turn one and the second dose to pre-school children when they are around three years and four months old."
        },
        {
            "heading": 2,
            "text": "Why are two doses of MMR vaccine needed?"
        },
        {
            "text": "The MMR vaccine is the safest and most effective way to protect yourself against measles, mumps and rubella Over 99% of those who have two doses of the MMR vaccine will be protected against measles and rubella. Although mumps protection is slightly lower, cases in vaccinated people are much less severe."
        },
        {
            "text": "Since the MMR vaccine was introduced in 1988, these conditions have become rare in the UK. However, outbreaks of disease, especially measles, have occurred when the number of people having the vaccine has dropped."
        },
        {
            "heading": 2,
            "text": "Is measles a threat outside of the UK?"
        },
        {
            "text": "Since the introduction of the measles vaccine in 1968, 20 million measles cases and 4,500 deaths have been prevented in the UK. However, countries around the world with low MMR vaccine uptake continue to experience large measles outbreaks and epidemics."
        },
        {
            "text": "It is especially important to check you are up to date with your two doses of MMR before you travel.  Not only would it be unpleasant to become ill whilst abroad, but you may risk bringing the infection back with you and exposing your family and friends."
        },
        {
            "heading": 2,
            "text": "When should older children and adults have the MMR vaccine?"
        },
        {
            "text": "Anyone who has not had 2 doses of the MMR vaccine can contact their GP surgery to book an appointment. It is never too late to catch-up."
        },
        {
            "text": "It's important to check you've had both doses if you:"
        },
        {
            "heading": 2,
            "text": "What are the side effects from the MMR vaccine?"
        },
        {
            "text": "The MMR vaccine has been safely protecting children for many years in many countries worldwide. In the UK, millions of doses have been given since it was introduced in 1988. Before vaccines can be used, they have to be thoroughly tested for safety. Although there may be some side effects from vaccination, they are usually mild and much less severe than the disease itself. Serious reactions following vaccination are rare."
        },
        {
            "text": "Common side effects can include:"
        },
        {
            "heading": 2,
            "text": "Why should I or my children have the MMR vaccine? "
        },
        {
            "text": "You should have the vaccine to protect yourself against three serious infections. By doing so you will also help to protect others who can’t have the vaccine. These include unborn babies, infants who are too young to have the vaccine and children/ adults who can’t have the vaccine because they have weakened immune systems."
        },
        {
            "text": "This will help to prevent large outbreaks of disease. You should also have the vaccine if you work with young children or care for people as part of your work. Passing on measles to children who are too young to have MMR vaccine or to someone who is already ill, can have very serious consequences for their health."
        },
        {
            "heading": 2,
            "text": "Where can I find out more about the measles, mumps and rubella and the MMR vaccine?"
        },
        {
            "text": "MMR (measles, mumps and rubella) vaccine - NHS (www.nhs.uk)"
        },
        {
            "text": "Measles - NHS (www.nhs.uk)"
        },
        {
            "text": "Mumps - NHS (www.nhs.uk)"
        },
        {
            "text": "Rubella (german measles) - NHS (www.nhs.uk)"
        },
        {
            "text": "MMR for all leaflet: https://www.gov.uk/government/publications/mmr-for-all-general-leaflet"
        }
    ]
}