{
    "url": "https://civilservice.blog.gov.uk/2022/02/01/world-cancer-day-big-wins-from-small-acts-of-kindness/",
    "title": "World Cancer Day: Big wins from small acts of kindness ",
    "authors": [
        "Seonaid Webb, Deputy Director Transformation, Department for Environment, Food and Rural Affairs and chair of the Civil Service Working through Cancer network"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-02-01T09:00:17+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Ahead of World Cancer Day on 4 February, Seonaid Webb tells how small kindnesses can help make such a difference to colleagues facing cancer."
        },
        {
            "text": "Over the past two years, the impact of COVID-19 on people affected by cancer has been stark. Whether that’s isolation and shielding leading to loneliness, delays on treatment waiting times leading to anxiety around increased health risks and issues, or the pain of not being able to hold the hand of family members during invasive hospital treatments, we all appreciate, more than ever in these challenging times, a simple act of kindness. "
        },
        {
            "text": "Amazing civil servants"
        },
        {
            "text": "In the Civil Service Working Through Cancer Network we’ve seen some amazing efforts by civil servant colleagues, who have stepped up brilliantly to help others. It’s extraordinary to think almost 1,000 new people have signed up to be blood donors, whilst almost 500 civil servants joined the stem cell register over the summer. Others willingly volunteered to become a buddy to a person who needs to speak to someone who “gets it” (including a WhatsApp shielding buddy group during lockdown). We want to say a huge thank you to everyone who has been part of supporting others through acts of kindness. "
        },
        {
            "text": "World Cancer Day plans"
        },
        {
            "text": "For World Cancer Day, the Working Through Cancer Network is focusing on the themes of acts of kindness and looking to the future. Our hundreds of members are promoting local events across many departments and agencies - look out for opportunities on your intranets, and do try to attend. In addition, we are offering some fantastic Civil Service-wide events."
        },
        {
            "text": "Cancer Research UK "
        },
        {
            "text": "Dr Rachel Shaw is going to talk to us about the successes in, and the future of, cancer research – supporting the organisation’s milestone anniversary year. Today, thanks to research, two in four people in the UK survive their cancer for 10 years or more. The prospects of major advances in tackling cancer have never been greater, and international collaboration and funding are key in realising these opportunities. "
        },
        {
            "text": "In Conversation With...Ministers and Senior Leaders "
        },
        {
            "text": "We’re delighted to announce our panel members are: Minister Jo Churchill, Dame Clare Moriarty (CEO of Citizens Advice Bureau) and Dr Gemma Harper (CEO of JNCC)."
        },
        {
            "text": "Getting men talking about cancer "
        },
        {
            "text": "A panel event with a group of civil servants who want to share how the help from others was vital during their journeys through cancer. "
        },
        {
            "text": "Maggie’s Charity "
        },
        {
            "text": "The charity will be leading an event with us, focused on support for families affected by cancer. The charity provides free cancer support and information in centres across the UK and online."
        },
        {
            "text": "Shine "
        },
        {
            "text": "A charity for young people in their 20s, 30s and 40s, Shine is hosting an event looking at their offer for the “plus ones” of young people affected by cancer. "
        },
        {
            "text": "Acts of Kindness events "
        },
        {
            "text": "Supported by Look Good Feel Better and From Me to You, these will showcase how small things can make a big difference to someone affected by cancer.  "
        },
        {
            "text": "Macmillan Buddies"
        },
        {
            "text": "Macmillan will host a session on the huge benefits to primary and secondary cancer patients of access to a longer-term buddy. "
        },
        {
            "text": "These events are open to all civil servants – please visit the Working Through Cancer Network eventbrite to book a place."
        }
    ]
}