{
    "url": "https://civilservice.blog.gov.uk/2025/10/02/a-decade-of-surge-the-civil-services-crisis-busting-weapon-in-government-delivery/",
    "title": "A Decade of Surge: The Civil Service’s crisis-busting weapon in Government Delivery",
    "authors": [
        "lmcbride"
    ],
    "categories": [
        "A Skilled Civil Service"
    ],
    "pub_date": "2025-10-02T16:08:38+00:00",
    "content": [
        {
            "text": "What does the overnight collapse of Thomas Cook, Covid-19 and the annual self-assessment tax peak all have in common? Answer: Enter the Surge and Rapid Response Team (SRRT) – the Civil Service’s ultimate problem solver, writes Karen Kyle, Head of the Surge and Rapid Response Team."
        },
        {
            "text": "Think of SRRT as the Swiss Army knife of government operations. They tackle three mission critical challenges."
        },
        {
            "text": "When organisations brace for an annual peak in demand - such as universal credit payments or annual self-assessment tax returns - SRRT swoops in to handle the surge. When government departments face unexpected staff shortages, they plug the gaps.  And when national emergencies strike – from Covid 19  to major incidents, they help keep essential services running."
        },
        {
            "text": "It’s hard to believe that 10 years have passed since the establishment of the Operational Delivery Profession’s SRRT. Time certainly flies! For those unfamiliar with SRRT, let me introduce you to this vital part of our government operations, providing resilience, flexibility and support in a crisis. But first, here is what makes them truly special: It’s all about the people. "
        },
        {
            "text": "Critical Support"
        },
        {
            "text": "At SRRT, we have built a skilled team of professionals who embrace variety and excel under pressure. Whatever the challenge - however unpredictable - they deliver a rock-solid quality service across government - and we have the stories to prove it. "
        },
        {
            "text": "When Thomas Cook collapsed, SRRT civil servants flew to holiday destinations, helping thousands of stranded Brits get home. During the pandemic, we staffed the HMRC Coronavirus job retention helpline, ensuring wages kept flowing to thousands of furloughed workers. And, in 2021 we went door-to-door for the Census in England and Wales, gathering crucial data that shapes the government today."
        },
        {
            "text": "Each deployment is not just crisis management – it demonstrates first class skills in planning, adaptability and resilience."
        },
        {
            "text": "Future proofing government"
        },
        {
            "text": "As SRRT enters its second decade, we know the landscape ahead will look radically different. Artificial Intelligence is reshaping operations and government policies are evolving. Public demand for services will continue to climb. But rather than see these as obstacles, SRRT sees them as opportunities. We are already exploring how AI can enhance our deployment strategies and investigate new ways of working that can transform government responsiveness for the better."
        },
        {
            "text": "Ready for anything"
        },
        {
            "text": "The value of SRRT lies in its expertise and commitment to high standards of operational delivery from my SRRT colleagues ready to deploy anywhere."
        },
        {
            "text": "Need SRRT’s help?"
        },
        {
            "text": "You name it, we will do our best to do it. We are made up of operational delivery professionals at AO and EO level - all with Security Clearance. We can deploy remotely, nationally and even internationally depending on your needs."
        },
        {
            "text": "From seasonal peaks in demand and rolling out a new service to a national crisis, we are ready and willing to help. Our decade of success is not just about solving problems. It is about proving that the government can be agile, responsive and genuinely helpful when it matters most."
        },
        {
            "text": "If you’d like to explore how SRRT could help with your resourcing needs, we would love to hear from you."
        },
        {
            "text": "📧 Email srrtcustomerenquiries@hmrc.gov.uk "
        }
    ]
}