{
    "url": "https://skillsengland.blog.gov.uk/2025/10/02/an-introduction-to-the-local-skills-dashboard-by-frank-bowley/",
    "title": "An introduction to the Local Skills Dashboard, by Frank Bowley",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "analysis",
        "data",
        "Insight",
        "local skills improvement plans",
        "skills england tools",
        "Statistics"
    ],
    "pub_date": "2025-10-02T12:24:15+01:00",
    "content": [
        {
            "text": "Skills England is data-driven, bringing together the right evidence to understand and respond to the nation’s skills needs. An important part of this work is supporting our partners across the country to access and use this evidence in a local context. "
        },
        {
            "text": "Local data is essential to tailoring skills policy and delivery, to provide growth and opportunities in all parts of the country. To support this work, we’ve created the Local Skills Dashboard, making it quick and easy to access local data. "
        },
        {
            "text": "In this blog, Frank Bowley, Skills England's Deputy Director of Analysis and Insight, provides a helpful introduction to the Local Skills Dashboard. "
        },
        {
            "heading": 2,
            "text": "What is the Local Skills Dashboard?"
        },
        {
            "text": "The local skills dashboard is an online hub for up-to-date information and data on local skills, education and employment. It provides an overview of labour market and training data for bespoke geographic locations such as Local Skills Improvement Plan areas (LSIPs), Combined Authorities and Local Authorities. "
        },
        {
            "text": "The dashboard has a range of interactive visualisations that allow users to explore leading indicators of skills needs, including employment, jobs, businesses, training and destinations over time.  "
        },
        {
            "text": "The dashboard is publicly and freely available. "
        },
        {
            "heading": 2,
            "text": "Why was the dashboard developed?"
        },
        {
            "text": "The dashboard was first created in 2022 by the Unit for Future Skills. At the time, Employer Representative Bodies (ERBs) were developing their first Local Skills Improvement Plans, and the dashboard was designed to ensure all ERBs had access to local data to support their plans.  "
        },
        {
            "text": "Since then, ownership of the dashboard has transferred to Skills England, and it has been used by a much wider audience. We have continued to develop it with feedback from local authorities, educational institutions and government departments, among others. "
        },
        {
            "heading": 2,
            "text": "How has the dashboard evolved?"
        },
        {
            "text": "We regularly update the dashboard with the latest data as well as adding new features to expand the information and tools it offers. Over the last few months, we’ve made some major improvements, including: "
        },
        {
            "heading": 2,
            "text": "How can I use the dashboard to understand local skills?"
        },
        {
            "text": "The dashboard offers a range of features to explore local labour market and education provision, providing insights into local skills needs. "
        },
        {
            "heading": 3,
            "text": "Local area summaries"
        },
        {
            "text": " The dashboard’s overview page provides a quick summary of key jobs and training data for each local area. To access a local area summary, just select an area at the top of the main page. "
        },
        {
            "heading": 3,
            "text": "Quick access to extensive local data"
        },
        {
            "text": "The local skills data page provides more detailed insights for a wide range of topics, such as employment, businesses and training. You can access the local skills data page from the left-hand menu, then use the menus at the top to choose which area and topic you’re interested in. "
        },
        {
            "text": "You can also choose different areas using the interactive map, which allows you to click on the area you’re interested in to bring up the data for that region. "
        },
        {
            "heading": 3,
            "text": "Interactive content to explore themes in depth"
        },
        {
            "text": "Much of the data on the dashboard can be filtered to explore areas of interest, such as specific occupations or learner groups. For example, try selecting online jobs adverts on the local skills data page, and use the sub-group filter at the top to see how demand for an occupation varies between areas and over time.  "
        },
        {
            "heading": 3,
            "text": "Local area comparisons"
        },
        {
            "text": "You can choose any number of local areas (such as neighbouring local authorities) to display on the graphs, allowing quick visual comparisons. Use the comparison menu at the top left of the local skills data page. "
        },
        {
            "heading": 3,
            "text": "Data Downloads "
        },
        {
            "text": "If you’re an analyst, you might want to integrate the data further. The data download section (available on the left-hand menu) allows you to download the raw data that sits behind the dashboard. This makes it quick to find and download just the data you need, to perform bespoke analysis. "
        },
        {
            "heading": 2,
            "text": "What impact is the dashboard having?"
        },
        {
            "text": "Dashboard users have told us how it’s helping them develop and deliver their local skills agendas. "
        },
        {
            "text": "Local bodies, such as Local Authorities, are using the dashboard to monitor the local labour market and training provision, to inform local skills strategy. "
        },
        {
            "text": "Government departments and agencies have used it to support engagement with local bodies and to inform locally targeted policy and delivery. "
        },
        {
            "text": "Education and training suppliers, for example Further Education colleges, are using it to gather local labour market information that supports curriculum planning and careers advice. "
        },
        {
            "heading": 2,
            "text": "What's next for the dashboard?"
        },
        {
            "text": "We’ll be continuing to work with users to provide more of the data and features they need to understand the local skills landscape.  "
        },
        {
            "text": "If you’d like to provide feedback or discuss how you can use the dashboard in your work, please get in touch at skills.england@education.gov.uk with 'Local Skills Dashboard’ in the subject line. "
        },
        {
            "text": "Frank Bowley "
        },
        {
            "text": "Deputy Director of Analysis and Insight, Skills England "
        }
    ]
}