{
    "url": "https://civilservice.blog.gov.uk/2025/10/02/black-history-month-2025-standing-firm-in-power-and-pride/",
    "title": "Black History Month 2025: Standing Firm in Power and Pride",
    "authors": [
        "Civil Service"
    ],
    "categories": [
        "Civil Service Race Champion"
    ],
    "pub_date": "2025-10-02T14:15:43+00:00",
    "content": [
        {
            "text": "Civil Service Chief Operating Officer and Race Champion Cat Little reflects on this year's powerful theme and what it means for our organisation and the communities we serve. "
        },
        {
            "text": "October marks Black History Month across the UK, and as Civil Service Race Champion, I'm deeply moved by this year's theme: \"Standing Firm in Power and Pride\". These words encapsulate everything we should aspire to as an organisation that serves all our communities with dignity and respect."
        },
        {
            "text": "Power, in this context, represents the influence, leadership, and capacity to effect positive change. It acknowledges the visionaries who have led political, civil rights, and social movements, as well as those who have broken barriers in business, education, and the arts. Their legacies remind us that true power isn't about titles – it's about the collective strength, courage, and unity used to forge a more equitable future for all."
        },
        {
            "text": "Pride reflects cultural identity, heritage, and the celebration of excellence. From art and music to the stories passed through generations, pride is the heartbeat of communities worldwide. It's about knowing where we come from, embracing our history, and walking boldly into the future without compromise or apology."
        },
        {
            "text": "This year holds particular significance as we commemorate the 60th anniversary of the Race Relations Act – landmark legislation that helped shape Britain's approach to equality. We also remember pivotal figures like Paul Stephenson OBE, who led the 1963 Bristol Bus Boycott that helped inspire this very legislation, and Lord Herman Ouseley, former Chair of the Commission for Racial Equality, whose tireless work challenged institutional racism and reshaped our national conversations around equality and inclusion. Both passed away in 2024, but their contributions continue to echo in today's fight for fairness and dignity."
        },
        {
            "text": "These anniversaries serve as powerful reminders of the ongoing struggle for equality and justice, and the tireless efforts of those who have fought for the rights of Black people and communities. "
        },
        {
            "text": "For the Civil Service, this theme challenges us to examine how we stand firm in our own power and pride. As an organisation, we have the power to shape policies that affect millions of lives. We have the influence to ensure our services are truly inclusive and representative of the communities we serve. And we have the responsibility to create an environment where every colleague can bring their authentic self to work."
        },
        {
            "text": "As Race Champion, I'm passionate about continuing our excellent work in this space. We've seen tangible progress: the percentage of civil servants from ethnically diverse backgrounds has risen from 10.1% in 2014 to 18% today, meaning the Civil Service is more reflective of the country that we serve. We must continue attracting and retaining talented colleagues at all grades, tackling barriers in our recruitment processes, outreach, performance management and development support."
        },
        {
            "text": "I'm committed to driving practical changes whilst role modelling the inclusive leadership our organisation deserves. When we create environments where everyone can stand firm in their power and pride, extraordinary things happen. We design better policies, deliver more effective services, and build stronger connections with the citizens we serve."
        },
        {
            "text": "This year's theme isn't just about remembrance – it's a call to action. It invites us all to stand firm in our power with pride and actively shape a world where Black voices are heard, valued, and celebrated. It challenges us to break down barriers, continue pushing for progress, own our spaces and walk confidently into the future."
        },
        {
            "text": "As we celebrate Black History Month 2025, let's commit not just to learning about the past, but to actively embodying power and pride in everything we do. Because when we stand firm in both, we create a Civil Service that truly serves everyone with excellence and dignity."
        },
        {
            "text": "Cat Little, Chief Operating Officer of the Civil Service and Civil Service Race Champion"
        }
    ]
}