{
    "url": "https://defradigital.blog.gov.uk/2025/10/02/building-our-product-management-community-from-sceptics-to-superfans/",
    "title": "Building our product management community: from sceptics to superfans",
    "authors": [
        "James Corbett",
        "Helen McMullan"
    ],
    "categories": [
        "Community",
        "Product Management"
    ],
    "pub_date": "2025-10-02T08:14:28+01:00",
    "content": [
        {
            "text": "James Corbett is a Product Manager for Delivering Sustainable Futures at Defra and Helen McMullan is a Lead Product Manager for Regulatory Services at Defra. In this blog they reflect on how formalising a product community has unleashed the power of shared ownership, collective growth, and fostered sense of belonging"
        },
        {
            "heading": 2,
            "text": "From “not my thing” to “when’s the next one?”"
        },
        {
            "text": "To be honest when we first heard about 'building a community' for our product team, we weren’t convinced. We were a pretty disparate bunch, scattered across different projects, and day-to-day interactions were few and far between. As it is everywhere in digital teams, everyone was very busy and we weren’t sure how a few extra meetings would change that. It’s not that we were against the concept in principle, but we had both been involved in variations of these groups before and almost universally over time the energy has wavered, attendance has waned, and the community has ultimately fizzled out."
        },
        {
            "text": "But our new Head of Product had come in with a different vision. This wasn’t going to be another top-down initiative, it was going to be ours. This was going to happen, and our engagement would be the lifeblood of the community moving forward."
        },
        {
            "heading": 2,
            "text": "Sharing the load and shaping who we are"
        },
        {
            "text": "One of the best decisions at our first away day in Bristol was to share the weight of running the community. We agreed to set up a rolling leadership approach where different team members take turns steering activities and different members of the team would lead sessions in a community council. This meant that no one person carried the responsibility, and everyone could bring their own style, experience, and ideas to the table."
        },
        {
            "text": "In for a penny in for a pound, we both put our hands up and volunteered to go first as the two community leaders. We’re glad that we did! As the community grew, we realised it was the perfect place to define our collective vision for product across Defra Digital Data Technology and Security (DDTS)."
        },
        {
            "text": "Product management had often felt like a bit of an afterthought. Product managers were being placed into programmes and projects where there was little or no understanding of the role we play and the value we could bring."
        },
        {
            "text": "During early community sessions, we talked about what we stood for, what we wanted to achieve, and even designed 'mission patches' to celebrate our identity. Framing the first few away days and sessions around what product is, the challenges we faced and what we wanted it to be proved a powerful and fun way to connect."
        },
        {
            "text": "We also carried out a team skills audit. Importantly this was not as a performance check, but as a way of identifying where we could grow together. It helped us focus on what we were good at and the skills we wanted to strengthen collectively, rather than leaving personal development as a purely individual responsibility. It was also a great process to hold communally as it served to demystify who might be the best person to turn to in the team when we inevitably get stuck on a topic during the day to day!"
        },
        {
            "heading": 2,
            "text": "Bringing in new ideas and new people"
        },
        {
            "text": "We were a small gang at the start, but we were determined to make a big noise, so it was important to consider how we were going to extend our reach far beyond the dozen or so people in the room."
        },
        {
            "text": "We started by opening our doors to guest speakers from across DDTS, departments and even beyond government; giving us fresh perspectives and sparking ideas we wouldn’t have necessarily thought of ourselves. As the team has grown it has helped us understand perspectives from across the delivery function, and stay current on key topics across the industry more broadly."
        },
        {
            "text": "We have also grown the network by adding extra community sessions for product professionals in non-DDTS roles, and are currently linking with our network of suppliers to provide additional input and thought leadership in our cross Defra product and supplier group."
        },
        {
            "text": "It’s made our reach, our proposition, and our conversations, so much richer."
        },
        {
            "heading": 2,
            "text": "The results? Stronger ties, stronger team"
        },
        {
            "text": "Looking back, the change is huge. In a little over a year since we all arrived for that first meeting in Bristol, the community has strengthened relationships between colleagues, built a support network we can lean on, and created a space where we feel genuinely connected."
        },
        {
            "text": "It’s given a sense of belonging to something more tangible to members, whilst providing a great foundation to those that have joined it in a period of growth. New starters know that we’re here, where to turn for support, and perhaps more importantly they can see that they’re part of a team."
        },
        {
            "text": "Despite our initial concerns that this wouldn’t work, we can now happily say it’s been invaluable. We’ve gone from being worried about taking time out of our weeks to actively checking the calendar in anticipation of the next session!"
        }
    ]
}