{
    "url": "https://insidehmcts.blog.gov.uk/2025/10/02/celebrating-excellence-hmcts-national-awards-showcase-innovation-compassion-and-justice-in-action/",
    "title": "Celebrating Excellence: HMCTS National Awards Showcase Innovation, Compassion and Justice in Action",
    "authors": [
        "Simran Poonia, Digital Communications Officer"
    ],
    "categories": [
        "Civil",
        "Crime",
        "Digital services",
        "Family",
        "General",
        "Tribunals",
        "Working at HMCTS"
    ],
    "pub_date": "2025-10-02T11:00:00+01:00",
    "content": [
        {
            "text": "The annual HMCTS National Awards celebrate staff who exemplify our values through innovation, crisis response and commitment to putting people first. "
        },
        {
            "heading": 2,
            "text": "Excellence across our organisation "
        },
        {
            "text": "Our staff awards celebrate outstanding colleagues who embody our core values of purpose, openness, together, and humanity. An abundance of nominations came in from across the organisation this year, highlighting some of the work that helps to transform lives daily. "
        },
        {
            "text": "Chosen from the winners of their regional award ceremonies, picking a winner is never easy when there are so many fantastic stories to share. "
        },
        {
            "text": "Jonathan, based in the Sheffield region, won the Purpose Award for coordinating Operation Stovewood, the UK's largest historic child abuse investigation, helping bring closure to survivors who had waited decades for justice. He was also recognised the following day at the Inspire Justice Awards in London. "
        },
        {
            "text": "The Low Code team earned our Openness Award for creating tools, such as webforms and PowerApps, that addressed email overload and helped streamline processes, driving real change across HMCTS. "
        },
        {
            "text": "Liverpool Crown Court received the Together Award for their sensitive management of the complex and high-profile Southport case, while under intense public scrutiny.  "
        },
        {
            "text": "The Operational Delivery Award celebrated frontline excellence and a CEO Award recognised outstanding achievements across all the categories. "
        },
        {
            "text": "But it was the Humanity Award winner who truly captured what we represent when faced with the most challenging of circumstances. "
        },
        {
            "heading": 2,
            "text": "When crisis struck, our values guided us"
        },
        {
            "text": "On what seemed like an ordinary morning at London South Employment Tribunal, a serious incident was about to occur outside the building. A member of the security team was injured in an unprovoked attack, but our local team's response showed remarkable character and showcased our values in action. "
        },
        {
            "text": "Two colleagues with first-aid training immediately came forward to help, treating the guard's wounds as the site’s management team acted quickly to secure the building to keep those in attendance safe from further harm. All while offering support to shaken colleagues and court users who had witnessed the incident unfolding. "
        },
        {
            "text": "Despite the chaos and trauma of what had happened, the team was committed to maintaining scheduled hearings and ensuring they could continue safely. Their focus remained on ensuring everyone who had travelled to court that day, often for important employment disputes, could still access justice and receive the service they needed. "
        },
        {
            "heading": 2,
            "text": "What this means for everyone we serve "
        },
        {
            "text": "This response demonstrates what statistics cannot capture about justice. Yes, we are transforming justice through innovation - our Pathfinder teams have now reduced family court waiting times from 34 weeks to under 15 weeks, but at the beating heart of justice, there are real people who understand that justice encompasses both legal procedures and treating everyone with dignity and respect. "
        },
        {
            "text": "Whether developing new technology, supporting vulnerable court users, or ensuring everyone feels welcome and included, our teams are determined to ensure excellent public service is a combination of efficiency and compassion. "
        },
        {
            "heading": 2,
            "text": "The people who make justice possible "
        },
        {
            "text": "Every one of our award winners, runners up and nominees understands their work directly impacts real lives. From innovative solutions that speed up court processes, to individual acts of kindness that help vulnerable users navigate our system, each contribution matters.  "
        },
        {
            "text": "Work can often be completed under extreme pressure, but our outstanding colleagues are committed to ensuring justice remains accessible to everyone, regardless of the obstacles they face. "
        },
        {
            "text": "Our annual awards not only recognise past achievements but also inspire our future direction. As we continue modernising the justice system, we're building on foundations of innovation, compassion and unwavering commitment to public service, serving those who need the justice system."
        }
    ]
}