{
    "url": "https://cddo.blog.gov.uk/2025/10/02/dataconnect25-how-public-sector-data-delivers-real-benefits-for-users/",
    "title": "DataConnect25: How public sector data delivers real benefits for users",
    "authors": [
        "Rachael Richards, Data Community Lead, GDS"
    ],
    "categories": [
        "Data",
        "Digital learning and development",
        "Government Digital and Data"
    ],
    "pub_date": "2025-10-02T10:45:00+01:00",
    "content": [
        {
            "text": "Next month DataConnect the conference ‘for the community, by the community’ is back again for a fifth year. This year’s theme is ‘using data to deliver benefits for users’, echoing the aims of our mission-led government. The event brings together public sector data professionals at all levels, to explore real world case studies that delivered tangible outcomes using public sector data.  "
        },
        {
            "text": "DataConnect runs from 10 – 14 November 2025 and offers 30 learning and development sessions for public sector data professionals, from local government, wider central government, international governments, universities, institutes and civil society. Attendees are invited to drop into the talks, panel discussions and fireside chats that interest them or take part in the full weeklong conference. The programme has been designed to recognise the breadth of the data profession allowing attendees to pick the sessions most relevant to them and aligns to the blueprint for a modern digital government by providing a platform for  AI and data communities of practice to meet and share knowledge."
        },
        {
            "heading": 2,
            "text": "Real examples"
        },
        {
            "text": "This year, DataConnect is focused on using data to deliver benefits for users and giving data professionals practical examples to take back to their roles."
        },
        {
            "text": "The conference will showcase ‘how-to’ demos and case studies from professionals in areas such as data governance, information management, data architecture, security and data ethics delivering safe, trusted, and effective public services. Case studies will demonstrate the efficiencies, hours saved, economic growth and improved experiences the public sector has delivered."
        },
        {
            "text": "Together we will explore the most pressing challenges and issues data professionals face today when delivering benefits for users and examine how are we solving them by learning from across the public sector community."
        },
        {
            "heading": 2,
            "text": "Why attend DataConnect?"
        },
        {
            "text": "Here are five reasons to listen, debate, learn and network at DataConnect:"
        },
        {
            "text": "Together through learning, debating and discussing projects and case studies, we will learn from talented innovators from across the public sector who are delivering real world change for users."
        },
        {
            "text": "Join us at DataConnect, which runs from 10am  to 4pm, on Monday 10 November - Friday 14 November 2025. If you’re a public sector data professional, you can register on Hopin, our conference platform."
        }
    ]
}