{
    "url": "https://dragonsden.blog.gov.uk/2025/10/02/dragons-den-ip-blog-series-22-episode-10/",
    "title": "Dragons Den IP Blog - Series 22 Episode 10",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-10-02T21:00:00+01:00",
    "content": [
        {
            "text": "Have you ever started cooking something and got distracted? I certainly have, thankfully with no serious consequences. According to Dr Samuel Bailey, the first entrepreneur to enter the Den this week, the UK fire service responded to more than 10,500 cooking fires last year, accounting for just under half of the UK’s house fires. Frightening."
        },
        {
            "heading": 3,
            "text": "A serial inventor"
        },
        {
            "text": "By his own admission, Dr Bailey – Sam – is a serial inventor and describes how he uses his own home as a lab for his inventions."
        },
        {
            "text": "London-based Sam came into the Den asking for an investment of £100k for 5% of the equity in his tech company, Pippa Technologies, as well as expertise to help him fire up interest in new markets. His passion for inventing household items that protect people, was evident when he demonstrated ‘Pippa’, his AI-powered hob and stove safety monitor. His vision is to see the device installed in millions of homes worldwide."
        },
        {
            "text": "So how does Pippa work? This smart, wall-mounted, AI-powered invention uses software that Sam developed himself, to detect potential kitchen hazards. The clever kit registers when cooking oil approaches peak temperature, for example, and can detect food on fire within 20-30 seconds. It can also monitor risk, identifying when people become accident prone in the kitchen, and a danger to themselves. Once the danger is discovered, Pippa can sound a warning, using phone and text messages to raise the alarm. Impressed? So were the Dragons."
        },
        {
            "heading": 3,
            "text": "All fired up"
        },
        {
            "text": "Deborah Meaden kicked off the questioning followed by Peter Jones, eager to delve into Sam’s background; he’s a keen inventor, is he involved in other businesses too?"
        },
        {
            "text": "Sam revealed how his PhD in computer science, combined with his mission to make life better, has led him to invent a number of solutions that help with safety and sustainability in the home. Developed through his other, more established company, Skyrad, these include a renewable energy heating system with a low carbon footprint, and ‘leak bot’ technology that detects leaks around the home."
        },
        {
            "text": "While Steven Bartlett and Sara Davies declared themselves impressed but ‘out’ of any deal, it was noticeable how Sam’s mention of Skyrad turned the heat up in the Den for the remaining investors. With their eyes firmly set on the bigger picture, Peter, Deborah and Touker Suleyman expressed an interest in investing not in Pippa Technologies, but in Skyrad. Sam seemed flattered, indicating that he was happy to talk details."
        },
        {
            "text": "Deborah was keen to point out how her local authority contacts could be an asset, while Touker highlighted his property development connections and his expertise at driving down manufacturing costs. The negotiation that followed led to a hot result for both entrepreneur and investors: a 5% stake in return for £50K each from Peter, Deborah and Touker – a total of £150k for Dr Sam."
        },
        {
            "heading": 3,
            "text": "Hot stuff from Mother Root"
        },
        {
            "text": "Bethan Higson and Alice Galsworthy from East London entered the Den asking the Dragons for £60k for 2% of Mother Root, Bethan’s non-alcoholic drink business. Bethan was inspired by her desire to find a tasty alternative to water when pregnant - a treat rather than a trade-off. She created her feelgood aperitif using ginger and cider vinegar as base ingredients, a refreshing combination known traditionally as a ‘switchel’. From the friendly fracas between Deborah and Sara over the sample drinks, it was obvious that Bethan was onto a winner with the demographic in the Den."
        },
        {
            "text": "During a pitch that outlined how the market for non-alcoholic aperitif drinks is the fastest growing category within the adult drinks sector, I was intrigued to hear about the increasing shift of consumer behaviour away from alcohol."
        },
        {
            "text": "This resonated with the Dragons: “I completely get it!” said Steven Bartlett, who didn’t disguise his excitement at hearing the Mother Root pitch. As a drinker of non-alcoholic drinks himself, he told of his frequent hunt for something interesting to drink on a night out. Deborah loved it too, equally excited at the prospect of having a choice. "
        },
        {
            "text": "In spite of a muddying of investment waters due to existing ‘angels’ and shareholders with expertise in the industry, the Mother Root concept attracted offers from Deborah and Sara. Finally though, it was Steven, with his two market performance businesses and love of the concept, for whom Mother Root resonated the most.  "
        },
        {
            "text": "After an offer, a counter offer and a counter counter offer, the deal was done. Steven agreed to an investment of £90k in return for 5% - and the perfect brand fit he said he’d been looking for, for very long time."
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}