{
    "url": "https://deframedia.blog.gov.uk/2025/10/02/extended-producer-responsibility-whats-it-for/",
    "title": "Extended producer responsibility: what’s it for?",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "plastic",
        "Pollution",
        "waste"
    ],
    "pub_date": "2025-10-02T12:54:22+01:00",
    "content": [
        {
            "text": "There has been widespread coverage of the introduction of the Extended Producer Responsibility for Packaging (pEPR) scheme in recent days."
        },
        {
            "text": "Below is a simple explainer, setting out why it’s so important to make these changes a success."
        },
        {
            "text": "What is pEPR?"
        },
        {
            "text": "pEPR represents a major shift in the way that the costs of waste are handled. It works in lockstep with two other significant reforms which we are introducing: Simpler Recycling collections for bins in England, and a Deposit Return Scheme for drinks containers."
        },
        {
            "text": "The scheme works by charging fees to the businesses that use packaging to meet the costs of collecting and recycling it. From year two of the scheme, it will introduce modulation where the costs are higher for hard-to-recycle materials. Where packaging can be reused or refilled, fees are lower."
        },
        {
            "text": "This will encourage businesses to reduce the amount of packaging they use, shift to more recyclable materials and design new products that can be recycled and reused more easily, stopping waste from going to the nation’s landfills or incinerators."
        },
        {
            "text": "Steel, aluminium and PET plastic drinks containers across the UK are not charged under pEPR, as they will be covered under the UK’s Deposit Return Scheme."
        },
        {
            "text": "Why is it needed?"
        },
        {
            "text": "Household recycling rates have flatlined for years – meaning huge quantities of waste are still being sent to landfill or incinerators. Packaging is a major source of this tide of rubbish."
        },
        {
            "text": "Moreover, the bill for disposing of items like chunky delivery boxes, polystyrene crates and plastic multipacks is currently footed by local councils."
        },
        {
            "text": "It is right for businesses who produce packaging to pay their fair share of the recycling costs, rather than the burden falling solely on councils. As materials which are easier to recycle, refill or reuse are liable for lower fees, businesses will be rewarded for shifting to those materials and designing greener products – helping us clean up Britain and end the throwaway society ."
        },
        {
            "text": "This will  shift the UK towards a circular economy and boost growth: industry estimates suggest the reforms will support 25,000 new jobs and underpin £10 billion of investment in new sorting and processing facilities over the next decade."
        },
        {
            "text": "Are businesses ready?"
        },
        {
            "text": "The UK Government, DAERA in Northern Ireland, Scottish Government and Welsh Government announced their commitment to introducing the scheme and consulted widely with industry and the public in 2021 . Since then, we have been in constant discussion with businesses, local authorities and other key stakeholders around the best design of the scheme."
        },
        {
            "text": "Throughout the runup to the launch of pEPR, we set out indicative base fees for industry based on the packaging data which businesses submitted to us. The final base fees were published in June 2025 and represented a significant reduction in costs for every single material except fibre composite, which saw a small increase. Some of the biggest high-street businesses are already introducing innovative packaging and exploring refill and reuse schemes."
        },
        {
            "text": "Smaller businesses, with a turnover of under £2 million or who produce less than 50 tonnes of packaging annually, are exempt from pEPR fees."
        },
        {
            "text": "All councils in England must use this funding to deliver improved waste collection services for their communities. PackUK, the administrator for pEPR, is empowered to reduce future allocations if evidence shows that funding has been used for other purposes."
        },
        {
            "text": "We continue to work closely with all stakeholders to ensure the scheme is working as intended. Any decision to pass costs on as price increases for consumers is for retailers alone to make."
        },
        {
            "text": "What will it mean for me?"
        },
        {
            "text": "The money raised through pEPR will be funnelled directly into council waste collection to ensure prompt and straightforward services for households. Over £1.1 billion will be distributed to councils in England."
        },
        {
            "text": "The Simpler Recycling collections will mean an end to the confusing patchwork of different systems across England. Councils will offer free weekly food waste collections to homes from March 2026, and the same set of materials will be collected for recycling – whether at home, work or school."
        },
        {
            "text": "As more businesses use sustainable practices we’ll all be able to recycle the products we buy more easily – and we'll see more options for refilling and reusing containers in shops."
        },
        {
            "text": "These changes will help us build a circular economy, where instead of throwing things away, we repair, reuse and recycle them to reduce waste, while also helping to create skilled green jobs and grow our economy."
        }
    ]
}