{
    "url": "https://mojdigital.blog.gov.uk/2025/10/02/introducing-the-gov-reuse-library/",
    "title": "Introducing the GOV Reuse Library",
    "authors": [
        "Nikola Goger"
    ],
    "categories": [
        "cross government collaboration",
        "Gov Reuse Library",
        "Our services"
    ],
    "pub_date": "2025-10-02T10:52:04+01:00",
    "content": [
        {
            "text": "The GOV Reuse Library is a new cross-government initiative designed to help teams work smarter, faster, and more collaboratively by reusing proven digital service components."
        },
        {
            "text": "Developed by the Ministry of Justice, in partnership with the Government Digital Service and the Department for Education, the library aims to:"
        },
        {
            "text": "Explore the library: https://dev.reuselibrary.service.justice.gov.uk"
        },
        {
            "heading": 2,
            "text": "Why we built the GOV Reuse Library"
        },
        {
            "text": "Every day, government teams solve similar problems in silos. What if we could break those silos and build smarter, faster, together?"
        },
        {
            "text": "This aligns with the government’s vision of a modern digital state that \"joins up and acts as one public sector” and helps “strengthen and extend our digital public infrastructure”."
        },
        {
            "heading": 2,
            "text": "What you will find"
        },
        {
            "text": "The library makes it easier to discover reusable digital elements that can speed up delivery and improve consistency, such as:"
        },
        {
            "text": "By sharing these resources openly, we aim to save time, cut costs, and deliver better services for users."
        },
        {
            "heading": 2,
            "text": "How you can get involved"
        },
        {
            "text": "We are building this together and we would love your input to help it grow."
        },
        {
            "text": "The GOV Reuse Library is just the beginning. By working together, we can build a stronger, more connected digital government."
        }
    ]
}