{
    "url": "https://naturalengland.blog.gov.uk/2025/10/02/nature-recovery-projects-next-steps-for-growing-collaborative-action-that-drives-nature-recovery/",
    "title": "Nature Recovery Projects – next steps for growing collaborative action that drives nature recovery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Local Nature Recovery Strategy (LNRS)",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2025-10-02T09:46:17+01:00",
    "content": [
        {
            "text": "Acting for nature recovery at scale"
        },
        {
            "text": "Defra and Natural England invested £7.4 million to initiate twelve landscape-scale Nature Recovery Projects (NRPs) across the country, over the three years of the Comprehensive Spending Review 2022/23-2024/25. Covering over 319,480ha, these projects were designed to turbo drive collaborative action for nature recovery at scale, aimed at restoring entire ecosystems. This has made them a driver in growing a network of bigger, better, joined-up wildlife-rich places that counters biodiversity loss, climate change and improves access to nature."
        },
        {
            "text": "Since launching in 2021, 2022 and 2023, NRPs have targeted action for nature recovery through locally led collaborative partnerships that encourage innovation, sharing knowledge and resource. This includes aligning policies, delivery levers and funding streams that trial and demonstrate how blended public and private finance can support the delivery of a national network for nature recovery that underpins local economies. "
        },
        {
            "text": "What have Nature Recovery Projects achieved?"
        },
        {
            "text": "1.            G7 Legacy Project for Nature Recovery, Cornwall"
        },
        {
            "text": "The G7 legacy Project, was the first NRP to launch in 2021. Its focus has been the restoration of habitat within 21,000ha affected by mining and the china clay industry in mid-Cornwall. The project connects nature reserves such as Goss Moor NNR and a suite of Cornwall Wildlife Trust (CWT) reserves. Over 5,000 hectares of habitat and 18km of Cornish hedge has been restored or created for nature. The partnership has worked on species resilience, successfully improving habitats for dormice, marsh fritillary butterflies and willow tit and plans to sequester CO₂ through wetland restoration. Research and development undertaken has led to the discovery of the largest seagrass bed in Cornwall. As a direct consequence of work undertaken on the NRP, CWT have received Heritage Lottery Funding for a 5-year project to extend work undertaken on nature recovery in the area. Tor-to-Shore strengthens the existing partnership of which Natural England continues to be a part."
        },
        {
            "text": " 2.           Purple Horizons, West Midlands"
        },
        {
            "text": "Launched in May 2022, Purple Horizons is restoring and connecting fragmented heathlands to create a mosaic of heathland-wetland-woodland-grassland within a landscape of 12,000ha. The project has been working to connect Sutton Park National Nature Reserve and Cannock Chase Special Area of Conservation, together with local Wildlife Trust nature reserves. 43ha of habitat have been restored to date. Research is informing action for pollinators, habitat mapping, wetland restoration and community engagement. The partnership won the 2023 public sector award at the West Midlands Combined Authority Natural Environment Awards, with partner, Walsall Council, winning the Defra Bees Needs Champion Award in 2024.  Its latest success involved Walsall obtaining Nature Towns and Cities funding for a \"Nature and Health Strategy 2040\"."
        },
        {
            "text": "3.            Wye Valley, East Midlands"
        },
        {
            "text": "The Wye Valley NRP aims to better connect high quality but fragmented grassland habitat within 10,000ha of the Peak District National Park. Collaborative work with landowners and Catchment Sensitive Farming colleagues has led to a survey of invertebrate pollinator species with the Bumblebee Trust, showing the benefits of herbals leys for pollinator species when compared with perennial ryegrass silage fields.  Collaborating with the county council and local authorities, the ‘Wye Valley Roadside Verges Survey’ investigated the use of the roadside verge network as wildlife corridors. Forecasting of potential carbon and biodiversity net gain (BNG) credits has shaped the development of two 30-year management plans and research looking at the potential application of BNG with the Wildlife Trust. Solar mapping has identified potential climate refugia within the dales with dew ponds, important for great crested newts, restored. Within the Derbyshire Dales National Nature Reserve, the River Lathkill Restoration Plan is providing an analysis of restoration opportunities for 6.5km of the river over 13 reaches alongside underground survey work. The partnership has been working with University of Liverpool to research opportunities for nature recovery, including investigating the importance of nature recovery to campsite visitors. "
        },
        {
            "text": "4.            Somerset Coast, Levels and Moors"
        },
        {
            "text": "This partnership works within a 41,000ha area with a focus on restoring this wetland landscape for wildlife and to alleviate flood risk for people. A climate change risk and natural capital assessment of 3,500ha has informed a Landscape Recovery Scheme, bringing together 100 landowners to restore the floodplain, helping to manage flooding in the area. 100 hectares of wetland habitat on peat soils has been restored while solar pump research is hydrating 70ha of peatland. New wetland features have been successfully colonised by rare Lesser Silver Diving Beetle and Great Crested Newt. The installation of 12 eel passes help this critically endangered species to move and thrive in a changing climate. New monitoring techniques are being trialled, including audio recorders and thermal imaging cameras on drones to identify and locate bird species and nesting locations. Biodiversity Net Gain (BNG) market analysis has enabled Somerset County Council to plan for the implementation of BNG policy."
        },
        {
            "text": "5.            Cambridge Nature Network"
        },
        {
            "text": "The Cambridge Nature Network works within 9,200ha in and around the City of Cambridge. Partners have contributed to a coordinated plan to enhance nature, increase climate resilience, and deliver for societal and economic wellbeing. Since 2022 over 24 projects have been completed with over £500,000 invested. This includes converting farmland into new chalk grassland, restoring ancient trees and meadowland and establishing woodland at Wandlebury Country Park and Lower Valley Farm in the Gog Magog Hills. Research into species recovery in the Gog Magog Hills and the Cambridge Fens has been completed, alongside opportunities for orchard creation and restoration to the north of Cambridge. Wetland restoration has been undertaken at Milton Country Park while the local communities north of Cambridge have been involved in tree planting. Farm Clusters have been supported to undertake conservation grazing and regenerative farming."
        },
        {
            "text": "6.            Wendling Beck, Norfolk"
        },
        {
            "text": "This project is creating and enhancing grasslands, heathland, woodlands and wetlands within a 10,000ha landscape to connect and increase populations of rare flora and wildlife. 5,000m of river has been restored and created, alongside the reversion of 65 acres of heath and acid grassland from arable. Other achievements include the recovery of 50 acres of lowland meadow, 75 acres of other species-rich grassland, 100 acres of parkland, 10 acres of lowland fen, 20 acres of woodland, 15 acres of scrub, 2,000 metres of hedgerows and 600 meters of rare chalk stream. 2,367 species have been recorded. 250,000 tonnes of carbon have been sequestered to date and over 3,000 biodiversity units identified. Core partners have formed an independent consultancy focused on green finance, to assist delivery. A conservation covenant with responsible authority and RSK, is providing nutrient credits from taking arable land out of production. Access continues to flourish, as 30 -150 people per day are using the NRP funded Wendling Way cycle path."
        },
        {
            "text": "7.            East of Eden, Cumbria"
        },
        {
            "text": "This project has facilitated increased co-operation and understanding across multiple organisations, farmers and advisers within an area of 102,000ha. A partnership steering group, including the Farmer Network and the Federation of Cumbria Commoners, has undertaken baseline mapping. An interactive database has been developed to identify target areas, restore woodland, peatland and species, alongside a deer management strategy.  Blended finance opportunities have been identified through engagement with Highways England and Landscape Connections. Research into grazing options for moorland mosaics has led to the development of a Countryside Stewardship proposal which will improve 4,600ha of habitat in a key NRP linkage area. This will result in improved management of 40ha of limestone grassland, the enhancement of dry heath and blanket bog over 4,000ha and the creation of 50ha of scrub. East of Eden funded research has resulted in the development of a partnership project on a 1,500m stretch of the River Eden which will resolve river erosion and enhance habitat through natural flood management. Research into bird populations, tree planting and grazing management is informing agri-environment proposals across the project area."
        },
        {
            "text": "8.            The Tees Estuary Project"
        },
        {
            "text": "The Tees Estuary Nature Recovery Partnership works within an area of 17,179ha, underpinning growth through providing environmental, economic and social outcomes. The partnership is working to improve, create and restore the special interest features of designated sites, including feeding and roosting waders and wildfowl. New footpath links are improving connectivity between sites. This includes work to ‘re-green’ 26 miles of the King Charles III England Coast Path as a wildlife corridor and collaborating with the Tees Tidelands programme to develop an 8-mile circular walking route including the installation of a new bird hide. Joining up at landscape scale will enhance land management, improve climate resilience, prevent flooding and improve access to green space. Research is informing action required for key priority species, including Purple Milk Vetch, Water Vole, European Eel, Native Wild Oyster, Blue Mussel and Seagrass. An investible proposition in development with the RSPB will restore a natural waterway within 100ha of former arable land at ‘Wild Saltholme’. This new wetland habitat will benefit waders and waterfowl listed within the SPA/RAMSAR. Work underway has directly influenced Nature Towns and Cities funding allocated to the Tees Urban Nature Network partnership led by Redcar and Cleveland Borough Council."
        },
        {
            "text": "9.            Heathland Connections, Surrey"
        },
        {
            "text": "The Heathland Connections partnership of landowners and farmers works within a landscape of 16,000ha. Partners have been working to enhance, restore, create and connect wildlife-rich heathland habitat across Surrey Hills AONB with large areas already designated such as Thursley, Hankley and Frensham Commons SPA (Special Protection Area). The partnership is working on innovative solutions to management challenges, such as habitat degradation, disturbance to ground nesting birds, and wildfire risk. Partners have engaged with over 80 landowners in the project area, influencing over 1,500 hectares of land use. The NRP has led to the declaration of a new ‘super’ National Nature Reserve, Wealden Heaths, spanning 2,765ha across nine partner organisations. Species work includes the development of a Heathland Code to encourage responsible behaviour during ground nesting bird season, and an action plan supporting the recovery of amphibians and reptiles. Research undertaken includes ecohydrological surveys, BNG, visitors and the mapping of priority habitats."
        },
        {
            "text": "10.         Bollin to Mersey"
        },
        {
            "text": "Bollin to Mersey forms part of a regional ambition to reclaim, restore, and rewet a mosaic of wetland habitats in south Manchester and north Cheshire within a landscape of 39,102ha, largely lost through historic industrialisation and urbanisation of the landscape. Work to map and model historic, current and future pond, meadow and wetland designs has led to the project being shortlisted for an award by the Landscape Institute. New projects and partnerships are promoting accessible green spaces at Wythenshawe Hospital. Working with children and young adults in deprived boroughs of South Manchester has led to the development of activities in local green spaces for children and young people. The partnership is supporting the Bollin Valley Group/Cheshire Landscapes Group to develop a Landscape Recovery Round 3 bid. It is also enabling the South Manchester Urban Brooks partnership to bring together un-fundable fragmented sites into a single portfolio of fundable projects. This has involved drawing together information on baseline habitats, Green Finance readiness, delivery readiness, alignment with draft Local Nature Recovery Strategy measures, and assessments of ecosystem services. Manchester, which overlaps with the NRP, and nearby Salford have been successful in securing Nature Towns and Cities funding, aimed at connecting urban nature."
        },
        {
            "text": "11.         Bradford and South Pennines"
        },
        {
            "text": "This project, undertaken within an area of 30,000ha, has been a catalyst for a range of activities benefiting a diverse range of people of all ages in Bradford, culminating in the declaration of the first NNR in Bradford and a suite of eight complimentary local nature reserves. The project’s work to restore and enhance upland landscapes such as Ilkley Moor, benefits climate resilience and natural flood management techniques, in turn protecting communities. The new partnership has succeeded in driving £600K investment into Bradford and Calderdale. A further £700K Nature and Wellbeing project from public health was influenced through NRP collaboration and mapping work with partners such as NHS Bradford District Care Trust and the voluntary sector. The NRP has supported the wild uplands programme at Bradford 2025 and scoped a potential round 3 Landscape Recovery application. Collaboration for nature recovery undertaken through the NRP has influenced Bradford’s success in receiving Nature Towns and Cities funding."
        },
        {
            "text": "12.         Seaford to Eastbourne"
        },
        {
            "text": "The partnership works within a 12,000ha landscape to improve land management of the chalk grass and heathland habitats to maximise the water infiltration that supplies the drinking water aquifers for Seaford and Eastbourne. Climate resilience has been a priority, with action undertaken to restore the canalised Cuckmere River alongside shingle surveys that support a coastal defence management strategy. Out to sea, the Species Recovery Fund has been utilised to recover the seahorse population. This has involved eDNA work and potential locations for the installation of ‘seahorse hotels’ while evidencing wider work to alleviate pressures from bottom-towed fishing gear within the MCZs. Nature-based training and research with NHS mental health practitioners has focused on suicide prevention.  Focus is now being given to the proposed declaration of a new 1,299.30ha Seven Sisters super National Nature Reserve."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Now that the 3-year dedicated funding programme is complete, 2025/26 will see the work undertaken by NRPs transition into ‘business as usual’ as we continue and extend the drive for nature recovery across the country and prepare for the delivery of Local Nature Recovery Strategies (LNRS). Many of the NRPs will become partner-led initiatives, fulfilling their purpose as evolved, self-sufficient projects. These NRPs will continue to lead the way in demonstrating how place-based partnerships can deliver real change in delivering nature recovery, as set out in Natural England’s strategic direction 2025-2030. Opportunities for blended finance continue to be explored. This includes maximising the use of public funding opportunities such as Landscape Recovery, Protected Site Strategies and species focused seed corn funding. Where possible, delivery will be also be strengthened by grants, such as the National Lottery Heritage Fund. Critical to project development is growing private sector funding that supports nature recovery and environmental security. In some cases, this work is already hand, such as the National Heritage Lottery funded Tor-to-Shore project in Cornwall, and the newly launched Tees Estuary Nature Recovery Partnership."
        },
        {
            "text": "All NRPs have provided invaluable insight which is informing the mandatory development of LNRS, and are expected to become part of their delivery, as LNRSs provide a pipeline of projects underpinned by lessons learned and shared partnerships.  This will continue the drive for collaborative action and place-based delivery that meet statutory targets for biodiversity, 30by30 ambitions and grows a national network for nature recovery."
        }
    ]
}