{
    "url": "https://planninginspectorate.blog.gov.uk/2025/10/02/successful-local-plan-development-working-together-and-preparing-better/",
    "title": "Successful local plan development: Working together and preparing better",
    "authors": [
        "Andrew Megginson"
    ],
    "categories": [
        "Examinations",
        "Local plans"
    ],
    "pub_date": "2025-10-02T12:24:10+01:00",
    "content": [
        {
            "text": "Andrew Megginson is Head of Service for Local Plans at the Planning Inspectorate where he leads the operational delivery of local plan examinations across England. Together with Simon Berkeley, Professional Lead for Local Plans, they recently delivered a comprehensive webinar on preparing local plans for successful examination."
        },
        {
            "text": "Last week, Simon and I had the privilege of hosting a webinar titled \"Getting it right first time: Preparing your local plan for successful examination\". With over 400 attendees and a wealth of questions from attendees, it reinforced just how critical this moment is for local plan making."
        },
        {
            "heading": 2,
            "text": "The scale of the challenge"
        },
        {
            "text": "The statistics we shared paint a clear picture: only 27% of local planning authorities currently have an up-to-date local plan. With the government's commitment to delivering 1.5 million homes by 2029, local plans play an essential role in enabling plan-led development. Our projections show 147  additional plans expected for submission between now and the end of 2026 – a dramatic increase from the 18 plans we examined in 2023/24."
        },
        {
            "text": "This step change in demand has prompted us to think differently about how we support local authorities through the examination process. It's not just about managing our own resources – though we've significantly expanded our inspector base and continue recruiting – it's about working collaboratively to ensure plans arrive ready for examination."
        },
        {
            "heading": 2,
            "text": "Clear messages from government"
        },
        {
            "text": "The Minister of State's letter of 30 July 2024 was, in many ways, a game changer. It raised the bar for plan quality at submission, making clear that local planning authorities must not submit plans unless  they're genuinely ready for independent examination. The presumption that inspectors will use significant time and resources to 'fix' fundamental problems during examinations is no longer acceptable."
        },
        {
            "text": "This isn't about being less supportive – quite the opposite. It's about being smarter in how we channel that support to where it can be most effective: during plan preparation rather than when it’s too late."
        },
        {
            "heading": 2,
            "text": "The fundamentals still matter"
        },
        {
            "text": "During our webinar, Simon Berkeley reminded everyone that the basic requirements haven't changed. Legal compliance, including the duty to cooperate, remains absolutely critical – and it's the one thing an inspector legally cannot remedy for you during examination. The four tests of soundness continue to be the benchmark against which all plans are assessed."
        },
        {
            "text": "However, we're seeing recurring issues: inadequate consideration of alternatives in sustainability appraisals, unresolved duty to cooperate problems, unrealistic delivery assumptions, and poor integration between evidence and policies. These are preventable problems, but they require attention during plan preparation, not at examination."
        },
        {
            "text": "Simon was clear in his advice – seek support before you submit, use Advisory Visits (which are free of change) and don’t submit if you’re in doubt over those four tests of soundness."
        },
        {
            "heading": 2,
            "text": "Questions from the field"
        },
        {
            "text": "The Q&A session revealed some important insights into concerns shared within the system. Many questions focused on the transition between the current and new planning systems – and it’s clear planned upcoming guidance on the new system will be welcomed."
        },
        {
            "text": "Resource pressures featured heavily, both in terms of local authority capacity and concerns about our own ability in the Inspectorate to process the anticipated volume of submissions. Questions about programme officer availability, sustainability appraisal requirements, and the practicalities of examination websites all highlighted the operational challenges that sit alongside the policy complexities."
        },
        {
            "text": "Perhaps unsurprisingly, many questions sought clarity on aspects of the new system that simply aren't finalised yet. This uncertainty is challenging, but as we emphasised in the webinar: \"don't stop planning.\" The fundamental work of evidence gathering, community engagement, and policy development continues regardless of which system ultimately applies."
        },
        {
            "heading": 2,
            "text": "Our support offer"
        },
        {
            "text": "One theme that ran throughout both the presentation and the questions was the importance of early engagement. The Planning Inspectorate has significantly expanded our Advisory Visit service – these free, without-prejudice discussions with experienced inspectors can help identify potential issues before they become examination blockers.  If you would like to book in an Advisory Visit please contact us at: plans.admin@planninginspectorate.gov.uk"
        },
        {
            "text": "We've also enhanced our programme officer training, recognising that an efficient programme officer can save considerable time and ensure smooth examination processes. Our next training session is on 5 November, and I'd encourage any authority considering internal recruitment to take advantage of this free resource. Please contact us for further details."
        },
        {
            "text": "From 6 October, we introduce pre-examination checklists – another tool to help ensure plans are genuinely ready before formal submission. These aren't barriers but support mechanisms, providing early feedback on practical readiness and essential documentation."
        },
        {
            "heading": 2,
            "text": "Planning reform: preparing for change"
        },
        {
            "text": "The new gateway approach, with its emphasis on pre-submission checks and streamlined processes, reflects many of the same principles we're already advocating: better preparation leads to more efficient examinations."
        },
        {
            "text": "Gateway Two, in particular, offers extended opportunities for dialogue between authorities and inspectors – essentially an enhanced version of our current Advisory Visit service. While we await detailed regulations, the direction of travel is clear: more front-loaded support and collaboration during plan preparation."
        },
        {
            "text": "The digital transformation agenda is equally significant. The Planning Inspectorate's Digital & Data team is exploring a centralised service for submitting relevant representations on local plans, aiming to reduce burdens on local planning authorities and create consistent citizen experiences. This complements MHCLG's Create and Update a Local Plan (CULP) service and the new Gateway process to streamline the planning system and improve decision timelines."
        },
        {
            "heading": 2,
            "text": "The choice ahead"
        },
        {
            "text": "For many authorities, an important decision is on the horizon: complete your plan under the current system or wait for the new regime. As we emphasised in the webinar, you can't straddle both tracks – the choice needs to be made decisively."
        },
        {
            "text": "What you can do now, regardless of your chosen path is to continue planning. The development of a local plan will still include evidence base development, baseline data gathering, engagement planning, and governance arrangements. Most importantly, keep us informed of your intentions so we can resource appropriately."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "The transition period will be challenging, but our message is clear: don't let uncertainty become paralysis. Whether you're working within the current system or preparing for the new one, the fundamental principles of good plan-making remain constant."
        },
        {
            "text": "We're committed to being part of the solution, developing new resources based on your feedback and working closely with MHCLG on the detailed design of the new system. The poll from our webinar will help shape our future support offer – more topic-specific workshops and guidance tailored to the issues you're actually facing."
        },
        {
            "text": "Success will require close collaboration between local authorities, the Planning Inspectorate, government departments, and the wider planning community. We're here to help through Advisory Visits, programme officer training, pre-examination checklists, and ongoing dialogue about your plan preparation."
        },
        {
            "text": "The next few years will test our collective capacity and resilience, but they also offer the opportunity to build a more effective, responsive planning system. By working together and learning from each other's experiences, we can navigate this transition successfully."
        },
        {
            "text": "As we said in the webinar, prevention is better than cure. Let's use the tools available to get it right first time."
        }
    ]
}