{
    "url": "https://environmentagency.blog.gov.uk/2025/10/02/winter-farm-preparation-a-guide-for-farmers-after-a-dry-season/",
    "title": "Winter farm preparation: a guide for farmers after a dry season",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Climate change",
        "Drought"
    ],
    "pub_date": "2025-10-02T09:00:58+00:00",
    "content": [
        {
            "text": "As autumn begins, many farmers are still feeling the effects of prolonged dry weather and drought despite recent rainfall. The Environment Agency remains committed to supporting the farming community - not only in managing drought impacts, but also in preparing for winter challenges such as flooding, slurry storage and reservoir refilling."
        },
        {
            "heading": 2,
            "text": "How has drought affected farmers?"
        },
        {
            "text": "This year’s dry conditions led to early harvests, reduced yields, and poorer quality in some crops. Livestock farmers have had to dip into winter feed supplies early, with some facing difficult decisions around feed costs and herd management. The Addington Fund, including Forage Aid, has launched an emergency appeal to support those most affected."
        },
        {
            "text": "The NFU continue to hear from farmers concerned about pasture quality, rising feed costs and calf development."
        },
        {
            "text": "There have been some upsides - dry spring conditions supported strong pollination and early harvests in some crop types - but the overall picture remains challenging."
        },
        {
            "heading": 2,
            "text": "What should farmers do to prepare for winter?"
        },
        {
            "text": "With the irrigation season ending and soils beginning to re-wet, now is the time to take stock and prepare."
        },
        {
            "heading": 3,
            "text": "How to manage reservoir refilling after drought"
        },
        {
            "heading": 3,
            "text": "Essential reservoir maintenance tasks"
        },
        {
            "heading": 3,
            "text": "Winter slurry storage preparation"
        },
        {
            "heading": 3,
            "text": "Flood risk management for farms"
        },
        {
            "heading": 3,
            "text": "How can farmers build long-term climate resilience?"
        },
        {
            "text": "Even with the wetter weather, now is a good time to consider how your farm can become more resilient to future droughts and climate variability:"
        },
        {
            "text": "By making these changes, you can make yourselves and your farm more resilient to dry weather and the longer-term effects of climate change. Farming Advice Newsletters  provide useful abstraction reminders and the Farming Advisory Service also publish our irrigation prospects in the spring."
        },
        {
            "heading": 3,
            "text": "Hemlock poisoning"
        },
        {
            "text": "Hemlock poisoning has been reported in livestock in Wales this summer. Dry weather and exposed ditches increase the risk of animals foraging toxic plants like Hemlock. "
        },
        {
            "text": "Farmers should look out for:"
        },
        {
            "text": "Hemlock is deadly to animals and humans when ingested. Roots and seeds are especially toxic. Farmers should stay alert. If removing Hemlock, wear protective gear and dispose of plants safely. Read more about Hemlock here. "
        },
        {
            "heading": 2,
            "text": "Where can farmers get support and advice?"
        },
        {
            "text": "We’re working closely with partners across flood risk management and agricultural support to ensure farmers have the guidance they need. "
        },
        {
            "text": "For help, questions, or feedback, please contact your local Environment Agency office or explore our online resources, including the Water Hub."
        }
    ]
}