{
    "url": "https://marinedevelopments.blog.gov.uk/2025/10/02/working-together-to-protect-harbour-porpoise/",
    "title": "Working Together to Protect Harbour Porpoise",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "fisheries",
        "marine conservation",
        "Uncategorized"
    ],
    "pub_date": "2025-10-02T11:24:58+01:00",
    "content": [
        {
            "text": "For those who work at sea, Harbour porpoises are a familiar sight around our coast. They have a wide diet, feeding mostly on fish, including sandeels, herring and whiting, as well as on squid and crustaceans. As predators they help to regulate and balance fish stocks. This means they play a key role in maintaining a healthy and functioning marine ecosystem, which benefits fishers and the seafood industry."
        },
        {
            "text": "But evidence suggests that accidental capture of harbour porpoise, known as bycatch, is happening at unsustainable levels, which could be impacting the condition of two key marine protected areas (MPAs), the Southern North Sea MPA and the Bristol Channel Approaches MPA."
        },
        {
            "text": "The loss of these marine mammals could have serious consequences for our marine environment. However, there are evidence gaps on harbour porpoise bycatch, including on locations, times of year and gear types associated with high or low levels of porpoise bycatch. "
        },
        {
            "text": "This is why we want to work with fishers to both understand and reduce bycatch."
        },
        {
            "text": "Fishers have the knowledge to be part of the solution"
        },
        {
            "text": "We know harbour porpoise bycatch is accidental. No one sets out to harm protected marine wildlife. That’s why we’re inviting fishermen to help shape the future of bycatch management, because your knowledge of the sea is essential."
        },
        {
            "text": "Whether it’s identifying bycatch hotspots or coldspots (areas or fisheries with a high or low risk of porpoise bycatch), sharing seasonal patterns, or testing gear modifications, your insights can help build practical, effective solutions that actually work at sea. We want to understand the circumstances of where and when porpoise bycatch is or isn’t occurring, based on your experiences, and hear your views on potential management options at an early stage."
        },
        {
            "text": "Information you share could help determine appropriate management, including spatial scale and context, for harbour porpoise bycatch."
        },
        {
            "text": "What’s being proposed"
        },
        {
            "text": "The MMO is exploring six potential management options. These are not final decisions, they’re starting points for discussion that you can help shape, amend or offer alternatives to:"
        },
        {
            "text": "These ideas are open for feedback. We want to hear what’s workable, what’s not, and what might need tweaking."
        },
        {
            "text": "Listening first"
        },
        {
            "text": "Before any formal progress is made towards managing harbour porpoise bycatch, we want to gather you feedback early. How you can get involved:"
        },
        {
            "text": "Attend our upcoming engagement events"
        },
        {
            "text": "Aimed primarily at gillnet fishers, we’re hosting a series of in-person workshops around the coast, and we invite you to join us to share your insights and knowledge. Beginning in the Southwest, catch us in:"
        },
        {
            "text": "Lyme Regis"
        },
        {
            "text": "Date: Tuesday 7 October"
        },
        {
            "text": "Time: 2pm to 4:30pm"
        },
        {
            "text": "Venue: The Fishing College, The Cobb, Lyme Regis, DT7 3JJ"
        },
        {
            "text": "Register via Eventbrite."
        },
        {
            "text": "Brixham"
        },
        {
            "text": "Date: Wednesday 8 October"
        },
        {
            "text": "Time: 1pm to 3:30pm"
        },
        {
            "text": "Venue: Brixham Trawler Agents Ltd, The New Fish Quay (Training Room), Brixham, TQ5 8AW"
        },
        {
            "text": "Register via Eventbrite."
        },
        {
            "text": "Newlyn"
        },
        {
            "text": "Date: Thursday 9 October"
        },
        {
            "text": "Time: 11am to 1:30pm"
        },
        {
            "text": "Venue: Cornish Fish Producers Organisation Ltd, 46 Fore Street, Penzance, Newlyn, TR18 5JR"
        },
        {
            "text": "Register via Eventbrite."
        },
        {
            "text": "Newquay"
        },
        {
            "text": "Date: Thursday 9 October"
        },
        {
            "text": "Time: 4pm to 6:30pm"
        },
        {
            "text": "Venue: Newquay Rowing Club, South Quay Hill, Newquay, TR7 1HR"
        },
        {
            "text": "Register via Eventbrite."
        },
        {
            "text": "Quayside drop-in in Ilfracombe"
        },
        {
            "text": "Date: Friday 10 October"
        },
        {
            "text": "Time: 10am to 11am"
        },
        {
            "text": "Venue: Ilfracombe Harbour Office (Boardroom), The Pier, Ilfracombe, EX34 9EQ"
        },
        {
            "text": "Register via Eventbrite."
        },
        {
            "text": "We’re currently planning the next series of workshops for later this year in the East. Future events will be published here: Managing England's Offshore Marine Protected Areas | Eventbrite."
        },
        {
            "text": "Find out more about working together to reduce harbour porpoise bycatch: Managing harbour porpoise bycatch in English waters - GOV.UK"
        },
        {
            "text": "Further guidance "
        },
        {
            "text": "Read current advice on reducing bycatch and complying with existing regulations: Reduce dolphin and porpoise bycatch – GOV.UK "
        }
    ]
}