{
    "url": "https://hmlandregistry.blog.gov.uk/2023/10/13/my-new-property-is-not-registered-yet/",
    "title": "My new property is not registered yet!",
    "authors": [
        "HM Land Registry"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2023-10-13T14:43:30+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Why isn’t my property registered to me yet according to HM Land Registry records? "
        },
        {
            "text": "If you’ve just bought a property and you look at Zoopla or Rightmove – or even HM Land Registry's own service – you may be surprised to see that your name and the price paid hasn’t been added to your official property record yet. In the vast majority of cases, you do not need to worry about this. There are a few specific cases (explained below), where HM Land Registry registrations could potentially cause owners an issue but, even then, there is a simple – and free – solution available. "
        },
        {
            "text": "Normally, no problems arise from properties not being registered to their new owners yet. This is because registration happens after the property is sold – usually after completion and collection of the keys, and after Stamp Duty or Land Transaction Tax (if applicable) has been paid. The sale is legal, the new owner can move in, and the property is theirs. Their legal rights are protected in the Land Register the moment we receive the new application, not from the day we actually register it which will be some time later because the sale needs to happen first. "
        },
        {
            "heading": 2,
            "text": "What HM Land Registry does "
        },
        {
            "text": "HM Land Registry plays a key role in the property market, providing an official record of all property ownership and the financial loans (normally mortgages) against all property in England and Wales. This provides assurance for further money lending, and so keeps the property market running. Without this, the property market would simply stop. "
        },
        {
            "text": "Most people probably don’t even know about HM Land Registry until they see the line on their conveyancer’s itemised bill. Or possibly when they receive a form to sign, with witnesses, to agree to the sale of the property with our  logo at the top. They may also use platforms such as Rightmove but not realise the data’s sourced from us.  "
        },
        {
            "heading": 2,
            "text": "When is HM Land Registry involved in the property-buying process?"
        },
        {
            "heading": 3,
            "text": "Before a property sale"
        },
        {
            "text": "Before a property is sold, we provide information about the ownership of that property. We currently provide that information within three working days, mainly because this service is largely automated.  "
        },
        {
            "heading": 3,
            "text": "After a property is sold"
        },
        {
            "text": "After a property sale, we register the new owners’ details and any mortgage they have. The sale is legal, the new owner can move in, host house-warming parties or start any renovations they want. The property is legally theirs from the moment we receive the application which we will then start processing.  "
        },
        {
            "text": "To see the current timescales for processing applications, you can check our current processing times on GOV.UK. It’s worth repeating that the owners’ ‘interest’ in the property is legally protected from the moment we receive the application, not the later date when we finish processing it and update the register.  "
        },
        {
            "text": "There are a few specific cases where HM Land Registry registrations could potentially cause owners an issue but, even then, there is a simple – and free – solution available: our fast-track service."
        },
        {
            "heading": 2,
            "text": "When can an application be fast tracked?"
        },
        {
            "heading": 3,
            "text": "Quick sales and remortgages "
        },
        {
            "text": "If someone buys a property and then decides to remortgage or sell it just a short while later, their registration may not have been completed yet, meaning they cannot sell or remortgage the property. This does not happen very often but, when it does, the applicant can request that their application is fast tracked and moved to the front of our queues (we call this 'expediting'). This is an extremely successful service, with over 95% of cases processed within 10 working days allowing them to continue with their sale or remortgage. It is also free of charge."
        },
        {
            "heading": 3,
            "text": "Registering very old or very new properties"
        },
        {
            "text": "The other area which can potentially cause issues is registering a property for the first time – perhaps if it’s an old house or part of a new build development. We’re seeing some longer registration delays here, as these tend to be more complex applications that require more detailed mapping and often need us to ask applicants for more details to ensure we get the precise aspects of ownership correct. In fact, two thirds of these ‘complex’ applications need some clarifying, which can cause delays.  "
        },
        {
            "text": "So, if you have bought an older house, or a new build, and are thinking about refinancing or remortgaging, it would be worth checking the registration details and, if necessary, requesting our fast-track service to bring our records up to date with your ownership."
        },
        {
            "text": "So, if a delay in registration is causing problems, whether legal, financial or personal, our criteria for fast tracking are met. Remember, there is no additional charge from HM Land Registry to use this service – it is free."
        },
        {
            "heading": 2,
            "text": "What else you can do"
        },
        {
            "text": "This is a simplified account of our work. Land registration and property law can be incredibly complex. However, it covers the vast majority of property sales. Inevitably, there will be some cases which take a little longer, or face particular issues. If you have any concerns about these affecting you, we would encourage you to contact us.  "
        },
        {
            "text": "There is no reason that your property transaction should be affected by any processing delays at HM Land Registry. "
        },
        {
            "text": "However, if you think your plans might be affected by your property not being registered yet, please request an expedite. This free service is helping thousands of people each month to do things such as move home, change their registered names after marriage or divorce, or manage a property after a bereavement."
        },
        {
            "heading": 2,
            "text": "What are we doing?"
        },
        {
            "text": "As long as the application has been submitted to us, any delays in registering the property aren’t anything to worry about. This doesn’t mean however that we’re not always working to reduce the time between receiving an application and registration."
        },
        {
            "text": "For more information about what we’re doing to improve our speed of service for customers, including hiring over 1,500 new caseworkers, please read our recent blog on measures to help our customers."
        },
        {
            "text": "If you’re interested in learning more about our role in the conveyancing process, you can also watch our recently published video aimed at supporting new conveyancers."
        }
    ]
}