{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/10/13/recognising-your-excellence-a-recap-of-the-gse-professional-recognition-week/",
    "title": "Recognising your excellence: A recap of the GSE Professional Recognition Week",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Learning & Development"
    ],
    "pub_date": "2023-10-13T09:57:17+01:00",
    "content": [
        {
            "heading": 3,
            "text": "GSE Professional Recognition Week"
        },
        {
            "text": "The GSE Professional Recognition Week has come to an end, thank you so much to all who attended. Professional Recognition Week provided a space to introduce the GSE Professional Recognition Offer to our GSE Members who include a wide range of science and engineering specialists across government."
        },
        {
            "heading": 3,
            "text": "What did attendees say about our Recognition Week webinars?"
        },
        {
            "text": "As a reminder, the Government Science and Engineering (GSE) Profession considers professional recognition as any form of recognition from a professional organisation, be that as a member, a registered scientist, technician, incorporated engineer or becoming fully chartered. You can find out more about the benefits of Professional Recognition in our previous blog Your next step: The importance of Professional Recognition, which includes perspective from Dame Angela McLean, Government Chief Scientific Adviser."
        },
        {
            "heading": 3,
            "text": "Partner professional organisations"
        },
        {
            "text": "The GSE Profession would also like to give a big thank you to our partner professional organisations who delivered bespoke introductory webinars on their organisation's specialist areas."
        },
        {
            "text": "Our partnership with the Science Council opens our offer to over 30 more organisations. Are you interested in another science or engineering Professional Organisation? The GSE Profession can offer similar support for most science or engineering Professional Organisations. Get in touch with us to see if we already have a contact for your chosen organisation."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "If you are interested in starting your professional recognition journey, contact the Government Science and Engineering Profession at gse@go-science.gov.uk today!\nInclude in the title of the email ‘Professional Recognition: Start my journey’ to gain access to:"
        },
        {
            "text": "If you are already professionally recognised with any professional organisation, contact the GSE Profession at gse@go-science.gov.uk to become a mentor or share your story as a case study."
        }
    ]
}