{
    "url": "https://educationhub.blog.gov.uk/2023/10/13/secondary-school-applications-deadline-2023-how-where-apply/",
    "title": "Secondary school applications deadline 2023: How and where to apply",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-10-13T10:37:30+01:00",
    "content": [
        {
            "text": "The deadline for secondary school applications is approaching, and for your child to be in with the best chance of being offered a place at one of your preferred options, you need to send in your application before then. It’s a simple and straightforward process, which you can complete online. "
        },
        {
            "text": "Here we explain everything you need to know about how and when to apply to secondary school.  "
        },
        {
            "heading": 3,
            "text": "When is secondary school application deadline day? "
        },
        {
            "text": "The deadline to apply for secondary school places is 11:59pm on Tuesday 31 October 2023. "
        },
        {
            "heading": 3,
            "text": "What happens if I miss the deadline and can I still apply for my child? "
        },
        {
            "text": "It’s strongly recommended that you apply in time for 31 October 2023.   "
        },
        {
            "text": "You can still apply for a secondary school place for your child if you miss the deadline, but your application is likely to be considered after those who have applied on time.  "
        },
        {
            "heading": 3,
            "text": "Where do I apply for a secondary school place? "
        },
        {
            "text": "Applications should be made online through your local authority website wherever possible. "
        },
        {
            "heading": 3,
            "text": "What do secondary school admissions involve? "
        },
        {
            "text": "Secondary school admissions are organised by local authorities – usually referred to as councils. "
        },
        {
            "text": "You may be asked to supply proof of your address, and you will also need to list the schools you are applying for by order of preference.  "
        },
        {
            "text": "If you are applying for a faith school, you may also be asked to fill out a supplementary application form. If that is the case, you will also need to fill out your council’s main application form as well.  "
        },
        {
            "text": "For more information on the applications process contact your local council. "
        },
        {
            "heading": 3,
            "text": "Do I need to use all the school preference options when applying for a school? "
        },
        {
            "text": "We strongly encourage you to use all the preference options on the form. You will be given the opportunity to give at least three preferences and in some areas as many as six. "
        },
        {
            "text": "Using all your school preference options makes it less likely that you will be offered a place at a school that you haven’t expressed a preference for. "
        },
        {
            "text": "If you don’t receive an offer at your most preferred school, you’re likely to be offered a place at one of your other preferences.  "
        },
        {
            "heading": 3,
            "text": "Does using all the preference options reduce the chance of receiving an offer from my top choice?  "
        },
        {
            "text": "No. You won’t be penalised by a school for not putting them as top choice. In fact, the school will not know the order you listed the schools in – the schools consider all applications on the same basis. "
        },
        {
            "heading": 3,
            "text": "How do schools decide who to offer a place to? "
        },
        {
            "text": "Every child who has applied is listed in priority order, according to the schools’ published admissions criteria. The council then takes all the final lists and allocates places on this basis. You can find out the admission criteria for your local schools in the prospectus, published by your council.  "
        },
        {
            "text": "If your child is high enough up the priority list for your first choice, they will be offered a place. If not, the council will check the list for your second choice, and so on until a place is secured. "
        },
        {
            "text": "Your child will only be offered a place at a school you have not listed if they don’t have sufficient priority for any of your preferred schools. "
        },
        {
            "heading": 3,
            "text": "If I only list one school, is my child guaranteed a place there? "
        },
        {
            "text": "No. Even if you only name one school, if your child has insufficient priority, they will not be offered a place there. "
        },
        {
            "text": "In this instance, the council will make an offer of a school you didn’t list.  "
        },
        {
            "heading": 3,
            "text": "Do I still need to apply for a place if my preferred secondary school is linked to my child’s primary school? "
        },
        {
            "text": "You must still apply for a place, even if your chosen school is linked to your child’s primary school. "
        },
        {
            "heading": 3,
            "text": "When will I find out what secondary school place my child has been given? "
        },
        {
            "text": "You will be told what place your child has been given on 1 March 2024. Usually, you will be contacted by email. "
        },
        {
            "heading": 3,
            "text": "What happens if I don’t get into my first-choice school? "
        },
        {
            "text": "More than 8 in 10 families were offered their first-choice secondary school for this academic year and more than 9 in 10 got one of their top three choices. "
        },
        {
            "text": "If you aren’t happy with what you’re offered there are plenty of options available including: "
        },
        {
            "text": "It is important to know that you can both appeal the decision and add your child to the waiting list while also accepting the offer of the place at any school.  "
        },
        {
            "text": "Accepting that offer while you pursue other options means that your child does not risk being without a school place. "
        },
        {
            "heading": 3,
            "text": "How does the appeals process work for secondary school applications? "
        },
        {
            "text": "If your child is refused a place at your chosen school, you will have 20 school days to raise an appeal. "
        },
        {
            "text": "Your case must then be heard within 40 days of your appeal, and your school’s admission authority must give you 10 days’ notice before the hearing. "
        },
        {
            "text": "Your case will be heard by a panel of 3 or more people, where the admission authority will explain why they did not offer your child a place, and you will be given the chance to make a case for why your child should be admitted. "
        },
        {
            "text": "The appeals panel will then assess your case, with a decision usually sent to you within 5 days. "
        },
        {
            "text": "If the panel decides that the reasons you think your child should be admitted to the school outweigh the school’s reasons for refusing your child a place, your appeal will be upheld, and the school must admit your child. "
        },
        {
            "text": "More information on the appeals process can be found here. "
        }
    ]
}