{
    "url": "https://dvladigital.blog.gov.uk/2022/08/03/dvlas-it-transformation-our-story-so-far/",
    "title": "DVLA’s IT transformation – our story so far    ",
    "authors": [
        "Brian Sullivan"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2022-08-03T09:50:48+01:00",
    "content": [
        {
            "text": "As one of the first in government to bring our IT in-house we’ve established a firm foundation with our people skills programme, digital services development, and cloud technology platforms. We’re also continuing to find new and better ways to provide a best-in-class service for our customers and to support the digital growth at DVLA and across the region."
        },
        {
            "text": "Our digital and technology focus supports our Driving Change 3-year strategic plan and aims to accelerate our digital transformation plans to develop an agile technology and services platform. This will enable DVLA to pivot and respond quickly to changing customer and employee needs and future technology advances."
        },
        {
            "text": "Let me give you an update on what we’ve done so far…"
        },
        {
            "heading": 2,
            "text": "Cloud technology platforms"
        },
        {
            "text": "A big part of our digital transformation programme is Evolve; our 5-year strategic technology programme launched in 2020. Our aim is to radically transform how customers use our services and transact with us using an agile and iterative delivery approach, utilising our main strategic tenets, API enabled cloud native services development, and cloud first platform provisioning to move away from our legacy technology estate. This transformation creates a scalable, secure, and sustainable platform, enabling us to reduce the time, complexity, and cost of developing and deploying new customer services and business capabilities"
        },
        {
            "text": "We’re already seeing the benefits of this approach, using our in-house cloud skills, responsive technology patterns and agile working. Our digital change of address on your vehicle log book (V5C) service took only 6 weeks to develop during the pandemic - previously it would have taken at least 6 months. This was quickly followed by the launch of our online duplicate log book (V5C) service in just 12 weeks, again during the most challenging of times."
        },
        {
            "heading": 2,
            "text": "Creating customer-centric focused services"
        },
        {
            "text": "In March 2020, we launched a new application programme interface (API) developer portal and our first API to our vehicle enquiry service on GOV.UK. This was fundamental in supporting the Vehicle Enquiries Service API roll-out on GOV.UK and allows us to use the API portal for any of our online services in future."
        },
        {
            "text": "Our new fast online tachograph service for drivers is the first end-to-end service we’ve transformed to digital, migrating off our legacy estate, onto a new cloud-based architecture and data store. This means that lorry and bus drivers can apply and pay online, making the process much quicker and easier than ever before. It’s been a real success, with positive feedback from customers and online take up over 90%. This has paved the way for future services to move on to cloud technology, so we won’t have to start from the beginning every time."
        },
        {
            "text": "We’ve enhanced our ‘apply for your first provisional drivers licence’ online service to enable drivers to upload their photograph and signature online for the first time, speeding up the time it takes to process applications where the signature is not held by the Passport Office. This was a significant milestone in our ongoing transformation programme, with more than 460,000 customers using the service since its launch."
        },
        {
            "heading": 2,
            "text": "Working with other government departments"
        },
        {
            "text": "Working together with other government departments and organisations is critical to the success of the services we provide. We’ve created a new strategic enquiries platform which provides our stakeholders, commercial customers, and suppliers timely and secure information from our databases. We’re also developing a suite of re-usable APIs (to hold secure information) to support businesses and the wider transformation of public services. This has meant quick and easy access for businesses and other government departments who have permission to receive information from our databases."
        },
        {
            "text": "Through these API strategic enquiry platforms, we’ve been able to:"
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "Over the coming year, we’ll be working on a brand new Customer Account, currently in private beta, to allow you to access your driver and vehicle information all in one place.  We’ll also be introducing the option for you to receive a digital vehicle tax reminder through the account. This is a new way for customers to use and experience our services and increasingly digitally self-serve. Our aim is to offer most of our services through this account in the future."
        },
        {
            "text": "We’re also exploring the use of new technology to automate some processes when dealing with medical applications. Our recent pilot, where we used a Customer Relationship Management tool for drivers notifying us for the first time that they have diabetes, enhances our service by making it quicker for customers. Our next step will be to extend the use of the platform to include driving licence renewals from drivers with diabetes."
        },
        {
            "text": "As part of Evolve, we’re also working on the introduction of a digital driving licence. We’re gathering customer and industry insight to understand how a digital driving licence will work alongside the physical cards. It’s early in our discovery but a very exciting time to be exploring the introduction of GBs digital driving licences."
        },
        {
            "text": "Our transformation work is accelerating, and we’ll shortly be starting our vehicles transformation programme. It’s still in the early stages and means our digital transformation programmes will cover all DVLA’s services and its technology landscape, but I know we have the skills, capability, and passion to see this through as one of the leading digital departments in government."
        },
        {
            "heading": 2,
            "text": "Making sure we’ve got the capability"
        },
        {
            "text": "Our people are the cornerstone of our success now and in the future, and our vison is to be renowned as a Centre of Digital Excellence for the services we build and as a leader in the region, inspiring and attracting the next generation of digital and technology talent. We provide the latest training and professional certifications for our employees alongside our talent pipeline programmes, which include Ethical Hacking and degree apprenticeships in Cyber Security, Software Engineering and Data Science. Alongside this, and as a Centre of Digital Excellence, we’ve designed our own academies in Cloud and Software Development Engineering in Test (SDET) which is the first of its kind. We also invest in the digital skills of our community through our science, technology, engineering, and mathematics (STEM) volunteer programme."
        },
        {
            "text": "It’s a very exciting time here at DVLA, and being a dynamic, digital organisation means we’re committed to improving our services to ensure they’re even more flexible, responsive and fit for a changing future."
        },
        {
            "text": "Keep an eye on our blogs and our social media channels linked below to hear about the future of our digital transformation programme. If you’re interested in joining us at DVLA, you can find out more about our digital careers or visit Civil Service Jobs for our latest vacancies."
        },
        {
            "text": " "
        },
        {
            "text": "Follow DVLA on Twitter, Facebook and on LinkedIn. You can also subscribe to our Inside DVLA blog."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}