{
    "url": "https://defradigital.blog.gov.uk/2022/08/03/how-mountain-bike-guiding-makes-me-a-better-content-designer/",
    "title": "How mountain bike guiding makes me a better content designer",
    "authors": [
        "Steph Duits",
        "Anna Scott"
    ],
    "categories": [
        "Content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2022-08-03T13:59:25+01:00",
    "content": [
        {
            "text": "Steph Duits threw all her energy into mountain bike guiding, running a successful mountain bike holiday company. And then she discovered content design. In this post, Steph reflects on transferable skills from the most unlikely places. With contributions from Content Designer Anna Scott."
        },
        {
            "text": "Hi, I’m Steph. This blogpost is about how being a mountain bike guide has helped me be a better content designer. And how the skills you need to be a content designer can come from pretty much anywhere."
        },
        {
            "heading": 2,
            "text": "Being a mountain bike guide"
        },
        {
            "text": "As a mountain bike guide, I take people on a ‘flowing journey’ (yep, it actually says that in the guides’ manual) to a place they want to go. The objectives are simple: stay safe and have fun. It’s about having a passion for understanding people and putting their needs first. "
        },
        {
            "text": "I started mountain bike guiding because I love riding bikes, exploring new places and connecting with people. In 2017, I got the highest qualification available in the UK - British Cycling Level 3. At the time, I was one of only a handful of women that had this qualification - of course there are lots more now, and that’s brilliant."
        },
        {
            "text": "Over the last 8 years I’ve been lucky enough to guide hundreds of people in the wildest parts of the UK. I think I’ve learnt something new from every single one of them, and lots about myself, too! "
        },
        {
            "text": "One of my guiding highs was taking Kate Humble and her camera crew up to the Gap in the Brecon Beacons for her BBC series ‘Off the beaten track’. "
        },
        {
            "heading": 2,
            "text": "Being a content designer"
        },
        {
            "text": "I love how the right words at the right time can make content jump off a page. When I left university in Bristol I became a freelance travel writer - I wrote for the Guardian and some adventure and mountain bike magazines. But creative writing wasn’t really my thing. I think I struggled to be flamboyant enough. I liked writing that was clear and simple. "
        },
        {
            "text": "I got into content design by accident when I got a part time job at the Environment Agency in 2001. Part of my role was to manage my team’s bit of the website and intranet. Content design wasn’t a ‘thing’ then, but I really enjoyed working out how to use the right words at the right time to help people do things. "
        },
        {
            "text": "Picking a content design high is easy. Persevering with job interviews and landing my current job as a content designer in the Defra Content Team. I’ve never worked with a more welcoming and talented bunch of people. "
        },
        {
            "heading": 2,
            "text": "Understanding people at their highest and lowest"
        },
        {
            "text": "Mountain bike guiding means spending lots of time with people when they’re outside their comfort zone. I’ve guided people from different cultures and social backgrounds, and with different abilities. "
        },
        {
            "text": "I’ve spent time with people when they’re having the best day of their lives and also when they’re at their absolute lowest. Learning different ways to encourage people so they don’t get to that low point is a really useful skill. When I’m guiding I always try to spot ways to do this early and pile on the praise and support."
        },
        {
            "text": "Content designers have good days and bad days too. I count myself lucky to work in a team where it’s safe to be open about having bad mental health days. Just offering time for a chat, some friendship and support can turn a colleague’s bad day into a better one."
        },
        {
            "heading": 2,
            "text": "Getting to know people"
        },
        {
            "text": "I never take people on a guided ride without knowing a bit about them first. I’ve found we’re all unique - different things help us tick. But we also have lots in common too. We all need food and water, kindness and encouragement. We all need rest. We can all reach breaking point. "
        },
        {
            "text": "Similarly, you can’t design great content without getting to know your users and what they need from the content. You also need to get to know your colleagues, what they do and how they work - whether that’s other content designers, user researchers, interaction designers or subject matter experts. You need to be able to learn from each other and share expertise to do the best work you possibly can. "
        },
        {
            "heading": 2,
            "text": "Respecting everyone’s role and working as a team"
        },
        {
            "text": "Mountain bike guiding taught me how important it is that people feel included and valued for who they are. The nervous rider who’s the first to hand round their jelly babies is as important to team morale as the more confident person who encourages others to tackle a difficult trail. "
        },
        {
            "text": "It’s the same in content design. It doesn’t matter who we are or how we got here - everyone deserves to be a valued part of the team. As content designers, we need ideas from other content designers and knowledge from subject matter experts. "
        },
        {
            "text": "In User Centred Design (UCD) teams, respecting each other’s specialisms and uniqueness is crucial to collaborative and productive work. I’ve joined Defra’s UCD equality, diversity and inclusion working group to help improve this. If you’re at Defra, get in touch if you want to get involved."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Making it safe for people to be themselves"
        },
        {
            "text": "We can’t perform at our best if we can’t be ourselves. When I’m guiding, I try to accept any uniqueness that could set a person apart from others in the group and make sure they feel included, even if they have very different needs. I set this example because I want them to be their best and I want others to accept them too."
        },
        {
            "text": "Similarly, you can’t design good content if you don’t feel valued or safe being yourself. In my team at Defra, we’re encouraged to complete a ‘manual for me’. It’s a chance to be open with colleagues about the things we enjoy, need and struggle with, and anything else that makes us unique. This helps us all to adapt our ways of working to make it a good environment for everyone."
        },
        {
            "heading": 2,
            "text": "Knowing where the best cafés are"
        },
        {
            "text": "I stand by this. Tea and cake solves pretty much everything, right?"
        },
        {
            "text": "I get as much buzz from choosing the right words in content design as I do from being in the mountains on my bike and helping someone ride a technical bit of trail. "
        },
        {
            "text": "Both mountain bike guiding and content design have taught me how important it is to understand my users and value the people I work with. I’m sure these are skills you can learn from any job that’s about understanding and working with people. "
        },
        {
            "text": "Transferable skills can come from pretty much anywhere. But being a mountain bike guide has definitely helped me be a better content designer. "
        }
    ]
}