{
    "url": "https://lifeathmrc.blog.gov.uk/2022/08/03/meet-our-commonwealth-games-volunteers/",
    "title": "Meet our Commonwealth Games volunteers",
    "authors": [
        "Nicola Barson"
    ],
    "categories": [
        "Culture & Values",
        "Diversity",
        "General",
        "Inclusion",
        "Recruitment",
        "Working with the community"
    ],
    "pub_date": "2022-08-03T11:49:27+00:00",
    "content": [
        {
            "text": "Ready, set go! The Commonwealth Games 2022 is finally underway in Birmingham and it’s not just the athletes who are getting ready for the action. Employees from across HMRC are volunteering their time to help make the games a fantastic success."
        },
        {
            "heading": 2,
            "text": "Fun and games"
        },
        {
            "text": "The Commonwealth Games are held every 4 years, and this year marks only the third time the games have been hosted in the UK since they first took place in 1930, making it a huge opportunity to get involved."
        },
        {
            "text": "At HMRC, we take pride in supporting our employees with volunteering opportunities, so we caught up with Danielle and Mehtaab who are volunteering at this year’s games, to find out more about their role at the event and how they’re finding it so far."
        },
        {
            "heading": 3,
            "text": "Danielle Mason, Operational Engagement Assistant"
        },
        {
            "text": "“I’m dancing in both the opening and closing ceremonies. I’ll be performing as part of the Birmingham Cultural Symphony – which is a dance battle between all the different cultures that make up Birmingham. Our dance tells the story of not just Birmingham, but the Commonwealth itself. It’s so exciting, you don’t need to be from Birmingham to enjoy it and performing in front of the Royal Family makes it extra special."
        },
        {
            "text": "In preparation, I’ve been able to work more flexible hours – starting and finishing earlier so I could rehearse after work or at the weekends. My manager has been really accommodating and my team were so excited to see if they could catch a glimpse of me on television."
        },
        {
            "text": "The opening ceremony was a fantastic experience to be a part of. The atmosphere, the athletes and roaring crowds made all the hours of rehearsals worth it. It was an amazing show and I even managed to spot myself on television!”"
        },
        {
            "heading": 3,
            "text": "Mehtaab Iqbal, Tax Professional Caseworker "
        },
        {
            "text": "“Edgbaston Cricket Ground is hosting Women’s T20 Cricket this year and I’ll be there as a Technology Team Member. I’ll be installing and testing IT equipment throughout the installation phase. Then during the operational phase, I’ll provide IT support to staff, the media and athletes – aiding the successful delivery of the games. I may also be taking part as an 'athlete stand-in' volunteer, testing the athletes parade operations and the opening ceremony preparations."
        },
        {
            "text": "It’s a once in a lifetime opportunity to be part of something unique. I take pride in helping others and being a part of a community, I’m really looking forward to such an historic event in my city."
        },
        {
            "text": "I’ve undergone role specific training and taken part in online sessions in preparation for the event. As an HMRC Digital Ambassador, I’ve used the skills I’ve gained from this role to serve as a natural extension to my role at the games."
        },
        {
            "text": "The experience so far at the games have been amazing. Being at Edgbaston for the T20 cricket has been a great experience and it’s really fascinating to see how large-scale sporting events operate in the background. The importance of technology and ensuring it all works correctly, especially on game day has been such a hands-on experience."
        },
        {
            "text": "I would encourage people to volunteer for something they are passionate about. Aside from learning valuable life skills, I love cricket and technology, so being a technology team volunteer during an international T20 cricket event has been perfect for me.”"
        },
        {
            "heading": 2,
            "text": "Volunteering at HMRC"
        },
        {
            "text": "At HMRC, we support our employees to volunteer in local communities by providing them with up to 5 days paid special leave in a 12-month period (pro rata for part time employees and those with alternative working patterns). We encourage staff to take up volunteering activities to develop transferable skills and build experience."
        },
        {
            "heading": 3,
            "text": "Come work for us!"
        },
        {
            "text": "For all current vacancies, please check Civil Service Jobs."
        }
    ]
}