{
    "url": "https://nationalscreening.blog.gov.uk/2022/08/03/nearly-one-third-of-a-million-babies-screened-for-scid-already/",
    "title": "Nearly one third of a million babies screened for SCID already",
    "authors": [
        "Dr David Elliman"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-08-03T08:12:55+01:00",
    "content": [
        {
            "text": "More than 300,000 babies in England have already been screened for severe combined immunodeficiency (SCID) in an evaluation run by the UK National Screening Committee (UK NSC) and NHS England."
        },
        {
            "text": "The in-service evaluation, covering around two-thirds of the newborn population, launched in September 2021 and will initially run for 2 years. In areas taking part in the evaluation, screening for SCID is offered alongside 9 other newborn blood spot conditions using the same blood spot sample."
        },
        {
            "text": "Screening for SCID will continue in these areas while the evaluation results are analysed. The UK NSC will then make a definitive recommendation whether or not SCID should become part of the NHS Newborn Blood Spot (NBS) Screening Programme."
        },
        {
            "text": "Evidence from the evaluation will help assess if screening does more good than harm by determining how:"
        },
        {
            "text": "A multi-disciplinary group of stakeholders is leading the evaluation. They include modellers who will be able to use data from the evaluation to update the cost effectiveness model that helped inform the initial UK NSC recommendation."
        },
        {
            "text": "The results of the in-service evaluation will be made available to stakeholders as part of another consultation process."
        },
        {
            "heading": 2,
            "text": "About SCID"
        },
        {
            "text": "SCID is a group of rare conditions that affect the immune system and make it very hard for a baby to fight off common infections. Without treatment, babies with SCID usually die before they are a year old."
        },
        {
            "text": "About 1 in 40,000 babies born in England has SCID (about 14 a year). About a third of these are diagnosed because another member of their family has SCID. Without screening, the remainder are usually diagnosed when they fall ill. This can mean they are exposed to potentially fatal infections for longer before starting treatment."
        },
        {
            "text": "Early diagnosis means babies can be protected from catching infections. This means treatment (usually bone marrow transplant) is more likely to be successful and the baby will spend less time being ill, or in hospital."
        },
        {
            "heading": 2,
            "text": "Changes to neonatal vaccination programme"
        },
        {
            "text": "One of the biggest challenges for the in-service evaluation was the interaction between screening for SCID and the BCG vaccination programme. BCG can expose babies with SCID to infection and make treatment more complicated. As BCG is unsafe in children with SCID, it was felt that informed consent would only be possible after screening results were available."
        },
        {
            "text": "The Joint Committee for Vaccination and Immunisation (JCVI) therefore looked at all the available evidence and advised that the neonatal BCG vaccination programme should be changed. Eligible babies are now offered the BCG vaccination at about 28 days of age instead of at birth, as by this time SCID screening results are available."
        },
        {
            "text": "As part of the evaluation, the impact on the uptake and timeliness of BCG vaccination, the incidence of TB in babies and infants, and the incidence of severe side effects of BCG will be looked at."
        },
        {
            "heading": 2,
            "text": "Hard work is paying off – thank you"
        },
        {
            "text": "The successful roll out of this evaluation has depended on the efforts of screening colleagues, including those supporting the direct service delivery, NHS England, regional commissioners, clinicians, parent representatives and an international colleague whose country is also evaluating SCID screening."
        },
        {
            "text": "Their hard work has continued during the pandemic and we are hugely grateful to them all."
        },
        {
            "text": "Since the start of the evaluation, asymptomatic babies with SCID have been detected in screening areas and have now started to receive treatment that will give them a real prospect of being cured and leading a full and healthy life."
        },
        {
            "text": "As information comes to the SCID evaluation team we will use this blog to keep you updated on progress."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}