{
    "url": "https://space.blog.gov.uk/2022/08/03/the-night-sky-in-august-2/",
    "title": "The night sky in August",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-08-03T11:23:11+01:00",
    "content": [
        {
            "text": "August is another fabulous month of astronomical variety. There’s a spectacular meteor shower, the chance to see the Moon passing close to all of the brighter planets of our Solar System, the Milky Way overhead and the possibility of noctilucent or ‘night shining’ clouds."
        },
        {
            "heading": 3,
            "text": "The Perseid meteor shower"
        },
        {
            "text": "This meteor shower is considered the best of the year, with shooting stars likely to be visible throughout the month of August."
        },
        {
            "text": "The meteors are fragments of debris left trailing around the orbit of 26km (16 mile) wide Comet Swift-Tuttle, that passes through the inner Solar System every 133 years or so.  These fragments hit our planet’s atmosphere at a speed of around 58km (36 miles) per second!"
        },
        {
            "text": "Over 100 meteors an hour can be visible at its peak, which takes place around 12 – 13 August. Views of fainter meteors will be hampered this year with the full moon coinciding with the peak of the meteor shower, so do look out for meteors on any clear nights in the days before or after the peak, when the moon will be less bright."
        },
        {
            "text": "Thankfully, the Moon will be relatively low in the sky as it passes through the constellation of Capricornus, so a good deal of the sky will be relatively free of the bright glow of the Moon."
        },
        {
            "heading": 3,
            "text": "The Moon and planets"
        },
        {
            "text": "Look just above the Moon on 12 August and you’ll also see the ringed planet Saturn, which is at ‘opposition’ to earth in the middle of the month.  This is the point where Saturn and Earth are closest to each other in their orbits around the Sun, so Saturn will appear at its brightest in our night skies."
        },
        {
            "text": "Around 1.3 billion kilometres (800 million miles) separate Earth and Saturn at this closest point.  That’s around 75 minutes at the speed of light!"
        },
        {
            "text": " "
        },
        {
            "text": "Did you know?  Our nearest star is around 40 trillion kilometres (25 trillion miles) away. It takes light 4 years to travel that distance!"
        },
        {
            "text": " "
        },
        {
            "text": "It’s also a great month to see the planet Jupiter, which is unmistakably bright as it approaches opposition with earth next month. Jupiter has a very close encounter with the Moon (or so it will appear from our perspective here on earth!) in the early hours of 15 August."
        },
        {
            "text": "This is a must-see if you have binoculars or a small telescope, as you may be able to see the gas giant and four of its largest moons in the same field of view as our own Moon."
        },
        {
            "text": "Mars also has a close encounter with the moon in the early hours of 19 August, a great opportunity to see the contrast in the colours of the pale, half-illuminated Moon with the red hue of Mars."
        },
        {
            "text": "The Moon will also pass close by Venus in the hour before sunrise on 26 August, but just two percent of the Moon’s surface will be illuminated, making it a difficult spot for any ambitious astronomers or photographers!"
        },
        {
            "heading": 3,
            "text": "Other night sky sights"
        },
        {
            "text": "Looking east after dark, see if you can spot the large (but upside down!) winged horse of Pegasus from Greek mythology. High overhead, the constellations of Cepheus (a king), Cygnus (the swan) and Aquila (the eagle) dominate the night sky."
        },
        {
            "text": "Looking west, bright orange star Arcturus marks the constellation of Boötes (the Herdsman), while (mythical hero) Hercules and Draco (the dragon) can be found higher in the sky."
        },
        {
            "text": "Look too for Ursa Major. While this constellation is higher in the sky and easier to spot in spring, the Great Bear appears to walk along the horizon in the north-west for the next few weeks!"
        },
        {
            "text": "We highlighted some of the brighter and more fascinating stars you can look out for in the summer months in last month’s blog, so why not see if you can spot those too?"
        },
        {
            "text": "Finally, keep an eye out for noctilucent clouds this month.  These “night-shining” clouds are rare, pale blue ‘clouds’ that are formed when ice crystals at an altitude of around 80km (80 miles) are illuminated by the sun as it sits just below the horizon through the summer months.  August is likely the last chance to spot them this year, so look north an hour or two after sunset and before sunrise for the best chance to see them."
        },
        {
            "heading": 3,
            "text": "Space Exploration"
        },
        {
            "text": "The James Webb Space Telescope that was launched on Christmas Day last year has now returned its remarkable first series of images and scientific data. You can see more of these incredible early images here."
        },
        {
            "text": "Artemis-1, the first of a series of missions to return humans to the moon, is currently scheduled for launch at the end of this month.  This flight will launch on NASA’s enormous SLS (Space Launch System), with the rocket standing at around 98 metres (322 feet) tall – two metres taller than the Big Ben clock tower in London!  Artemis-1 will circle the moon and return the Orion astronaut capsule back to earth – though this flight will have only one passenger onboard.  ESA have reportedly selected Shaun the Sheep to make the first trip around the moon for nearly 50 years!  You can find more information about the mission here."
        }
    ]
}