{
    "url": "https://educationhub.blog.gov.uk/2022/08/03/what-you-need-to-know-about-pe-and-access-to-girls-football-on-the-curriculum/",
    "title": "What you need to know about PE and access to football on the curriculum",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School sport",
        "Schools"
    ],
    "pub_date": "2022-08-03T14:14:47+01:00",
    "content": [
        {
            "text": "Reports have suggested the government has ‘refused’ to commit to ensuring girls’ equal access to football in PE lessons, despite the Lionesses’ victory in the Women’s EURO 2022."
        },
        {
            "text": "These claims are untrue. The National Curriculum for PE in schools does not differentiate in relation to sex, but schools may choose to have single-sex PE lessons or sports teams."
        },
        {
            "text": "Here we provide information on what you need to know about how schools are making sports accessible to all pupils, including football."
        },
        {
            "heading": 3,
            "text": "Who decides what sports are taught in schools?"
        },
        {
            "text": "PE is a compulsory subject at all four key stages in the national curriculum."
        },
        {
            "text": "The Chief Medical Officers for UK recommend that where possible, children have 60 minutes of daily physical activity. We expect 30 minutes to take place during the school day."
        },
        {
            "text": "It is for schools to decide which sports and physical activities they offer their pupils. Factors influencing that decision include the spaces available for sports, along with available equipment. Schools should also take their pupils’ views into account on which activities they want to be able to do, and make sure they are delivering a flexible, diverse and challenging PE curriculum that suits the needs of all their pupils."
        },
        {
            "text": "Where schools choose to offer different sports to girls and boys, for example to respond to demand, we expect them to make every effort to offer a comparable sport which uses similar tactics and has similar objectives, i.e attacking and defending strategies."
        },
        {
            "heading": 3,
            "text": "OK, but what are you doing to encourage girls to play football?"
        },
        {
            "text": "The success of the Lionesses in the Women's EURO 2022 will inspire a generation of girls to get involved with football and we want to encourage more girls to participate in all sport."
        },
        {
            "text": "We support the Football Association’s ambition to give girls equal access to football in schools and clubs by 2024 and will continue working closely with them to help them achieve this."
        },
        {
            "text": "Our School Sport and Activity Action Plan is helping more girls to take part in physical activity. Through it we have worked with Sport England to invest £1.5 million into developing a new digital resource, called Studio You, which is helping teachers engage less active teenage girls in their PE lessons."
        },
        {
            "text": "Studio You has been developed using insight from both PE teachers and girls in Key Stages 3 and 4, with the ultimate ambition of reconnecting them with PE, improving their confidence and making being active fun."
        },
        {
            "text": "Sitting alongside this, the Department is funding a three-year programme to give thousands of girls access to competitive sport opportunities, including football, helping them to inspire and encourage their peers to be active through sport. Worth up to £980,000 over the next three years, the ‘Your Time’ programme will improve and increase opportunities for girls aged 8 to 16 to access competitive sport and sport leadership opportunities."
        },
        {
            "heading": 3,
            "text": "Are there examples of PE and Sport good practice available?"
        },
        {
            "text": "The recent Ofsted PE research review discusses the evidence relating to PE and the features of high quality PE. Further support in the delivery of high-quality PE is available from the subject association, The Association for PE, and also from the Youth Sport Trust."
        },
        {
            "text": "Specific support on good practice in the delivery of sport to children and young people is available from the individual national governing bodies of each sport."
        },
        {
            "heading": 3,
            "text": "In general, what else is available to schools to help them offer sports?"
        },
        {
            "text": "As we’ve said, PE is a compulsory subject at all four key stages in the national curriculum."
        },
        {
            "text": "So, to support schools, we announced in October that we will invest nearly £30 million per year to open up school sport facilities in England outside of school hours (evenings, weekends and school holidays), as well as to improve the teaching of Physical Education at primary school."
        },
        {
            "text": "Primary schools are also benefitting from the £320 million PE and Sport Premium this coming academic year to boost sporting opportunities for millions of children across the country and supporting higher quality PE lessons. Further information and support for primary schools in using the PE and sport premium well is available here."
        },
        {
            "text": "More widely, DCMS has provided £2.9 million in grant funding through its Sport Survival Package to the Women’s Super League and FA Women’s Championship to cover essential costs and allow the completion of their seasons."
        },
        {
            "text": "A £230 million package is also being rolled out to build or upgrade up to 8,000 football and multi-sport pitches across the UK by 2025. In March, DCMS started rolling out this investment, through an initial £25 million that is benefiting more than 160 facilities."
        }
    ]
}