{
    "url": "https://civilservice.blog.gov.uk/2022/08/03/wheres-the-washing-powder/",
    "title": "Where’s the washing powder?",
    "authors": [
        "Helen Challinor"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Skilled people",
        "Smarter working"
    ],
    "pub_date": "2022-08-03T11:39:13+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Helen Challinor from the Department for Education explains how clear categorisation can help us not only with our shopping but also with managing our information at work."
        },
        {
            "text": "Have you ever thought about how your favourite supermarket is set out? "
        },
        {
            "text": "Would you think it strange if the oranges were placed next to the washing powder? Or would you expect to find fruit and veg all together, with the washing powders near other household cleaning products?"
        },
        {
            "heading": 4,
            "text": "Easy to find"
        },
        {
            "text": "If you’re like me, you expect to find similar things grouped together in predictable ways. This is because it makes it easier to find what you’re looking for."
        },
        {
            "text": "When we begin to organise our world, we often start with broad categories like ‘fruit and vegetables’ or ‘laundry essentials’, and then become more specific, thinking about oranges and apples or washing powder and fabric softener."
        },
        {
            "heading": 4,
            "text": "Making sense"
        },
        {
            "text": "Our instinct is to group similar things together because that makes most sense to us. But did you know that – whether in shops, on websites, or when organising information at work – this doesn’t happen by accident?"
        },
        {
            "text": "Librarians and information managers use lists of words and phrases, set out in a specific way, to help us find what we’re looking for. These lists are called controlled subject taxonomies, and they’re a way of describing and organising what we do."
        },
        {
            "text": "In a controlled subject taxonomy, we can arrange words and phrases (called terms) into a hierarchy. The list starts with broad terms and then, as terms become progressively narrower (or more specific), they appear lower down in the hierarchy. For example, laundry essentials is a broad term while washing powder and fabric softener are narrower terms."
        },
        {
            "text": "It’s called a ‘controlled’ subject taxonomy because a gatekeeper controls the list. It’s the job of the gatekeeper to make sure new terms fit into the hierarchy in the correct way and that they don’t duplicate terms that already exist."
        },
        {
            "text": "Many organisations use taxonomies to help them categorise their information."
        },
        {
            "text": "Whenever it’s important to find information quickly and easily, a taxonomy can help. At the Department for Education (DfE) we use a controlled subject taxonomy to help us answer enquiries from our stakeholders and manage our information. We do this through a searchable pick list of terms that standardise how we describe our work."
        },
        {
            "heading": 4,
            "text": "Different language"
        },
        {
            "text": "Sometimes people describe things in different ways. I might think about washing powder but you might call it washing liquid or washing gel. We both want detergent to clean our clothes, but we’re using different language to describe it. This is alright if we’re in the supermarket, because we know we need the laundry essentials aisle – then we can browse the shelves for the exact product we want."
        },
        {
            "text": "But what happens on a website? Well, this is where the taxonomy comes in, because it links together all the different terms for detergents. So whether I search for washing powder, liquid or gel, I should be able to find what I want."
        },
        {
            "text": "Here’s another example: at DfE, we use the official term ‘school meals’. But I might call them ‘school lunches’ and you might say ‘school dinners’. Inside the search engine, the subject taxonomy connects all these terms, so that searching for any one of them always gives the right results, which saves us time."
        },
        {
            "text": "So whether you want to buy washing powder in your local supermarket, pick out a genre of music to listen to or find a document or person at work, have a think about the ways we categorise our world and the taxonomies hidden in plain sight all around us."
        }
    ]
}