{
    "url": "https://vets.blog.gov.uk/2022/11/03/7th-international-one-health-day/",
    "title": "7th International One Health Day",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2022-11-03T14:35:10+00:00",
    "content": [
        {
            "text": "Today we mark the 7th International One Health Day and I want to reflect again on the brilliant progress being made on One Health in the UK and across the world. Developing One Health approaches is still a key focus of mine and I'd like to see it stay as an international priority, where it will be critical in facing the impacts of climate change, antimicrobial resistance (AMR) and the increasing emergence of zoonotic diseases. This year’s outbreaks of Avian Influenza and Monkeypox have brought stark reminders, so soon after the Covid-19 pandemic, of the threat that zoonotic diseases hold. Here, again, I can see how valuable One Health research and government collaboration has been in providing strong approaches to such challenges. I am thankful as ever to all our partners both domestic and abroad for their continued support in addressing the issues of the day and getting ahead of those in the future."
        },
        {
            "text": "A great start to the year "
        },
        {
            "text": "It was a great start to the year for One Health as the vital role that the environment plays was formally recognised on the global stage as the United Nations Environment Programme (UNEP) joined the Food and Agriculture Organisation of the United Nations (FAO), the World Health Organisation (WHO) and the World Organisation for Animal Health (no longer the OIE, but now WOAH) to go from a Tripartite to a Quadripartite partnership for One Health. I firmly believe that the strength of One Health is its recognition of our world’s deep interconnections and was personally very pleased to welcome UNEP and all its expertise as a valued Quadripartite member, given just how influential the environment is. Providing proper focus to the environment alongside human and animal health will allow us to effectively mitigate risks that could come from climate change or biodiversity loss, and UNEP’s new global Nature for Health (N4H) initiative is now looking to support countries to improve their resilience in this area."
        },
        {
            "text": "The UK’s achievements"
        },
        {
            "text": "We have several reference laboratories across the country and our world-leading science capabilities continue to grow through investment and research on zoonoses and beyond. I am proud of Defra’s ongoing work with our international colleagues where we are utilising the UK’s One Health expertise to further develop our shared capabilities and networks of collaboration. For example, we’ve co-funded a research call on One Health approaches to vector borne diseases, invested in rapid genomics technology, continue to lead the way on AMR, and have been working with the EcoHealth Alliance to address Marburg in Ghana as part of our Animal Health System Strengthening project."
        },
        {
            "text": "Working together as an effective international One Health community is essential, and I’m pleased the UK has supported this through the Defra and UKHSA’s co-chair of this year’s Zoonotic Disease Action Package (part of the Global Health Security Agenda). This group aims to build the health capabilities of its members with relation to zoonotic disease and support stronger performance against the International Health Regulations. The overall ambition, of course, is to enable the implementation of guidance and models on behaviours, policies and practices that will minimise the impact of zoonotic diseases. Having reinvigorated the network and underpinned its objectives with a robust workplan (that has since been used as a framework for the Dutch chaired AMR Action Package) the membership has significantly expanded. Throughout the year members have been able to learn from each other in an inclusive way, with presentations from expert partners across the world reflecting on their experiences, challenges, best practice and ‘what works’. It has also brought a greater focus on One Health as part of the Global Health Security Agenda and the need for the approach as part of international work towards Global Health Security – not least in effectively undertaking activities to prevent, detect and respond to zoonotic diseases."
        },
        {
            "text": "Looking around the world"
        },
        {
            "text": "It’s been great to see the importance of the One Health approach continue to be reflected in global forums, including the German G7 and Indonesian G20, and I’m keen that this can spread further as we look to COP 15 and future opportunities to encourage more One Health action across its spectrum of relevant policy areas. The results of the G20 One Health Side Event were especially welcome, supporting the work of the Italian One Health Call for Action and shining a spotlight on the advantages relating to economic stability that taking this approach to health security can provide."
        },
        {
            "text": "The Quadripartite, as ever, have played a critical role this year and I look forward to seeing how they build upon this in 2023. Their One Health Joint Plan of Action has now been launched, setting out strong ambitions for global One Health collaboration and system strengthening, which includes action tracks on antimicrobial resistance, animal health and the environment that I hope the UK and all our international partners can engage with. The One Health Intelligence Scoping Study that they also led, and was funded by the UK G7 Presidency, has now been completed. Its results were shared with the G7 in Berlin and sets the stage for developing a proposed Global One Health Intelligence System. This early detection system would be ground-breaking in helping to bring together the necessary data from across all these different sectors to reduce the known threats to global health security posed from emerging infectious diseases to environmental changes."
        },
        {
            "text": "This initiative was born from the need to embed the lessons we learned from the Covid-19 pandemic. A need that is no less true today. It is clear that One Health approaches are essential if we are to effectively prevent and prepare for future infectious disease outbreaks, recognising the drivers of risk and opportunities for sustainable health resilience that are present in animals, plants and our environment. The drafting of the WHO’s Pandemic Instrument  provides an opportunity to address current gaps and establish valuable One Health underlying principles. This new global agreement will set new expectations for countries in order for the world to come together to better prevent, prepare for and respond to future pandemic risk. I look forward to seeing the importance of One Health being reflected during negotiations and the opportunities for the UK to collaborate and strengthen relationships with its international partners. In this vein we have joined the One Health Group of Friends, a new network of country representatives in Geneva that is working to ensure text on animal health and the environment can be incorporated strongly throughout the Instrument to achieve cross-cutting and effective resilience against future disease emergence."
        },
        {
            "text": "Although we’ve made progress in this space, I am acutely aware of the challenges facing people both here and around the world. These are difficult times for many, from the cost-of-living crisis to Russia’s invasion of Ukraine, with food security, health and livelihoods under constant pressure. I am confident that a One Health approach can help make the world a better, more resilient and healthier place at every level, reaping benefits on nutrition, trade, economic growth and environmental sustainability. As we continue to navigate this ‘post-pandemic’ world I hope this ambition will not lose its momentum. I am excited as we close out this year and look towards the next, and whether at events such as the 7th World One Health Congress or my regular meetings with global counterparts I know that One Health will still provide a fascinating and useful lens for us as we pursue a better world for all humans, animals, plants and the environment."
        }
    ]
}