{
    "url": "https://lifeathmrc.blog.gov.uk/2022/11/03/celebrating-50-years-at-hmrc-peter-deas/",
    "title": "Celebrating 50 Years at HMRC: Peter Deas",
    "authors": [
        "Sarah Musgrove"
    ],
    "categories": [
        "Culture & Values",
        "General",
        "Recruitment"
    ],
    "pub_date": "2022-11-03T12:37:24+00:00",
    "content": [
        {
            "text": "Earlier this year Outreach Advisor, Peter Deas, celebrated his 50th Work Anniversary with HMRC. We caught up with Peter to ask him about his time in service and the biggest changes he’s seen over the last 50 years."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What has your career journey with HMRC looked like?"
        },
        {
            "text": "I started working for HMRC in 1972 in the personal file registry, which was in HR, and we looked after the records and files of employees within HMRC. Everything was done manually back then, and my role was to keep checks of the files and where they were going."
        },
        {
            "text": "It’s come a long way since then. I've been in HR for most of my time at HMRC, but I have ventured into other areas. I’ve spent time working in the Estates team in London, which looked after a set of buildings and estates in north London, and I really enjoyed my role because every day was different."
        },
        {
            "text": "I now work in Nottingham, because a relocation package was offered in the early 1990s, and when I first moved here, I worked on pension schemes for about 4 years. I moved back to HR in 2001 and I’ve worked in HR ever since because I really enjoy it. I have moved around roles in that time ranging from general HR recruitment to HR talent. Another job I really enjoyed was on the Ascend programme. It's a talent development programme for Grade 6 and 7s, and I made so many friends across the organisation and we’re still in contact even now. There are so many faces across HMRC, and I know lots of people who will always come up to me to say ‘hi’. I worked on Ascend for about 5-6 years and now I’m leading on the Movement to Work programme."
        },
        {
            "heading": 3,
            "text": "What’s your career highlight?"
        },
        {
            "text": "I think my career highlight was when I got to 40 years in service. I had a surprise party with all my colleagues, which was really nice. There was a marquee at my house and everyone from work came. I was amazed it was kept a secret and everyone came to it, including my colleagues from London. My family from London also came up, so that was a career highlight because it was directly due to me having been at HMRC for 40 years. I have fond memories of the celebrations."
        },
        {
            "heading": 3,
            "text": "Why did you apply to work at HMRC? "
        },
        {
            "text": "I turned 16 in June of 1972, and we were encouraged by the careers adviser to apply for jobs. My parents had a big influence on this because I actually applied for three jobs all in central London. The first was the London Fire Brigade, which I got accepted for. The second was the Metropolitan Police, which I got accepted for. The third was HMRC. I was very close to accepting the Fire Brigade because that's something I always wanted to do, but my parents stepped in and said both of those careers are very dangerous, and they encouraged me to work at HMRC because it was office based."
        },
        {
            "text": "So, I joined HMRC in August 1972 and here I am 50 years later."
        },
        {
            "heading": 3,
            "text": "How has HMRC supported you in your career?"
        },
        {
            "text": "All my managers have supported me throughout my time here. If I ever felt I wanted to learn new skills or try working in a new area, they'd always do what they could to move me on to something fresh and they wouldn't just keep me in a role because I was more experienced."
        },
        {
            "text": "With the help of my managers, I've always managed to choose the roles that I wanted. In my career development conversations, they've always helped me along and helped me to go into jobs where I want to be. I’ve found the Movement to Work role to be different to anything I’ve done before but it was a positive step and I’m grateful that all my managers have helped me in my career."
        },
        {
            "heading": 3,
            "text": "What’s the biggest change you’ve seen during your time here? "
        },
        {
            "text": "Well, it depends on which decade we're talking about! The biggest change I've seen which affected me, but may not seem much to younger generations, is the change from paper to digital. I think that change happened around the turn of the millennium. We used to do everything by paper, and the move to digital absolutely changed the whole of the department."
        },
        {
            "text": "I think that's the biggest change in my lifetime with HMRC, digital makes things really easy now."
        },
        {
            "heading": 3,
            "text": "Tell us about the people at HMRC; have you made friends for life during your time here? "
        },
        {
            "text": "There are so many different types of people at HMRC and I’ve made a lot of friends. We recently hosted a Diwali event downstairs in the Nottingham office, and everyone is always friendly and says hello. My manager made a comment that I know everyone!"
        },
        {
            "text": "I know so many people in HMRC as you can imagine having been here 50 years. I've made so many different friends, too many to mention."
        },
        {
            "heading": 3,
            "text": "What does a typical working day look like for you? "
        },
        {
            "text": "I'll check my emails and I also look after mailbox as well. If we have new starters coming in, I’ll often reach out to managers to help them prepare for the new starters. I’ll also give the candidates some guidance on learning that they can do about how we work at HMRC. Those first days once a candidate starts at HMRC are very busy days because you have to keep up to date with what's going on and you always get loads of questions."
        },
        {
            "text": "I’ll have regular meetings with my team too, so we can update each other on the progress of our projects. I’m always on hand to answer any questions the team has, and I provide a lot of data on our work."
        },
        {
            "text": "I'm also trying to promote the normal Movement to Work, which is a 4-6 week work experience opportunity, which includes CV writing experience, one to ones and coaching for participants."
        },
        {
            "text": "My days are always very busy, but I enjoy it."
        },
        {
            "heading": 3,
            "text": "What are the best parts of your role?"
        },
        {
            "text": "The best part of my job is seeing candidates from Movement to Work become permanent in their roles. They start on a fixed term appointment, but when they become permanent, it's very rewarding. It’s great to see them grow, meet all the criteria, and get a permanent role."
        },
        {
            "text": "We’ve had lots of positive feedback on Movement to Work and it’s always lovely to get that, from the candidates and from other departments as well."
        },
        {
            "heading": 3,
            "text": "What would you say makes HMRC a good employer?"
        },
        {
            "text": "For me, it’s the variety of work opportunities. People have this view of HMRC as being just the ‘tax man’, but my roles have had nothing to do with tax – there are so many different professions here and there are so many things that you can branch into."
        },
        {
            "text": "What I do now with Movement to Work helps young people into employment which is so rewarding. The diversity at HMRC is also fantastic and there are so many different people that you meet here. So that's what I think is really good."
        },
        {
            "text": " What advice would you give to someone considering working at HMRC?"
        },
        {
            "text": "As I mentioned before, people often think HMRC is just tax, but it's not. So, my advice is don't go into HMRC thinking that. Be open minded about the opportunities, because you'll be pleasantly surprised."
        },
        {
            "text": "There are so many different avenues to use your skills, and HMRC promotes your skills and encourages you to build on them as well."
        },
        {
            "heading": 3,
            "text": "Are you planning to retire soon, and if so, what are your plans?"
        },
        {
            "text": "Well, I've got two teenage daughters, so I won’t be retiring just yet as I’d like to help them through college and university. Once I'm satisfied that they can stand alone on their two feet, I’ll probably retire, but I enjoy coming to work every day, I enjoy the work I do, and I really love working."
        },
        {
            "text": "Once I retire, whenever that is, I’ll probably move back down south to Surrey where a lot of my family are, so I can spend more time with them."
        },
        {
            "text": "To sum it all up, my 50 years at HMRC have been varied and colourful."
        },
        {
            "text": " "
        }
    ]
}