{
    "url": "https://valuationoffice.blog.gov.uk/2022/11/03/how-we-value-caravan-sites/",
    "title": "How we value: Caravan sites",
    "authors": [
        "voadigitalpublishing"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2022-11-03T13:04:11+00:00",
    "content": [
        {
            "text": "Tracy Dearing is a National Valuation Lead in the VOA. One of her roles is to advise on the valuation of caravan sites. Here, Tracy explains what is involved in valuing this type of property. "
        },
        {
            "text": "The sector "
        },
        {
            "text": "The recent rise in ‘staycations’ has increased the popularity of caravan parks. We currently value over 8,500 sites across England and Wales. This includes holiday parks and sites for touring caravans and tents. We also value a growing number of ‘glamping’ sites, where guests can stay in pods, domes and treehouses. "
        },
        {
            "text": "Caravan sites vary greatly. The smallest are usually grass fields which can operate without a license. Holiday parks are the largest sites we value. These parks can have swimming pools, family entertainment and restaurants, as well as hundreds of static caravans. "
        },
        {
            "text": "The valuation method we use "
        },
        {
            "text": "We value caravan sites using the receipts and expenditure method. This method involves analysing income and expenditure to work out what a reasonable rent might be.  "
        },
        {
            "text": "The receipts and expenditure method is one of three main ways we value properties.  "
        },
        {
            "text": "We then apply a rental percentage to each site’s Fair Maintainable Trade (FMT) figure to arrive at its rateable value. Fair maintainable trade is the annual level of trade (excluding VAT) that a caravan park is expected to achieve. "
        },
        {
            "text": "A complex assessment "
        },
        {
            "text": "Unlike most other properties we value, caravans are not buildings or land. A caravan is classed as a ‘chattel’, which means it is moveable property. Despite this, static caravans are rateable, along with the pitch on which they stand. "
        },
        {
            "text": "Unusually, the owner of a static caravan is not the rateable occupier (the person responsible for paying business rates). By law, the site operator is the rateable occupier of any private static caravans. "
        },
        {
            "text": "This means that privately-owned caravans that are sited at a holiday park are not valued separately. So, if there are any private static caravans included in the valuation, we are required by law to serve a notice to the site operator. This notice lets the operator know how many private caravans have been included in the valuation, and what effect this has had on the site’s rateable value.  "
        },
        {
            "text": "The notice also helps site operators to calculate the licence fee for the privately occupied static caravan pitch, which will typically include a service charge. "
        },
        {
            "text": "If a caravan is occupied as a sole or main residence, it is not included in the overall site valuation. Instead, it is assessed for Council Tax.  "
        },
        {
            "text": "Any caravans owned by a charity are assessed separately to the rest of the site.  "
        },
        {
            "text": "Industry discussions "
        },
        {
            "text": "We have discussed and agreed this valuation method with representatives of the industry over several revaluations.  "
        },
        {
            "text": "These discussions help us to understand changes in the way that sites operate over time, any successes and issues, and how they impact on profitability. We can then make adjustments to the way we value to take this into account.  "
        }
    ]
}