{
    "url": "https://digitaltrade.blog.gov.uk/2022/11/03/international-trade-week-exporting-goods-and-tracking-wins/",
    "title": "International Trade Week: Exporting Goods and Tracking Wins",
    "authors": [
        "Andy Revell, Product Manager, Trade Support Services",
        "Shan Zhang, Head of Business Analysis and Reporting, DIT China",
        "Matt Ashworth, Counsellor for Energy and Infrastructure, DIT China"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2022-11-03T14:00:34+00:00",
    "content": [
        {
            "text": "As a nation, the UK is on a path to drive economic growth. We are part of the export growth mission in the Digital, Data and Technology (DDaT) team at the Department for International Trade (DIT). Research shows that many UK businesses need guidance to export their products and services. DDaT have collaborated across DIT, and across government, to develop a range of services and products to help exporters along their export journey. In this special edition blog for International Trade Week, we’ll be showcasing how DDaT enable DIT and businesses to trade through our external and internal-facing services and products. Focusing on Learn to Export, great.gov.uk, Check How to Export Goods (CHEG) and Data Hub, this blog will cover how UK businesses are able to find their markets through our specialist technical support. "
        },
        {
            "heading": 2,
            "text": "Expanding your market with Check how to Export Goods (CHEG) "
        },
        {
            "text": "Andy Revell, Product Lead Trade Support Services "
        },
        {
            "text": "For users and businesses new to the world of exporting, we provide a range of services to help inspire, plan and learn about exporting, from identifying new markets to strategic planning. Sign up for our Learn to Export service on great.gov.uk to learn more about our offer.   "
        },
        {
            "text": "For our users and businesses who are familiar with exporting, we offer a comprehensive Check How to Export Goods (CHEG) service. CHEG is a content rich, trusted service which allows users to check duties and customs procedures for exporting goods to over 160 countries. The service allows users look up the correct commodity code for their products and their destinations. This means that users can ensure their goods will be correctly treated by overseas customs.  "
        },
        {
            "text": "Using CHEG, businesses can find out:  "
        },
        {
            "text": "The service also includes a lot of information on customs processes and resources for these markets – for both general clearance and product-specific levels.  "
        },
        {
            "text": "In DDaT, the Product, Content and Design professions have been researching ways to improve CHEG and make the content more digestible and accessible for users. "
        },
        {
            "heading": 2,
            "text": "Specialist advice through the Export Support Service "
        },
        {
            "text": "If you are an exporter or aspiring exporter with specific questions, you can use the ‘Ask the export support team’ service. This connects users to an Export and Trade specialist for advice and support with complex export-related matters. The Export Support Service has recently expanded to cover the Eastern Europe and Central Asian Network (EECAN) regions and we are working on the expansion to cover the ‘Rest of the World’. "
        },
        {
            "heading": 2,
            "text": "Cleaner, greener exports with Data Hub "
        },
        {
            "text": "Shan Zhang, Head of Business Analysis and Reporting, DIT China; Matt Ashworth, Counsellor for Energy and Infrastructure, DIT China "
        },
        {
            "text": "In DIT China, green and clean sustainable growth is at the centre of our regional trade plan. It is a key part of both our export support and investment promotion campaigns. Data is key to understanding trends. Data Hub is DIT’s central Customer Relationship Management (CRM) tool, built by the DDaT team. We are using Data Hub's expanding functionality to track how we are doing as a network in terms of delivering on clean growth aspirations across exports, foreign direct investment (FDI), outward direct investment (ODI) and capital investment.  "
        },
        {
            "text": "At the start of the year, we looked at our business plan aspirations and set certain percentage targets for clean growth wins which we believed we could deliver. This was not just in areas such as renewable energy, but also from banking to retail to the automotive sectors. By tracking the proportion of wins that are green in Data Hub, we can understand which sectors are contributing most to green wins. Where there is growth potential we can use this to calibrate our business plans and strategies.  "
        },
        {
            "text": "It is also a learning process. For example, encouraging colleagues to ‘tag’ wins requires behavioural change and an explanation of the value of data to better shape our plans for the future. There is still a lot of work to do, but as teams' priorities are increasingly turning green, the UK is in a strong position with compelling offer for China, and Chinese companies have a recognised Unique Selling Proposition (USP) for green trade. Data Hub is a great way to both track our work and showcase the range and value add of our work to the UK’s green trade and investment priorities. "
        },
        {
            "heading": 2,
            "text": "Meeting cross-government milestones "
        },
        {
            "text": "The DDaT team have been working with colleagues across government to create a more joined-up experience for an exporter’s user journey. For example, the team is collaborating with other government departments (OGDs), including HM Revenue & Customs (HMRC), to develop services and products together. As a result, users will have a smoother journey for exporting goods across the UK border and into the destination country. We are keen to continue this connected way of thinking and efficient delivery of services, doing the hard work to bring together the right information for traders from across government. "
        },
        {
            "text": "As a collection of professions across DDaT, we collaborate with Policy and International Trade professions to ensure our users can access the right export support at the right time in their journey. We are also proud that our Learn to Export service was in the final 10 shortlisted for the Digital Public Service Innovation of the Year award at the Digital Leaders 100 awards. This is an exciting time to be part of an export growth team and help UK businesses take advantage of the world of exporting opportunities. "
        },
        {
            "text": "Check out our other blog for International Trade Week."
        }
    ]
}