{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/11/03/launching-governments-first-ever-multidisciplinary-course/",
    "title": "Launching government’s first ever multidisciplinary course",
    "authors": [
        "Paul Kett"
    ],
    "categories": [
        "Events",
        "Thought leadership"
    ],
    "pub_date": "2022-11-03T12:00:58+00:00",
    "content": [
        {
            "text": "The world is complex, and when we design, develop and deliver policy and public services, we do a disservice to citizens if we don’t bring the best of our collective expertise and experience to the challenge."
        },
        {
            "text": "Working in a multidisciplinary way helps us operate as one team between those responsible for policy and delivery – bringing operational expertise into policy development at the outset, building trust between teams and accelerating collaboration and learning. Whether working with the analyst, the legal adviser, the scientist, the commercial specialist - or other techncial expert - by taking a multidisciplinary approach, we collaborate better and deliver value for the citizen."
        },
        {
            "text": "Policy can mean different things to different people, but when I describe what we mean by policy, I find thinking about design helpful – design is the practice of making things and government makes policies and services. In my experience design techniques can provide a powerful mental model and a shared language for collaboration as well as prompting moments to test whether and when to best involve multidisciplinary experts from different professions."
        },
        {
            "heading": 2,
            "text": "Introducing the Policy-to-Delivery Course"
        },
        {
            "text": "By developing our individual skills for making public policies and service collaboratively, we can build government’s resilience for working in complex and uncertain times. That’s why I commissioned a new a new training offer for government, and today I’m pleased to announce that it is now available to all government organisations."
        },
        {
            "text": "Policy-to-Delivery is an applied course about how to take an idea from that lightbulb moment where someone has a brilliant idea or thorny problem to solve, through to delivering an effective public policy or service. It aims to support government organisations to drive up the public value they deliver by focusing on:"
        },
        {
            "text": "The course provides 1 week of training and is aimed at anyone who makes public policies or services. It was written with mid-level civil servants in mind, but open to anyone who has already completed the ‘base camp’ or foundation level courses about working in government."
        },
        {
            "text": "It is written by experts centrally and presented by experts locally. We have brought together government’s leading multidisciplinary experts to author the course. And in practice, it will be your own organisation who will coordinate and present the course to you. The course provides a fantastic platform for you to meet the experts in organisation, so you know who to turn to if you need support at a later date."
        },
        {
            "text": "We’ll be commencing delivery of the course in Cabinet Office during Autumn term, and we are also supporting delivery efforts in many other departments. I hope to start running the course in my own organisation – Department for Education - later this academic year."
        },
        {
            "heading": 2,
            "text": "Endorsed around government"
        },
        {
            "text": "The ambition of the course reflects the mood of leaders across government:"
        },
        {
            "text": "Tamara Finkelstein, Head of Policy Profession “Government policy making is done by multidisciplinary teams bringing together professionals in policy, operations, science, data analysts, social researchers and many more. Building effective multidisciplinary teams is central to making and delivering good policy and great public services. This course provides an opportunity to practice how you identify the range of skills you need and convene a successful team”"
        },
        {
            "text": "Peter Schofield, Head of Operational Delivery Profession “This innovative course is an excellent example of working in a multidisciplinary way to improve services for citizens. In recent years we have seen how closer working between the Policy and Operational Delivery Professions radically transforms services for citizens. Better understanding of the how and why of working together can and does bring significant benefits and this course means more civil servants are ready for the challenges and opportunities that working together brings”"
        },
        {
            "text": "Sir Patrick Vallance, Head of Government Science and Engineering Profession “It is vital that civil servants are able to confidently and effectively engage with the complexity and uncertainty inherent in the problems we tackle in government. This excellent course outlines how skills like systems thinking can be used to deal with complexity in a multidisciplinary way. It provides insights on how systems thinking can be used to improve policymaking and drive up the public value of organisations across government”."
        },
        {
            "heading": 2,
            "text": "Building on a rich research heritage"
        },
        {
            "text": "I commissioned the course as a refresh of the Policy-to-Delivery Course that we successfully ran in Department for Education for many years. Following a pause for the pandemic, the time seemed right to build on our successful pattern and open it up across government."
        },
        {
            "text": "The new curriculum is based on research led by the Policy Design Community and Policy Profession on how policies are made in practice, combined with evidence on what Policy Schools teach in 7 large departments of state."
        },
        {
            "text": "The course is applied too. So to mark the 70th anniversary of London's fatal four-day pea-souper, we have partnered with Defra’s air quality team to set out a live government challenge for the audience to tackle in an activity that runs throughout the course."
        },
        {
            "heading": 2,
            "text": "Shaping future government working with experts"
        },
        {
            "text": "This course is enthusiastically multidisciplinary. It is curated by Andrew Knight for the UK government’s Policy Design Community who are expert practitioners of making public policy and services in innovative, design-centred ways – and sponsored by the Policy Profession."
        },
        {
            "text": "Each module of the course is authored by one of 12 government professions, functions and expert communities including: Policy Design Community, Policy Profession, Operational Delivery Profession, HM Treasury, Infrastructure and Projects Authority, Government Analysis Function, Private Office Network, Government Communications Service, Government Office for Science, Equality Hub, Delivery Unit, National Audit Office."
        },
        {
            "text": "We are also very fortunate to have a team of brilliant political science and design academics through our AHRC Design & Policy Network. Our university-based colleagues have peer-reviewed the course, helping us to ensure that the training we offer really is of the highest standard. Our peer-reviewers are: Professor Lucy Kimbell (University of Arts London), Professor Liz Richardson (University of Manchester), Professor Catherine Durose (University of Liverpool), Professor Jonathan Slater (Kings College London), Professor Paul Cairney (University of Stirling), Dr Cara Broadley (Glasgow School of Art, Dr Peter Matthews (University of Stirling), Dr Stephen Greasley (University of Exeter), Benjamin Kumpf (Columbia University / OECD), and Louise Mullagh (Lancaster University). This Public Policy Design blog is planning to publish a series of posts later in the year offering up in-depth insight from our academic colleagues on the different issues covered by the course."
        },
        {
            "heading": 2,
            "text": "Making it happen in your own organisation"
        },
        {
            "text": "The Policy-to-Delivery Course is now available to all UK public sector organisations. I hope you will firmly grasp this opportunity to give our workforce the next generation of public sector skills."
        },
        {
            "text": "If you want to find out more about the course, or how you might coordinate your own presentation of the course for your organisation – or if you just want to find out who in your organisation is currently coordinating the course, then please get in touch at policy.design@policyprofession.gov.uk"
        }
    ]
}