{
    "url": "https://educationhub.blog.gov.uk/2023/04/03/5-biggest-myths-apprenticeships-busted/",
    "title": "5 of the biggest myths about apprenticeships busted",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-04-03T18:50:48+01:00",
    "content": [
        {
            "text": "Apprenticeships offer a great way for young people to gain the skills and workplace experience they need to kickstart their career – and earn a wage while they learn."
        },
        {
            "text": "But how are they funded and can they help you gain a Masters of Business Administration (MBA)?"
        },
        {
            "text": "Here we bust some of the common myths about apprenticeships."
        },
        {
            "heading": 3,
            "text": "1. Myth: The apprenticeship levy doesn’t benefit young people"
        },
        {
            "text": "Wrong. The apprenticeship levy helps fund apprenticeship training for young and older people."
        },
        {
            "text": "Young people under the age of 25 make up more than half of all apprenticeship starts.To support even more businesses to offer apprenticeships to young people:"
        },
        {
            "text": "To make it easier for young people to find apprenticeships, they will soon be able to use UCAS to search and apply for apprenticeships, alongside degrees. We’re also continuing to promote apprenticeships in schools and colleges through our Apprenticeship Support & Knowledge programme (ASK) – so far, over 2 million students have received support from ASK."
        },
        {
            "text": "Our ‘Get the Jump’ campaign also aims to raise awareness and understanding of all the different education and training pathways open at post-16 and post-18, including apprenticeships."
        },
        {
            "heading": 3,
            "text": "2. Myth: Businesses are using levy funds to pay for their staff to gain an MBA qualification"
        },
        {
            "text": "Levy funds can’t be used to pay apprentice wages, for ‘top-up’ qualifications, or qualifications that are not already approved as part of the apprenticeship."
        },
        {
            "text": "For example, levy funds can’t be used to pay for apprentices who are on the Level 7 senior leader apprenticeship to do their Master of Business Administration (MBA)."
        },
        {
            "text": "MBAs are not a mandatory part of any apprenticeship. However, the apprentice or their employer is free to pay extra from their own funds for the MBA qualification."
        },
        {
            "text": "In fact, the Senior Leader apprenticeship no longer includes an MBA qualification and hasn’t since 2021."
        },
        {
            "text": "The Senior Leader apprenticeship only includes content deemed essential by employers and the independent body responsible for apprenticeship standards, some of which overlaps with elements of the MBA."
        },
        {
            "text": "Last year, (2021/22) just 1.4% of all apprenticeship starts were on the Senior Leader standard."
        },
        {
            "text": "All apprenticeship training providers must follow funding rules and are subject to regular checks."
        },
        {
            "text": "Any failure to comply may result in funds being recovered. Ofsted regularly inspects the quality of training to ensure apprentices are learning the specific content needed to be effective senior leaders. These measures are the standard course of business."
        },
        {
            "heading": 3,
            "text": "3. Myth: £1billion of public money was spent on masters’ courses"
        },
        {
            "text": "Any reports claiming that £1billion of public money was spent on masters’ courses are categorically untrue."
        },
        {
            "text": "Since 2021 no apprenticeship has included an MBA."
        },
        {
            "text": "Employers fund the apprenticeships programme in England through a levy and it’s right that they should decide which apprenticeships they need to meet their skill needs."
        },
        {
            "text": "Moreover, apprenticeships train people to enter all types of occupations. For example, apprenticeships at levels 6 and 7 train nurses, police officers, software engineers and doctors as well as managers, accountants and tax professionals."
        },
        {
            "heading": 3,
            "text": "4. Myth: Fewer young people are starting lower-level apprentices"
        },
        {
            "text": "Seventy per cent of apprenticeships are at levels 2 and 3. Reports which state that fewer people are doing entry-level apprenticeships only tell one side of the story."
        },
        {
            "text": "More people are now opting for high-quality  apprenticeships at L4 and above like degree apprenticeships, instead of intermediate apprenticeships. This has led to a fall in the number of people starting Level 2 apprenticeships."
        },
        {
            "text": "This doesn’t mean that fewer people are doing apprenticeships overall – it means that more people are doing higher skilled apprenticeships."
        },
        {
            "text": "That said, we know there is more to be done to ensure people from all backgrounds can access apprenticeships.  That is why we pay £1,000 to both employers and training providers when they take on any apprentice aged under 19, or apprentices aged 19-24 who have an Education, Health and Care Plan or have been in care."
        },
        {
            "heading": 3,
            "text": "5. Myth: Apprenticeships are not helping disadvantaged young people"
        },
        {
            "text": "Wrong. Apprenticeships support thousands of young people without GCSE passes at school to gain the literacy and numeracy skills they need to progress to higher paid work."
        },
        {
            "text": "And to support less advantaged young apprentices, we have raised the apprentice minimum wage by 9.7%. This is on top of last year’s raise worth 11.9%."
        },
        {
            "text": "Most apprentice employers pay more than the minimum – in 2021, median apprentice pay was £9.98/hour."
        },
        {
            "text": "From August 2023, we are increasing the bursary that we pay to apprentices aged 16-24 who are care leavers, from £1,000 to £3,000. In addition the employer and provider of an young apprentice who has been in care are each paid an additional £1,000."
        },
        {
            "text": "There is additional funding available for disabled apprentices who need additional support to get it."
        }
    ]
}