{
    "url": "https://homeofficemedia.blog.gov.uk/2023/04/03/accommodation-sites-factsheet-april-2023/",
    "title": "Accommodation sites factsheet - April 2023",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-04-03T13:01:18+01:00",
    "content": [
        {
            "text": "The government has announced that surplus military sites will accommodate asylum seekers who enter the UK illegally on small boats and to reduce reliance on expensive hotel use."
        },
        {
            "text": "On Wednesday 29 March 2023, the Immigration Minister, Robert Jenrick confirmed to Parliament that the government is continuing work to Stop the Boats; reducing the unsustainable pressure on the UK’s asylum system and the cost to the taxpayer caused by illegal crossings."
        },
        {
            "text": "The Home Office will set up alternative accommodation sites on surplus military sites of Scampton, Lincolnshire and Wethersfield, Essex."
        },
        {
            "text": "A site in Bexhill, East Sussex will also be introduced in the coming months."
        },
        {
            "text": "A further accommodation site in the Prime Minister’s constituency, Catterick Garrison will be brought forward in due course."
        },
        {
            "text": "In addition, the government is exploring the use of vessels to provide accommodation in line with the approach taken by the Netherlands and Scotland."
        },
        {
            "text": "Why is the current asylum accommodation model not working? "
        },
        {
            "text": "The rise in illegal crossings to the UK has placed an unprecedented burden on communities."
        },
        {
            "text": "Last year, more than 45,000 migrants made the dangerous and unnecessary journey across the Channel, travelling through safe countries like France to get here."
        },
        {
            "text": "Since 2018, nearly 85,000 people have illegally entered the United Kingdom in small boats. Almost all claim asylum."
        },
        {
            "text": "The United Kingdom has a legal obligation to provide asylum seekers who would otherwise be destitute with accommodation and other support whilst their claim for asylum is being considered."
        },
        {
            "text": "With record numbers of asylum seekers arriving on our shores, the government has had no choice but to open contingency hotel accommodation to meet that obligation."
        },
        {
            "text": "The unprecedented number of crossings has led to about 51,000 migrants being accommodated in hotels – costing the taxpayer, £6 million every day."
        },
        {
            "text": "The new alternative asylum accommodation sites"
        },
        {
            "text": "The minister set out an update in Parliament on the ongoing work being done across government to secure alternative, more appropriate, cost-effective accommodation options around the country."
        },
        {
            "text": "These large-scale sites will house asylum seekers in basic and functional accommodation whilst they await a decision on their claim. People whose claims are refused and have exhausted their appeal rights will be removed from the UK."
        },
        {
            "text": "Government-owned former military sites will deliver better value for the taxpayer, while managing asylum seekers in a more orderly and effective way without placing an extra burden on housing."
        },
        {
            "text": "The Home Office have worked to secure two surplus military sites in Essex and Lincolnshire to accommodate asylum seekers from hotels and those arriving illegally."
        },
        {
            "text": "Plans will see asylum seekers housed in former barracks and modular accommodation. The government will also open a non-military site in Bexhill, East Sussex."
        },
        {
            "text": "In addition further accommodation in the Prime Minister’s constituency at Catterick Garrison will be brought forward in due course."
        },
        {
            "text": "In all these sites, there will be comprehensive healthcare provisions in place to reduce pressure on local GP and NHS services, catering facilities on site and with 24/7 security. Local authorities will also receive additional grant funding the manage pressures."
        },
        {
            "text": "Further sites will be announced in due course this year."
        },
        {
            "text": "Who will be on the sites?"
        },
        {
            "text": "Asylum seekers who have come to the UK illegally via a small boat will be housed in these sites until their asylum claim is processed."
        },
        {
            "text": "These sites will accommodate non-detained, single adult male asylum seekers only."
        },
        {
            "text": "Both Wethersfield and Scampton are due to accommodate about 200 people initially, with capacity gradually increasing over a three-month period to up to 1,700 at Wethersfield and 2,000 at Scampton."
        },
        {
            "text": "In Bexhill, there are plans to accommodate up to 800 people in phase one of the site opening, going up to 1,200 by the end of the year."
        },
        {
            "text": "The numbers of people expected on other sites will be set out in due course."
        },
        {
            "text": "When will these sites open? "
        },
        {
            "text": "The sites at Scampton and Wethersfield will welcome asylum seekers once they are safe and fit for purpose."
        },
        {
            "text": "The Home Office is working with relevant agencies, including the local councils for these sites, to ensure the local community are prepared for the sites to open."
        },
        {
            "text": "The timeline for further sites will be announced in due course."
        },
        {
            "text": "What is happening in Scampton?"
        },
        {
            "text": "RAF Scampton is a Ministry of Defence site located in Lincolnshire. It was until recently the home of the RAF Aerobatic Team, the Red Arrows, who have now moved to nearby RAF Waddington. Their use of the airspace above RAF Scampton continues until 1 April 2023."
        },
        {
            "text": "We will work closely with MoD and stakeholders, including local authorities and our contractors, to ensure that accommodation provided for those seeking asylum is suitable. The site will be operated by a trusted existing asylum accommodation contractor with Home Office oversight."
        },
        {
            "text": "The Home Office will preserve the heritage features of Scampton, recognising the vital role it played in the Second World War. This includes not accommodating migrants in buildings from this period.  The Home Office only intends to use Scampton on a temporary basis. We are committed to working with West Lindsey District Council to develop their long-term vision for the site."
        },
        {
            "text": "For further information on the Scampton site specifically, please see the RAF Scampton Asylum Accommodation factsheet on GOV.UK."
        },
        {
            "text": "What is happening in Wethersfield?"
        },
        {
            "text": "The Ministry of Defence Police and Guarding Agency (MDPGA) Wethersfield site is in Braintree, Essex."
        },
        {
            "text": "The Home Office, supported by the Ministry of Defence, is working on proposals which will see the current Wethersfield site used for suitable accommodation for asylum seekers."
        },
        {
            "text": "We will closely working with stakeholders, including local authorities and our contractors, to ensure that accommodation which could be provided for those seeking asylum is suitable. The site will be operated by a trusted existing asylum accommodation contractor with Home Office oversight."
        },
        {
            "text": "For further information on the Wethersfield site specifically, please see the MoD Wethersfield Asylum Accommodation factsheet on GOV.UK."
        },
        {
            "text": "What is happening in Bexhill?"
        },
        {
            "text": "The proposed site is the Northeye Residential and Training Establishment in the outskirts of Bexhill."
        },
        {
            "text": "The Home Office is working on proposals which could transform the current site into suitable accommodation for asylum seekers in response to the increasing pressures on the UK asylum system."
        },
        {
            "text": "We will work closely with stakeholders, including other government departments and our contractors, to ensure that any accommodation which could be provided for those seeking asylum is suitable. The site will be operated by a trusted existing asylum accommodation contractor with Home Office oversight."
        },
        {
            "text": "For further information on proposals for the Bexhill site specifically, please see the Bexhill Asylum Accommodation factsheet on GOV.UK."
        },
        {
            "text": "What is happening in Catterick?"
        },
        {
            "text": "The Home Office is developing proposals for use of sites in Catterick Garrison."
        },
        {
            "text": "Supported by the Ministry of Defence, the Home Office will work with local stakeholders to develop these proposals, to ensure that any accommodation which could be provided is suitable."
        },
        {
            "text": "We’ll set out more details in due course."
        },
        {
            "text": "What engagement will take place with the local communities?"
        },
        {
            "text": "We are engaging with the community and stakeholders - including the police and NHS - to ensure we take on board their views as plans develop."
        },
        {
            "text": "The Home Office has and will continue to engage with local MPs and councils of the sites to understand the local community and the effect the sites will have on the area."
        },
        {
            "text": "We will work to minimise the impact on residents including 24/7 security to reduce the need for police patrols, on-site catering, healthcare and transport provision for those housed on site."
        },
        {
            "text": "The government understands the frustrations of communities and that there may be those who disagree with the plans. There are, however, no straightforward solutions to addressing the accommodation shortage for asylum seekers and to meet our legal duties."
        },
        {
            "text": "Further measures announced to improve the asylum accommodation system "
        },
        {
            "text": "For existing dispersed accommodation and beds in hotels, the government will provide local authorities with a one off £750 payment for each asylum seeker who is in Home Office accommodation on the 1st April 2023 – up from £250 last year. The payment will be made during quarter 1 of 2023/24."
        },
        {
            "text": "The government currently provides £3,500 to local authorities for new and occupied dispersal beds. This £3,500 funding for local authorities will be extended to sites at Wethersfield and Scampton."
        },
        {
            "text": "In addition, a new pilot will also be introduced to offer local authorities an additional one off payment of up to £3,000 for new dispersal beds which are brought on and occupied quickly. This funding will not apply to accommodation sites."
        },
        {
            "text": "To support the rapid provision of accommodation in local areas, on Thursday 30 March 2023, the government laid a statutory instrument (secondary legislation) that, subject to agreement of Parliament, will temporarily exempt asylum accommodation from House in Multiple Occupation (HMO) licensing requirements. The exemption will apply to properties which begin use as asylum accommodation until the 30 June 2024 and last for a two-year period."
        },
        {
            "text": "Accommodation will be subject to a robust inspection regime by suitably qualified staff to provide assurances on the safety of accommodation."
        }
    ]
}