{
    "url": "https://educationhub.blog.gov.uk/2023/04/03/everything-you-need-to-know-about-strike-action-in-schools-and-colleges/",
    "title": "Teachers' strikes latest: Everything you need to know about strike action in schools",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools",
        "strikes"
    ],
    "pub_date": "2023-04-03T17:51:14+01:00",
    "content": [
        {
            "text": "Teachers in England represented by the National Education Union (NEU) have rejected a pay offer from the Government that would have seen salaries rise by 4.5% on average next year, alongside a one-off payment of £1,000 for this year."
        },
        {
            "text": "Instead, it will hold two more strike days in the summer term, causing further disruption for students and parents."
        },
        {
            "text": "The offer, which was presented to the NEU National Association of Head Teachers (NAHT), the Association of School and College Leaders (ASCL) and NASUWT last week, included significant new investment for schools to fund pay rises and commitments to reducing workload by five hours a week."
        },
        {
            "text": "The NEU’s decision is disappointing and means less money for teachers this year and possible disruption to students preparing for exams."
        },
        {
            "text": "Here’s everything you need to know, from what it means for schools to what happens next."
        },
        {
            "heading": 3,
            "text": "What is the Government doing to prevent further strike actions in schools?"
        },
        {
            "text": "Our priority is making sure children get the education that they deserve and do not have to face further days of disruption, especially as public examinations approach."
        },
        {
            "text": "Last week’s pay offer followed a week of intensive talks between unions and Education Secretary Gillian Keegan."
        },
        {
            "text": "The offer included a one-off payment of £1,000 for the current academic year, on top of the 5.4% average pay rise teachers received in September 2022."
        },
        {
            "text": "Teachers and leaders were also offered an average pay rise of 4.5% from September 2023. This is above the Office for Budget Responsibility (OBR) forecast for inflation at the end of this calendar year, which is 2.9%, with inflation forecast to fall further next year."
        },
        {
            "text": "The starting salary for new teachers outside London would have risen by 7.1% to £30,000."
        },
        {
            "text": "The unions also rejected an offer to create a new taskforce to help reduce workload by an average of five hours a week for teachers and leaders."
        },
        {
            "heading": 3,
            "text": "Was the pay offer fully funded? "
        },
        {
            "text": "Yes – schools would have been fully funded to meet the costs of the offer."
        },
        {
            "text": "This included an additional £620 million of funding in 2023 to 2024, to pay in full for the one-off payment of £1,000 for each teacher (pro-rata for part-time teachers) and enable schools to pay salary increases that go above the funding they have already received."
        },
        {
            "text": "Schools are already going to receive an additional £2 billion in 2023 to 2024, and in 2024 to 2025, taking school funding to its highest level in history."
        },
        {
            "text": "The Institute for Fiscal Studies (IFS) also published an assessment of schools’ funding and costs, which comes to similar conclusions. You can read more about the details of the offer here."
        },
        {
            "heading": 3,
            "text": "What happens next?"
        },
        {
            "text": "Teacher pay for next year will now go through an independent pay review process as usual."
        },
        {
            "text": "The School Teachers’ Review Body (STRB) makes recommendations on the of teachers in England and reports to the Secretary of State for Education and the Prime Minister."
        },
        {
            "text": "As is normal, the STRB will look only at pay for next year, meaning teachers will not receive a one-off payment for this year (2022 to 2023)."
        },
        {
            "heading": 3,
            "text": "Will there be more strikes and when are they?"
        },
        {
            "text": "The NEU has further strikes planned for:"
        },
        {
            "text": "Previous strike action by the NEU took place on:"
        },
        {
            "heading": 3,
            "text": "Will the upcoming strikes affect exams? "
        },
        {
            "text": "We understand that a new round of teacher strikes is especially concerning for pupils, parents and carers who are preparing to sit exams and assessments in the summer term, such as SATs, GCSEs and A Levels. It is unclear yet if exams will be disrupted."
        },
        {
            "text": "If schools need to restrict attendance due to a lack of staff, we have asked that vulnerable children, children of critical workers and pupils who are due to take public examinations (like GCSEs) and other formal assessments are prioritised."
        },
        {
            "text": "Where schools are not able to provide face-to-face education for all pupils, we encourage them to provide remote education to ensure every child has access to learning."
        },
        {
            "heading": 3,
            "text": "Will schools be closed again if teachers go on strike?"
        },
        {
            "text": "In the event of strike action at a school, the school leaders or local authority that manages the school will take all reasonable steps to keep the school open for as many pupils as possible. We have produced updated guidance to help them do this and to minimise disruption to children and families."
        },
        {
            "text": "In some schools there may be little or no impact from strike action but in others it may mean that changes are made to the way they operate. Schools will usually let parents know how they are being affected but if you are unsure, you should contact your child’s school."
        },
        {
            "text": "Unless school leaders inform you that the school is closed or cannot provide a place, then you still have a legal duty to send your children to school unless they are unwell."
        },
        {
            "text": "The Education Secretary is encouraging teachers to inform their school leaders in advance whether they intend to take strike action or not, to help schools and families plan ahead."
        }
    ]
}