{
    "url": "https://environmentagency.blog.gov.uk/2023/04/03/taking-the-rolls-royce-small-modular-reactor-smr-to-the-next-step/",
    "title": "Taking the Rolls-Royce Small Modular Reactor (SMR) to the next step",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2023-04-03T13:43:39+00:00",
    "content": [
        {
            "text": "The Environment Agency’s New Reactors Assessment Team is leading the assessment of the Rolls-Royce SMR nuclear power station design. Andrew Pynn, Senior Advisor for the project, highlights the benefits of generic design assessment (GDA) and what happens next for this innovative new design."
        },
        {
            "text": "New nuclear power stations are an important part of the government’s plans for generating secure low carbon energy. Just last week the government launched its ‘Powering Up Britain’ plan and ‘Great British Nuclear’ which will start to deliver the ambition to build up to 24GWe of nuclear capacity by 2050."
        },
        {
            "text": "At the Environment Agency and Natural Resources Wales, the work delivered by our nuclear regulators is all about protecting communities and the environment. We’ve been looking at the Rolls-Royce SMR design to determine if it is environmentally acceptable for England and Wales."
        },
        {
            "text": "After a year of learning about this new design and reviewing information provided by Rolls-Royce SMR Ltd, we’ve completed the preparatory step of our Generic Design Assessment and declared that the company is ready to start Step 2 today."
        },
        {
            "text": "Working in partnership"
        },
        {
            "text": "The UK’s nuclear regulators work together, assessing designs at an early stage, before construction begins. Doing it early means we can spot any design issues that might impact on the environment and ask Rolls-Royce SMR Ltd’s designers to address them."
        },
        {
            "text": "The Office for Nuclear Regulation (ONR) cover the safety and security whilst we and Natural Resources Wales (NRW) focus on protection of the environment and radioactive waste."
        },
        {
            "text": "The regulators have set up a joint programme office to help deliver the GDA and our teams work together in person and virtually as part of a single project. Our communications and engagement with stakeholders is also joined up and we’ve set up joint webpages to provide information about GDA."
        },
        {
            "text": "What happens in Step 2?"
        },
        {
            "text": "The GDA process has up to 3 steps, with our assessment getting more detailed as we progress. Now we’ve moved to Step 2 our team of nuclear regulators and scientists will be scrutinising even more information from Rolls-Royce SMR Ltd, identifying issues and highlighting any concerns we have. Step 2 is when the first technical assessment takes place and we focus on what features and arrangements are in place to protect the environment. This includes looking at how the design can be optimised to reduce the amount of radioactive waste produced and how that waste is managed and disposed of. We meet regularly with the company and it’s at these meetings where we talk thorough what we’ve found and make sure the Rolls-Royce engineers understand our expectations."
        },
        {
            "text": "Tell us and the company what you think"
        },
        {
            "text": "Now we’ve launched Step 2 it’s time for the public and stakeholders to get involved. Engagement with communities is important to us. Whilst we don’t yet know where this reactor design could be located, Rolls Royce SMR Ltd has highlighted some sites it is interested in so we’ll start to focus our engagement initially in those areas. We also want to hear from engineers, academics, environmental groups, NGOs and others who are interested in nuclear reactor designs and their impact on the environment."
        },
        {
            "text": "So how can you get involved? When we start a new GDA we ask the reactor design company to set up a ‘comments process’. This includes launching a website, providing information and asking for feedback on the design and information provided. Have a look at Rolls-Royce SMR Ltd’s new website and consider making a comment. We’ll see all your questions and comments, and the answers provided by the company. Your comments could help inform our assessments."
        },
        {
            "text": "We’ll also hold a public consultation later in the process, if we go into Step 3 of the GDA."
        },
        {
            "text": "Read the reports including a summary targeted at a non technical audience!"
        },
        {
            "text": "Contact us for more information about this GDA. nuclear@environment-agency.gov.uk"
        },
        {
            "text": "All images provided by Rolls-Royce SMR Ltd"
        }
    ]
}