{
    "url": "https://dluhcdigital.blog.gov.uk/2023/04/03/what-we-learned-from-round-1-proptech-innovation-fund-digital-citizen-engagement-pilots/",
    "title": "What we've learnt from the PropTech Innovation Fund round 1 digital citizen engagement pilots",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Citizen Engagement",
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2023-04-03T15:45:18+01:00",
    "content": [
        {
            "text": "In August 2021, DLUHC launched the PropTech Innovation Fund to support the widespread adoption of digital citizen engagement tools and services within the planning process. "
        },
        {
            "text": "Round 1 funded 13 pioneering Local Planning Authorities (LPAs) across England to work with 8 Property Technology (PropTech) partners to use innovative digital tools to make the planning process more open and accessible. The projects aimed to boost public engagement, while gathering evidence about the barriers to allow local authorities to adopt digital tools at scale. "
        },
        {
            "heading": 3,
            "text": "Achievements so far "
        },
        {
            "text": "Over 58 meetings and events were held across Round 1 including but not limited to 21 LPA and supplier kick off meetings, 10 Show & Tell events and 9 user research sessions. "
        },
        {
            "text": "You can find further information about the delivery approach in the DLUHC Round 1 Summary Report or hear from LPAs first hand about their projects by watching a recording of our Round 1 Showcase Event.  "
        },
        {
            "text": "If you would like to find out more about any of the 13 individual projects you can read each of the Local Authority project reports on their individual case study page. "
        },
        {
            "text": "Since putting together these reports with our LPA partners, we’ve reflected on key project findings and lessons learned which this blog post draws together.  "
        },
        {
            "heading": 3,
            "text": "Increasing the quality of public participation"
        },
        {
            "text": "Pilots across Round 1 of the Fund have proved that the use of digital citizen engagement tools led to reaching a wider audience and increased the quality and quantity of community engagement compared to historical benchmarks (0.5 - 1%) according to the RTPI). Examples include Cotswolds District Council who reflected an 119% increase in citizen engagement  with their local plan compared to respondents in 2015. "
        },
        {
            "text": "You can see a full case study of the Cotswold project here. "
        },
        {
            "heading": 3,
            "text": "Initial investment leads to long term time and resource savings"
        },
        {
            "text": "Another learning  across all 13 projects is that transformation evolves slowly. The procurement and building of new digital tools and software is costly and time consuming, however a common finding was that once the software was in place the time and resource savings on activities was significant. "
        },
        {
            "text": "To illustrate this, Chesterfield Borough Council were able to save  circa 280 hours of officer time through receiving 84% of submissions for their Call for Sites via their new consultation portal rather than legacy software previously used. "
        },
        {
            "text": "You can see a full case study of the Chesterfield project here. "
        },
        {
            "heading": 3,
            "text": "Digital Planning pilots are levers for cross-authority digital transformation"
        },
        {
            "text": "We have been delighted to see that many LPAs have experienced some degree of success in embedding these platforms within their Council’s ways of working and wider policy strategies for long term digital transformation. "
        },
        {
            "text": "Watford Borough Council noted they are delighted to have embedded several legacy products including their digital planning alerts system and planning information map tools which allowed residents to access and understand planning information faster and more easily according to 80% of respondents. "
        },
        {
            "text": "You can see a full case study of the Watford project here. "
        },
        {
            "heading": 3,
            "text": "Increasing awareness and openness when it comes to development and the accessibility of data"
        },
        {
            "text": "As well as increasing community engagement, many of the pilots demonstrated that digital citizen engagement tools can raise awareness within the community around planning conversations and development trade offs."
        },
        {
            "text": "This increased awareness and openness benefitted LPA officers who had access to this real time data during the pilots as they had  the opportunity to tweak engagement strategies whilst live. "
        },
        {
            "text": "This real time optimisation and improved data quality meant  communications could be tweaked to target under-engaged groups, and to better tailor communications in a way that educated people on the value of development and infrastructure. For example, seeing low response rates from young people encouraged Bolsover to add targeted messages partway through their pilot. "
        },
        {
            "heading": 3,
            "text": "PropTech Innovation Fund next steps "
        },
        {
            "text": "Since Round 1 the PropTech Innovation Fund has grown. In March 2022 Round 2 was launched to continue supporting a total of 45 LPAs to use innovative digital citizen engagement tools and platforms across planning services. "
        },
        {
            "text": "However, as demand for these digital tools accelerates across local authorities, it became clear that adoption by local authorities is often hindered due to inconsistencies with how consultation feedback is processed and a lack of interoperability between new and existing platforms. "
        },
        {
            "text": "As a result continuous funding has been given to projects already underway, to further develop and test solutions relating to the scalability, interoperability and visualisation of consultation data and digital engagement platforms."
        },
        {
            "text": "Last month we announced that 15 more council-led projects have been awarded a total of £3.2 million of funding through Round 3 of the fund. This most recent round of funding will allow LPA teams and their PropTech partners to work together to enhance solutions which are helping to improve the visualisation and processing of consultation data, ensure digital engagement platforms are interoperable, and scale their use. "
        },
        {
            "heading": 3,
            "text": "Contact the team"
        },
        {
            "text": "If you have any questions about our work, want to sign up to receive our fortnightly emails highlighting work current LPA projects are undertaking, or if you just want to connect with peers working in innovative councils across the country we encourage you to get in touch."
        },
        {
            "text": "We’d also love to hear if you’re working on related digital transformation projects outside of the PropTech Innovation Fund so we can discuss how we may be able to share learnings and ideas for future work. "
        },
        {
            "text": "You can keep up to date with the work of the whole Digital Planning Programme on our website, blog and social media channels, LinkedIn and Twitter. "
        }
    ]
}