{
    "url": "https://insideDIO.blog.gov.uk/2024/05/30/how-this-wall-was-used-to-prepare-for-the-normandy-landings/",
    "title": "How this wall was used to prepare for the Normandy Landings",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "D-Day 80",
        "Military Training"
    ],
    "pub_date": "2024-05-30T12:58:06+00:00",
    "content": [
        {
            "text": "Hidden away deep in the Surrey countryside sits a piece of iconic British history. A structure that Defence Infrastructure Organisation (DIO) proudly cares for that helped the Allies prepare for the D-Day landings in 1944.  "
        },
        {
            "text": "A replica of the Nazi-built Atlantic Wall can be found on Hankley Common on the MOD training estate. The reinforced structure measures 100m long, 3m high and 3.5m wide, and was used to help training troops practise techniques to attack and breach the German defences across Western Europe.  "
        },
        {
            "text": "The original Atlantic Wall was a series of armouries, bunkers and both natural and man-made obstacles put into place to defend Nazi-occupied Western Europe from an anticipated Allied invasion. Stretching from northern Norway down to the border of France and Spain, the 2,687km wall provided what was thought to be an impenetrable defence for Nazi-occupied Europe.  "
        },
        {
            "text": "However, on 6 June 1944 as part of meticulously planned Operation Overlord, better known as D-Day, the wall was breached within hours. "
        },
        {
            "text": "The Allied success of breaking through the Atlantic Wall came after months of planning and training exercises including on the replica Atlantic wall in Hankley Common.  "
        },
        {
            "text": "The area in Hankley Common is home to not only the 100m wall, but also other defensive structures the allied expected to face after landing on the Normandy beaches. These include dragon’s teeth, designed to immobilise tanks by lifting their treads off the ground and disabling them, pyramid blocks, which channeled the flow of enemy traffic into designated zones and concrete blocks and wire entanglements, designed to further, keep Allied forces at bay.  "
        },
        {
            "text": "These layers of defences are part of a technique known as ‘defence in depth’, which meant that after breaching the wall itself, there would be several other layers of defences our landing soldiers would need to be prepared to tackle. "
        },
        {
            "text": "Richard Osgood, Senior Archaeologist for DIO, said: "
        },
        {
            "text": "Although no longer used for training, the wall acts as a reminder of the dedication of the brave military personnel who landed on the beaches of Normandy and retook France from Nazi control. It sits as a backdrop for troops who still train on Hankley Common, from nearby Longmoor Camp.  "
        },
        {
            "text": "The Defence Infrastructure Organisation (DIO) is responsible for preserving the wall, alongside the MOD Hankley Conservation Group. "
        },
        {
            "text": "Richard added:  "
        },
        {
            "text": "The Atlantic Wall can be found on Hankley Common and is accessible to the public. Visitors are encouraged to educate themselves on how to stay safe when accessing military land. "
        },
        {
            "text": "In order to stay safe and allow our military to train uninterrupted, the public should:   "
        }
    ]
}