{
    "url": "https://veteranstoday.blog.gov.uk/2023/02/03/census-figures-deliver-more-veteran-insights/",
    "title": "Census figures deliver more veteran insights",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Armed Forces Pensions",
        "Veterans",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2023-02-03T12:50:34+00:00",
    "content": [
        {
            "text": "Almost a third of UK Armed Forces veterans in England and Wales are 80 years of age or older, according to census data just released."
        },
        {
            "text": "The new findings, published by the Office for National Statistics, look at factors such as age, religion and ethnicity."
        },
        {
            "text": "With regard to age, 32% of veterans were 80 or over on the day of the census in 2021, compared with 5% of the non-veteran population."
        },
        {
            "text": "A big majority (94%) of veterans in England and Wales were born in the UK, with 2% entering the world in other Commonwealth countries."
        },
        {
            "text": "In terms of religion, almost two-thirds of (64%) described themselves as Christian in the census, compared with 48% of non-veterans."
        },
        {
            "text": "The vast majority of veterans in England and Wales (96%) identify as white, compared with 83% for the non-veteran population."
        },
        {
            "text": "The census was completed by more than 24 million households across England and Wales on March 21 2021 and was the first of its kind to collect data on people who have served in the Armed Forces."
        },
        {
            "text": "Initial findings last year showed 4% of residents in England and Wales aged 16 and over had served, or 1.9 million people."
        },
        {
            "text": "Rich Pereira, head of demography at the ONS, said: “We can see that almost a third of the community is over 80 and 86% of the community are men."
        },
        {
            "text": "“Many of this group will be those who took part in National Service and/or served in World War Two."
        },
        {
            "text": "“This insight is crucial for the planning of support and services for veterans and their families.”"
        },
        {
            "text": " "
        }
    ]
}