{
    "url": "https://valuationoffice.blog.gov.uk/2023/02/03/council-tax-band-challenges/",
    "title": "Council Tax band challenges",
    "authors": [
        "Richie Roberts - Council Tax Customer Journey Owner"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2023-02-03T10:32:40+00:00",
    "content": [
        {
            "text": "You can contact the VOA if you think your property may be in the wrong Council Tax band. Before challenging your band, it is important to know what to expect."
        },
        {
            "text": "In this blog post, Council Tax Customer Journey Owner Richie Roberts explains the process."
        },
        {
            "heading": 2,
            "text": "Proposals"
        },
        {
            "text": "There are two ways you can challenge your Council Tax band. Which type of challenge you can submit depends on your circumstances."
        },
        {
            "text": "In certain situations, we are required by law to review your band if you ask us to. This is classed as a formal challenge and called making a proposal."
        },
        {
            "text": "You can make a proposal if:"
        },
        {
            "text": "You can also make a proposal to tell us that your property has changed. For example, if it has been demolished or split up, or your local area has physically changed. There’s no time limit on this – you can do it at any time."
        },
        {
            "heading": 2,
            "text": "Band reviews"
        },
        {
            "text": "If you think your band is wrong but you’ve been paying Council Tax for more than six months, you can request a band review. Band reviews are informal challenges, and you can ask for one at any time."
        },
        {
            "heading": 2,
            "text": "Supporting evidence"
        },
        {
            "text": "If you’re making a proposal, it’s helpful for us and your challenge if you provide supporting evidence. While is not a requirement, it’s useful to bear in mind that we make decisions based on the evidence available to us."
        },
        {
            "text": "For band reviews, you need evidence to support your challenge. The quality of evidence you provide is key; we have to see strong supporting evidence to accept a band review request. Without it, we will not be able to review your band."
        },
        {
            "text": "Evidence to support a proposal might be details of any disrepair, or the costs of repairing your home, including schedules of work. You can send us photos, too, if it helps."
        },
        {
            "text": "If your proposal is a banding challenge, or if you are requesting a band review, your evidence could be the addresses of comparable properties."
        },
        {
            "text": "We accept the addresses of up to five similar properties in a lower Council Tax band than yours, as long as these properties are the same as yours in age, style, design, size and type. They will need to be in the same street or estate if you live in a town or city, or in the same village if you live in the countryside."
        },
        {
            "text": "You can also use evidence from house prices if your property or similar properties were sold between:"
        },
        {
            "text": "You’ll need to go to your local library to get this information."
        },
        {
            "text": "Find out more about evidence that supports your challenge."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "After you request a band review, we look at your evidence. From this, we decide whether to accept your informal challenge. We usually let you know if we’ve accepted your challenge within a few days."
        },
        {
            "text": "We are required by law to accept all proposals."
        },
        {
            "text": "Once you have submitted a proposal, or we accept your band review, we will tell you when to expect our full decision. You can currently expect to wait up to four months."
        },
        {
            "text": "Challenges have three outcomes; your band can go up, down, or stay the same. We may also review the bands of similar neighbouring properties to check that they are correct, which means their Council Tax bands could be moved up or down, too."
        },
        {
            "text": "If you submit a proposal and disagree with our decision, you can usually appeal it to the independent Valuation Tribunal. You cannot appeal the outcome of a band review."
        },
        {
            "text": "We are an executive agency of HMRC, so we are bound by strict laws around taxpayer confidentiality. This means, legally, we are unable to share information about the other properties we have used to inform our decision – even if this information is available through other sources."
        }
    ]
}