{
    "url": "https://deframedia.blog.gov.uk/2023/02/03/environmental-improvement-plan-outlines-ambition-to-create-greener-and-cleaner-country/",
    "title": "Environmental Improvement Plan outlines ambition to create greener and cleaner country",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-02-03T16:43:05+00:00",
    "content": [
        {
            "text": "There has been widespread coverage in the Daily Telegraph, Times, Guardian, BBC, the i, regional and trade media following the launch of the Environmental Improvement Plan (EIP)."
        },
        {
            "text": "Building on the vision of the 25 Year Environment Plan, the EIP creates a blueprint to restore nature and improve environmental quality. It is a comprehensive delivery plan which will restore wildlife habitats, create cleaner air and water, boost green jobs and incentivise farmers to adopt nature-friendly practices."
        },
        {
            "text": "The plan sets out actions across water, air, waste and nature and is an ambitious road map to create a greener, cleaner and more prosperous country."
        },
        {
            "text": "The news was also featured on the ITV and BBC News, as well as the BBC Radio 4 Today Programme. A comment piece by Minister Harrison was carried in the Express online, and the Environment Secretary wrote for The i discussing the importance of the EIP."
        },
        {
            "text": "Prime Minister Rishi Sunak said:"
        },
        {
            "text": "“Protecting our natural environment is fundamental to the health, economy and prosperity of our country."
        },
        {
            "text": "“This plan provides the blueprint for how we will deliver our commitment to leave our environment in a better state than we found it, making sure we drive forward progress with renewed ambition and achieve our target of not just halting, but reversing the decline of nature.”"
        },
        {
            "text": "Environment Secretary, Thérèse Coffey, said:"
        },
        {
            "text": "“Our Environmental Improvement Plan sets out how we will continue to improve our environment here in the UK and around the world. Nature is vital for our survival, crucial to our food security, clean air, and clean water as well as health and well-being benefits."
        },
        {
            "text": "“We have already started the journey and we have seen improvements. We are transforming financial support for farmers and landowners to prioritise improving the environment, we are stepping up on tree planting, we have cleaner air, we have put a spotlight on water quality and rivers and are forcing industry to clean up its act."
        },
        {
            "text": "Whether you live in a city or town, in the countryside or on the coast, join us in our national endeavour to improve the environment.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}