{
    "url": "https://forestrycommission.blog.gov.uk/2023/02/03/how-morrisons-are-supporting-farmers-to-plant-trees/",
    "title": "How Morrisons are supporting farmers to plant trees",
    "authors": [
        "Forestry Commission"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-02-03T08:30:43+00:00",
    "content": [
        {
            "text": "Morrisons are supporting a team of Tree Advisors from the Forest Canopy Foundation to give specialist advice to their network of 3,000 farmers, to help plant the right tree species in the right place for the right reasons. The advice includes how to access government and grant funding to cover famers’ costs, as well as how to manage woodland projects for both additional income and environmental benefits, without impacting upon individual farm businesses."
        },
        {
            "text": "Q: Let’s start with the overall challenge, what was the drive behind your Tree Advisor initiative?"
        },
        {
            "text": "Sophie"
        },
        {
            "text": "Q: What led you to take the approach of employing Tree Advisors?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "Q: The initiative involved working with key partners, what were the benefits of working together?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "Q: What was the process behind setting up your tree advice offer?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "Q: How did you roll out the scheme?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "Q: What was the response like? Did farmers welcome the advice from the Tree Advisors?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "Q: What top tips would you give to any other organisations considering tree planting initiatives?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "Q: What are the next steps for Morrisons?"
        },
        {
            "text": "Sophie:"
        },
        {
            "text": "With thanks to Sophie Throup, Head of Sustainability & Agriculture at Morrisons."
        }
    ]
}