{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/02/03/kinship-care-an-internship-and-overcoming-a-difficult-start-to-life/",
    "title": "Kinship care, an internship and overcoming a difficult start to life",
    "authors": [
        "Chloe Agnew"
    ],
    "categories": [
        "Care Leavers",
        "Kinship care"
    ],
    "pub_date": "2023-02-03T12:12:34+00:00",
    "content": [
        {
            "text": "Chloe Agnew is currently on the Civil Service Care Leaver Internship Scheme and tells us about her experience on the programme and growing up with her Gran as her kinship carer. "
        },
        {
            "text": "A life changing moment "
        },
        {
            "text": "The memory of being taken out of my mother’s custody isn’t one that I revisit often. It’s not because I find it too painful or don’t want to, it’s more the fact that despite being painful I only remember certain things clearly. It's that typical blur that you hear people speak of when describing the sudden events that change their life."
        },
        {
            "text": "I was nine years old, practising for our Year 4 production that I was supposed to be narrating that afternoon. I was going over my lines when our headteacher quietly opened the doors and entered the room - my words tapered off as we all looked towards her expectantly. She asked to speak with me and signalled for me to follow her out of the room. For the minute it took to walk from the hall to the school grounds I panicked in my mind about what could possibly be wrong, racking my brain for any behaviour that may have led to me being in trouble."
        },
        {
            "text": "My mind stopped when I saw my grandma, a certain look shading her face. My heart was pounding now, this was out of the ordinary and it made me nervous for whatever she was going to say. I know she told me that I was no longer going to be staying with my mum, that social services were getting involved, that I couldn’t see my mum until they said so and that I was going to stay with my gran until things got better. I also remember everything I could see becoming distorted and blurry from tears, my gran’s face melted into a mirage and I quickly detached my mind from the whole situation."
        },
        {
            "text": "The new normal "
        },
        {
            "text": "The weeks following this day are also hard to recall in detail, they were filled with visits from strangers telling me that they were here to help. Social workers and other professionals I do not remember would come to my gran’s house, sit on the sofa, which was also my temporary bed, and ask me all kinds of questions. I’d give blunt, straightforward responses. They would inspect our living space, review my gran’s ability to care for my brother and I, review our ability to cope and tell me that my mum wasn’t able to be my mum right now but that maybe things would change."
        },
        {
            "text": "Over time I began to get used to this new way of life. Social workers would come and go, many were temporary or covering for someone else. However, I did build a strong rapport with a couple of social workers who were patient and treated me like a child, not just a case. They respected my desire as I grew older to not have as many visits and trusted me, my brother and my gran to evolve how a family naturally would. I think my mum could have been better supported. Her mental health diagnoses were often difficult to understand, and I feel many of the social work staff were not as empathetic as they could have been or well-trained enough to work with her in the way she needed. This definitely had an impact on me."
        },
        {
            "text": "Moving forward "
        },
        {
            "text": "Eleven years later and I still live with my gran. In this time a lot happened but the biggest change has been my perspective. Ultimately I learned that my family was never going to return to what it once was and that I had to learn to love and appreciate the family that formed. I learned that I was grateful to have been taken into kinship care, meaning my brother and I got to stay together under the custody of my gran."
        },
        {
            "text": "Looking back, I can’t deny that the experience of social intervention wasn’t uncomfortable. However, I can acknowledge that without intervention I would not be where I am today. Living with my gran provided me with the stability and security that my mum wasn’t able to provide. It broke my heart to be taken from her, and I think it broke her more, and yet if I had stayed in my mum’s custody then I think we would have been broken by the forces that drove our family apart in the first place."
        },
        {
            "text": "Over the years I was given an opportunity to grow and heal in a safe environment and I know that my mum knew it too. She knew my gran could continue to raise my brother and I in ways that she couldn’t, and I will always be grateful to them both for being the women who brought me up and made me who I am now. If I could go back in time and live a “normal” life with my mum, of course I would. However, time travel isn’t possible and I eventually learned to realise that kinship care was giving me opportunity, not taking it away."
        },
        {
            "text": "Taking on an internship scheme "
        },
        {
            "text": "I’m writing this now as an intern for the Civil Service Care Leaver Internship Scheme. I found out about this opportunity through the Drive Forward Foundation who do amazing work to support care leavers achieve their full potential. They first supported me with my mental health by referring me to Richard at Barnardo Counselling, an amazing counsellor who provides a free course of counselling sessions to care leavers. Drive Forward helped me and other care leavers through employment and interview skill sessions to help guide us towards sustainable employment opportunities. This is where I was introduced to the Civil Service Care Leaver Internship Scheme."
        },
        {
            "text": "Nine months into the internship and I’m still overjoyed with my placement and the team I’m part of. It’s been a huge stepping stone, providing me with experience in the civil service, which of course looks great on the CV, but beyond that has provided me with purpose, routine, and a sense of calm that has improved my overall wellbeing. I think the calmness comes from feeling more secure, like I can see my future and can actually look forward to it."
        },
        {
            "text": "This internship has helped me to see what is available out there and has opened my eyes to all the careers I could pursue. Most importantly, it provides a special space for care leavers so that they are offered not only the opportunity to enter into the civil service but also to help instil a culture where young people from difficult backgrounds can feel both welcomed and supported."
        },
        {
            "text": "I’m grateful to have received support, empathy and patience when I’ve faced personal difficulty during my internship. I’m currently preparing for applications in the hope that I can cement my place in the civil service and I feel more hopeful than ever about the path ahead of me."
        },
        {
            "text": "The Children’s Social Care Implementation Strategy and consultation, Stable Homes Built on Love, sets out how the government is strengthening support for care leavers, kinship care and social workers. Submit your response to the consultation on children’s social care here on gov.uk. "
        },
        {
            "text": "For information about the Civil Service Care Leaver Internship Scheme, head here. "
        },
        {
            "text": "Further detail on how family members or friends can look after for children and young people who can’t be cared for by their birth parents is here. "
        },
        {
            "text": "The Family Rights Group helpline is also available for kinship carers for free, independent advice. "
        }
    ]
}