{
    "url": "https://mhrainspectorate.blog.gov.uk/2023/02/03/manufacture-of-investigational-medicinal-products-frequently-asked-questions/",
    "title": "Manufacture of Investigational Medicinal Products – Frequently Asked Questions",
    "authors": [
        "Alan Moon"
    ],
    "categories": [
        "Compliance matters",
        "Good clinical practice",
        "Good manufacturing practice"
    ],
    "pub_date": "2023-02-03T09:30:47+00:00",
    "content": [
        {
            "text": "GMP and GCP Inspectors work closely with MHRA Clinical Trials and regularly provide support to help answer a wide range of stakeholder queries which relate to the manufacture, import, labelling, licencing requirements and general handling of Investigational Medicinal Products (IMPs)."
        },
        {
            "text": "We previously published this ‘frequently asked questions’ blog related to manufacture and supply of IMPs back in 2016, and it was based on an original publication on the earlier MHRA website. As there have been some changes since this was published, including the introduction of an import oversight process for QP certified IMPs into Great Britain from approved countries, we thought it would be beneficial to review and update this blog."
        },
        {
            "text": "The most common query we receive relates to deciding if an activity should be considered as manufacture or reconstitution. EU GMP Annex 13 in Eudralex Volume 4 provides guidance on this as follows:"
        },
        {
            "text": "Annex 13, 2010:"
        },
        {
            "text": "“Manufacturing authorisation and reconstitution"
        },
        {
            "text": "Both the total and partial manufacture of investigational medicinal products, as well as the various processes of dividing up, packaging or presentation, is subject to the authorisation referred to in Article 13(1) Directive 2001/20/EC, cf. Article 9(1) Directive 2005/28/EC. This authorisation, however, shall not be required for reconstitution under the conditions set out in Article 9(2) Directive 2005/28/EC. For the purpose of this provision, reconstitution shall be understood as a simple process of:"
        },
        {
            "text": "Reconstitution is not mixing several ingredients, including the active substance, together to produce the investigational medicinal product."
        },
        {
            "text": "An investigational medicinal product must exist before a process can be defined as reconstitution."
        },
        {
            "text": "The process of reconstitution has to be undertaken as soon as practicable before administration.”"
        },
        {
            "text": "This process has to be defined in the clinical trial application / IMP dossier and clinical trial protocol, or related document, available at the site."
        },
        {
            "text": "Detailed Commission guidelines on good manufacturing practice for investigational medicinal products for human use (“Updated Annex 13”):"
        },
        {
            "text": "“The reconstitution is understood as the simple process of dissolving or dispersing the investigational medicinal product for administration of the product to a trial subject, or diluting or mixing the investigation medicinal product with some other substance(s) used as a vehicle for the purpose of administering it to a trial subject."
        },
        {
            "text": "Reconstitution is not mixing several ingredients, including the active substance, together to produce the investigational medicinal product. An investigational medicinal product must exist before a process can be defined as reconstitution."
        },
        {
            "text": "The process of reconstitution has to be undertaken as close in time as possible to administration and has to be defined in the clinical trial application dossier and document available at the clinical trial site.”"
        },
        {
            "text": "So what does this mean? Well, a ‘simple process’ means just that. Dissolving or dispersing the IMP in a diluent immediately prior to administration or diluting with a vehicle for administration (commonly water for injection, saline or glucose – perhaps in an IV bag) would most likely be considered reconstitution activities. Measuring or weighing out quantities of several materials to be combined in a defined sequence or with a specified mixing time that perhaps includes some in-process test to confirm details such as concentration or pH, sterile filtration into another container and integrity testing of the filters prior to making a release decision would all be considered manufacture, must therefore be conducted at a facility that holds an MIA(IMP) and must be certified by a Qualified Person prior to release to the Sponsor for use in a clinical trial. Scenarios are considered on a case-by-case basis – if in doubt ask us via the clinical trials helpline (details provided below)."
        },
        {
            "text": "Our interpretation of ‘as soon as practicable before administration’ is ideally at the bedside, however it may be acceptable for the activities to be performed in the clinic’s pharmacy e.g. where IMP reconstitution is required to be performed in a clean area such as a laminar air flow cabinet. Preparation of IMP to be subsequently stored for use at a later date would not be considered reconstitution."
        },
        {
            "text": "We hope that you find the following Q&A’s helpful. If you have any further queries relating to clinical trials, please continue to send these to the clinical trials helpline at ctdhelpline@mhra.gov.uk"
        },
        {
            "text": "Note: The UK CT Legislation is currently under review. Any changes to this position will be updated as necessary."
        },
        {
            "text": "Alan Moon, Lead Senior GMDP Inspector"
        },
        {
            "text": "Martine Powell, Lead Senior GMDP Inspector"
        },
        {
            "text": "Jason Wakelin-Smith, Expert GCP Inspector & Head of GxP Expert Circle"
        },
        {
            "text": " "
        },
        {
            "text": "Manufacture / Reconstitution"
        },
        {
            "text": "A simple reconstitution or dilution (including serial dilution) of an IMP including a sterile injection for the purpose of administration falls outside the definition of manufacture and so no Manufacturer’s Authorisation for Investigational Medicinal Products (MIA(IMP)) would be needed. It is also permissible without an MIA(IMP) to label them after reconstitution with an identifier to ensure that the dose goes to the correct subject. See also Q23 for further information."
        },
        {
            "text": "1a. The reconstitution we are carrying out involves the addition of another material as well as the diluent. Does this still fall outside the definition of manufacture?"
        },
        {
            "text": "This may fall within the scope of manufacture; however it depends upon the nature of and reasons for multiple additions. Any operation such as weighing out, adding other materials, or combining IMPs is not considered to be for the purposes of administration and so would require appropriate authorisation under a MIA(IMP). This situation is potentially complicated and should be considered on a case-by-case basis by the MHRA. Ideally this should be discussed with a MHRA Clinical Trials pharmaceutical assessor pre-submission."
        },
        {
            "text": "Licensing and Testing"
        },
        {
            "text": "The Human Medicines Regulations 2012 applies to therapeutic doses. In this legislation there are some exemptions from the need for a manufacturing licence such as the 'Section 10' exemption which can be invoked here. There is no such exemption for the manufacture of IMPs. So, the manufacture of even one dose for immediate use requires an MIA(IMP) authorisation and Qualified Person (QP) certification."
        },
        {
            "text": "2a. Does this mean that all such manufactured IMPs need to be analytically tested before they can be certified, even if the quantity is very small?"
        },
        {
            "text": "Yes. The analytical requirements should be agreed with MHRA Clinical Trials via the clinical trial application (CTA). If an activity defined as manufacture takes place (see above) then the resultant IMPs should be tested to confirm that the specification submitted in the CTA is met. There may be exceptions for certain types of products, e.g. ATIMPs or radiolabelled IMPs where testing may not be performed prior to release due to very short shelf life, however the associated rationale should be documented and agreed by MHRA Clinical Trials in advance."
        },
        {
            "text": "2b. Does the release testing for my IMP need to be carried out in a GMP-certified laboratory?"
        },
        {
            "text": "It would be expected that the analysis would be performed in a GMP-compliant laboratory. Testing in support of certification and release is considered part of manufacturing and therefore compliance with GMP is expected. For an IMP, the certifying QP may rely on the results of analysis from a non-EU laboratory and not repeat testing on import to the EU/UK, however they must assure themselves that the laboratory is compliant with EU GMP as part of the process of supply chain assurance and issuance of the QP Declaration for import. This is described in the sections relating to release of batches within EU GMP Annex 13."
        },
        {
            "text": "Paragraph 8 in Part 2, Schedule 7 of the Medicines for Human Use (Clinical Trials) Regulation 2004 (as amended) [SI 2004 1031] requires the manufacturing authorisation holder to keep samples of each batch of formulated products readily available for examination. There should be enough finished packs for testing in duplicate. As IMPs are often small packing runs from one bulk batch, EU GMP Annex 19 accepts a justification for retaining the required sample quantity of the bulk batch and separate samples of packaging components used on each packing run. The sample of the bulk batch should be in the final primary pack in order to be representative of the materials supplied for use on a clinical trial. The requirements are also detailed in EU GMP Annex 13."
        },
        {
            "text": "Samples of IMPs used in UK clinical trials should be stored within the UK, EEA or an MRA country unless suitably justified and defined in a technical agreement between the sponsor, importer and third country manufacturer (cost of the IMP itself would not be considered an acceptable justification to not hold appropriate samples)."
        },
        {
            "text": "'Specials' are unlicensed medicines which are manufactured under a manufacturer’s specials licence (MS) for a special clinical need and are under the responsibility of the prescribing doctor. There is no requirement for QP certification of products manufactured under the provisions of an MS. IMPs are governed by different legislation (The Medicines for Human Use (Clinical Trials) Regulation 2004 (as amended) [SI 2004 1031]). IMPs are not 'Specials'. A clinical trial authorisation application including a description of the IMPs has to have been submitted to the MHRA. A QP certification against that clinical trial authorisation is required for each batch of IMP."
        },
        {
            "text": "Regulation 37 of The Medicines for Human Use (Clinical Trials) Regulation 2004 (as amended) [SI 2004 1031] contains a specific exemption which is relevant here. This provides an exemption from the need for a hospital or health centre (both are defined in Regulation 2 of the Clinical Trials Regulations) to hold a MIA(IMP) authorisation to assemble an IMP in a hospital or health centre, when the 'assembly' is carried out by a doctor or pharmacist, or under the supervision of a pharmacist. 'Assembly' is related to packaging and labelling only and not to the preparation of medicines from their ingredients. The exemption applies only if the product is to be used exclusively in that hospital or health centre or any other that is a trial site for the same clinical trial in which the product is to be used. This exemption does not apply to anyone else such as separate organisations which happen to be situated within a hospital or to companies which have a contract to supply hospitals or health centres."
        },
        {
            "text": "No. Capsules are specifically excluded from the definition of a container in the Clinical Trials Regulations SI 2004 1031. An MIA(IMP) with 'capsule manufacture' listed as authorised would be necessary in this case."
        },
        {
            "text": "No. An organisation cannot act as a contract batch certification site only. The sponsors of a clinical trial may wish to keep the final QP certification step of IMP manufacture in house as they carry ultimate responsibility for the trial. Otherwise, any contract organisation such as yours must be involved with some manufacturing or importation of an IMP if they wish to carry out batch certification."
        },
        {
            "text": "There is no requirement within the legislation for any MHRA licence to carry out storage and distribution of IMPs. In this respect, the legislation differs from that for medicinal products. However, you will need to be named within the appropriate annex of your client’s MIA(IMP) as a site of storage and distribution. Therefore, any clients who wish to make use of your services will need to vary their MIA(IMP) accordingly."
        },
        {
            "text": "Note that the storage and distribution of a licensed medicinal product must remain in the licensed distribution chain until it is supplied to the Sponsor for use in a trial."
        },
        {
            "text": "The preparation of such radiopharmaceuticals using Technetium generators is considered to be manufacture and so an MIA(IMP) would be required if they were to be used as IMPs. Note that the Clinical Trial Regulations define an investigational medicinal product (including a licenced medicinal product) as being:"
        },
        {
            "text": "(a) used or assembled (formulated or packaged) in a way different from the form of the product authorised under the authorisation"
        },
        {
            "text": "(b) used for an indication not included in the summary of product characteristics under the authorization for that product"
        },
        {
            "text": "(c) used to gain further information about the form of that product as authorised under the authorization (Article 2)."
        },
        {
            "text": "Note: The UK CT Legislation is currently under review. Any changes to this position will be updated as necessary."
        },
        {
            "text": "However, it may be that the radiopharmaceutical used in a clinical trial may not be an IMP. There are classes of products used in clinical trials which are 'not IMPs' (NIMPs) and details of the definitions can be found in Eudralex Volume 10 on Clinical Trials. NIMPs include challenge agents, rescue medication, agents used to assess end points and others. Clinical trial legislation does not apply to these as long as a), b) and c) don’t apply."
        },
        {
            "text": "Further information relating to NIMPs is included in Q18 and Q25."
        },
        {
            "text": " "
        },
        {
            "text": "Yes. The MHRA does need to know about such manufacture which brings with it special GMP considerations (the manufacture of doses containing potent Active Pharmaceutical Ingredients (APIs) would be another example). Please include the relevant information in the application form describing such manufacture."
        },
        {
            "text": "In addition, details of the active materials / product types handled within your facility are requested as part of the pre-inspection compliance report and cross-contamination prevention is a focus of inspections following the revisions to EU GMP chapters 3 and 5."
        },
        {
            "text": "Yes. An MIA(IMP) licence is required for the manufacture of an IMP regardless of whether the IMP is for use in the UK, an EEA Member State or a non-EEA Member State (Third Country)."
        },
        {
            "text": "The Veterinary Medicines Directorate is responsible for such regulatory issues and contact details are available on the following link: https://www.gov.uk/government/organisations/veterinary-medicines-directorate."
        },
        {
            "text": "You should inform the Defective Medicines Report Centre (DMRC) at the MHRA as you would for a licensed or unlicensed medicinal product. It will also be necessary to inform the MHRA Clinical Trials at the MHRA. The Clinical Trial Regulations make provision for notification of adverse events and notification of suspected unexpected serious adverse reactions. Further guidance for handling investigations into possible product defects and product recall actions is detailed in Chapter 8 of the EU GMP Guide (Eudralex Vol 4)."
        },
        {
            "text": "Import"
        },
        {
            "text": "All sites involved in manufacturing steps starting with the conversion of the API into the dosage form and including primary and secondary packing and also any contract laboratories involved with release or stability testing. A guidance template for the information that should be included on the QP Declaration is provided in Eudralex Vol 10 Chapter III."
        },
        {
            "text": "Note: Import of finished IMPs that have been QP certified in an EEA country into Great Britain requires an oversight process under the supervision of a UK MIA(IMP) holder (see Q15b), however this does not require a UK QP Declaration."
        },
        {
            "text": "No. The starting point for a QP declaration of EU GMP should be an audit conducted by or on behalf of the importing company. Any departure from this should be justified and documented and will be subject to scrutiny during an MHRA inspection. It may be possible to use the fact of a regulatory inspection by an EU Competent Authority as part of this justification, but these are general inspections which may not address the specific technical or GMP issues associated with your product. It may not even have covered the same factory or part of the factory. A regulatory inspection cannot be used unconditionally to remove the need for your own audit. The audit does not need to be done by the QP, however the QP needs to be satisfied that it has been done correctly by an appropriately trained individual as the QP will be taking final responsibility."
        },
        {
            "text": "15a. We also intend to use some IMPs that were manufactured at a site in Switzerland. Do we need to include a QP import declaration with the CTA submission? This will have been certified by a Swiss Responsible Person (RP) so does this also require certification by an EU QP?"
        },
        {
            "text": "Although there is a Mutual Recognition Agreement (MRA) with Switzerland, it remains a third country therefore the IMP would need to be imported by an MIA(IMP) holder. As such, a QP Declaration of EU GMP compliance would need to be included as part of the CTA for each site outside the EU and the IMP would need to be certified by a QP upon import prior to release for use in the clinical trial."
        },
        {
            "text": "15b. We intend to use some IMPs for our trial in Great Britain that were manufactured at a site in the EU/EEA. Do we need to include a QP import declaration with the CTA submission? This will have been certified by an EEA QP so does this also require certification by a UK QP?"
        },
        {
            "text": "Since the UK’s exit from the EU, and from January 2022, import of finished IMPs into Great Britain from EEA countries requires oversight by a UK MIA(IMP) holder. Additional certification by a UK QP is not required, however the UK MIA(IMP) holder responsible for the import oversight process needs to be listed in the UK CTA along with the site of final certification in the EEA."
        },
        {
            "text": "The import oversight activity needs to be specifically authorised in the UK MIA(IMP) and an application or variation to an existing licence should be submitted and approved prior to undertaking this activity."
        },
        {
            "text": "Further details on the requirements for this process can be found at the following link: https://www.gov.uk/government/publications/importing-investigational-medicinal-products-into-great-britain-from-approved-countries."
        },
        {
            "text": "Once a trial has stopped, the product ceases to be an IMP and becomes a medicinal product. If it is a licenced medicinal product then it can be purchased and supplied as normal from the authorised supply chain. However, more often than not, the ex-IMP will not be licenced."
        },
        {
            "text": "Material already existing physically as an IMP in the UK can be retrospectively notified to the MHRA Import Notification System (INS) as an importation of unlicensed medicines according to MHRA Guidance Note 14. This regularises the stock as an unlicensed medicine and the packs can be supplied as such, should MHRA not object to it. The clinical trial particulars should be removed from the product particulars (labelling and product information) ahead of supply taking place. Any stock not currently in the UK must be notified to INS ahead of the importation taking place."
        },
        {
            "text": "The importer of an unlicensed medicinal product (a “special”) into the UK must hold; (a) a Wholesale Dealer’s Licence (WDA (H)) if the product is to be imported from an EEA member state i.e. the EU plus Norway, Iceland and Liechtenstein, or (b) a Manufacturer’s “Specials” Licence if the product is to be imported from a third country i.e. a non-EEA country."
        },
        {
            "text": "The holder of the Wholesale Dealer’s Licence or Manufacturer’s “Specials” Licence, must comply with certain obligations in relation to the import of an unlicensed medicinal product, which are set out in Schedule 4 of the Human Medicines Regulations 2012. These are explained and summarised in MHRA Guidance note 14."
        },
        {
            "text": "There is no requirement for APIs used in IMPs to comply with EU GMP Part II in full, but there remains a responsibility for IMP manufacturers to assure themselves that the API is of an appropriate quality. Section 19 of Part II of the GMP Guide describes the expectations. The EMA has also published a Q&A concerning the GMP status of APIs used in IMPs."
        },
        {
            "text": "However, for Biological Products and Advanced Therapy Investigational Medicinal Products (ATIMP), there is a requirement for EU GMP Part I / Part IV to apply across all manufacturing steps as applicable, including from cell banks and vectors onwards, as detailed in EU GMP Annex 2 and in the PIC/S GMP Guide Annex 2A for manufacture of ATMPs for Human use for example. This is due to the ways in which Biological and Advanced Therapy medicinal products are manufactured and controlled, and the greater significance of the first steps in the manufacture of these products. As such all sites in third countries should be listed in the associated QP declaration for import as part of the submission for UK CTAs."
        },
        {
            "text": "As such products are not IMPs, then the general requirements relating to medicinal products come into force, in particular the need for a Marketing Authorisation under the Human Medicines Regulations 2012. Where a medicinal product is not the subject of a valid Marketing Authorisation, the process for the supply of an unlicensed product provides a means of actually getting the NIMP into the UK for use in a clinical trial. The framework described in Guidance Note 14 is seen as an appropriate means of giving the legal method for the sponsor to actually obtain the NIMP, otherwise there would be no legal basis for supply. Further information on the importation of unlicensed medicines is available on the MHRA website: Supply of unlicensed medicinal products."
        },
        {
            "text": "Stability / Shelf Life"
        },
        {
            "text": "Firstly, MHRA Clinical Trials would need to be informed via a variation to the CTA. Extension of shelf life represents a substantial amendment, unless you have previous agreement within the approved IMP Dossier to extend the shelf life when more stability information becomes available."
        },
        {
            "text": "Secondly, the Product Specification File (PSF) would need to undergo a controlled change such that manufacturing sites and the QPs can take appropriate action such as updating labelling instructions, certification criteria etc."
        },
        {
            "text": "Thirdly, if advantage of the longer shelf life is to be taken for IMPs already manufactured, these IMPs will need to be relabelled. This relabelling will need to be conducted, checked and documented in accordance with EU GMP Annex 13 (see also the following question)."
        },
        {
            "text": "No. Although this would be preferable, it is recognised that this shipping backwards and forwards could cause more GMP problems than it solves. It is permissible in these circumstances for the relabelling to be done at the clinical site. The certifying QP should certainly be aware of this and be involved in setting up the required GMP systems. The relabelling should be done by appropriately trained staff, documented, and the records stored in the original trial file. Any stock not already supplied to clinical sites should be relabelled prior to shipping."
        },
        {
            "text": "Note that the EU GMP Annex 13 deals specifically with this issue. It states:"
        },
        {
            "text": "“If it becomes necessary to change the expiry date, an additional label should be affixed to the investigational medicinal product. This additional label should state the new expiry date and repeat the batch number and clinical trial reference number. It may be superimposed on the old expiry date, but, for quality control reasons, not on the original batch number."
        },
        {
            "text": "The re-labelling operation should be performed by appropriately trained staff in accordance with good manufacturing practice principles and specific standard operating procedures and should be checked by a second person. This additional labelling should be properly documented in the batch records. To avoid mistakes the additional labelling activity should be carried out in an area that is partitioned or separated from other activities. A line clearance at the start and end of activity should be carried out and label reconciliation performed. Any discrepancies observed during reconciliation should be investigated and accounted for before release."
        },
        {
            "text": "The re-labelling operation may be performed by authorised personnel at a hospital, health centre or clinic.”"
        },
        {
            "text": "This approach is usually not acceptable, as this is not compliant with EU GMP or Annex 13 requirements, except where provision of IMP is critical to the ongoing care of trial participants and has been agreed by MHRA Clinical Trials in advance of implementation. It is expected that relabelling processes should be fully explored before seeking approval to bypass relabelling activities. It is likely that additional mechanisms will be required to manage the continued use of incorrectly labelled products whilst correctly labelled stock is made available. Any additional handling or cumulative time out of storage for the relabelling should also be considered in line with the available stability data and this should be appropriately documented within the associated records."
        },
        {
            "text": "A new certification after relabelling is required for stock which has not been shipped to an investigator site. For product held at the trial site, QP certification is not required if the relabelling activity is carried out by, or under the supervision of a pharmacist, or other healthcare professional, with appropriate documented evidence in accordance with EU GMP Annex 13."
        },
        {
            "text": "QPs and Packaging / Labelling Activities"
        },
        {
            "text": "Confirmation that a transitional IMP QPs has been assessed as being suitable and eligible to act as a QP at a given site can be verified by referring to list of authorised personnel within the appropriate UK MIA(IMP) licence. Eligibility certificates for transitional IMP QPs were not issued by MHRA, however if a TQP has been previously named on a UK MIA(IMP) they will continue to be recognised as eligible in this capacity. On receipt of an application to name a TQP on an MIA(IMP), the individual’s suitability will be assessed based on experience of both the authorised dosage forms and the company’s systems."
        },
        {
            "text": "Where an application to name a TQP on an MIA(IMP) is received, it is expected that this only applies to those already named on a previous MIA(IMP) licences. Any QP not yet known to the MHRA via inclusion on an MIA(IMP) will be expected to have undergone the applicable assessment via the Joint Professional Bodies on behalf of the MHRA."
        },
        {
            "text": "The MHRA are no longer reassessing TQPs in line with the requirements of the EU Clinical Trials Regulation 536/2014 following the UK exit from the EU. This is a change from the approach indicated prior to leaving the EU."
        },
        {
            "text": "This 'post certification labelling' can be used for the following and is expected to be performed prior to despatch in the distribution area at the MIA(IMP) holder site; or where justified and controlled then immediately prior to administration to a subject or patient:"
        },
        {
            "text": "It should, in the first instance, be done at a site with an MIA(IMP) unless the risk to the quality of the product is unacceptably elevated by any required transportation back to this site. The level of assurance of product quality should not be less than if this labelling were performed prior to QP certification. It should also be noted that there is no expectation for hospital pharmacy or investigator sites involved in the application of labels as part of the final dispensing process to return packs to a licensed facility for this process."
        },
        {
            "text": "NOTE: Such labelling should not effectively incorporate allocation of doses against a randomisation code. It is important that allocation takes place before this to ensure adequate QA scrutiny and QP confirmation and to ensure that staff applying such post certification labels are not accidentally unblinded."
        },
        {
            "text": "GMP expectations for 'post certification labelling' are:"
        },
        {
            "text": "Medication pooling is the production of IMPs which may be used in a number of clinical trials and which are left in a \"generic\" state until after QP certification. This would usually be by leaving a space for the protocol number to be added at the point of dispensing, or where multiple protocol numbers are on the label with the others being deleted at the point of dispensing. Only after certification is it decided which protocol the particular IMPs are destined for, this is when it is being dispensed to the patient. This is acceptable provided that the QP certification is against all of the possible clinical trials which may use the IMP, the protocol number is added to the IMP doses prior to release to the trial, and the GMP points outlined in Q23 (above) are considered."
        },
        {
            "text": "Non investigational medicinal products (NIMPs) are not IMPs and so the legislative requirements of The Medicines for Human Use (Clinical Trials) Regulation 2004 (as amended) [SI 2004/1031] (as amended) do not apply to such products. There is therefore no requirement to source such products from a site holding an MIA(IMP) or for QP certification of the product. There is an expectation for the Sponsor to ensure that NIMPs are of the necessary quality for human use. Further guidance on sourcing NIMPs is included in Eudralex Volume 10 Clinical Trials Notice to Applicants."
        },
        {
            "text": "As for licensed products, there is no such discretion available to a certifying QP. However, if a batch is manufactured and does not meet the authorised specification then a substantial amendment to alter the specification may be submitted to MHRA Clinical Trials provided it is deemed that safety, quality and efficacy are not compromised. If required, an expedited review may be requested via the Clinical Trials Helpline."
        },
        {
            "text": "Administration of an Out of Specification (OOS) ATIMP may be acceptable in exceptional circumstances without or prior to a Substantial Amendment; however, these must be discussed with MHRA Clinical Trials with regards to impact to the trial prior to administration."
        }
    ]
}