{
    "url": "https://minimumwage.blog.gov.uk/2023/02/03/reviewing-the-accommodation-offset/",
    "title": "Reviewing the Accommodation Offset",
    "authors": [
        "josephwilkinson"
    ],
    "categories": [
        "Compliance and enforcement"
    ],
    "pub_date": "2023-02-03T16:08:51+00:00",
    "content": [
        {
            "text": "In its 2022 Report, the Low Pay Commission completed a review of the Accommodation Offset. This blog sets out a digested version of our conclusions and recommendations."
        },
        {
            "text": "What is the Accommodation Offset? How does it work?"
        },
        {
            "text": "The offset comes into play when a worker lives in accommodation provided by their employer, who charges them for that accommodation."
        },
        {
            "text": "The offset sets a limit on what an employer can charge a minimum wage worker for accommodation. In January 2023, the National Living Wage (NLW), the minimum wage for workers aged 23 and over is £9.50. A worker earning the NLW, can only be charged £8.70 per day, or £60.90 per week for accommodation."
        },
        {
            "text": "Simple so far. But the calculation can get more complicated: for example, when workers earn more than the NLW, when employers charge more than the offset amount, and when pay is calculated on a weekly or monthly basis rather than day by day. More detail, and worked examples, are available on GOV.UK, in HMRC’s manual or on page 155 of our annual report."
        },
        {
            "text": "Another important point is that the offset should include essential utilities – if employers charge extra for energy or water, that could take workers below the NMW."
        },
        {
            "text": "A review of the Accommodation Offset – why?"
        },
        {
            "text": "Our recent report is the culmination of a long review of the Accommodation Offset, where we tried to answer the question: what should we do with the offset in the future?"
        },
        {
            "text": "The Accommodation Offset has been part of the National Minimum Wage (NMW) since day one – but it’s different from other rates."
        },
        {
            "text": "Our recommendations on other NMW rates are guided by a clear brief. For the NLW, this takes the form of a target based on median pay. For the ‘youth rates’ it’s an imperative to raise rates as high as possible without damaging employment."
        },
        {
            "text": "But the offset is distinct – neither the LPC nor the Government has set out a clear principle to apply in determining the level. And, unlike the rates, there are few evidence sources which let us track the effects of our recommendations on employers’ or workers’ decisions."
        },
        {
            "text": "It’s helpful to think of the offset as balancing benefits between workers and employers. When it rises faster than the minimum wage, it’s helpful for businesses in offsetting their costs. When it rises more slowly, workers pocket more of their pay increase."
        },
        {
            "text": "What did we find?"
        },
        {
            "text": "A lot of the evidence we heard concerned the settings where low-paid workers are accommodated by their employers; the nature and quality of this accommodation; and what drives employers’ decisions."
        },
        {
            "text": "Our inquiry focused on agriculture and, to a lesser extent, hotels. Employers told us about the importance of high-quality accommodation to attract and retain workers. Workers we spoke to nevertheless had been put up in cramped or dirty conditions, about which they often felt powerless to complain."
        },
        {
            "text": "The level of the offset does not cover employers’ costs in full, except in marginal cases. But this is a feature of the policy rather than an accident; and the need to keep a happy workforce gives businesses a strong incentive to invest in accommodation. Crucially, there’s no guarantee that pushing the offset higher leads to better quality accommodation, because there’s no clear and universal set of standards for accommodation or rigorous means of enforcement."
        },
        {
            "text": "What were your conclusions?"
        },
        {
            "text": "Our central conclusion was about how fast the offset should increase in the future."
        },
        {
            "text": "A useful way of thinking about the level of the offset is to benchmark it against other rates. Between 2013 and 2020, we pushed the offset up to align it with the 21-24 Year Old Rate. This meant the offset increased faster than most other rates; in other words, what employers could charge minimum wage workers for their accommodation increased faster than their pay."
        },
        {
            "text": "In this review, we concluded that, in the future, the offset should not increase faster than other rates unless two conditions are met."
        },
        {
            "text": "Until these conditions are met, we will not make recommendations that significantly increase the value of the offset as a proportion of the NLW."
        },
        {
            "text": "Our final recommendation is about one group of workers in particular: seafarers. We think seafarers should be exempt from the Accommodation Offset while on board ship. This group is in a unique situation while at sea, of being confined to their work premises which also happen to be their only available accommodation. Secondly, the seafarer’s presence on the vessel is required even while they are asleep – the worker is required to be present in case of an emergency."
        },
        {
            "text": "If you’re interested in looking at our work in greater depth, read Chapter 8 of our 2022 Report. If you would like to provide evidence on the Accommodation Offset to help inform our 2023 recommendations to government, please get in touch at lpc@lowpay.gov.uk."
        }
    ]
}