{
    "url": "https://securityprofession.blog.gov.uk/2023/02/03/world-cancer-day-4-february-nikki-evans-co-chair-of-the-defence-cancer-support-network-shares-her-personal-experience-of-cancer/",
    "title": "World Cancer Day 4 February - Nikki Evans Co-chair of the Defence Cancer Support Network, shares her personal experience of  cancer",
    "authors": [
        "Birju Sonigra",
        "Angela Fisher"
    ],
    "categories": [
        "Government Security",
        "Guest blog",
        "Security and Diversity"
    ],
    "pub_date": "2023-02-03T16:38:30+00:00",
    "content": [
        {
            "heading": 3,
            "text": "How can people offer that support without coming across patronising?"
        },
        {
            "text": "Take the lead from the person who's had the diagnosis or who's family member or friend has had the diagnosis and don’t ask too many intrusive questions. Acknowledge the worry, upset or concern but try not to be patronising and overly positive."
        },
        {
            "text": "Nikki suggests this is a good opening statement.“I know you've had this difficult news. I'd like to support you, so let me know what I can do.”"
        },
        {
            "text": "She also says that working and carrying on being as normal as possible is important. It can provide stability and other things to think about as well as having regular contact with others outside of the medical team."
        },
        {
            "text": "If someone is having a particularly difficult day, try “I’m sorry you’re having a rough day, we’re here with you” rather than – “chin up – you’re doing really well”."
        },
        {
            "heading": 3,
            "text": "Did you get the necessary support in the workplace that you needed after that or did you think they could have been some more done?"
        },
        {
            "text": "When Nikki’s physical treatment stopped, she felt like a train hitting the buffers. That’s when the mental health issues kicked in. People often made assumptions that because active treatment was completed, and she had been declared “No Evidence of Disease” that she was ‘back to normal’. That was hard for Nikki to navigate. “Because once you've had cancer, you're never back to how you were before.”"
        },
        {
            "text": "Nikki was supported by her immediate colleagues but felt that more could be done in terms of navigating policies through and after treatment."
        },
        {
            "text": "She did use the employment assistance program and arranged counselling through that.This is one of the reasons that Nikki and her colleagues set up the Defence Cancer Support Network to help support all those who are affected by cancer: both during and after treatment. There is also a cross government Cancer Support group, easily accessible online. Macmillan is a good one for line managers, because it's got the line manager information. People should also be aware that GP and local primary care services can offer support as well."
        },
        {
            "text": "We’d like to offer our immense thanks to Nikki for sharing her experience, and we hope it has been useful to our readers in looking at how to manage cancer in the workplace."
        }
    ]
}