{
    "url": "https://defradigital.blog.gov.uk/2022/11/14/a-day-in-the-life-of-a-service-designer-in-defra/",
    "title": "A day in the life of a Service Designer in Defra",
    "authors": [
        "Hannah Rutherford-Roke"
    ],
    "categories": [
        "Defra service design",
        "Defra services",
        "User centred design"
    ],
    "pub_date": "2022-11-14T12:30:15+00:00",
    "content": [
        {
            "text": "Interested in joining Defra as s Service Designer? Hannah Rutherford-Roke tells us about her role as a Senior Service Designer and why she chose to work for Defra."
        },
        {
            "heading": 2,
            "text": "Tell us about your role at Defra  "
        },
        {
            "text": "I joined Defra nine months ago as a Senior Service Designer. Since then, I’ve worked on two programmes of work: Extended Producer Responsibility for Packaging and the Plant Health Transformation programme (improving plant health and reducing pests and diseases). Before Defra, I was at the Office for National Statistics (ONS). "
        },
        {
            "heading": 2,
            "text": "What is a service designer? "
        },
        {
            "text": "We design services, ensuring they are inclusive and meet the needs of the people that use and rely on them. For me, understanding service design rests on understanding what a service is. Services allow someone to do something and to reach a goal. When we’re designing services, we’re thinking about all the steps someone must take to do this.  "
        },
        {
            "heading": 2,
            "text": "Why did you choose Defra? "
        },
        {
            "text": "I’ve always tried to work in organisations that contribute to things I really care about. I spent five years at the National Trust early on in my career which really sparked my love for the environment. Defra does so much important environmental work and it’s really motivating to me to be working in that area.  "
        },
        {
            "heading": 2,
            "text": "What are you working on now? "
        },
        {
            "text": "Right now, I’m working on the Plant Health Transformation programme.  We’re doing a lot of high-level research and mapping to understand scope and user and business needs. It’s a super interesting project focused on protecting Great Britain from the threat of plant-based pests, pathogens and disease.  "
        },
        {
            "heading": 2,
            "text": "What does a typical day look like for you? "
        },
        {
            "text": "I’m a big morning person so I get up at 6am, feed my cat and head to the gym or out for a run. "
        },
        {
            "text": "Most days, I start work at 8am. I love how flexible Defra is with working patterns. I’m much more productive in the mornings and I love this time before morning stand ups to get my head down and get some work done. I meet my project team every day at 9am for our daily stand up, seeing how everyone is and how we’re progressing with our work. We’re in the ‘exploration’ phase of setting up a programme so we’re learning about new things all the time – there’s a lot to share and do! "
        },
        {
            "text": "The days vary a lot but typically I’ll be involved in some design or research in the mornings. I’m currently working with the user researcher and business analyst on my team to shape how we understand the world of the plant health inspector – this is important research for our programme. "
        },
        {
            "text": "It’s 12:30pm and lunch time! I usually go for a walk around the park and listen to a podcast. "
        },
        {
            "text": "After lunch I catch up on emails, Teams, and Slack. Then it’s on with the afternoon. I spend some time on professional development. I’m working with a great group of designers to understand how we can design services in a more environmentally friendly way, so I’ll probably be doing a bit of work on that in the afternoon. "
        },
        {
            "text": "I’m a bit more introverted towards the end of the day so I’ll often do some solo work and plan the next day. Service designers are often working across a lot of different activities within a delivery team, collaborating with others, facilitating workshops or doing solo design work so it helps me to use this time to plan. "
        },
        {
            "heading": 2,
            "text": "What’s your favourite thing about being a service designer? "
        },
        {
            "text": "I love designing such a diverse array of services. Over my time in the Civil Service, across ONS and Defra, I’ve learnt so much about niche areas that I knew so little about. I’ve developed so much insight into everything from how waste is recycled to how statistical data processing contributes to our understanding of inflation.  "
        },
        {
            "heading": 2,
            "text": "What kind of people do you work with regularly? "
        },
        {
            "text": "As a service designer, I work with a huge array of people. I work very closely with a digital delivery team, usually made up of the various design, architecture, and delivery disciplines such as solutions architects, interaction designers and delivery managers. We also work closely with policy and operations teams and users to design and develop services in the best way possible.  "
        },
        {
            "heading": 2,
            "text": "Why did you choose service design? "
        },
        {
            "text": "Choosing service design was a very fortuitous accident! I had been working in experience design at the National Trust and was really enjoying thinking about complex, holistic problems. I came across service design while researching how to tackle a problem the organisation was facing and just fell in love with the process and value, I could see in it. I pursued a job at ONS after this. I was lucky to be offered some amazing opportunities for training and learning and some great projects to try out my skills. "
        },
        {
            "heading": 2,
            "text": "What would you say to someone who is thinking of applying for a Service Designer role?"
        },
        {
            "text": "Service design is still a fairly new discipline.  It is a great role working within a multidisciplinary team, solving complex problems.  Be prepared to be patient. It’s important to help project teams understand your role and the value it brings; it’s really rewarding when this message gets through.  "
        },
        {
            "heading": 2,
            "text": "Look out for Service Designer roles "
        }
    ]
}