{
    "url": "https://grantscommunity.blog.gov.uk/2022/11/14/an-update-to-find-a-grant-apply-for-a-grant/",
    "title": "An update to Find a Grant - Apply for a Grant!",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Accessibility",
        "Civil Service",
        "Digital transformation",
        "Government Communications Service",
        "Government Grants Management Function",
        "Grants Applicant Programme",
        "New Release"
    ],
    "pub_date": "2022-11-14T14:40:07+00:00",
    "content": [
        {
            "text": "As we near the final stage of the pilot, this is a brilliant time to update you on how far we’ve come and unveil the latest, exciting development to Find a Grant- you can now use the streamlined grant application process (Apply for a Grant) to apply for a limited number of grants on the service!"
        },
        {
            "text": "Seven months ago, Find a Grant was released onto GOV.UK and over 38,000 people have used the site since."
        },
        {
            "text": "It’s working!"
        },
        {
            "text": "Your support has attested to the pilot’s principle. So many of you have shown an interest, used the site and given us invaluable feedback. The Apply for a Grant stage to Find a Grant should take this even further by improving your experience applying for government grants."
        },
        {
            "text": "I’ve written before, since the start of the pilot, I have been astounded by the immediate support the Government Grant Community has offered. I continue to be heartened by this and grateful for their involvement, helping us co-create a platform that makes finding, and now applying, for grants simpler, faster and fairer for everyone. "
        },
        {
            "text": "Apply for a Grant"
        },
        {
            "text": "Excitingly, the long anticipated development, Apply for a Grant, is here! "
        },
        {
            "text": "What does this mean for you? Well, although you won’t see too many differences to Find a Grant, you should find a button on the right hand side of the homepage to login to Apply for a Grant, (under the ‘Manage notifications’ button). Additionally, you can access the application tier to the programme through a select few compatible grants on the service. "
        },
        {
            "text": "You may have seen, or even used, this stage of the Find a Grant service before as the DCMS 'Product Testing of Enterprise Connected Devices' grant, which ran last month, was the first grant to use the application service. Following the success of this grant, we now currently have 4 grants live on Find a Grant that are applied for using the system. Take a look and try it out, if the grants meet your needs and you’re eligible to apply!"
        },
        {
            "text": "The grants that can currently be applied for directly on Find a Grant, through this new application system, include: "
        },
        {
            "text": "And, keep an eye out to see if anymore grants will become applicable directly on the service, soon! "
        },
        {
            "text": "Although the new application process is only available on a small number of grants on the site, the remaining grants on Find a Grant can still be applied for; the service will continue to direct applicants to the grant administrators’ existing application portal. "
        },
        {
            "text": "Sign me up!"
        },
        {
            "text": "If you are applying for a grant through the new application service, you will have to register for the service or have the option to sign in. Following your registration, you will be able to create a profile that you can edit and update, where you can view your applications and make new ones! "
        },
        {
            "text": "Once you have a profile, you can then make your application on the streamlined application service.The application itself should be more manageable and easier to navigate. "
        },
        {
            "text": "As this service will be double-ended, with applicants using it to apply and grant administrators using the system to create the application for people to fill out, the concept aims to save resources across the board. "
        },
        {
            "text": "This meets the ambitions of the Government Grants Management Function (GGMF), to ensure that every pound makes a difference to the economy and the communities we serve, through modernising and revolutionising grant making. "
        },
        {
            "text": "Please continue to use Find a Grant and try out the Apply for a Grant stage of the service, where available."
        },
        {
            "text": "My final comments"
        },
        {
            "text": "Launching this application process to the pilot Find a Grant service is a significant achievement and I want to thank you all for your support. "
        },
        {
            "text": "We are constantly looking to refine the services and we have another 3 months left in the pilot to do so. Are you excited? And, importantly, are you with me?!"
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Applicant Programme"
        }
    ]
}