{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/11/14/defra-programme-manager-grade-6-2/",
    "title": "DEFRA: Programme Manager- Grade 6",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-11-14T11:57:37+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Do you have the leadership, technical skills & experience to be at the centre of shaping and delivering a World Class Construction Programme? Can you be instrumental in growing the right culture where H&S is at the heart of how we think and act, where we work collaboratively to do the right thing?"
        },
        {
            "text": "The Science Capability in Animal Health Programme has recently secured significant funding, which will be instrumental in transforming our science campus in Weybridge. Once completed this will be one of only a handful of facilities with this science capability in the World."
        },
        {
            "text": "We are looking for an experienced construction project delivery professional to be part of our fast-growing Capital Programme leadership team in either of the following areas:"
        },
        {
            "text": "1) Programme Managers - Capital Delivery - you will lead a team developing the strategy, solutions and subsequent delivery of a sub programme of capital projects to ensure each is successfully delivered on budget and on time."
        },
        {
            "text": "2)  Programme Managers - Technical Assurance - we are looking for the following expertise to lead a number of workstreams across the whole capital programme, project controls, assurance, information management and BIM, procurement and supplier management, risk management and innovation."
        },
        {
            "text": "Whilst we are currently advertising one post, we are hoping to develop a strong reserve list for future opportunities."
        },
        {
            "text": "For more information including a full job description and how to apply, please click here"
        },
        {
            "text": "Apply before 11:55 pm on Tuesday 6th December 2022"
        }
    ]
}