{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/11/14/government-office-for-technology-transfer-gott-senior-policy-advisor-grade-7/",
    "title": "Government Office for Technology Transfer (GOTT): Senior Policy Advisor- Grade 7",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-11-14T11:24:04+00:00",
    "content": [
        {
            "text": "Are you interested in a stretching and fast-faced policy role, helping to deliver on the government's priority to become a science superpower? If so, this opportunity could be perfect for you!"
        },
        {
            "text": "The UK’s public sector is a thriving source of innovation, and BEIS has recently established a new unit – the Government Office for Tech Transfer (GOTT) – which will support the development and exploitation of public sector knowledge assets (KAs)."
        },
        {
            "text": "KAs are non-physical assets such as R&D outputs from innovation, skills, know-how, and data. These are key elements of a comprehensive 2021 report (“Getting Smarter: a strategy for knowledge and innovation assets in the public sector”) and are also part of a major HMG priority: to support productivity and bring UK inventions into the economy."
        },
        {
            "text": "GOTT is a directorate within BEIS, based in the Science, Innovation and Growth group and led by our CEO, Alison Campbell. It is an innovative, fun, and inclusive team which values diversity, and it comprises colleagues from BEIS, HM Treasury, and secondees from BEIS partner organisations."
        },
        {
            "text": "GOTT has been set up to deliver a step change in the management of KAs by providing specialist support to central government departments and their arm’s length bodies. Current stakeholder guidance on managing and exploiting KAs is summarised in the Rose Book, which the team published in late 2021 and is available on GOV.UK"
        },
        {
            "text": "We are recruiting a Grade 7 Senior Policy Advisor GOTT, to lead our incentives and policy workstream. The team’s remit is to develop policy that incentivises public sector bodies to engage with the Knowledge Assets agenda and to remove barriers to the successful exploitation of KAs, as well as linking GOTT to broader Government agenda on innovation."
        },
        {
            "heading": 3,
            "text": "Person specification"
        }
    ]
}