{
    "url": "https://educationhub.blog.gov.uk/2022/11/how-we-are-helping-more-students-benefit-from-foreign-language-lessons/",
    "title": "How we are helping more students benefit from foreign language lessons",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Languages"
    ],
    "pub_date": "2022-11-14T16:02:47+00:00",
    "content": [
        {
            "text": "Modern foreign languages like French, German and Spanish are really useful to know – not just for visiting counties that speak those languages, but employers increasingly see language skills as highly desirable."
        },
        {
            "text": "That’s why we are investing £14.9 million over the next three years to improve the teaching of languages and promoting the benefits of studying a language."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "Why is learning languages at school so important? "
        },
        {
            "text": "Languages are a key part of a broad and balanced curriculum and evidence suggests learning a language has strong economic benefits, including improving international trade."
        },
        {
            "text": "The British Council also identified that Spanish, Mandarin, French, Arabic, and German are the top five priority languages to improve the UK’s skills, security and influence in the world."
        },
        {
            "heading": 3,
            "text": "How are you making learning languages more accessible? "
        },
        {
            "text": "Thousands more students will benefit from high quality language teaching as part of a programme to boost the number of pupils taking languages like French, German and Spanish at GCSE and A level."
        },
        {
            "text": "Leading schools in language teaching will form a new Centre of Excellence, comprised of up to 25 schools, which will work with other schools to improve standards of language teaching across the country."
        },
        {
            "text": "This initiative will support our ambition that 90 per cent of year 10 pupils in state-funded schools study a combination of the core academic subjects as part of the EBacc by 2025, which includes a language."
        },
        {
            "heading": 3,
            "text": "Why have you done this now? "
        },
        {
            "text": "The programme will create a network of language hubs and build significantly on the previous Modern Foreign Languages Hubs programme."
        },
        {
            "heading": 3,
            "text": "How will this programme work?"
        },
        {
            "text": "The Centre will be overseen by a centre of language teaching expertise – which could be a range of institutions including a trust, university, or business."
        },
        {
            "text": "The scheme will also raise the profile of learning German in schools including increasing awareness of the benefits of studying it, by setting up a German Promotion Project."
        },
        {
            "text": "Included within the investment, this project worth £400,000, will involve increasing the number of German teachers in schools and will champion German as a subject."
        },
        {
            "heading": 3,
            "text": "Are you doing similar things for other subjects on the curriculum too?"
        },
        {
            "text": "Yes. We have already successfully launched Hubs Programmes for other subjects in the curriculum including English and mathematics, linking schools across the country to subject specialist schools – also known as Lead Hubs – which can support in increasing the quality of teaching."
        },
        {
            "text": "The Lead Hubs will engage with schools to improve the languages offer and ensure more effective transition from Key Stage 2 to Key Stage 3, as well as ensuring pupils aged 14-18 from all backgrounds have the opportunity to study languages through to Key Stage 5."
        }
    ]
}