{
    "url": "https://buyingforschools.blog.gov.uk/2022/11/14/keeping-everyone-safe-and-secure-in-school/",
    "title": "Keeping everyone safe and secure in school",
    "authors": [
        "Russ Bland, Head of crime, fire and health and safety resilience for the Risk Protection Arrangement (RPA)"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-11-14T12:21:23+00:00",
    "content": [
        {
            "text": "In this blog post, Russ Bland, Head of crime, fire and health and safety resilience for the Risk Protection Arrangement (RPA), tells us about the targeted work that his team are doing to keep schools with particular risks as safe and secure as possible."
        },
        {
            "text": "I started this role in 2018, but I have been in the Civil Service for over 34 years, the last 2 decades or so working in health & safety, emergency management and physical security, including for the MoD and the College of Policing."
        },
        {
            "text": "In a nutshell, RPA Crime, Fire and Health and Safety Resilience is an ‘invest to save’ programme. We identify where investments in mitigation measures could be made to reduce the potential impact of losses where the highest risks exist. Over time, investing in resilience will effectively reduce the risk profile of the RPA and therefore losses to schools who are members."
        },
        {
            "text": "My job is to help RPA member schools be as safe and secure as they can be, and if the worst happens, ensure we reduce the number of school days disrupted. I want to reduce claims and improve safety and security where it is most needed."
        },
        {
            "text": "RPA, the DfE’s alternative to commercial insurance for schools, has been around since 2014. Over time colleagues managing the service noticed particular trends in the claims being made and identified that RPA could do something proactive to help some schools mitigate particular risks."
        },
        {
            "text": "My small team came into being in 2019. Between us we have a wealth of experience managing risk in relation to security, fire safety and health and safety."
        },
        {
            "text": "We work with schools, trusts, local authorities, fire and rescue and the police, to ensure the measures we propose are what is most effective for that school. No two schools are the same. Their age, size, location and type all having a bearing on their risk profile."
        },
        {
            "text": "Many of the on-site assessments the team have conducted have resulted in RPA resilience funding being secured for risk reduction measures. Typical investments have included perimeter fencing, CCTV, intruder detection systems, upgraded window/door sets, fire detection equipment, fire doors, emergency lighting and resurfacing of walkways."
        },
        {
            "text": "We have two approaches to identifying RPA member schools who could benefit from some additional support to reduce their risk profile."
        },
        {
            "text": "The first involves reviewing previous claims histories to identify where a practical intervention will reduce the risk of a school facing further disruption and needing to make a future claim. That could be something as simple as some repairs to a playground to fitting security windows or new fire doors."
        },
        {
            "text": "The second approach involves looking at RPA member schools across England with a particularly high-risk profile, be that based of their geographical location or type of school. For example, schools that are in areas where crime rates are high or schools which offer residential accommodation, which have a different risk profile to non-residential schools as they have people on the premises 24/7."
        },
        {
            "text": "We undertake site visits to all the schools we work with, to ensure we have a thorough, first hand understanding of the challenges that they face. We will then make recommendations and aim to secure funding for that school from the RPA. Each case is judged on its merits, including the overall benefit to the school and the long-term return on investment."
        },
        {
            "text": "We select which RPA member schools to work with based on those at the highest risk and where an intervention can have the greatest impact to ensure we are getting value for money for RPA members."
        },
        {
            "text": "Schools tells us, that it is a fresh pair of eyes, our practical and inclusive approach, involving all relevant parties, as well as our professional resilience expertise that really makes the difference."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Come along and meet the Schools Commercial Team "
        },
        {
            "text": "My colleagues will be at the Schools and Academies Show (SAAS) in Birmingham on 17 November 2022. Registration is free and will give you access to the SAAS Extra virtual day on 22 November 2022, where I will be presenting a session all about crime, fire and H&S resilience for SAAS Extra."
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "heading": 2,
            "text": "Join the Risk Protection Arrangement (RPA)"
        },
        {
            "text": "Public sector schools can join the risk protection arrangement (RPA), an alternative to commercial insurance. If you would like to know more or have any questions, you can contact the DfE’s Schools Commercial Team."
        },
        {
            "text": "The team also run regular webinars providing additional information about the RPA, the benefits of being a member and real-life cases studies where membership has saved schools time and money and most importantly reduced the risk of lost school days. If you follow the Buying for schools LinkedIn page, it contains details of all these webinars and much more."
        },
        {
            "text": " "
        }
    ]
}