{
    "url": "https://cspl.blog.gov.uk/2022/11/14/leading-in-practice-our-next-report/",
    "title": "Leading in Practice - our next report",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Leadership",
        "Leading in Practice"
    ],
    "pub_date": "2022-11-14T07:59:23+00:00",
    "content": [
        {
            "text": "The political leadership of the UK has consumed the news agenda recently. The turbulence of the past few years - EU Exit, the pandemic and the economic consequences of the war in Ukraine and the changes of Prime Minister - will undoubtedly be seen as a remarkable period in the leadership and history of the country."
        },
        {
            "text": "But what about the day-to-day leadership required to sustain high ethical standards across the public sector, within the range of organisations and departments delivering public services in the UK?"
        },
        {
            "text": "The Nolan principles remain a lodestar for all those in public life - honesty, integrity, selflessness, leadership, integrity, openness, and accountability; they exist to guide the conduct of all public office holders when taking decisions on the public’s behalf."
        },
        {
            "text": "Over time, this Committee has looked at how to promote these principles on a range of issues from MPs’ expenses, local government standards, contracting government services and artificial intelligence. For our current review we wanted to look at how the Principles might become more deeply woven into all aspects of how organisations operate; it is obvious that rules, ethics structures and regulatory bodies only go so far."
        },
        {
            "text": "Recent problems in a range of public sector organisations from the Metropolitan Police to maternity services in NHS Trusts have highlighted issues of leadership. Mistakes need to be learned from, but they could also be prevented with proactive attention to ethical issues and a healthy ethical culture within organisations, allowing staff to confidently raise issues and concerns."
        },
        {
            "text": "‘Leading in Practice’ will share practical examples of how a range of organisations have tried to embed ethical values in their policies and practices, sometimes after a period of turmoil or scandal. We are not looking at political leadership specifically in this report - although we acknowledge the need for political and organisational leadership to work together for government to produce properly tested and robust policies and decisions."
        },
        {
            "text": "There can be no ‘one size fits all’; each organisation will need to find what works best for them.  In this report, we will identify a number of questions to help leaders to think about what more they can do to ensure that the Nolan Principles translate into the decisions and behaviours exhibited in their organisations.  No committee such as ours will have all the answers; our ambition is to stimulate discussion and challenge public sector leaders to rise to the challenge."
        },
        {
            "text": "Our report will be published in January."
        },
        {
            "text": "Please email public@public-standards.gov.uk if you would like to be added to our mailing list for this report."
        }
    ]
}