{
    "url": "https://environmentagency.blog.gov.uk/2022/11/14/no-excuse-for-illegally-burning-waste/",
    "title": "No excuse for illegally burning waste",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2022-11-14T16:20:22+00:00",
    "content": [
        {
            "text": "By Isabella Burke, Environment Officer, Environment Management Devon & Cornwall"
        },
        {
            "text": "Now more than ever before, how we treat our environment is incredibly important for our future. With a changing and warming climate, how we use the planets natural resources and how we dispose of our waste are of paramount importance to our lives and those of future generations."
        },
        {
            "text": "Today, most of the waste we produce, if it is well segregated at source, can be recycled, or re-used, but despite this, we are still responding to many reports about the burning of waste every year. Many of these fires are reported to us by the Fire Service following their attendance to the fire site. This takes up the valuable time of our Environment Officers, who could be attending to other regulatory duties, instead of responding to unnecessary, environmentally destructive, and dangerous burning incidents that are completely avoidable."
        },
        {
            "text": "People burn waste to avoid the charges for taking wastes to permitted waste sites for recovery or where this is not possible, disposal. This is waste crime."
        },
        {
            "text": "Burning waste releases harmful gases. Hazardous smoke is produced when plastics (including those originating from mixed material packaging), damp proofing, paints, rubbers, sealants, oils, vehicles and tyres are burned."
        },
        {
            "text": "In addition to this, the residues from burnt waste, the ash and waste which is left behind can pollute surface and groundwater and result in long-term land contamination which can be expensive and difficult to remediate."
        },
        {
            "text": "These harmful incidents occur when inappropriate wastes are burned in the open air. This should never happen and people doing so can face unlimited fines from us."
        },
        {
            "text": "Some waste is burned in a controlled way, through incineration at permitted energy from waste facilities. These sites use closed systems designed to minimize atmospheric impacts and produce energy at the same time. They are closely regulated by the Environment Agency."
        },
        {
            "text": "These are common examples of illegal waste fires and guidance on what you should be doing with the waste:"
        },
        {
            "text": "There really is no need to burn any waste. Not burning waste is better for the environment and safer for people. It is less costly to the public purse too, when less of our time and resources and that of the Fire Service is spent bringing illegal waste fires under control."
        },
        {
            "text": "If you see any illegal waste fires, report them to the Environment Agency on 0800 80 70 60, or anonymously to our partner, Crimestoppers: Independent UK charity taking crime information anonymously | Crimestoppers (crimestoppers-uk.org) 0800 555 111."
        }
    ]
}