{
    "url": "https://ofsi.blog.gov.uk/2022/11/14/oil-price-cap-update/",
    "title": "Oil Price Cap Update",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-11-14T17:01:20+00:00",
    "content": [
        {
            "text": "The UK and Price Cap Coalition (G7 + Australia) partners have agreed tough and comprehensive sanctions on Russia’s most lucrative export: crude oil and refined oil products. We are collectively banning the import of Russian oil and oil products into our markets, and we are further banning UK services including finance, insurance, and shipping from enabling the seaborne transport of Russian oil and oil products globally. "
        },
        {
            "text": "To enable oil to continue to flow in a tight market, we are creating a price cap exception to the services ban. This will permit UK and coalition partners’ services to continue facilitating the transport of Russian oil and product by sea to and between third countries, if sold at or under an agreed price (“the price cap”). "
        },
        {
            "text": "The aim of introducing a price cap, the level of which will be determined by coalition countries, is to reduce Russian oil revenues and Russia´s ability to fund its illegal war in Ukraine through inflated global oil prices, whilst enabling oil to continue to flow to the third countries that need it. "
        },
        {
            "text": "When is the OPC coming into force? "
        },
        {
            "text": "The maritime services ban and its price cap exception for crude oil will come into effect from 5 December 2022, with the equivalent restrictions and exception for refined oil products coming into force from 5 February 2023. Legislation for the maritime services ban was laid on 3 November 2022 and this was followed by comprehensive guidance for industry on 14 November. A General Licence, which will create the price cap, will be published before 5 December 2022. Additional general licences to ensure international alignment and the smooth operation of the Price Cap will also be published before 5 December 2022. "
        },
        {
            "text": " "
        },
        {
            "text": "Who in government leads on the implementation of the Oil Price Cap?  "
        },
        {
            "text": "HM Treasury have set up a new Unit to help prepare for the UK’s restriction on the provision of services associated with the maritime transport of Russian oil and oil products, and the shipments themselves. "
        },
        {
            "text": "The Unit, situated within HM Treasury’s Office of Financial Sanctions Implementation (OFSI), will: set up the licensing and enforcement system for the Oil Price Cap; engage with industry to ensure readiness for the cap; and monitor the level and impact of the cap on an ongoing basis.  "
        },
        {
            "text": "OFSI will use its existing powers and arrangements to enforce the Oil Price Cap. "
        },
        {
            "text": "The new Unit will work across government and internationally to ensure the successful implementation and effective tracking of the Oil Price Cap. \n "
        },
        {
            "text": "How do I find out more? "
        },
        {
            "text": "For enquiries on the Oil Price Cap, please email oilpricecap.ofsi@hmtreasury.gov.uk.   "
        }
    ]
}