{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/11/14/opss-senior-engineer-seo/",
    "title": "OPSS: Senior Engineer- SEO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-11-14T11:11:45+00:00",
    "content": [
        {
            "text": "Our Team:"
        },
        {
            "text": "We are a multidisciplinary team of scientists and engineers delivering testing capability across the broad portfolio of Office for Product Safety & Standards (OPSS) regulatory requirements. The team works across our new laboratories at the Centre of Product Testing and Research which include metrology, mechanical, electrical, chemical and flammability facilities. We seek to implement fit for purpose practices and procedures to deliver robust, scientific outputs. In collaboration with other internal evidence teams including those in science, engineering, research and analysis, our outputs inform policy development, incident investigation and the delivery and enforcement of product regulations."
        },
        {
            "text": " "
        },
        {
            "text": "The Role:"
        },
        {
            "text": "We require a Senior Engineer to oversee the day-to-day operations of our laboratories, collaborating with a team of specialists and ensuring OPSS continues to deliver high-quality technical services. This is a practical role, where you will apply your technical expertise to undertake and supervise the delivery of relevant work programmes, test a variety of products to ensure they conform to bespoke requirements / required safety and quality standards, operate the equipment, record detailed testing results, and advise the outcome of the product testing. This is a key post at our Teddington site, requiring close collaboration with technology, science, and engineering teams to ensure the effective, efficient, and safe operation of our laboratories."
        },
        {
            "text": " For more information including job description and how to apply, please click here"
        },
        {
            "text": "Vacancy reference: 244547, Location: Teddington; "
        },
        {
            "text": "Flexible working, Full-time, Job share, Part-time, "
        },
        {
            "text": "Closing date: 11:55 pm on Sunday 20th November 2022"
        }
    ]
}