{
    "url": "https://insideDIO.blog.gov.uk/2022/11/14/refurbishing-a-historic-london-barracks/",
    "title": "Refurbishing a historic London barracks",
    "authors": [
        "James Redmond",
        "Del Thomas"
    ],
    "categories": [
        "Armed Forces",
        "Defence Estate",
        "London District"
    ],
    "pub_date": "2022-11-14T15:58:54+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The refurbished Wellington Barracks [Copyright Amey 2022]Our DIO teams in the South East oversee a rich and diverse historic estate. We're responsible for the maintenance of some iconic sites including Horse Guards Parade, MOD Main Building in Whitehall, and Wellington Barracks, which is only a short distance from Buckingham Palace in Central London."
        },
        {
            "text": "Originally designed in the 1830s, the barracks today serves as the headquarters of the five Foot Guards regiments: The Coldstream, Grenadier, Irish, Scots, and Welsh Guards. These prestigious British Army  regiments have had the duty of protecting the Sovereign and the Royal Palaces from 1660 to the present day."
        },
        {
            "text": "A great deal of collaborative effort is required to properly maintain a site of such historical significance as well as functional importance. Over the last year and a half, we’ve worked with industry partners and our military counterparts in the British Army to complete around £8.7m worth of refurbishment works which have helped to revitalise Wellington Barracks and the facilities within it."
        },
        {
            "heading": 2,
            "text": "Restoring the external façade"
        },
        {
            "text": "The external façade of Wellington Barracks is the building’s most recognisable feature, and we had the challenge of carrying out essential repairs to the existing, Grade II listed façade across several blocks of the barracks."
        },
        {
            "text": "Although it had seen some repair work in the 1980s, these had started to fail, with parts of the render falling from the façade and posing a health and safety risk to personnel. Our task involved a full replacement of the sections of the external render, removal of paint used in the 1980s which no longer met current standards, and repainting in accordance with the requirements of the local council heritage team."
        },
        {
            "text": "Work underway at the barracks [Copyright Amey 2022]The parade square was in constant use during the project, and access to it was required throughout the works to enable personnel to rehearse for key events such as the Queen’s Platinum Jubilee celebrations in June. To ensure minimum disruption, we used scaffolding which was designed to take up as minimum amount of space on the parade squares as practically feasible. In addition, ahead of the Platinum Jubilee celebrations, priority was given to the parade-facing section of façade, allowing it to be fully completed and on full show for the celebrations."
        },
        {
            "heading": 2,
            "text": "Improving accommodation for personnel"
        },
        {
            "text": "One of our key taskings was to modernise the Single Living Accommodation (SLA) at Wellington Barracks. This required an overhaul of the SLA on floors four to seven of the building, as well as minor refurbishment to the second and third floors. This work was vital to bring the accommodation, which dates back almost forty years, up to date, as well as ensuring that the facilities meet current health and safety standards, particularly with regards to fire safety."
        },
        {
            "text": "Working collaboratively with our military customers, the project was split into two phases. The first saw one wing of the building emptied to allow work to be carried out, followed by a transition of personnel into the newly refurbished wing before works were then completed on the remaining wing."
        },
        {
            "heading": 2,
            "text": "Ensuring modern safety standards"
        },
        {
            "text": "The Guards’ Chapel within Wellington Barracks is the religious home of the Household Division and a building steeped in history, with its origins going all the way back to the construction of the barracks in 1834. It’s a Grade II listed building which sees regular use by both military personnel and members of the public, so careful maintenance is essential. As part of our refurbishment works, and following the recommendations of a Fire Risk Assessment, we replaced the chapel’s emergency lighting. The work has ensured that the lighting complies with current regulations, and that there’s sufficient lighting in place should an emergency occur."
        },
        {
            "heading": 2,
            "text": "Refurbishing the mezzanine deck"
        },
        {
            "text": "The fourth and final key aspect of our work to revitalise Wellington Barracks involved a refurbishment of the building’s mezzanine deck. We were tasked with replacing the existing mezzanine deck tiles as well as the deck’s waterproofing, which unfortunately had begun to fail, causing a number of leaks into to the band practice rooms underneath."
        },
        {
            "text": "A section of roofing receiving refurbishment [Copyright Amey 2022]As well as the need for a rapid solution to enable military bands to resume their normal practice, consideration of the building’s constant use by military personnel was again key while carrying out this work. Walkways were carefully put in place while the work was being carried out, to ensure continued access to the junior ranks’ bar and other parts of the barracks."
        },
        {
            "heading": 2,
            "text": "Behind-the-scenes support to the HM Queen’s Funeral"
        },
        {
            "text": "After the sad news of the death of HM The Queen in September, the eyes of the nation and the world turned to ‘Operation London Bridge’, the meticulously planned operation for the ceremonial events leading to, and including, the Queen’s funeral."
        },
        {
            "text": "Wellington Barracks was central to the behind-the-scenes efforts to support the thousands of Armed Forces personnel involved. Working with our industry partners and Service Catering Personnel, our teams helped to provide catering services for over 10,000 military personnel travelling to and from Wellington Barracks for ceremony rehearsals. Accommodation at the barracks was quickly made available for the influx of personnel, with 24/7 cleaning to support rehearsals taking place in the early hours of the morning, in addition to the provision of portable shower and ablution facilities."
        },
        {
            "text": "DIO also helped to provide tailoring support at a number of military sites over the course of Operation London Bridge, including at Wellington Barracks, where Foot Guard centralised tailors worked around the clock to ensure military personnel looked perfect for the Queen's funeral."
        },
        {
            "text": "A short distance from Buckingham Palace, Wellington Barracks is used by the five regiments of the Foot Guards, who have the duty of protecting the Royal Palaces [Copyright Amey 2022]I’m proud to have been involved in what has been a really significant programme of works at Wellington Barracks over the last year and a half. It’s been greatly rewarding to see the barracks not only restored, but modernised to benefit both military users and the British public for decades to come."
        }
    ]
}