{
    "url": "https://dwpdigital.blog.gov.uk/2022/11/14/shaping-my-business-analyst-career-through-learning-and-development/",
    "title": "Shaping my business analyst career through learning and development",
    "authors": [
        "Kelly Richards, Business Analyst, DWP Digital"
    ],
    "categories": [
        "Business Analyst",
        "DWP Digital",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2022-11-14T13:44:20+00:00",
    "content": [
        {
            "text": "Kelly is a business analyst working in citizen information. She’s worked in DWP Digital since 2017, having previously worked in DWP operations for 16 years."
        },
        {
            "heading": 2,
            "text": "The power of curiosity and continuous learning "
        },
        {
            "text": "Kelly has a passion for learning and development and has actively engaged with training opportunities during her time with DWP Digital. After coming to the end of an internal senior development programme, Kelly was looking for her next challenge. One of her most recent development opportunities came in the form of a business analyst conference. "
        },
        {
            "heading": 2,
            "text": "IRM Business Analyst conference"
        },
        {
            "text": "When I learned the practice team had secured some 2-day tickets for the Institute of Risk Management’s (IRM) Business Analyst Conference in London and were inviting applications for attendance, I thought why not? I’m a business analyst. I work on an award-winning project. I can represent my employers and showcase what great business analysts the department has… can’t I?  With gusto, I submitted my application, detailing how I would bring the learning I’d gained from the conference to my peers. Imagine my surprise when I was selected to go!"
        },
        {
            "text": "So having talked the talk, now I need to walk the walk. What surprised me the most, was not necessarily that I was selected to go, but the change in my mindset. I quashed those feelings of imposter syndrome and thought “bring it on! I’ve got this”."
        },
        {
            "heading": 2,
            "text": "Lessons from the conference"
        },
        {
            "text": "I attended with three other business analysts from DWP Digital. Prior to the conference, we all met with each other to look at the agenda and decide what sessions we’d like to attend. There was so much on offer and the agenda was jam-packed. The morning of the conference I had a few nerves: would I know what everyone was talking about? Could I hold my own in a business-related conversation?"
        },
        {
            "text": "The facilities and the setting immediately put me at ease. Before I knew it, we were two sessions in, and I was in the thick of a conversation about hybrid working. As the day progressed, I began to realise a few things: I was actually enjoying myself! I had valid contributions to make. DWP Digital is a great place to work."
        },
        {
            "text": "I knew this already of course, but meeting people from other organisations really helps you shine a light on your own workplace. We work with multi-disciplinary teams, who value the work of business analysts and we advocate user centred design. We have a strong community of practice who strive for excellence within the organisation."
        },
        {
            "text": "I felt inspired by all the amazing analysts out there who are committed to their professions."
        },
        {
            "heading": 2,
            "text": "Putting my learning into practice"
        },
        {
            "text": "Reflecting back on what I’d learned, my favourite session was on the Art of Storytelling. I’m a big advocate of bringing people on a journey with me when I’m trying to influence, and the session gave some excellent, practical tips on how to do that. I even went on to watch some TED talks on the subject."
        },
        {
            "text": "I can’t wait to put some of this into practice in the workplace. The conference didn’t just impart knowledge to me, and it didn’t just help me make connections. It helped me realise that I love being a business analyst and I value the work that I do in helping our most vulnerable citizens, and I value the organisation I work in. DWP Digital has invested in me, and it has helped me to invest in me - and I’m proud of that."
        }
    ]
}