{
    "url": "https://teaching.blog.gov.uk/2022/11/14/taking-a-proactive-approach-to-preventing-and-responding-to-bullying/",
    "title": "Taking a proactive approach to preventing and responding to bullying",
    "authors": [
        "Stephanie Bendall"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2022-11-14T09:51:53+00:00",
    "content": [
        {
            "text": "Stephanie Bendall is Deputy Head at Maiden Erlegh School in Berkshire. She talks to us about how the school has reduced bullying, with the help of their students aged 11-18. They have also been recognised as an Anti-Bullying Gold Award winner by the Anti-Bullying Alliance (ABA). "
        },
        {
            "text": "Audit and action planning"
        },
        {
            "text": "Three years ago, we started to use the ‘All Together Programme’ which is now known as the ‘United Against Bullying Programme’ developed for schools by the Anti-Bullying Alliance."
        },
        {
            "text": "Each year since, we have followed the same process:"
        },
        {
            "text": "Based on feedback, this academic year we are going to improve our investigation process, to make it more transparent. This will be communicated via our morning assembly programme to all staff and students."
        },
        {
            "text": "Involving students and parents"
        },
        {
            "text": "We include everyone in the school community and value student voices to shape our approach to anti-bullying. It is important to listen to students’ perceptions, as these are often different to staff. We work closely with our sixth form team and school council to hear their views – we are currently exploring how to implement their latest set of ideas, including anti-bullying mascots, support groups, welfare checks and introductions to our inclusion team for Year 7 students."
        },
        {
            "text": "As well as students, we engage with parents to make sure this work is joined up at home. The headteacher has sought feedback from parents via focus groups and we regularly communicate with them via our newsletter and weekly headteacher presentations. Parents can also contact the dedicated anti-bullying email address to raise any concerns."
        },
        {
            "text": "Our staff receive training each year on different aspects of bullying, such as how to respond to bullying in school. We talk a lot about the use of inclusive language in the classroom and fostering a culture of respect between all members of our school community. We are Team Maiden Erlegh and everyone – parents, teachers and students are part of that!"
        },
        {
            "text": "Anti-Bullying Week"
        },
        {
            "text": "Each year we support Anti-Bullying Week and invite students to nominate others for their kindness. We try and find new things to do each year, including flash mobs in the dining room and organising trips – last year we went to see Wicked the Musical."
        },
        {
            "text": "We have another busy and exciting year ahead to implement our students’ ideas to prevent bullying and are looking forward to seeing the results."
        }
    ]
}