{
    "url": "https://ofqual.blog.gov.uk/2023/04/18/a-day-in-the-life-of-an-exams-officer-is-never-dull-or-boring/",
    "title": "A day in the life of an exams officer is never dull or boring",
    "authors": [
        "Nicki Hlousek"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2023-04-18T12:00:32+01:00",
    "content": [
        {
            "text": "Nicki Hlousek, exams manager at Newcastle College, gives an insight into his role."
        },
        {
            "text": "Those of us involved in exam delivery are often employed in distinct roles with a wide variety of responsibilities. Many work alone as a sole exams officer; others will be members of wider data or student services. All of us, however, share similar pressures and challenges and so one thing is certain; a day in the life of an exams officer is never a dull or boring day."
        },
        {
            "text": "Personally, I work for the UK’s largest group of FE colleges and that offers some unique challenges. On some of the busier days this summer, we will need around 120 staff to cover invigilation alone. There are thousands of Applied General learners enrolled at our largest centre and overseeing all those external assessments is a huge logistical challenge. Our exams office is also responsible for the successful delivery of A level exams to our large sixth form college and that is a mammoth task."
        },
        {
            "text": "Working for a large and complex organisation, however, means I can enjoy some unique benefits too. I am supported by a team of fabulous exams administrators. We have a dedicated and fantastic quality team and my line manager, who leads the wider data services team, has a wealth of knowledge and experience I can fall back on."
        },
        {
            "text": "As I mentioned earlier, it really doesn’t matter what our specific roles are or what type of organisation we are a part of, being involved in exams delivery means we are expected to:"
        },
        {
            "text": "Demanding roles are often the most exciting and rewarding and this can be true for exams officers. While it can often feel like things are not going to plan or our to-do lists are getting out of hand, there are a few things I’ve found we can do to make our lives easier:"
        },
        {
            "text": " Another period of summer exams is just ahead, and I am sure that just like every previous year, we all will be working long days. And just like every previous year, with a huge amount of hard work, maybe some tears and just a tiny bit of luck we’ll get through it. We always do. I have a feeling that it is the overwhelming sense of pride and accomplishment that will make us do it all over again next year."
        }
    ]
}