{
    "url": "https://dwpdigital.blog.gov.uk/2023/04/18/building-the-art-of-the-possible-with-horizon-scanning/",
    "title": "Building the art of the possible with horizon scanning",
    "authors": [
        "Shruti Kohli, data scientist, DWP Digital"
    ],
    "categories": [
        "Digital transformation",
        "Innovation Lab",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2023-04-18T12:19:06+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Using horizon scanning to get future ready "
        },
        {
            "text": "Dr Shruti Kohli is a data scientist and leads DWP Digital’s Innovation Lab. She shares her insights around horizon scanning, and why it’s the crucial first step in getting your products or services future-ready.  "
        },
        {
            "text": "Our Innovation Lab was created as a technology accelerator to tackle complex business problems and explore innovative and emerging ways of working.  It’s given us a framework for rapidly generating ideas and turning them into valuable concepts within the organisation. We achieve that through fast-paced working and collaboration.   "
        },
        {
            "heading": 3,
            "text": "What are the benefits of horizon scanning? "
        },
        {
            "text": "Horizon scanning ensures you look at your entire environment to identify opportunities and other innovations already in your eco-system. For us, this means other Government departments, subject matter experts in the tech industry, academia, and our colleagues in DWP Digital.   "
        },
        {
            "heading": 2,
            "text": "User-first approach "
        },
        {
            "heading": 3,
            "text": "How do you approach horizon scanning?  "
        },
        {
            "text": "Start with a user-centric complex problem and look at how technology can help you solve it. To do this, you need an outside-in approach where the user is at the heart of all new designs.  "
        },
        {
            "text": "From there, you can use design-based thinking – including some disruptive thinking – to explore cross-cutting solutions. For us, this means making it real, very quickly – most prototypes are up and running within just 6 weeks.  "
        },
        {
            "heading": 3,
            "text": "What types of horizon scanning are there?  "
        },
        {
            "text": "You can break scanning into 3 key types: technology innovation, collaborative innovation, and having an innovation lens. This means looking at any emerging technologies that can have the most impact on your innovation.  "
        },
        {
            "text": "Synthetic data, for example, was something I picked up on in a recent Oxford University workshop. We created a synthetic data hackathon with experts in the market, Gartner, and the results were tested by The Alan Turing Institute.  "
        },
        {
            "text": "We learned a lot from this experience, and it is being used in supporting carers in their job. "
        },
        {
            "heading": 2,
            "text": "Collaboration is key "
        },
        {
            "text": "Talks from industry leaders can broaden your mindset and provide a new perspective. Every Wednesday, we have a one-hour tech session from an industry leader or academic on how to tackle problems. A hypothesis can then be built around a theme to explore what outputs are possible. The learnings can then be documented and shared with your colleagues who can learn and apply it to their work.    "
        },
        {
            "text": "In the past year we’ve looked at a range of new technologies to break down barriers and help our vulnerable customers access our online services. We’re developing ways to help understand our customers better. In our latest proof of concept, we explored process mining visualisation and how it can be used to drive data-driven decisions and improve services.  "
        },
        {
            "heading": 2,
            "text": "The lab in action "
        },
        {
            "text": "We recently conducted a digital sustainability proof of concept to investigate how technology can empower your users with the guidance, tools, and granular data they need around cloud emissions. This is in order to make informed decisions as ethical cloud buyers and prepare for future policy changes. "
        },
        {
            "text": "We discovered, through  horizon scanning, that granular carbon emission data was a challenge faced by many governments and vendors, but we were able to develop an open-source framework that customised it for our users' needs. "
        },
        {
            "text": "Ultimately, we want to make it quicker, easier, and less costly for people to get the support they need, when they need it. By using horizon scanning and collaboration, you can keep up with emerging technologies and prepare for the future. "
        }
    ]
}