{
    "url": "https://ofqual.blog.gov.uk/2023/04/18/mobile-phones-in-exams-what-malpractice-stats-show-us/",
    "title": "Mobile phones in exams: what malpractice stats show us",
    "authors": [
        "Hannah Bradley"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams"
    ],
    "pub_date": "2023-04-18T12:00:40+01:00",
    "content": [
        {
            "text": "Bringing a mobile phone, watch or other communication devices into exam halls and assessment venues is classed as malpractice."
        },
        {
            "text": "Ofqual collects malpractice figures from exam boards for GCSE, AS and A level students, and from over 40 awarding organisations offering vocational and technical qualifications that are used for progression to further and higher education."
        },
        {
            "text": "The number of penalties issued to GCSE and A level students for bringing mobile phones, smartwatches and other communication devices into exam halls increased in 2022. There were 1,845 penalties last year, compared with 1,385 in 2019, the last time exams were sat."
        },
        {
            "text": "The number of penalties issued for VTQ students for having a mobile phone or other communication device in an exam also increased in 2022. There were approximately 750 penalties for this in the year 2021 to 22, compared with 300 in 2018 to 2019 the last time VTQ assessments were undertaken in normal circumstances."
        },
        {
            "text": "At Ofqual, we know that Exams Officers in schools and colleges use a range of ways to tell students about this important rule. Students know that breaking it could lose them marks or even disqualify them. So why do they still do it?"
        },
        {
            "heading": 2,
            "text": "Why risk it?"
        },
        {
            "text": "The answer, from research Ofqual commissioned is that students simply don’t wish to be without their mobile phones. They are likely to be the most expensive possession of many students and they are concerned about loss or damage."
        },
        {
            "text": "We have also spoken to many Exams Officers (who are integral to making the exam system run smoothly every year) who say that most students don’t intend to use their phones to cheat. Instead, mobiles have become such a fundamental part of modern life that students do not wish to be without them, even for a few hours."
        },
        {
            "text": "Here are some examples of what Exams Officers have told us: "
        },
        {
            "heading": 2,
            "text": "Still malpractice"
        },
        {
            "text": "A common theme evident in Exams Officers’ views was that students cannot understand how they could be ‘caught’ if they are not actually using their phones."
        },
        {
            "text": "They do not realise that the simple act of having a mobile on them while taking an exam is a breach of the rules and therefore malpractice, which must be reported to the exam board:"
        },
        {
            "text": "Mobile phones are not allowed in exam venues, regardless of how much battery they have left, if they are in aeroplane mode, switched off or otherwise."
        },
        {
            "heading": 2,
            "text": "The consequences of committing malpractice "
        },
        {
            "text": "The consequences for students are clear; this includes losing marks, being disqualified from a paper or disqualified from one qualification or all qualifications."
        },
        {
            "text": "In 2022 more than two-thirds of the penalties that were issued for mobile phones for GCSE and A level students were a loss of marks, and more than 250 students lost an aggregation or certification opportunity."
        },
        {
            "text": "In 2022 approximately three-fifths of all penalties that were issued for mobile phones for students taking higher stakes VTQs were a loss of marks, and fewer than 150 students lost an aggregation or certification opportunity and the same received a warning."
        },
        {
            "text": "There are also consequences for schools and colleges such as special conditions, suspensions, training, written warnings or referral to the Teaching Regulation Agency."
        },
        {
            "heading": 2,
            "text": "What can be done?"
        },
        {
            "text": "Exams Officers in schools and colleges and awarding organisations are working hard to communicate the realities of rule breaches to students and identifying ways of addressing any concerns students might have."
        },
        {
            "text": "We hear that some of the most successful methods for keeping phones away from exams and assessments are often those recognising the value of them, such as bag and ticket systems to keep them safe."
        },
        {
            "text": "Clearly those who are best placed to impact on students’ fortunes in this area are students themselves. So, if you’re taking exams or assessments this year, please don’t be tempted to take your mobile phone, smartwatch or any other into the exam hall or assessment venue. If you have any concerns about your mobile, please talk to your Exams Officer and they will be pleased to help."
        },
        {
            "text": "If you would like to talk to Ofqual about any of the issues raised in this blog, please contact us at public.enquiries@ofqual.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "This is an updated version of a blog post published in 2019."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}