{
    "url": "https://homeofficemedia.blog.gov.uk/2023/04/18/strike-action-to-affect-travellers-and-goods-entering-the-uk-on-28-april-2023/",
    "title": "Strike action to affect travellers and goods entering the UK on 28 April 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-04-18T17:21:11+01:00",
    "content": [
        {
            "text": "The Public and Commercial Service (PCS) union has announced Civil Service industrial action that will impact Border Force operations."
        },
        {
            "text": "Travellers who are planning to enter the UK on 28 April 2023 may face longer wait times at border control."
        },
        {
            "text": "Travellers should check the latest travel advice with operators before travelling."
        },
        {
            "text": "Please be patient and respect officers who are working to keep the UK border safe and secure for all travellers during strike action."
        },
        {
            "text": "We encourage all passengers eligible to use eGates to do so."
        },
        {
            "text": "Dates:"
        },
        {
            "text": "Locations:"
        },
        {
            "text": "Our number one priority is to keep our borders safe and secure, and we will never compromise on this."
        },
        {
            "text": "Military personnel, civil servants and volunteers from across government are being trained to support Border Force at airports and ports across the UK in the event of potential strike action. Border Force are ready to deploy resource to meet critical demand and support the flow of travellers and goods through the border, however those entering the UK should be prepared for potential disruption."
        },
        {
            "text": "Border Force and industry work together very closely at a local and national level to agree plans for pressures while keeping the public safe and ensuring critical goods such as medicines and food can continue to flow across the border."
        },
        {
            "text": "Advice for people entering the UK"
        },
        {
            "text": "Those who are due to travel into the UK during the proposed industrial action should be prepared to face longer wait times at UK border control."
        },
        {
            "text": "All passengers should check the latest advice from their operators before travelling."
        },
        {
            "text": "Please be patient and respect officers who are working to keep our citizens safe and border secure, and supporting travellers during the strike action."
        },
        {
            "text": "We encourage all passengers where available and eligible to use eGates to do so."
        },
        {
            "text": "Please respect staff as we try and get you through the border as quickly and safely as possible. All forms of abuse and any inappropriate behaviour will be reported to the police."
        },
        {
            "text": "Hauliers – impact of strike action"
        },
        {
            "text": "Hauliers who are moving goods during the proposed strike action should be prepared for potential disruption and longer queues at Ports and Inland Border Facilities."
        },
        {
            "text": "Please check with your operator before travelling, be prepared for delays and carefully plan your movements if they coincide with days of strike action."
        },
        {
            "text": "Border wait times"
        },
        {
            "text": "As you’d expect, accurate queue time data can take some time to gather and check, however if you are travelling during the proposed strike dates be prepared for longer wait times."
        },
        {
            "text": "There are multiple factors that might influence wait times including an increase in passenger numbers, flight delays and flight bunching. Weather delays, and other ad hoc incidents, can also impact border control queues."
        },
        {
            "text": "We advise travellers to check with travel agents, tour operators, and airlines/carriers before travelling, to check if the proposed strike action will affect your journey."
        },
        {
            "text": "Passengers can also check airport websites before travelling to stay up to date with the latest information related to travel or possible delays caused by strike action."
        },
        {
            "text": "What we are doing to avoid disruption and queues at the border during the strike action"
        },
        {
            "text": "We continue to work closely with industry to minimise disruption and delays at the border during any industrial action."
        },
        {
            "text": "Border Force and the travel industry work together very closely at a local and national level and have regular meetings to agree plans for pressures while keeping the public safe."
        },
        {
            "text": "Remember:"
        },
        {
            "text": " "
        }
    ]
}