{
    "url": "https://movingon.blog.gov.uk/2023/04/18/the-guide-to-maintaining-roadworthiness-has-been-updated-2/",
    "title": "The Guide to Maintaining Roadworthiness has been updated",
    "authors": [
        "Dayve Walshe"
    ],
    "categories": [
        "Guides and reports",
        "Maintenance workshop"
    ],
    "pub_date": "2023-04-18T12:48:16+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Today, 18 April 2023, we've updated the Guide to Maintaining Roadworthiness."
        },
        {
            "text": "It will still give you advice on different types of inspection, the inspection intervals, data storage, and essential reviews."
        },
        {
            "text": "We have been working with the industry to make changes that will improve guidance for operators and maintenance providers. I wanted to let you know about some of the most important changes we've made."
        },
        {
            "text": "Types of inspections and checks"
        },
        {
            "text": "After listening to you, we learned that some of you were getting confused about what checks to carry out during a first use inspection or how often a driver walkaround check should be done."
        },
        {
            "text": "To help we have now included a definition for each type of inspection and check. We have also added an intermediate safety check for the times you need to check the wear on some components more often than the safety inspections."
        },
        {
            "text": "Light goods vehicles "
        },
        {
            "text": "From 21 May 2022, if you want to use light goods vehicles over 2.5 tonnes and up to 3.5 tonnes for hire or reward into or through the EU, Switzerland, Norway, Iceland or Liechtenstein, you will need a standard international operator’s licence."
        },
        {
            "text": "We have updated the guide to reflect this requirement so that you can prepare if you operate light goods vehicles for business use in the EU."
        },
        {
            "text": "Towing another company’s trailer"
        },
        {
            "text": "If you tow another company’s trailer additional advice has been added to help you."
        },
        {
            "text": "This includes requirements around trailer authorisation on the operator licence, who is responsible for maintenance including safety inspections as well as having access to the trailer documents."
        },
        {
            "text": "Remember you as the operator are responsible for the condition of the trailer when it is coupled to your vehicle and you could receive a prohibition, fixed penalty or points if the trailer is found to be unroadworthy."
        },
        {
            "text": "Brake testing"
        },
        {
            "text": "From April 2025, laden roller brake tests or electronic brake performance monitoring systems (EBPMS) will, with some exceptions be the only accepted methods for brake testing."
        },
        {
            "text": "To prepare for this change, we strongly advise that a laden roller brake test is carried out at every safety inspection. The guide now includes more detail of how to use EBPMS and has more advice on brake testing."
        },
        {
            "text": "A brake performance assessment can be carried out no more than 7 days before the safety inspection date."
        },
        {
            "text": "Advanced driver assistance systems (ADAS)"
        },
        {
            "text": "As more vehicles have ADAS fitted we have added a new section including the need to recalibrate systems if the windscreens are replaced and making sure drivers are familiar with the different types of ADAS fitted across the fleet."
        },
        {
            "text": "Other updates"
        },
        {
            "text": "Other updates include:"
        },
        {
            "text": "As always, we'd like to know what you think of the updates. Take a look at the new guide and let us know in the comments below."
        }
    ]
}