{
    "url": "https://disabilityunit.blog.gov.uk/2021/12/29/chloe-smith-extending-the-disability-stakeholder-review/",
    "title": "Chloe Smith: Extending the Disability Stakeholder Review",
    "authors": [
        "Chloe Smith MP"
    ],
    "categories": [
        "National Disability Strategy"
    ],
    "pub_date": "2021-12-29T13:46:05+00:00",
    "content": [
        {
            "text": "In my new role as Minister for Disabled People, I have the privilege and responsibility  for ensuring the delivery of the National Disability Strategy to help improve the lives  of disabled people across the UK.  "
        },
        {
            "text": "Since the Strategy was published in July a number of commitments have already  been delivered. For example, the Department for Education has increased high  needs revenue funding for children and young people with more complex SEND by £730 million, and the Department for Business, Energy and Industry Strategy has launched an online advice hub and consultation on flexible working. "
        },
        {
            "text": "I am writing to you about one of the key strategy commitments that I am responsible for. It tasks my Disability Unit officials to review the way the UK government engages with disabled people, in discussions with disabled people, disabled people’s  organisations and charities by December 2021.  "
        },
        {
            "text": "It is crucial that we get this review right. A better understanding of disabled people and their issues is central to the successful delivery of the National Disability Strategy and further work in the future. Ensuring the voice of disabled people is properly heard is an important part of that. I am very conscious that we should be working more closely with disabled people’s organisations; that there are gaps in our knowledge of the size and makeup of the disability sector and that we are not always  hearing from the full diversity of the community.  "
        },
        {
            "text": "I thought it would be useful to give you an update on progress on the Disability Stakeholder Review, as we are calling it, and to let you know the next steps. "
        },
        {
            "text": "My officials in the Disability Unit have worked collaboratively with disabled people’s organisations and charities to develop the review’s terms of reference and will continue that collaboration as they deliver the review. They will be mapping the disability sector, looking at examples of best practice across the world and speaking to disabled people, DPOs and other organisations through a programme of events. They have started work on delivery of the first two workstreams and are developing  the events programme in collaboration with DPOs. "
        },
        {
            "text": "As we have been developing the review, it has become clear that ensuring a full opportunity for meaningful engagement with our stakeholders will take longer than the December 2021 deadline set out in the strategy. Our own preference is that we would rather take more time to get things right and this view has been supported by the DPOs and charities that we have been working with on the review. Having more space for better collaboration with DPOs and a wider and more diverse range of  conversations from right across the disabled community will ensure richer findings and more informed outcomes.  "
        },
        {
            "text": "For these reasons, we are planning to run the review through to Spring 2022 and to then clearly set out the next steps to ensure the most effective engagement with disabled people, disabled people’s organisations and charities going forward. "
        },
        {
            "text": "I encourage all interested organisations, and particularly DPOs, to take part in the review and I look forward to the findings. "
        }
    ]
}