{
    "url": "https://forestrycommission.blog.gov.uk/2021/12/29/helping-people-put-down-roots-with-woodland-creation/",
    "title": "Helping people put down roots with woodland creation",
    "authors": [
        "Bella Murfin and Naomi Matthiessen"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2021-12-29T08:00:20+00:00",
    "content": [
        {
            "text": "Hello again, we are Bella Murfin and Naomi Matthiessen, job share Directors for the Nature for Climate Fund Tree Programme in Defra."
        },
        {
            "text": "Our last blog – Might oaks from little acorns grow? – saw us reflect on our first year with Defra’s Trees and Forestry team, setting up the Tree Programme and publishing the England Trees Action Plan - our incredibly important framework, defining how we will continue to create and nurture trees and woods for future generations. As 2021 draws to a close, it’s a good chance to look back on what’s happened since then and to look forward to more people putting down roots with woodland creation in 2022."
        },
        {
            "text": "Life in Team Trees definitely hasn’t been quiet! We were lucky that the summer brought new recruits to help implement the Programme, boosting our numbers and our energy as we all moved firmly into ‘delivery’ mode. That’s involved launching new grants and announcing new policies, along with Forestry Commission and Natural England advisors helping landowners and managers to start taking up the England Woodland Creation Offer."
        },
        {
            "text": "In late June we welcomed the Plymouth and South Devon Community Forest to England’s Community Forest Network. This saw a commitment to create 500ha of woodland by 2025 with a further 1100ha by 2034, backed by a first-year funding boost of £480,000. Community Forests bring community focused planting to areas that are in most need of the support."
        },
        {
            "text": "The North East Community Forest quickly followed, with another £480,000 of first year funding to underpin commitments that will see 500ha of woodland creation by 2025 with a long-term vision to increase canopy cover across the north east to 30% by 2050."
        },
        {
            "text": "And just a few weeks ago we were delighted to announce that Cumbria was to join England’s Community Forest Network, fulfilling a key commitment set out in the ETAP to build at least three new Community Forests where they are needed most. The plans to help the area build back greener are exciting, with the equivalent of one tree planted for every resident in Copeland, Barrow and Allerdale over the next five years and a longer-term goal of over 5,000ha to be crated over the next 25 years."
        },
        {
            "text": "Back to the rest of the summer, and it flew by. On the one hand, there was lots of policy development work on implementation of the ETAP, including on how we will seamlessly transition from NCF into environmental land management schemes. On the other hand there was lots of preparation work for the early autumn delivery announcements which came thick and fast."
        },
        {
            "text": "Intensive work with the new Riverscapes Partnership (Rivers Trust, Woodland Trust, National Trust and Beavers Trust) culminated in announcing the flagship – Woodlands for Water which plans to plant over 3,000ha along England’s riverbanks. England has over 242,000km of watercourses. Incentivising farmers and other landowners and managers to protect trees and increase planting along these brings a wide range of benefits, from a reducing flood risk, to connecting woodlands and boosting biodiversity."
        },
        {
            "text": "Next came the Woodland Trust’s announcement of a £14.8m Defra’s Nature for Climate Fund boost, which will breathe new life into the Northern Forest with over a million new trees to be planted in the next year."
        },
        {
            "text": "The launch of a new £6m Trees Call to Action Fund, in partnership with the National Lottery Heritage Fund provided a chance to fund partnerships to increase woodland creation at a regional scale, and projects to engage people with trees, and develop skills and knowledge. Other regional action, supported by Defra, came in the shape of the White Rose Forest announcing their Action Plan for tree planting and woodlands, and the Great Northumberland Forest announcing their wider engagement with landowners and farmers to help develop the area and increase woodland."
        },
        {
            "text": "In October, the Government also announced that it will boost the Nature for Climate Fund with a further £124 million of new money, ensuring total spend of more than £750 million by 2025 on peat restoration, woodland creation and management – above and beyond what was promised in the manifesto. This signals widespread support for our work to get more trees in the ground."
        },
        {
            "text": "Moving into the first planting season since we launched new schemes has been incredibly exciting (and nerve wracking!) and National Tree Week – an annual event run by the Tree Council to promote tree planting – is a great way to trumpet its arrival."
        },
        {
            "text": "As part of that, we were pleased to announce that the Local Authority Treescapes Fund, Urban Tree Challenge Fund, Woods into Management fund and Tree Production Innovation Fund showed strong numbers of successful applications and have seen over £12 million allocated to projects across England."
        },
        {
            "text": "We then rounded off the week with publication of the landmark report from Forest Research on valuing the mental health benefits of woodlands. This showed what a key role trees, woodland and forests play in our lives. Forest Research found that the UK’s woodlands boost mental health and could save up to £185 million per year in treatment costs."
        },
        {
            "text": "As we write, projects funded by Nature for Climate are getting new trees in the ground right across England. It continues to be a privilege to be part of those initiatives, with so many people joining the efforts to boost woodland creation and management."
        },
        {
            "text": "Throughout the year we have also been supporting our partners, including The Queen’s Green Canopy – a unique, UK-wide tree planting initiative created to mark Her Majesty’s Platinum Jubilee in 2022, which invites people to “Plant a Tree for the Jubilee”. As we move into the Jubilee year we encourage everyone to get involved and register their trees to the map on The Queen’s Green Canopy website."
        },
        {
            "text": "It is incredibly motivating to work with people within and outside government so committed to delivering the many benefits that trees can bring, from climate change mitigation to nature recovery. The last couple of years have really brought home how important this is."
        }
    ]
}