{
    "url": "https://insidehmcts.blog.gov.uk/2021/12/29/the-value-and-purpose-of-the-fully-remote-court/",
    "title": "The value and purpose of the fully remote court",
    "authors": [
        "Lisa Shotton"
    ],
    "categories": [
        "Crime",
        "Digital services"
    ],
    "pub_date": "2021-12-29T15:00:49+00:00",
    "content": [
        {
            "text": "The fully remote court at Sheffield Crown Court is already proving its worth as a valuable part of criminal court recovery in the north-east of England, as we continue our fightback against the impact of COVID-19. We run 2 fully remote courts at Sheffield when can. This delivers value in that all participants in the court process are located in a virtual courtroom, and a physical courtroom is not used.  This means physical courtrooms at Sheffield can be used for trials, or those cases where a judge decides a fully remote hearing is inappropriate."
        },
        {
            "text": "The Sheffield fully remote court has been developed and delivered under the leadership of the Recorder of Sheffield, His Honour Judge Jeremy Richardson QC. Since it began as a pilot in March 2021, it has freed up space for an additional 2 courts to hear trials or allow for overspill of multi-handed trials, enabling more timely access to justice for all those involved."
        },
        {
            "text": "How it works"
        },
        {
            "text": "The fully remote court is, of course, not appropriate for all types of cases."
        },
        {
            "text": "We've used it most successfully for those cases where each defendant is in custody and the hearing is short and does not involve evidence or lengthy or complex argument, such as bail applications or directions hearings. This has had a positive impact on outstanding Crown Court case levels."
        },
        {
            "text": "The list of cases to be heard in the fully remote court each day is known as the ‘R list’. For these cases, the judge and the court clerk often convene in the same room – usually the Justices’ Assembly Room in Sheffield – or at least the same court building. This enables immediate communication between the two, as would be the case in the physical courtroom. All other parties join remotely, with counsel and solicitors accessing the court via Cloud Video Platform (CVP), whilst members of the press or public can apply to the court via telephone to access proceedings in the same way."
        },
        {
            "text": "To help retain the majesty of the courtroom, the judge usually uses an artificial backdrop with the Royal Coat of Arms. It's always made very clear when anyone accesses the hearing via CVP that it's a court hearing so cannot be recorded by any participant. Any party can object to a hearing in the fully remote court and request that the case be adjourned to a courtroom."
        },
        {
            "text": "Quickly ironing out the issues"
        },
        {
            "text": "Judiciary and court staff worked quickly and effectively to resolve any teething problems with the fully remote court. One early issue was the formal recording and transcribing of cases, which is usually done in the physical courtroom through the Digital Audio Recording Transcription and Storage (DARTS) portal. But this was not initially installed in the Assembly Room used for the fully remote court."
        },
        {
            "text": "During the early stages, court clerks recorded each hearing on a handheld recording device, and subsequently uploaded to the portal, so we could store the hearing and access playback and transcriptions. This process was quite time consuming and potentially open to human error. So we installed the portal in the fully remote court earlier this year - an important step in improving the efficiency and effectiveness of the remote court."
        },
        {
            "text": "Warmly received"
        },
        {
            "text": "Feedback from court users and other judges has been very positive, and they find the system straightforward to use. Court clerks have also greeted the new ways of working enthusiastically, showing great joint working to adapt and find solutions to any issues. Legal professionals have been very supportive, and local solicitors and barristers have actively provided us with vital feedback, which we’ve acted upon. For example, we provided one of the smaller conference rooms for legal professionals to sit in when appearing in the fully remote court on days when they are also undertaking other work in a physical Sheffield Crown Court room, which has gone down really well."
        },
        {
            "text": "Reflecting on progress made so far, HHJ Richardson said:"
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Following the success of the pilot, the Senior Presiding Judge (SPJ) agreed to HHJ Richardson’s recommendation that the fully remote court should continue to run for a further 12 months before being reviewed, extending its use to April 2022. A decision will then be taken on whether to extend its use beyond that date."
        }
    ]
}