{
    "url": "https://deframedia.blog.gov.uk/2021/12/29/uk-fishing-industry-and-coastal-communities-receive-75m-boost/",
    "title": "UK fishing industry and coastal communities receive £75m boost",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries",
        "Weekly stories"
    ],
    "pub_date": "2021-12-29T11:24:54+00:00",
    "content": [
        {
            "text": "On Monday 27 December, the UK government announced a £75 million investment to modernise the UK fishing industry and level up coastal communities. This gained widespread coverage across broadcast, national and trade media titles; including ITV News, BBC News online, the Express, Daily Mail, Daily Mirror, the Sun, the Telegraph, the Times, Press and Journal, Western Morning News and the Herald."
        },
        {
            "text": "The financial boost that will serve to rejuvenate industry, increase capacity to land and process more fish, upskill fishers, support long-term sustainability and support job creation, will be delivered through two funding schemes forming the second and third parts of the £100m UK Seafood Fund."
        },
        {
            "text": "£65 million will be made available for projects such as modernising ports and harbours alongside increasing capacity and efficiency at processing and aquaculture facilities. The Infrastructure pillar will also invest in the transition to renewable energy, prioritising projects which support long-term sustainability."
        },
        {
            "text": "Up to £10 million will be used to encourage new entrants into the processing, catching and aquaculture sectors, alongside training and upskilling current workers."
        },
        {
            "text": "A further £1m will be dedicated to promoting UK seafood, further details of which will be set out in 2022."
        },
        {
            "text": "Environment Secretary George Eustice said:\n"
        },
        {
            "text": "The UK government also published its response to a consultation with industry on proposed changes, collectively known as the ‘economic link’, gaining coverage in titles such as the Times and the Express. The changes apply to UK vessels fishing against English quota and will come into effect from 1 April 2022.  This includes increasing the minimum percentage of UK crew members that must be on board vessels to 70% and increasing the amount of fish that must be landed in the UK to 70%."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}