{
    "url": "https://food.blog.gov.uk/2022/02/23/chairs-stakeholder-update-levelling-up-and-healthy-eating-in-schools/",
    "title": "Chair's stakeholder update - Levelling up and healthy eating in schools",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-02-23T12:19:41+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Food Standards Agency Chair Professor Susan Jebb discusses the Levelling Up White Paper and support for healthy eating in schools, as well as the FSA supporting food strategies in Northern Ireland and Wales."
        },
        {
            "text": " "
        },
        {
            "text": "I was so pleased that the FSA was able to play a part in the cross-government plan to transform the UK into a more equal society, announced in the recent Levelling Up White Paper. The plan focuses on spreading opportunity and prosperity to all parts of the UK by shifting government focus and resources to where it’s needed the most."
        },
        {
            "text": "Across all of our work we are paying increasing attention to how we can help identify and reduce disparities; whether that is the regulatory burden on businesses or the food-related health inequalities between regions across the UK."
        },
        {
            "text": "The Levelling Up White Paper recognises the work the FSA is doing with the Department for Education in relation to school meals. We are designing a pilot in England to understand how we can help raise standards for food in schools through an assurance process and support for school governors or local authorities where necessary. Supporting healthy eating in schools is key to developing healthy habits for a lifetime, improving long-term health outcomes, and reducing diet-related disparities."
        },
        {
            "text": "I hope this is just the start of expanding the work we do to deliver food you can trust. We are offering support to the Welsh government on their commitment to develop a Wales Community Food Strategy, which will encourage the supply of locally sourced food in Wales. Additionally, we are talking with Welsh government about ways to support their Healthy Weight Healthy Wales programme."
        },
        {
            "text": "In Northern Ireland, we are a key partner in the DAERA led Northern Ireland Food Strategy Framework and also welcome the insightful review by Sir Peter Kendall on the challenges and opportunities that the agri-food sector faces there. With our dietary health remit and the current development of a new obesity strategy in Northern Ireland, we will continue to be a key partner in its development and implementation."
        },
        {
            "text": "As we emerge from the pandemic and continue to adjust to the changes brought about by EU exit, we are looking forward to how the FSA can play its part in delivering a safe, healthy and sustainable food system for the future. At the FSA Board meeting on Wednesday 9 March 2022, we will be discussing how we will do this through our new strategy. Register now to stream the meeting and join that discussion."
        },
        {
            "heading": 2,
            "text": "Cadeirydd yr Asiantaeth Safonau Bwyd, yr Athro Susan Jebb, yn trafod Codi’r Gwastad a chymorth ar gyfer bwyta’n iach mewn ysgolion."
        },
        {
            "text": "Roeddwn wrth fy modd bod yr Asiantaeth Safonau Bwyd (ASB) wedi gallu chwarae rhan yn y cynllun trawslywodraethol i drawsnewid y Deyrnas Unedig yn gymdeithas fwy cyfartal, a gyhoeddwyd yn y papur gwyn codi’r gwastad (levelling up) diweddar. Mae’r cynllun yn canolbwyntio ar ledaenu cyfleoedd a ffyniant i bob rhan o’r Deyrnas Unedig drwy symud ffocws ac adnoddau’r llywodraeth i’r mannau lle mae eu hangen fwyaf."
        },
        {
            "text": "Ar draws ein holl waith rydym ni’n rhoi sylw cynyddol i sut y gallwn ni helpu i nodi a lleihau anghyfartaledd, boed hynny’n faich rheoleiddiol ar fusnesau neu’r anghydraddoldebau iechyd sy’n gysylltiedig â bwyd rhwng rhanbarthau ledled y DU."
        },
        {
            "text": "Mae’r papur gwyn codi’r gwastad yn cydnabod y gwaith y mae’r ASB yn ei wneud gyda’r Adran dros Addysg mewn perthynas â phrydau ysgol. Rydym ni’n llunio cynllun peilot yn Lloegr i ddeall sut y gallwn helpu i wella safonau bwyd mewn ysgolion drwy broses sicrwydd a chymorth i lywodraethwyr ysgol neu awdurdodau lleol lle bo angen. Mae cefnogi bwyta’n iach mewn ysgolion yn allweddol er mwyn datblygu arferion iach am oes, gwella canlyniadau iechyd hirdymor, a lleihau anghyfartaleddau sy’n gysylltiedig â deiet."
        },
        {
            "text": "Rwy’n gobeithio mai dim ond dechrau yw hyn ar ehangu’r gwaith a wnawn o ran cyflenwi bwyd y gallwch ymddiried ynddo. Rydym ni’n cynnig cefnogaeth i Lywodraeth Cymru ar eu hymrwymiad i ddatblygu Strategaeth Bwyd Cymunedol Cymru, a fydd yn annog cyflenwi bwyd o ffynonellau lleol yng Nghymru. Yn ogystal, rydym ni’n siarad â Llywodraeth Cymru am ffyrdd o gefnogi eu rhaglen Pwysau Iach Cymru Iach."
        },
        {
            "text": "Yng Ngogledd Iwerddon, rydym ni’n bartner allweddol yn Fframwaith Strategaeth Fwyd Gogledd Iwerddon a arweinir gan DAERA ac rydym ni hefyd yn croesawu’r adolygiad craff gan Syr Peter Kendall ar yr heriau a’r cyfleoedd y mae’r sector bwyd-amaeth yn eu hwynebu yno. Gyda’n cylch gorchwyl iechyd deietegol a datblygiad cyfredol strategaeth gordewdra newydd yng Ngogledd Iwerddon, byddwn yn parhau i fod yn bartner allweddol wrth ddatblygu a gweithredu’r strategaeth."
        },
        {
            "text": "Wrth i ni ddod allan o’r pandemig a pharhau i addasu i’r newidiadau a ddaeth yn sgil ymadael â’r UE, rydym ni’n edrych i’r dyfodol at sut y gall yr ASB chwarae ei rhan wrth ddarparu system fwyd ddiogel, iach a chynaliadwy ar gyfer y dyfodol. Yng nghyfarfod Bwrdd yr ASB ym mis Mawrth, byddwn yn trafod sut y byddwn yn gwneud hyn drwy ein strategaeth newydd. Gallwch chi ymuno â'r drafodaeth honno yma."
        }
    ]
}