{
    "url": "https://deframedia.blog.gov.uk/2022/02/23/environment-secretary-at-the-nfu-conference-to-set-out-animal-health-and-welfare-support-for-farmers/",
    "title": "Environment Secretary at the NFU Conference to set out animal health and welfare support for farmers",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2022-02-23T15:52:21+00:00",
    "content": [
        {
            "text": "There is widespread coverage in The Telegraph, The i, Daily Mail, Guardian, Financial Times, Pig World, Farmers Weekly, Western Morning News, Yorkshire Post and on BBC Radio 4 Farming Today of yesterday’s speech by the Environment Secretary at the NFU Conference."
        },
        {
            "text": "In his intervention, George Eustice outlined his vision for an internationally competitive livestock sector, setting out plans for government funded vet visits and grants for welfare improvements through the Animal Health and Welfare Pathway – a programme of financial support for farmers in the pig, cattle, sheep and poultry sectors, based around key animal health and welfare priorities."
        },
        {
            "text": "These include measures such as reducing mastitis and lameness in dairy cattle, improving biosecurity  to control pig diseases endemic to the UK and improving the feather cover of laying hens. To help farming sectors make these improvements, Animal Health and Welfare Grants will be launched within the next year to fund investments such as equipment and technology or larger projects like upgrading housing for dairy cattle to deliver improvements in lameness, cow comfort and calf mortality."
        },
        {
            "text": "As part of the Pathway, the Government will initially offer cattle, sheep and pig farmers who are eligible for the Basic Payment Scheme funding for an annual visit from a vet of their choice to carry out diagnostic testing, review biosecurity and responsible use of medicines, and provide advice relating to the health and welfare of their animals. These visits will launch later this year (2022) and the offer will be further extended over time to other types of livestock farmers."
        },
        {
            "text": "Environment Secretary, George Eustice said:"
        },
        {
            "text": "During his speech, the Environment Secretary also announced that further funds for small technology grants will be made available to support investment in farm productivity through the Farming Investment Fund. Late last year, Defra opened the Farming Investment Fund with an initial pot of £17 million. Given its successful uptake, the budget has now increased to £48 million, which will enable around 4,000 applications from farmers to proceed successfully."
        },
        {
            "text": "This week, the NFU also published ‘British farming: A Blueprint for the Future’. In response to the report, Farming Minister Victoria Prentis, said:"
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}