{
    "url": "https://designnotes.blog.gov.uk/2022/02/23/help-us-shape-the-gov-uk-design-system/",
    "title": "Help us shape the GOV.UK Design System!",
    "authors": [
        "Katrina Birch – User researcher, GDS",
        "Rosie Clayton – User researcher, GDS"
    ],
    "categories": [
        "Design System",
        "Likely to change"
    ],
    "pub_date": "2022-02-23T12:46:28+00:00",
    "content": [
        {
            "text": "In 2021 we asked how satisfied you were with the GOV.UK Design System, the community backlog, the prototype kit and GOV.UK Frontend. In 2019 we asked you how comfortable you were contributing to the Design System and if there were any barriers to you doing this. "
        },
        {
            "text": "The results from our 2021 and 2019 surveys have been invaluable in helping us understand the barriers users face and prioritise achievable improvements."
        },
        {
            "text": "We need your help again. Complete our 2022 survey and tell us what your experience with the Design System has been."
        },
        {
            "text": "In the Design System team, we try to get as much input as possible from our users and the Design System community, whether that’s through contributions, community events or user research. We’re always keen to understand any barriers to engaging with and contributing to the Design System and how satisfied users are with it. Here’s what we found in 2021 and 2019 and what we did next."
        },
        {
            "heading": 2,
            "text": "What we learned last time round "
        },
        {
            "text": "We heard from 106 people representing 16 departments, 4 local councils and 12 disciplines (including interaction design, content design, software development, and frontend development)"
        },
        {
            "heading": 3,
            "text": "The top things you told us you wanted to see were: "
        },
        {
            "text": "In 2019 we learned that respondents were not confident in contributing a pattern or component or opening a pull request on Github."
        },
        {
            "heading": 3,
            "text": "The biggest barriers were:"
        },
        {
            "text": "The people who were disproportionately affected were those who hadn’t used the Design System before and women."
        },
        {
            "heading": 2,
            "text": "What we did next "
        },
        {
            "text": "For the first time, we’ve hired a dedicated multidisciplinary team to work on the prototype kit."
        },
        {
            "text": "We continue to publish new patterns and components. Most recently, we published the ‘Notification banner’ component and ‘help users recover from validation errors’ pattern. "
        },
        {
            "text": "Through the hard work of our community manager, we now have entire groups from across government working on the patterns and components in the community backlog, such as Task List. "
        },
        {
            "text": "We are working on keeping our users up to date, and we’ve added a ‘What’s new’ section to the GOV.UK Design System website and have a mailing list that our users can sign up to and get the latest updates on releases and events."
        },
        {
            "text": "We have also pooled the helpful resources and tools our community has created and published them on the ‘Resources and tools’ page. "
        },
        {
            "text": "We continue to improve our guidance on the site and we also need your help to do this. We can add your research to each component and pattern by going to the link at the bottom of each component and pattern page. For an example, see the issue discussion for the ‘Notification banner’ component. "
        },
        {
            "heading": 3,
            "text": "Examples of improvements we have made to patterns, components and guidance are:"
        },
        {
            "heading": 3,
            "text": "Working with our community we have:"
        },
        {
            "heading": 2,
            "text": "What we’re doing now "
        },
        {
            "text": "2022 will see us iterating and improving. Help us do this by completing our 2022 survey and telling us what your experience with the Design System has been."
        },
        {
            "text": "Sign up to take part in future research and help improve the GOV.UK Design System and influence its development."
        }
    ]
}