{
    "url": "https://educationhub.blog.gov.uk/2022/02/how-black-asian-and-minority-ethnic-history-is-taught-in-our-schools/",
    "title": "How Black, Asian and Minority Ethnic History is taught in our schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Schools"
    ],
    "pub_date": "2022-02-23T15:52:41+00:00",
    "content": [
        {
            "text": "Schools play a crucial role in helping young people understand the world around them and their place within it."
        },
        {
            "text": "The knowledge-rich curriculum in our schools offers pupils the opportunity to study significant figures from black and ethnic minority backgrounds and the contributions they have made to the nation, as well as helping them understand our shared history with countries from across the world."
        },
        {
            "text": "Here’s how Black, Asian and Minority Ethnic History can be taught in our schools."
        },
        {
            "text": "From at least the Roman times, Black, Asian and other Minority Ethnic people have been an integral part of Britain, and the National Curriculum supports teaching about their contribution."
        },
        {
            "text": "One of the key aims of the history curriculum is to know and understand the history of these islands as a coherent, chronological narrative, from the earliest times to the present day. This includes how people’s lives have shaped this nation and how Britain has influenced and been influenced by the wider world, which helps build an understanding of a shared British history."
        },
        {
            "text": "Schools can teach about how the contributions of people of all ethnicities have made this the great nation it is today."
        },
        {
            "text": "There are a number ways that Black, Asian and Minority Ethnic history can be taught in schools using the national curriculum for history from Key Stages 1 to 3, and the subject content requirements for history GCSE at Key Stage 4:"
        },
        {
            "text": "As part of a broad and balanced curriculum, pupils should be taught about different societies, and how different groups have contributed to the development of Britain, including the voices and experience of Black, Asian and Minority Ethnic people."
        }
    ]
}