{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/02/23/lgbt-history-month-reflections-on-progress/",
    "title": "LGBT+ History Month: reflections on progress",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Communities",
        "Events",
        "Mental health",
        "Our profession"
    ],
    "pub_date": "2022-02-23T16:43:41+00:00",
    "content": [
        {
            "heading": 2,
            "text": "From invisible to visible"
        },
        {
            "text": "I have witnessed unprecedented changes in LGBT+ rights over my years as a social worker, and whilst there is still much to do, as we celebrate diversity throught the ages during LGBT+ History Month, it is helpful to reflect on how far we have come."
        },
        {
            "text": "I was brought up in a small rural town in a conservative, traditional Italian catholic community. I wasn’t aware of any LGBT+ people and at that time, there was little representation in the media."
        },
        {
            "text": "I worked as a frontline social worker in the era of section 28 and there were few rights for LGBT+ people. There was a lack of visibility and positive representation. What we needed was an explicitly inclusive culture and society which validated and valued LGBT+ people, enabling and empowering them to live happy, heathy lives and to fully contribute to our communities. This is at the heart of social work practice."
        },
        {
            "text": "Society and social work changed with the Human Rights Act 1998, which protects our rights to be treated as equals, including starting a family, being out at work, serving in the military, accessing healthcare, and even staying in a double room in a hotel with partners."
        },
        {
            "text": "Equal access to public services for LGBT+ people has made more explicit our professional principles of equality. diversity and inclusion in tackling inequality and injustice."
        },
        {
            "heading": 2,
            "text": "Watershed moments"
        },
        {
            "text": "A significant milestone for social workers came when same sex couples achieved equal rights for adoption as straight couples in 2002. Being able to support and encourage LGBT+ people to foster children and young people was a great step forward."
        },
        {
            "text": "Equally, the repeal of Section 28 in 2003, following mass protests was another milestone. From 2004, I have happy memories of attending many of my friends’ civil partnership ceremonies and since 2014, their marriages. It is hard to believe these rights in law are so recent."
        },
        {
            "text": "Social work has developed a better understand and improved practice in supporting older LGBT+ people and the issues they face in accessing appropriate services, but there is much more to do in this area."
        },
        {
            "text": "I still hear too many experiences where their social care support did not respectfully take account of their needs and the outcomes they want to live the best possible lives."
        },
        {
            "text": "Making sure LGBT+ staff working across social care experience acceptance and inclusion is essential. In so doing, we demonstrate our social work values to support individuals and communities, regardless of circumstance and background."
        },
        {
            "text": "We all need to feel safe to be our whole selves at work and most importantly to make sure policies and practice we contribute to fully include the needs of LGBT+ people."
        },
        {
            "text": "Although much has been achieved in the cause of equality, these challenging times of pandemics and other uncertainties at home and abroad, means our influence, working alongside and with LGBT+ people to improve our practice and experiences of social care, is needed now more than ever."
        }
    ]
}