{
    "url": "https://civilservice.blog.gov.uk/2022/02/23/new-dawn-for-disability-our-exciting-plans-for-2022/",
    "title": "New dawn for disability - our exciting plans for 2022",
    "authors": [
        "Ben Merrick, Director, Joint Funds Unit, Cabinet Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-02-23T10:42:24+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Deputy Civil Service Disability Champion Ben Merrick, a disability role model on dealing with his blindness, shares how the Civil Service continues to improve the workplace for disabled colleagues."
        },
        {
            "text": "Being disabled can often be seen as a barrier. I hope I am proof that this doesn’t have to be the case - and having a disability can, in some cases, even bring its own unique benefits."
        },
        {
            "text": "I have been registered blind (I have no central vision, though retain some peripheral vision) since the age of 18, and it certainly hasn’t held me back. I’ve always tried to stretch myself, increase my self-awareness, and ensure my blindness doesn’t stop me from my goals. For example, despite only taking up running during the first COVID lockdown in 2020, I set myself a target in 2021 of running 1,000 miles over the course of the year."
        },
        {
            "text": "I reached my goal on Christmas Eve, driven in part by the endorphins, but also a desire to demonstrate what is possible for disabled people to achieve. As ever, technology is a huge enabler for the disabled, and I was able to use the Nike Run Club app and the iPhone voiceover to track my progress during the year, even if there wasn’t so much as a congratulatory beep when I reached four figures!"
        },
        {
            "heading": 4,
            "text": "Honoured with 007"
        },
        {
            "text": "Professionally, I’ve taken the same driven approach, and in 2017 was appointed Director of Overseas Territories in the Foreign, Commonwealth and Development Office."
        },
        {
            "text": "This was a superb job and I was privileged to lead a great team in the UK and abroad in supporting the Overseas Territories. So I was deeply proud to receive a CMG (Companion of St Michael and St George) in the 2022 New Year’s Honours list - along with Daniel Craig! I’m now very much looking forward to my investiture at the Palace, where I will showcase once again that disabilities don’t have to hold us back."
        },
        {
            "text": "And then last summer, after four highly rewarding and often challenging years, I moved roles. I’m now the Director of the Joint Funds Unit in the Cabinet Office’s National Security Secretariat. I oversee the Conflict, Stability and Security Fund (CSSF) of circa £875 million per annum, which enables a cross-government, integrated response to tackle threats to UK interests arising from instability overseas."
        },
        {
            "heading": 4,
            "text": "Unexpected disability advantages"
        },
        {
            "text": "The CSSF brings together the UK’s diplomatic, development, military and security capabilities to support delivery of the government’s top national security priorities in more than 80 countries. It’s another fascinating and very important role which gives me the opportunity to work with great people in the UK and overseas, as well as putting into practice the skills I’ve developed in past roles, such as leadership, strategic thinking and communication, where my disability in fact gives me unexpected advantages."
        },
        {
            "text": "Whether my role as Deputy Civil Service Disability Champion has helped me in these roles, or the other way round, it’s hard to say - but I think it’s probably a bit of both. With my colleagues in the D&I space, the work we have done and continue to do in the Civil Service is crucial. We strive to show others who have a disability that there need not be any barriers in our way, and to be the role models we ourselves needed."
        },
        {
            "heading": 4,
            "text": "Supporting disabled colleagues "
        },
        {
            "text": "As Deputy Civil Service Disability Champion, I’ve been continuing to support our key priorities. We’re focusing on: improving IT interoperability and embedding accessibility, including how systems are designed, procured and updated; building the capability of leaders at every level; and growing the pipeline of talent. In particular, we’re supporting the delivery of effective and consistent workplace adjustments across the Civil Service. These aren’t quick wins, but I know from personal experience how fundamental they are to enabling disabled people to thrive."
        },
        {
            "heading": 4,
            "text": "Disability Champion"
        },
        {
            "text": "I’m also continuing to support the UK National Security community as disability champion and to progress diversity and inclusion more widely. Recognising that diversity and inclusivity are operational imperatives, we in the community have driven initiatives such as a ‘Mission Critical’ toolkit for staff and challenge boards, to share a wide range of good practice and advice."
        },
        {
            "heading": 4,
            "text": "Improvements for disabled colleagues in national security"
        },
        {
            "text": "In championing disability within the community, I’ve been working with others to demonstrate the breadth of roles, development opportunities and achievements that disabled people can have within national security, and improve line manager capability. Inevitably, security can sometimes be an issue. To overcome this, we’ve circulated guidance on workplace adjustments in secure areas (and are working on technical solutions to issues such as Bluetooth), as well as ensuring processes such as security vetting are as inclusive as possible."
        },
        {
            "heading": 4,
            "text": "Conclusion"
        },
        {
            "text": "There is undoubtedly further to go but I am pleased that we continue to make progress. Since 2011, there has been a year-on-year increase in the percentage of civil servants who declare themselves to be disabled. This figure now stands at 13.6%, up from 12.8% in 2020, and 7.7% in 2011, slightly below the economically active working age population (14.7%). We remain committed to improving representation of disabled colleagues across our workforce and in particular at our most senior grades."
        },
        {
            "text": "This is a substantial agenda, and I’m proud to be part of an organisation making a concerted effort to tackle it. I’m hugely passionate about making a real difference to disabled people’s lives and enabling our ambition to be a skilled and innovative Civil Service, ready for the future."
        }
    ]
}