{
    "url": "https://geospatialcommission.blog.gov.uk/2022/02/23/public-trust-in-location-data-depends-on-who-is-using-it-and-why-survey-finds/",
    "title": "Public trust in location data depends on who is using it and why, survey finds.",
    "authors": [
        "Callum Adams, Location Data Ethics Lead"
    ],
    "categories": [
        "Data",
        "data ethics",
        "Technology"
    ],
    "pub_date": "2022-02-23T13:52:57+00:00",
    "content": [
        {
            "text": "The UK public’s trust in the use of location data differs greatly depending on the user, a survey by the Geospatial Commission has found. "
        },
        {
            "text": "The poll revealed that more than three quarters (81%) of UK adults trust the emergency services to use their location data to provide them with or improve a service, but this drops to 10% when the user is a social media organisation. "
        },
        {
            "text": "Respondents deem location data useful in most applications - including health (56%), travel (79%) and personal safety (80%) - with the exception of making advertising more relevant (17%)."
        },
        {
            "text": "Despite appreciating its usefulness, most people have a limited knowledge of location data and its uses, with 32% having no understanding of it - despite all of us using it in our daily lives. Interestingly, those with a greater understanding of location data had a more positive attitude towards its use for them personally."
        },
        {
            "text": "Our survey, the full results of which are published today, was conducted in November as part of our public engagement on location data ethics. The UK Geospatial Strategy recognises that society can only continue to fully benefit from the widespread use of location data and its future opportunities if location data is used in a way that retains public confidence."
        },
        {
            "text": "We have committed to providing guidance about how to unlock location data’s significant value, while mitigating ethical and privacy concerns. To inform this guidance, we embarked on a broad programme of engagement with stakeholders across the geospatial landscape, such as policy professionals working on data policy and ethics, organisations using location data and crucially the public."
        },
        {
            "text": "In December, we published the findings of an independent public dialogue exploring public attitudes about location data and the conditions for its trustworthy use. This dialogue was one of the UK’s first deliberative consultations on location data and engaged 85 members of the public. The nationally representative survey has provided further insights into the public’s perception of location data and created a baseline that will enable us to establish and test trends through future surveys. "
        },
        {
            "text": "Many of the findings reflected those made in the public dialogue. Participants viewed location data far more positively when they understood more about it and in general, felt more comfortable with the use of aggregated and anonymous location data. 14% of respondents thought it was acceptable to collect their location data when it identifies them but this rose significantly to 56% when the data is anonymised."
        },
        {
            "text": "The public’s trust in organisations to use their location data to provide them with or improve a service differed greatly depending on the sector. The survey found that 81% said they have a great deal or fair amount of trust in the emergency services to use their location data in this way, while there was ‘minimal trust’ in all other sectors. The least trusted were social media companies (10%), followed by local (24%) and national (25%) companies, local and national government (29%), telecoms companies (34%) and banks (38%)."
        },
        {
            "text": "The results of the survey reiterate the importance of organisations building public trust in location data use. By illuminating what matters to the public, like anonymisation and control, the findings begin to define how organisations can do that."
        },
        {
            "text": "What is encouraging is that those respondents who were more aware of location data, generally had a more positive view of its use for them personally. This suggests that to retain and grow the public’s trust in location data we need to help the public move from data subjects to data citizens, who understand how their data is being used and can make more informed decisions. What is more, the importance of location data in our everyday lives - its indispensable benefits - should be made clearer. "
        },
        {
            "text": "How we translate the evidence we are gathering into guidance is bound to be complex, especially where the public's sentiments about data sharing differ from the decisions they make about their data every day, and why. We will continue to engage with a wide range of stakeholders as we develop and publish guidance on promoting public confidence in location data use."
        },
        {
            "text": "All figures, unless otherwise stated, are from YouGov Plc. The total sample size was 1,756 adults. Fieldwork was undertaken from 3 to 4 November 2021. The survey was carried out online. The figures have been weighted and are representative of all UK adults (aged 18+)."
        },
        {
            "text": "Sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}