{
    "url": "https://environmentagency.blog.gov.uk/2023/05/22/building-back-better-and-mainstreaming-property-flood-resilience/",
    "title": "Building back better and mainstreaming property flood resilience",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2023-05-22T09:49:05+00:00",
    "content": [
        {
            "text": "Julie Foley, Director of Flood Risk Strategy & National Adaptation"
        },
        {
            "text": "Around 1 in 6 people are at risk of flooding in England. Our changing climate means that more homes will be at risk in the future. We have traditionally focussed our approach to flooding in England on the construction of barriers, walls and flood reservoirs. Protection of this kind will remain hugely important. But we cannot eliminate all risk. We all have a role to play in making ourselves and our homes and businesses more resilient to the current and growing threat from flooding."
        },
        {
            "text": "Property flood resilience is one way we can do that. These are measures that reduce the risk of damage to individual properties, speed up recovery, and help people move back into their properties more quickly after flooding. They include resistance measures that help to keep as much water out of the property as possible, using products like flood doors and barriers and self-closing air bricks. And they can also include measures like tiled floors and raised electrics so if water does enter the property, it causes as little damage as possible."
        },
        {
            "text": "Property flood resilience is a way of managing flooding from various sources such as rivers, the sea and surface water which work alongside traditional engineered defences and natural flood management. The National Flood and Coastal Erosion Risk Management (FCERM) Strategy identified that more focus is needed on encouraging property owners to ‘build back better’ after a flood. The FCERM Strategy Roadmap contains a number of actions for working in collaboration with the insurance sector, professional bodies and suppliers to mainstream property flood resilience."
        },
        {
            "text": "One of those actions is to develop a property flood resilience awareness campaign jointly with Flood Re, an organisation that helps provide more affordable home insurance to those living in high flood risk areas. Installing resilience measures is most cost effective when home renovations are being carried out. In the event of a significant flood, having property flood resilience measures installed could avoid repair costs of up to 70% compared to a home without measures installed. Property flood resilience can mean the difference between staying at home or having to move out for many months following a flood."
        },
        {
            "text": "We estimate that around 9 out of 10 properties fitted with resistance measures in England are carried out under our flood and coastal risk management investment programme. During the last programme, which ran from 2015 to 2021, 1,700 homes were better protected using property flood resilience measures. Looking forward, we and partners are planning to better protect about 4,800 properties by 2027 with funding of £50 million. Right now, we are working with suppliers to encourage more of them to help install products, so the public gets value for money."
        },
        {
            "text": "We want to be sure that these measures are helping people. After the flooding in Bewdley in February 2022, we commissioned a survey of homeowners to find out the difference they’d made. 97% of residents who responded to the survey said that the measures made a positive difference – reducing damage, anxiety and stress."
        },
        {
            "text": "We need many more people to choose to invest in property flood resilience. Yet, behavioural insights research has shown that many homeowners do not consider property flood resilience because of perceptions of high costs, concern about how it works and difficulty getting started."
        },
        {
            "text": "To increase confidence and credibility in property flood resilience measures, we have worked with partners to develop a code of practice for the sector. And we have partnered with the Chartered Institution of Water and Environmental Management (CIWEM) to establish a training package for practitioners."
        },
        {
            "text": "We will also continue to innovate and make property flood resilience measures more accessible. Interactive tools can now provide information alongside virtual tours like the Flood Mobile. Through the £150 million Flood and Coastal Resilience Innovation Programme, we are working with several local authorities to test innovative approaches to property flood resilience, such as looking at sustainable and affordable measures in disadvantaged communities."
        },
        {
            "text": "With flood risk expected to increase in the future, there are things we can all do to make ourselves ready.  Simple things like checking your flood risk, signing up for flood warnings and making a flood plan are essential first steps. Making our homes and businesses more flood resilient is vital part of responding to the climate emergency."
        },
        {
            "text": "For more information on the property flood resilience awareness campaign, visit www.floodre.co.uk/be-flood-smart"
        },
        {
            "text": "There are some great examples in this free e-book."
        }
    ]
}