{
    "url": "https://defradigital.blog.gov.uk/2023/05/22/how-we-are-preparing-for-the-introduction-of-the-new-biodiversity-net-gain-digital-service/",
    "title": "How we are preparing for the introduction of the new biodiversity net gain digital service",
    "authors": [
        "Chris Brooker"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-05-22T08:00:50+01:00",
    "content": [
        {
            "text": "On International Day for Biological Diversity Service Designer Chris Brooker shares some insight into the work that has gone into designing a service for a unique new government policy which goes live later this year."
        },
        {
            "text": "As a service designer in government, I rarely work on a service for policy and legislation that is so new. Biodiversity net gain is unique because there are no existing government services or systems already in place to achieve it."
        },
        {
            "text": "To provide a bit of context, biodiversity net gain (BNG) is an approach to land development which aims to leave biodiversity in a measurably better state than before. BNG aims to deliver benefits for nature, people, and places."
        },
        {
            "text": "From commencement, all appropriate developments will need to deliver a minimum 10% BNG. BNG reinforces the mitigation hierarchy and is additional to all existing habitat and species protection."
        },
        {
            "text": "As stated in the Environment Act 2021, BNG must be measured using a recognised metric, as published by the Secretary of State. Following the mitigation hierarchy, BNG can be delivered on the development site (‘onsite’), through local compensatory habitat creation (‘offsite’), or, as a last resort, by paying for Statutory Credits."
        },
        {
            "text": "There are examples of other policies and best practices from the UK, and around the world.  I’ve been able to take inspiration from these but we’re often working from a blank sheet of paper, which can be challenging at times."
        },
        {
            "text": "Everything is hypothetical and based on assumptions of how it might work, and it is a trickier service to test out of context due to the complex web of new legal conditions and government departments, and different users."
        },
        {
            "heading": 2,
            "text": "Our role as the User Centred Design (UCD) team"
        },
        {
            "text": "Our job as the UCD team for the BNG Digital Service Programme is to make the process of recording biodiversity net gain as easy as possible."
        },
        {
            "text": "We need to make sure users understand this new process and can complete these tasks in order to meet this new legislation. We aim to help users achieve it on their development site, off-site land, on their own land or local area."
        },
        {
            "text": "It has meant keeping a close eye on what we must do, and build on the seemingly infinite strategic opportunities and possibilities for a new Biodiversity Net Gain Service in a complicated landscape."
        },
        {
            "heading": 2,
            "text": "Working towards a goal with an iterative design process"
        },
        {
            "text": "Our aim throughout this process is to achieve the policy intent, and advance nature’s recovery with digital services which meet user needs."
        },
        {
            "text": "As we design, test, and build the component parts and steps of our service we must work with the evolving legislation. We always strive to streamline the data we collect and reduce the steps in the process. It is a balancing act at times and, as always, compromises need to be made."
        },
        {
            "text": "But we’ll continue to work towards our goal until November 2023, when 10% biodiversity net gain is mandated, and beyond."
        },
        {
            "heading": 2,
            "text": "Adapting to change – and what’s next for BNG"
        },
        {
            "text": "Summer 2022 saw the biggest shift in the digital services programme approach. Since running BNG service design workshops to solve the key challenges across the whole service, we have restructured the teams to take more of a focus on the needs and journeys of different user groups. This change means we can look further across the whole journeys for different users and less at isolated tasks they will be required to complete."
        },
        {
            "text": "Another hope is that by aligning on these challenges we are more easily able to streamline the data we are collecting from the start."
        },
        {
            "heading": 2,
            "text": "Helping shape policy"
        },
        {
            "text": "We work closely with Defra and Natural England policy teams. As the secondary legislation continues to be drafted, we have fed in what have learned regarding what our service users need to complete BNG in the hope of removing potential barriers."
        },
        {
            "text": "We have some upcoming challenges - what users want and need can be different to what they are legally and legislatively required to do. That's not uncommon of course, and we are aware of these areas. We do need to learn more about the impact on users of not meeting those needs and mitigate and lessen that impact where possible."
        },
        {
            "text": "We want to make sure that any needs or expectations which our digital service can’t meet, will be met by a different service, or that we have designed for this as far as possible in our service."
        },
        {
            "text": "One positive policy shift for our service and the register is that we can now meet an important need for landowners. Habitat units that are not sold to a developer or allocated to a development can be included in the register. This means that Gain Sites can be registered, and units can be banked ready for allocation to a development. We are hoping this offers substantial value to landowners and habitat banks as we will allow evidence of gains and unallocated units before allocation to a development."
        },
        {
            "text": "Another positive outcome of unallocated units being included on the register is that people could search through the public register for biodiversity gain sites in an area and what habitat types have or haven’t been allocated on them."
        },
        {
            "heading": 2,
            "text": "Gathering insight from our users"
        },
        {
            "text": "The entire BNG Digital Service team is working hard to make the process of recording biodiversity net gain as easy as possible. Our wonderful user researchers continue to gather user’s input to make sure that what we build is user led."
        },
        {
            "text": "Our user research continues until mandatory BNG in November 2023, and more in-depth user testing is constantly being carried out to ensure that we are building the service to be as accessible as possible. BNG is a great opportunity to make a real difference in nature’s recovery and we know that by working with our users, we can build a service that serves them and nature."
        }
    ]
}