{
    "url": "https://mojdigital.blog.gov.uk/2023/05/22/managing-deputyships-with-digideps-a-collaborative-digital-solution/",
    "title": "Managing Deputyships with DigiDeps: A Collaborative Digital Solution",
    "authors": [
        "Alexander Pulley"
    ],
    "categories": [
        "collaboration",
        "DigiDeps",
        "digital solution"
    ],
    "pub_date": "2023-05-22T08:37:21+01:00",
    "content": [
        {
            "text": "My name is Alexander Pulley and I am a team leader within the Office of the Public Guardian (OPG)."
        },
        {
            "text": "Some of you might have heard of the OPG and some of you may even be our customers. At OPG, we ensure that people who have lost the mental capacity to manage their assets are still able to experience the benefits of those assets. We do this by giving another person the authority to manage the affairs of that affected individual. "
        },
        {
            "text": "A portion of our customers are ‘deputies’. This is where someone has lost mental capacity but has not yet appointed an LPA (Lasting Power of Attorney) to act on their behalf. A big part of being a deputy is reporting to the OPG every year. "
        },
        {
            "text": "Many of you reading this may have children, some of them might be teenagers. I would like you to imagine walking up to your David or Caroline, and asking them…"
        },
        {
            "text": " “Tomorrow, I need you to purchase me a car through the Motability scheme. I will need you to sell the family home and split the proceeds between me and your late mother’s estate. I will need you to manage an investment portfolio worth 1.5 million pounds…”"
        },
        {
            "text": "This was the reality for Daniel, a 19-year-old who had just started university whose Mother had died, and whose Father suffered serious brain damage due to an accident. The moment Daniel received the court authority to manage his father’s affairs, he was burdened with a serious responsibility. On top of this responsibility, he now has to send an annual financial report to the OPG, breaking down and categorising every transaction on behalf of his father. "
        },
        {
            "text": "This is where Justice Digital stepped in."
        },
        {
            "text": "Daniel’s busy life studying and managing his father’s affairs left him little time to account for all the transactions involved and collate them in time for the end of the year. Together with OPG, the Justice Digital team implemented a system called Digi Deps, which allows customers like Daniel to account for and keep records of payments digitally, meaning they can input information throughout the year. Daniel could now sign-in and input information every month, week, or even every day if that suited him. "
        },
        {
            "text": "I was Daniel’s case manager at the time, and due to his age, we used to have regular discussions. He would often talk about the weight lifting off his shoulders as he inputted the figures into the report every week. We joked about him having to complete this all at the end of the year, but the truth is this was the reality for all of our deputies before Digi Deps."
        },
        {
            "text": "Digi Deps is now our customer's number one way of reporting. If there are issues with the report, customers can sign in to amend it almost instantly."
        },
        {
            "text": "Most 19-year-olds are pursuing their passions at university and further exploring their interests. Daniel has gone through more than what most 19-year-olds must. However, there will be many Daniel's around the country now experiencing the benefits of the digital reporting service. Daniel’s story is evidence of the effectiveness of Justice Digital and how a small team has impacted a large part of our society in such a positive way."
        }
    ]
}