{
    "url": "https://insideDIO.blog.gov.uk/2023/05/22/respect-the-range-how-to-safely-access-mod-land-this-summer/",
    "title": "Respect the Range: How to safely access MOD land this summer",
    "authors": [
        "Lieutenant Colonel Adrian Hunter MBE"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Military Training",
        "Public safety"
    ],
    "pub_date": "2023-05-22T11:14:23+00:00",
    "content": [
        {
            "text": "A team from DIO recently attended the South Downs National Park Authority’s ‘Secrets of the Heath’ festival in Hampshire, to speak to festival-goers and promote safe public access to the Defence Training Estate (DTE)."
        },
        {
            "text": "The event took place at Hogmoor Inclosure, an old military tank training ground which today is just a stone’s throw away from numerous active training areas."
        },
        {
            "text": "The DTE includes a range of different military training areas within the south-east of England and across the UK. Many of these are right on the doorstep to densely populated areas and may offer public access, in accordance with the local byelaws. This means the military and public can come into close contact daily."
        },
        {
            "text": "As a result, the DIO Access and Recreation Advisory Team and the DTE South East Team have a vital role to play in engaging with the public to promote safe and compliant access to our estate."
        },
        {
            "heading": 2,
            "text": "Connecting with the public"
        },
        {
            "text": "The team decided to see if the presence of a serving soldier from the Household Cavalry would help boost interaction from members of the public and, not surprisingly, it did! Lots of children approached the soldier asking questions about the Army, and some even got to try on his ceremonial helmet. All were amazed at how heavy it was."
        },
        {
            "text": "Many adults spoke to us about their personal links to the military, whether they were veterans themselves or had a family member serving with the Armed Forces. It was brilliant to show family members some of the equipment their loved ones may be using daily."
        },
        {
            "heading": 2,
            "text": "The dangers of UXO and military debris"
        },
        {
            "text": "One of the key safety messages we’re highlighting is that the public should never touch any military debris or unexploded ordnance (UXO)."
        },
        {
            "text": "The soldier explained that although training troops will clear the area after their exercises have completed, sometimes items can be missed. He emphasised how hot these can be to handle and the serious injuries that can occur just by touching military debris."
        },
        {
            "text": "We urge the public never to remove UXO or military debris from its location as, in addition to the risks to personal safety, you may be committing an offence by doing so."
        },
        {
            "text": "If you come across UXO, follow these simple steps:"
        },
        {
            "text": "It will then be removed and disposed of safely."
        },
        {
            "heading": 2,
            "text": "Following flags and signage"
        },
        {
            "text": "Another important message is to read any signage, as it’s there to keep both the public and military personnel safe."
        },
        {
            "text": "Signage on our sites can tell you a lot about the area, such as active byelaws and rules in place because of them. Signage will also indicate a range of safety information specific to different sites, as well as showing where the public rights of way are. From driver training areas to live firing ranges, every site is different so reading the information displayed is very important."
        },
        {
            "text": "The team showed the public the new style of information boards that are being installed on different sites to make the information easier to read and understand. Lots of questions were asked about public access, which was brilliant as it demonstrated real interest and engagement."
        },
        {
            "text": "On live firing areas, you will also see red flags or lights displayed when the area is closed to the public, to protect their safety as well as that of training personnel. You can check military training times when planning your visit to see when areas will be closed."
        },
        {
            "text": "The DTE has a huge network of public rights of way and permissive paths which can be used for recreation purposes when safe to do so. We ask the public to stay on these tracks unless stated otherwise and to keep their dogs under close control. It’s important to remember that just because you can’t see military training happening, that doesn’t mean it’s not taking place."
        },
        {
            "text": "To sum up, the key messages to take away are:"
        },
        {
            "text": "If we all work together to use these shared spaces with respect and consideration, the public will be safe and our Armed Forces will be protected when conducting their vital training."
        },
        {
            "text": "It was really encouraging to see the positive engagement the team generated at Hogmoor Inclosure. We’re planning to run further public education events with the support of Service personnel, whose first-hand experiences are invaluable in promoting public safety on the MOD estate. Keep an eye on our blog for future updates."
        }
    ]
}