{
    "url": "https://ukhsa.blog.gov.uk/2023/05/22/staying-well-when-travelling-abroad-this-summer/",
    "title": "Staying well when travelling abroad this summer",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-05-22T12:51:46+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Dr Shreya Singhal is currently practicing as a junior doctor and Academic Foundation Trainee working in West London, as well as being a keen backpacker. She has worked in Infectious Diseases and General Practice and has shared her top tips for people looking to travel this summer."
        },
        {
            "text": "Lots of people will be travelling abroad this year. I’ve written this blog as a handy guide on how to travel safely and minimise risks to your health, these tips can be applied by those setting off for an adventure of a lifetime or those just seeking a week of summer sunshine."
        },
        {
            "text": "The risks to your health vary depending on the type of trip you’re going on – so whether you’re off for a week of sunbathing or taking a lengthier backpacking trip, it’s worth being prepared. It’s important to check your destination before you travel and be prepared by staying up to date with the latest outbreaks and events."
        },
        {
            "heading": 2,
            "text": "Before you travel"
        },
        {
            "text": "Vaccinations/pre-medications"
        },
        {
            "text": "Before you travel, it is vital to ensure you are up to date with your UK vaccination schedule, both for your protection and for the benefit of the health of the those around you."
        },
        {
            "text": "Many countries have different diseases circulating and some of these could potentially be dangerous. It’s possible to pick up an illness that we don’t routinely see in the UK, and important to remember that some can have serious consequences for vulnerable people."
        },
        {
            "text": "Viruses such as measles is more common in some parts of Africa, Asia and the mainland Europe, so please check that you are up to date with your childhood vaccine schedule."
        },
        {
            "text": "You may need additional vaccinations and preventative medications for the countries you are visiting. For example, if you’re visiting parts of rural Asia and the Far East Japanese encephalitis may be a risk , and  the vaccination may be recommended."
        },
        {
            "text": "There are also places where the rabies vaccination may be needed and; for malaria risk areas, you may need to take malaria prevention tablets; it’s important to bear in mind that some countries require proof of yellow fever vaccination even if there is no risk of infection."
        },
        {
            "text": "Always check your country of travel for recommended vaccinations, review the NHS Advice on Travel Vaccinations and keep a close eye on outbreaks in your country of travel."
        },
        {
            "text": "For advice on vaccinations and preventative medicines, you can contact your local travel health clinic or GP surgery. With most vaccines it is advised you arrange your vaccination 4-6 weeks before you arrive at your destination."
        },
        {
            "text": "Other factors to consider"
        },
        {
            "heading": 2,
            "text": "During your travel"
        },
        {
            "text": "General health measures"
        },
        {
            "text": "Whilst abroad, especially in more remote/rural places, be considerate of hand hygiene, your water supply, food safety, sun exposure, and your sexual health."
        },
        {
            "text": "Be sure to pack condoms, suncream and hand sanitiser before you leave and where possible drink bottled water and wash your hands with soap and warm water after using the toilet and before eating. For general advice, this helpful blog covers top tips for each of these."
        },
        {
            "text": "It’s more common in some countries but traveller’s diarrhoea, which results from consuming unsafe food/water, is something to be aware of. You can have quite significant fluid loss from this, so if you experience these symptoms whilst travelling, it is a good idea to take lots of rest, drink plenty of bottled fluids - if possible topped up with rehydration salts (If you feel particularly unwell, seek medical attention whilst abroad as you may require medical treatment for dehydration)."
        },
        {
            "text": "Particular diseases worth being aware of"
        },
        {
            "text": "Mosquito bites are a particular risk, and can cause malaria, dengue, chikungunya, amongst many other diseases. Mosquito bite avoidance advice includes wearing long-sleeved clothing to cover exposed skin, using repellents (at least 50% DEET), and mosquito nets."
        },
        {
            "text": "Suspected malaria is a medical emergency and must be quickly diagnosed and treated. If you visit a malaria risk country, which include countries in large areas of Africa, Asia and Central and South America, and have a fever, flu-like symptoms or any unusual symptoms during or after travelling you must get urgent medical attention. Don’t wait until you return to the UK if you are unwell."
        },
        {
            "text": " "
        },
        {
            "text": "Rabies is transmitted by a bite or scratch from an infected animal, usually a dog, and can be fatal if not recognised, or because post-exposure treatment is not available."
        },
        {
            "text": "Avoid animal bites, and check if you would benefit from a pre-exposure vaccine. All travellers who have a possible exposure to the rabies virus, whether by bites, scratches, or other means, should seek medical advice without delay. You can find full rabies advice here."
        },
        {
            "heading": 2,
            "text": "Sexual health"
        },
        {
            "text": "Practicing safer sex whilst abroad will reduce the risk of STIs and HIV, as well as infections that spread through close personal contact such as mpox."
        },
        {
            "text": "You can reduce your risk by using condoms and having an open conversation about HIV, STIs and Mpox before any sexual contact, and avoid sharing items such as towels, clothing or bedding with someone who has mpox or mpox symptoms."
        },
        {
            "text": "Mpox is a virus which can be spread from an infected animal to a person, or by close personal contact with a person with Mpox or materials where a person has shed the virus."
        },
        {
            "text": "Symptoms include fever, headache, muscle ache, joint pain, and a rash with scabs which often begins on the face then spreads to other parts of the body which can include the mouth, genitals and anus (considered contagious until all scabs fall off and skin is intact)."
        },
        {
            "text": "In 2022, there was an international outbreak of mpox across more than 100 countries, where mpox was spread during sexual contact, particularly among men who are gay, bisexual or have sex with other men, and some countries are still reporting new infections."
        },
        {
            "text": "Those at risk, including those who have been in contact with someone who has mpox, may be able to get the mpox vaccination. More information can be found here."
        },
        {
            "text": "If you have had condomless sex whilst abroad, get yourself tested for STIs before having sex with anyone else – depending on where you live you could get a self-sampling kit or simply attend your local sexual health clinic."
        },
        {
            "heading": 2,
            "text": "Returning to the UK"
        },
        {
            "text": "When you return to the UK, if you feel unwell, seek medical attention and ensure you inform your healthcare provider that you have been travelling recently."
        }
    ]
}