{
    "url": "https://food.blog.gov.uk/2023/05/22/what-can-you-expect-during-a-food-business-inspection-an-environmental-health-officer-explains/",
    "title": "What can you expect during a food business inspection? An Environmental Health Officer explains",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-05-22T10:06:54+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Luke, an Environmental Health Officer from Gwynedd Council in Wales, who talked to us about how he helps food businesses be safe and successful. "
        },
        {
            "text": "“I’d really recommend environmental health as a degree and a career – it’s interesting, challenging and rewarding, and every day is different”"
        },
        {
            "text": "After completing a degree in environmental health at Cardiff Metropolitan University, I became an Environmental Health Officer. I have been doing this for 20 years and have worked for several local authorities in England and Wales. Working in environmental health is great, each day is different and has a new challenge. Environmental health is a broad field, so you have to make sure you are up to speed with the latest professional developments, so you’re always learning something new."
        },
        {
            "text": "When I inspect businesses, I am there to assess the business and identify any food safety risks. I assess how the business complies with food safety requirements as well as the quality of food safety management processes. I give business owners information and advice to help educate them and teach them processes and methods that will help ensure that their food is safe."
        },
        {
            "text": "“I always recommend that food businesses reach out before they open, so I can offer advice at the planning stage”"
        },
        {
            "text": "My role isn’t just about inspections, I support businesses at all times and they’re welcome to give me a call or an email to ask for advice. I get a lot of business owners checking what they need to do to comply with x, y and z. This gives me faith that they are really thinking about their responsibilities."
        },
        {
            "text": "I always recommend that businesses reach out before they open to the public, so I can offer advice at the planning stage. I direct them to Gwynedd Council’s website for further information and I suggest they check out the FSA’s website."
        },
        {
            "text": "“It’s quite normal to be nervous about inspections. But there’s nothing to worry about!”"
        },
        {
            "text": "I understand how businesses must feel at inspections, as if they’re under a magnifying glass, but I’m always professional and ensure that things run smoothly. I make it clear that they can ask questions throughout, and I make sure to explain everything to them and give reasons for any issues. There’s total transparency."
        },
        {
            "heading": 2,
            "text": "Inspections and visits"
        },
        {
            "text": "We know new businesses in particular are eager to know what to expect for their first inspection, so we asked Luke to give us an overview of what an inspection or visit entails."
        },
        {
            "text": "Most businesses won’t know when I’m going to turn up for an inspection, but it’s great if they can be prepared with any questions or highlight any areas of uncertainty so that we can look at them together."
        },
        {
            "text": "When I arrive, I explain who I am and what I’m there to do. I’ll then start assessing their processes and procedures, such as how they prevent cross-contamination. I also look at the structure of the building and the food preparation areas including fridges, handwashing sinks and how they wash items. I look at the business management side of things like Safer Food, Better Business (SFBB) and Hazard Analysis and Critical Control Point (HACCP) documentation, and if staff training is up to date."
        },
        {
            "text": "While all of this is happening, the business is open and trading as usual. It’s important we see first-hand what their methods and processes are. I’ve done several inspections where the business is very busy, and I always find ways to work around the pressures as best I can."
        },
        {
            "text": "“The biggest question I get asked is straight after the inspection: “What’s our score?””"
        },
        {
            "text": "Unfortunately, I can’t confirm the rating straight away as I need to review my evidence. But, as I am committed to transparency, the business will already be aware of any areas of concern, so they’ll have a fairly good idea if the inspection has gone well or not. Another popular question I get asked is if they should be aware of any changes to food safety advice or new training. I’ll give advice and signpost to guidance online."
        },
        {
            "text": "After the visit and once I’ve reviewed my evidence, I will follow up with a letter to the business confirming their rating and any areas for improvement. If there were any issues, I will have raised these during the inspection, so there are no surprises. The letter will outline any improvements they need to make and a timeline. I may revisit the business if there are any issues which require a follow-up."
        },
        {
            "text": "I always encourage food businesses to be proactive in their knowledge of food safety. Food safety advice can change over time, so it’s important that businesses take responsibility. If there’s a significant change in advice, for example the introduction of allergen labelling for Pre-Packaged for Direct Sale (PPDS) food, we send a letter to businesses with information and links to relevant guidance. We also make sure to keep the advice on our website up to date. I always advise businesses to register for updates on the FSA website, especially recall alerts."
        },
        {
            "text": "“Businesses need to be completely open and honest with me during inspections”"
        },
        {
            "text": "When a food business registers, we send them an information pack which tells them all about the Food Hygiene Rating Scheme (FHRS). It’s important that businesses work through the pack and take appropriate steps before their inspection. I visit lots of businesses and have picked up tips and examples of best practice, which I can share with businesses who ask for advice."
        },
        {
            "text": "During an inspection, we’re there to ensure the overall safety of the consumer and it’s in everyone’s best interest for the business to do well. I’ve had a lot of feedback from businesses that say they’ve benefitted from the inspection experience. It’s allowed them an opportunity to take stock, assess their food safety methods and identify areas for improvement. Many business owners say that our feedback during an inspection is invaluable."
        },
        {
            "heading": 2,
            "text": "Further advice on preparing for an inspection"
        },
        {
            "text": "If you’re planning to start or are currently running a food business, we want to make it easier for your to do the right thing and keep your customers safe. Find details of your local authority, register your business and visit our Business Guidance Hub to find a range of advice, guidance and training for Food Business Operators."
        },
        {
            "text": "Want to find out more about what an Environmental Health Officer would look for during an inspection? Take a look at our food safety management system known as Safer Food Better Business."
        },
        {
            "text": "CYMRAEG"
        },
        {
            "heading": 1,
            "text": "Beth allwch chi ei ddisgwyl yn ystod arolygiad busnes bwyd? Dyma Swyddog Iechyd yr Amgylchedd yn esbonio"
        },
        {
            "text": "Cawsom sgwrs â Luke, Swyddog Iechyd yr Amgylchedd o Gyngor Gwynedd, a soniodd am sut mae e’n helpu busnesau bwyd i fod yn ddiogel a llwyddiannus. "
        },
        {
            "text": "“Byddwn i wir yn argymell astudio iechyd yr amgylchedd fel gradd neu ei ddewis fel gyrfa – mae’n ddiddorol, heriol a buddiol ac mae pob diwrnod yn wahanol”"
        },
        {
            "text": "Ar ôl cwblhau gradd mewn iechyd yr amgylchedd ym Mhrifysgol Metropolitan Caerdydd, des i’n Swyddog Iechyd yr Amgylchedd. Rwyf wedi bod yn gweithio yn y maes hwn ers 20 mlynedd ac i sawl awdurdod lleol yng Nghymru a Lloegr. Mae gweithio ym maes iechyd yr amgylchedd yn wych, mae pob diwrnod yn wahanol ac yn cyflwyno heriau newydd. Mae iechyd yr amgylchedd yn faes eang, felly mae’n rhaid i chi wneud yn siŵr eich bod yn gyfarwydd â’r datblygiadau proffesiynol diweddaraf, a hynny er mwyn sicrhau eich bod chi bob amser yn dysgu rhywbeth newydd."
        },
        {
            "text": "Pan fydda i’n arolygu busnesau, rwy’n asesu’r busnes ac yn nodi unrhyw risgiau diogelwch bwyd. Rwy’n asesu sut mae’r busnes yn cydymffurfio â gofynion diogelwch bwyd yn ogystal ag ansawdd prosesau rheoli diogelwch bwyd. Rwy’n rhoi gwybodaeth a chyngor i berchnogion busnes i’w helpu i addysgu, yn ogystal â dysgu prosesau a dulliau iddynt a fydd yn helpu i sicrhau bod eu bwyd yn ddiogel."
        },
        {
            "text": "“Rwyf bob amser yn argymell bod busnesau bwyd yn cysylltu â mi cyn iddynt agor, fel y galla i gynnig cyngor ar y cam cynllunio”"
        },
        {
            "text": "Nid yw fy rôl yn ymwneud ag arolygiadau yn unig, rwy’n cefnogi busnesau ar bob cam ac mae croeso iddynt ffonio neu anfon e-bost ataf i ofyn am gyngor. Mae llawer o berchnogion busnesau’n cysylltu er mwyn gwirio beth sydd angen iddynt ei wneud i gydymffurfio â phob math o bethau. Rwy’n hyderus felly eu bod nhw wir yn meddwl am eu cyfrifoldebau."
        },
        {
            "text": "Rwyf bob amser yn argymell bod busnesau yn cysylltu â mi cyn agor i’r cyhoedd, fel y galla i gynnig cyngor ar y cam cynllunio. Rwy’n eu cyfeirio at wefan Cyngor Gwynedd am fwy o wybodaeth ac rwy’n awgrymu eu bod nhw’n edrych ar wefan yr Asiantaeth Safonau Bwyd (ASB)."
        },
        {
            "text": "“Mae’n eithaf normal bod yn nerfus am arolygiadau. Ond does dim angen poeni!”"
        },
        {
            "text": "Rwy'n deall bod busnesau'n gallu teimlo fel pe baen nhw o dan chwyddwydr yn ystod arolygiadau, ond rwyf bob amser yn broffesiynol ac yn sicrhau bod pethau’n rhedeg yn esmwyth. Rwy’n nodi’n glir eu bod yn gallu holi cwestiynau yn ystod yr arolygiad, ac rwy’n gwneud yn siŵr fy mod i’n esbonio popeth iddynt, gan roi rhesymau dros unrhyw faterion. Mae yna dryloywder llwyr."
        },
        {
            "heading": 2,
            "text": "Arolygiadau ac ymweliadau"
        },
        {
            "text": "Rydyn ni’n gwybod bod busnesau newydd yn arbennig yn awyddus i wybod beth i’w ddisgwyl o ran eu harolygiad cyntaf. Felly, gwnaethom ofyn i Luke roi trosolwg i ni o’r hyn sy’n digwydd yn ystod arolygiad neu ymweliad."
        },
        {
            "text": "Ni fydd y rhan fwyaf o fusnesau yn gwybod pryd y bydda i’n dod i gynnal arolygiad, ond mae’n wych os gallant fod yn barod ag unrhyw gwestiynau neu dynnu sylw at unrhyw feysydd o ansicrwydd fel y gallwn ni edrych arnynt gyda’n gilydd."
        },
        {
            "text": "Ar ôl cyrraedd, rwy’n esbonio pwy ydw i a beth fydda i’n ei wneud. Yna, bydda i’n dechrau asesu eu prosesau a’u gweithdrefnau, fel sut maen nhw’n atal croeshalogi. Rwyf hefyd yn edrych ar strwythur yr adeilad a’r ardaloedd paratoi bwyd, gan gynnwys oergelloedd, sinciau golchi dwylo a sut maen nhw’n golchi eitemau. Rwy’n edrych ar brosesau rheoli’r busnes, fel dogfennaeth Bwyd Mwy Diogel, Busnes Gwell (SFBB) a Dadansoddi Peryglon a Phwyntiau Rheoli Critigol (HACCP), ac a yw hyfforddiant staff yn gyfredol."
        },
        {
            "text": "Wrth i mi gynnal yr arolygiad, mae’r busnes ar agor ac yn masnachu fel arfer. Mae’n bwysig ein bod ni’n gweld drosom ein hunain pa ddulliau a phrosesau sydd ar waith. Rwyf wedi cynnal sawl arolygiad pan fo’r busnes yn brysur iawn, ac rwyf bob amser yn dod o hyd i ffyrdd o weithio o amgylch y pwysau yn y ffordd orau bosib."
        },
        {
            "text": "“Y cwestiwn mwyaf cyffredin a ofynnir i mi yn syth ar ôl yr arolygiad yw: “beth yw ein sgôr?””"
        },
        {
            "text": "Yn anffodus, alla i ddim cadarnhau’r sgôr ar unwaith gan fod angen i mi adolygu fy nhystiolaeth. Ond, gan fy mod i’n gweithredu mewn modd agored, bydd y busnes eisoes yn ymwybodol o unrhyw feysydd sy’n peri pryder. Felly, bydd gan y busnes syniad eithaf da os yw’r arolygiad wedi mynd yn dda ai peidio. Cwestiwn poblogaidd arall a ofynnir i mi yw a ddylent fod yn ymwybodol o unrhyw newidiadau i gyngor diogelwch bwyd neu hyfforddiant newydd. Rwy’n rhoi cyngor ac yn cyfeirio busnesau at ganllawiau ar-lein."
        },
        {
            "text": "Ar ôl ymweld â’r safle ac adolygu fy nhystiolaeth, bydda i’n anfon llythyr at y busnes yn cadarnhau ei sgôr ac unrhyw feysydd i’w gwella. Os oedd unrhyw faterion, bydda i wedi codi’r rhain yn ystod yr arolygiad, felly ni fyddant yn cael sioc. Bydd y llythyr yn nodi unrhyw welliannau y mae angen i’r busnes eu gwneud yn ogystal ag amserlen. Mae’n bosib y bydda i’n ymweld â’r busnes eto os oes unrhyw faterion y mae angen cynnal gwaith dilynol arnynt."
        },
        {
            "text": "Rwyf bob amser yn annog busnesau bwyd i fod yn rhagweithiol am eu gwybodaeth am ddiogelwch bwyd. Gall cyngor diogelwch bwyd newid dros amser, felly mae’n bwysig bod busnesau’n cymryd cyfrifoldeb. Os bydd newid sylweddol yn y cyngor, er enghraifft, cyflwyno labelu alergenau ar gyfer bwyd wedi’i becynnu ymlaen llaw i’w werthu’n uniongyrchol (PPDS), rydyn ni’n anfon llythyr at fusnesau gyda gwybodaeth a dolenni i ganllawiau perthnasol. Rydyn ni hefyd yn sicrhau bod y cyngor ar ein gwefan yn gyfredol. Rwyf bob amser yn cynghori busnesau i gofrestru i gael y newyddion diweddaraf ar wefan yr ASB, yn enwedig rhybuddion galw bwyd yn ôl."
        },
        {
            "text": "“Mae angen i fusnesau fod yn gwbl agored a gonest gyda mi yn ystod arolygiadau”"
        },
        {
            "text": "Pan fydd busnes bwyd yn cofrestru, byddwn ni’n anfon pecyn gwybodaeth atynt sy’n rhoi’r holl wybodaeth am y Cynllun Sgorio Hylendid Bwyd (CSHB). Mae’n bwysig bod busnesau’n gweithio drwy’r pecyn ac yn cymryd camau priodol cyn eu harolygiad. Rwy’n ymweld â llawer o fusnesau ac wedi gweld nifer o enghreifftiau o arferion gorau, a galla i rannu hyn â busnesau sy’n gofyn am gyngor."
        },
        {
            "text": "Yn ystod arolygiad, rydyn ni yno i sicrhau diogelwch cyffredinol y defnyddiwr ac mae llwyddiant y busnes o fudd i bawb. Rwyf wedi cael llawer o adborth gan fusnesau sy’n dweud eu bod nhw wedi elwa o’r profiad arolygu. Mae wedi rhoi cyfle iddynt bwyso a mesur, asesu eu dulliau diogelwch bwyd a nodi meysydd i’w gwella. Mae llawer o berchnogion busnesau’n dweud bod ein had both yn ystod arolygiadau’n amhrisiadwy."
        },
        {
            "heading": 2,
            "text": "Cyngor pellach ar baratoi ar gyfer arolygiad"
        },
        {
            "text": "Os ydych chi’n bwriadu dechrau busnes bwyd neu os ydych chi’n rhedeg busnes bwyd ar hyn o bryd, rydyn ni am ei gwneud hi’n haws i chi wneud y peth iawn a chadw eich cwsmeriaid yn ddiogel. Dewch o hyd i fanylion eich awdurdod lleol; cofrestrwch eich busnes; ac ewch i’n Hyb Canllawiau Busnes i ddod o hyd i amrywiaeth o gyngor, canllawiau a hyfforddiant i weithredwyr busnesau bwyd."
        },
        {
            "text": "Ydych chi eisiau gwybod mwy am yr hyn y byddai Swyddog Iechyd yr Amgylchedd yn chwilio amdano yn ystod arolygiad? Cymerwch gip ar ein system rheoli diogelwch bwyd o’r enw Bwyd Mwy Diogel Busnes Gwell."
        }
    ]
}