{
    "url": "https://food.blog.gov.uk/2022/08/04/chairs-stakeholder-update-how-the-fsa-is-supporting-free-trade-agreements/",
    "title": "Chair's stakeholder update - How the FSA is supporting Free Trade Agreements",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-08-04T15:18:55+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Since my last message to you, the FSA has been fulfilling the post-Brexit watchdog role that we set out in our new strategy."
        },
        {
            "text": "The Government has just published its report on the UK-New Zealand Free Trade Agreement (FTA), which includes advice from the FSA and Food Standards Scotland (FSS) on what the agreement means for the statutory protections in place for food safety and nutrition in the UK. We also provided a similar assessment for the report on the UK-Australia FTA published in June. Both reports were prepared by the Department of International Trade (DIT) and presented to the UK Parliament."
        },
        {
            "text": "Our assessment for both of these trade deals, which you can read in the annexes of the respective reports, is that they maintain the statutory protections we have in place in the UK."
        },
        {
            "text": "We’re grateful to the consumer groups and other interested parties who provided their views as we developed our advice. If you would like to share your views before we advise on future relevant FTAs, please get in touch at FTAscrutiny@food.gov.uk."
        },
        {
            "text": "We also recently published our inaugural annual report on the UK’s food standards. Written jointly with Food Standards Scotland, the report provides an independent assessment of the state of the nation’s plate. The report concludes, with a degree of caution, that despite the significant pressures of COVID-19 and EU Exit food standards in the UK have largely been maintained, but with challenges ahead. Future reports will also consider broader standards linked to production such as animal welfare and sustainability, and questions related to national food security."
        },
        {
            "text": "If you have any thoughts or questions about the findings in our report, or our advice on FTAs, please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "Neges gan yr Asiantaeth Safonau Bwyd i randdeiliaid"
        },
        {
            "heading": 3,
            "text": "Yr Athro Susan Jebb, Cadeirydd yr Asiantaeth Safonau Bwyd "
        },
        {
            "text": "Ers fy neges ddiwethaf, mae'r Asiantaeth Safonau Bwyd (ASB) wedi bod yn cyflawni ein cyfrifoldebau fel corff gwarchod ôl-Brexit, yn unol â’r hyn a nodwyd gennym yn ein strategaeth newydd."
        },
        {
            "text": "Mae’r Llywodraeth newydd gyhoeddi ei hadroddiad ar y Cytundeb Masnach Rydd rhwng y DU a Seland Newydd, sy’n cynnwys cyngor gan yr ASB a Safonau Bwyd yr Alban ar yr hyn y mae’r cytundeb yn ei olygu ar gyfer y mesurau diogelu statudol sydd ar waith ar gyfer diogelwch bwyd a maeth yn y Deyrnas Unedig. Gwnaethom hefyd ddarparu asesiad tebyg ar gyfer yr adroddiad ar y cytundeb masnach rydd rhwng y DU ac Awstralia a gyhoeddwyd ym mis Mehefin. Paratowyd y ddau adroddiad gan yr Adran Masnach Ryngwladol (DIT) a’u cyflwyno i Senedd y DU."
        },
        {
            "text": "Rydym o’r farn bod y ddau gytundeb masnach hyn, y gallwch eu darllen yn yr atodiadau i’r adroddiadau priodol, yn cynnal yr amddiffyniadau statudol sydd ar waith gennym yn y DU."
        },
        {
            "text": "Rydym yn ddiolchgar i'r grwpiau defnyddwyr a phartïon eraill â buddiant a roddodd eu barn wrth i ni ddatblygu ein cyngor. Os hoffech chi rannu eich barn cyn i ni roi cyngor ar gytundebau masnach rydd perthnasol yn y dyfodol, cysylltwch â FTAscrutiny@food.gov.uk."
        },
        {
            "text": "Yn ddiweddar hefyd, gwnaethom gyhoeddi ein hadroddiad blynyddol cyntaf ar safonau bwyd y DU. Mae’r adroddiad, a luniwyd ar y cyd â Safonau Bwyd yr Alban, yn darparu asesiad annibynnol o gyflwr bwyd y genedl. Mae’r adroddiad yn dod i’r casgliad gofalus fod safonau bwyd yn y DU wedi’u cynnal i raddau helaeth, er gwaethaf y pwysau sylweddol a achoswyd gan COVID-19 ac Ymadael â’r UE. Serch hynny, mae heriau o’n blaenau. Bydd adroddiadau yn y dyfodol hefyd yn ystyried pryderon defnyddwyr am safonau ehangach sy’n gysylltiedig â chynhyrchu, fel lles anifeiliaid a chynaliadwyedd, a chwestiynau am ddiogeledd bwyd cenedlaethol."
        },
        {
            "text": "Os oes gennych chi unrhyw sylwadau neu gwestiynau am y canfyddiadau yn ein hadroddiad neu ein cyngor ar gytundebau masnach rydd, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}