{
    "url": "https://valuationoffice.blog.gov.uk/2022/08/04/how-we-value-small-shops/",
    "title": "How we value:  Small Shops",
    "authors": [
        "voadigitalpublishing"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2022-08-04T09:42:13+01:00",
    "content": [
        {
            "text": "Paul Dalling is a National Valuation Lead in the VOA. One of his roles is to advise on the valuation of small shops in England and Wales. In this blog, Paul explains what is involved in valuing these properties."
        },
        {
            "text": " "
        },
        {
            "text": "Small Shops"
        },
        {
            "text": "Small shops are defined as any shop less than 1,850m² (or 20,000 ft²). There are around 500,000 small shops in England and Wales – accounting for £11.5bn worth of rateable value in 2017."
        },
        {
            "text": "Typically, they are occupied by retailers of fashion, homeware, food and beverage."
        },
        {
            "text": " "
        },
        {
            "text": "Factors to Consider"
        },
        {
            "text": "When approaching the task of valuing a small shop, the actual rent paid on the property is a good starting point, but this doesn’t always tell us the full story. For example:"
        },
        {
            "text": " "
        },
        {
            "text": "To help build our picture of the property, we measure small shops to ‘net internal area’ (NIA). The NIA is the useable area inside a building. It excludes things like stairwells; pillars; lift shafts; and staff toilets. Dividing the rent by this area gives a price per square metre, which is useful as it helps us to compare one shop with another."
        },
        {
            "text": " "
        },
        {
            "text": "Zoning"
        },
        {
            "text": "Small shops are very location sensitive, but we would expect those of a similar size and in a similar location to be valued at the same rate per square metre. However, shops are unlikely to be exactly the same size, so we use a method called ‘zoning’ to take these different factors into account."
        },
        {
            "text": "We divide the shop into 6.1 metre (20 foot) ‘zones’, starting with ‘zone A’ at the window. This is the most valuable part of the shop; it’s where customers are attracted and tempted in. We use ‘zoning’ to arrive at an ‘area in terms of zone A’ for each comparable shop."
        },
        {
            "text": "‘Zone B’ is in the middle of the shop and is half as valuable as zone A. The deeper into the shop you go, the less valuable the floor space. ‘Zone C’ is half as valuable again as zone B. If the shop goes back any more than zone C (or 18.3m), the rest of the shop floor is called ‘the remainder’, which is half the value of zone C."
        },
        {
            "text": "The reason we divide shops into zones is that a customer looking in through the window of a shop will see the goods on display at the front with greater ease than goods to the rear of the shop. A customer entering the shop is also more likely to stay near the front of the shop than venture to the rear. Using ‘zoning’ is currently the best way to interpret the approach a retailer takes when considering what rent to pay."
        },
        {
            "text": "Adjusting and Analysing Rents"
        },
        {
            "text": "Once we have gathered all the evidence, we make adjustments to the rent. We consider the actual rent paid and adjust this to take into account the ‘factors to consider’ discussed above. We then divide this ‘adjusted rent’ by the area of valuable Zone A. This is an analysis of the rent, based on the relevant ‘area in terms of zone A’."
        },
        {
            "text": " "
        },
        {
            "text": "Making an Accurate Valuation"
        },
        {
            "text": "After analysing all the rents available, we can determine a ‘tone of value’ for a group of similarly sized shops in a similar location. This is more than just an average; it gives greater weight to rents agreed closest to the valuation date. We can then apply that ‘tone’ at the valuation stage."
        },
        {
            "text": "Having valued a particular shop, we may need to make additions or allowances for things not reflected in the ‘tone’ of rents. For example, the tenant may have added air conditioning, or the shop may be on a corner with a sales window on two different streets, which could add value."
        },
        {
            "text": "Conversely, the approach to the shop may be hampered by a flight of stairs or the shape of the shop might mask part of the sales area. We may decide that such a disadvantage requires an allowance."
        },
        {
            "text": "The overall goal is to determine a rateable value that reflects an estimate of rent that would be reasonable for a particular small shop in a particular location at the relevant valuation date."
        }
    ]
}