{
    "url": "https://educationhub.blog.gov.uk/2022/08/how-do-international-students-access-uk-universities/",
    "title": "How do international students access UK universities?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2022-08-04T15:48:38+01:00",
    "content": [
        {
            "text": "The UK higher education system is amongst the best in the world with British universities regularly ranked among the top establishments worldwide for teaching and research."
        },
        {
            "text": "Obviously, this is fantastic for people who live in the UK, but it also means this country’s universities are attractive to people from overseas and we want them to be able to benefit from and contribute to our world leading establishments too."
        },
        {
            "text": "International students enrich the university experience for all students, including those from the UK themselves. They bring greater diversity to university and college campuses adding an international dimension. For both international and domestic students, this cultural exchange helps build life-long friendships, future networks, and important business, political and diplomatic bridges."
        },
        {
            "text": "Our commitment to welcoming international students is set out in the International Education Strategy, which has an ambition to host at least 600,000 international education students in the UK each year by 2030."
        },
        {
            "text": "We are proud that so many international students choose to study here each year, and our HE providers are looking forward to welcoming them in the new academic year."
        },
        {
            "text": "Here we answer some of your questions about how the UK system welcomes students from abroad."
        },
        {
            "heading": 3,
            "text": "How do international students access UK universities?"
        },
        {
            "text": "For international undergraduate students, the application process is the same as for UK students."
        },
        {
            "text": "First, they decide on the course and university they want to study at then they apply – sometimes through the University and College Admission Service (UCAS) like domestic students or by applying directly to the university through agencies. Their chosen university will look at their application and decide whether to make a conditional offer (where the applicant will have to achieve certain grades) or an unconditional offer (where the place is guaranteed)."
        },
        {
            "text": "Most UK based students will get a student loan to help pay for their tuition fees and other expenses, but the majority of international students must prove they have enough money to pay for their course and support themselves in the UK before being granted a visa to study in the UK. Some students might access loan systems through their home countries to support their studies and some may also apply for partial scholarships or bursaries from their selected institutions or external organisations."
        },
        {
            "text": "Alongside the financial requirements of studying in the UK, there are other steps students need to comply with to be granted a student visa to be able to come to the country to study. You can find out more here. This includes holding a certain level of English."
        },
        {
            "heading": 3,
            "text": "How many international students are there at UK universities?"
        },
        {
            "text": "There were 605,130 international students in the UK in 2020/21. Of these, 152,905 are from the EU (25%) and 452,225 are from outside the EU (75%). This compares with 2,146,475 for the total number of UK domestic students. International students make up around 22% of the student population."
        },
        {
            "heading": 3,
            "text": "What are the benefits for UK universities from international students coming here to study?"
        },
        {
            "text": "International students make a significant economic and cultural contribution to the UK’s higher education sector as well as to the wider economy and country."
        },
        {
            "text": "In 2019, international students at UK universities generated an estimated £15.8 billion in exports through living expenditure and tuition fees, up from £14.2 billion in 2018. Their economic impact has been valued at £28.8 billion to the UK per year."
        },
        {
            "heading": 3,
            "text": "Do universities prioritise international students for places?"
        },
        {
            "text": "Universities allocate and offer places to students in separate streams – for those who are from the UK and for those that are from overseas. It is a myth that offering a place to an international student takes away a place from a student from the UK."
        },
        {
            "text": "Most universities have separate home and international student recruitment targets, set before the admissions cycle even begins."
        },
        {
            "text": "Universities plan their student numbers carefully, not least because there are important implications for the provision of student support and wellbeing services, accommodation, and everything else needed to deliver the best student experience."
        },
        {
            "text": "While we know that international students make an important contribution to the diversity of our universities, we also know that the number of UK students studying across the country is going up, not down. This has been the case for the last five academic years. Last year, over two million UK students were studying for a higher education qualification in this country. UK students take up the vast majority of places on university undergraduate courses, accounting for 84.3% of the undergraduate student population."
        }
    ]
}