{
    "url": "https://space.blog.gov.uk/2022/08/04/meeting-my-inspiration-how-a-moment-started-my-career/",
    "title": "Meeting my inspiration: how a moment started my career",
    "authors": [
        "Libby Jackson"
    ],
    "categories": [
        "Careers",
        "People"
    ],
    "pub_date": "2022-08-04T14:05:32+01:00",
    "content": [
        {
            "text": "I’m often asked when I first became interested in space. It’s difficult to pinpoint, but, for as long as I can remember, I’ve been captivated by the wonders of the night sky and the adventures of those who’ve flown among them. "
        },
        {
            "text": "However it started, the journey from that early interest to my role at the UK Space Agency today has brought moments that I will remember for the rest of my life.   "
        },
        {
            "text": "My first space experience came when my school physics teacher announced an opportunity to join a week-long “space school” at Brunel University. I asked (begged) my mum to go, then enjoyed a week meeting like-minded young people and trying to launch and land a raw egg spacecraft. "
        },
        {
            "text": "Discovering that space wasn’t just something that the Americans did and that we were building spacecraft in the UK, it occurred to me, for the first time, that perhaps I could get a job in the field I found so fascinating. "
        },
        {
            "text": "A few years later, in 1998, I was in my final year of school and organising a work shadowing placement. "
        },
        {
            "text": "Still convinced that human spaceflight was only possible on the other side of the Atlantic, I declared to my friends in the sixth form common room that I wanted to work for NASA. My friend, Sally, had the same idea, so we hatched a daring plan together. "
        },
        {
            "text": "Using the adage that, if you don’t ask, you don’t get, we emailed NASA to ask for a placement. To my amazement, Sally came to school weeks later with the exciting news that NASA had replied, and accepted our request. "
        },
        {
            "text": "More pleading ensued with my wonderful mother, who found the means to make it happen. "
        },
        {
            "text": "Our two-week adventure included a fantastic tour of the Johnson Space Centre in Houston, Texas. We went behind the scenes in the neutral buoyancy lab, where astronauts train for spacewalks, we met scientists working on ways to grow crops in space and futuristic propulsion techniques, and we saw the facility where the precious Apollo lunar samples are stored.\n"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Mission control "
        },
        {
            "text": "But the part I remember above all others was the time I spent in mission control. "
        },
        {
            "text": "As a teenager, I devoured stories of mission control during the early years of American human spaceflight; of Gene Kranz, Chris Craft and their band of men (always men) who worked out how to keep astronauts alive in space and solve problems from the ground, with just occasional voice contact and a stream of numbers from early computers. "
        },
        {
            "text": "I spent several hours in the mission operations control room with a lovely young flight controller called Cathy Larson, listening in as the team simulated problematic Shuttle launches and discerned whether the crew could make it safely into orbit or should attempt risky landings. "
        },
        {
            "text": "I loved every second of it. I had my photo taken in the Flight Director’s chair, and knew I wanted to sit there one day. "
        },
        {
            "text": "I returned with a mind full of memories, excitement and a mad, but very clear, goal to work in mission control.  "
        },
        {
            "text": "The only plan I had to make it happen at that point was to find an unsuspecting American, make them fall in love with me so that we could marry, and I could get a green card to live happily ever after in Houston, while figuring out how to work at NASA.\n"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The European Space Agency and Tim Peake"
        },
        {
            "text": "Unsurprisingly, that plan didn’t quite take off, and I landed my first graduate space job in the UK, installing and operating a satellite control centre at Airbus. But when I learned that the European Space Agency was readying its contribution to the International Space Station (ISS), my dream of working in mission control came alive again. "
        },
        {
            "text": "I managed to get a job as a flight controller for the ISS and settled into my console position, with the memories of my time in Houston with Cathy right beside me. "
        },
        {
            "text": "Some years later, I did indeed become a flight director. "
        },
        {
            "text": "As my career evolved, so did the UK’s position on human spaceflight, and in 2015 we witnessed the flight of the UK’s second astronaut, Tim Peake. "
        },
        {
            "text": "Determined to play my part in Tim’s Principia mission to the ISS, I was delighted when the UK Space Agency hired me to manage the UK’s education and outreach activities. I now manage UK activities in human spaceflight and oversee UK science activities on the ISS, as well as lunar and Mars missions.  "
        },
        {
            "text": "That trip to Houston, and my time with Cathy, started it all.\n"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Meeting Cathy again"
        },
        {
            "text": "My early internet searches to find Cathy and thank her got nowhere, but when NASA announced Catherine Koerner as new manager for the Orion programme – the spacecraft that will return humans to the Moon – in 2020, I thought of her again and had one more go at tracking her down. "
        },
        {
            "text": "Incredibly, I found an article in a local US newspaper describing Cathy Koerner as the daughter of Al Larson. After 22 years, I’d found her. "
        },
        {
            "text": "More internet sleuthing led to her email address, and I messaged her in hope that our paths might cross again. "
        },
        {
            "text": "Last month, they did. The UK Space Agency hosted NASA’s Moon To Mars workshop at London’s Royal Institution and I was part of the UK delegation. Glancing through the agenda, I got goosebumps. Chairing one of the sessions was none other than Catherine Koerner. "
        },
        {
            "text": "Finally, I could close the circle and say thank you to the person who gave me one of the most precious memories of my career. Even now, it was another moment that I will never forget. "
        },
        {
            "text": "Every day, professionals in all industries spend moments with young people, and each one is a memory that lands in their consciousness like seeds scattered from a tree. Sometimes, these memories take root, encouraging the next generation to move things forward and lead the way. Share your experiences, and you might just get an email in 20 years, too. "
        }
    ]
}