{
    "url": "https://companieshouse.blog.gov.uk/2022/08/04/our-new-powers-a-milestone-year-at-companies-house/",
    "title": "Our new powers: a milestone year at Companies House",
    "authors": [
        "Louise Smyth - Chief Executive and Registrar of Companies"
    ],
    "categories": [
        "Companies House transformation"
    ],
    "pub_date": "2022-08-04T12:25:54+01:00",
    "content": [
        {
            "text": "I am delighted to publish our corporate plan for 2022-23 which outlines what we aim to achieve in what will be one of the most significant years for Companies House since it was created in 1844."
        },
        {
            "text": "The world changed when Russia invaded Ukraine. At the end of February, the government introduced the Economic Crime (Transparency and Enforcement) Bill. The Bill was expedited through Parliament and as part of this legislation, we've developed a new Register of Overseas Entities (ROE)."
        },
        {
            "text": "Implementing this new, world-leading register has been our top corporate priority for 2022-23 and we've worked at pace with the UK’s 3 land registries to deliver it. We want to make sure that anonymous foreign owners of UK property reveal their identity, to ensure that criminals cannot hide behind shell companies and use UK property as a means to launder money or for other crime."
        },
        {
            "text": "For the first time we’ll know who owns these properties and land, and we’ll have enforcement powers to place sanctions on anyone who doesn’t comply. These will include restrictions on their land or property, daily fines and even prison sentences."
        },
        {
            "text": "The Register of Overseas Entities will provide information for law enforcement agencies to help them to track down criminals using UK property as a money laundering vehicle. The register went live on 1 August 2022, and we expect the measures to have an immediate effect to deter those who are intending to buy UK property with illicit funds."
        },
        {
            "text": "But our milestone year doesn’t end there."
        },
        {
            "text": "The government also prioritised a wider legislative reform package for Companies House and timescales have been brought forward for a second Economic Crime Bill. This will give us the powers we need to play a more significant role in the fight against economic crime.  This legislation has been expedited by the government in recognition of the real difference we can make at Companies House. We’ve been working in partnership with BEIS on the proposed changes and developing policies to support them, as well as instructions for parliamentary lawyers and advice for ministers."
        },
        {
            "text": "These new powers will enable us to work more closely with law enforcement agencies to prevent the use of UK companies and other corporate structures as vehicles for facilitating international money laundering, corruption, terrorist financing and illegal arms movements."
        },
        {
            "text": "We will be implementing a new ID verification process which will help deter those wishing to start companies for illegal purposes. Anyone setting up, running, owning or controlling a company in the UK will need to verify their identity with Companies House to provide assurance that they are who they claim to be."
        },
        {
            "text": "We will also be able to challenge information submitted to Companies House and if a query is raised the company will need to provide evidence to resolve it or we’ll be able to take action such as annotating the register, removing material, or sending a penalty to the company. This will include being able to act to help individuals who are victim of identity theft whose details are used to set up companies, which causes so much anxiety and stress."
        },
        {
            "text": "These measures will also improve the quality of information which we publish, so that companies who rely on our register to make business decisions can trust that those decisions are based on stronger foundations."
        },
        {
            "text": "We have developed good relationships with law enforcement partners over the last few years and we already provide valuable intelligence for wide-ranging criminal investigations. We are keen to play a greater role but until now, we haven’t had the tools to go even further to prevent the misuse of corporate entities."
        },
        {
            "text": "These large-scale reforms will give us the powers to do that. These measures combined will ensure that the UK continues to be a great place to do business, while taking a tough stance against economic crime and the misuse of corporate entities."
        },
        {
            "text": "In addition to these new powers, our transformation continues, and our people are working to ensure our services run smoothly and company information is filed up to date."
        },
        {
            "text": "We can’t wait to work with our new powers and step up our involvement in the fight against economic crime."
        }
    ]
}