{
    "url": "https://forestrycommission.blog.gov.uk/2022/08/04/reducing-the-impact-of-deer-on-the-natural-environment-consultation-opens/",
    "title": "Reducing the impact of deer on the natural environment - consultation opens",
    "authors": [
        "Ian Tubby"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2022-08-04T12:40:04+01:00",
    "content": [
        {
            "text": "Wild deer, especially native species, are an important and valued part of our natural heritage. In England, due to several factors including land use changes and a lack of natural predators, deer density and distribution have dramatically increased over the last century, and at such levels pose a significant risk to our woodlands, other animals that rely on this environment and deer themselves."
        },
        {
            "text": "There are six species of wild deer in England: red and roe deer are native; fallow, sika, muntjac and Chinese water deer are introduced species. Populations of wild deer have been increasing rapidly over the last 40 years and may now be higher than at any time in the last 1,000 years."
        },
        {
            "text": "The pressure created by deer, as outlined below, needs to be reduced to allow woodlands and species which inhabit them to flourish, and to prevent economic damage to agricultural crops and trees managed for timber production. As such, the Forestry Commission and Defra are now seeking views on a new deer management strategy. Our aim is to ensure a well-managed and healthy wild deer population in England - a population which is in balance with its ecosystem and which mitigates the threat to long-term environmental or economic sustainability."
        },
        {
            "heading": 2,
            "text": "Impact of deer"
        },
        {
            "text": "Evidence of the negative effects caused by deer across the country is widespread. This includes:"
        },
        {
            "text": "Trees and woodlands are crucial to the government’s plans to achieve net zero emissions by 2050, halt nature’s decline by 2030, and bring nature closer to people to support their health and wellbeing. They can also play important roles in building flood resilience, and supporting rural economies, such as by supplying timber and wood products as renewable resources."
        },
        {
            "heading": 2,
            "text": "Deer welfare"
        },
        {
            "text": "High populations can in fact be harmful to the deer themselves, other animals and birds. Too many deer competing for food in the same area can leave the population malnourished and unhealthy and allow diseases to spread. Dense populations also can support spread of other disease and parasites affecting wildlife and humans."
        },
        {
            "text": "Deer-vehicle collisions also put both deer and human welfare at risk. There are over 70,000 such collisions in the UK annually, with an annual average of 20 human fatalities and between 400 and 1000 serious human injuries."
        },
        {
            "heading": 2,
            "text": "Deer management strategy"
        },
        {
            "text": "The 2021 England Trees Action Plan committed to a deer management strategy, led by the Forestry Commission, to manage the impact of deer on trees, woodland and agricultural crops in England, as well as safeguarding their potential benefits."
        },
        {
            "text": "The proposed strategy will set out key actions to:"
        },
        {
            "heading": 2,
            "text": "Four-week consultation"
        },
        {
            "text": "A four-week Defra consultation to seek views on the key proposals and actions to include in the final deer management strategy is now open. We welcome your thoughts."
        },
        {
            "text": "A wide range of proposals are covered including:"
        }
    ]
}