{
    "url": "https://ruralpayments.blog.gov.uk/2022/08/04/rpa-is-supporting-farm-24/",
    "title": "RPA is supporting Farm 24",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship"
    ],
    "pub_date": "2022-08-04T12:45:20+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "RPA is proudly supporting the Farm24 campaign."
        },
        {
            "text": "Through our interactions with our customers, stakeholders and rural communities, we’ve seen first hand how hard farmers in England work and the value they add to our lives."
        },
        {
            "text": "Farm24 shows the public l how proud we are to work for such an important industry; in the RPA we recognise farming and food production is not without its challenges and we support the celebration of everyone who contributes to all aspects of a thriving rural economy."
        },
        {
            "text": "Whether it’s processing a claim or application, working on developing new schemes or engaging with farmers through our networks or at shows and events, we are committed to championing the real outcomes farmers deliver. This includes producing the food we eat as well as restoring wildlife habitats and  keeping the character of the countryside, important parts of the work we support farmers to do and which have a benefit to everyone."
        },
        {
            "text": "Here’s what some of our people said:"
        },
        {
            "text": "“Growing up on a farm, I have a real appreciation for farming as a profession and a way of life. Farm24 is a great way to showcase the dedication and passion British farmers have for their work and I’m proud to support that as part of the RPA.” Kathryn, External Affairs."
        },
        {
            "text": "“I’ve been working with farmers on the pilot for the Sustainable Farming Incentive, one of the new schemes being rolled out as part of the Agricultural Transition Plan. It’s great to see so many people embracing opportunities like this to continue to manage their land, in a way that improves food production and at the same time is more environmentally sustainable.” Matt, Future Land Schemes."
        },
        {
            "text": "“In my role working on grant schemes, I’ve had the opportunity to work with some fantastic projects being delivered by farmers who are strengthening their businesses in some way. It’s inspiring to see what they have achieved and being able to support people to do things like branching out into other sectors or adding value to their business by using what they produce in new ways, is a really rewarding part of the job.” Kirsten, Grants Service."
        },
        {
            "text": "“We know how important it is to build our people’s understanding of our customers and the farming community, so we can put that knowledge at the heart of everything we do. In doing so, we can better serve our customers. More recently, we’ve introduced new tools and training such as our Farming Calendar and our Customer Excellence Training. We are promoting volunteering within our local communities and hope to continue this journey by building stronger relationships with land-based colleges, so everyone in the RPA, regardless of their background, can better understand the challenges our customers face and the inspiring work they do.’’ Elise, Organisational Capability."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}