{
    "url": "https://nationalscreening.blog.gov.uk/2026/01/19/cross-partner-working-on-targeted-screening-uk-nsc-nice-and-his/",
    "title": "Cross-partner working on targeted screening: UK NSC, NICE and HIS",
    "authors": [
        "Carolina Martinelli",
        "Roberta James",
        "Dr Sarah Byron"
    ],
    "categories": [
        "General",
        "UK National Screening Committee"
    ],
    "pub_date": "2026-01-19T13:25:21+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC), the National Institute for Health and Care Excellence (NICE), and Health Improvement Scotland (HIS) all work on the early detection of health conditions, and their work sometimes overlaps and interacts. "
        },
        {
            "text": "For example, the UK NSC might assess a screening pathway proposal while NICE separately assesses the diagnostic pathway that uses the same test via a clinical guideline or a health technology evaluation. Or there may already be NICE or Scottish Intercollegiate Guidelines Network (SIGN) guidelines in place for the test. The FIT (faecal immunochemical test) kit used to test for bowel cancer is one example as it is used both in screening and as a test in general practice to help doctors diagnose their patients."
        },
        {
            "text": "The main area where these organisations collaborate and work closely together is when considering targeted screening topics for high-risk groups. These topics can sit at the boundary between clinical guidelines (which tell doctors how to care for patients) and organised screening programmes (which invite healthy people for tests). "
        },
        {
            "heading": 2,
            "text": "Chief Medical Officer recommendations"
        },
        {
            "text": "Collaboration between the UK NSC, NICE and HIS supports the Chief Medical Officer's recommendations  that UK NSC should: "
        },
        {
            "heading": 2,
            "text": "What is targeted screening?"
        },
        {
            "text": "Previously, the UK NSC only considered proposals for population screening programmes, while NICE and HIS considered targeted screening topics for groups at higher risk.  Following the independent review of adult screening programmes in 2019, the 4 CMOs recommended UK NSC should also cover targeted screening. "
        },
        {
            "text": "UK NSC defines targeted screening as:  "
        },
        {
            "text": "A nationally delivered proactive screening programme which aims to improve health outcomes in people with the condition being screened for, among groups of people identified as being at elevated/above average risk of a specific condition. Compared to the general population, the people targeted may have higher risk because of lifestyle factors, genetic variants or having another health condition.  "
        },
        {
            "heading": 2,
            "text": "How targeted screening differs from clinical care"
        },
        {
            "text": "The UK NSC, NICE and HIS have been working together to clarify where organised targeted screening ends and the testing of high-risk groups within clinical guidelines begins. "
        },
        {
            "text": "Important differences between the 2 approaches include: "
        },
        {
            "text": "Who is being screened or tested: targeted screening largely focuses on people who feel healthy and have no symptoms. Although they are high-risk individuals, they may not know they are at higher risk of the condition being tested for. People who already have symptoms, are being investigated for a condition, or have a diagnosis should be cared for under clinical management."
        },
        {
            "text": "How people are invited: targeted screening programmes proactively offer tests to high-risk groups at a national level. In clinical care, patients ask for tests themselves or are referred by their doctor.  "
        },
        {
            "text": "For example, people with cirrhosis (liver scarring) have an increased risk of developing liver cancer. Because they already have a diagnosis, the NHS monitors them regularly for complications like liver cancer. This is part of their ongoing care, not screening. "
        },
        {
            "text": "Being clear about these differences helps all 3 organisations understand their roles and deliver the best outcomes for the public. "
        },
        {
            "heading": 2,
            "text": "Working together in practice"
        },
        {
            "text": "Arrangements to support our joint working include: "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}