{
    "url": "https://moderncivilservice.blog.gov.uk/2023/07/19/delivering-government-innovation-with-evidence-house/",
    "title": "Delivering government innovation with Evidence House",
    "authors": [
        "Modernisation and Reform Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Data science",
        "Innovation",
        "Modernisation and Reform"
    ],
    "pub_date": "2023-07-19T13:00:15+01:00",
    "content": [
        {
            "text": "Led by the 10 Downing Street Data Science team (10DS), Evidence House is a new initiative that aims to radically upskill civil servants in data science, development and AI whilst delivering fresh insights and innovative solutions to government problems."
        },
        {
            "text": "Launched in January 2023 it now has already amassed a community of over 500 engineers, developers and analysts from across government.\n"
        },
        {
            "heading": 3,
            "text": "How it works"
        },
        {
            "text": "Evidence House acts as a centre of excellence where members come to develop their skills, expand their networks and work on fast paced projects. It does this by:"
        },
        {
            "text": "All of this hands-on experience is supplemented with learning and development opportunities for its members, from introductory courses in programming to one off seminars and specialist workshops."
        },
        {
            "heading": 3,
            "text": "Innovation and learning"
        },
        {
            "text": "Innovation is one of the five reform missions for the Civil Service, building skills and capability along with taking innovative approaches to solving practical problems in government."
        },
        {
            "text": "Through its hackathons, Evidence Housers have already generated an array of fascinating insights and promising solutions. Many of those with practical applications are being developed further for delivery into departments, with the expectation that they will have real world impact."
        },
        {
            "text": " "
        },
        {
            "text": "Recent hackathons have challenged teams to tackle serious fraud using open source data with a range of excellent projects spinning out from it. They have recently announced five secondments where Evidence House members will be embedded in the National Crime Agency, forming a high calibre, multi-disciplinary team tasked with developing and delivering some of the most promising proposals."
        },
        {
            "text": "Evidence House members recently supported the Home Office in delivering another event where teams aimed to address the asylum processing backlog with several projects now being developed and implemented by the Home Office as a result."
        },
        {
            "heading": 3,
            "text": "AI and government"
        },
        {
            "text": "As artificial intelligence (AI) and large language models become more widespread, Evidence House is supporting civil servants in ways to use this technology in government. "
        },
        {
            "text": "The flagship generative AI Hackathon will run from 26-28 July at City University, London. In partnership with leading technology companies and universities the hackathon will pit teams against each other to build the most high impact AI products that can transform the way government works. The team is also running AI workshops for senior leaders in government to help them get to grips with machine learning."
        },
        {
            "text": "Alongside this a number of bootcamps at Admiralty House, London have also been run. In partnership with ONS Data Science Campus and Evaluation Task Force these events have upskilled colleagues in Python programming, machine learning and randomised evaluation trials."
        },
        {
            "heading": 3,
            "text": "Going further"
        },
        {
            "text": "Evidence Housers have already generated an array of fascinating insights and promising solutions. Many of those with practical applications are being developed further for delivery into departments, with the expectation that they will have real world impact. Alongside the No. 10 Innovation Fellowship Programme and other cross-government initiatives it’s helping ensure we remain a skilled, innovative and ambitious Civil Service equipped for the future."
        },
        {
            "text": " "
        }
    ]
}