{
    "url": "https://ruralpayments.blog.gov.uk/2023/07/19/dividing-a-land-parcel/",
    "title": "Dividing a land parcel",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2023-07-19T13:24:48+01:00",
    "content": [
        {
            "text": "In the second blog in our series about the RPA mapping process and how to carry out mapping-related tasks ahead of scheme applications, this blog will guide you through using a map to clearly identify a division or split of a land parcel."
        },
        {
            "text": "It's vital that you ensure your land details are up-to-date before you apply for Countryside Stewardship Mid Tier. This also applies to the Sustainable Farming Incentive (SFI). Land details shown on your digital maps in the Rural Payments service are used for several of the land-based schemes and that’s why it’s important to keep your mapping up to date.\nYou can use the RPA RLE1 form to make changes to your digital maps, register new land and transfer land."
        },
        {
            "heading": 2,
            "text": "How to divide a parcel into three using new fences"
        },
        {
            "text": "Providing accurate length measurements will help us map the divisions correctly."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "How you can help ensure timely and accurate updates"
        },
        {
            "text": "It's vital that you ensure your land details are up-to-date before you apply for Countryside Stewardship Mid Tier. This also applies to the Sustainable Farming Incentive (SFI). Land details shown on your digital maps in the Rural Payments service are used for several of the land-based schemes and that’s why it’s important to keep your mapping up to date."
        },
        {
            "text": "Use the RPA RLE1 form to make changes to your digital maps, register new land and transfer land. For guidance on how to fill in an RLE1 form, follow the steps in this blog post."
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:  "
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements."
        },
        {
            "text": "You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}