{
    "url": "https://environmentagency.blog.gov.uk/2023/07/19/gearing-up-for-a-summer-of-swimming-in-our-bathing-waters/",
    "title": "Gearing up for a summer of swimming in our bathing waters",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2023-07-19T09:55:51+00:00",
    "content": [
        {
            "text": "As the summer holiday approaches, many people will be looking to make the most of the British weather and heading to the country’s beaches or rivers."
        },
        {
            "text": "The Environment Agency monitors the water quality at more than 400 designated beaches and inland waters across England. You can find out which sites are designated bathing waters and view water quality information at our Swiminfo site."
        },
        {
            "text": "Monitoring throughout the bathing water season"
        },
        {
            "text": "Our advice has always been for people to swim in one of over 400 bathing water spots across the country – the beaches, lakes and small number of rivers which are official swimming spots.  Over this period, our officers take around 7000 samples across the 424 designated sites and these samples are then tested in the lab. The results can be found on our Swimfo website, enabling you to make an informed choice about where to take a dip."
        },
        {
            "text": "Sometimes there can be factors that are associated with dips in water quality - for example, heavy rain, high tides, or strong winds. Where this is found to be the case, we inform people of when reduced quality is more likely via our Pollution Risk Forecasts on Swimfo, so they can avoid higher risk times. For information about storm overflow spills, you can visit water company websites directly."
        },
        {
            "text": "The UK Health Security Agency and the Environment Agency offer advice in their ‘Swim Healthy’ guidance which is available to read before making any decision on swimming."
        },
        {
            "text": "The water quality data we collect is regularly updated throughout the season and then an annual classification for each bathing water, based on four years of data, is published later in the year."
        },
        {
            "text": "Last year, 97.1 per cent of bathing waters met the minimum standard of Sufficient, with 92.8 per cent meeting the highest standards of Good and Excellent. This is a significant improvement; using past data we estimate that, if current standards had been in place in the 1990s, over half of bathing waters would have failed. This is as a result of £2.5 billion investment driven by the Environment Agency, increased monitoring and partnership projects to improve water quality."
        },
        {
            "text": "Myth busting discounted samples"
        },
        {
            "text": "It’s not true that we discount 15% of samples every year, as has been recently reported. The Bathing Water regulations allow us to disregard up to 15% of samples over 4 years, but we exclude very few samples - last year, for example, we excluded less than 1% of samples. This included four samples which were taken during pollution incidents or extreme rainfall and 58 samples taken when bathers were proactively warned of weather conditions likely to lead to a drop in quality."
        },
        {
            "text": "The Regulations, which are based on the World Health Organisation’s  recommendations, specify that samples may be excluded from classification because the circumstances are highly unusual, like extreme weather. By disregarding these abnormal samples, the overall classification assessment will be a more reflective picture of the range of quality usually found at this bathing water."
        },
        {
            "text": "River swimming"
        },
        {
            "text": "Swimming in rivers comes with an increased risk compared to the sea for a couple of reasons. Rivers don’t have the benefit of the natural disinfection that occurs in salty coastal waters, and bathers are more likely to come into contact with the bugs that can make humans ill because they won’t have had the time or distance needed to dilute, which they have by the time they reach  the sea."
        },
        {
            "text": "We all recognise that bringing rivers up to bathing water standards will be a challenge – the first designation of a section of a river as a bathing water in 2020 on the Wharfe at Ilkley made that clear. The agriculture sector, water companies and local communities are working with us to find solutions and drive the improvements that we all want to see."
        }
    ]
}