{
    "url": "https://moderncivilservice.blog.gov.uk/2023/07/19/how-the-civil-service-is-changing-to-deliver-better-services-for-all/",
    "title": "How the Civil Service is changing to deliver better services for all",
    "authors": [
        "Modernisation and Reform Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Modernisation and Reform"
    ],
    "pub_date": "2023-07-19T13:00:45+01:00",
    "content": [
        {
            "text": "A Modern Civil Service is our vision of a skilled, innovative and ambitious Civil Service equipped for the future. Over the last two years we’ve made good progress on this, but there’s still more to do. So we’ve set out our next steps with a refreshed reform approach, using lessons from what we’ve learnt so far to help us achieve greater change."
        },
        {
            "heading": 3,
            "text": "How we started"
        },
        {
            "text": "In June 2021 we published the Declaration on Government Reform which detailed an ambitious programme of modernisation and reform, developed and co-owned by ministers and civil servants."
        },
        {
            "text": "Since then we’ve made a number of changes to how we work, including:  "
        },
        {
            "text": "The Civil Service is committed to continuing to improve how it works across government to serve the public more effectively. Two years on from the Declaration on Government Reform it’s important we reflect on what we’ve learnt so far. We want to deliver better services for all, ones that are more trusted, more personalised and more responsive."
        },
        {
            "heading": 3,
            "text": "Our next steps"
        },
        {
            "text": "Building on the actions from the Declaration we’re now focusing on five key missions for reform. These are areas where we can work together to unlock improvements across the Civil Service."
        },
        {
            "text": "Our five missions cover:"
        },
        {
            "text": "Focusing on these five missions will help us keep evolving how we work to improve the ways in which we deliver for citizens."
        },
        {
            "heading": 3,
            "text": "A modern Civil Service"
        },
        {
            "text": "These five missions will help us to remain a modern Civil Service, one that is skilled, innovative and ambitious in delivering the agenda of government and meeting the needs of the public. Each department will set out how it’s taking forward these missions and what this means for their people, as well as how they can contribute and take part. Our work affects every single person in the UK at some point in their life, and this wouldn't be possible without a Civil Service enriched through a diversity of roles, people and ideas that reflect the society we serve."
        }
    ]
}