{
    "url": "https://moderncivilservice.blog.gov.uk/2023/07/19/one-big-thing-data-upskilling-for-all-civil-servants/",
    "title": "One Big Thing: data upskilling for all civil servants",
    "authors": [
        "Modernisation and Reform Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Modernisation and Reform",
        "One Big Thing",
        "Skilled"
    ],
    "pub_date": "2023-07-19T13:00:19+01:00",
    "content": [
        {
            "text": "One Big Thing is a new annual initiative for civil servants to take shared action each year around a reform priority. The focus for 2023 is data upskilling, with all civil servants undertaking a day’s worth of data training this Autumn. "
        },
        {
            "text": "From tackling fraud and error to achieving Net Zero, better data and better data skills are key to being a modern Civil Service. All Civil Service roles require data skills; whether that's designing policies or services, presenting information to others, managing workloads or leading teams to deliver exceptional results."
        },
        {
            "text": "Harnessing the power of digital and data in government is one of our five reform missions. These are areas of Civil Service activity which Permanent Secretaries want us to focus our improvement efforts on. Through One Big Thing we can have an enormous collective impact on our capability mission - increasing levels of priority skills in government and ensuring our people can improve their data awareness, confidence and knowledge, regardless of their current abilities or their type of role. "
        },
        {
            "heading": 3,
            "text": "How does it work?"
        },
        {
            "text": "Better interpretation, use, presentation and communication of data is essential to creating better policies, improving services and helping citizens."
        },
        {
            "text": "So from September civil servants will have access to a new 90 minute central training programme, hosted on Civil Service Learning, along with a catalogue of existing training and resources. The training is tailored to different levels of skill and experience, from basic awareness to expert level."
        },
        {
            "text": "There will also be a number of exciting events to attend live or to view recorded. Once these are complete, we will support line managers to lead 90-minute constructive team discussions on how they will improve their use of data based on what they have seen and learned in order to achieve better business outcomes. "
        },
        {
            "text": "Many departments will be hosting their own training, initiative and events  as part of One Big Thing. This is alongside the existing data skills courses provided by the Government Campus and the ONS Data Science Campus. "
        },
        {
            "text": "Civil servants will be able to undertake training at any time up to the end of 2023 and training does not need to be completed over a single day. Overall this means the Civil Service will collectively provide nearly half a million day’s worth of training, improving everyone’s skills in using data more effectively."
        },
        {
            "heading": 3,
            "text": "Better data, better services"
        },
        {
            "text": "Better data is already being used across government to improve our understanding of complex problems and to target policies and activities to deal with them. The Spatial Data Unit in the Department for Levelling Up, Housing and Communities is already using time-based data relating to specific locations to support the levelling up agenda. The Civil Service Data Challenge is supporting new ideas to use data across a range of policy areas, from tackling modern slavery to protecting the country’s peatlands."
        },
        {
            "text": "One Big Thing this year will boost these efforts and help ensure we remain a modern Civil Service able to use data effectively across all our roles."
        },
        {
            "heading": 3,
            "text": "How do you get involved?"
        },
        {
            "text": "A range of data skills events are being hosted at this year’s Civil Service Live. Attending one of these sessions will count towards the day of training. The new courses on Civil Service Learning will be launched in September and more information on how to take part will be published shortly across government. In preparation, civil servants should log in to Civil Service Learning now to check their account and password are working and that their details (including which department or Arm’s Length Body they work for) are correct."
        }
    ]
}