{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/07/19/practice-makes-social-work-teaching-perfect/",
    "title": "Practice makes (social work teaching) perfect",
    "authors": [
        "Lyn Romeo",
        "Gemma Webb"
    ],
    "categories": [
        "Education and training",
        "Our profession"
    ],
    "pub_date": "2023-07-19T14:04:32+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Inspiring the next generation"
        },
        {
            "text": "One thing I really love about my profession is the passion, dedication and commitment social work professionals have for supporting students and newly qualified social workers to develop their skills, knowledge, and expertise in working with individual, families and communities."
        },
        {
            "text": "After many years as a qualified social worker, I still remember all my practice educators/teachers and the learning I took away from my placements. Now, as a practice educator myself, I also remember the better understanding I developed when working with students’ different learning styles, modelling good practice and conducting live supervision sessions."
        },
        {
            "text": "More importantly, I witnessed the impact enthusiastic students had on our team and the way in which their professional curiosity reignited qualified social workers’ motivation to reflect on their practice and to update and refresh their own knowledge and skills."
        },
        {
            "text": "The National Organisation for Practice Teaching (NOPT) is a voluntary organisation with free membership from individuals interested in practice learning and social work education. The organisation is managed and run by unpaid volunteers working in their own time. They are committed to promoting quality practice learning opportunities in social work settings for learners working across training and education."
        },
        {
            "text": "So, with the help of practice educator, Gemma Webb, I am delighted to tell you more about NOPT and encourage all practice educators to get involved!"
        },
        {
            "heading": 2,
            "text": "Why NOPT get involved?"
        },
        {
            "text": "NOPT has represented the interests of its members through consultation with the major bodies involved in social work education since its inception and continues to do so as changes and concerns evolve."
        },
        {
            "text": "Individual committee members have represented NOPT on the NICE Social Work Engagement Advisory Group, British Association of Social Workers, and Social Work England. NOPT has been particularly involved in activities with BASW including participation in the PEPS reviews, PCF Refresh and a joint project, “Look After Your Practice Educator.” Additionally individual members of the committee have contributed to the PCF Refresh."
        },
        {
            "text": "Committee members have met with Social Work England colleagues to participate in their future strategy consultation and focus groups. They have contributed to community care requests for NOPT’s opinion on relevant matters including student placements in lockdown."
        },
        {
            "text": "NOPT is free to join, so please do get in touch. They are very keen to support their members and continue to drive forward quality practice learning through listening and working with them."
        },
        {
            "text": "Email : noptgetintouch@gmail.com"
        }
    ]
}