{
    "url": "https://teaching.blog.gov.uk/2023/07/19/teaching-our-students-the-facts-about-tax/",
    "title": "Teaching our students the facts about tax",
    "authors": [
        "Nicholas Lawrence"
    ],
    "categories": [
        "Maths Hubs",
        "Secondary schools",
        "Teachers' reflections",
        "Uncategorized"
    ],
    "pub_date": "2023-07-19T09:40:03+01:00",
    "content": [
        {
            "text": "Nicholas Lawrence, a secondary assistant head at Bonus Pastor Catholic College in Lewisham, shares how his school welcomed a HMRC staff ambassador to deliver a lesson about the UK tax system."
        },
        {
            "text": "How did your school teach the free Tax Facts programme?"
        },
        {
            "text": "We arranged for a HMRC officer to come into our school and deliver a session with our Year 8 students as part of ‘Tax Facts’, their free learning programme for schools."
        },
        {
            "text": "They opened with the question: “As students, are you taxpayers?” This got the students thinking straight away, and their immediate answer was no. But then by asking: “Do you pay tax on items that you buy like sweets, snacks, and clothes?” they soon began to realise that they are indeed taxpayers."
        },
        {
            "text": "What is the impact of learning about tax and finance for your students?"
        },
        {
            "text": "As pupils mature, they tend to take a more active role at home and prepare to become independent adults and active citizens. Financial skills and knowledge help them prepare to do this. Tax Facts was a good way to support all our students, from all backgrounds, with these essential skills for life."
        },
        {
            "text": "Did the session link in with the curriculum?"
        },
        {
            "text": "Yes – the session complemented the National Curriculum content we cover for Citizenship at Key Stage 3, on “the functions and uses of money, and the importance of budgeting”. It linked well with Key Stage 4 too, where we teach about “income and expenditure, credit and debt, insurance, savings, pensions and how public money is raised and spent”. The session also supported the wider money skills lessons we teach in PSHE, form time activities, and maths content we deliver during Moneywise week."
        },
        {
            "text": "Are you planning to teach Tax Fact lessons in the future?"
        },
        {
            "text": "We’re planning to do this again for our Year 8s. We’re also looking at sessions for our Key Stage 4 students to see how we can further embed it into our curriculum. This will continue valuable learning that will help prepare our students to not only navigate the current economic climate, but also to prepare them for their lives as independent, responsible and active citizens."
        },
        {
            "text": "Want to run a free Tax Facts lesson in your school? To find out more and download free classroom resources, take a look at HMRC’s page here. Or email hmrc.taxeducation@hmrc.gov.uk"
        }
    ]
}