{
    "url": "https://educationhub.blog.gov.uk/2022/06/25/everything-you-need-to-know-about-music-in-schools/",
    "title": "Everything you need to know about music in schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Schools"
    ],
    "pub_date": "2022-06-25T00:01:01+01:00",
    "content": [
        {
            "text": "Learning about music and having the opportunity to play musical instruments and make music together is a vital part of a rich and rounded education."
        },
        {
            "text": "It has also been proven that music plays a key role in brain development. This is because it helps with the nurturing of language, motor skills, emotional intelligence and collaboration skills."
        },
        {
            "text": "We want all children to get these opportunities so here are some things you may not know about music education in schools."
        },
        {
            "text": "The government has launched a new National Plan for Music which includes £25 million that will allow schools to purchase around 200,000 musical instruments and equipment. A further £79 million will also be made available every year until 2025 for the Music Hubs programme."
        },
        {
            "text": "Here’s everything you need to know about music in schools."
        },
        {
            "heading": 3,
            "text": "Music education is not just an ‘optional extra’ or something just for after school or at weekends"
        },
        {
            "text": "Music is at the heart of a school and its wider community. It is part of the National Curriculum from the age of 5 to 14, and it should be taught in a carefully planned, sequenced way just like maths, English or science."
        },
        {
            "text": "Pupils are supported in their musical progression from Year 1 – where they’ll be introduced to beat, rhythm and pitch - through to secondary school, where pupils will be introduced to more technical aspects of music like the basics of how to read music and concepts like staccato and legato."
        },
        {
            "text": "At Key Stage 1 and 2, listening to a variety of music styles and sounds is designed to broaden pupils’ musical horizons and encourage them to be open minded about the music they listen to. At Key Stage 3, pupils will have the opportunity to discuss and interpret the musical meaning behind songs, and develop their creativity through improvisation and composition."
        },
        {
            "text": "At Key Stage 4, pupils can study music through GCSE, vocational and technical qualifications or through graded music exams, developing a deeper understanding of the subject."
        },
        {
            "heading": 3,
            "text": "The model music curriculum helps teachers deliver the subject to a world leading standard"
        },
        {
            "text": "The National Curriculum sets out the core elements of what music education should look like, but to help teachers we published a model music curriculum last year, which goes into a lot more detail. This was teacher led, with input from leading musicians and education sector bodies, and provides a practical framework through which the statutory requirements of the curriculum can be met."
        },
        {
            "text": "Pupils are encouraged to listen to classical music such as Beethoven and Tchaikovsky, rock n roll songs from Little Richard and Elvis Presley, jazz from Nina Simone to Sons of Kemet, modern classics such as Queen - and much more."
        },
        {
            "heading": 3,
            "text": "Music and arts education is the second highest centrally funded part of the curriculum behind sport"
        },
        {
            "text": "There are challenges associated with delivering high quality music and arts education that are different from a lot of other subjects. That is why we have invested over £710 million of funding between 2016-17 and 2021-22, over and above core school budgets, in a diverse portfolio of music and cultural education programmes to ensure all children, whatever their background, have access to a high-quality education in music and arts."
        },
        {
            "text": "We will keep investing around £115 million per year revenue funding in cultural education over three years, though our music, arts and heritage programmes. This includes £79 million for music hubs to 2025."
        },
        {
            "text": "We have just announced an additional £25 million in musical instruments and equipment. This includes adapted instruments for pupils with special educational needs and disability (SEND) and music technology that is transforming how all children and young people can make music."
        },
        {
            "heading": 3,
            "text": "And our network of music hubs helps schools to provide high quality music education "
        },
        {
            "text": "Music hubs work with around 9 in 10 state-funded schools in England. Since 2012, music hubs have increased the number of pupils supported through music progression routes, whole class instrumental lessons, singing lessons and choirs. Music hubs have also been supporting an increasing number of pupils with SEND and those eligible for pupil premium with access to instrumental lessons and ensembles."
        },
        {
            "text": "The academic year 2021/22 saw just under 86,500 hours of music being taught in keys stages 3 to 5. In academic year 2020/21, over 35,000 students entered music GCSE in key stage 4, a gradual increase since 2017/18 although lower than over 41,000 entries in 2015/16. For music technical qualifications in key stage 4,  over 17,000 students entered in 2020/21, a substantial increase from over 8,000 entries in 2015/16."
        },
        {
            "text": "It takes a partnership to support music education in the classroom, in the wider school and in the community. Music hubs bring together schools, education charities and organisations, music services, community and professional groups to make sure every child has the chance to explore music as far as their interest and talent will take them. And if that talent is exceptional, the Music and Dance Scheme is on hand to make sure finances are not a barrier to young people attending specialist music and dance institutions."
        },
        {
            "heading": 3,
            "text": "The Power of Music to Change Lives"
        },
        {
            "text": "If you want to find out more about what the government is doing to support music education for all children and young people, we published The Power of Music to Change Lives, a National Plan for Music Education with the Department for Digital, Culture, Media and Sport. The plan sets out how schools, Music Hubs and others can help all children and young people to have a brilliant music education, regardless of where they are in the country or their background."
        },
        {
            "text": "You can also download these posters from Arts Council England which explain what the plan means for young people."
        }
    ]
}