{
    "url": "https://educationhub.blog.gov.uk/2022/06/25/how-we-are-helping-children-stay-active-through-sport-and-pe/",
    "title": "How we are helping children stay active through sport and PE",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School sport"
    ],
    "pub_date": "2022-06-25T00:01:01+01:00",
    "content": [
        {
            "text": "Being active can have a hugely positive impact on both our physical and mental health."
        },
        {
            "text": "That’s why we have announced crucial funding to help children take up and benefit from new sports and activities."
        },
        {
            "text": "Here’s everything you need to know about this exciting announcement."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "We have confirmed that schools will continue to benefit from the PE and Sport Premium in 2022/23. This premium is backed by £320 million of funding."
        },
        {
            "text": "Designed to help children to get an active start in life, the funding will give more children access to high quality PE lessons and sporting opportunities."
        },
        {
            "text": "We are also supporting the continuation of the School Games programme which aims to give more young people the opportunity to participate in competitive sport. This programme is backed by £11 million."
        },
        {
            "heading": 3,
            "text": "How will this benefit my child? "
        },
        {
            "text": "The funding covers a whole range of things. This could include encouraging active play at break time, teaching pupils how to swim, or establishing after-school and holiday sports programmes."
        },
        {
            "text": "The PE and Sport Premium and School Games programme all support the government’s commitment to ensuring children and young people have access to at least 60 minutes, or 20 minutes for children with a disability, of physical activity a day."
        },
        {
            "heading": 3,
            "text": "What is the School Games Programme? "
        },
        {
            "text": "The School Games programme is designed to deliver competitive school sport to all young people."
        },
        {
            "text": "To further boost children’s engagement with sport and competition, the School Games programme will support schools to develop sporting talent at an early age."
        },
        {
            "text": "Multiple Olympic athletes having started their careers on the programme, with 29 School Games alumni winning medals at the Tokyo Olympics."
        },
        {
            "heading": 3,
            "text": "Where can I find out more? "
        },
        {
            "text": "Our commitment to ensuring that children and young people have access to at least 60 minutes of sport and physical activity per day is set out in the school sport and activity action plan."
        }
    ]
}