{
    "url": "https://educationhub.blog.gov.uk/2022/06/i-am-determined-to-ensure-that-every-single-child-has-access-to-a-world-class-musical-education-education-secretary-nadhim-zahawi-on-music-in-schools/",
    "title": "\"I am determined to ensure that every single child has access to a world-class musical education\": Education Secretary Nadhim Zahawi on music in schools",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-06-25T10:00:18+01:00",
    "content": [
        {
            "text": "The Education Secretary Nadhim Zahawi has written about his determination that all pupils should get a world leading music education in our schools."
        },
        {
            "text": "Music is one of the greatest joys in life. Whether you prefer to listen through your headphones to help you concentrate in the gym, or you spend your weekends discovering hidden gems at loud underground gigs, music has a transformative ability to bring people together."
        },
        {
            "text": "This country has a rich musical culture. Paul McCartney is headlining Glastonbury this weekend, and the Rolling Stones are playing Hyde Park – 60 years after their first gig! These icons continue to thrill us all, and the Glastonbury line-up is full of incredible young British talent. I am determined to uphold that by investing in music education for the next generation."
        },
        {
            "text": "It is vital that all children have access to these opportunities to ensure that music education is not reserved for the privileged few."
        },
        {
            "text": "To enable this, I am continuing our music hubs programme, worth £79 million per year, so schools can continue to access local, specialist support to deliver exciting music lessons that help all children develop a love of music."
        },
        {
            "text": "There is an additional £25 million to boost stocks of musical instruments. This is particularly exciting as it will give tens of thousands more children more chance to learn an instrument, and play together in bands, ensembles and orchestras."
        },
        {
            "text": "This also means more adapted instruments for pupils with special educational needs and disabilities so they can also learn the power of music."
        },
        {
            "text": "I’m particularly pleased to be going further this coming year, with our new National Plan for Music Education, that makes a clear ask of every school – use the support of your music hub to make sure you teach music for at least an hour a week."
        },
        {
            "text": "It may not sound like much, but consistent music lessons could be the difference between developing a lifelong love of music, or indifference. Between spotting talent, or letting it fall by the wayside."
        },
        {
            "text": "I want to see more children being offered a music qualification, with every secondary school providing access to the GCSE or equivalent."
        },
        {
            "text": "Music is something that we all enjoy both collectively and as individuals and I am determined to ensure that every single child has access to a world-class musical education."
        }
    ]
}