{
    "url": "https://nationalscreening.blog.gov.uk/2025/06/17/consultation-opens-on-population-screening-for-dementia/",
    "title": "Consultation opens on population screening for dementia",
    "authors": [
        "Rebecca Dliwayo"
    ],
    "categories": [
        "Adult screening"
    ],
    "pub_date": "2025-06-17T16:52:43+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to population screening for dementia."
        },
        {
            "text": "Dementia is one of the health conditions the committee reviews regularly for evidence relating to population screening."
        },
        {
            "text": "In 2019, the UK NSC commissioned an evidence summary, which found no evidence to support changing the pre-existing recommendation not to screen for dementia in the UK. The UK NSC recently commissioned an evidence map to review literature on the topic published since the 2019 evidence summary, including evidence on new drugs and other treatments."
        },
        {
            "text": "We have now opened a consultation to ask stakeholders and members of the public to provide feedback on this 2025 evidence map and its conclusions."
        },
        {
            "heading": 2,
            "text": "Take part in this consultation"
        },
        {
            "text": "Please note: To respond to the consultation, either download the consultation response form on the dementia recommendation page (by clicking the ‘View documents’ button) and send it to uknsc@dhsc.gov.uk, or simply email your feedback directly to uknsc@dhsc.gov.uk."
        },
        {
            "text": "Do not use the ‘Submit comments’ button on the recommendation page because the online comments form is currently not operational and your comments will not be received via this route."
        },
        {
            "heading": 2,
            "text": "About dementia"
        },
        {
            "text": "Dementia is a progressive clinical syndrome associated with an ongoing decline of brain functioning which interferes with daily life."
        },
        {
            "text": "The UK NSC is acutely aware of the profound social and economic impacts this condition has on individuals, families, and society."
        },
        {
            "text": "Dementia that develops before 65 years of age is referred to as early (or young) onset dementia and may also be associated with mild cognitive impairment (MCI). The UK NSC’s previous 2 dementia screening evidence reviews in 2014 and 2019 found uncertainty about   how MCI progresses to dementia."
        },
        {
            "text": "Population screening for dementia would involve offering a test to people not suspected of having the condition. People who test positive would then be offered a full diagnostic assessment and be able to access support from health and social care services while the disease was at a relatively early stage."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The 2025 evidence map identified a substantial volume of new published evidence since 2019. However, it found that:"
        },
        {
            "text": "The evidence map concluded that the new literature published since 2019 does not lend support for population screening for MCI and/or dementia. It also recommended that the UK NSC should not commission any more work on the topic but should review the evidence again in 3 years’ time."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}