{
    "url": "https://companieshouse.blog.gov.uk/2025/06/17/creating-an-inclusive-workplace-companies-house-as-a-disability-confident-employer/",
    "title": "Creating an inclusive workplace: Companies House as a Disability Confident employer",
    "authors": [
        "Rebecca Brown - Senior Partnerships Manager"
    ],
    "categories": [
        "Working at Companies House"
    ],
    "pub_date": "2025-06-17T09:19:02+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Our commitment to inclusivity"
        },
        {
            "text": "At Companies House, we’re proud to be recognised as a Disability Confident employer as part of the Disability Confident scheme. This status reflects our ongoing commitment to creating an inclusive workplace where colleagues with disabilities can thrive and contribute their unique talents and perspectives."
        },
        {
            "text": "We believe that everyone deserves equal opportunities to succeed. We’re dedicated to removing barriers, making reasonable adjustments, and promoting a supportive environment for all our team members."
        },
        {
            "heading": 2,
            "text": "What being Disability Confident means"
        },
        {
            "text": "As a Disability Confident employer, Companies House:"
        },
        {
            "heading": 2,
            "text": "How we support our people"
        },
        {
            "text": "We understand that everyone's needs are different. That's why we take a personalised approach to workplace adjustments, which may include:"
        },
        {
            "heading": 2,
            "text": "Experiences from Companies House colleagues: Rebecca's story"
        },
        {
            "text": "Senior Partnerships Manager with Emery Dreifuss Muscular Dystrophy"
        },
        {
            "text": "\"As someone with a rare chronic progressive muscle wasting condition, I always check if employers are part of the Disability Confident scheme before applying. Having this status indicates that proper policies are in place for disability awareness and support."
        },
        {
            "text": "My condition, Emery Dreifuss Muscular Dystrophy, is complex and not widely understood, making job hunting anxiety-inducing. Unfortunately, after joining Companies House, a COVID infection caused my condition to progress rapidly."
        },
        {
            "text": "Both HR and my team have been exceptional in supporting me to remain employed through flexible working arrangements and workplace adaptations. When my mobility deteriorated, I worried about my future, but digital platforms have enabled me to stay fully engaged and continue to make a meaningful contribution."
        },
        {
            "text": "Companies House provides a genuinely inclusive, disability-friendly environment that I highly recommend to prospective applicants. I'm now proud to serve as Vice Chair of our Ability Network, which offers tremendous support as the organisation works toward achieving Disability Leader status.\""
        },
        {
            "heading": 2,
            "text": "Join our inclusive team"
        },
        {
            "text": "At Companies House, we value the unique contributions that people with diverse experiences, perspectives and abilities bring to our organisation. If you're looking for an employer who will support you, challenge you, and help you grow professionally regardless of disability or health condition, we'd love to hear from you."
        }
    ]
}