{
    "url": "https://digitaltrade.blog.gov.uk/2025/06/17/the-importance-of-ethics-in-user-research/",
    "title": "The Importance of Ethics in User Research",
    "authors": [
        "Annie Lewis, Head of User Research",
        "Emma Baird, Research Operations Lead",
        "Manuel Macia, Lead User Researcher"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-06-17T09:52:04+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "heading": 3,
            "text": "Annie Lewis"
        },
        {
            "text": "There is growing demand in government for deeper, more strategic research. Policy colleagues and digital delivery teams want to better understand the people (and in the Department for Business and Trade’s (DBT) case), businesses that we serve.  We aim to involve them more meaningfully in shaping services."
        },
        {
            "text": "At the same time, there is still a need for regular evaluative research (like usability testing) to check that our services work well. But with limited capacity, our user researchers can’t do all of this at scale. So, we’re changing how we work – and ethics are central to that shift."
        },
        {
            "heading": 2,
            "text": "What we're doing"
        },
        {
            "text": "We’re making space for user researchers to focus on in-depth research, like ethnography (observing people in context to understand how they really work and live), longitudinal studies (speaking to the same people over time to see how changes to a service affect their full experience from start to finish), co-design and more exploratory studies."
        },
        {
            "text": "To make this possible, we’re equipping non-user researchers - like product managers, designers, and other delivery team colleagues - to carry out usability testing. They will have the right support and guidance (and be subject to some important caveats)."
        },
        {
            "text": "This shift gives researchers space to do the work that only they can do.  It also gives others closer contact with the people who use our services in a low-risk way, with the support of a user researcher. But to do this safely, we need everyone involved in research to understand and apply ethical principles. Our user researchers are supporting colleagues to do this, and we’ll be sharing more in future blogs about what this looks like in practice."
        },
        {
            "heading": 2,
            "text": "Why ethics is important"
        },
        {
            "heading": 3,
            "text": "Manuel Macia"
        },
        {
            "text": "When we do user research in government, we’re working with real people - and often with sensitive topics. That means we have a responsibility to treat people with care, respect, and fairness."
        },
        {
            "text": "The rules we follow today, like making sure people give informed consent before taking part, have a serious history. A set of ethical principals was created in response to some of the events that happened in the Second World War. One of the most important of these was the Nuremberg Code, which said that no one should be part of research unless they freely agree to it."
        },
        {
            "text": "These ideas shaped the way all research is done today, including user research in government. Even though our work is very different to a lot of research with humans, the same basic principles apply: people must understand what they’re taking part in, and they must choose to take part freely."
        },
        {
            "text": "This is especially important in government. Our research often overlaps with complex areas like data protection, national security, and sensitive personal information. That’s why we follow strict rules and ethical standards to protect the people we work with."
        },
        {
            "text": "When we talked about this with colleagues outside of our research profession, many said they hadn’t thought about where research ethics came from. But once they understood the history, the rules made a lot more sense  and felt more meaningful."
        },
        {
            "text": "This history makes a crucial point. Research ethics is not simply a bureaucratic checklist or a form that helps institutions avoid legal issues, but a baseline for conducting research involving people. Considering ethics means taking active steps to enhance the autonomy of the participants and trust in the researchers."
        },
        {
            "text": "This also means that research ethics are part of every step of the research process. For instance, this involves:"
        },
        {
            "heading": 2,
            "text": "Processes and standards of ethics"
        },
        {
            "heading": 3,
            "text": "Emma Baird"
        },
        {
            "text": "In DBT, we take measures to ensure compliance with these ethical standards."
        },
        {
            "heading": 3,
            "text": "Consent"
        },
        {
            "text": "All research participants must have the chance to consent to the research. Informed consent requires that participants are fully aware of:"
        },
        {
            "text": "We must also ensure that we obtain consent from participants to use their personal data, take notes during research sessions, and record audio or video of the sessions."
        },
        {
            "text": "In DBT, we use consent forms, privacy and information sheets to ensure we adhere to these ethical research practices."
        },
        {
            "heading": 3,
            "text": "Completing research sessions ethically"
        },
        {
            "text": "Ethical research practices promote fairness and respect for all participants. This means valuing participants contributions and treating them with dignity throughout the research process."
        },
        {
            "text": "In DBT, we have established guidance and support to ensure that observers and session notetakers are aware of, and adhere to, ethical guidelines."
        },
        {
            "text": " Our researchers assist their teams in understanding the importance of ethics. If usability testing is conducted by someone outside the User Research team, they are briefed on how to obtain consent appropriately and ask questions in a way that reduces the risk of biasing the participant."
        },
        {
            "heading": 3,
            "text": "Storing and maintaining data"
        },
        {
            "text": "Personal data must be confidential and used only for research purposes. Adhering to ethical standards ensures legal compliance and maintains public trust. "
        },
        {
            "text": "Researchers safeguard participants' privacy by keeping personal data confidential, using it as consented, promptly anonymising when possible, and securely storing identifiable information. "
        },
        {
            "text": " At DBT, our research repository follows strict guidelines for sharing information. Personal data is deleted when unnecessary and shared only with consent to ensure security and protection."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "heading": 3,
            "text": "Annie Lewis"
        },
        {
            "text": "By enabling others to do research safely and ethically, we’re making space for deeper insight, better horizon-scanning, and ultimately more effective design. Ethics are not optional. They're the foundation of good research, no matter who is conducting it. And they are key to how we’re building a healthier, more informed approach to understanding users."
        },
        {
            "text": "This blog is the first part of our series delving into the theme of ethics in user research. "
        },
        {
            "text": "Please let us know in the comments if there are particular topics you’d like to know more about."
        }
    ]
}