{
    "url": "https://hodigital.blog.gov.uk/2020/03/24/want-to-work-on-digital-services-that-matter/",
    "title": "Want to work on digital services that matter?",
    "authors": [
        "Kat Rudd"
    ],
    "categories": [
        "internship",
        "Recruitment"
    ],
    "pub_date": "2020-03-24T10:08:45+00:00",
    "content": [
        {
            "text": "The Home Office Digital Career Development programme offers an 18-month paid accelerated learning experience to those with a passion for user-centred digital services."
        },
        {
            "text": "You’ll follow a structured development path tailored to your chosen role with access to senior mentors and recognised qualifications. At the 12 month point you’ll be able to apply for a permanent position at the Home Office."
        },
        {
            "heading": 4,
            "text": "Apply for a Digital Career Development Programme place"
        },
        {
            "text": "Applications for the 2020 programme are now. We’re offering programmes in the following seven roles:"
        },
        {
            "text": "• User Research\n• Interaction Design\n• Content Design\n• Software Engineering\n• IT Operations\n• Product Management\n• Test Engineering and QAT"
        },
        {
            "heading": 4,
            "text": "Why join the Home Office?"
        },
        {
            "text": "The Home Office is the lead government department for immigration and passports, drugs policy, crime, fire, counter-terrorism and police.  It has been at the front line of keeping citizens safe and the country secure since 1782."
        },
        {
            "text": "Digital is changing the way the Home Office works, building and iterating online services that help keep the UK's streets safe and its borders secure. You’ll get the chance to work on high profile projects that make a difference."
        },
        {
            "text": "You’ll receive a starting salary of £24,108 or £27,762 if you’re based in London (£29,858 or £33,963 for software engineering and test engineering interns) and you’ll get 25 days’ annual leave plus bank holidays."
        },
        {
            "text": "You’ll also be able to join the Civil Service pension scheme and will have access to other benefits such as flexible working options and season ticket loans."
        },
        {
            "heading": 4,
            "text": "How to apply:"
        },
        {
            "text": "You’ll need to apply on the Civil Service Jobs website."
        },
        {
            "text": "There are 3 stages in the recruitment process:"
        },
        {
            "text": "• an initial application, in which you may be asked to submit a CV, examples of your work or complete an online test\n• a phone interview\n• a face-to-face interview and a practical task"
        },
        {
            "text": "The Home Office is committed to attracting and retaining talent from diverse communities and so we follow the Guaranteed Interview Scheme (GIS). This means applicants with disabilities only need to meet the minimum qualifying criteria to progress to the phone interview stages of assessment. You’ll be able to tell us about any reasonable adjustments you might need to complete any part of the recruitment process."
        },
        {
            "text": "If you’re offered a role, you’ll be put forward for security clearance. If you apply for security clearance you should usually have been continuously resident in the UK for 5 years."
        }
    ]
}