{
    "url": "https://deframedia.blog.gov.uk/2017/11/23/thursday-23-november-budget-flooding-and-animal-sentience/",
    "title": "Thursday 23 November:  Budget, flooding and animal sentience",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2017-11-23T13:28:37+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Floods and waste crime in the budget"
        },
        {
            "text": "It was revealed in the Budget yesterday that an additional £76 million will be spent on flood and coastal defence schemes over the next three years, while £30 million was allocated to help tackle waste crime."
        },
        {
            "text": "This flooding funding will better protect 7,500 households and boost flood defence investment to over £2.6 billion between 2015-16 and 2020-21."
        },
        {
            "text": "Of this, £40 million will be focused on deprived communities at high flood risk, boosting local regeneration. We will announce regional allocations in due course."
        },
        {
            "text": "Waste funding will help the Environment Agency tackle waste crime and reduce the harm caused to the environment and to legitimate operators."
        },
        {
            "heading": 2,
            "text": "The Environment Agency’s response to flooding in North West England"
        },
        {
            "text": "There has been widespread coverage this morning of flooding in Cumbria and Lancashire overnight."
        },
        {
            "text": "Persistent, heavy rain across the north over the last few days led to flooding of around 60 properties, flooded roads and travel disruption."
        },
        {
            "text": "The Environment Agency issued flood warnings to affected communities yesterday and teams are on the ground installing temporary barriers, operating flood basins and clearing debris from rivers. These actions help to protect over 6,000 properties locally."
        },
        {
            "text": "Overnight, teams were also working alongside the emergency services and local authorities to provide support and advice to local communities. Flood Support officers are in affected communities today to assess any damage and provide advice and support."
        },
        {
            "text": "The Environment Agency’s communication teams also played a crucial role in warning and informing local people, using social media to update people about the situation and advising against driving through floods."
        },
        {
            "text": "Sheena Engineer, National Flood Duty Manager at the Environment Agency, said:"
        },
        {
            "heading": 2,
            "text": "Animal Sentience"
        },
        {
            "text": "Animals will continue to be recognised as sentient beings once we leave the European Union, Environment Secretary has announced."
        },
        {
            "text": "In a written statement to parliament Michael Gove confirmed the Government will make any necessary changes required to UK law  to make sure animal sentience is recognised after we leave the EU."
        },
        {
            "text": "Currently, the EU’s Article 13 has not delivered the progress we want to see. It does not have direct effect in law – in practice its effect is very unclear and it has failed to prevent practices across the EU which are cruel and painful to animals. Therefore, the vote against New Clause 30 was the rejection of a faulty amendment, which would not have achieved its stated aims of providing appropriate protection for animals."
        },
        {
            "text": "This government is committed to the very highest standards of animal welfare and we will ensure the United Kingdom remains a world leader in the care and protection of animals. We are making CCTV mandatory in all slaughterhouses – a requirement which goes above and beyond any EU rule. We will bring forward draft legislation to increase maximum sentences for animal cruelty to 5 years, more than almost every other European nation."
        },
        {
            "text": "Follow us on Twitter: @defragovuk\nSubscribe to the blog for email updates."
        }
    ]
}