{
    "url": "https://deframedia.blog.gov.uk/2022/07/08/government-action-to-tackle-air-pollution/",
    "title": "Government action to tackle air pollution",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-07-08T12:18:39+01:00",
    "content": [
        {
            "text": "Today the Clean Air (Human Rights) Private Members’ Bill received its second reading in the House of Lords."
        },
        {
            "text": "The Government fully appreciates the intention behind this Bill. Although we have achieved significant reductions in air pollution since 2010, with emissions of fine particulate matter falling by 18%, emissions of sulphur dioxide by 70%, and nitrogen oxides by 44%, it remains the largest environmental risk to public health."
        },
        {
            "text": "While we welcome this Bill’s ambition to drive down air pollution, the Government already has a comprehensive legal framework through which we are taking a wide range of actions to drive down pollutants and their damaging effects on people and the environment. This includes legally binding targets, which we are held to account for delivering by the independent Office for Environmental Protection."
        },
        {
            "text": "One key area in which we have already taken action on particle pollution is domestic burning, a major source of PM2.5 (the most damaging kind of air pollution). As of May 2021, the sale of household coal and small volumes of wet wood have been banned, and as of January 2022, all stoves entering the market must be Eco-design compliant, meaning they are more efficient and less polluting."
        },
        {
            "text": "Under our NO2 programme we have allocated £883 million to support local authorities to develop and implement measures to clean up transport and tackle air pollution. We have also provided £284 million through the Clean Air Fund to support a range of positive local actions such as retrofitting and upgrading of buses, HGVs and taxis. Early indications are showing that these measures are already proving effective."
        },
        {
            "text": "We have awarded more than £42 million since 2010 through the Air Quality Grant scheme to help councils develop and implement measures to benefit schools, businesses and communities by reducing the impact of polluted air on people’s health. Earlier this year we more than doubled the amount of annual funding available under the scheme and invited specific proposals relating to public awareness of air pollution in line with the important recommendations made by the coroner following the tragic death of Ella Adoo-Kissi-Debrah. This is why we are currently leading a comprehensive review of air quality information available to the public, informed by a range of expert advisors as well as representatives from vulnerable communities."
        },
        {
            "text": "This Bill contains targets for a number of air pollutants but we already have a range of legally-binding targets for emissions and concentrations of the most harmful pollutants at local and national level."
        },
        {
            "text": "But we know there is much more to do. That is why through our world-leading Environment Act we are proposing to bring forward two new ambitious air quality targets later this year to reduce the level of fine particulate matter in the air, the pollutant most damaging to human health. We will also be setting out our policy pathways to meet our targets in our update of the 25 Year Environment Plan in 2023. These targets will drive continuous improvement and will, on average, cut peoples’ exposure by over a third by 2040, compared to 2018 levels."
        },
        {
            "text": "Targets set in law must be achievable, however we are yet to see evidence that some of the targets proposed in this Bill, such as a PM2.5 annual mean concentration of five micrograms per cubic metre, could be achieved."
        },
        {
            "text": "Due to the transboundary nature of air pollution, even if we removed all people from the country, we would not be able to meet five micrograms. This is why we are at the forefront of international action to tackle transboundary air pollution, working closely with international partners through the UN Economic Commission for Europe Convention on Long Range Transboundary Air Pollution of which we are a founding member."
        },
        {
            "text": "The Bill also suggests giving the Environment Agency the principal aim of achieving and maintaining clean air. The principal aim of the Environment Agency in discharging its functions is to protect or enhance the environment, which already includes air quality. It suggests that we must monitor progress, which we are already obliged to do through the Environment Act’s annual reports, and place duties on local authorities to tackle air pollution, which they are already obliged to review and assess, and prepare plans where there are any local exceedances. Furthermore, the newly created Office for Environmental Protection also has powers set out in the Environment Act to scrutinise and advise Government on environmental law."
        },
        {
            "text": "While we know that there is much more to do, our existing legal framework allows us to seize opportunities to drive down pollutants and their damaging effects on people and the environment. We will continue to focus on delivering the improvements that we all recognise are needed to reduce emissions, prevent serious illness and improve quality of life for people across the country."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}