{
    "url": "https://environmentagency.blog.gov.uk/2022/07/08/preparing-your-fishery-for-the-summer/",
    "title": "Preparing your fishery for the summer",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Fisheries and biodiversity"
    ],
    "pub_date": "2022-07-08T15:30:30+00:00",
    "content": [
        {
            "text": "Spring and summer can trigger a range of problems for fisheries, and it’s important to understand how to prepare and protect them. It’s vital that anglers and fishery managers recognise the risks posed by warmer weather; remain vigilant for signs of fish in distress and take time to prepare. A little extra care can go a long way."
        },
        {
            "text": "Causes of fish kills "
        },
        {
            "text": "The causes of fish kills are many and varied, but most often occur due to poor water quality or disease or a combination of the two, with warmer weather increasing the likelihood of problems occurring."
        },
        {
            "text": "Stressed fish are also less able to cope with changes in their environment - they can become more susceptible to disease and less able to recover from infection or damage. Stress can be caused by many things: poor nutrition, poor water quality, fishing pressure, lack of habitat, overcrowding - even the weather!"
        },
        {
            "text": "Water quality"
        },
        {
            "text": "Poor water quality can affect fish with varying levels of severity. Severe problems can result in large scale fish mortalities, whilst bad water quality concerns can lead to persistent problems with fish health and fishery performance."
        },
        {
            "text": "Fish diseases and parasites"
        },
        {
            "text": "Fish diseases and parasites are a natural part of any freshwater environment. They play an important role in keeping fish populations healthy by removing weak, old or vulnerable fish and allowing fitter individuals to take their place. In healthy fisheries, fish and fish diseases exist in a balance; but if that balance changes, disease can be a real concern."
        },
        {
            "text": "Many diseases and parasites need certain temperatures to become ‘active’. Koi Herpesvirus is a well-known example of a warm weather disease that can have huge impacts on carp fisheries; but there are others. Outbreaks rarely occur simply due to the presence of a pathogen, with many problems starting when fish are stressed, damaged, or exposed to adverse environmental conditions. Knowing what can trigger disease outbreaks is key to understanding how they can be avoided."
        },
        {
            "text": "We have some great advice for managing disease here."
        },
        {
            "text": "How to prevent problems and prepare your fishery for warmer weather"
        },
        {
            "text": "Good fisheries management practices help reduce the risk of problems occurring at any time – but are especially important in the summer months. Maintaining sustainable stocking levels, following a biosecurity plan, and providing an environment in which fish can thrive will go a long way."
        },
        {
            "text": "Ten top tips "
        },
        {
            "text": "We provide a 24/7 incident response service backed up by our National Fisheries Laboratory. We aim to be able to provide advice, assist on the ground, assess any health or disease concerns, and give guidance to help keep fisheries healthy. This service is funded by fishing licence income, and for many anglers, angling cubs and fishery owners it is the most valuable service we offer."
        },
        {
            "text": "If you see dead fish or fish in distress, please contact our Incident Hotline on 0800 80 70 60 and alert the fishery owner or angling club."
        },
        {
            "text": "We have recorded a presentation - Preparing Your Stillwater Fishery for the Summer Months here - https://anglingtrust.net/regional-forums/virtual-fisheries-forums/#dryweather"
        },
        {
            "text": " "
        }
    ]
}