{
    "url": "https://educationhub.blog.gov.uk/2024/05/5-top-tips-on-how-to-keep-calm-during-exam-season/",
    "title": "5 top tips on how to keep calm during exam season",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications",
        "Mental Health"
    ],
    "pub_date": "2024-05-21T15:41:42+01:00",
    "content": [
        {
            "text": "Many young people will be sitting exams over the coming months, including GCSEs, A Levels, and VTQs.  "
        },
        {
            "text": "We know that exam season can be stressful. Here are few tips and resources for young people, parents and teachers, to help support everyone through this period. "
        },
        {
            "text": "Pupils will have been working towards their exams throughout the school year and should feel supported to prepare for assessments. "
        },
        {
            "text": "Revision is an important way to feel confident when it comes to sitting the exams.  "
        },
        {
            "text": "Evidence shows that revising regularly and in small chunks can be helpful. Everyone will have different ways of revising, but creating practice questions and flashcards can be a good way to test your knowledge.   "
        },
        {
            "text": "Oak National Academy has tips on how to revise effectively here. "
        },
        {
            "text": "When you're preparing for your exams, don't forget to take regular breaks.  "
        },
        {
            "text": "It's important take care of yourself by staying active and rewarding yourself with things you enjoy, like spending time with friends or watching a good movie. "
        },
        {
            "text": "Practise self-care by getting a good amount of sleep, eating breakfast and getting outside regularly to help you stay alert and focused.    "
        },
        {
            "text": "Exams and other assessments are an important way to make sure that young people have acquired the knowledge and skills they need, but they shouldn’t come at the expense of their wellbeing.  "
        },
        {
            "text": "Schools and parents should encourage pupils to find a balanced view of exams and exam results. "
        },
        {
            "text": "Whatever their results, there are plenty of options as there is more than one route into higher or further education and the workplace – and it’s not always grades which are the most important thing.  "
        },
        {
            "text": "From apprenticeships to T Levels and HTQs, there are lots of routes which can all lead to great careers. "
        },
        {
            "text": "Read our guide to what to do if you don’t get the GCSE and A Level results you expect to find out more. "
        },
        {
            "text": "It can be really helpful to talk to someone you trust if you’re feeling anxious about exams and the future.  "
        },
        {
            "text": "First of all, you should talk to your school or college to discuss your options. While friends and family can also be a source of support to bounce ideas off if you’re worried about not getting the results you expect, it can be useful to talk your plans through with an impartial expert. "
        },
        {
            "text": "You can speak to a professional careers adviser for free and get judgment-free, confidential information and advice through the National Careers Service via phone or by webchat. "
        },
        {
            "text": "Whatever your results, if you want to find out more about all your education and training options, as well as get practical advice about your exam results, visit the Skills for Life page to explore your study and work choices. "
        },
        {
            "text": "Ofqual and Exam Boards have developed more top tips and advice to help students manage exam stress:  "
        },
        {
            "text": "Charities have also provided helpful guides to managing exam stress here:"
        },
        {
            "text": "And the NHS has its own guide too: "
        }
    ]
}