{
    "url": "https://ace.blog.gov.uk/2024/05/21/ace-community-event-networking-insights-and-news/",
    "title": "ACE community event: networking, insights and news",
    "authors": [
        "Kate Shanks"
    ],
    "categories": [
        "People and skills",
        "Ways of working"
    ],
    "pub_date": "2024-05-21T20:50:40+01:00",
    "content": [
        {
            "text": "On 15 May, the Accelerated Capability Environment (ACE) hosted our first community event of the financial year in London, drawing in over 130 attendees in person and more than 50 people online. It was a fantastic opportunity to bring together our Vivace Community to network, share insights, and news of ACE’s upcoming pipeline."
        },
        {
            "text": "The event began with a welcome from Simon Christoforato, CEO of Vivace, who expressed his gratitude to everyone for their attendance. Simon emphasised the importance of community feedback in shaping ACE's ways of working, highlighting our drive for continuous improvement and transparent communication, especially around commission bid feedback. His message set a collaborative tone for the event, stressing the collective effort required to enhance public safety and security."
        },
        {
            "text": "Bethan Page-Jones from the Home Office Public Safety Group provided an overview of the current policing landscape from a customer perspective. She briefly touched on key policy challenges, including the safety of women and girls, improving serious offence investigations, and restoring public confidence in policing. Bethan also mentioned the complexities of adapting to a digitally enabled crime landscape."
        },
        {
            "text": "Bethan's insights shed light on the various challenges faced by the Public Safety Group and highlighted their commitment to addressing those issues through collaboration, innovation, and strategic engagement with external partners."
        },
        {
            "text": "James Cooke and Rob Paver from the Home Office discussed the draft strategy for Science, Innovation and Technology. They emphasised the crucial role of industry and academia in delivering a vision for a safer, fairer, and more prosperous UK. They provided examples of feedback they had incorporated to ensure they are listening to industry needs."
        },
        {
            "text": "A major highlight of the event was the presentation by ACE Engagement Leads, who shared the exciting new opportunities and developments coming into ACE from across government."
        },
        {
            "text": "The team outlined the pipeline for the next few months, bringing into focus the increasing themes and trends among ACE’s broadening customer base, particularly regarding threat and the exploitation of data for faster decision-making. This section of the presentation reiterated the value of staying informed and involved with ACE's ongoing projects and initiatives."
        },
        {
            "text": "The essence of the event was to bring together the Community to network, hear about our pipeline and encourage meaningful discussions. The event achieved its objective! The networking drinks that followed the presentation were well attended, providing a relaxed environment for further discussion and relationship-building. We really value these interactions and feel they are crucial for fostering a strong, collaborative community."
        }
    ]
}