{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/05/21/collaboration-spurs-mental-health-social-care-research/",
    "title": "Collaboration spurs mental health social care research",
    "authors": [
        "Michael Clark",
        "Catherine Robinson",
        "Duncan Tree"
    ],
    "categories": [
        "Care and support",
        "Mental health",
        "Research"
    ],
    "pub_date": "2024-05-21T14:36:15+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Losing connection"
        },
        {
            "text": "Support for people with mental health problems, their families and carers, is often overlooked, meaning the ‘social’ in social care is sometimes forgotten."
        },
        {
            "text": "People experiencing mental health problems often say things like better housing, employment, enough money, more friends, and close relationships would make a positive difference in their lives."
        },
        {
            "text": "Most people would agree maintaining social connection is important to living better lives. Balanced, high-quality local mental health systems should account for this when supporting individuals, families and communities."
        },
        {
            "text": "Yet, this aspect frequently has a lower profile in local and national mental health policy and practice – directly affecting the support and opportunities open to people living with mental health issues."
        },
        {
            "text": "This is partly because the evidence about the role and impact of social work in delivering this valued support is often dispersed and under-developed."
        },
        {
            "heading": 2,
            "text": "Collaborating to define effective mental health support"
        },
        {
            "text": "Michael Clark, Catherine Robinson, Duncan Tree and a network of colleagues, including people with lived experience of mental health problems, individuals with caring responsibilities and practitioners, have been collaborating to develop research in mental health social care (MHSC)."
        },
        {
            "text": "This field encompasses social work and the work of local authorities in mental health care and support. It also brings together community and voluntary sector organisations working in the area, particularly members of the Association of Mental Health Providers."
        },
        {
            "text": "It is an area summarised by the Chair of our steering group, Linda Bryant, as ‘being alongside people’. Our first paper, written at the request of the Department of Health and Social Care, established the identity and boundaries of mental health social care and defined its importance to integrated systems."
        },
        {
            "text": "In work funded by the NIHR School for Social Care Research, we further defined mental health social care and relevant frames of reference, including a social model for supporting people. The roles of local authorities and social workers also provide valuable context for understanding what MHSC is, as do those involved in voluntary and community work."
        },
        {
            "text": "In our latest development, we have launched an NIHR-supported Research Incubator in Mental Health Social Care to support research capacity building in this field. This included organising two MHSC summits supported by the NIHR Three Schools Mental Health Programme and NIHR-supported Incubator for Social Care seed funding."
        },
        {
            "text": "In December last year and March 2024 we brought together stakeholders collaborating to develop MHSC, including representatives from the British Association of Social Workers and frontline social workers in mental health care. Reports of these events are being prepared and will be available on the soon to be launched Incubator website."
        },
        {
            "heading": 2,
            "text": "The way ahead"
        },
        {
            "text": "Over the next three years, we will undertake activities through the Incubator to help people and groups develop their engagement with MHSC research and practice. This will include support to people and groups to develop their research ideas."
        },
        {
            "text": "There are examples of great MHSC research. Martin Webber has developed the evidence for the Connecting People Intervention to help practitioners support people to be more connected to others."
        },
        {
            "text": "Meanwhile, Bryn Lloyd-Evans has developed a model of community navigators to alleviate loneliness for people suffering with anxiety and/or depression. We need to build on this evidence, implement it and improve the support people receive from local systems."
        },
        {
            "text": "If you are interested in contributing to the development of MHSC or would like to know more about the NIHR-supported Mental Health Social Care Research Incubator, contact us here."
        },
        {
            "text": "We want to see even more social workers join the network and help us develop the evidence base. In return, we’ll do what we can to support anyone developing their own MHSC research."
        }
    ]
}