{
    "url": "https://deframedia.blog.gov.uk/2024/05/21/coverage-of-the-farm-to-fork-summit-at-downing-street-2/",
    "title": "Coverage of Defra's expanded and improved SFI offer",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-05-21T16:48:24+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Coverage of Defra's expanded and improved SFI offer"
        },
        {
            "text": "There has been widespread media coverage in the trade media following Defra’s publication of full details of the expanded and improved Sustainable Farming Incentive (SFI)."
        },
        {
            "text": "The announcement was reported by a number of trade publications including Farmers Weekly, Farmers Guardian, Farmers Guide, Farming UK and Agriland."
        },
        {
            "text": "The coverage was straight across all of the publications. Farmers Weekly included a supportive statement from NFU deputy president David Exwood, who said that the new offer was “improved, broader and more flexible”. Meanwhile, Tenant Farmers Association chief executive George Dunn was quoted, stating he was pleased with the improved offerings for grassland and upland farmers, and efforts to make sure SFI works for tenant farmers. The Farming Minster’s quote was carried in all pieces."
        },
        {
            "text": "The expanded SFI offer will be open to new entrants for the first time and will initially comprise 102 actions, designed in collaboration with the agricultural sector, including over 20 new options to support more sustainable food production, – with payments for precision farming, agroforestry, a new and expanded offer for upland farmers and more actions for tenants on short-term contracts."
        },
        {
            "text": "In addition, further new actions will support flood preparedness, helping businesses to become more resilient to the changing climate and challenging weather conditions."
        },
        {
            "text": "The doubling of management payments announced by the Prime Minister at the NFU Conference will be paid for the first time this Summer. It will be split across quarterly payments in the first year, putting an additional £1,000 in the farmers’ bank accounts."
        },
        {
            "text": "Farming Minister Mark Spencer said:   "
        }
    ]
}