{
    "url": "https://dluhcmedia.blog.gov.uk/2024/05/21/farming-planning-law-changes-coverage/",
    "title": "Farming planning law changes coverage",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing",
        "Planning"
    ],
    "pub_date": "2024-05-21T15:30:26+01:00",
    "content": [
        {
            "text": "There has been significant coverage in the media after new planning reforms came into effect that make it easier for farmers to convert unused buildings into new homes and shops."
        },
        {
            "text": "The major changes give farmers across England greater freedoms to diversify and grow their business, without having to spend time and money submitting a planning application."
        },
        {
            "text": "They will be able to convert agricultural buildings and land into new lucrative business opportunities, such as outdoor sports facilities, larger farm shops and farm training centres, as well as housing, thanks to the changes to permitted development rights."
        },
        {
            "text": "The story was covered by national titles The Telegraph, and The Express, as well as Inside Housing, Housing Today, Shropshire Star and farming trade outlets; Farmers Weekly, Farming UK, Farmers Guardian and Farmers Guide amongst others. Most of the coverage included a supportive quote from the Housing Minister Lee Rowley, who said the changes will give farmers the freedom to grow their businesses and plan for their futures."
        },
        {
            "text": "The Housing Secretary Michael Gove was also interviewed by BBC’s Farming Today about the changes. During the interview the Secretary of State highlighted the positive impact this change could have for the farming industry in converting property into commercial spaces or affordable housing. When challenged on whether this could lead to a surge in holiday lets, the Secretary of State pointed to local authority powers to decline planning applications for such properties if it becomes overwhelming. Regarding ‘nimbyism’, he said that “the broader health of our farming economy and rural England matters more than an individual who worries that what was once a barn has become a home”."
        },
        {
            "text": "The Government has extended permitted development rights to give farmers greater freedoms to diversify and convert agricultural buildings to commercial uses, as well as up to 10 homes, without needing to submit a planning application. These rules are subject to space and natural light conditions, to ensure homes are suitable. This will help turbocharge rural housing development, with just 5,000 homes delivered on farming land since April 2014."
        },
        {
            "text": "Minister for Housing, Planning and Building Safety Lee Rowley said:"
        },
        {
            "text": "Farmers are the lifeblood of communities, and these changes give them the freedom to grow their businesses, and plan for their futures."
        },
        {
            "text": "This is all part of our Long-term Plan for Housing to deliver more homes for rural communities and reform the planning system, removing unnecessary barriers to development."
        }
    ]
}