{
    "url": "https://cddo.blog.gov.uk/2024/05/21/finalists-for-civil-service-data-challenge-2024-revealed/",
    "title": "Finalists for Civil Service Data Challenge 2024 revealed",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2024-05-21T15:45:27+01:00",
    "content": [
        {
            "text": "The four finalists for 2024’s Civil Service Data Challenge, the data competition designed to find a data-led solution to a technical or societal issue, have been revealed, after competitive semi-final pitches, which recently took place at One Birdcage Walk."
        },
        {
            "text": "Eight semi finalists, made up of a diverse range of civil servants, in different departments and at all grades, competed to go through to the final, which will take place on 4 July, in Westminster. The winner of the Civil Service Data Challenge 2024 will receive £50,000-worth of support from NTT DATA to further develop their idea, as well as the endorsement by senior leadership within the Civil Service. "
        },
        {
            "text": "The competition attracted over a hundred entries, and was launched by Minister Alex Burghart, Parliamentary Secretary for the Cabinet Office in October 2023.  "
        },
        {
            "text": "The judges selected four finalists, from eight competitors, to go through to the final. They include:"
        },
        {
            "text": "The finalists were chosen by the 2024 judging panel, which includes Vicki Chauhan, Head of Public Sector, NTT DATA UK (Chair of Judges); Simon Bourne, Chief Digital, Data and Technology Officer (CDDaTO), Home Office; Gina Gill, Chief Strategy Officer, at CDDO; Sue Bateman, Chief Data Officer, DEFRA; Alison Pritchard, Deputy National Statistician and Director General for Data Capability, ONS; Aydin Sheibani, Chief Data Officer, HMRC; and John Quinn, CIO, NHS England."
        },
        {
            "text": "Craig Suckling, Chief Data Officer, CDDO, and a champion of the competition, said:"
        },
        {
            "text": "“Congratulations to our four worthy finalists. It’s inspiring to see so much innovation, diversity of thought, and drive to improve society reflected in all the entries. Finalists are embracing the important themes that we want to see scaled across government - cross departmental data sharing, use of open data, real time intelligence, and generative AI. "
        },
        {
            "text": "“The final projects showcase the massive potential data and AI holds to streamline civil service administration, improve productivity, and create amazing services for our citizens.”"
        },
        {
            "text": "Vicki Chauhan, Head of Public Sector at NTT DATA UK&I, added:"
        },
        {
            "text": "“This year’s shortlist provides four strong ideas, all worthy of further intensive development and implementation. Impressive pitches from the longlist hugely challenged judges to pick just four, and we thank all of the teams for their hard work and innovation."
        },
        {
            "text": "“The success of the Civil Service Data Challenge comes from civil servants putting forward the best and brightest ideas, and from those who volunteer as team members and mentors to help develop them. The judges can’t wait to hear how the shortlisted ideas have been developed when we reach the final.”"
        }
    ]
}