{
    "url": "https://homeofficemedia.blog.gov.uk/2024/05/21/independent-review-of-political-violence-and-disruption-home-secretary-statement/",
    "title": "Independent Review of political violence and disruption: Home Secretary Statement",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Reactive statements"
    ],
    "pub_date": "2024-05-21T12:13:02+01:00",
    "content": [
        {
            "text": "Home Secretary statement following the publication of Lord Walney's independent review of political violence and disruption."
        },
        {
            "text": "Home Secretary James Cleverly said:"
        },
        {
            "text": "“The right to protest is a vital part of democracy, but there is absolutely no place for criminality or harassment on our streets. Too often, we have seen vile displays of hate crime and aggressive tactics used by so-called protesters."
        },
        {
            "text": "“Lord Walney’s report raises important questions on the cumulative impact of disruptive and extremist activity on our communities. I thank Lord Walney and his team for this extensive and compelling report."
        },
        {
            "text": "“This year, the government has taken swift action to protect our democratic processes from disruption and intimidation."
        },
        {
            "text": "\"In light of disorderly and dangerous protest activity, we are giving police the powers they need to tackle criminal acts; we have provided an extra £31 million to enhance security for elected representatives; and we have set out an updated extremism definition, which will be used to ensure extremists are not lent legitimacy by government funding or engagement."
        },
        {
            "text": "“But that does not mean we will stop there. As Home Secretary, I will take every possible step to safeguard the UK and the people who live here."
        },
        {
            "text": "“In the coming weeks, I will carefully consider Lord Walney's recommendations, in particular those that deal with public order and how to tackle the cumulative impact of protests on communities and police resources.”"
        },
        {
            "text": "Background:"
        }
    ]
}