{
    "url": "https://ssac.blog.gov.uk/2024/05/21/rachel-chiu-reflects-on-the-importance-of-lived-experience-as-she-takes-up-a-new-role-with-ssac/",
    "title": "Rachel Chiu reflects on the importance of lived experience as she takes up a new role with SSAC",
    "authors": [
        "Rachel Chiu"
    ],
    "categories": [
        "About the Committee",
        "Claimants",
        "Consultation",
        "Independent advice",
        "social security",
        "Stakeholders"
    ],
    "pub_date": "2024-05-21T11:30:28+01:00",
    "content": [
        {
            "text": "I grew up in a first-generation immigrant household, and having experiences of homelessness and disability within our family, we were supported by social security benefits which provided a stepping stone out of poverty, but also demonstrated to me some of the limitations and stigma that can be associated with the welfare system first-hand.  My understanding of this broadened through working as a social worker at the start of my career all the way to my current role as a Director of Business Development and Co-Founder of Spring Housing Association and as Chair of Sir Josiah Mason Trust, an alms-house charity, supporting older people and younger people in Birmingham and the West Midlands."
        },
        {
            "text": "The people in the diverse communities I work within often have complex needs – this includes adults with disabilities, and children and families with their social security entitlements and wider care needs an everyday part of their lives. Secure housing and social security can provide a safety net, and with the right support, employment and training can mean that people can thrive."
        },
        {
            "text": "This is why I was delighted when I was appointed as the Social Security Advisory Committee (SSAC) representative on ethnic minorities. This role allows me to ensure that SSAC’s advice is informed by my own lived experience and, just as importantly, gives a voice to people with lived experiences with whom I have been involved throughout my working life. This includes serving on committees for grant making charities in the Midlands including the National Lottery Community Fund and BBC Children in Need; it was here that I was able to focus on how financial support can make a difference to people’s lives by harnessing their asset-based strengths to improve local communities.  Additionally, working to accommodate refugees through recent conflicts in Syria and Afghanistan, and engaging with people who are homeless on the co-production of a Charter of Rights for people living in Supported Housing has provided a stark reminder about the unpredictability of people’s lives that need housing and financial aid alongside the protection of their human rights."
        },
        {
            "text": "Like many, most of my working life has been governed by legislation and regulation including legislative reforms. In my case, I saw the overhaul of adult social care with The National Health Service and Community Care Act 1990 as a social worker, the various charges in social security regulations, and more recently housing and immigration legislation. My work at Spring Housing and tenant engagement has led me to see first-hand the incredibly large amount of work that goes into the development of legislation, more so with Spring Housing having carried out initial research articulating the voices and lived experience of people living in supported accommodation which fed into The Supported Housing (Regulatory Oversight) Act 2023."
        },
        {
            "text": "Working as a committee member on SSAC means I now have the opportunity to contribute to and scrutinise legislation and regulation more directly and help ensure that policy aligns with people’s everyday lives, particularly ethnic minorities, where assumptions and equality impacts are not always recognised and addressed until it is too late in the process. SSAC, and my role on it, provides that advice and constructive challenge to Ministers and civil servants alike."
        },
        {
            "text": "Whilst we often see the impact of legislation in real life situations, my key reflections since starting with SSAC is that we are not a committee made up of members that sits behind closed doors insulated from the world around us. Our advice is grounded in experience and practice including meeting staff visiting Jobcentres and service centres, building networks, which means that our considerations will be a collaborative process with stakeholders."
        },
        {
            "text": "Finally, I just want to say how starstruck I am by the calibre of colleagues on SSAC, and serving alongside them is an honour.  Starstruck and social security aren’t often words to be found in the same sentence, but we can make a rare exception in this case!"
        }
    ]
}