{
    "url": "https://buyingforschools.blog.gov.uk/2024/05/21/risk-protection-arrangement-rpa-a-decade-of-supporting-schools-and-trusts/",
    "title": "Risk protection arrangement (RPA): a decade of supporting schools and trusts",
    "authors": [
        "Susan Dawson, DfE Commercial Director"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2024-05-21T11:42:43+01:00",
    "content": [
        {
            "text": "It’s been 10 years since the DfE introduced its alternative to commercial insurance, the Risk Protection Arrangement (RPA). DfE Commercial Director Susan Dawson has been involved in RPA since inception. In this blog post, Susan looks back at what the service has delivered, and continues to deliver, for schools and trusts."
        },
        {
            "heading": 2,
            "text": "Why the DfE introduced the RPA"
        },
        {
            "text": "In 2014, there was an increasing number of academies forming and operating independently of local authorities. As a result, the department saw increasing costs for academies to secure commercial insurance. Following an intensive review, findings of an independent analysis of school loss risk showed that greater value for money could be achieved by the UK government covering their risks."
        },
        {
            "text": "We wanted to provide a service that gave its members the confidence of knowing they had the backing of the DfE, that they would save time when it came to considering insurance renewal, and that it provided value for money."
        },
        {
            "text": "Introducing the RPA as an alternative to commercial insurance brought with it a competitive, value for money price per pupil. At inception it offered an average saving of £20 per pupil. The RPA marked a significant shift from traditional commercial insurance models."
        },
        {
            "text": "Specifically tailored to provide academies with access to help and support services, the RPA was designed to address claims effectively and efficiently, getting pupils back into classrooms as quickly as possible"
        },
        {
            "text": "I’m pleased to say that on 1 September 2014, 619 academy members joined the RPA."
        },
        {
            "heading": 2,
            "text": "Evolving to meet the needs of schools and trusts"
        },
        {
            "text": "Over the last decade the RPA has kept the pace with changing requirements, proactively capturing feedback, and striving to ensure the cover and support continues to meet the needs of its members."
        },
        {
            "text": "Following a study with members in 2018, two important areas were included as part of RPA cover:"
        },
        {
            "text": "In addition to the RPA, in 2019 we introduced a risk mitigation service. Where members are in the unfortunate situation of making a claim, the risk mitigation service helps by undertaking surveys and offering advice, guidance, and in some cases funding toward measures that will improve resilience. This includes risks associated with health and safety, crime and fire."
        },
        {
            "text": "Since 2019, the RPA has provided funding to over 300 schools, installing crime prevention measures such as CCTV, secure fencing, and advice on measures such as fire doors."
        },
        {
            "text": "Following a claim for damage caused by vandals, and a subsequent risk inspection Bishop Konstant Catholic Academy Trust received almost £40,000 from the RPA."
        },
        {
            "heading": 3,
            "text": "Expanding RPA membership "
        },
        {
            "text": "In 2020 RPA expanding its reach to include local authority maintained schools. To date over 20% of all local authority maintained schools are members and numbers continue to grow each month."
        },
        {
            "text": "The COVID-19 pandemic hit in 2020, and schools and trusts were left grappling with unprecedented challenges. When school trips were cancelled, the RPA ensured that over 6,000 travel claims from member schools were processed quickly and efficiently."
        },
        {
            "text": "Addressing the increasing risks associated with cyber security threats and risks, the RPA introduced cyber incident cover in 2022. Acknowledging the critical need to safeguard sensitive data and systems, schools could now fortify themselves against cyber-attacks, ensuring continuity in an increasingly online world."
        },
        {
            "text": "Should an incident occur, the CyberClan incident response service, who are part of the RPA, are there to help every step of the way."
        },
        {
            "text": "The RPA cyber cover meant that Hope Sentamu Learning Trust avoided costs of around £140,000 when a cyber incident occurred on New Years Day 2023."
        },
        {
            "text": "In the Cyber security for schools – the benefits of the risk protection arrangement (RPA) blog post, three schools talk about the difference being an RPA member made when a cyber incident occurred in their school."
        },
        {
            "text": "We understand the challenges schools face, especially when the unexpected happens. It was in response to this that we introduced Client Account Managers. Now where a school or trust is faced with a large, complex claim this service provides a guiding hand to navigate through the process. Our aim is to help you to make sure your pupils get back in the classroom as quickly and safely as possible."
        },
        {
            "heading": 3,
            "text": "Environmentally aware"
        },
        {
            "text": "Climate change is an important topic in schools, not only from an educational perspective, but also the adverse impact on the schools estate and community. St Mary’s Catholic School in Derby was burnt to the ground by an arson attack in 2020. The school is an RPA member, and it was after this devastating incident that we funded a multi-million pound rebuild to make this the country's first biophilic school, meaning the design and build are close to nature, encouraging plants and wildlife."
        },
        {
            "text": "While we recognise that to undertake such an ambitious approach is not applicable in all cases, what this project has done is set the RPA on a course to learn how and where we can use sustainable materials and natural processes to support the education sector to achieve net zero carbon emissions by 2030."
        },
        {
            "text": "Flood water can cause major disruption and damage. Because of their large surface areas such as playgrounds and pathways, schools are more susceptible to surface water flooding after increased rainfall. This can leave areas inaccessible for recreation and education, and in some instances cause damage to property. Between 2014 and 2023, the RPA has provided financial support to over 300 schools suffering flood damage."
        },
        {
            "text": "In 2022 we introduced the schools water strategy, an invest to save project to protect those schools most at risk of flooding. Our specialist water projects: Sustainable Drainage Systems (SuDS), Property Flood Resilience and a partnership with the Environment Agency, has invested in over 500 schools."
        },
        {
            "text": "I’m immensely proud of our collaborative efforts with the Environment Agency, lead local flood authorities, and local water companies. They have helped transform our vision into reality. Working hand in hand with these partners and schools, we have made remarkable strides in enhancing access to lush green spaces for over 200,000 pupils with our Sustainable Drainage Systems (SuDS) projects. These areas serve not only as recreational havens but also as vital educational and wildlife habitats, positively impacting mental and physical well-being."
        },
        {
            "text": "We’re forging ahead with this work and have over 100 school projects in the pipeline. The team is aiming to implement 550 sustainable drainage system projects by 2026, reducing the risk of flooding in 800 schools."
        },
        {
            "text": "These initiatives aren’t just about infrastructure; they’re a powerful catalyst for raising awareness of sustainability and the urgent need to combat climate change."
        },
        {
            "heading": 3,
            "text": "Over 50% of publicly funded schools are now RPA members"
        },
        {
            "text": "If you are not a member already, I would encourage you to consider the RPA. It’s quick and easy to join and is the same price for all its member schools. We don’t ask for previous claims history and geographical locations have no bearing on your membership. You can join the RPA at any time of the year."
        },
        {
            "text": "Feedback from our members recognise the RPA as a valued service and over the last 10 years we have always put the needs of schools at the forefront of everything we do."
        },
        {
            "text": "We won’t just sit back. As the educational landscape continues to evolve, so will we. So, here’s to the next 10 years. If you want talk to one of my team and find out more about the RPA contact schools.commercial@education.gov.uk."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}