{
    "url": "https://stratcommand.blog.gov.uk/2024/05/21/we-are-strategic-command-with-dee-youngs/",
    "title": "We Are Strategic Command with Dee Youngs",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-21T09:19:48+01:00",
    "content": [
        {
            "text": "Dee Youngs explores the evolution of resilience within Strategic Command and the path to organisational Transformation."
        },
        {
            "text": "Interviewer: What brought you to Strategic Command?"
        },
        {
            "text": "Dee: What brought me here was an audit. An audit with what was formerly Joint Forces Command (JFC). They identified that this organisation didn't do resilience. It did continuity really well because we're in the military. And what do we do well? We pick things up in a crisis. We work really well at doing things. What we didn't do was get things ready. We didn't talk about them. We didn't prepare in order to ensure that we were ready for the next crisis."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What makes Strategic Command so unique?"
        },
        {
            "text": "Dee: The diversity of thought and trying to go against group-think is absolutely important. And it's something that we drive for. The diversity that's in UKStratCom, I think is what shines. And on a day-to-day basis I can be doing one thing in the morning and doing another thing in the afternoon. Diversity is bringing the ideas to the table, but inclusion is having a voice at that table. So, that's what we do. And I think certainly in my role, I try and bring that out by working with all the various stakeholders."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What’s the most rewarding part of your job?"
        },
        {
            "text": "Dee: What I'd say is most rewarding is seeing change happen. Effecting change with either processes or behaviours or the culture of the organisation. So, we're driving to be better."
        }
    ]
}