{
    "url": "https://environmentagency.blog.gov.uk/2024/05/21/whats-the-foam-you-sometimes-see-along-britains-coastlines/",
    "title": "What’s the foam you sometimes see along Britain’s coastlines?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Cleaner Seas",
        "Climate change",
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-05-21T14:50:52+00:00",
    "content": [
        {
            "text": "Have you ever been at the coast and noticed a frothy foam at the water’s edge? From April to August, it’s fairly common to see these discoloured, sometimes creamy-looking and bad smelling foamy patches in the sea. You might think this is caused by   sewage or other pollution in the water, but actually this is one of our most interesting coastal phenomena and in most cases is a natural occurrence.   "
        },
        {
            "text": "Foam caused by marine algae "
        },
        {
            "text": "The frothy foam you see clinging to the tidelines of our coast is especially visible after windy conditions following warm weather. People sometimes assume this is sewage, however, the foam is normally the result of natural processes involving marine algae.   "
        },
        {
            "text": "The foam is usually made up of decaying algal blooms, primarily from common types of algae like Phaeocystis. "
        },
        {
            "text": "Phaeocystis does not produce toxins  and plays a crucial role in the marine ecosystem, contributing to the base of the food chain. During it’s bloom it can form extensive colonies that resemble frog spawn, which might also be mistaken for pollutants like oil. However, as these blooms die off, they break down into a creamy-brown foam. While this might not be the most  pleasing sight, it’s a natural and and essential part of coastal ecological processes. "
        },
        {
            "text": "There are also sometimes brown, red, or orange slicks that accumulate on the shoreline caused by algae such as Noctiluca which look unpleasant, but are usually harmless. One species (Noctiluca scintillans) causes a beautiful, natural phenomena- bioluminescence also known as ‘sea sparkle' when the sea can glow blue or green when disturbed.   "
        },
        {
            "text": "Salt-water can also produces a natural foam from organic surfactant material that spreads easily when agitated by waves, this usually breaks down in minutes, but there are some natural foams that last longer as well. "
        },
        {
            "text": "Can I swim in sites with algal foam? "
        },
        {
            "text": "Most algal blooms in the sea are harmless but some produce toxins that are harmful to aquatic life and some deplete the oxygen in the sea during decomposition and can lead to fish and other marine animal deaths.  "
        },
        {
            "text": "It’s also possible for toxic cyanobacteria (typically referred to as  blue-green algae) blooms from freshwaters to reach the sea via streams, rivers and estuaries.  In the event of a toxic bloom, we issue warning information including signs advising against bathing.   "
        },
        {
            "text": "Distinguishing between algal foam and sewage "
        },
        {
            "text": "Understanding the difference between algal foam and potential sewage pollution is important for environmental awareness and public health. Here are a few tips to help identify algal foam: "
        },
        {
            "text": " A sign of ecological shift? "
        },
        {
            "text": "While algal blooms are natural, their frequency and duration can be indicators of ecological changes. Increased levels of nutrients, like nitrogen from agricultural run-off or urban pollution can fuel these blooms alongside ocean warming due to climate change. Observing and understanding these patterns helps us gauge the health of our marine environments and the impact of human activity. "
        },
        {
            "text": "What can I do? "
        },
        {
            "text": "In summary, while it may not look or smell nice, the foam often seen along our shores is typically a natural by-product of algal decay. It’s  part of the dynamic and ever-changing marine environment, rather than being a sign of pollution.  "
        },
        {
            "text": "However, if you spot what you suspect might be pollution or if the water shows signs of unusual discolouration, it’s vital to report it. Reporting such incidents to the Environment Agency’s emergency hotline on 0800 80 70 60 ensures that these incidents are properly assessed and addressed. "
        }
    ]
}