{
    "url": "https://deframedia.blog.gov.uk/2024/05/09/inaccurate-claims-in-the-oep-report-reviewing-the-implementation-of-river-basin-management-planning-in-england/",
    "title": "Inaccurate claims in the OEP Report reviewing the implementation of River Basin Management Planning in England",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-05-09T14:51:00+01:00",
    "content": [
        {
            "text": "Today the Office for Environmental Protection published a report on legal targets to improve water health."
        },
        {
            "text": "The report claims that report claims that “the EA has calculated a cost of £51 billion to achieve the targets… but there is only confirmed funding of £6.2 billion up to 2027”."
        },
        {
            "text": "This is incorrect. In October 2023, the water industry announced a planned £96 billion of investment between 2025 and 2030 to deliver significant environmental improvements, including tackling nutrient pollution and reducing the use of storm overflows. Ofwat is currently considering these proposals."
        },
        {
            "text": "The report also claims that “rivers, lakes and coasts are likely to remain in poor state”."
        },
        {
            "text": "This is factually incorrect and misleading. Only 17% of water bodies are in a poor state. 63% are in an average state (moderate) and 16% are in good state."
        },
        {
            "text": "The wider European context is also relevant.  Due to the pressure on the water environment no EU country is on track to meet the Water Framework Directive targets. Comparable economies such as Germany is at 8% and the Netherlands is less than 1% Good Ecological Status."
        },
        {
            "text": "The government has increased the Environment Agency’s overall Grant in Aid funding by more than £500 million since 2010. Over the latest three-year spending review period (SR21), the Agency received £2.2 million each year specifically for water company enforcement."
        },
        {
            "text": "We have also already committed to review the Water Framework Directive regulations and reform the River Basin Management Plans, as set out in the Plan for Water last year. That is alongside our work to increase investment and hold water companies accountable, including consulting on a ban on bonuses and bringing in a four-fold increase in inspections."
        },
        {
            "text": "We welcome this report’s recommendations to go further and will respond to the OEP in due course."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "\"This government has done more than any other to protect and restore our rivers, lakes and coastal waters with record levels of investment, monitoring and enforcement. We welcome this report’s recommendations to go further and will consider them in detail."
        },
        {
            "text": "\"We are confident that the River Basin Management Plans are compliant with the current regulations and we have already committed to reforming these plans and delivering tailored long-term proposals to improve all water bodies in England. This is alongside our work to fast-track investment and hold water companies more accountable – including consulting on a ban on bonuses and bringing in a four-fold increase in inspections.\""
        },
        {
            "text": "Call to Action: Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}