{
    "url": "https://ssac.blog.gov.uk/2024/05/09/les-allambys-early-reflections-of-ssac-the-second-time-around/",
    "title": "Les Allamby's early reflections of SSAC...the second time around!",
    "authors": [
        "Les Allamby"
    ],
    "categories": [
        "About the Committee",
        "Claimants",
        "Consultation",
        "Department for Communities (Northern Ireland)",
        "DWP",
        "Independent advice",
        "Legislation",
        "Northern Ireland",
        "Stakeholders"
    ],
    "pub_date": "2024-05-09T09:41:16+01:00",
    "content": [
        {
            "text": "I never had a misspent youth. As a student I spent my Saturday mornings volunteering on a Durham market stall containing (then) DHSS[1] leaflets, answering basic queries and offering appointments for more complex issues. Not knowing what I wanted to do when I left Durham, I took the advice of a friend and went to Belfast to work as a long-term volunteer doing community work. It was in 1980, a particularly volatile year. I loved Belfast as a city and still do – it is warm and friendly, occasionally hard and unforgiving. As part of my voluntary work, I became an adviser for Belfast Housing Aid (now Housing Rights) and got involved in Belfast Law Centre. After finishing a year as a volunteer, I decided to return to Belfast signed on and worked as a volunteer for the Law Centre organising door to door social security benefit take up campaigns with colleagues throughout the city. It proved remarkably successful as poor housing, high unemployment alongside a Supplementary Benefit system amenable to additional payments linked to ill-health, lack of washing facilities and fuel poverty meant most claimants were entitled to significant additional weekly income. I also became a social security adviser and secured a full-time job at the Law Centre in the same week my own benefit was stopped as I was not deemed to be ‘available for work’ due to involvement with the Law Centre. I represented claimants at tribunals and before the Social Security Commissioners and prepared papers for Judicial Review and appeals to the NI Court of Appeal."
        },
        {
            "text": "The Law Centre operated as a specialist hub through capacity building local Citizen Advice Bureaux and independent advice centres through an advice line, training and information services. It also ensured its advice work experience fed into policy development. In particular, the Law Centre began to explore the value of European law as Northern Ireland was the only part of the UK with a land border with another member state and large numbers of low paid cross border workers. As a result, a variety of issues arose that were Northern Irish specific and ended up in the court in Luxembourg. I moved from being a ‘barefoot lawyer’ as they say in India to qualifying as a solicitor in the 1990s while also becoming the Law Centre’s director. In 1999 I became the first chair of the statutory Independent Social Security Standards Committee reporting on the quality of decision making to the newly created NI Assembly following the Good Friday Agreement. One achievement was to persuade the head of the Social Security Agency to purchase CPAG Handbooks and Sweet and Maxwell’s legal commentaries on social security legislation."
        },
        {
            "text": "In 2005 I became the Northern Ireland member of the Social Security Advisory Committee (SSAC). The Committee was (and remains) pluralist and independent with members offering a wide range of skills based on diverse backgrounds. Alongside scrutinising regulations, the Committee also developed a small but influential role by producing independent policy research. I drafted a paper on how the social security system discouraged claimants with disabilities from participating in paid public appointments and other work due to complex and (on occasions) unfriendly benefit rules. The ‘permitted work rules’ have improved since then, yet remain a work in progress. Some areas of focus have not changed with sanctions, passported benefits being among the issues the Committee examined at that time."
        },
        {
            "text": "In 2014 I completed my time at SSAC coinciding with a move to become the Chief Commissioner of the NI Human Rights Commission. Human rights is a particularly contested political and public space in Northern Ireland and the Commission taking a legal challenge to the (then) law on abortion on human rights grounds and becoming involved in the negotiations in London and Brussels on how to protect the human rights and equality provisions in the Good Friday Agreement in what is now the Windsor Framework following the UK exiting the European Union meant it was an interesting time to be at the Commission."
        },
        {
            "text": "Since finishing at the Commission in September 2021 I have chaired an independent review of social security mitigations examining what the Department for Communities could do beyond existing mitigations to not implement the social sector rent restrictions/‘bedroom tax’ and benefit cap for families. I am also the Discretionary Support Commissioner which provides an independent review in the scheme in Northern Ireland which replaced the discretionary Social Fund in providing lump sum grants and loans for furniture, household and other needs and also offers grants for short-term living expenses to claimants for example, waiting for their first payment of Universal Credit (UC) through the Universal Credit Contingency Fund."
        },
        {
            "text": "My experience of SSAC (then and now) is that it seeks to build an effective relationship and influence with the Department for Work and Pensions through offering high quality constructive advice and technical insights. It works with non-governmental stakeholders who have become the eyes and ears of the Committee to what is happening on the ground. In reality, the Committee will never be a ‘tail which wags the dog’ given its resources, neither should it be. Instead, it should be a force for good by highlighting pitfalls in regulations, unintended consequences of changes and offering suggestions around service delivery and policy developments gleaned from visits and experiences. Being a Northern Ireland member of the Committee brings an expectation that specific Northern Irish issues will be flagged and considered – the most recent example of which is the recommendation not to implement the increase in the Administrative Earnings Threshold (AET) for UC as Northern Ireland has neither a childcare strategy nor anything like the level of childcare support outside the social security system available in England, Scotland and Wales. As social security is fully devolved the decision whether to increase the AET threshold is one for the Minister of Communities. The committee now has close to 50 per cent new members and will be given little time to bed in given the scope of proposals to reform the work-related requirements in UC and wider proposals for changes to disability benefits. After almost a decade away from SSAC my early impression is that its work remains as relevant as ever and the range of skills and quality of insight and analysis from members and secretariat remains undimmed."
        },
        {
            "text": " "
        },
        {
            "text": "[1] Department for Health and Social Security"
        }
    ]
}