{
    "url": "https://defraenvironment.blog.gov.uk/2024/05/09/reflections-from-the-peatland-restoration-season/",
    "title": "Reflections from the peatland restoration season",
    "authors": [
        "Kate Corfield"
    ],
    "categories": [
        "Nature",
        "Peat"
    ],
    "pub_date": "2024-05-09T09:38:42+01:00",
    "content": [
        {
            "text": "Over 1.4 million hectares of peatlands are spread across England’s landscape."
        },
        {
            "text": "They are areas with a naturally accumulated layer of peat – a carbon-rich organic soil formed from dead and decaying plant material."
        },
        {
            "text": "Peatlands perform many functions – they are our largest terrestrial carbon store, a haven for rare wildlife,  and natural providers of water regulation."
        },
        {
            "text": "Yet, for too long we have taken this valuable natural resource for granted. 87% of England’s peatlands are now degraded, damaged and dried out, emitting tonnes of carbon dioxide into the atmosphere each year."
        },
        {
            "text": "Restoring our peatlands"
        },
        {
            "text": "Defra and Natural England are working to restore England’s peatlands through our Nature for Climate Peatland Grant scheme. The grant scheme, which has been running since 2021, provides funding to restore peatlands in the uplands and lowlands of England."
        },
        {
            "text": "It marks our largest ever investment in peatland restoration and it is accelerating the delivery of restoration in England."
        },
        {
            "text": "The restoration season tends to run from October to April. Major works must stop over the spring and summer to protect nesting birds from any disturbance. The timing of the restoration season means that project partners are often out in cold, harsh conditions in remote areas getting restoration done over the winter months."
        },
        {
            "text": "In this post I’m going to share more with you about the benefits of the peatlands that we’ve protected through our most recent restoration season."
        },
        {
            "text": "Records of the past"
        },
        {
            "text": "Peat, which is naturally oxygen-free, helps to prevent decay. So peatlands can preserve important evidence of our past."
        },
        {
            "text": "The grant scheme has lots of provisions in place to protect and avoid disruption to archaeological features, but sometimes new sites are found when work is going on."
        },
        {
            "text": "This season, in Somerset, a prehistoric ‘burnt mound’ was discovered during a survey. Burnt mounds are rare, and date from the neolithic through to the Iron Age."
        },
        {
            "text": "No one is sure about their exact use, although the stones in the Somerset mound appear to have shattered from being heated in fire then dropped into water. Theories include cooking and processing purposes, or possibly a form of sauna!"
        },
        {
            "text": "Healthy peatlands support an abundance of biodiversity"
        },
        {
            "text": "Peatlands can support a rich and often unique range of habitats and species."
        },
        {
            "text": "Across the UK’s South West, the South West Peatland Partnership, has supported a range of works to help biodiversity."
        },
        {
            "text": "This has included helicopters flying in local stone to remote sites to trap sediment and slow the flow of water in gullies created by erosion."
        },
        {
            "text": "The team has also constructed leaky wooden dams and other solutions, which are already holding back incredibly large amounts of water. They help to create the wet, boggy habitats needed to support the growth of peat-forming vegetation, which in turn supports a range of biodiversity."
        },
        {
            "text": "For example, a small fungus known as the bright bog beacon was found at a restoration site this year. It thrives in bogs and swamps. This photo below shows its bright colour!"
        },
        {
            "text": "Volunteers can help with peatland restoration"
        },
        {
            "text": "The majority of peatland restoration work has to be carried out by specialist contractors. But volunteers can play an important role in monitoring restoration sites. This gives real-time feedback on how the work is affecting these vital habitats."
        },
        {
            "text": "Volunteers were integral in monitoring North Yorkshire’s peatland restoration, for example."
        },
        {
            "text": "During the 2023/2024 season, the grant scheme funded restoration across over 3,000 hectares in Yorkshire. Volunteers assessed changes in vegetation and the level of the water table, to see how that work has affected the restored sites."
        },
        {
            "text": "To do this, volunteers monitored vegetation across 130 10m2 plots, and collected over 11,000 dipwell measurements (a way to measure underground water levels). In collaboration with members of Yorkshire Peat Partnership staff, the volunteers covered 279km on foot for the dipwell collections."
        },
        {
            "text": "Over the summer months, many of the Nature for Climate Peatland projects will be busy surveying the condition of the peatland restoration sites. Then, restoration works will begin again in October."
        },
        {
            "text": "If you are interested in volunteering to help with peatland restoration, search online for “peatland partnerships near me” to get started."
        },
        {
            "text": "We look forward to seeing what the next season brings, and we will keep you updated on this blog. Please subscribe to receive an email notification whenever a new post is published."
        }
    ]
}