{
    "url": "https://environmentagency.blog.gov.uk/2024/05/09/the-ea-funded-farm-group-bringing-people-together-to-improve-sustainability/",
    "title": "The EA-funded farm group bringing people together to improve sustainability",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Sustainability",
        "Waste",
        "Water"
    ],
    "pub_date": "2024-05-09T08:57:04+00:00",
    "content": [
        {
            "text": "The Environment Agency (EA) have funded a project to engage and work with farmers in the Upper Roding Catchment. We’ve worked in collaboration with the project lead, environmental charity Thames21, and the Roding, Beam and Ingrebourne (RBI) Catchment Partnership to create a Farm Cluster, bringing farmers and landowners together, all with the aspiration of improving environmental health and biodiversity and reducing environmental impacts from the agricultural sector.   "
        },
        {
            "text": "The Roding and West Essex Farm Cluster has brought the farming community into the conversation, giving farmers and landowners a space to develop a shared ambition to improve water quality, soil health, and biodiversity on their land whilst maintaining sustainable farm businesses.  "
        },
        {
            "text": " How did this all start?  "
        },
        {
            "text": "“… We worked closely with the Natural England Catchment Sensitive Farming officer and were put in contact with a farmer on the Roding. The farmer then introduced us to a few of his neighbours, and through these connections and other farmers we met through attending Catchment Sensitive Farming events, we began to grow our network of farmers within the catchment. Eventually, our network was large enough to propose the formation of a farm cluster group.”  "
        },
        {
            "text": " With funding from the Environment Agency (held via Thames21 acting as an intermediary), two local farmers, Jonathan, and his partner Jane, put themselves forward to host the newly formed River Roding and West Essex Farm Cluster Group.  "
        },
        {
            "text": "“It didn't take us long to decide that we wanted to work together with other farmers in West Essex and the Roding to create a community of farmers who work together to increase biodiversity, manage flooding with natural interventions, and work in a way that can link projects so that nature can easily move between farms.   "
        },
        {
            "text": "We have been really fortunate to be surrounded by some really positive farmers who are keen to make more space for nature.”  "
        },
        {
            "text": "How’s it going so far?  "
        },
        {
            "text": "The first Farm Cluster Group meeting was held in 2023 with nearly 60 local farmers in attendance. Since then, Jonathan and Jane have hosted meetings and 1-1 visits covering topics from tree planting to natural fertiliser use, pond creation, hedge laying, turtle dove conservation and deer management. In less than a year, cluster group working has led to a coordinated approach to mink trapping across the entire Roding catchment (as part of Waterlife Recovery Trust’s efforts to protect and restore endangered water vole populations), numerous farmers restoring pond habitats under Natural England’s Great Crested Newt district level licencing scheme, and an uptake in tree planting and hedge laying grants from farmers across the catchment.  "
        },
        {
            "text": "The Cluster now includes 100 farmers and is a testament to the importance of hassle-free funding that puts trust in bottom up, farmer-led engagement to deliver environmental outcomes.  "
        },
        {
            "text": " The Farm Cluster Group are exploring opportunities to secure long term funding, to allow the Cluster to continue to deliver more fantastic environmental improvement projects that benefit the River Roding. We would love to hear any funding suggestions to support the continuation of the River Roding and West Essex Farm Cluster Group.  "
        },
        {
            "text": " To find out more about this project please contact the Roding, Beam, and Ingrebourne Catchment Co-ordinator: Amber.sunderland@environment-agency.gov.uk.  "
        }
    ]
}