{
    "url": "https://nationalscreening.blog.gov.uk/2024/05/09/uk-nsc-endorses-modification-to-antenatal-screening-offered-for-edwards-syndrome/",
    "title": "UK NSC endorses modification to antenatal screening offered for Edwards’ syndrome",
    "authors": [
        "Elizabeth Luckett"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-05-09T09:30:01+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has recommended modifying the offer of antenatal screening for Edwards’ syndrome as part of the fetal anomaly screening programme in the 4 nations."
        },
        {
            "text": "Following a public consultation, the committee agreed that the quadruple test is accurate enough to be added to the screening pathway for this rare but serious condition."
        },
        {
            "text": "The UK NSC made the recommendation at its most recent meeting."
        },
        {
            "text": "Edwards’ syndrome, also known as Trisomy 18 or T18, affects the way a baby grows and develops. A baby with Edwards’ syndrome has 3 copies of chromosome number 18 instead of 2. Edwards’ syndrome is a life-limiting condition and sadly most babies will die during their first year of life."
        },
        {
            "text": "Screening for Edwards’ syndrome occurs in the first trimester of pregnancy as part of the combined test offered to pregnant women. The combined test also screens for Patau’s syndrome (Trisomy 13) and Down’s syndrome (Trisomy 21)."
        },
        {
            "text": "The screening pathway modification recommended by the UK NSC means that pregnant women who miss the combined test can in future be offered the quadruple test to screen for Edwards’ syndrome in the second trimester of pregnancy."
        },
        {
            "text": "Until now, the quadruple test, which uses maternal age and 4 biochemical markers, has been offered in screening for Down’s syndrome only."
        },
        {
            "text": "The committee was satisfied that the evidence from a rapid review of data demonstrated that the quadruple test was accurate enough to screen for Edwards’ syndrome, but not for Patau’s syndrome."
        },
        {
            "text": "Responses received during the public consultation endorsed the findings of the rapid review."
        },
        {
            "text": "At its March meeting, the UK NSC also acknowledged the devastating impact that vasa praevia has on families. Evidence does not support the case for screening for this condition, which causes the blood vessels to tear during birth and has serious consequences for mother and baby. However, the committee agreed to write to the Royal College of Obstetricians and Gynaecologists to ask it to revisit its clinical guidelines for vasa praevia and consider auditing activity."
        },
        {
            "text": "Other issues discussed at the March meeting included updates on:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}