{
    "url": "https://teaching.blog.gov.uk/2016/09/15/making-marking-intelligent-feedback-policy-at-huntington-school/",
    "title": "Making marking intelligent: feedback policy at Huntington School",
    "authors": [
        "John Tomsett"
    ],
    "categories": [
        "Reducing teacher workload"
    ],
    "pub_date": "2016-09-15T11:49:32+01:00",
    "content": [
        {
            "text": "Why do we mark?"
        },
        {
            "text": "At the end of my first year of teaching I met with each of my students and discussed their progress. I was looking with Kate at her latest A level English literature essay. I had written ‘don’t paraphrase’ several times in the margins of the essay, as I had done every time I had marked an essay written by Kate during the previous eight months. With one simple question Kate exposed the ineffectiveness of my marking: ‘What does “paraphrase” mean Sir?’"
        },
        {
            "text": "Ever since that moment with Kate 27 years ago, I have subscribed to the principle that marking is only worth doing if it improves students’ learning."
        },
        {
            "text": "Marking is hard work. It consumes teachers’ time like a basking shark consumes plankton."
        },
        {
            "text": "There is no point in marking which does not improve students’ learning, a truism that is so obvious school leaders can forget it. I teach two economics A level classes and one Year 7 English class. My marking load is small. Why should I dictate the school’s marking policy? Instead I trusted our Subject Leaders, led by Alex Quigley, our Director of Research School, to formulate an intelligent marking and feedback policy."
        },
        {
            "text": "Feedback policy at Huntington School"
        },
        {
            "text": "Consequently, at Huntington we have widened the scope of our marking policy and called it a feedback policy. The Subject Leaders decided that a one-size fits all policy is not appropriate. The core of the feedback policy is short, detailing some basic principles. The bulk of the policy explains how each subject gives feedback to students, key stage by key stage."
        },
        {
            "text": "When working with Subject Leaders on developing our feedback policy, Alex introduced them to the Sutton Trust-Education Endowment Foundation Teaching & Learning Toolkit. We root all our practice in what evidence suggests works best. If you can get your feedback policy working effectively, the evidence shows that it can have a huge positive impact on students’ progress."
        },
        {
            "text": "Our approach to assessment, where we have refocused upon formative assessment, has gone hand in hand with our new feedback policy."
        },
        {
            "text": "This may seem an odd thing to say, but we are closer than we have ever been to operating policy which helps students learn. Too often school policy, especially around marking and feedback, can be an exercise in hoop-jumping, rather than intelligent professional practice."
        },
        {
            "text": "Supportive marking"
        },
        {
            "text": "In order to support their colleagues in implementing the new feedback policy, the Subject Leaders devised their own generic work review feedback form. This is another example of building policy from the bottom up, working with those colleagues who know what it is like to teach a full timetable, teachers who spend most of their time preparing and teaching good lessons."
        },
        {
            "text": "At Subject Leader/SLT line management meeting we can discuss the quality of feedback based upon their work review feedback forms. It is light touch accountability which is not onerous. It is rigour with a smile."
        },
        {
            "text": "As we embark upon the second year of implementing our Feedback policy, we are focussing upon two things: firstly, gaining greater consistency of implementation and secondly, educating parents in the new approach so that they understand what they find in their children’s books."
        },
        {
            "text": "'Professional trust is priceless'"
        },
        {
            "text": "Professional trust is priceless. Our feedback policy is shaped by professional experience and evidence-informed. There is more chance that teachers will follow policy if it has been formulated in consultation with them. Teachers want policy that is intelligent. They know that marking and feedback are essential elements of effective teaching and learning."
        },
        {
            "text": "At Huntington this new policy has ensured that teacher workload is tolerable and its management is in the hands of the teachers themselves. Colleagues feel empowered by having been able to shape the policy that most impacts upon their workload and wellbeing."
        },
        {
            "text": "Ultimately, teachers just want to be reassured that their marking and feedback is helping students learn more effectively. And I, for one, never want one of our students to ever wonder what ‘paraphrase’ means…"
        },
        {
            "text": "Many schools considering workload strategies found inspiration from the Marking Policy Review Group's report on Eliminating unnecessary workload around marking: https://www.gov.uk/government/publications/reducing-teacher-workload-marking-policy-review-group-report"
        },
        {
            "text": " "
        }
    ]
}