{
    "url": "https://defraenvironment.blog.gov.uk/2024/07/08/5-simple-actions-to-help-pollinators-this-bees-needs-week/",
    "title": "5 simple actions to help pollinators this Bees’ Needs Week",
    "authors": [
        "Sian Watts"
    ],
    "categories": [
        "Gardening",
        "Nature",
        "Plants",
        "Pollinators"
    ],
    "pub_date": "2024-07-08T09:27:24+01:00",
    "content": [
        {
            "text": "Bees, and other pollinating insects, are vital to our ecosystem and play a crucial role in food production. "
        },
        {
            "text": "My name is Sian and I work in the Pollinators and Biodiversity Pressures team at Defra. "
        },
        {
            "text": "This week is Bees’ Needs Week. Every year, Defra and other organisations work in partnership to raise awareness of the importance of pollinators, and to share ideas on how to support them. "
        },
        {
            "text": "In this blog post, I’ve shared our top tips on how to help pollinators thrive and support nature’s recovery. "
        },
        {
            "text": "Everyone has a part to play to encourage more buzzing bees and beautiful butterflies, and other crucial pollinators, in their local area. "
        },
        {
            "text": "Let’s put nature first and help us to help pollinators. "
        },
        {
            "text": "5 simple actions you can take to help pollinators "
        },
        {
            "text": "There are 5 simple actions you can take to support pollinators near you. "
        },
        {
            "text": "1. Grow more nectar rich flowers, shrubs and trees. "
        },
        {
            "text": "Provide food and shelter for pollinators throughout the year by growing more pollinator-friendly plants in your garden. "
        },
        {
            "text": "If you don’t have access to a garden, window or balcony boxes are also a good way to create space for plants that help pollinators. "
        },
        {
            "text": "To extend the season in which pollinators have access to nectar, make sure to plant flowers, herbs and trees that flower at different times of the year. "
        },
        {
            "text": "2. Let patches of garden and land grow wild. "
        },
        {
            "text": "Leave patches of land to grow wild, letting wildflowers flourish. This will make great nesting and feeding sites for bees.  "
        },
        {
            "text": "3. Cut grass less often. "
        },
        {
            "text": "Cutting grass less often will help other plants to grow in the lawn, including those with nectar-rich flowers. "
        },
        {
            "text": "Removing cuttings when you do mow your lawn will give other plants space and light to grow, providing a nourishing environment for bees. "
        },
        {
            "text": "4. Do not disturb insect nests and hibernation spots. "
        },
        {
            "text": "Longer grass, hedgerows, trees, dead wood and even brick walls can provide nesting or hibernation sites for insects. So try to avoid disturbing these sites, to protect the sheltering insects. "
        },
        {
            "text": "You can even create more shelters for pollinators in your garden. For example, consider adding a bee hotel or a pile of dead wood. "
        },
        {
            "text": "A shallow bowl or tray filled with gravel and water can provide thirsty bees with a drink.  "
        },
        {
            "text": "5. Think carefully about whether to use pesticides. "
        },
        {
            "text": "Pesticides can harm pollinators and other wildlife, so it is important to reduce these wherever possible. "
        },
        {
            "text": "For example, companion planting can help to naturally reduce pests and diseases. "
        },
        {
            "text": "But, if you’re struggling to get a problem under control, consider pollinator-friendly alternatives instead.  "
        },
        {
            "text": "Go one step further to support pollinators "
        },
        {
            "text": "In addition to these 5 simple actions, you can also support pollinators in other ways. "
        },
        {
            "text": "This year, you can get involved with invaluable citizen science projects. All you need to do is spend 10 minutes watching flowers and insects in warm, dry weather. "
        },
        {
            "text": "The Flower-Insect Timed Count, known as a FIT count, is designed to collect new data on the number of flower-visiting insects. These counts are part of a wider set of surveys under the UK Pollinating Monitoring Scheme. "
        },
        {
            "text": "FIT counts can be done anywhere, including gardens and parks, any time from April to September. "
        },
        {
            "text": "Every count submitted to the scheme helps us learn more about where pollinators live and how their numbers are changing. "
        },
        {
            "text": "Last year, almost 600 people participated in the PoMS FIT Counts. "
        },
        {
            "text": "Many people across the UK are already doing their bit to help pollinators. "
        },
        {
            "text": "You can help pollinators too, by taking these 5 simple actions or spending 10 minutes monitoring flowers and insects. "
        },
        {
            "text": "If you or someone you know has worked hard to support pollinators near them, why not consider applying for the Bees’ Needs Champion Awards 2025? "
        },
        {
            "text": "And for more information on how you can help, visit the Bee’s Needs website and read instructions on how to submit FIT counts. "
        }
    ]
}