{
    "url": "https://traderemedies.blog.gov.uk/2024/07/08/arac_recruitment/",
    "title": "Recruitment - independent member of ARAC (digital)",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-07-08T14:58:47+01:00",
    "content": [
        {
            "heading": 3,
            "text": "The Trade Remedies Authority (TRA) is an arm’s length body of the Department for Business and Trade. Since 2021, we’ve had responsibility for guarding the UK against economic harm caused by unfair trading practices. We undertake investigations into imports to the UK which may be unfair due to dumping or subsidies, or part of an unforeseen import surge. "
        },
        {
            "text": "Our expert team of investigators, lawyers, verification specialists and analysts make evidence-based recommendations to the Secretary of State for Business and Trade on appropriate measures to defend UK economic interests. "
        },
        {
            "text": "We are recruiting an expert independent member to the Trade Remedies Authority Audit and Risk Assurance Committee. Our Audit and Risk Assurance Committee (ARAC) provides advice to the Board on the assurance and the soundness of TRA’s financial, risk, control and governance process. We are looking for someone with a strong and sustained track record in delivering digital and technology-led programmes on budget and on time.  Private sector experience is particularly welcomed."
        },
        {
            "heading": 3,
            "text": "ARAC"
        },
        {
            "text": "The ARAC Chair and one additional non-executive member are supported in their roles by two independent members, who bring specialist knowledge and further independent oversight (one is a trade lawyer and one is an experienced accountant).  We are seeking a third independent member to provide additional strength in testing the reliability and integrity of assurances in respect of our digital programme delivery and cyber risk management and controls. "
        },
        {
            "heading": 3,
            "text": "About you"
        },
        {
            "text": "You’ll need to have good communication skills and be prepared to challenge ARAC colleagues and TRA staff in a constructive, straightforward and open manner. Familiarisation with the oversight or implementation of cyber security arrangements or artificial intelligence would be advantageous.  "
        },
        {
            "heading": 3,
            "text": "About the role"
        },
        {
            "text": "This role is offered for an initial period of one year, with the possibility for a one-year extension. You will be an independent member of the TRA’s ARAC and not an employee of the TRA. "
        },
        {
            "text": " Remuneration is £5,000 per year (plus all travel expenses in line with TRA policies).  The fee will be subject to standard tax and NI deductions. Your time commitment will be required attendance at 4 in-person meetings (in Reading) and one awayday per year - plus meeting preparation time.  "
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": " To apply for this post please send the following to resourcing.enquiries@traderemedies.gov.uk no later than 11:55pm on 19 July 2024: "
        },
        {
            "text": "Applications will be sifted to select those demonstrating the best fit with the post. Feedback will only be offered to those who attend an informal chat. Please note that references and open-source due diligence checks (including into social media accounts) may be undertaken for all short-listed candidates. "
        }
    ]
}