{
    "url": "https://traderemedies.blog.gov.uk/2024/07/08/business-and-consumer-surveys-a-new-approach-to-gathering-evidence-for-our-investigations/",
    "title": "Business and consumer surveys: a new approach to gathering evidence for our investigations",
    "authors": [
        "Luksamon Boontho, Assistant Economist",
        "Joshua Parker, Head of Economics Unit"
    ],
    "categories": [
        "Analysis",
        "Engagement",
        "Investigations"
    ],
    "pub_date": "2024-07-08T09:06:38+01:00",
    "content": [
        {
            "text": "The TRA conducts investigations into allegations of unfair trading practices and makes recommendations to government on appropriate measures (such as tariffs) to defend UK economic interests. Here at the TRA, we’re trying to make it easier for supply chain businesses and consumers to participate in our investigations and we want to hear from you.  "
        },
        {
            "heading": 2,
            "text": "What has changed?  "
        },
        {
            "text": "To help us understand the impacts of imposed duties on the UK economy, we try to gather evidence from affected businesses and consumers. "
        },
        {
            "text": "Following a successful trial on the e-bikes transition reviews, we will now use online surveys instead of lengthier questionnaires to gather evidence from upstream and downstream businesses. In addition, we will seek survey responses from consumers for cases involving consumer products. "
        },
        {
            "heading": 2,
            "text": "Why are we making the change?  "
        },
        {
            "text": "On cases so far, we’ve tended to struggle to obtain evidence from consumers, and upstream and downstream businesses. These groups are typically less aware of our investigations and how they may be affected by trade remedies. We’ve found they also often lack the resources to submit responses to our questionnaires in the usual way.  "
        },
        {
            "text": "We don’t need as much evidence from these groups as we do from investigation applicants but their insights can help us build up a more complete picture of the impacts of potential or existing measures. So far, we’ve run surveys for the e-bikes, S-PVC and organic coated steel (OCS) investigations and we’ve seen a significant increase in the quantity and quality of evidence submitted through these. "
        },
        {
            "heading": 2,
            "text": "How can you participate? "
        },
        {
            "text": "If you’re a business or consumer who uses one of the products we are investigating, or if you make materials used to create those products, please take 10 minutes to complete a simple survey and help us understand how a duty might affect you.  "
        },
        {
            "heading": 3,
            "text": "Our live surveys at the moment: "
        },
        {
            "text": "Our surveys are usually open for a limited time so please stay tuned by following us on X(Twitter) and LinkedIn, so you won’t miss your chance to participate. You can also subscribe to our newsletter to make sure you’re up to date with our latest news. "
        },
        {
            "text": "Evidence submitted via surveys will only be used for the economic interest test and will not be used to assess dumping, injury or causation. Survey responses are anonymous for consumers and we will only publish a summary of responses.  "
        },
        {
            "text": "These surveys should not be completed by exporters, importers or UK manufacturers of the product subject to investigation. These parties should instead complete a questionnaire and upload to the Trade Remedies Service in the usual way. Questionnaires are more detailed and so will allow these parties to submit information relating to other parts of the investigation.  "
        },
        {
            "text": "Find out more about the economic interest test: "
        }
    ]
}