{
    "url": "https://icsdigital.blog.gov.uk/2024/07/08/lego-memes-and-a-made-up-department-running-training-for-ics-digital/",
    "title": "LEGO, memes and a made-up department - running training for ICS Digital",
    "authors": [
        "markmerifield"
    ],
    "categories": [
        "Skills and development"
    ],
    "pub_date": "2024-07-08T14:14:52+01:00",
    "content": [
        {
            "text": "Chris O’Dowd always gets a laugh. The IT Crowd’s ‘have you tried turning it off and on again’ meme makes for an amusing counterpoint, acknowledging the mistaken idea that Digital is just IT."
        },
        {
            "text": "For those that consider standards and controls to be a blocker to progress, that’s when Gandalf comes out, ‘You shall not pass!’ We are, of course, neither."
        },
        {
            "text": "Yes, I use memes in training. Also, LEGO, emojis and a fictional department from 14 years ago. I run our ‘introduction to ICS Digital’ training (we cover our services, agile, governance, and buying digital). They are fun to do, and essential for new members of staff or those about to embark on digital projects. But running virtual training sessions can be a challenge."
        },
        {
            "text": "I ran these sessions for Learning at Work Week. Our Integrated Corporate Services Learning and Development team coordinates the week’s activities for ourselves, DSIT and DESNZ. It is a terrific opportunity to celebrate the power and joy of learning."
        },
        {
            "text": "'Use more examples'"
        },
        {
            "text": "Feedback is an essential part of training if you act on it. It is one of the lessons in the agile session: listen, change, listen again. Previous comments were, ‘use more examples.’ This is helpful feedback; the subjects are broad yet full of detail. People spend weeks learning agile. I have 45 minutes, including questions, to get my audience up to working knowledge."
        },
        {
            "text": "A short example is perfect to bring a point to life; it gives the audience a means of understanding the theory through showing the practice. I added more examples."
        },
        {
            "text": "Who is DoRA?"
        },
        {
            "text": "This is where DoRA comes in. DoRA is the Department of Random Activities. She was formed in 2010 by The National Archives’ Digital Continuity Project Team for our training. She allowed us to create problematic scenarios without pointing fingers. Time to bring her back."
        },
        {
            "text": "I give my audience a role, like Business Partner. Then I give them a scenario, like an email from someone who has bought some unsanctioned and potentially risky service licenses without telling us. Each component is based on something I have experienced. Realism is important in making it work. No one gets named or shamed."
        },
        {
            "text": "What about the Lego?"
        },
        {
            "text": "Scenarios still have their limitations. Virtual problems can be hard to get across to those unfamiliar with the processes or technologies involved. That is when I turn to real objects; like using tinned food to teach metadata."
        },
        {
            "text": "If I need to explain the building blocks approach for development in agile, what better to use than building blocks? This is where the LEGO comes in. I can show a service developing in a modular way, I can ask for a change, I can show how it’s harder to change when you’ve finished building than when you are part way through."
        },
        {
            "text": "Getting the virtual room involved"
        },
        {
            "text": "The training is fully virtual with up to 100 staff across 7 locations. MS Teams is an efficient tool in these circumstances, but impersonal. I am hidden by my slides; my audience is hidden muted and off camera. Where now is the room’s collective personality? One thing that has not changed is we still don’t like answering questions in public! Polls can work to improve engagement; I’ll see if there is room for one next time."
        },
        {
            "text": "For me, I like the react button. Choose an emoji response for your audience and enjoy a wave of laughter or a wall of love. I am convinced it brings smiles."
        }
    ]
}