{
    "url": "https://educationhub.blog.gov.uk/2024/07/letter-to-the-education-workforce-from-education-secretary-bridget-phillipson/",
    "title": "Letter to the education workforce from Education Secretary Bridget Phillipson",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "early years",
        "Further education",
        "Higher Education",
        "Schools",
        "SEND"
    ],
    "pub_date": "2024-07-08T11:14:52+01:00",
    "content": [
        {
            "text": "Education Secretary Bridget Phillipson has written a letter to the education workforces to make clear the valuable role they will play in the government’s agenda for change."
        },
        {
            "text": "To all working in early years, children’s services, schools, further and higher education,"
        },
        {
            "text": "It’s a huge privilege to write to you today to introduce myself as your new Secretary of State for Education and to thank you for your vital work. I want this moment to mark a reset in our relationship: under this new government, education will once again be at the heart of change and the forefront of national life. I can’t wait to start working together with you as we begin to transform our system so that young people get the skills, care and opportunities they deserve."
        },
        {
            "text": "I know how hard you work to support our learners and families; you are key to breaking down barriers to opportunity and improving life chances for every child. You have supported our children and young people through a great deal of disruption – guiding their curiosity, building their resilience, and helping them achieve and thrive. You and your work are essential to the change this government wants to achieve across the country, and I want our renewed relationship to reflect that."
        },
        {
            "text": "My commitment to the sector is deeply personal. I grew up in a family that knew the value of a good education. I was also fortunate enough to go to great local state schools filled with committed staff who saw the value and worth in each and every one of us. I’m so grateful for all the people in my life who nurtured within me a love of learning and the confidence to succeed – I would not be here without them."
        },
        {
            "text": "I know that I was very lucky, but life shouldn’t come down to luck. Lives are shaped by opportunity, but too many people simply don’t have the opportunities to succeed."
        },
        {
            "text": "I grew up on a council street in the Northeast of England. At that time in the 1980s and early ‘90s, it was a place with many challenges, where far too many children were held back by their background. But background should be no barrier to getting on."
        },
        {
            "text": "I am determined that we will drive change together. Working with all of you, we want to build a fairer society with a government that delivers the best life chances for every child. That’s what motivates me and that’s why we will work tirelessly to deliver on our opportunity mission, tackling barriers like inadequate housing and child poverty that undermine family security and make it so hard for children to learn."
        },
        {
            "text": "There’s a lot of work to be done to realise this mission against some major challenges. A huge part of my role is to understand the scale of the challenges you are facing, and the support needed to fix them. The scar of child poverty, severe financial pressures squeezing all your budgets, high workload, climbing vacancy rates, strain on care, mental health and SEND services, among many other issues, have made your jobs increasingly difficult. This is a tough inheritance – none of these have quick and easy solutions but I will work with and for you to find practical ways forward."
        },
        {
            "text": "Supported by your experience and expertise, this government will expand our early years education system, drive high and rising standards and reform curriculum and assessment. Work to recruit 6,500 new expert teachers for our schools and colleges starts now, and we will bring forward a comprehensive strategy for post‐16 education, work with local government to provide loving, secure homes for children in care, provide support for children with SEND and their families, and create higher-quality training and employment paths by empowering local communities to develop the skills people need. We will secure the future of our world class universities as engines of growth, ambition and opportunity for all."
        },
        {
            "text": "This change is simple to describe, but vast to deliver. Government can’t do it alone – we will work with you as essential and valued partners to deliver our shared mission. I want to renew the trust and respect we hold for each other. My commitment to you is to listen, to draw on your wealth of experience and to act on your honest feedback."
        },
        {
            "text": "As an initial step, I want to invite you to join me for a live event at 4pm on Tuesday 16th July where I’ll share more about my vision for the education system, but I really want to hear from you too. There will be a chance for you to share your views and ask me questions in the live chat function."
        },
        {
            "text": "I very much look forward to meeting as many of you as possible and working together to break down barriers to opportunity, give all children the best life chances and make sure there is no ceiling on the ambitions of our young people."
        },
        {
            "text": "Yours sincerely,"
        },
        {
            "text": "Bridget Phillipson"
        },
        {
            "text": "Secretary of State for Education"
        }
    ]
}