{
    "url": "https://nationalscreening.blog.gov.uk/2024/07/08/new-screening-masterclass-dates-announced-2/",
    "title": "New screening masterclass dates announced",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-07-08T10:00:30+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has announced 2 new dates for its popular screening masterclass."
        },
        {
            "text": "These masterclass sessions will run on:"
        },
        {
            "text": "Places are always highly sought after, so please apply early to avoid missing out."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Screening masterclasses are run by the screening team in DHSC which support the work of the UK NSC, and other screening experts. It is a great interactive learning session for people from a wide range of backgrounds and with varying levels of screening knowledge"
        },
        {
            "text": "Sessions are held over Microsoft Teams and use different teaching methods, including case studies, quizzes (to test how well the facilitators have delivered the knowledge, not to catch anyone out) and practical exercises."
        },
        {
            "text": "The day session includes an in-depth look at:"
        },
        {
            "text": "We leave space in the programme for experience sharing, questions and your feedback."
        },
        {
            "text": "The classes are facilitated by screening expert Dr Angela Raffle, supported by Jo Harcombe and Nadia Permalloo."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}