{
    "url": "https://cspl.blog.gov.uk/2024/07/08/setting-the-standard/",
    "title": "Setting the Standard",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "Elections",
        "Ethical standards",
        "MPs",
        "Nolan Principles",
        "Public appointments"
    ],
    "pub_date": "2024-07-08T11:28:26+01:00",
    "content": [
        {
            "text": "The days after a general election, especially when power transfers to another political party, are a hectic time in government. After campaigning hard and knocking on doors, the new teams and staffers must familiarise themselves with their roles and departmental briefs. Impartial civil servants must turn and serve the new administration and be ready to deliver their policies."
        },
        {
            "text": "And this week 335 completely new MPs will arrive in Westminster to take up their seats in Parliament. Like any new job, there is always a steep learning curve and for many it may be their first step into public life. There is a unique aspect to holding public office, that of service. At its core that means they must take decisions on behalf of the public and do so in their wider interest. "
        },
        {
            "text": "Lord Nolan’s principles - Honesty, Openness, Objectivity, Selflessness, Integrity, Accountability and Leadership - represent the standards that the public expects those in public life to operate by on their behalf. They have stood the test of time and are  the bedrock of a range of rules and codes of conduct, including the Code of Conduct for MPs owned by the House of Commons. "
        },
        {
            "text": "Following these Principles doesn’t mean that the public will always like the decisions taken - or that the decisions made are perfect every time.  But it does give public office holders - and the public - a framework to consider whether their decisions and conduct are taken in the public interest rather than their own."
        },
        {
            "text": "Along with the Parliamentary Commissioner for Standards, the Independent Complaints and Grievance Scheme, the Independent Parliamentary Standards Authority, and the Electoral Commission, I will be playing a part in the induction days for new MPs - more than half the House of Commons. At a time when trust in public life is so fragile, I urge all MPs to hold those Principles close and seek advice from the regulators and clerks if in doubt. Most MPs undoubtedly want to do the right thing, but negative stories about a minority have done immeasurable damage to the perception of Parliament and government over the years.  This perception can be changed."
        },
        {
            "text": "The new PM will soon issue a Ministerial Code clarifying the standards of conduct he expects of his team. Ministers will be expected to act in line with that Code and the principles that underlie it. New Ministers will already have started declaring any conflicts of interest and will be expected to resolve those, seeking advice from the Independent Adviser on Ministers’ Interests. Similarly, Ministers and civil servants leaving public office must protect the integrity of government by ensuring their moves to new roles are properly risk assessed under the Business Appointment Rules. "
        },
        {
            "text": "The standards landscape is undeniably complex, and the patchwork of largely non-statutory structures and regulators has been stress tested in recent years. Many of those structures were created as result of CSPL recommendations over the last 30 years. Our 2021 landscape review ‘Upholding Standards in Public Life’ - along with reports from other bodies, academics and think tanks - proposed a strengthening of the system to provide greater independence, clearer rules and a stronger compliance culture in central government to help build and maintain wider public trust. There is unfinished business here requiring proper attention to address major risks to standards. "
        },
        {
            "text": "We welcome the new government’s clear commitment to high standards in their election manifesto and the Prime Minister’s statements - and the Committee stands ready to play its part, helping to promote and maintain the highest standards of conduct across public life. "
        },
        {
            "text": " "
        },
        {
            "text": "What are the seven Principles of Public Life?"
        },
        {
            "text": "Find out more about the Committee’s current review looking at accountability within public bodies and the importance of acting on early warning signs."
        },
        {
            "text": "Watch a short video about the work of the Committee"
        },
        {
            "text": " "
        }
    ]
}