{
    "url": "https://nationalscreening.blog.gov.uk/2025/12/02/consultation-opens-on-evidence-relating-to-screening-pregnant-women-for-anaemia/",
    "title": "Consultation opens on evidence relating to screening pregnant women for anaemia",
    "authors": [
        "Omaer Syed"
    ],
    "categories": [
        "Antenatal screening"
    ],
    "pub_date": "2025-12-02T08:51:53+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to screening for iron deficiency anaemia (IDA) in pregnancy."
        },
        {
            "text": "The UK NSC does not currently recommend screening for this condition."
        },
        {
            "text": "We are asking individuals and organisations to provide feedback on the findings and conclusions of a 2025 evidence map, which was commissioned to review literature on the topic published since the previous evidence review in 2021. Evidence maps are typically the first step in the UK NSC evidence review process. "
        },
        {
            "text": "The 2025 evidence map concludes that the volume and type of new evidence related to screening for IDA in pregnancy is currently insufficient to justify more in-depth work at this time. It recommends that the topic should be re-considered in 3 years’ time."
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "heading": 2,
            "text": "About IDA in pregnancy"
        },
        {
            "text": "Iron deficiency anaemia is caused by a lack of iron and is common in pregnancy. Symptoms can include tiredness, shortness of breath, heart palpitations and headaches. Anaemia during pregnancy is associated with various health complications for mother and baby."
        },
        {
            "text": "IDA accounts for almost 75% cases of anaemia in pregnancy. A multicentre study conducted from 2018 to 2019 across 86 maternity units in the UK and Ireland reported an overall prevalence of IDA during pregnancy of 30%."
        },
        {
            "text": "Iron tablets are recommended for pregnant women who are anaemic. However, mild-to-moderate IDA is often asymptomatic, and the benefits and harms of treating pregnant women with mild to moderate IDA are not well established."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "A 2021 UK NSC evidence summary did not recommend screening because the available evidence on the benefits and harms of treatment was limited and deemed poor quality."
        },
        {
            "text": "The 2025 evidence map identified new published evidence since 2021. It found:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}