{
    "url": "https://marinedevelopments.blog.gov.uk/2025/12/02/countdown-to-eu-iuu-regulation-changes/",
    "title": "Countdown to EU IUU Regulation Changes ",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Fish and seafood exporting",
        "fisheries"
    ],
    "pub_date": "2025-12-02T13:39:15+00:00",
    "content": [
        {
            "text": "As of today, there are 39 days left until 10 January 2026, when the new EU Illegal, Unreported, and Unregulated (IUU) fishing regulations come into effect. "
        },
        {
            "text": "We’re supporting all those involved in the UK seafood supply chain, so they can prepare and adopt to the changes in advance. This includes dedicated guidance for: "
        },
        {
            "text": "If you’ve not done so already, the clock is ticking and now is the time to dive deeper into the existing guidance and familiarise yourself with these changes. "
        },
        {
            "text": "This will help to avoid any disruption after 10 January, ensure a smooth transition for the whole industry and safeguard your access to sales and exporter markets. "
        },
        {
            "text": "Reflecting on our last webinar "
        },
        {
            "text": "On 19 November 2025, we hosted the Fish, Trace, Ship Webinar - ‘Navigating the New Seafood Export Rules’ "
        },
        {
            "text": "This session placed greater emphasis on new labelling requirements and recent EU regulatory changes compared to the two previous sessions on 22 October and 5 November 2025. "
        },
        {
            "text": "Watch the recap  "
        },
        {
            "text": "Upcoming Online Meeting - Save the date "
        },
        {
            "text": "If you were unable to join our previous webinars, we invite you to join us at our next online meetings on: "
        },
        {
            "text": "These sessions are your chance to learn practical steps for ensuring compliance and get your questions answered as we approach the January deadline. "
        },
        {
            "text": "Fish, Trace, Ship, video guide series  "
        },
        {
            "text": "We’ve produced a useful video guide series. These are available to view on YouTube and cover some of the most important aspects of the incoming changes. "
        },
        {
            "text": "Want to be kept up to date? "
        },
        {
            "text": "Visit our dedicated Fish, Trace Ship campaign site: Fish, Trace, Ship - Act Now! Are you on board? "
        },
        {
            "text": "You can also sign-up to our mailing list to be kept in the loop about all changes, webinars and events. "
        }
    ]
}