{
    "url": "https://defradigital.blog.gov.uk/2025/12/02/grief-in-the-workplace-supporting-each-other-during-national-grief-awareness-week-and-beyond/",
    "title": "Grief in the workplace: supporting each other during National Grief Awareness Week and beyond",
    "authors": [
        "Leyla Kee-McParlin"
    ],
    "categories": [
        "Awareness",
        "Defra digital"
    ],
    "pub_date": "2025-12-02T08:47:20+00:00",
    "content": [
        {
            "text": "Please be aware that this blog discusses bereavement and grief. There are resources at the end of this blog if you are affected by these topics and need support."
        },
        {
            "text": "Have you ever carried a pain that no one else can see? I hadn’t until 12 months ago, when I experienced grief."
        },
        {
            "text": "As you read this blog post, it might still be National Grief Awareness Week. It might not be. It doesn’t matter because grief awareness shouldn’t be something just for one week."
        },
        {
            "text": "I want to write about why it matters to talk about grief at work, its impact and support you can find. I’ll also share my grief story in the hope that it gives you the confidence to share yours whenever it feels right for you."
        },
        {
            "heading": 2,
            "text": "Why we need to talk about grief at work"
        },
        {
            "text": "Grief isn’t polite enough to keep certain hours. It can (and will) pop up as an unwanted guest at any time during your working day."
        },
        {
            "text": "It also isn’t just something that happens because of a loved one’s death. It’s a result of any sort of life change. It affects so many more of us than you’d think: perhaps the illness of a loved one or the ending of a relationship."
        },
        {
            "text": "If we can talk about grief, then we can take a little bit of power back from it. When we do that, we help create compassionate workplaces."
        },
        {
            "heading": 2,
            "text": "My grief story"
        },
        {
            "text": "It started with 'anticipatory grief’. This is the feeling of loss when someone’s still with you. It happened to me when my nan was diagnosed with dementia."
        },
        {
            "text": "I was raised by my nan and lived with her until I was 11 years old. Years later, the tables turned and I became one of her primary carers along with my mum. I’ve heard dementia described as the “the long goodbye”, and it is, because it lasted just under ten years. In early October 2025, she sadly passed away."
        },
        {
            "text": "I barely had two weeks to process my nan’s passing, before my dad then unexpectedly passed away. Losing a parent was one of my biggest fears, but I naively thought it’d never happen."
        },
        {
            "text": "This caused me to experience 'cumulative grief’, where you don’t have time to process one loss before another happens. My doctor advised me to take some extended time off. If you asked me to describe cumulative grief, it’s like an agonising swim up to the water’s surface when something awful from the deep pulls you back down again... repeatedly."
        },
        {
            "heading": 2,
            "text": "The impact of grief"
        },
        {
            "text": "It’s a hugely challenging period which affects your concentration, energy and mental health. I realised that no matter what I did, I was going to find it hard. You put pressure on yourself to 'carry on'."
        },
        {
            "text": "There’s a person you think you know before grief, and a person you discover after grief. You start to panic and worry that you’ll never see that pre-grief person ever again. "
        },
        {
            "text": "However, there can be a positive aspect to experiencing your grief in the open. It can encourage growth and emotional intelligence not only in yourself but others around you. They play a huge role in creating that space for support."
        },
        {
            "heading": 2,
            "text": "How we can support each other"
        },
        {
            "text": "Returning to work can feel overwhelming. For me, I’d lost 2 of my biggest life cheerleaders. I felt like I was no longer Superman, just Clark Kent. However, I recently found the journal that my grief counsellor encouraged me to keep during this time."
        },
        {
            "text": "A line stood out loud and clear: "
        },
        {
            "text": "Looking back, there were 3 things that helped me the most:"
        },
        {
            "heading": 2,
            "text": "Where you can find support"
        },
        {
            "text": "It depends where you work, but you might be able to access:"
        },
        {
            "text": "There are also helpful external resources like:"
        },
        {
            "heading": 2,
            "text": "Sharing your grief stories"
        },
        {
            "text": "This year’s theme for National Grief Awareness Week is ‘Growing with Grief’, focusing on finding hope and renewal after loss. The theme of renewal is literal for me, as I now plant my spring bulbs on my loved ones’ anniversaries in October."
        },
        {
            "text": "By openly acknowledging grief’s existence, breaking down the stigma and supporting each other then we might be able to normalise grief and feel more empowered."
        },
        {
            "text": "Grief isn’t a weakness. It’s a real part of being human. It’s changed me for the better."
        }
    ]
}