{
    "url": "https://naturalengland.blog.gov.uk/2025/12/02/landscape-recovery-and-growth-building-the-foundations-for-critical-nature-infrastructure/",
    "title": "Landscape Recovery and growth: building the foundations for critical nature infrastructure ",
    "authors": [
        "Chris Davis"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Environmental Improvement Plan",
        "Farming",
        "Green Infrastructure",
        "Growth",
        "Landscape",
        "Natural Capital",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "wildlife and farming"
    ],
    "pub_date": "2025-12-02T10:54:22+00:00",
    "content": [
        {
            "text": "By Chris Davis, Natural England’s Deputy Director for Landscape Recovery and Schemes Development"
        },
        {
            "text": "At a time when the UK is facing serious environmental challenges such as climate change and loss of wildlife, restoring and protecting our natural capital is one of the most effective investments we can make as a society."
        },
        {
            "text": "Droughts and floods disrupt supply chains; soil degradation cuts productivity; loss of pollinators threatens food security; and climate-related damage to infrastructure is already costing hundreds of millions per year.  That is why we welcome Defra’s announcement that, as part of the revised Environmental Improvement Plan, £500 million will be allocated to the future of Landscape Recovery Projects across the country. "
        },
        {
            "heading": 4,
            "text": "What is Landscape Recovery?"
        },
        {
            "text": "The Landscape Recovery Scheme is one of three Environmental Land Management Schemes (ELMS). It supports farmers and land managers to undertake large-scale, long-term projects focused on significant habitat restoration and land-use change.  "
        },
        {
            "text": "The Scheme will support large-scale nature recovery. Projects will help reverse biodiversity loss, tackle climate change, and unlock green economic growth, while securing sustainable livelihoods for the farmers and land managers taking part.  Landscape Recovery will also drive progress towards government environment targets, as set out in the revised Environmental Improvement Plan, which was published yesterday. "
        },
        {
            "heading": 4,
            "text": "Landscape Recovery – pilot rounds "
        },
        {
            "text": "The first two rounds of Landscape Recovery are pilot rounds, with more than 50 projects in development.  This allows delivery bodies to test and trial the scheme and learn lessons ahead of future rounds.  One of the first projects to enter the delivery phase is called Upper Duddon Landscape Recovery. The project will support the local community by providing new opportunities for nature-based learning and volunteering, improving access, creating and supporting 14 local jobs and ensuring a vibrant future for eight farms, including tenant farmers.  "
        },
        {
            "text": "Why is Landscape Recovery important? "
        },
        {
            "text": "Landscape Recovery Projects will help demonstrate how environmental outcomes can be achieved alongside sustainable food production.  They will also provide wider public goods such as increasing biodiversity, improving water quality, and contributing to our net zero target.  "
        },
        {
            "text": "Last week Defra Secretary of State, Emma Reynolds, visited the Ock and Thame Landscape Recovery Project.  She heard how the project, which is being led by farmers alongside Freshwater Habitats Trust and River Thame Conservation Trust, is bringing together 80 participants across nearly 8,000 hectares with plans to deliver landscape recovery and build a freshwater network across two lowland catchments. This project plans to support net zero, boost stewardship of protected sites and increase biodiversity, while balancing the needs of farm businesses and food production.  "
        },
        {
            "heading": 4,
            "text": "Blending public and private finance"
        },
        {
            "text": "Successful projects are required to blend public and private finance. This approach aims to establish a framework to attract private investment into large-scale, nature-based projects. This opens the door for financial innovation in areas such as carbon markets and water quality improvements, enabling landowners, investors, and stakeholders to engage in tangible environmental outcomes. "
        },
        {
            "text": "A blended finance model reduces reliance on public funding which cannot meet the scale of nature recovery needed for the UK’s legal environmental targets alone. It also unlocks opportunities for sustainable economic growth, particularly in rural and under-invested landscapes. By enabling projects to access private nature markets, we can scale Landscape Recovery in a way that is both resilient and financially sustainable.   "
        },
        {
            "text": "Landscape Recovery projects aim to meet increasing market demand for Biodiversity Net Gain, Carbon Credits and explore new market opportunities including water quality offsets and payments for natural flood management."
        },
        {
            "heading": 4,
            "text": " Working in partnership"
        },
        {
            "text": "Nattergal’s Boothby Wildland, for example, has entered into a partnership with Arup for nature-based carbon removal, highlighting the emerging role of private sector participation in driving natural capital markets. It demonstrates that nature recovery can become a viable revenue stream, incentivising long-term stewardship of the land and creating models that could be replicated in other areas. "
        },
        {
            "text": "Upper Duddon is also an excellent example of blended finance in action, bringing together support from multiple partners to drive nature recovery. The United Bank of Carbon is funding volunteering and community engagement. United Utilities is providing investment that will deliver land management changes that will improve water quality for communities across South-West Cumbria and help reduce downstream flooding. "
        },
        {
            "text": "Landscape Recovery is not just about restoring nature - it is about redefining how we value and invest in the natural environment."
        },
        {
            "text": "By aligning the goals of public policy with private investment opportunities, we are establishing a new model to invest in national nature infrastructure that delivers for farmers, wildlife, the economy, and people."
        }
    ]
}