{
    "url": "https://digitaltrade.blog.gov.uk/2025/12/02/leading-with-kindness-on-digital-change-engagement-and-adoption/",
    "title": "Leading with kindness on digital change, engagement and adoption",
    "authors": [
        "Stephanie Chaytor, Head of Engagement and Strategic Adoption"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2025-12-02T09:47:42+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Stephanie Chaytor"
        },
        {
            "text": "Across government, we are modernising our workforce to build a more productive and agile state that delivers maximum value to the public and the businesses we support. At DBT, the Engagement and Strategic Adoption team continually works to engage colleagues across the department around emerging technological changes and on the ongoing adoption of digital products and services."
        },
        {
            "text": "Managing these changes requires careful and thoughtful communication - kindness and understanding are so important and this is where change management practices can really help us. We’ve found that digital adoption and emerging tech changes can really benefit from this human centric approach, helping us better identify emerging concerns and reasons for resistance more effectively. By integrating change methodologies, organisations like DBT can better respond to the barriers we face on modernisation. They give us the best chance of success for delivery and, importantly, help to ensure our people aren’t left behind."
        },
        {
            "heading": 2,
            "text": "Understanding adoption and change management"
        },
        {
            "text": "Digital adoption or product adoption is the process by which individuals and organisations integrate digital tools into their daily practices and ways of working. This involves not just installing or updating technology but ensuring people understand it and can consistently benefit from its usage. "
        },
        {
            "text": "Change management involves preparing and supporting people as they adapt to new ways of working or thinking, addressing concerns along the way. Effective methodologies can help tailor approaches to different teams and areas, improving adoption outcomes."
        },
        {
            "text": "Success depends on how (or if!) people use technology; guiding them through change is as important as the technical implementation itself."
        },
        {
            "heading": 2,
            "text": "Supporting staff through the change and adoption stages "
        },
        {
            "text": "To address this effectively, the Prosci ADKAR model, when considered alongside the product adoption process, provides a robust framework to guide our modernisation efforts."
        },
        {
            "text": "This model is particularly well-suited for digital change initiatives as it emphasises individual adoption, offers a structured step-by-step approach (Awareness, Desire, Knowledge, Ability, Reinforcement), proactively manages resistance, ensures the development of required skills and confidence for new technologies, and incorporates reinforcement mechanisms to sustain change - all of which are critical for successful digital transformation. In contrast, Lewin’s Change Model (Unfreeze – Change - Refreeze) presumes a static end state post-change, whereas digital transformation is inherently continuous and iterative, making \"refreezing\" impractical. Lewin’s model, and others like it, don’t prioritise individual adoption or ongoing adaptation."
        },
        {
            "text": "The product adoption process and ADKAR models both underscore the significance of individuals’ attitudes and engagement with a product or change from the outset. Both processes begin by building awareness and articulating the associated benefits - this initiates interest and encourages active participation. Change management and adoption are further supported by building knowledge through structured training and leadership modelling, essential for enabling both the trial and adoption phases. According to the ADKAR model, sustaining new practices relies upon continuous reinforcement. Digital and change teams encounter fresh challenges here because achieving sustained, long-term adoption and change depends on continuous dedication and collaboration from teams across the department. They must manage and prioritise this responsibility in addition to their already demanding day to day work."
        },
        {
            "text": "At DBT, we are working to capitalise on our network of change advisors and intentionally integrate expertise in both change management and digital disciplines in our ongoing work. By reinforcing this methodology, we can enhance our capacity to guide the department through major digital transformation initiatives, such as Windows 11 upgrades, Machinery of Government (MoG) changes, and more targeted projects like driving adoption on our internal Customer Relationship Management (CRM) Data Hub and AI tools like Co-pilot."
        },
        {
            "text": "We are aligning our strategies for adoption with a comprehensive understanding of the human factors that may hinder behavioural change. Ultimately, our approach to technical change and digital adoption is about prioritising our people."
        },
        {
            "heading": 2,
            "text": "Human-focussed engagement"
        },
        {
            "text": "Our people are our most important asset. Supporting them to stay productive in the delivery of their own objectives as they navigate the demands of a fast-paced, ever-changing technical landscape is essential for a successful modern workforce."
        },
        {
            "text": "It’s natural for colleagues to have concerns about new and existing technologies - especially as these tools become more prevalent and complex. These concerns can influence both individual attitudes and organisational values, particularly in areas like AI, where the pace of change and the level of apprehension around usage and ethics can feel much more complicated."
        },
        {
            "text": "It's important to address concerns directly, making sure our messages about digital changes are clear and consistent. Communications and support should always feel genuinely peer-to-peer, it should be encouraging and free from confusing jargon and it should never feel patronising. Meeting people where they are, and recognising their current attitudes and understanding, helps everyone learn and adapt together. This approach allows us to adjust our communications and support as we progress, so colleagues feel genuinely supported throughout and can recognise the positive impact of change on their work."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "If you’re reading this blog, I would invite you to reflect on your own role in driving change in your own organisation. If you are a leader, model the behaviours you want to see - communicate openly, listen to concerns, and champion a culture of kindness and inclusion. By actively supporting your colleagues through digital changes, you set the tone for successful adoption and lasting positive impact. If you’re part of a digital team, go beyond delivering solutions - take time to understand the needs, concerns, and levels of understanding held by different colleagues and teams. Remember they are experts on their own work, not on all things digital. By putting people first, you help ensure that digital change is not only successful but also inclusive and sustainable."
        },
        {
            "text": "Embracing digital change and product adoption is not just about adopting new technologies, it’s about supporting people through every stage of the journey. By prioritising kindness, clear communication, and a human-centred approach, we can overcome challenges and ensure that no one is left behind."
        },
        {
            "text": "At DBT, our commitment to thoughtful change management and digital adoption can hopefully best support colleagues to thrive in an ever-evolving environment. Working together, we can build a modern, agile workforce that delivers real value to the public and the businesses we serve."
        }
    ]
}