{
    "url": "https://defraenvironment.blog.gov.uk/2025/12/02/publishing-the-environmental-improvement-plan-turning-ambition-into-action-for-nature/",
    "title": "Publishing the Environmental Improvement Plan - turning ambition into action for nature",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Access and engagement",
        "Air quality",
        "Biosecurity",
        "Chemicals and pesticides",
        "Climate change",
        "Environmental Improvement Plan",
        "Nature",
        "Resources and waste",
        "Water"
    ],
    "pub_date": "2025-12-02T13:36:01+00:00",
    "content": [
        {
            "text": "We have published (1 December) our revised Environmental Improvement Plan – a clear roadmap for restoring nature."
        },
        {
            "text": "The previous plan lacked the rigour and detail to turn intent into impact. This government is determined to put that right. Our revised Environmental Improvement plan is both ambitious and deliverable."
        },
        {
            "text": "Over the next five years, it will accelerate progress towards the Environment Act targets and help us tackle the challenges posed by the nature and climate crises, while supporting growth."
        },
        {
            "text": "What's in the plan"
        },
        {
            "text": "The Environmental Improvement Plan explains how each action contributes to our environmental commitments. It includes prioritised actions to deliver our goals and the ambitious Environment Act targets."
        },
        {
            "text": "The plan provides detail and makes clear who is accountable for delivering each commitment. In turn, each commitment is linked to measurable outcomes, so progress can be tracked and assessed transparently."
        },
        {
            "text": "For the first time, we've published detailed Environment Act target delivery plans which build on the steps in the EIP. This will make it easier for the public to clearly understand where progress is being made and help fix the lack of rigour in the previous plan."
        },
        {
            "text": "Having this clarity will allow us to manage competing pressures on our limited land and water, place nature at the heart of our ambition to grow the economy, build 1.5 million homes, boost food security, and meet our climate targets."
        },
        {
            "text": "It will help us to restore nature, improve environmental quality, create a circular economy, protect environmental security and improve people's access to nature."
        },
        {
            "text": "Why we need to act now"
        },
        {
            "text": "For too long, the status quo has not worked. Despite the green countryside we all love, England has become one of the most nature depleted countries in the world. In Great Britain alone, nearly one in six species are threatened with extinction."
        },
        {
            "text": "We've lost 97% of our wildflower meadows and half our hedgerows. Our rivers and lakes suffer unacceptable levels of pollution. Climate change is already devastating communities through flooding and drought."
        },
        {
            "text": "Nature isn't a luxury – it's life itself. It gives us the air we breathe, the food we eat and the water we drink. Nature underpins our health, wellbeing, and economy – and protecting and restoring it strengthens our resilience."
        },
        {
            "text": "Cleaner air for healthier communities"
        },
        {
            "text": "Communities across England will benefit from improved air quality thanks to action to tackle fine particulate pollution (PM2.5), which harms public health and can cause asthma, lung and heart conditions. Under a new ambitious interim target, population exposure to this type of pollution will be reduced by 30% by 2030 when compared to 2018 levels."
        },
        {
            "text": "Boosting nature and wildlife"
        },
        {
            "text": "Nature will be boosted with a quarter of a million hectares of wildlife-rich habitats created or restored by 2030 – an area larger than Greater London. This is 110,000 hectares of habitat more than had been previously committed, supporting our aims for a healthier environment which is essential to growth."
        },
        {
            "text": "Efforts to tackle damaging invasive species, will be stepped up with a new target to reduce their presence by half compared to 25 years ago. This target will help prevent new invasive species from becoming established and support ongoing efforts to manage existing invaders like the American Signal Crayfish and Japanese Knotweed."
        },
        {
            "text": "We will publish a new Trees Action Plan to help get more trees in the ground. This will also help drive further progress towards our climate targets, alongside exploring measures to reduce damaging methane emissions, particularly from the agricultural sector."
        },
        {
            "text": "Protecting our water"
        },
        {
            "text": "To help improve the health of our rivers, lakes and seas, we will set out for the first time how we will reduce risks to health and to the environment from 'forever chemicals' (PFAS) that are associated with the manufacture of everyday items and industrial applications."
        },
        {
            "text": "The rules around spreading sewage sludge to agricultural land will also be reviewed to ensure it is sustainable and effectively manages the risk to the environment and health."
        },
        {
            "text": "Backing our plan with investment"
        },
        {
            "text": "We're backing our commitment with substantial investment."
        },
        {
            "text": "Up to £500 million will be committed to restoring nature, reducing flood risk and boosting biodiversity through our Landscape Recovery scheme. This funding will power ambitious, collaborative projects to restore nature and drive progress to deliver our environmental targets."
        },
        {
            "text": "These projects bring together farmers, landowners third sector and other groups to work at landscape scale – creating wildlife corridors, restoring peatlands and wetlands, and establishing habitats that will benefit both nature and people for generations to come. These unique, collaborative projects will achieve ambitious nature recovery specific to their local area, including boosting biodiversity, creating wildlife-rich environments for people to enjoy, reducing flood risk in vulnerable areas and improving water quality in local rivers and streams."
        },
        {
            "text": "Building on this landscape-scale approach, £85 million will improve and restore peatlands, helping reduce flooding in communities and improve water quality. A further £3 million will improve access to nature in the Public Forest Estates through facilities including accessible bike trails and all-terrain mobility equipment for hire at parks and nature reserves."
        },
        {
            "text": "This announcement follows our commitment to create two new National Forests, backed by £1 billion investment in tree planting – transforming landscapes and creating natural havens for wildlife and people alike. It also builds on the reintroduction of beavers to the wild and our commitment to end the use of bee killing pesticides."
        },
        {
            "text": "Working together to deliver"
        },
        {
            "text": "Everyone needs to come together to play their part to save nature."
        },
        {
            "text": "Our plan shows how we will work alongside individuals and communities, and public, private and third sector organisations, to achieve our nature ambitions. Only by working together can we achieve our statutory environmental targets and other commitments, including protecting 30% of our land and sea by 2030."
        },
        {
            "text": "We know that environmental organisations, communities and individuals across the country care deeply about nature's recovery. This plan has been developed to provide the level of detail and transparency needed to demonstrate our commitment – and to enable transparency over our progress."
        },
        {
            "text": "We refuse to be the generation that lets nature slip away. We are determined to ensure our children inherit the wild, beautiful country they deserve."
        },
        {
            "text": "From the rolling hills of the Yorkshire Dales to the iconic British coastline, Britain's landscapes are a source of pride and joy for millions. When we invest in nature, we're investing in flood protection for homes, cleaner air for our cities, better mental health for our communities, and a stable climate for future generations."
        },
        {
            "text": "Nature is not a luxury, it is essential. Investing in nature is an investment in our future – and this Environmental Improvement Plan sets out how we'll deliver it."
        },
        {
            "text": "Read the full Environmental Improvement Plan."
        }
    ]
}