{
    "url": "https://teaching.blog.gov.uk/2025/12/02/send-special-educational-needs-provision-primary-school/",
    "title": "Creating special educational needs provision: A primary school case study",
    "authors": [
        "Mark Nugent"
    ],
    "categories": [
        "Primary schools",
        "SEND"
    ],
    "pub_date": "2025-12-02T14:32:44+00:00",
    "content": [
        {
            "text": "At a glance"
        },
        {
            "text": "At Waterville Primary School, our motto ‘Being the best you can be’ applies to everyone."
        },
        {
            "text": "Our school serves a diverse community where over 63% of our pupils receive free school meals, and we see every opportunity to support children with special educational needs as part of our mission. "
        },
        {
            "heading": 2,
            "text": "Building SEN speech and language units"
        },
        {
            "text": "Our school has operated a successful twelve-place Additional Resource Provision (ARP), specialising in speech, language, and communication for many years. This consistent, highly-trained team provided the foundation for expansion. "
        },
        {
            "text": "Recognising clear progression needs, we proposed twelve additional SEN unit places for pupils with more significant speech, language, and communication needs. Due to our space constraints, our local authority provided capital funding for a purpose-built mobile classroom, featuring a main teaching classroom, break-out space for individual work, toilet and changing facilities, and an enclosed outdoor learning area."
        },
        {
            "text": "The planning phase proved crucial. Working with architects and builders, we prioritised pupil needs above all else. Sensory requirements influenced lighting, heating units, and colour choices, while our resource budget was spent on age-appropriate furniture and materials for 4-9 years olds. "
        },
        {
            "text": "We were fortunate to employ a teacher experienced in establishing SEN units who was re-locating to the North East. Combined with two experienced teaching assistants, our team was taking shape. As headteacher, I resisted interfering during the early stages, trusting appointed staff to build relationships with each other and, most importantly, the children. "
        },
        {
            "heading": 2,
            "text": "Maintaining academic performance with SEN integration"
        },
        {
            "text": "Our next challenge involves blending ARP and SEN unit work, enabling pupils to flow between provisions based on need. "
        },
        {
            "text": "As a mainstream school, we are very mindful that pupils with significant needs can sometimes have an impact on performance data. Governors discussed strategies to showcase the school's achievements across our community, ensuring every child's progress is recognised and valued. We’ve implemented measures like limiting both provisions to two pupils per year group, so no one cohort is significantly impacted.  "
        },
        {
            "text": "Importantly, with our ARP, pupil outcomes can still be incredibly positive. In my 18 years here as headteacher, our KS2 performance has only ever dropped below national averages twice. Children receiving ARP support have made excellent progress, regularly achieving national expectations. "
        },
        {
            "heading": 2,
            "text": "Overcoming SEN unit implementation challenges"
        },
        {
            "text": "Our biggest challenge was finance, though local authority support for both provision and staffing proved invaluable. Performance data concerns were unfounded – creating SEN provision doesn’t necessarily damage performance."
        },
        {
            "text": "Our next steps include inviting local headteachers and SEN coordinators to visit and understand our admissions process, and developing our curriculum offer in this new setting. "
        },
        {
            "text": "Our experience demonstrates that with careful planning, appropriate support, and committed staff, mainstream schools can successfully expand SEN provision while maintaining high standards for all pupils. The key lies in viewing challenges as opportunities to truly embody our motto of helping everyone be the best they can be."
        },
        {
            "heading": 2,
            "text": "Further links"
        }
    ]
}