{
    "url": "https://codigital.blog.gov.uk/2023/07/03/cabinet-office-digital-kim-team-win-prestigious-industry-award/",
    "title": "Cabinet Office Digital KIM Team win prestigious industry award",
    "authors": [
        "David Canning"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-03T12:29:18+01:00",
    "content": [
        {
            "text": "The Cabinet Office’s Digital Knowledge & Information Management (DKIM) Team has won a prestigious innovation award for its work on tackling the so called ‘digital heap’, saving the Cabinet Office millions of pounds."
        },
        {
            "text": "The accolade was awarded by the Information & Records Management Society (IRMS) at its annual conference in Manchester. The IRMS is the foremost association for information professionals, across all industry sectors, in the UK and beyond."
        },
        {
            "text": "The award winning Digital Knowledge & Information Management Team, which is part of Cabinet Office Digital, developed a ground breaking methodology and algorithm to automate the analysis of millions of legacy digital records, a task that would normally require team members to read every document and email before deciding whether they should be retained as an official record, or destroyed."
        },
        {
            "text": "Conquering the ‘digital heap’"
        },
        {
            "text": "Given the huge and continuing growth in the volume of digital information, all government departments need to develop new digital services and processes to manage their records to avoid losing control."
        },
        {
            "text": "Head of the DKIM Team, David Canning explains, “Where the growth of digital information goes unchecked and control is lost, that is where so called ‘digital heaps’ form. These operate rather like digital versions of the fatbergs that sometimes block our drains, cost us significant sums of money to maintain and need to be broken up as they present security, operational and legal risks to the entire system.”"
        },
        {
            "text": "Efficiency through automation"
        },
        {
            "text": "Managing large volumes of digital information carries a down stream cost too.  David and the team calculated that to review every document in one particular legacy system would have taken a person 59 years and cost over £2 million.  With the automated system the team has developed they were able to review the information in just one year and at a fraction of the cost, and it is a process that can be repeated so the savings will continue year on year."
        },
        {
            "text": "A First for the UK "
        },
        {
            "text": "David continued, “the approach we have taken is not just a first for the UK Government, we can’t find a comparator in any other sector, or anywhere else in the world.”"
        },
        {
            "text": "David and the team are now sharing the algorithm and their approach with colleagues in other government departments."
        }
    ]
}