{
    "url": "https://defrafarming.blog.gov.uk/2023/07/03/funding-available-for-high-growth-agri-tech-businesses/",
    "title": "Funding available for high-growth agri-tech businesses",
    "authors": [
        "Michael Reardon"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-07-03T14:43:39+01:00",
    "content": [
        {
            "text": "From 24 July, agri-tech businesses in the UK will be able to apply for a share of £5 million to further their enterprise through the Farming Innovation Investor Partnership competition. "
        },
        {
            "text": "This new competition is aimed at agri-tech businesses (companies that develop and implement new technology to make farming more efficient) in the UK that can demonstrate the potential to grow and generate revenue through their farm-focused innovations which solve the challenges of productivity, sustainability and net zero emissions. "
        },
        {
            "text": "The competition documents are available to read now and the window to apply will open 24 July."
        },
        {
            "heading": 2,
            "text": "The competition"
        },
        {
            "text": "The Farming Innovation Investor Partnership competition, developed with Innovate UK, is unique. It combines grant funding from Defra with equity funding from private investors and a significant contribution from a member of Innovate UK’s Investor Partner pool.  "
        },
        {
            "text": "The Investor Partner pool comprises around 80 entities with the credibility, capability and appetite to invest in innovative, technology-led businesses. "
        },
        {
            "text": "This combination provides successful applicants with financial support to develop innovative technology. It also provides valuable commercial intelligence and access to market opportunities to grow and scale. "
        },
        {
            "heading": 2,
            "text": "Eligibility "
        },
        {
            "text": "Projects must be in late-stage Research & Development and seek late seed or Series A stage funding. "
        },
        {
            "text": "For example, you might be a start-up or medium-sized business with an experimental technology close to market. "
        },
        {
            "text": "Eligible project costs must be between £750,000 and £3,000,000. They must last 18 months.  "
        },
        {
            "text": "As projects are anticipated to be nearer to market, funding available for eligible project costs will be up to 45%, and 35% for micro or small and medium-sized companies respectively. "
        },
        {
            "text": "These projects should have links to farmers, growers and agri-business. They must be able to demonstrate the benefits to farmers and growers in England and must be led by a sole UK-registered micro, small or medium business. "
        },
        {
            "heading": 2,
            "text": "The application process "
        },
        {
            "text": "Proposals must demonstrate an ambition to finalise late-stage innovation, the potential to grow and scale through successful negotiation of investment and provide a coherent project plan, which integrates your business strategy.  "
        },
        {
            "text": "The project must address a significant farm-focused challenge relating to livestock, plants, novel food production systems, and bioeconomy and agroforestry. "
        },
        {
            "text": "Applications should be made through Innovate UK’s online Innovation Funding Service. "
        },
        {
            "text": "Applications will then be assessed by Innovate UK’s experienced independent assessors. The assessors are drawn from business and academia. They all have industry expertise to ensure a fair and transparent assessment process. "
        },
        {
            "text": "Projects that meet the threshold will be notified in October. "
        },
        {
            "text": "They will then have until January to reach heads of terms with a lead investor. Successful applicants will then be notified in February. "
        },
        {
            "heading": 2,
            "text": "Dates for your diary "
        },
        {
            "text": "Innovate UK will host a Q&A session on 25 July. I'll add the link to register for the session below."
        },
        {
            "text": "This new fund complements other competitions under our Farming Innovation Programme which you can read more about in last month’s blog post. "
        }
    ]
}