{
    "url": "https://forestrycommission.blog.gov.uk/2023/07/03/improving-biosecurity-for-trees-planted-in-urban-areas/",
    "title": "Improving biosecurity in tree planting",
    "authors": [
        "Rhiannon Leyden-Preece"
    ],
    "categories": [
        "Biosecurity",
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-07-03T12:12:29+01:00",
    "content": [
        {
            "text": "From the 1 July 2023, all applications for the Local Authority Treescapes Fund (LATF), Urban Tree Challenge Fund (UTCF) and the HS2 Woodland Fund need to adhere to the Biosecure Procurement Requirement. This is phase 2 of the pilot that was first launched in June 2022."
        },
        {
            "text": "This means that all trees bought by new applicants (from 1 July 2023) for these funds, will need to be sourced from Plant Healthy certified suppliers or be accompanied by a  Ready to Plant voucher. These standards mean that an independent assessment has taken place to make sure that the supplier has robust plant health management measures in place."
        },
        {
            "text": "More information about the Biosecure Procurement Requirement can be found by reading the blog for Phase 1 of the pilot. This extension to LATF and UTCF will apply the Biosecure Procurement Requirement to urban tree planting for the first time. The HS2 Woodland Fund supports the restoration of Plantations on Ancient Woodland Sites and Woodland Creation (delivered via the England Woodland Creation Offer)."
        },
        {
            "heading": 2,
            "text": "Urban areas are a hotspot for new tree pests and diseases"
        },
        {
            "text": "The UK treescape provides us with £350 billion in benefits, such as mental health and wellbeing benefits through to biodiversity benefits, over a 100-year period. We need to protect this value, but these trees are under threat."
        },
        {
            "text": "Over time, new introductions of pests and diseases which have not historically been found in the UK can threaten to overwhelm UK trees, which unlike the original host trees, may not have evolved defence mechanisms. One example of this happening is ash dieback disease, which has been predicted to result in a loss of £15 billion over the next 100 years (reference:Hill et al., 2019), since it first reached the UK in 2012."
        },
        {
            "text": "Urban trees play the vital role of bringing the benefits of trees closer to a larger number of people. Tree planting in urban areas can help prevent floods, improve wellbeing, improve air quality and reduce noise pollution."
        },
        {
            "text": "However, the threat of new pests and diseases is highest in high-traffic, urban environments and one study found that up to 89% of first detections of non-native tree pests were in cities or urban areas. These pests can hitchhike in transport and imports of wood products, or even on the trees we plant. The need to strengthen the biosecurity of these front-line urban trees in high traffic environments is therefore critical to give them the best chance to survive, protecting the public investment for all."
        },
        {
            "text": "If you have any queries on the three funds and the Biosecure Procurement Requirement please contact the Forestry Commission mailbox for each scheme."
        },
        {
            "text": "Local Authority Treescapes Fund - LATF@forestrycommission.gov.uk"
        },
        {
            "text": "Urban Tree Challenge Fund - UTCF@forestrycommission.gov.uk"
        },
        {
            "text": "HS2 Woodland Fund - hs2woodlandfund@forestrycommission.gov.uk"
        }
    ]
}