{
    "url": "https://buyingforschools.blog.gov.uk/2023/07/03/my-experience-of-using-get-help-buying-for-schools-to-buy-catering-and-cleaning-for-my-school/",
    "title": "My experience of using Get help buying for schools to buy catering and cleaning for my school",
    "authors": [
        "Jason Murgatroyd, Executive Head, Grangetown Primary School"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-07-03T12:37:55+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Jason Murgatroyd is the Executive Head at Grangetown Primary School in Middlesbrough. Grangetown became part of the Steel River Academy Trust in 2019 alongside three other primary schools. "
        },
        {
            "text": "In this blog post, Jason shares his experience of using Get help buying for schools and how it could help you with your buying too."
        },
        {
            "text": "I was looking to go out to tender for two large contracts – catering and cleaning – with a joint value of approximately £2 million. This was the first time that I had managed a tender of this scale since the school had become part of the academy trust and I was looking for support to help guide me through the buying process."
        },
        {
            "text": "I had seen options where I could pay a premium to get buying support, which I had begun to investigate. It was during this time that I saw an email advertising one-to-one calls with the Schools Commercial Team for anyone who needed help with their buying. I booked a slot and during the call I was alerted to the Get help buying for schools service. I submitted a request for advice and guidance online through GOV.UK, was almost immediately contacted by the service and the process started from there."
        },
        {
            "text": "Compliance was my number one reason for using the service. I was supported by a procurement expert throughout the entire process. They ensured I was doing all the right things at the right time and it was so helpful having someone to guide and prompt me, and someone to call when I didn’t understand something, or needed specialist advice."
        },
        {
            "text": "My tenders are now live and the service I have received so far from Get help buying for schools has been fantastic – to get this far feels like a great outcome in itself! It was so straight forward to use; I couldn’t believe a service like that existed for free."
        },
        {
            "text": "Of course, money saved is a bonus too and I know that I have already saved at least £10k from not having to employ someone to give that level of support."
        },
        {
            "text": "Give the Get help buying for schools service a try"
        },
        {
            "text": "Contact Get help buying for schools for support to buy for your school or trust. We can help you navigate the buying process, buy compliantly, save you time, and secure great value for your school."
        },
        {
            "text": "Follow our ‘Buying for Schools’ LinkedIn page for all the latest information, events, and webinars on offer to help you with your buying."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}