{
    "url": "https://dluhcdigital.blog.gov.uk/2023/07/03/reviewing-the-local-digital-declaration-5-years-on-update-on-the-discovery-project/",
    "title": "Reviewing the Local Digital Declaration 5 years on: Update on the discovery project",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Declaration"
    ],
    "pub_date": "2023-07-03T10:16:10+01:00",
    "content": [
        {
            "text": "This month marks a key milestone for the Local Digital Declaration as it reaches its fifth anniversary, and we’ll be celebrating Digital Declaration Month throughout July. Read on to find out how to get involved."
        },
        {
            "text": "The world of digital is ever evolving, so five years felt like a suitable point at which to pause, reflect, and consider what’s next for the Declaration. That’s why we recently conducted a discovery project to assess the impact of the Local Digital Declaration and offer recommendations on how to use it going forward."
        },
        {
            "text": "In this blog post, we’ll give you a broad overview of how we carried out the discovery, what it has identified, and what happens now."
        },
        {
            "heading": 2,
            "text": "Why a discovery, and why now?"
        },
        {
            "text": "A lot has happened in the last five years, and the policy, funding and technological contexts in which the Declaration was initially created have changed."
        },
        {
            "text": "Conversations we’ve had with the community in recent years, such as at the Local Digital Roadshows in 2022, have highlighted the shifting priorities for local authorities, and this was another key factor in deciding to review the Declaration."
        },
        {
            "text": "As we fly past the 300 signatory mark, this feels like the right time to ensure that the Declaration is evolving to meet the changing needs of the organisations that have signed, as well as the wider sector."
        },
        {
            "text": "We decided to bring in external support from TPXimpact to offer an independent assessment of the Declaration. The project kicked off in March this year with the following aims:"
        },
        {
            "heading": 2,
            "text": "How we carried out the discovery"
        },
        {
            "text": "We worked in a blended team of TPXimpact and Local Digital, bringing together user research, service design and communications experts over 5 two-week sprints."
        },
        {
            "text": "We took a human-centred design approach and emphasised user research with key stakeholders. We spent time finding out how stakeholders understand the Declaration and their experiences of the sign-up process."
        },
        {
            "text": "We conducted 10 in-depth interviews, including:"
        },
        {
            "text": "In addition to the interviews, we analysed submission data, mapped the experience and journey of signatories, and reviewed content around the Declaration."
        },
        {
            "heading": 2,
            "text": "What have we learned?"
        },
        {
            "text": "The discovery highlighted that the principles of the Local Digital Declaration continue to be relevant and are supporting digital leaders in local authorities to define their own digital strategies."
        },
        {
            "text": "It has also surfaced opportunity areas and recommendations on what the Local Digital programme can do to ensure the Declaration is meeting sector needs now and in the future."
        },
        {
            "text": "These opportunities sit across three broad areas:"
        },
        {
            "text": "Watch a recording of our recent Digital Leaders Week talk—presented by our Communications Lead, Pippa Savill, and Andy Parker of TPXimpact—to hear more findings and insights from the discovery:"
        },
        {
            "text": "You can also read a transcript from the talk."
        },
        {
            "heading": 2,
            "text": "Next steps for the Declaration"
        },
        {
            "text": "As we’ve just completed the final report from the discovery project, we need to spend some time digesting the recommendations as a team and deciding on the best way forward."
        },
        {
            "text": "The report recommends content and service opportunity areas that we can action in the short term. These include making the application process easier to use, and improving the Declaration guidance so that it sets expectations about what is involved in putting the principles into action across the organisation."
        },
        {
            "text": "There are also bigger strategic opportunities that require further investigation, such as how we can better support signatories to secure commitment to fundamental organisational change."
        },
        {
            "text": "We may need to carry out further research to further validate the requirements from our audience, before we begin implementing changes to improve the Declaration."
        },
        {
            "text": "We’re hosting a rerun of our Digital Leaders Week talk about the discovery project on Thursday 27 July at 10am – register your place to hear about the findings in the report and ask us questions."
        },
        {
            "text": "As ever, we will work in the open and share our progress on our channels:"
        },
        {
            "heading": 2,
            "text": "Take part in Digital Declaration Month 2023"
        },
        {
            "text": "Every year, we run a month-long celebration called Digital Declaration Month. This July, join us in celebrating the fifth anniversary by sharing your stories and digital achievements on social media."
        },
        {
            "text": "Throughout July, we’ll be using our channels to showcase the work of our signatories and highlighting the impact the Declaration has had on the local digital community."
        },
        {
            "text": "If you would like to take part, download one of our social media graphics to include in your celebratory posts. Take a look at our #LocalDigital4Years and #LocalDigital3Years hashtags on Twitter for inspiration from previous years!"
        }
    ]
}