{
    "url": "https://companieshouse.blog.gov.uk/2023/07/03/reviewing-companies-house-fees/",
    "title": "Reviewing Companies House fees",
    "authors": [
        "Michelle Wall - Director of Finance and Commercial"
    ],
    "categories": [
        "Companies House transformation",
        "Legislative reform"
    ],
    "pub_date": "2023-07-03T14:45:43+01:00",
    "content": [
        {
            "text": "The Economic Crime and Corporate Transparency (ECCT) Bill is currently making its way through Parliament. This legislation will change our role and our purpose and will give us the powers we need to improve the accuracy of the information on our registers and to play a significant role in tackling economic crime."
        },
        {
            "text": "We want to be ready to take action, and we’re working hard on a number of different workstreams to make sure we’ll be ready to implement many of the measures as soon as possible after the Bill achieves royal assent."
        },
        {
            "heading": 2,
            "text": "Reviewing our fees"
        },
        {
            "text": "One of the important areas we’re looking at is how our new powers will be funded and what impact this will have on the fees we charge."
        },
        {
            "text": "Companies House fees are set on a cost recovery basis. This means our fees must cover the cost of the services we deliver. We do not make a profit on our fees."
        },
        {
            "text": "We review our fees every year to make sure they’re set at the right level. This year, we’ve taken new future expenditure into account as well as making sure we recover costs from our existing expenditure."
        },
        {
            "text": "Companies House fees are much lower than the global average and have not changed since 2016. Many believe our fees are too low. During the debates while the ECCT Bill has moved through Parliament, there’s been a focus on the low levels of our fees and on making sure we’re adequately funded in the future."
        },
        {
            "heading": 2,
            "text": "Why this is important"
        },
        {
            "text": "There’s a clear expectation that our fees must fund the cost of the new powers and the wider package of reforms in the ECCT Bill, and it’s likely that our fees will increase after the Bill achieves royal assent."
        },
        {
            "text": "As a reminder, the measures in the ECCT Bill include:"
        },
        {
            "text": "These measures seek to strike the right balance between ease of doing business, supporting economic growth and tackling economic crime. Our new powers will help improve the reliability of the data on our registers and tackle economic crime, which will drive confidence in the UK economy and benefit companies and society as a whole."
        },
        {
            "text": "We’ll be operating in a completely different way in the future with major changes needed for our systems, processes, and the skillsets of our people. Increasing our fees will enable us to operate effectively within our new powers and deliver outcomes, making sure we continue to recover the costs of the services we deliver."
        },
        {
            "heading": 2,
            "text": "What this means for you"
        },
        {
            "text": "Nothing will change until after the ECCT Bill receives royal assent, so you do not need to do anything differently at this time."
        },
        {
            "text": "Changes to fee values need to go through a robust process, including final sign off from HM Treasury and ministers, and this process has not been completed yet. This means we do not have detailed information on the changes to our fees or when they’ll come into effect just yet, but we’ll keep you informed on our channels."
        },
        {
            "text": "Sign up to our newsletter if you'd like to receive regular updates from Companies House."
        },
        {
            "text": "We know any changes to our fees will have an impact on you when they come into effect, and we’ll give you as much notice as we can. We’ll be speaking to key stakeholders over the coming months to make sure they can share their views with us and so that they can cascade information to their members."
        }
    ]
}