{
    "url": "https://dwpdigital.blog.gov.uk/2023/07/03/success-at-the-digital-leaders-100-awards/",
    "title": "Success at the Digital Leaders 100 Awards",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Data",
        "Digital With Purpose",
        "DWP Digital",
        "innovation"
    ],
    "pub_date": "2023-07-03T12:07:48+01:00",
    "content": [
        {
            "text": "The Digital Leaders (DL) 100 list, in its 11th year, celebrates the teams and individuals who are working hard behind the scenes to secure the UK’s Digital Transformation.  "
        },
        {
            "text": "The DL100 Awards took place on 22 June in Leeds. This was the first time the ceremony has taken place in the North. "
        },
        {
            "text": "DWP Digital made the finalist list with 6 of our people and projects shortlisted including the Digital Public Service Innovation of the Year, AI and Data Innovation of the Year, Digital Leader of the Year and Young Digital Leader of the Year categories.  "
        },
        {
            "heading": 2,
            "text": "The Founders Award "
        },
        {
            "text": "On the night, we won the prestigious Founders Award. This was the first time the award, given for outstanding contribution to digital leadership, had been given to an organisation rather than an individual. We were chosen because of our focus on the use of data, emerging technology, and innovation to drive our vision. "
        },
        {
            "text": "Jacqui Leggetter, Head of Integration at DWP Digital said, “This award is fantastic recognition for the innovative work that we are doing across DWP Digital; it is not just for one team; it is for every team that is helping to drive transformation and pushing the boundaries of modern technology whilst never losing sight of our users and the citizens we’re here to serve.  It was great having the six finalist teams represented at the event to celebrate; everyone in Digital Group should feel very proud of this award.” "
        },
        {
            "heading": 2,
            "text": "Coaching the next generation "
        },
        {
            "text": "Richard Corbridge, Chief Digital and Information Officer (CDIO) was in attendance on the night presenting the Young Digital Leader of the Year award and providing a keynote speech.  "
        },
        {
            "text": "He said: “The part that we as digital leaders play in the delivery of customer services makes us essential to all successful transformation not just digital transformation. You are truly inspirational. I would particularly like to shout out to people in the room who are mentors, you play a vital role in building the next generation of leaders to win these awards in years to come. You are not just leading digital delivery but coaching the next generation. We can all learn from each other, and I encourage you all to do that here tonight, tomorrow and ongoing.\"   "
        },
        {
            "heading": 2,
            "text": "Digital Leaders Week "
        },
        {
            "text": "The awards brought a successful Digital Leaders Week to a close, which saw several of our DWP Digital colleagues participate in sessions and panel discussions. "
        },
        {
            "text": "As a proud partner of the week, we had 9 sessions across the week, a mixture of online webinars and in-person sessions. This included John Keegan, Head of Digital Security leading a session on ‘How DWP is utilising a two-pronged offensive against cyber-attacks.’ Jacqui Leggetter, Head of Integration and David Kibble, Lead Integration Architect held a discussion about how DWP Digital are transforming customer and agent facing services using composite architecture through a scaled test and learn approach.  "
        },
        {
            "text": "Roni Colling, a software engineer talked about being a ‘Reluctant Leader.’ And, Duncan Parke, Integrated Risk, and Intelligence Service, joined the Digital Leaders conference in Manchester in a panel discussion about AI and public services.  "
        },
        {
            "text": "We had further online sessions with Alex Coomer, a lead product manager delivering the session ‘How to transform services in Government,’ Tony Sudworth, Head of Sustainability spoke about next steps in digital sustainability and Neil Owen, our Tech Services, Collaboration and Communication Lead, talked about transforming a Digital Workplace at scale. Jacqui also joined a ‘Policy Jam’ session in partnership with BCS to discuss ‘Responsible leadership in a Digital Age.’ "
        }
    ]
}