{
    "url": "https://insidehmcts.blog.gov.uk/2021/06/24/building-for-the-future-at-hmcts/",
    "title": "Building for the future at HMCTS",
    "authors": [
        "Antonia Romeo"
    ],
    "categories": [
        "Court and tribunal reform",
        "Working at HMCTS"
    ],
    "pub_date": "2021-06-24T11:30:40+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "Since returning to the Ministry of Justice as Permanent Secretary earlier this year, I have been struck by the great progress HMCTS has made, in both keeping justice moving throughout the past year, and also on its reform journey this past decade."
        },
        {
            "text": "In his recent blog, Kevin Sadler, CEO HMCTS, looked back on some of the big changes over the past 10 years since HMCTS was formed. In this blog I’m following up to set out our priorities for the future."
        },
        {
            "text": "Delivering service that’s flexible"
        },
        {
            "text": "HMCTS began reforming services in 2016 and already much has been delivered. Members of the public, for example, can now apply for probate and divorce online, saving time and inconvenience during difficult periods. Staff in our Courts and Tribunals Service Centres are giving clearer information to support those using services, freeing up the time of our highly trained court staff to concentrate on more complex tasks. Legal professionals have been using MyHMCTS for a year now to submit common applications online. That means applications can be made at any time and from any location."
        },
        {
            "text": "The past year especially has taught us that better use of technology has a central place in the delivery of justice. For example, our increased use of pre-recorded cross-examination for vulnerable witnesses allowed them to give evidence sooner.  Technology enables HMCTS to deliver services that are easy to use, accessible, resilient and convenient – meeting the changing needs of society."
        },
        {
            "text": "Remote hearings that have allowed justice to continue throughout the pandemic will continue to play an important role in the future. A Video Hearings service that is easy to use and closely replicates a physical hearing has been developed and is being used in some courts and tribunals. By 2022, it’ll be the default service, replacing the systems we currently use for hearings where the judge is satisfied they can take place without participants physically in the courtroom. This means people can access justice without spending significant time travelling to and waiting at court."
        },
        {
            "text": "Of course, attending hearings in person will continue and it’s vital that our buildings remain COVID-19 secure so that our staff and visitors feel confident when they visit. We’ll continue to follow public health guidelines as they evolve. Plexiglass screens have been installed in courtrooms in our own buildings, and modular buildings have been installed next to our existing court buildings to provide jury deliberation rooms. We’ve also been using measures such as Nightingale courts to create additional capacity where it’s needed most and have delivered around 60 additional Nightingale courtrooms. Combined with the unlimited sitting days for Crown Courts, these measures maximise our court room capacity and hearing capabilities."
        },
        {
            "text": "Improving services through collaboration"
        },
        {
            "text": "The justice system can be complex to understand, administer and use. There are many different regulations, organisations and systems, so it’s a priority to work with partners and court users to find ways to simplify things. Common Platform is one example of how we’re doing this. Used by court staff, the Crown Prosecution Service, defence professionals and the police, the Common Platform provides a single place to manage criminal cases securely online. It reduces duplication, speeds up processing times, increases transparency for everyone involved, and gets to the heart of delivering justice quickly and efficiently for victims of crime. By the end of the year, we will see it being adopted and used widely across England and Wales."
        },
        {
            "text": "We’re also supporters of Remote Courts Worldwide which gathers best practice on the use of remote hearings.  The UK legal system is globally respected, but we can still learn from others - sharing knowledge and experience means we can learn about trends and developments in other jurisdictions."
        },
        {
            "text": "Providing confidence that the justice system works for everyone"
        },
        {
            "text": "Reforming services on this scale is ambitious, but we’re making sure we’re there for all court users. Nobody should feel left behind or excluded from accessing the justice system because it feels complicated, because of COVID-19 or because they don’t have access to the internet."
        },
        {
            "text": "Our Vulnerability Action Plan sets out how we’re helping people during the pandemic and those provisions remain in place. Although a lot of work is being done to digitise some services, we still have paper options for people who need them, and they’ve been made simpler to complete."
        },
        {
            "text": "For people who want to use our online services but need help, digital support is available from Courts and Tribunals Service Centres or through a pilot we’re running with Good Things Foundation. This pilot will end later this year and a national service offering in-person and remote support will be launched in its place. For civil and family cases, Support through Court have also launched a national helpline providing assistance for people facing court without a lawyer."
        },
        {
            "text": "Looking forward to the future"
        },
        {
            "text": "Much has been achieved in the past decade. Clearly, we still have some way to go before our reform effort is complete, but the unprecedented circumstances have shown us how we can rapidly adapt to change. I already know that our achievements are because of the continued dedication of our staff and our partners’ resilience and flexibility. I’m sure more progress will be made over the next 10 years."
        },
        {
            "text": "Thank you for your hard work supporting the justice system at a challenging time."
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Adeiladu ar gyfer y dyfodol yn GLlTEM"
        },
        {
            "heading": 3,
            "text": "Antonia Romeo, Ysgrifennydd Parhaol Y Weinyddiaeth Gyfiawnder"
        },
        {
            "text": "Ers dychwelyd i’r Weinyddiaeth Gyfiawnder fel yr Ysgrifennydd Parhaol yn gynharach eleni, mae’r cynnydd gwych y mae GLlTEM wedi’i wneud wedi cael argraff fawr arnaf - cynnydd o ran parhau i weinyddu cyfiawnder trwy gydol y flwyddyn ddiwethaf, ac hefyd ar ei siwrnai ddiwygio dros y degawd diwethaf."
        },
        {
            "text": "Yn ei flog diweddar, bu i Brif Weithredwr GLlTEM, Kevin Sadler edrych yn ôl ar rai o’r newidiadau mawr dros y deng mlynedd diwethaf ers i GLlTEM gael ei ffurfio. Yn y blog dilynol hwn, rwy’n pennu ein blaenoriaethau ar gyfer y dyfodol."
        },
        {
            "heading": 3,
            "text": "Darparu cyfiawnder sy’n hyblyg"
        },
        {
            "text": "Dechreuodd GLlTEM ddiwygio ei wasanaethau yn 2016 ac mae llawer wedi’i gyflawni’n barod. Er enghraifft, gall y cyhoedd bellach wneud cais am brofiant ac am ysgariad ar-lein, gan arbed amser ac osgoi anghyfleustra yn ystod cyfnodau anodd. Mae staff Canolfannau Gwasanaethau’r Llysoedd a’r Tribiwnlysoedd yn rhoi gwybodaeth fwy eglur i gefnogi’r sawl sy’n defnyddio’r gwasanaethau, gan ryddhau amser ein staff, sydd wedi’u hyfforddi i lefel uchel, i ganolbwyntio ar dasgau mwy cymhleth. Mae gweithwyr proffesiynol ym maes y gyfraith wedi bod yn defnyddio MyHMCTS i gyflwyno ceisiadau cyffredin ar-lein am flwyddyn bellach. Golygai hyn y gellir gwneud cais ar unrhyw adeg ac o unrhyw leoliad."
        },
        {
            "text": "Yn y flwyddyn ddiwethaf yn enwedig, rydym wedi dysgu bod defnyddio technoleg yn well yn ganolog i weinyddu cyfiawnder. Er enghraifft, mae ein defnydd cynyddol o recordiadau o groesholi tystion bregus wedi caniatáu iddynt roi tystiolaeth yn gynharach. Mae technoleg yn galluogi GLlTEM i ddarparu gwasanaethau sy’n hawdd i’w defnyddio, yn hygyrch, yn gadarn ac yn gyfleus – gan fodloni anghenion newidiol ein cymdeithas."
        },
        {
            "text": "Mae gwrandawiadau o bell wedi caniatáu i gyfiawnder barhau trwy gydol y pandemig, a byddant yn parhau i chwarae rôl bwysig yn y dyfodol. Mae gwasanaeth Gwrandawiadau Fideo sy’n hawdd i’w ddefnyddio ac sy’n efelychu gwrandawiadau wyneb yn wyneb yn agos wedi cael ei ddatblygu ac mae’n cael ei ddefnyddio mewn rhai llysoedd a thribiwnlysoedd. Erbyn 2022, hwn fydd y gwasanaeth arferol, gan ddisodli’r systemau rydym yn eu defnyddio ar hyn o bryd. Yn hytrach, bydd gwrandawiadau lle mae’r barnwr yn fodlon y gellir eu cynnal heb i gyfranogwyr fod yn yr ystafell llys yn bersonol. Golygai hyn y bydd pobl yn gallu cael mynediad at gyfiawnder heb dreulio amser sylweddol yn teithio i’r llys ac yn aros yn y llys."
        },
        {
            "text": "Wrth gwrs, bydd mynychu gwrandawiadau yn bersonol yn parhau i ddigwydd ac mae’n hanfodol bod ein hadeiladau yn parhau i fod yn ddiogel rhag COVID-19 fel bod ein staff a’n hymwelwyr yn teimlo’n hyderus ac yn gyfforddus pan fyddant yn ymweld. Byddwn yn parhau i ddilyn canllawiau iechyd cyhoeddus wrth iddynt ddatblygu a newid. Mae sgriniau Plexiglass wedi’u gosod mewn ystafelloedd llys yn ein hadeiladau ni, ac mae adeiladau dros dro wedi’u gosod wrth ymyl ein hadeiladau llys i ddarparu ystafelloedd ymneilltuo i reithgorau. Rydym hefyd wedi bod yn defnyddio mesurau fel y llysoedd Nightingale i gynyddu capasiti lle bo’r angen mwyaf ac rydym wedi darparu oddeutu 60 o lysoedd Nightingale ychwanegol. Ynghyd â dyddiadau eistedd diderfyn ar gyfer Llysoedd y Goron, mae’r mesurau hyn yn gwneud y gorau o’n capasiti o ran ystafelloedd llys a chynnal gwrandawiadau."
        },
        {
            "heading": 3,
            "text": "Gwella gwasanaethau trwy gydweithio"
        },
        {
            "text": "Mae’r system gyfiawnder yn gallu bod yn gymhleth i’w deall, ei gweinyddu a’i defnyddio. Mae llawer o reoliadau, sefydliadau a systemau, felly mae gweithio â phartneriaid a defnyddwyr y llysoedd i ddod o hyd i ffyrdd i symleiddio pethau yn flaenoriaeth. Mae’r Platfform Cyffredin yn un enghraifft o sut rydym yn gwneud hyn. Mae’r platfform yn cael ei ddefnyddio gan staff y llysoedd, Gwasanaeth Erlyn y Goron, gweithwyr proffesiynol yr Amddiffyniad a’r Heddlu, gan ddarparu un lle i reoli achosion troseddol yn ddiogel ar-lein. Mae’n lleihau dyblygu, cyflymu amseroedd prosesu, cynyddu tryloywder i bawb sy’n rhan o’r broses, ac mae’n rhan ganolog o weinyddu cyfiawnder yn gyflym ac yn effeithlon ar gyfer ddioddefwyr troseddau. Erbyn diwedd y flwyddyn, byddwn yn ei weld yn cael ei fabwysiadu a’i ddefnyddio’n eang ledled Cymru a Lloegr."
        },
        {
            "text": "Rydym hefyd yn cefnogi Remote Courts Worldwide sy’n casglu’r arferion gorau ar ddefnyddio gwrandawiadau o bell. Mae system gyfreithiol y DU yn uchel ei barch ledled y byd, ond gallwn dal ddysgu gan eraill – mae rhannu gwybodaeth a phrofiad yn golygu y gallwn ddysgu am dueddiadau a datblygiadau mewn awdurdodaethau eraill."
        },
        {
            "heading": 3,
            "text": "Sicrhau hyder bod y system gyfiawnder yn gweithio i bawb"
        },
        {
            "text": "Mae diwygio gwasanaethau ar y raddfa hon yn uchelgeisiol, ond rydym yn sicrhau ein bod yna i holl ddefnyddwyr y llys. Ni ddylai unrhyw un deimlo eu bod yn cael eu gadael ar ôl neu’n cael eu cau allan rhag cael mynediad at gyfiawnder oherwydd ei fod yn teimlo’n gymhleth, oherwydd COVID-19 neu oherwydd nad oes ganddynt fynediad at y rhyngrwyd."
        },
        {
            "text": "Mae ein Cynllun Gweithredu Bregusrwydd yn pennu sut rydym yn helpu pobl yn ystod y pandemig a bydd y darpariaethau hynny yn parhau i fod yn weithredol. Er bod llawer o waith yn cael ei wneud i drosglwyddo rhai gwasanaethau i fod yn rhai digidol, mae gennym opsiynau papur i bobl sydd eu hangen, ac maen nhw bellach yn symlach i’w cwblhau."
        },
        {
            "text": "Ar gyfer pobl sydd eisiau defnyddio ein gwasanaethau ar-lein ond mae arnynt angen cymorth, mae cymorth digidol ar gael gan Ganolfannau Gwasanaethau’r Llysoedd a’r Tribiwnlysoedd neu drwy gynllun peilot rydym yn ei weithredu ar y cyd â'r Good Things Foundation. Bydd y cynllun peilot hwn yn dod i ben yn ddiweddarach eleni a bydd gwasanaeth cenedlaethol sy’n cynnig cymorth wyneb yn wyneb ac o bell yn cael ei lansio yn ei le. Ar gyfer achosion sifil a theulu, mae Support Through Court hefyd wedi lansio llinell gymorth genedlaethol sy’n darparu cymorth i bobl sy’n wynebu’r llys heb gyfreithiwr."
        },
        {
            "heading": 3,
            "text": "Edrych ymlaen at y dyfodol"
        },
        {
            "text": "Mae llawer wedi’i gyflawni yn y degawd diwethaf. Wrth gwrs, mae llawer ar ôl i’w wneud cyn y byddwn wedi cwblhau’r broses ddiwygio, ond mae’r amgylchiadau digynsail wedi dangos ein bod yn gallu addasu i newid ar gyflymder. Rwy’n gwybod eisoes mai ymroddiad parhaus ein staff a gwydnwch a hyblygrwydd ein partneriaid sydd wedi sicrhau ein llwyddiannau. Rwy’n siŵr y gwneir mwy o gynnydd dros y deng mlynedd nesaf."
        },
        {
            "text": "Diolch am eich gwaith caled yn cefnogi’r system gyfiawnder mewn cyfnod heriol."
        }
    ]
}