{
    "url": "https://deframedia.blog.gov.uk/2021/06/24/coverage-of-defra-and-natural-englands-announcement-on-protected-landscapes/",
    "title": "Coverage of Defra and Natural England’s announcement on protected landscapes",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-24T12:43:05+01:00",
    "content": [
        {
            "text": "There is positive coverage today following our joint announcement with Natural England, reporting that two of England’s most iconic landscapes are being considered to become new Areas of Outstanding Natural Beauty (AONB), alongside extensions to the Surrey Hills and Chilterns AONBs."
        },
        {
            "text": "The announcement has been covered by the Daily Mail, Telegraph (p8), Evening Standard and Times (p21), and in key regional titles including Surrey Live, BBC Look North, BBC Three Counties, York Press, and Yorkshire Post. The Telegraph (p9) also runs a comment piece from the Secretary of State."
        },
        {
            "text": "The Environment Secretary George Eustice published a Written Ministerial Statement this morning, and discussed the plans to drive nature recovery and people’s access to nature in protected landscapes on the Today Programme, Sky News, GB News, Times Radio, Talk Radio and LBC Radio."
        },
        {
            "text": "BBC Breakfast also covered the news with a positive feature on the Yorkshire Wolds."
        },
        {
            "text": "As part of the announcement, a new Farming in Protected Landscapes programme has also launched, which will provide funding to help farmers and other land managers in England based in National Parks or AONBs to make improvements to the natural environment and improve public access on their land."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "Chair of Natural England Tony Juniper said:"
        },
        {
            "text": "The proposals follow the independent review led by Julian Glover which called for action to make our protected landscapes greener, more beautiful and open to everyone."
        },
        {
            "text": "The government will respond to the review’s recommendations in full later this year."
        },
        {
            "text": "Julian Glover, who led the review, said:"
        },
        {
            "text": "You can read the Natural England gov.uk story for more details on the proposals for new protected areas across England here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}