{
    "url": "https://dragonsden.blog.gov.uk/2021/06/24/dragons-den-episode-12-series-18/",
    "title": "Dragons’ Den Episode 12, Series 18",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-06-24T22:00:41+01:00",
    "content": [
        {
            "text": "Each week I watch Dragons’ Den, wondering if I would ever be brave enough to enter the Den with my business idea. But after this week’s fiery episode, I’m not sure I would be! This week we saw some fiercely passionate entrepreneurs fighting for their businesses despite some tough questioning from the Dragons. From recyclable shoes to a finalist in MasterChef: The Professionals, I was on the edge of my seat...but who managed to secure an investment?  "
        },
        {
            "heading": 3,
            "text": " If the shoe fits... "
        },
        {
            "text": "One entrepreneur who would have had my money instantly was South African businesswoman, Gaynor Saunders. Her business ‘It’s All About Shoes’ took a whole new approach to designing shoes, focused on sustainability. Gaynor showcased her invention, a gliding mechanism which sits in the base of the shoe. This allows the strap to be moved up and down and removed, meaning the shoe is recyclable.  "
        },
        {
            "text": "Green queen Deborah Meaden was impressed by Gaynor’s motivation and was keen to reduce the impact of waste shoes on the environment.  "
        },
        {
            "text": "I know I easily get tired of shoes and am always looking for a new pair of boots or sandals. I try to recycle mine as much as possible, but as Gaynor said, you can’t always recycle a shoe because it is made up of different parts. If ‘It’s All About Shoes’ can solve that, then I’m in. "
        },
        {
            "text": "Despite a strong pitch, the Dragons dived straight in by questioning Gaynor about the design of her shoes. Deborah pointed out that they were too uncomfortable and heavy to wear daily. "
        },
        {
            "heading": 3,
            "text": " A patent saves the day "
        },
        {
            "text": "Nonetheless, Gaynor held strong, with one of her selling points being the patent she had secured on the gliding mechanism. A patent is a crucial way to protect your invention as it ensures no one else can copy, use or sell it without your permission. But some patents can be expensive and complex to get, so it’s worth checking if getting one is right for your business.  "
        },
        {
            "text": "Touker Suleyman saw the value of the patent and the potential to apply this to childrens’ shoes. “It’s my dream to create an eco-friendly children’s shoe company”.  "
        },
        {
            "text": "With the chance to make his dream a reality, Touker offered Gaynor 50k for 45% of the business.  "
        },
        {
            "heading": 3,
            "text": "A MasterChef: TheProfessionals crossover "
        },
        {
            "text": "When MasterChef: The Professionals finalist Yann Florio entered the Den with entrepreneur Pia Varma, I thought I’d switched channels! Yann served up a treat for the Dragons, using cooking alcohol to infuse chicken marsala.  "
        },
        {
            "text": "Pia was looking for 75k in exchange for 15% of her business, ‘Just a Splash’, which sells 100ml pouches of cooking alcohol. She’s clearly spotted a gap in the market for small samples of alcohol.\n"
        },
        {
            "text": "We’ve seen a number of businesses on Dragons’ Den who sell alcohol samples, from ‘MicroBarBox’ (you can see how they did if you read our past blog) to the subscription service, ‘Craft Gin Club’. But cooking alcohol is something different, and I’m sure it would appeal to the likes of Mary Berry and Prue Leith for their next boozy bake.  "
        },
        {
            "text": "While listening to Pia, and watching the food, I wondered how she had protected her IP. Pia could register the design of her packaging or apply for a trade mark for her company name. I had a quick look on the trade mark register, and that’s exactly what she’s done.  "
        },
        {
            "text": "Before you apply for a trade mark, it’s worth checking what similar trade marks exist already. You can do this by searching our database.  "
        },
        {
            "text": "Although the Dragons were impressed with her passion and entrepreneurial mindset, they didn’t make an offer this time, wishing her all the best for the future. "
        },
        {
            "heading": 3,
            "text": " Family fortunes  "
        },
        {
            "text": "The final entrepreneurs were Kate and Matt Ball, accompanied by 4 of their 6 children. They were hoping for a 50k investment for 10% of the business, ‘Mini First Aid’, which offers first aid classes across 65 franchises in the UK and online. "
        },
        {
            "text": "Kate shared the inspiring story of how they started the business. Sadly, she lost her brother after a cardiac arrest, where successful cardiopulmonary resuscitation (CPR) may have been able to save him. "
        },
        {
            "text": "Following this, Kate and Matt made it their mission to teach CPR to as many people as possible to prevent this happening again. This touched the Dragons’ hearts and Deborah commented on how a business’ profit isn’t just making money but it’s about making a difference, too.  "
        },
        {
            "text": "One of the duo’s successes was franchising the business. Franchising may seem a bit daunting to start with, but it’s a great way to expand your business as it’s growing. If you launch a franchise of your business, you can license your IP rights to others for a fee. It grants others permission to do something that would be an infringement of the rights without the licence.  "
        },
        {
            "text": "Back to the Den, and Mum Sara Davies was clearly impressed at both the pitch and the Ball childrens’ first aid skills. Sara offered £50,00 for 20% of the business. After some hesitancy from Matt and Kate, she agreed to drop this to 10% if the money is paid back after 18 months. Happy faces all round!  "
        },
        {
            "text": "After another spirited episode, I’m sure the Dragons were ready to call it a day. I was inspired by their energy and passion but I’m happiest watching from the comfort of my sofa! "
        },
        {
            "text": " "
        }
    ]
}