{
    "url": "https://digitaltrade.blog.gov.uk/2021/06/24/how-we-drive-uptake-of-dits-products-with-our-users/",
    "title": "How we drive uptake of DIT's products with our users",
    "authors": [
        "Elle Panes, Head of Engagement and Strategic Adoption"
    ],
    "categories": [
        "Culture",
        "Digital Services",
        "People and Skills"
    ],
    "pub_date": "2021-06-24T08:58:56+01:00",
    "content": [
        {
            "heading": 6,
            "text": "Picture taken August 2019 "
        },
        {
            "text": "The Engagement and Strategic Adoption team are part of the user centred design profession. We’re a small but impactful team with a focus on getting people to use the products that our DDaT colleagues build, and making sure our users are happy using them. This is our vision and drives all our work."
        },
        {
            "text": "We strongly believe that everyone involved in building products and services has a role to play in driving product uptake. We want to share some of our top tips so that DDaT professionals can put this into practice."
        },
        {
            "heading": 3,
            "text": "It’s all about the user"
        },
        {
            "text": "Just like our colleagues, understanding user needs is very important for us. We want to know:"
        },
        {
            "text": "This can be gleaned from user research and by observing data. We use this to inform our approach and if something isn’t working, we will adapt it."
        },
        {
            "text": "For instance, when working on a recent project to drive uptake of a tool to facilitate Free Trade Agreements (FTA) our user research informed us that senior stakeholder engagement was a really important factor in how they did their work. We used this insight to ensure that our plan reflected this and worked to get sponsorship from senior directors to help drive our objectives."
        },
        {
            "heading": 3,
            "text": "Focus on the outcome"
        },
        {
            "text": "Objectives and Key Results (OKRs) help us keep focus on the task at hand. Our performance analytics team can provide so many data points to measure and track, which is fantastic, but can be overwhelming. We recommend focussing on one or two of your top tier metrics that you’re looking to improve, which you should keep in mind when engaging with users."
        },
        {
            "heading": 3,
            "text": "Use plain English"
        },
        {
            "text": "It sounds so simple, but it’s easily forgotten, especially when you get drawn into the complexities of a project. We try to follow Government Digital Service's (GDS) content design principles to keep us on track. We have other team members review our work and get feedback from the content design team. Working in digital, data or tech doesn’t need to be complicated and this extends to how we talk about our products and services."
        },
        {
            "text": "We lead on sending fortnightly newsletters to our stakeholders and use this to breakdown main terms, so they are meaningful."
        },
        {
            "heading": 3,
            "text": "How are we adding value?"
        },
        {
            "text": "Our users are often busy people, they could be colleagues of ours or businesses in the UK and abroad. It can be challenging to get their attention. In our team we’re always thinking about the question ‘why should they care’. The work of the DDaT team aims to save users time, money or effort, and sometimes all the above. We try and stress this as it really helps motivate users."
        },
        {
            "text": "A project we worked on with in the Customer Relationship Management (CRM) team looked to increase uptake of new features. These would save users time and encourage them to put more information into our CRM. Capturing more information means richer data in understanding how DIT supports businesses, which can be considered to inform government policies and further develop our services."
        },
        {
            "heading": 3,
            "text": "Keep talking"
        },
        {
            "text": "Keep in touch with your users and your stakeholders. Working in the open is a main principle of agile working. It’s also a great way of keeping up momentum and interest in what you’re building. Hosting show and tells or sharing updates with your stakeholders can be impactful in showing how your teams work contributes towards the bigger picture and our shared successes."
        },
        {
            "text": "We try to put the above into action every day. Our team is expanding so we’re excited to build on this. We are working with more teams to drive uptake of DDaT’s products and ways of working. Stay tuned for more updates from us."
        }
    ]
}