{
    "url": "https://insidedio.blog.gov.uk/2021/06/24/transforming-accommodation-services-for-our-armed-forces-families%e2%80%af%e2%80%af/",
    "title": "Transforming Accommodation Services for our Armed Forces families  ",
    "authors": [
        "Air Commodore James Savage"
    ],
    "categories": [
        "Accommodation",
        "Future Defence Infrastructure Services (FDIS)"
    ],
    "pub_date": "2021-06-24T11:24:22+00:00",
    "content": [
        {
            "text": "David Brewer’s recent blog set out DIO’s new approach – through the Future Defence Infrastructure Services (FDIS) programme - to delivering efficient and effective hard facilities management services across the Built Estate, as existing contracts come to an end. That journey continues as, today, new FDIS contracts have been awarded covering the delivery of accommodation services for Service personnel and their families from March 2022.  "
        },
        {
            "heading": 2,
            "text": " New ways of working    "
        },
        {
            "text": "Today has seen five new contracts awarded to replace the single National Housing Prime contract currently operated by Amey Defence Services. The approach is consistent with the overall FDIS approach that David outlined, seeking to ensure greater resilience, embed the principle of collaboration and encourage continuous improvement.  "
        },
        {
            "text": "However, the accommodation contracts have been designed very much with our customers – the Service families for whom we provide homes – in mind. To this end, we worked closely with Royal Navy, Army and Royal Air Force and the Service Families Federations to ensure that we captured SFA occupants’ needs and that their key concerns with the current contract were addressed. The result is designed to deliver significant changes in what families can expect. "
        },
        {
            "text": " The National Accommodation Management Services (NAMS) contractor will operate the National Service Centre, which will act as a single point of contact for all customer requests, such as scheduling appointments for repairs and move-in and outs and checking that the RAMS contractor has properly prepared properties for Move In before each new family arrives. This will ensure a consistent ‘front end’ experience for Service families wherever they are based in the UK.  "
        },
        {
            "text": "Families will be able to report faults via an expanded range of means such as telephone, email, an on-line portal and a specifically developed app delivering greater flexibility to access the services they need. The appointments system will provide greater flexibility with shorter appointment windows throughout the day, as well as evening and weekend appointments. If required, follow-up appointments can be booked by contractors while they are still attending the property. "
        },
        {
            "text": "The four Regional Accommodation Maintenance Services (RAMS) contracts will conduct statutory and mandatory checks and provide the repair and maintenance services needed to ensure the SFA estate is maintained to the required standards. They will also be responsible for preparing SFA to ensure they are ready for occupation by Service families when allocated. There will be separate contracts in Northern, Central, South East and South West Regions. "
        },
        {
            "text": " "
        },
        {
            "text": "The NAMS and RAMS contracts require suppliers to apply industry best practice for the allocation, management and maintenance of SFA accommodation. For most types or repair, contracted response times will be shorter than today and the RAMS contractors will be incentivised to aim even higher through additional payments if they exceed the minimum acceptable standard. The NAMS and RAMS contracts also include targets to fix first time and for customer satisfaction, adopting the same approach based on a minimum Acceptable Level of Performance and incentives to work towards a higher Target Level of Performance. "
        },
        {
            "text": "Suppliers will also collect and manage estate data, exploit digital technology and provide estate intelligence. This will enable DIO to better support the Armed Forces in making wider investment decisions about how best to manage the SFA estate. "
        },
        {
            "heading": 2,
            "text": "The successful bidders "
        },
        {
            "text": "The successful bidders are Pinnacle Group Ltd, which has won the NAMS contract with Amey Community Ltd winning the RAMS contracts for Northern and Central regions and Vivo Defence Services Ltd winning RAMS contracts for South East and South West regions.   "
        },
        {
            "text": "The contracts awarded today are worth £650m out of an FDIS total of around £3bn. As with the Built Estate, the initial contracts are for seven years but could be extended up to a further three years.   "
        },
        {
            "heading": 2,
            "text": "Bringing them onboard "
        },
        {
            "text": "Having lived in SFA for much of my RAF career, I am passionate about the work we do every day to support the Armed Forces and their families. The success of these new contracts will not only depend on how they are written, but also on the way in which we in DIO and our partners collaborate to deliver the right outcomes for our customers. I am delighted to announce the successful suppliers for the Accommodation NAMS and RAMS FDIS contracts and look forward to working with them to provide the best possible service for our Service families in the future.    "
        },
        {
            "text": " "
        }
    ]
}