{
    "url": "https://designnotes.blog.gov.uk/2021/06/24/were-hiring-interaction-and-service-designers/",
    "title": "We’re hiring interaction and service designers!",
    "authors": [
        "Tim Paul",
        "Martin Jordan – former Head of Service Design, GDS"
    ],
    "categories": [
        "Community",
        "Design"
    ],
    "pub_date": "2021-06-24T09:19:51+01:00",
    "content": [
        {
            "text": "\nThe Government Digital Service (GDS), Central Digital and Data Office (CDDO) and the Chief Digital Information Office (CDIO) in Cabinet Office are looking for interaction and service designers to work on services that matter across government."
        },
        {
            "text": "Following our  Government Design Principles, we deliver platforms, standards and digital services to help departments transform how they work and meet the needs of their users."
        },
        {
            "text": "Our work is user-focused and forward-looking, making our organisation a meaningful and impactful place to work. On this blog, you can find plenty of posts our designers have written over the years documenting their work and thinking. "
        },
        {
            "text": "We’re recruiting designers for service teams in all 3 organisations. This is a rolling campaign – we’ll be looking for a range of seniority levels, contract lengths and locations. "
        },
        {
            "text": "If the currently advertised jobs aren’t what you are looking for, or suitable for your level of experience – please get in touch by sending us a direct message; there might be something coming up that is more appropriate. Anyone passing an interview will be considered for future roles in the campaign."
        },
        {
            "text": "As a designer in the Cabinet Office, your job will be to work with skilled  multidisciplinary teams to design, prototype and build excellent public services. You’ll create multi-channel, cross-government services that are user-centred, equitable, sustainable and accessible."
        },
        {
            "text": "You’ll help identify and fix some of the toughest problems in public infrastructure and you will be focussing on design of services at scale. You’ll help the government  transform the way it delivers services, so that they’re more efficient, simpler, faster and easier to use."
        },
        {
            "text": "Examples of the kind of work you can expect to do include:"
        },
        {
            "text": "You’ll also be part of a fantastic government design community, where we share ideas and challenges with 1000s of designers across the public sector. This is a chance to work on things that matter, at a huge scale, with people who value design. "
        },
        {
            "text": "In the coming days, we’ll share more about how our recruitment process works. Recently, some of our colleagues wrote about how it was to  start as a designer in government when you’re working from home . And last year, we blogged about how designers across government are working remotely. If you’d like to hear from designers already working here, we’re running 2 career events for underrepresented groups on Tuesday, 29 June."
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "To apply for a role, you’ll need:"
        },
        {
            "text": "Apply for a senior interaction designer role"
        },
        {
            "text": "Apply for a senior or midweight service designer role"
        },
        {
            "text": " You can  follow Tim and follow Martin on Twitter, and don’t forget to sign up for email alerts."
        }
    ]
}