{
    "url": "https://educationhub.blog.gov.uk/2021/06/what-do-ptas-do-and-why-should-you-join-one-pta-members-answer-your-questions/",
    "title": "What do PTAs do and why should you join one? PTA members answer your questions",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-24T17:10:28+01:00",
    "content": [
        {
            "text": "This week is Parentkind’s National PTA Week. To mark the week we put your questions to the chair and secretary of a Parent Teacher Association (PTA) from a school in Gloucestershire to find out more about what they do, why PTAs are so important and how people can join them. "
        },
        {
            "text": "We are Rachel Arthur (PTA Chair) and Nathalie Dawson (PTA Secretary) of St James’ Primary PTA, Cheltenham, Gloucestershire. We have supported the PTA as volunteers since our children started school in 2012 (Nathalie) and 2014 (Rachel)."
        },
        {
            "text": "As our PTA has an annual income of more than £5k we are registered as a charity with the Charity Commission. Our PTA Committee consists of the Chair, Secretary and Treasurer, these are a legal requirement of our charity status. To support these roles, we have a PTA Planning Team, which consists of a core team of five parents, two teachers (our teacher liaisons) and the Head Teacher. We also have a host of regular volunteers who support our fundraising events programme. We are a close team who work amazingly well together, raising between £16-£20k per year (in non-covid times!). Although this past school year we have still managed to raise £12k so far, with £15k projected, which is an amazing achievement! This has been through Mufti Days, Bag2School collections, Zoom Pumpkin Parties, Facebook Live Christmas and Summer Raffles, Christmas Card Project, Easter Trail, ECO HUB TerraCycle recycling, Preloved Uniform Sales, Dressing Up Costume Sales, Plant Sales and a Smarties Challenge. The pandemic made us think outside the box, but we still managed to keep the PTA wheels in motion! We’ve also done a few free colouring/making competitions for when the children have needed a boost emotionally, as we are very much about giving back as well as fundraising. The children are always our main focus."
        },
        {
            "text": "Our PTA is very much at the heart of our school community. Our Children, Parents, Head Teacher, Teachers, Staff and School Governors are very complimentary about our activities and the role we play in strengthening the school community."
        },
        {
            "heading": 3,
            "text": "What do PTAs do?\n"
        },
        {
            "text": "A PTA is a Parent Teacher Association, an organisation with a mission to make the school a better place for children to learn. St James’ Primary PTA brings together parents, teachers and children to raise funds and strengthen the school community. Money raised is usually spent on things that the school budget does not cover."
        },
        {
            "text": "In contrast, a Governing Body exists to support the strategic leadership of the school. St James’ Primary Governing Body consists of staff, parents, Local Authority and community representatives. The governors have three main roles – Strategic Planning, Monitoring and Finance."
        },
        {
            "heading": 3,
            "text": "Why should I join one?"
        },
        {
            "text": "There are many reasons why you should join your PTA. From making new friends and getting to know the school environment, through to helping raise much needed funds and making a difference to the children and school community. All of these things help you grow in confidence as a parent and it feels good to know you are making a difference for your children and for generations to come."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What will be expected of me? "
        },
        {
            "text": "There is no expectation on any parent volunteer, any amount of time you can give to the PTA will always be well received. There are a variety of ways you can get involved, from engaging with social media activity, attending PTA Meetings through to volunteering at events or coordinating events. Even donating preloved items, raffle prizes or suggesting brilliant ideas are ways of getting involved. There seems to be a myth that if you get involved with your PTA you will never be able to escape! We make it clear that parents can come to our meetings to just listen and learn, or they can take a more active role if they want to, there are no set expectations."
        },
        {
            "heading": 3,
            "text": "Ok, how do I find out if my child’s school has a PTA?"
        },
        {
            "text": "Most schools have a website where you will find a webpage about their PTA. Here you will find more information about the role of the PTA and how to contact them. You will probably be given a welcome pack by your school when you start which should also give you details about your PTA. If your PTA has a social media platform then join it, have a scroll and read all about what they have been up to. You might find your PTA has PTA Champions within each year group, seek them out and get to know them, they will be more than happy to help answer your questions. Finally, if none of the above exists speak to your school office and if your school doesn’t have a PTA then consider rallying the troops and starting one yourself! You will find lots of resources on the Parentkind website for starting a PTA."
        },
        {
            "heading": 3,
            "text": "How do I join my children’s school’s PTA?"
        },
        {
            "text": "In most schools you automatically become a member of the PTA simply by being a parent at the school. If you would like to take a more active role and find out more about PTA volunteering opportunities then attend a PTA meeting. This is a great first step. It is always a good idea to attend a few meetings to get to know the PTA and then when you are more confident you can start to take a more active role if you wish. You could always take a friend or two along and take on some tasks together."
        },
        {
            "heading": 3,
            "text": "I don’t think my child’s school has a PTA – how can I set one up?"
        },
        {
            "text": "Check with your school office to see if the school has a PTA. If there isn’t one then it is a good idea to gauge parents’ interest in forming a PTA. Getting the schools backing is also important and speaking to other PTAs in your area is a great way to research how you might like your PTA to run. Once you feel confident that the PTA is happening then call a meeting (AGM – Annual General Meeting) to officially launch the PTA. Parentkind have lots of resources available to help you start your own PTA. You will need to consider what Constitution you need, this is the set of rules your PTA will abide by. Once this is all done then you are ready to introduce the PTA to your school community and start fundraising. Social media platforms are a great way to communicate with the school community and Parentkind have some great policies you can refer to keep all things safe and legal. Start small, with easy-to-run, manageable events and in time you will evolve and be able to grow with the full support of your school community."
        },
        {
            "heading": 3,
            "text": "How can I attract more support from other volunteers for my child’s school PTA?"
        },
        {
            "text": "This is the million-dollar question for all PTAs, worldwide! The PTA runs on a continuous cycle, as children reach their final year and leave, so do the parents. PTAs are constantly needing new volunteers to ensure the PTA continues. From experience it is key you are clear about how people can contact you, get involved and keep a friendly tone to your social media and communications so people want to volunteer. We have found that volunteers are wary of taking on too much and often like to get involved in one or two events each year so we have recruited volunteers to events, rather than the entire PTA. For example, we have a Cake Sale team, Preloved Uniform team and a Christmas Card team with specific people who look after those events. We also have PTA Champions; these people are our go-to people in each year group for all PTA queries. It helps having someone in your year group who you can bump into on the playground to answer questions and dispel myths. We still need volunteers who want to take on more and this is where the PTA Chair, Secretary and Treasurer roles come in. People tend to build up to these roles as they are a bigger commitment with more experience required."
        },
        {
            "heading": 3,
            "text": "How can I come up with new event ideas, particularly non-traditional ideas?"
        },
        {
            "text": "We find joining national PTA groups on Facebook and other social media platforms a great source of new event ideas. We are also very open to parent suggestions and are dynamic in our approach to trying new things. Our Easter Trail came about from our ‘Wednesday Well-being Walks’ through lockdown. We realised we knew lots of families who lived near to school and developed a trail to get everyone out walking as a family."
        },
        {
            "text": "We also decided to promote the #shoplocal ethos when creating our Christmas and Summer Raffles. Without the actual Christmas and Summer Fairs, which usually hosted the raffles, we had to make our raffles special. We decided to ask our parent community if anyone who had a business would like to donate a raffle prize. In return, we promoted each business with a social media post and showcased their business and raffle prize. We created a marketing campaign #ChristmasRaffleCountdown and #SummerRaffleCountdown. The school community loved it as they all learned about the wonderful businesses on our school doorstep and the prizes were just brilliant."
        },
        {
            "heading": 3,
            "text": "Why is it important for a school to have a PTA?"
        },
        {
            "text": "A good PTA can help strengthen the child, parent, school community and can become a huge marketing tool for the school, a way of strengthening their reputation and increasing family engagement. The PTA can help communicate with families more effectively, enhance fundraising efforts and qualify for grants and awards to support the school. All of this activity helps enhance a school’s reputation within the community. The PTA is often referred to as the heart of the school community and in our case it really is."
        },
        {
            "text": " "
        }
    ]
}