{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/24/what-does-an-engineering-mindset-bring-to-policy-making/",
    "title": "What does an engineering mindset bring to policy making?",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2021-06-24T16:55:09+01:00",
    "content": [
        {
            "text": "The Engineering in Policy network asked this question to engineers and those with an interest in engineering. We hoped that we could prompt a conversation about the importance of having engineers in the room at key points in the policy life-cycle. But the responses we received go beyond just practical issues and start outlining the professional identity of engineers in the policy context."
        },
        {
            "text": "The word ‘Practical’ immediately pops out of the word cloud that we built from the responses. This reflects our respondents’ focus on the attitude engineers can bring to policy-making. An engineering perspective can bring a solutions-focused and ‘can do’ attitude and ensure changes take place through a practical, realistic and pragmatic mindset."
        },
        {
            "text": "However, the survey suggests that engineers can bring more than just a set of attitudes to the policy table. They can bring a set of tangible tools as well. These include systems-based approaches and thinking, modelling, and life-cycle analysis. 'Softer’ tools like drawing on a network of experts and multi-disciplinary working were also mentioned. Most of the tools listed bring a more holistic view, encompassing both social and technical elements, into the policy making process. The survey responses also frequently mentioned engineers apply approaches that are logical, reasoned, evidence-based, data-driven, structured, methodological and systematic."
        },
        {
            "text": "Finally, some people’s feedback brought together all the thoughts mentioned above and highlighted the positive outcomes of including engineers in the policy making process. Emphasis was placed on how engineers can help create new systems, solve problems and hence effect change in the world."
        },
        {
            "text": "Many of these skills, experiences and perspectives are shared across professions and disciplines. But this specific combination could be unique to engineering!"
        },
        {
            "text": "Find out more about the Engineering in Policy Network and sign up to hear about events and other initiatives. Or join our LinkedIn Group to continue the conversation."
        }
    ]
}