{
    "url": "https://naturalengland.blog.gov.uk/2025/11/10/building-britains-future-why-nature-and-growth-go-hand-in-hand/",
    "title": "Building Britain's Future: Why Nature and Growth Go Hand in Hand",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Development",
        "Green Infrastructure",
        "Growth",
        "Natural England"
    ],
    "pub_date": "2025-11-10T08:00:00+00:00",
    "content": [
        {
            "text": "By Tony Juniper CBE, Chair of Natural England"
        },
        {
            "text": "It’s obvious isn’t it. Britain can either build the homes, infrastructure and clean energy systems our growing economy needs, or we can protect our natural environment for future generations."
        },
        {
            "text": "This apparent choice can at first sight make sense, but the fact is that it’s false, and a false choice that has for far too long held back progress."
        },
        {
            "text": "The reality is that our economic success, public health and national resilience all depend on a thriving natural environment. From the clean water that powers our industries to the green spaces that keep our communities healthy, Nature isn't an obstacle to growth – it's the foundation that makes a liveable future possible."
        },
        {
            "text": "This basic truth about the need to restore the health of the natural world in order that it can continue to support society is what drives our new strategy. It’s called “Recovering Nature for Growth, Health and Security” and was launched last week. It sets out a systemic change in approach. This is because England’s natural environment has continued to decline overall, despite current protections, and incremental site-by-site action has not generated the level of Nature recovery we need to see."
        },
        {
            "text": "Implementing this strategy means change in how Natural England works, and in how we work with partners across business, government and communities to integrate Nature into every day decision making. Nature is essential national infrastructure, underpinning economic growth, health, and security. Although it remains under great strain, there is hope for the future in much of the work now taking place."
        },
        {
            "text": "Even in places where the natural world is particularly fragile, strong partnerships are enabling sensitive development to come forward in ways which allow Nature to recover. That’s exactly what we’ve seen recently in the Arun Valley area in North Sussex where Natural England has worked with partners to enable more than 20,000 new homes to go ahead while protecting internationally important wetlands and creating new opportunities for Nature recovery."
        },
        {
            "heading": 4,
            "text": "Why businesses are embracing Nature"
        },
        {
            "text": "Across Britain, forward-thinking companies are discovering that working with Nature isn't just good for the environment – it's good for business. I frequently come across specific cases which prove this broad point, including at one of Britain’s largest infrastructure projects."
        },
        {
            "text": "At Sizewell C, Nature reserves are being created and enhanced alongside the construction of a huge new power station. I’ve seen in Nottinghamshire how the aggregates company Tarmac is delivering Nature-positive outcomes at quarry sites while supplying the materials needed for new houses and major infrastructure. Anglian Water has embedded strong Nature-positive ambitions into plans for its new Fenland Reservoir. Across the farming sector, more producers are embracing Nature recovery as part of modern food production."
        },
        {
            "text": "What strikes me most about these examples is how seamlessly environmental ambition aligns with business objectives. These companies aren't reluctantly complying with regulations – they're pioneering solutions that create competitive advantages."
        },
        {
            "heading": 4,
            "text": "Strategic partnerships that unlock growth"
        },
        {
            "text": "The key to combining Nature and growth successfully lies in working at a strategic scale, bringing together multiple partners to find innovative solutions, and to do that during project conception, rather than retrofitting mitigations half way through. Natural England has pioneered this approach, and the results speak for themselves."
        },
        {
            "text": "Our strategic licencing system for great crested newts exemplifies this thinking. Rather than assessing each development site individually, we enable planners and developers to focus development in suitable areas while funding enhanced habitat for these protected amphibians elsewhere. The result? A faster planning process and larger, healthier newt populations overall."
        },
        {
            "text": "This partnership approach proved transformative in delivering over 50,000 homes around the Thames Basin Heaths. When the area was designated as a Special Protection Area for ground-nesting birds in 2005, housing plans initially stalled due to concerns about increased recreational pressure. But Natural England worked closely with 11 local authorities and developers to create alternative green spaces for residents. The outcome exceeded everyone's expectations: homes were built ahead of schedule, almost 2,000 hectares of new recreational space was created, and populations of Dartford warbler, woodlark and nightjar increased."
        },
        {
            "heading": 4,
            "text": "Policy frameworks that enable innovation"
        },
        {
            "text": "Today's legislative landscape actively encourages businesses to integrate Nature into development plans. The commitment to halt biodiversity decline by 2030 provides clear direction, while policies like Biodiversity Net Gain ensure new developments leave a Nature-positive legacy. In many cases, this results in higher quality natural environments than existed before development began."
        },
        {
            "text": "These aren't bureaucratic barriers – they're frameworks that unlock innovation and create new market opportunities for businesses that embrace Nature-based solutions."
        },
        {
            "heading": 4,
            "text": "The Britain we’re building together"
        },
        {
            "text": "If we can replicate these successful partnerships across the country, the transformation could be profound. Within the next decade, we could see housing developments that incorporate functional ecosystems, making homes more resilient to climate impacts and more attractive places to live. Infrastructure could work with natural processes rather than against them, reducing long-term maintenance costs while improving performance."
        },
        {
            "text": "Communities would have better access to Nature, supporting improved physical and mental health outcomes while reducing pressure on NHS services. A development sector would emerge that sees Nature recovery as a competitive advantage – one that creates investment-attractive places and enables a healthy, productive workforce."
        },
        {
            "heading": 4,
            "text": "Leading the world in green growth"
        },
        {
            "text": "Britain has always been at its best when facing down false choices, when finding innovative solutions and when thinking clearly about the future and what it might hold. The path ahead is clear. It invites us to collaborate and build the partnerships necessary for achieving the resilient, prosperous and secure nation that can come from integrated the goals of growth and Nature recovery, rather than relying on the kinds of outdated thinking that pit development against the health of our natural environment."
        },
        {
            "text": "The more sector leaders and businesses collaborate and innovate with Nature at the heart of their plans, the brighter our future becomes. We can establish Britain as a world leader in Nature recovery – a country where people are healthier and happier in greener and more resilient communities, where forward looking businesses reap the economic rewards that accompany the steps we must make toward a healthier planet."
        },
        {
            "text": "This isn't just possible – it's already happening. And what we can see now is just the beginning."
        }
    ]
}