{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/11/10/challenges-of-considering-a-spiritual-model-when-working-under-a-social-work-medical-model/",
    "title": "Challenges of Considering a Spiritual Model when Working Under a Social Work/Medical Model",
    "authors": [
        "Soyeb Aswat",
        "Sarah McClinton",
        "Robert Lewis"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Information and access",
        "Knowledge and skills",
        "Mental health",
        "Our profession",
        "Research",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2025-11-10T15:47:27+00:00",
    "content": [
        {
            "text": "Introductions "
        },
        {
            "heading": 2,
            "text": "Challenges of Considering a Spiritual Model when Working Under a Social Work/Medical Model - Soyeb Aswat"
        },
        {
            "text": "Having come into the Social Work arena as a Newly Qualified Social Worker working within an area which had a large South Asian Muslim Community, I quickly realised there were misconceptions and barriers to accessing and providing culturally appropriate interventions for this client group."
        },
        {
            "text": "A major dilemma I faced was what I now name, the Medical Model vs the Spiritual Model. The dilemma of engaging with a client that is presenting with mental health symptoms, that we may term as psychosis, but the client states that their voices are attributed to Jinn possession and the intervention they want is spiritual healing or exorcism. Thus, presenting a dilemma for professionals working within a Western Medical Framework, that can appear to be not fully considerate of these differential views. "
        },
        {
            "text": "When these alternate views are dismissed without consideration, the individual client and/or groups of individuals with the same belief can become alienated and unwilling to access services. This can create a barrier between building a therapeutic relationship with the client and the potential opportunity to engage at an early intervention stage with both the client and groups of individuals, leading to long term detrimental impact. "
        },
        {
            "text": "To try and bridge these two differentiating concepts or views of treating the same set of symptoms, there are some key areas that need consideration."
        },
        {
            "text": "As professionals and as individuals we do need to be aware of the differentiating views of mental health within different cultures and countries. "
        },
        {
            "text": "Some of the key areas that I feel need consideration are summarised within this model, which has been based on personal experience along with various research projects I have undertaken or been involved in:"
        },
        {
            "text": "Some (but not all) actions to take when working with spirituality:"
        },
        {
            "text": "By using evidence base and research we are able to consider someone's spiritual needs alongside the traditional medical model interventions. "
        },
        {
            "text": "Undertaking research or study within your own organisation around this subject can really help evaluate how well individuals and the organisation are meeting mental health needs, but also the spiritual needs of those they work with and support."
        },
        {
            "text": "If anyone is interested in exploring this in more detail or would like to share ideas around this, please email: soyeb.aswat@baswindependent.co.uk"
        }
    ]
}