{
    "url": "https://forestrycommission.blog.gov.uk/2025/11/10/how-to-protect-trees-and-woodland-from-mammal-damage/",
    "title": "How to protect trees and woodland from mammal damage",
    "authors": [
        "Chris Tomlin"
    ],
    "categories": [
        "Deer",
        "Woodland management"
    ],
    "pub_date": "2025-11-10T09:00:00+00:00",
    "content": [
        {
            "text": "Mammal damage can have a significant impact on trees of all ages and on wider woodland ecosystems. Deer browsing alone can reduce timber values by up to 30-50%,1 and in extreme cases, it can stop the establishment of new woodlands altogether. Common mammal species that are known to damage trees include deer, grey squirrels, voles, rabbits, hares and domestic livestock."
        },
        {
            "heading": 2,
            "text": "Mammal damage to valuable ecosystem services"
        },
        {
            "text": "Mammals play an important role in woodland ecosystems and agroforestry (integrating trees into farming systems). But wild, domestic and feral mammals can all cause significant damage to trees, potentially impacting woodland creation and management goals. This may affect the valuable ecosystem services that trees provide, such as biodiversity conservation and timber production. "
        },
        {
            "text": "Understanding which species pose a risk – either now or in the future – helps landowners and managers to implement the most effective tree protection measures."
        },
        {
            "heading": 2,
            "text": "Mammal damage to trees and biodiversity"
        },
        {
            "text": "Studies show that well-managed woodlands increase biodiversity value, so the protection of trees from mammals is essential, for both established woodlands and for newly created woodland. If we don’t protect trees, it can result in:"
        },
        {
            "text": "Every stage of tree growth can be attacked by one or more species of mammal. Often a species, such as grey squirrels, may cause damage at several growth stages . Most mammal damage to trees is from either:"
        },
        {
            "heading": 2,
            "text": "Our new tree protection guidance"
        },
        {
            "text": "We have launched our new tree protection guidance, specifically for woodland owners, woodland advisors and those planning to plant new woodland in the UK. Our guidance includes helpful real-world examples of tree protection in action, and a new visual guide will be available soon, that helps to spot the signs of mammal damage in your wood."
        },
        {
            "text": "This new guidance, based on best practice from across Europe, will help you to identify mammal species that can harm trees, and the practical ways you can prevent damage and protect our treasured UK treescape."
        },
        {
            "heading": 3,
            "text": "A diverse range of mammal species covered"
        },
        {
            "text": "Our new guidance includes 23 mammal species, from eight species groups found in the UK, that can directly or indirectly impact trees and biodiversity. Species are grouped based on similarities in their ecology, behaviour, legal status and the type of damage they can cause to individual trees and treescapes."
        },
        {
            "heading": 3,
            "text": "Tree protection methods"
        },
        {
            "text": "Our guidance outlines both the positive and negative effects of mammals and advises landowners and managers on appropriate methods to prevent or mitigate tree damage. A proportion of these methods are well-established, while others are considered to be more innovative or still in development. "
        },
        {
            "text": "Methods include directly managing mammal populations, physically preventing damage through exclusion or deterrence and modifying woodland management practices to improve tree resilience."
        },
        {
            "heading": 3,
            "text": "Real-world examples"
        },
        {
            "text": "We feature real-world examples of tree protection strategies in action across the UK, with insights and experiences shared directly from woodland and land managers."
        },
        {
            "heading": 3,
            "text": "A visual and practical guide"
        },
        {
            "text": "A new visual guide to mammal tree damage will be available soon. The guide will feature photos of mammal damage to look out for, as well as practical advice that covers additional species to the existing grey squirrel and deer damage guide."
        },
        {
            "text": "Incorporating best practice and experience in tree protection from Edinburgh Napier University, Confor, Natural England and Forest Research, has led to the creation of this easy to navigate, practical guidance, designed to benefit every woodland manager. "
        }
    ]
}