{
    "url": "https://aphascience.blog.gov.uk/2025/11/10/how-healthy-is-our-wildlife/",
    "title": "How healthy is our wildlife? New report unveiled.",
    "authors": [
        "Jenny Cantlay"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2025-11-10T09:00:16+00:00",
    "content": [
        {
            "text": "The Great Britain Wildlife Health Partnership (GBWHP) has just released its new look annual report for 2024 and it is more than just a facelift. It provides a comprehensive overview into the fascinating world of wildlife disease surveillance activities in 2024 across England, Wales and Scotland, offering insights for scientists, conservationists, and curious nature lovers alike, interested in the health of our native and non-native wildlife species."
        },
        {
            "text": "The Great Britain Wildlife Health Partnership (GBWHP) is a long-standing wildlife surveillance collaboration that monitors the disease status of free-living wildlife in Great Britain (GB)."
        },
        {
            "heading": 2,
            "text": "Who is behind the partnership?"
        },
        {
            "text": "GBWHP is a collaboration of nine expert organisations working together to monitor the health of free-living wildlife across GB. The team includes:"
        },
        {
            "text": "The partnership shares information on new and re-emerging threats to wildlife and their impact. The One Health approach examines how threats impact human and animal health, highlighting their connection to biodiversity and the environment."
        },
        {
            "heading": 2,
            "text": "Scanning the wild: how surveillance works"
        },
        {
            "text": "Infectious and non-infectious disease surveillance of wild mammals, birds, amphibians and reptiles in GB is mainly achieved by post-mortem examination and diagnostic testing of dead wild animals. This is known as scanning surveillance. Carcases are submitted to the APHA Diseases of Wildlife Scheme (DoWS) via veterinary investigation centres and surveillance pathology partners, SRUC, and other GBWHP partners with pathology facilities. This ensures that we have pathology expertise across a wide range of terrestrial and aquatic wildlife species."
        },
        {
            "heading": 2,
            "text": "Which species are being monitored?"
        },
        {
            "text": "From hedgehogs in back gardens to whales off the coast, the GBWHP casts a wide net in monitoring the health of our nation’s wild creatures. The Garden Wildlife Health project investigates reports of sick and dead garden birds, amphibians, reptiles, and hedgehogs - those familiar faces of British back gardens. Meanwhile, the UK Cetacean Strandings Investigation Programme dives into the mysteries behind the deaths of marine giants like dolphins, porpoises, whales, as well as seals, basking sharks, and sea turtles found along our shores."
        },
        {
            "text": "On land, APHA’s Diseases of Wildlife Scheme (DoWS) and Scotland’s Rural College (SRUC) receive a wide variety of wild mammals and birds from across GB, helping to build a clearer picture of terrestrial health. The Wildfowl and Wetlands Trust (WWT) monitors wild bird populations at seven key wetland sites, while Cefas brings its aquatic expertise to the table, safeguarding the health of fish and shellfish in both marine and freshwater environments."
        },
        {
            "heading": 2,
            "text": "Targeted surveillance"
        },
        {
            "text": "Targeted surveillance of wildlife is also done in some cases. This is the proactive sampling of species aimed at detecting a particular disease or pathogen - an essential step for early intervention and effective disease control. Sections in this year’s report showcase the wide range of scanning and targeted surveillance activities conducted by partners over the last year. The impact of diseases on wildlife populations, with the wider implications for humans and domestic animals are also explained. Understanding these connections is key to building a resilient, One Health approach to disease management."
        },
        {
            "heading": 2,
            "text": "Mass fatalities: when disease strikes hard"
        },
        {
            "text": "Some diseases described in the report can lead to mass fatalities of wildlife. For example, European brown hare syndrome in hare species and avian botulism in waterfowl. For species of conservation concern, a mass fatality may further threaten an already vulnerable or declining population. An example where disease surveillance is playing a key role in monitoring this kind of threat, described in the report, is in the detection of squirrel pox disease, spread by grey squirrels, which can threaten geographically isolated red squirrel populations with extinction.  "
        },
        {
            "heading": 2,
            "text": "Unusual or novel disease"
        },
        {
            "text": "Mortality investigations of wildlife also enable the diagnosis of an unusual or novel disease - shared in the highlighted cases section of the report. Cefas describes an investigation into the deaths of numerous White Craw Crayfish in Northeast England, a species listed as endangered on the International Union for Conservation (IUCN) Red List of threatened species. The crayfish were found to have unusual shell deformities and Cefas provided a rapid response, collecting samples from dead crayfish at different sites for diagnostic testing."
        },
        {
            "heading": 2,
            "text": "Wildlife and human health: the hidden connection"
        },
        {
            "text": "For some diseases, wild animals can be a source of infection for domestic animals and humans. Surveillance is carried out on wildlife for several of these pathogens due to public health concerns and updates are provided in the report. Examples include:"
        },
        {
            "heading": 2,
            "text": "Why it matters: the power of surveillance"
        },
        {
            "text": "Wildlife surveillance by GBWHP has proven vital in detecting disease threats to vulnerable British species already facing environmental pressures from habitat loss, pollution and climate change. The latest report offers key insights into disease patterns and risk factors, enhancing our understanding of how wildlife health intersects with livestock and human populations for more informed, targeted action under a One Health approach."
        },
        {
            "heading": 2,
            "text": "Get involved: report what you see"
        },
        {
            "text": "Please report any unusual wildlife mortality events in England and Wales to the APHA Diseases of Wildlife Scheme (DoWS). Suitable wildlife casualties will be accepted for submission and further investigation under DoWS."
        }
    ]
}