{
    "url": "https://environmentagency.blog.gov.uk/2025/11/10/navigating-drought-reflections-on-protecting-waterways-and-supporting-canal-users/",
    "title": "Navigating drought: Reflections on protecting waterways and supporting canal users ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Drought",
        "Rivers",
        "tourism"
    ],
    "pub_date": "2025-11-10T09:29:00+00:00",
    "content": [
        {
            "text": "As the summer boating season has drawn to a close, it’s a moment to reflect on the challenges and achievements of the past summer. Drought conditions have tested our waterways and infrastructure - but they’ve also revealed resilience, innovation, and a shared commitment to protecting England’s canals and rivers. "
        },
        {
            "text": "The Environment Agency (EA) Chair, Alan Lovell, recently hosted a visit at Allington Lock on the River Medway in Kent for several senior representatives from the Canal and River Trust, including Chair David Orr. "
        },
        {
            "text": "The group discussed key topics such as water management, navigation services, and future collaboration between both organisations. As part of this, they shared lessons learnt and best practice across cross-cutting areas of work - including recent experiences managing low river flows and drought conditions.  "
        },
        {
            "text": "Reflecting on a record-breaking summer "
        },
        {
            "text": "2025 brought England its hottest summer on record. Extended dry spells and minimal rainfall pushed many rivers and canals to historically low levels. These conditions forced difficult decisions: temporary closures, lock restrictions, and reduced access. While disruptive, these measures were essential to safeguard water supplies, protect habitats, and maintain resilience. "
        },
        {
            "text": "We’ve seen how low flows can strain infrastructure, hinder navigation, and increase environmental risks. In some areas, water levels dropped below safe thresholds for boating, prompting urgent action from navigation authorities and regulators.  "
        },
        {
            "text": "The EA’s role: Balancing navigation and environmental protection "
        },
        {
            "text": "As both a regulator and navigation authority, the EA has to wear multiple hats. We oversee water abstraction and reservoir operations, issue stop notices when levels fall too low, prioritising long-term water security. "
        },
        {
            "text": "Our navigation responsibilities span over 1,000 km of inland waterways, including the non-tidal River Thames, River Great Ouse, and Medway Navigation. It’s our job to keep them open and safe for a variety of uses - especially boating. This includes maintaining locks and weirs, managing water levels, issuing notifications for closures or restrictions, and removing obstructions. "
        },
        {
            "text": "During drought, we monitor water levels, issue guidance to boaters, and work with partners on water-saving measures.  "
        },
        {
            "text": "Learning from the Canal & River Trust’s response "
        },
        {
            "text": "The Canal & River Trust (the Trust), which looks after 2,000 miles of canals and navigable rivers across England and Wales, has played a vital role in managing the wider canal network. With more than 35,000 boats on these waters, canals are busier now than at the height of the Industrial Revolution. "
        },
        {
            "text": "The Trust’s teams and volunteers work around the clock to manage water levels but a record-breaking dry start to spring meant restrictions were brought in early, around Easter, to conserve the water supply in several canals. This meant reducing lock operating hours to extend water supplies and navigation for as long as possible. In some instances, locks were temporarily closed to boats, helping save water to keep boats afloat, protect wildlife, and safeguard canal infrastructure. "
        },
        {
            "text": "For every restriction or closure, the Trust considered factors such as reservoir and river supply, boat traffic demand, evaporation, transpiration, and environmental flow needs. "
        },
        {
            "text": "Volunteer lock keepers helped manage boat traffic to ensure water was used sparingly. Their conversations with boaters shared knowledge about what was happening, why it mattered, and how to help. The Trust’s use of digital channels, including its Notices alert system, Boaters’ Update newsletter, website, and social media, has helped boaters stay informed and involved.  "
        },
        {
            "text": "The dry spring and hot summer took their toll, with, at its peak, around 400 miles of the canal network affected by navigation restrictions or closures. The Trust provided support to people living on their boats and worked with boat hire companies when planning the closures so they could offer alternative routes where possible.  "
        },
        {
            "text": "However, closures weren't all negative: where canals were temporarily closed, the Trust brought forward repairs to minimise disruption later in the year. Autumn rainfall has begun replenishing canal pounds and reservoirs, allowing the Trust to ease restrictions and reopen routes. "
        },
        {
            "text": "Collaboration in action: EA and the Trust "
        },
        {
            "text": "The EA and the Trust worked closely to manage water levels, prioritise navigation routes, and communicate with users. Joint planning, real-time updates, and shared water-saving initiatives helped reduce disruption and build resilience. Together, we’ve shown that collaboration isn’t just beneficial, it’s essential. By pooling expertise and resources, we’ve been able to make fair, transparent decisions based on the best available data. "
        },
        {
            "text": "Spotlight on the Broads "
        },
        {
            "text": "While many inland waterways faced significant drought-related challenges this summer, the Broads presented a different picture. The Norfolk and Suffolk Broads - Britain’s largest protected wetland and third-largest inland waterway - are governed largely by tidal processes rather than river flows. This means navigable depth is typically buffered during dry periods as the sea backfills the system. "
        },
        {
            "text": "However, drought can still have ecological consequences. Reduced freshwater inputs can lead to increased salinity intrusion, pushing saltwater further upstream than usual. In extreme cases, this can result in fish deaths. A combination of events in early October led to hundreds of freshwater fish dying near the River Thurne including Hickling Broad due to a combination of pressures. In response, the EA deployed staff to carry out a fish rescue from Womack Staithe to Hickling Broad, successfully relocating over 100,000 fish (over two separate events). These ecological pressures highlight the importance of tailored approaches to drought resilience.  "
        },
        {
            "text": "Looking ahead "
        },
        {
            "text": "Drought has tested our waterways. But it has also revealed the strength of our partnerships, the dedication of our communities, and the importance of adaptive management. As conditions begin to improve, we’re reflecting on what worked, what we’ve learned, and how we can build greater resilience for the future. "
        },
        {
            "text": "The EA remains committed to supporting navigation and protecting our shared water resources. We’ll continue working with the Trust, the Broads Authority, and local communities to ensure our rivers and canals remain safe, accessible, and sustainable - now and in the years to come. "
        },
        {
            "text": "Find the latest information on drought here:  weekly dry weather summaries, water situation reports, and the Water hub."
        }
    ]
}