{
    "url": "https://minimumwage.blog.gov.uk/2024/05/03/four-facts-about-apprentice-pay-from-the-latest-data/",
    "title": "Four facts about apprentice pay from the latest data",
    "authors": [
        "laituanloh"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-03T17:30:37+01:00",
    "content": [
        {
            "text": "Ever since the National Minimum Wage was introduced in 1999, apprentices have been treated differently. At first, many apprentices were exempt from the minimum wage. In 2010, a separate ‘Apprentice Rate’ was brought in, set lower than other rates (initially at just £2.50 per hour). The Apprentice Rate is the minimum hourly rate an employer can pay their apprentice if they are aged 16-18 or in the first year of their apprenticeship if older[1]."
        },
        {
            "text": "In recent years, Low Pay Commissioners have recommended sharp increases in the Apprentice Rate, bringing it into line with the 16-17 Year Old Rate. In April 2024, the Apprentice Rate increased to £6.40. In our recent advice to the Government on the future of the minimum wage, we looked in depth at the case for going further than this, and ending the different treatment of apprentices altogether."
        },
        {
            "text": "To assess this case, we looked at the latest evidence on apprentices’ pay. For much of our work on the NMW, we use pay data from a survey of employers, the Annual Survey of Hours and Earnings ( ASHE). We think this is less reliable for apprentices than for other workers – and prefer to use it alongside specific surveys of apprentices. The latest of these is the Apprenticeship Evaluation Survey (AEvS), carried out by the Department for Education (DfE) in 2023."
        },
        {
            "text": "DfE expect to publish their full analysis of the survey later this year, but we’re lucky to have advance access to the pay data collected. We’ve published our analysis of that pay data – but in the middle of a report that’s crowded with other analysis. This blog picks out the headlines on apprentice pay from the 2023 AEvS and 2023 ASHE. Our analysis may differ from what is published by DfE because we focus on apprentices eligible for the Apprentice Rate; see our report on the Minimum Wage Beyond 2024 [link] for more details."
        },
        {
            "heading": 2,
            "text": "One: The typical apprentice earns more than the minimum wage – but less than their non-apprentice counterparts"
        },
        {
            "text": "We used the 2023 AEvS to look at how apprentices are paid and understand the potential impacts of removing the Apprentice Rate."
        },
        {
            "text": "Overall, most apprentices earn more – often a lot more – than their minimum wage (which was £5.28 at the time of the survey). ASHE data show, though, that employers expect apprentices to accept lower pay than non-apprentices. Median pay for apprentices is consistently lower than for non-apprentices of the same age."
        },
        {
            "text": "AEvS 2023 (pay weights) and ASHE 2023 (provisional, standard weights). Apprentice medians are based only on apprentices eligible for the Apprentice Rate."
        },
        {
            "heading": 2,
            "text": "Two: Employers still make use of the apprentice minimum wage even if they don’t pay at the rate"
        },
        {
            "text": "In the past, the data have always shown that it was relatively common for 16, 17 and 18 year old apprentices to be paid the apprentice minimum wage – but much less so for older apprentices."
        },
        {
            "text": "In the latest data, the proportion of young apprentices paid the minimum wage has fallen – but remains significant. As Figure 1 shows, nearly one in three 16 and 17 year olds, and nearly one in five 18 year olds on apprenticeships earn the apprentice minimum wage."
        },
        {
            "heading": 3,
            "text": "Figure 1: Coverage and effective coverage by age, 2021 and 2023"
        },
        {
            "text": "Source: AEvS 2021 and 2023 (pay weights). Population eligible for the Apprentice Rate only."
        },
        {
            "text": "But look again at the chart above – the lighter-shaded sections of each bar represent ‘effective coverage’, where employers pay apprentices more than the Apprentice Rate, but less than the NMW rate for their age. Overall, one in four apprentices are paid less than their NMW age rate – whether that is the National Living Wage or the 18-20 Year Old Rate."
        },
        {
            "heading": 2,
            "text": "Three: There are big pay gaps between subjects"
        },
        {
            "text": "A feature of past data on apprentice pay has been the large differences in earnings between sectors – and the 2023 data is no different. Sectoral comparisons are imperfect, as the data aggregates different apprenticeship routes into overarching sector subject areas – but they are possible in some areas. Median pay for all apprenticeships is £10.86 per hour, while in Service Enterprises (where starts are dominated by Hair and Beauty), Sport Leisure and Recreation and Direct Learning Support (where most starts are for teaching assistants), median pay is less than £6 per hour."
        },
        {
            "heading": 3,
            "text": "Figure 2: Median hourly pay in the lowest-paid subject areas, 2023"
        },
        {
            "text": "AEvS 2023 (pay weights). Population eligible for the Apprentice Rate only. We use more detailed subject areas than included in the forthcoming DfE publication and so figures will differ."
        },
        {
            "heading": 2,
            "text": "Four: Pay varies by gender, but at higher levels women may do better than men on average"
        },
        {
            "text": "There is an important gender dimension to the apprenticeships which young people undertake, the money they earn and the pay progression they can expect upon completion. This is visible in the latest data, and our report looks in depth at other evidence behind this."
        },
        {
            "text": "As Figure 3 below shows, women on Level 2 apprenticeships are much more likely to be covered by the Apprentice Rate than their male counterparts. This is a consequence of the heavily skewed gender balance in certain low-paying apprenticeships. In two of the three lowest-paying subject areas (Service Enterprises and Direct Learning Support), a large majority of starts are by female apprentices. This pattern reverses at Level 3, where coverage among women is lower than it is for men."
        },
        {
            "heading": 3,
            "text": "Figure 3: Coverage by gender and level, AEvS, 2021 and 2023"
        },
        {
            "text": "AEvS 2021 and 2023 (pay weights). Population eligible for the Apprentice Rate only."
        },
        {
            "heading": 2,
            "text": "Five: apprentices are more likely to be underpaid than other workers"
        },
        {
            "text": "Surveys consistently reveal that apprentices are often paid below the minimum wage, more so than other workers. The 2023 AEvS confirms this trend, with nearly one in five 16-17 year old apprentices and nearly one in ten 18 year old apprentices underpaid. As a share of coverage, underpayment sits well above 60 per cent for some age groups. Around half of the underpaid apprentices receive wages within 5 per cent of the Apprentice Rate."
        },
        {
            "heading": 3,
            "text": "Figure 4: Underpayment of apprentices, overall rate (LHS) and as a share of coverage (RHS), by age, England, 2021 and 2023"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Source: LPC analysis of AEvS, pay weights, England, 2021 and 2023. Population eligible for Apprentice Rate only. Striped bars indicate that estimates are suppressed due to low sample sizes."
        },
        {
            "text": "Possible reasons include not compensating for off-the-job training or not adjusting wages post-eligibility. In the past, we have suggested that there could be widespread failure to pay for apprentices’ off-the-job training hours. A competing explanation is that employers fail to amend apprentices’ pay when they cease to be eligible for the rate."
        },
        {
            "heading": 2,
            "text": "What next for the Apprentice Rate?"
        },
        {
            "text": "In our report, we acknowledge that there is a case for removing the apprentice rate. A broad range of stakeholders, including employer and worker representatives and policy makers supported this. Many believe the existence of a lower rate tarnishes the brand of apprenticeships, while policy makers told us that its removal wouldn’t harm training standards or volumes."
        },
        {
            "text": "We agreed that the rate should rise and could be reformed to a simple discount on the relevant age-related rate. We stopped short of recommending the rate’s removal, though. Our view was that changes to the NMW age structure – where we recommended moving towards a National Living Wage for all workers aged over 18 – should be prioritised over changes to the treatment of apprentices. Lower minimum wages on the basis of training are more justified than on the basis of age."
        },
        {
            "text": "[1] All apprentices aged 19+ must be paid the relevant minimum wage rate for their age from the second year of their apprenticeship onwards. Throughout an apprenticeship, the relevant minimum wage must be paid for all hours worked, including off-the-job training time. For further information, visit [https://www.gov.uk/become-apprentice/pay-and-conditions]"
        }
    ]
}