{
    "url": "https://educationhub.blog.gov.uk/2024/05/03/how-to-claim-15-hours-free-childcare-code/",
    "title": "Thousands of parents of two-year-olds benefit from 15 hours free childcare - here's how",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare"
    ],
    "pub_date": "2024-05-03T11:00:53+01:00",
    "content": [
        {
            "text": "We’re making the biggest investment by a UK government into childcare in history, doubling the amount we expect to spend over the next few years from around £4 billion to around £8 billion each year."
        },
        {
            "text": "We've already started to rollout the first phase of the expansion. Since April 2024, hundreds of thousands of families have been able to access 15 hours of government-funded childcare for their 2-year-olds."
        },
        {
            "text": "And from 12 May, eligible working parents will be able to apply for 15 hours of government-funded childcare for children who are aged between 9-months and 23-months-old. We explain more about exactly who’s eligible below."
        },
        {
            "text": "The rollout of support is part of our plan to help families – freeing thousands of parents from having to choose between having a family and a career."
        },
        {
            "text": "It's worth noting that some providers may ask for charges in addition to the government funded childcare. Visit childcarechoices.gov.uk for further information."
        },
        {
            "heading": 3,
            "text": "When can I apply and how do I get my code? "
        },
        {
            "text": "Applications are now open for eligible working parents whose children will be 2 or older by the 31 August to receive 15 hours childcare, starting from September 2024."
        },
        {
            "text": "From 12 May, eligible working parents whose children will be aged between 9- and 23-months old on 31 August can also apply to receive 15 hours childcare starting from September 2024."
        },
        {
            "text": "When you apply, you’ll receive a code to give to your childcare provider."
        },
        {
            "text": "It’s important to remember that codes need to be renewed every three months, so parents who apply before 1 June will need to make sure they renew their code before the offer starting in September."
        },
        {
            "text": "You can claim your place the term after your child turns the relevant age. This gives local authorities and childcare providers enough time to prepare."
        },
        {
            "text": "There is no limit on the number of codes available, so you don’t have to apply on the day applications open."
        },
        {
            "text": "However, if you’re applying for childcare to start in September 2024, we recommend that you reach out to your preferred provider now to check when they will need your code by, and apply for your code before the start of the school summer holidays."
        },
        {
            "heading": 3,
            "text": "How do I apply?  "
        },
        {
            "text": "You apply online here on gov.uk once you have checked our eligibility criteria."
        },
        {
            "text": "You’ll need to make sure you have the following information to hand before starting the application:"
        },
        {
            "text": "You may find out if you’re eligible straight away, but it can take up to 7 days."
        },
        {
            "text": "Once your application has been approved, you’ll get a code to give to your childcare provider."
        },
        {
            "text": "Eligible parents are also able to access Tax-Free Childcare through the same application system. You can apply for Tax-Free Childcare at any time. However, you don't need to apply for Tax-Free Childcare to be eligible to apply for the 15 hours childcare scheme."
        },
        {
            "heading": 3,
            "text": "Can I apply for government-funded childcare if I’m on parental leave?"
        },
        {
            "text": "Yes, you can."
        },
        {
            "text": "If you’re applying for childcare for an older child, who is not the reason for your parental leave, you can continue to apply in the usual way."
        },
        {
            "text": "For parents applying for free childcare for the child who is the reason for your parental leave, we have extended the period where a parent starting a new job or returning to a job after parental leave, including maternity leave, can apply for government-funded childcare."
        },
        {
            "text": "Previously, there was a 31-day window in which new parents could apply for childcare before returning to work."
        },
        {
            "text": "Now, as long as a parent plans return to work from parental leave or start a new job by the end of September 2024, they can apply for a free childcare code on 12 May at the same time as everyone else, giving them plenty of time to secure a place."
        },
        {
            "text": "Parents on parental leave or starting a new job will need to apply online. They will then receive a letter in the post within 1 to 2 weeks so they can access their childcare entitlement."
        },
        {
            "text": "Parents who plan to start or return to work between 1 October 2024 and 31 January 2025 will be able to apply for a code from 1 September 2024 to use from 1 January 2025."
        },
        {
            "heading": 3,
            "text": "What happens once I receive my code? "
        },
        {
            "text": "Once you receive your code, you’ll need to take it to your childcare provider, along with your National Insurance number and your child’s date of birth."
        },
        {
            "text": "Your childcare provider will process the code to provide your place."
        },
        {
            "text": "Places will be available for September in every area of the country, but a significant minority of settings hold waiting lists of over six months. If you have a preferred nursery for September, you should reach out now to secure a place for your child ahead of receiving your code."
        },
        {
            "text": "Your local authority can provide support for finding a government-funded place in your area."
        },
        {
            "heading": 3,
            "text": "What if I’m already registered for Tax Free Childcare? "
        },
        {
            "text": "If you have an existing Tax-Free Childcare account, you will be asked to reconfirm your eligibility every 3 months to ensure your code remains valid. The new offer of 15 hours government-funded childcare goes live on 12 May, and we know that some parents will not be able to apply for codes at this time due to the timing of their reconfirmation windows."
        },
        {
            "text": "To ensure that every parent can obtain a code and give it to their provider in good time, we will be issuing temporary codes via letter to those whose reconfirmation windows open on or after 9 June. This means that no eligible parent should miss out regardless of when your reconfirmation window opens. You will receive your code in the post from HMRC by 24 May."
        },
        {
            "text": "If your reconfirmation window is currently open, or will open before 12 May, we advise you wait until after 12 May to reconfirm. This will avoid the need for you to be issued a temporary code in the post."
        },
        {
            "text": "For some parents, your reconfirmation window will be open when the offer launches or soon after, in which case you can apply whenever suits you."
        },
        {
            "heading": 3,
            "text": "If I receive a code in a letter from HMRC, does this make my code on my Childcare Account invalid? "
        },
        {
            "text": "No. Both codes will be valid."
        },
        {
            "text": "If you have two codes, one from your letter beginning with 11 and one from the website beginning with 50, please give your provider the code from the website, as this is your permanent digital code for your child."
        },
        {
            "text": "If you only have one code (beginning with 11) then you can use this code to start using your government-funded hours."
        },
        {
            "text": "Please remember that once your reconfirmation window opens, you will still need to reconfirm your eligibility through your Childcare Account and share the digital code you receive  with your provider."
        },
        {
            "heading": 3,
            "text": "Do I need to wait for my reconfirmation window to add another child to my account? "
        },
        {
            "text": "A parent who is already using the childcare service for another child can add a new child to their account at any time."
        },
        {
            "text": "Your reconfirmation cycle for your current Tax-Free Childcare will not affect this."
        },
        {
            "heading": 3,
            "text": "How are you making sure there will be enough childcare places for eligible parents? "
        },
        {
            "text": "Parents that have a preferred place for September should reach out now to their local provider to secure a physical place for their child ahead of time."
        },
        {
            "text": "To make sure there are enough places available, we’re investing over £400 million in 2024-25 to increase the hourly rates paid to local authorities."
        },
        {
            "text": "The Institute for Fiscal Studies has independently reported that the average funding rates for two-year-olds and under 2s paid by government from April 2024 are projected to be substantially higher than the market rate paid by parents last year, and we have committed to further increases to provider rates for the next two years."
        },
        {
            "text": "We have also committed to increasing hourly funding rates over the next two years by an estimated £500 million, to make sure providers can increase places at each phase of the rollout."
        }
    ]
}