{
    "url": "https://ssac.blog.gov.uk/2024/05/03/my-first-impressions-of-ssac-by-benefits-nerd-daphne-hall/",
    "title": "My first impressions of SSAC by 'benefits nerd' Daphne Hall",
    "authors": [
        "Daphne Hall"
    ],
    "categories": [
        "About the Committee",
        "Claimants",
        "Independent advice",
        "Legislation",
        "social security",
        "SSAC Independent Work Programme",
        "Stakeholders"
    ],
    "pub_date": "2024-05-03T08:54:10+01:00",
    "content": [
        {
            "text": "A bit of a benefits nerd, I’ve been in welfare rights pretty much all my working life. I started as an adviser - first at Citizens Advice in London, moving on to Springfield psychiatric hospital and then Bristol City Council - where my bread and butter was helping claimants, who were often very vulnerable, navigate their way through the complex system and ensuring they received their correct entitlement - a process which often involved supporting them to appeal at the First-tier Tribunal (and occasionally beyond)."
        },
        {
            "text": "In 2014 I moved to rightsnet - the go-to website for welfare rights advisers across the UK. At the same time I was very active in the National Association for Welfare Rights Advisers (NAWRA), first as the rep for the south-west and, more recently, as the Vice-Chair. In both these roles, I became very involved in stakeholder work with the Department for Work and Pensions (DWP), using evidence from across the UK to highlight problems within the system that were impacting negatively on claimants and seeking to bring about change."
        },
        {
            "text": "When the job came up at the Social Security Advisory Committee (SSAC), I was immediately drawn to it as it felt like a natural progression from my stakeholder work, although at the same time quite different. As a stakeholder my job is to identify where things are going wrong operationally, to bring this to the DWP’s attention, and to try and seek a resolution. As a SSAC member however, our job is to scrutinise draft legislation and to assess whether it will achieve the government’s policy intent, or whether there may be unintended consequences, and to advise the Secretary of State accordingly. Another part of our role is to produce reports, through our independent work programme, on wider issues with a view to stimulating debate and perhaps introducing new ideas."
        },
        {
            "text": "Although I was very drawn to the job and felt I had the right skillset - at rightsnet we produce daily news items on all things social security including every piece of legislation and case law - I did question whether it would compromise my day job which is, and always has been, very much as an advocate for the claimant. However, I came to the view that my technical skills in respect of understanding legislation, combined with my knowledge and understanding of how that translates into the impact on, and experience of, claimants would be a useful perspective for the Committee so I bit the bullet and applied! Roll on a year and I couldn’t be more delighted that I was accepted, and here I am three months in."
        },
        {
            "text": "Recruited as a welfare rights geek - I think it was called detailed knowledge of social security legislation in the job description! - one of the first things that struck me was the huge breadth of skills and experience on the Committee - much broader than I have encountered previously in my working life. This has been quite a revelation to me and I have really enjoyed listening to, and learning from, my SSAC colleagues. It has opened up my perspective and it has been fascinating working together to combine our views into a consensus."
        },
        {
            "text": "And even though I’m only three months into the role, I’m already beginning to see the difference we can make. Having recently taken on scrutiny of what was a very complex set of regulations, we were able to identify issues which we felt would cause differential treatment among a particular cohort. These were discussed in detail with officials at one of our monthly meetings and changes have been made as a result. For me, there was a huge satisfaction in feeling I’d played a part in improving the final iteration of the regulations."
        },
        {
            "text": "So I think it’s fair to say that my first impressions have more than lived up to my expectations, and I am full of enthusiasm and excitement for the months and years ahead!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}