{
    "url": "https://stratcommand.blog.gov.uk/2024/05/03/rsm-handover/",
    "title": "Regimental Sergeant Major handover",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-03T08:01:24+01:00",
    "content": [
        {
            "text": "The Royal Gibraltar Regiment is pleased to announce the handover of command from Regimental Sergeant Major, Warrant Officer (WO) Class 1 Daniel Henderson to WO1 Karon Fortunato, today, Friday 26 April 2024."
        },
        {
            "text": "WO1 Henderson has served with distinction in his role for the past two years, and the Regiment expresses its gratitude for his dedicated leadership and unwavering commitment during his tenure."
        },
        {
            "text": "Reflecting on his time as the Regimental Sergeant Major, WO1 Daniel Henderson said: \"It has been a great honour to serve as the Regimental Sergeant Major of the Royal Gibraltar Regiment for the past two years."
        },
        {
            "text": "I am immensely proud of the accomplishments we have achieved together as a team and the dedication displayed by every member of the Regiment. I am confident that WO1 Karon Fortunato will continue to lead with distinction and uphold the values and traditions that make the Royal Gibraltar Regiment so exceptional.\""
        },
        {
            "text": "Incoming Regimental Sergeant Major WO1 Karon Fortunato expressed his gratitude for the opportunity to assume command, stating: \"I am deeply humbled to be entrusted with the responsibility of leading the Royal Gibraltar Regiment as the new Regimental Sergeant Major."
        },
        {
            "text": "I look forward to working alongside the talented and dedicated individuals who make up this esteemed Regiment, and I am committed to upholding the legacy of excellence established by my predecessor, WO1 Daniel Henderson.\""
        },
        {
            "text": "The handover ceremony on April 26, 2024, will mark a significant moment in the history of the Royal Gibraltar Regiment as it transitions leadership from one capable leader to another."
        },
        {
            "text": "Members of the Regiment, dignitaries, and honoured guests attended the event to witness this formal passing of the torch."
        },
        {
            "text": "The Royal Gibraltar Regiment extends its heartfelt thanks to WO1 Daniel Henderson for his exceptional service and leadership and welcomes WO1 Karon Fortunato as the new Regimental Sergeant Major with confidence and support."
        }
    ]
}