{
    "url": "https://defrafarming.blog.gov.uk/2024/05/03/stats-you-need-to-know-about-the-sustainable-farming-incentive/",
    "title": "Stats you need to know about the Sustainable Farming Incentive",
    "authors": [
        "Amy Cairns"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-05-03T16:23:09+01:00",
    "content": [
        {
            "text": "Today, we updated the data showing the uptake of actions in the Sustainable Farming Incentive (SFI) and the uptake of options in Countryside Stewardship (CS) and Environmental Stewardship (CS). "
        },
        {
            "text": "As of 1 April 2024, there were over 55,000 agri-environment agreements. There were 34,900 CS agreements, 6,200 ES agreements, 13,900 SFI 2023 agreements and 3,200 SFI 2022 agreements. The full dataset can be found on GOV.UK."
        },
        {
            "text": "In this post, I’ll share an overview of the data for the Sustainable Farming Incentive, which launched in September 2023. I’ll also include findings from research we conducted with around 500 SFI agreement holders, advisers and stakeholders.   "
        },
        {
            "heading": 2,
            "text": "Over 20,000 applications "
        },
        {
            "text": "On 1 April 2024, there were 13,900 live SFI 2023 agreements, held by 13,400 farmers and land managers, and representing over 2 million hectares (ha) of land in England. To date, we have received over 20,000 applications to the SFI. "
        },
        {
            "text": "This is higher than uptake in the first few years of Countryside Stewardship and is on track to achieve higher uptake than the first year of Environmental Stewardship.  These early signs are really encouraging.  We want to support more farmers than ever before to produce food in a sustainable way that improves the environment. "
        },
        {
            "text": "81% of farmers that took part in research rated the existing SFI offer positively. This is an increase from 51% at a similar point in the SFI Pilot. "
        },
        {
            "text": "The SFI contains some management actions and some planning actions. 83% of farms in the SFI have at least one of the planning actions (actions IPM1, MOR1, NUM1 or SAM1). Among the management actions, the most popular are: "
        },
        {
            "text": "There are 55,200,000 metres of hedgerows managed in agreements (action HRW2). However, not all metres of hedgerow in the action include both sides of the hedge. To estimate total hedgerows (both sides equivalent) in the scheme we adjust based on historic data from CS. This gives the estimate that there are currently 34,000km of total hedgerows under SFI management. "
        },
        {
            "heading": 2,
            "text": "Most farmers find it easy to apply to the SFI "
        },
        {
            "text": "75% of research participants found it ‘very easy’ or ‘quite easy’ to apply to the SFI in 2023.  "
        },
        {
            "text": "There are sometimes ‘speed bumps’ in the process which we are finding ways to remove. For example, until recently, applicants needed to provide notice to Natural England where there was an SSSI within a parcel with MOR1 actions. MOR1 no longer requires applicants to gain consent or to notify Natural England. This is part of our commitment to make things as easy as possible for those who want to apply. "
        },
        {
            "heading": 2,
            "text": "Making space for nature "
        },
        {
            "text": "The SFI is helping farmers and land managers to produce food as well as delivering for the environment, by allowing farmers to generate income from making space for nature friendly features on less productive areas and where crops can't be grown. "
        },
        {
            "text": "There are 9 actions in the SFI that allow farmers to generate income in this way. 5 of these actions are sub-field scale actions, where most of the field stays in production. Fallow land can also be entered into these actions, providing better outcomes for the environment and not impacting food production. 150,000ha of land has been entered across these 9 actions, which is around 2% of farmed area in England. More than half of the land in these actions is in less productive land classifications (3b-5).  "
        },
        {
            "text": "The actions are:  "
        },
        {
            "text": "We have been monitoring the number of farms that are applying to these actions, to track whether the flexibility we gave when designing them is being followed in a way that will support the objectives of the scheme. In response to trends that we were seeing, we announced a cap in March 2024, so farmers cannot put more than 25% of their land into any 6 of these actions combined to ensure the SFI is supporting food production alongside delivering for the environment.  "
        },
        {
            "text": "91% of farms in the SFI have put 25% or less of their farm into these SFI actions. 81% of farms in the SFI have put less than 10% of their farm into these actions and around 2% of farms in SFI agreements (around 210 farms) have put 80% or more of their farm into these SFI actions.  "
        },
        {
            "text": "This analysis uses the farm area data from claims to the Basic Payment Scheme. The limitation is that it does not capture land that has been sold or bought since the claim period. The cap that has been applied by the Rural Payments Agency (RPA) uses the latest data mapped to the business so does not have this limitation. Data accurate as of 1 April 2024. Values are rounded to the nearest 10 farms.  "
        },
        {
            "text": "We are also monitoring the amount of the parcel that the action is entered into. The following actions are not expected to be applied to an entire parcel: "
        },
        {
            "text": "Most farmers applying to the SFI are following this. We are aware of a small number of farmers who have applied to put more of their parcel into these actions, especially IGL1. IGL1 is being undertaken on 1,600ha of land.  "
        },
        {
            "heading": 2,
            "text": "Farmers in the SFI are contributing to environmental outcomes "
        },
        {
            "text": "SFI agreements are delivering against our Environment Improvement Plan (EIP) targets, around carbon, soils and species abundance. Within SFI agreements: "
        },
        {
            "text": "The average SFI agreement contains 3 planning actions and 3 land-based actions (this is using the median since the data is skewed, the mean agreement contains 2 planning actions and 4 management actions).  "
        },
        {
            "text": "People feel confident in delivering the actions in their agreement. They are mostly responding well to flexible aims-based actions, but there were some concerns about ‘grey areas’, especially when it comes to compliance and being sure people are getting actions right on the farm.  "
        },
        {
            "text": "Our research suggests that the SFI is creating behaviour change. Many farmers and land managers are doing new actions on land and features, such as hedgerows, not previously managed for the environment. "
        },
        {
            "text": "The SFI is also funding maintenance of existing action in some cases, either picking up from expired agreements in old schemes, or paying farmers and land managers for voluntary actions. This varies between action groups and is around the level we expected. "
        },
        {
            "heading": 2,
            "text": "What's next "
        },
        {
            "text": "This is a post from our Evidence and Analysis team. This is the second in a series of posts showing how evidence and research is used to develop our schemes and grants.  "
        },
        {
            "text": "Our first blog discussed an independent qualitative review to develop our environmental land management schemes."
        }
    ]
}