{
    "url": "https://food.blog.gov.uk/2024/05/03/understanding-the-cell-cultivated-products-industry-and-landscape/",
    "title": "Understanding the cell-cultivated products industry and landscape",
    "authors": [
        "Joe Shields, Senior Policy Adviser, Policy Priorities Unit"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-05-03T08:17:36+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Cell-cultivated products (CCPs) cover a variety of foods that can be made using a production process without slaughter or traditional farming and agricultural practices. Cells isolated from animals or plants, including cells from meat, fat, offal, seafood or eggs, are grown in a controlled environment such as a lab, then harvested to make a final food product. Joe Shields, Senior Policy Adviser, Policy Priorities Unit, explains more in this blog."
        },
        {
            "text": "To ensure they are safe under the proposed conditions of use, the Food Standards Agency and Food Standards Scotland (FSA/FSS) must carry out a rigorous safety assessment to decide whether to authorise CCPs created through 'engineering biology' and allow them to be placed on the market in Great Britain."
        },
        {
            "text": "This is a novel food industry. It is one that has proven itself to be very innovative. At the FSA, we and FSS set out to better understand the products CCP companies are developing and how we can support industry innovation. Earlier this year, we used a survey to learn from the CCP industry and better plan for future regulated products applications. Essentially, we wanted to understand when we might receive regulated product applications for CCPs, to learn about what technology the industry uses to develop these products, to understand what expertise we may need to assess them and to give companies the opportunity to let us know what questions or concerns they may have about the regulatory process."
        },
        {
            "text": "The 23 responses from a range of CCP companies have been immensely helpful in bettering our understanding of these kinds of products and our planning for the future."
        },
        {
            "heading": 2,
            "text": "The products"
        },
        {
            "text": "Most commonly, companies intend to sell their products directly to consumers or a third party as an ingredient to make an end product. Other uses for these products include creating cell lines for cell-cultivated products and creating a cell-culture medium."
        },
        {
            "heading": 2,
            "text": "Cell types and technology"
        },
        {
            "text": "Animal cells are the most common cell type which companies are using to create their products. In total, 20 companies indicated that they are working with animal cells – 5 of which are using a hybrid approach. Other cell types include plant, bacteria, yeast, fungal and algal cells."
        },
        {
            "text": "Using these cell types, companies indicated a wide array of technology and processes to ensure cell self-renewal. This includes:"
        },
        {
            "heading": 2,
            "text": "Hazard data"
        },
        {
            "text": "In 2023, we published a report on the hazards categories of CCPs. The companies told us that they were able to collect information and data in relation to the following hazards:"
        },
        {
            "text": "Other hazard categories included heavy metals, presence and bioactivity of growth factors and differentiation markers."
        },
        {
            "heading": 2,
            "text": "The science behind the products"
        },
        {
            "text": "Respondents provided detailed answers outlining the scientific techniques and ingredients used to develop their products. This information is valuable to the FSA and FSS to better understand the methodology and composition of products and will inform our regulatory approach."
        },
        {
            "heading": 2,
            "text": "Applications and industry knowledge"
        },
        {
            "text": "The survey indicated that the FSA and FSS can expect to receive around 14 dossiers for approval within the next two years."
        },
        {
            "text": "The CCP industry also provided valuable information regarding the barriers and challenges to submitting an application to the FSA and FSS. Common themes include:"
        },
        {
            "text": "In addition to these themes, companies set out where they would like greater clarity within the regulatory approvals process. This includes:"
        },
        {
            "text": "78% of respondents had a good or adequate understanding of the regulated products process"
        },
        {
            "text": "Our recent engagements with industry highlight the FSA and FSS’s commitment to supporting innovation in this novel area while ensuring that food that is safe and what it says it is."
        },
        {
            "text": "We would like to thank all companies that responded to the survey and the Good Food Institute Europe and the Alternative Proteins Association, who each helped us develop and promote the survey."
        },
        {
            "text": "If you would like to learn more about cell-cultivated products, please see our cell-cultivated products guidance page or contact us at RegulatedProductsEngagement@food.gov.uk."
        },
        {
            "heading": 1,
            "text": "Deall diwydiant a thirwedd cynhyrchion a wneir drwy feithrin celloedd"
        },
        {
            "text": "Mae cynhyrchion a wneir drwy feithrin celloedd (cell-cultivated) (CCPs) yn cwmpasu amrywiaeth o fwydydd y gellir eu gwneud trwy ddefnyddio proses gynhyrchu heb ladd neu heb ddilyn arferion ffermio ac amaethyddol traddodiadol. Mae celloedd sydd wedi’u harunigo o anifeiliaid neu blanhigion – gan gynnwys celloedd o gig, braster, offal, bwyd môr neu wyau – yn cael eu tyfu mewn amgylchedd rheoledig fel labordy, ac yna’n cael eu cynaeafu i wneud cynnyrch bwyd terfynol. Yn y blog hwn, mae Joe Shields, Uwch-gynghorydd Polisi yn yr Uned Blaenoriaethau Polisi yn esbonio hyn ymhellach."
        },
        {
            "text": "Er mwyn sicrhau bod CCPs yn ddiogel o dan yr amodau defnyddio arfaethedig, mae’n rhaid i’r Asiantaeth Safonau Bwyd/Safonau Bwyd yr Alban (ASB/FSS) gynnal asesiad diogelwch trwyadl er mwyn penderfynu a ddylid awdurdodi CCPs sydd wedi’u creu gan ddefnyddio ‘bioleg peirianneg’, a hynny fel y gellir eu rhoi ar y farchnad ym Mhrydain Fawr."
        },
        {
            "text": "Mae hwn yn ddiwydiant bwyd newydd, ac yn un sydd wedi profi i fod yn arloesol iawn. Aeth yr ASB ac FSS ati i ddeall yn well y cynhyrchion y mae cwmnïau CCP yn eu datblygu, a sut y gallwn gefnogi arloesedd yn y diwydiant. Yn gynharach eleni, gwnaethom gyhoeddi arolwg i ddysgu gan y diwydiant CCP a chynllunio’n well ar gyfer ceisiadau cynhyrchion rheoleiddiedig yn y dyfodol. Yn y bôn, roeddem am ddeall pryd y gallai ceisiadau am gynhyrchion rheoleiddiedig ar gyfer CCPs ddod i law; dysgu pa dechnoleg y mae’r diwydiant yn ei defnyddio i ddatblygu’r cynhyrchion hyn; deall pa arbenigedd y gallai fod ei angen arnom i’w hasesu; a rhoi cyfle i gwmnïau roi gwybod i ni am unrhyw gwestiynau neu bryderon a allai fod ganddynt am y broses reoleiddio."
        },
        {
            "text": "Mae’r 23 o ymatebion a gafwyd gan amrywiaeth o gwmnïau CCP wedi bod yn hynod ddefnyddiol o ran gwella ein dealltwriaeth o’r mathau hyn o gynhyrchion a’n gwaith cynllunio ar gyfer y dyfodol."
        },
        {
            "heading": 2,
            "text": "Y cynhyrchion"
        },
        {
            "text": "Yn fwyaf cyffredin, mae cwmnïau’n bwriadu gwerthu eu cynhyrchion yn uniongyrchol i ddefnyddwyr neu drydydd parti fel cynhwysyn i wneud cynnyrch terfynol. Mae defnyddiau eraill ar gyfer y cynhyrchion hyn yn cynnwys creu llinellau celloedd ar gyfer cynhyrchion a wneir drwy feithrin celloedd a chreu cyfrwng meithrin-gelloedd."
        },
        {
            "heading": 2,
            "text": "Mathau o gelloedd a thechnoleg"
        },
        {
            "text": "Celloedd anifeiliaid yw’r math mwyaf cyffredin o gelloedd y mae cwmnïau’n eu defnyddio i greu eu cynhyrchion. Nododd cyfanswm o 20 o gwmnïau eu bod yn gweithio gyda chelloedd anifeiliaid – gyda 5 ohonynt yn mabwysiadu dull hybrid. Mae mathau eraill o gelloedd yn cynnwys celloedd planhigion, bacteria, burum, ffwngaidd ac algaidd."
        },
        {
            "text": "Gan ddefnyddio'r mathau hyn o gelloedd, nododd cwmnïau amrywiaeth eang o dechnolegau a phrosesau i sicrhau bod celloedd yn hunan-adnewyddu. Mae hyn yn cynnwys:"
        },
        {
            "heading": 2,
            "text": "Data peryglon"
        },
        {
            "text": "Yn 2023, gwnaethom gyhoeddi adroddiad ar gategorïau peryglon CCPs. Dywedodd y cwmnïau wrthym eu bod yn gallu casglu gwybodaeth a data mewn perthynas â’r peryglon canlynol:"
        },
        {
            "text": "Roedd categorïau eraill yn cynnwys metelau trwm, presenoldeb a bioweithgarwch ffactorau tyfu a marcwyr gwahaniaethu."
        },
        {
            "heading": 2,
            "text": "Y cefndir gwyddonol"
        },
        {
            "text": "Rhoddodd yr ymatebwyr atebion manwl yn amlinellu’r technegau a’r cynhwysion gwyddonol a ddefnyddiwyd i ddatblygu eu cynhyrchion. Mae’r wybodaeth hon yn werthfawr i’r ASB ac FSS i ddeall methodoleg a chyfansoddiad cynhyrchion yn well, a bydd yn llywio ein dull rheoleiddio."
        },
        {
            "heading": 2,
            "text": "Ceisiadau a gwybodaeth gan y diwydiant"
        },
        {
            "text": "Nododd yr arolwg y gall yr ASB ac FSS ddisgwyl derbyn tua 14 o goflenni i’w cymeradwyo o fewn y ddwy flynedd nesaf."
        },
        {
            "text": "Darparodd y diwydiant CCP hefyd wybodaeth werthfawr am y rhwystrau a’r heriau sy’n gysylltiedig â chyflwyno cais i’r ASB ac FSS. Dyma rai themâu cyffredin:"
        },
        {
            "text": "Yn ogystal â’r themâu hyn, mae cwmnïau’n nodi ble yr hoffent gael mwy o eglurder o ran y broses cymeradwyo rheoleiddiol. Mae hyn yn cynnwys:"
        },
        {
            "text": "Roedd gan 78% o’r ymatebwyr ddealltwriaeth dda neu ddigonol o’r broses cynhyrchion rheoleiddiedig."
        },
        {
            "text": "Mae ein gwaith ymgysylltu diweddar â’r diwydiant yn tynnu sylw at ymrwymiad yr ASB ac FSS i gefnogi arloesedd yn y maes newydd hwn, wrth hefyd sicrhau bod bwyd yn ddiogel ac yn cyd-fynd â’r hyn sydd ar y label."
        },
        {
            "text": "Hoffem ddiolch i’r holl gwmnïau a ymatebodd i’r arolwg, ac i Sefydliad Bwyd Da Ewrop a Chymdeithas Proteinau Amgen am eu cymorth yn datblygu a hyrwyddo’r arolwg."
        },
        {
            "text": "Os hoffech ddysgu mwy am gynhyrchion a wneir drwy feithrin celloedd, darllenwch ein canllawiau: Cynhyrchion a wneir drwy feithrin celloedd | Asiantaeth Safonau Bwyd neu anfonwch e-bost i RegulatedProductsEngagement@food.gov.uk."
        }
    ]
}