{
    "url": "https://defraenvironment.blog.gov.uk/2024/05/03/water-how-weve-helped-farmers-reduce-their-usage-and-tackle-pollution/",
    "title": "Water: How we’ve helped farmers reduce their usage and tackle pollution",
    "authors": [
        "Izzie Wells"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2024-05-03T09:15:47+01:00",
    "content": [
        {
            "text": "Challenges such as a growing population and climate change are affecting our water. To ensure a clean and plentiful supply of water for future generations, we must take action."
        },
        {
            "text": "The Farming Investment Fund is one way in which we are doing this."
        },
        {
            "text": "Farming is crucial to food security, and it protects our landscapes, boosts our economy, and supports the livelihoods of thousands of people."
        },
        {
            "text": "But it is also a leading source of pollution into our waterways and can put pressure on water supplies, especially during times of drought. "
        },
        {
            "text": "Water management is a key theme in the fund. Its Water Management grants range from £35,000 to £500,000 for changes aimed at improving farm productivity through more efficient use of water. "
        },
        {
            "text": "Case study: managing water usage and bolstering flood protection in East Sussex  "
        },
        {
            "text": "One business to benefit from the grants was Wicks Farm in East Sussex, which specialises in growing strawberries and blackberries. "
        },
        {
            "text": "They were awarded a grant of almost £250,000 towards the construction and lining of a 32,000m3 water reservoir. "
        },
        {
            "text": "The reservoir collects captured rainwater from the roof of the farm’s 1.25 hectare glasshouse. "
        },
        {
            "text": "Construction of the project began in June 2022 and was finished in December of the same year, with the first plants grown in the glasshouse in early January 2023.  "
        },
        {
            "text": "Through the East Glasshouse project, the farm has significantly reduced its water usage, energy usage and labour cost per kilogram by an estimated 50%. The rainwater collected from the roof of the glasshouse into the reservoir was enough to irrigate their entire 2023 crop. "
        },
        {
            "text": "The extra funding from the Water Management grant meant that the team at Wicks Farm were able to build a larger reservoir than otherwise would have been possible. "
        },
        {
            "text": "This means the farm now has additional water security at a time when rainfall has become increasing erratic due to climate change. "
        },
        {
            "text": "The reservoir is also a crucial local flood defence. It provides extra protection to farms and settlements downstream by controlling the release of high-volume rainfall into the local river network. This will be increasingly important as flooding becomes more frequent and less predictable.    "
        },
        {
            "text": "The project also has wider positive benefits for the environment. It has increased the supply of strawberries outside the usual growing season, which reduces reliance on imports and their associated food miles.     "
        },
        {
            "text": "More grants to come to help manage water and tackle water pollution "
        },
        {
            "text": "The Wicks Farm glasshouse is just one example of the innovative projects funded by the first round of Farming Investment Fund grants. These farms are leading the way in sustainable farming practices to improve our water management.  "
        },
        {
            "text": "As announced by the Prime Minister at the NFU Conference in February, we are set to open a third round of the Water Management grant later this year."
        },
        {
            "text": "Defra has also offered farms grants to improve slurry storage. These help farmers improve the use of organic nutrients and reduce pollution. We will open a third round of these grants for applications later this year. "
        },
        {
            "text": "To keep up to date with our work to improve water, bookmark this page to see all our water-related posts in one place."
        },
        {
            "text": "You can also subscribe to this blog to receive an email notification when we publish a new post. "
        },
        {
            "text": "If you are a farmer, you might be interested in the Farming blog too. "
        }
    ]
}