{
    "url": "https://space.blog.gov.uk/2024/05/03/what-boeing-starliner-means-for-the-future-of-space/",
    "title": "What Boeing Starliner means for the future of space",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "International Space Station"
    ],
    "pub_date": "2024-05-03T12:05:11+01:00",
    "content": [
        {
            "text": "The Boeing Starliner capsule is due to launch astronauts for the first time at 3.30am (BST) on Tuesday 7 May, from Cape Canaveral Space Force Station in Florida. "
        },
        {
            "text": "Ahead of the launch, UK Space Agency Head of Space Exploration, Libby Jackson, shares her thoughts on why it’s so important and what it means for the future of the space sector."
        },
        {
            "heading": 3,
            "text": "Why is the first crewed test of Boeing’s Starliner so important?  "
        },
        {
            "text": "This is a huge step towards expanding the capability for sending astronauts to orbit from US soil, with Boeing’s Starliner soon to be complementing SpaceX’s Dragon in providing commercially operated flights to and from the International Space Station (ISS). "
        },
        {
            "text": "Having two different ways of getting into space brings both resilience and competition, which are vital components for the continued operation of the ISS and the future commercial space stations that are in development. We expect to see ESA Astronauts on board Starliner soon, and this could include astronauts from the UK.   "
        },
        {
            "text": "The ISS provides a unique environment for cutting-edge scientific research that benefits us all back on Earth. So it's really important that we have options for getting there.  "
        },
        {
            "heading": 3,
            "text": "We already have SpaceX taking astronauts to the ISS from the US, why do we need an alternative?  "
        },
        {
            "text": "SpaceX's Dragon spacecraft has been flying to and from the space station for some years now. But ideally, we want more than once company able to provide this service. There’s a concept known as ‘dissimilar redundancy’ which is really important in all aspects of spacecraft design. "
        },
        {
            "text": "Essentially, if there were to be an issue with one spacecraft it would usually be grounded while we figure out what's gone wrong. Having another, spacecraft with a different design offers an alternative route into space, maintaining our ability to get astronauts to and from the ISS safely.   "
        },
        {
            "heading": 3,
            "text": "Will having two companies providing flights reduce the cost of space travel?  "
        },
        {
            "text": "SpaceX deserves huge credit for bringing the cost of launch down dramatically over the last decade but, as with any other market, competition will help bring prices down.  "
        },
        {
            "text": "For NASA, the European Space Agency and the UK Space Agency, it’s very important to get the most value from the taxpayer money we spend. This is why NASA made sure that there were two companies developing two different spacecraft capable of trips to the ISS. "
        },
        {
            "heading": 3,
            "text": "Can you tell us about the flight?  "
        },
        {
            "text": "Starliner will launch from Florida on a United Launch Alliance Atlas V rocket. Eventually the spacecraft will be able to transport four astronauts, but for this test flight there will be two people on board, NASA’s Butch Wilmore and Suni Williams.  "
        },
        {
            "text": "It will launch, get up into Earth orbit, then carry out a range of checks to its systems, before docking with the ISS. Butch and Suni will be on board the space station for about a week before returning to Earth. "
        },
        {
            "heading": 3,
            "text": "What happens after the test flight? "
        },
        {
            "text": "This is a test but if it all goes well, we can look forward to seeing Boeing Starliner join the line-up with SpaceX’s Dragon spacecraft, regularly taking astronaut crews to and from the International Space Station.  "
        },
        {
            "heading": 3,
            "text": "Will we see UK astronauts travelling on Starliner? "
        },
        {
            "text": "They could do. Dr Rosemary Coogan just graduated from ESA astronaut basic training in April and will be flying to the International Space Station in the future. "
        },
        {
            "heading": 3,
            "text": "Why has the first crewed flight of Boeing’s Starliner been delayed?  "
        },
        {
            "text": "Safety is paramount in human spaceflight, so it has taken some time to work through the results of the uncrewed tests and fix the issues identified.  "
        },
        {
            "text": "Many people have been working hard on this over recent years, to overcome the challenges. It is brilliant that this has now all come together, and I'm looking forward to watching the crewed test flight.  "
        },
        {
            "heading": 3,
            "text": "What does having another crew-carrying spacecraft mean for the wider space sector?  "
        },
        {
            "text": "For almost 24 years, the ISS has provided humanity with a permanent outpost in low Earth orbit. What’s exciting now is the transition to a more commercial future, with plans for new commercial space stations and innovative services to allow for more people and more science to travel into space. This all requires reliable access to space.  "
        },
        {
            "text": "This is what's enabling the work between the UK Space Agency and the US company Axiom Space, to explore a commercially funded UK mission. It's about bringing in new players and new companies, generating valuable investment opportunities, and supporting the development of new technologies. This is a future where more products will be made in space for use on Earth, with the potential to revolutionise areas like drug development and advanced materials.  "
        },
        {
            "text": "The Boeing Starliner test flight is one of the many small steps towards this future."
        }
    ]
}