{
    "url": "https://lifeathmrc.blog.gov.uk/2022/02/14/how-could-you-make-a-difference-to-10-2-million-people/",
    "title": "How could you make a difference to 10.2 million people?",
    "authors": [
        "Matthew Brebner"
    ],
    "categories": [
        "General",
        "Guest blog",
        "Recruitment"
    ],
    "pub_date": "2022-02-14T13:12:42+00:00",
    "content": [
        {
            "text": "This week Matthew Brebner tells us what it’s like answering calls and customers’ questions during the Self Assessment peak. It’s HMRC’s largest annual campaign, bringing in funds for vital public services, including the NHS. This year, 10.2 million customers completed a tax return by 31 January, with 96% submitting their return online."
        },
        {
            "text": "Tell us about your role"
        },
        {
            "text": "I’m a customer services adviser in Personal Tax Operations (PT Ops), braving the telephones. The team helps customers get their tax right and our helplines cover areas such as Pay As You Earn (PAYE), National Insurance as well as Self Assessment."
        },
        {
            "text": "I’ve been with HMRC for just over 3 years now, and each year I’ve worked on the Self Assessment peak."
        },
        {
            "text": "How do you help customers during this time?"
        },
        {
            "text": "In a variety of ways, whether it’s just a helping hand getting into their account or working out their mileage allowance relief claim – it all helps them to pay the right tax. Given how much a tax return can cover, they can ask for just about anything. Once someone asked if they could claim for increased working from home expenses as they had used a lot more water than usual, or it can be as simple as checking if what they’ve entered in a particular box is correct. It’s about helping them avoid honest mistakes."
        },
        {
            "text": "What are the challenges of working the Self Assessment peak – and the rewards?"
        },
        {
            "text": "The nature of the queries during the Self Assessment peak aren’t necessarily difficult in themselves, but the challenge is simply the volume of calls. More than 12 million taxpayers in the UK complete Self Assessment, so you need to be prepared. Whatever their questions, being able to help customers provides great professional satisfaction. And after the peak comes another reward – a little bit of peace and quiet! That is until the annual coding run comes around and the PAYE telephone line gets busy."
        },
        {
            "text": "How do colleagues working on Self Assessment support each other?"
        },
        {
            "text": "Support is on hand in the same way it would be at any time of the year, but it’s needed more often. For every simple call we get, there is a call where not a single soul could answer it straight away – colleagues and support channels such as Virtual Adviser Support are always on hand to help. However, team spirit is always high, as there’s a strong understanding that as long as everyone puts in the effort required then everyone reaps the benefit, not only in terms of a work performance perspective but also in a personal achievement perspective – together we make a big difference."
        },
        {
            "text": "Our customers think we’re great! "
        },
        {
            "text": "Here’s what some of our customers had to say about our advisors:"
        },
        {
            "text": "‘You’re a star - thank you so much for helping with my Income from Property & Mortgage Interest enquiry, I’ve been trying to find the answer for months online. You’ve been an absolute God send’ - Customer A speaking about our telephony service."
        },
        {
            "text": "‘Really helpful adviser who recognised exactly what the problem around how to enter work expenses and talked me through it. Was all sorted within minutes.’ – Customer B feedback on our Net Easy exit survey"
        }
    ]
}