{
    "url": "https://civilservicelocal.blog.gov.uk/2022/02/14/overcoming-imposter-syndrome/",
    "title": "Overcoming Imposter Syndrome",
    "authors": [
        "Ian Barton"
    ],
    "categories": [
        "East, South East & London"
    ],
    "pub_date": "2022-02-14T09:46:22+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What is imposter syndrome?"
        },
        {
            "text": "Imposter syndrome is the name given to the debilitating feelings of self-doubt that many people experience at work, which causes them to feel like they’re not good enough to carry out their role, or that they’re not worthy of a promotion."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "The East, South East and London Cross-Government Social Mobility Network, working with Civil Service Local, are hosting a session to raise awareness around imposter syndrome and how this impacts those from lower socio-economic backgrounds."
        },
        {
            "text": "This event takes place on 4 March 2022 and is aimed at civil servants from all departments and at any grade within the East, South East and London region."
        },
        {
            "text": "During this session, Leah Clarkson and Hannah O’Sullivan will start by talking about what imposter syndrome is, tips for overcoming it, and the role organisations play in this.  Andy Mills, Director and Social Mobility champion at the Ministry of Justice will then share his personal journey to SCS, particularly about ‘Imposter Syndrome’, his own experiences, and how he manages conversations at senior level. There will also be an opportunity for questions at the end of the session."
        },
        {
            "heading": 3,
            "text": " When and where"
        },
        {
            "text": "Please note that you must be able to access Microsoft Teams via the app or browser to join this online event. If you are unable to access Microsoft Teams on your work device, you may wish to join using a personal device. All links will be sent at least 24 hours prior to the event."
        },
        {
            "text": "If having booked a ticket you are no longer able to attend, please ensure you cancel your ticket promptly, so another colleague has the opportunity to join the session."
        },
        {
            "text": "This session will be recorded.  If you are unable to attend and would like a recording of the event, then please email Parvin.minhas2@homeoffice.gov.uk"
        }
    ]
}