{
    "url": "https://dwpdigital.blog.gov.uk/2022/02/14/recruitment-opportunities-increase-as-hub-locations-expand-to-birmingham/",
    "title": "Recruitment opportunities increase as hub locations expand to Birmingham",
    "authors": [
        "Mohammed Din, Deputy Director, DWP Digital"
    ],
    "categories": [
        "agile teams",
        "Collaboration",
        "Digital Workplace"
    ],
    "pub_date": "2022-02-14T14:59:21+00:00",
    "content": [
        {
            "text": "DWP Digital is an exciting place to work with an extensive transformational agenda to digitise complex government services as part of the next spending review."
        },
        {
            "text": "We’re located geographically across 7 UK corporate hubs. Our mission, to improve the lives of the most vulnerable, means as a department we are always looking to expand and offer opportunities to highly skilled professionals with the right skills and provide training opportunities for apprenticeships."
        },
        {
            "heading": 2,
            "text": "A new location"
        },
        {
            "text": "When it was announced DWP was going to expand its hub network from the existing 7 hubs to 10 hubs we were excited to see which locations would be selected. Each of the 3 areas being considered (Cardiff, Glasgow and Birmingham) offer an excellent pipeline of digital talent that would be invaluable to the department’s digital transformation agenda. However, after gathering insight, DWP Digital agreed its expansion into Birmingham (3 Arena Central). While it was a difficult choice to pick one location, it was felt that Birmingham, with its central location and surrounding area, was an ideal place to attract the digital professionals required to join us and help us to deliver our goals."
        },
        {
            "text": "Sitting at the heart of the highspeed rail network, HS2 will connect Birmingham city centre to London and the rest of the network from the new Curzon street station which will be one of the most environmentally friendly stations in the world. The choice also aligned with DWP’s strategy to modernise our estate and consolidate Birmingham-based colleagues to one, modern, shared government hub in a central city location."
        },
        {
            "text": "For the last 3 months we have been working with a wide range of stakeholders to expand DWP Digital’s presence in Birmingham and exploit the talent pool within the Midlands locality.  We started recruitment into our new Birmingham hub in late 2021 and with lots of interest in the new site, a site visit was scheduled, so that we could see the new workplace and get a better feel for the location and amenities."
        },
        {
            "heading": 2,
            "text": "Ideally situated"
        },
        {
            "text": "The Hub has a very modern look and feel and is surrounded by other large organisations, a 10-minute walk from Birmingham New Street railway station. The space has collaboration thinking at its heart with a mixture of desks and breakout areas, plus booths for work, meetings and discussion."
        },
        {
            "text": "There is a modern café and seating area for breaks, lunch or just a change of scenery. The whole area is well lit with lots of greenery for a calming atmosphere to get the best from the working day. Our plan is to make the office a ‘second home’ for teams so they can function as a happy, motivated unit, in a perfect blend of comfort, inspiration and energy. The large open plan floor will encourage teams to collaborate, interact and cross function. The idea is to bring us all on to one floor while providing small nooks to share ideas and interact with each other in effective huddles."
        },
        {
            "heading": 2,
            "text": "Designed for collaboration"
        },
        {
            "text": "Our current recruitment drive is to build a number of flexible squads to support our programme of work for our health transformation agenda and to support our Universal Credit delivery. We have open and up-coming vacancies for delivery managers, product managers, technical leads, business analysts, user researchers, interaction designers, content designers, developers, DevOps engineers, service designers, QA testers and performance analysts."
        },
        {
            "text": "This is an exciting area where complex problems can only be solved with collaborative, multi-disciplinary working and a user centred design approach. We are looking for highly flexible professionals who are looking for their next career move to continue the government digital agenda and make a sustainable contribution to delivering digital services to those who most need it in our society."
        },
        {
            "text": "Watch our Birmingham location video to see more."
        }
    ]
}