{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/02/14/regulators-experience-of-clinical-trials-during-the-covid-19-pandemic-part-2-what-we-have-learned/",
    "title": "Regulator’s experience of clinical trials during the Covid-19 pandemic (Part 2) – what we have learned",
    "authors": [
        "Gail Francis",
        "Martin O'Kane",
        "Kirsty Wydenbach",
        "Lisa Campbell"
    ],
    "categories": [
        "Good clinical practice",
        "Inside the Inspectorate"
    ],
    "pub_date": "2022-02-14T18:14:42+00:00",
    "content": [
        {
            "text": "In part one of this series, we explored as an introduction how we initially responded to the Covid-19 pandemic to move faster in the set-up and approval of clinical trials. Now we look at the unprecedented challenges we faced in each area and the lessons we have learned during the last two years."
        },
        {
            "text": "MHRA Clinical Trial Unit Challenges"
        },
        {
            "text": "The CTU COVID-19 assessors developed new ways of working and through prioritisation activities and close engagement with researchers, assessed and approved trials in shortened time frames whilst maintaining high levels of scientific and regulatory integrity at all times. This was achieved by:"
        },
        {
            "text": "Responding to the pandemic was resource intensive. Assessors worked very long hours including weekends which highlighted the importance of teamwork, resilience, and working collaboratively with applicants to ensure safe trials were able to begin as soon as possible. Effective communication could never have been more important and when done well was the best platform to manage expectations internally and externally. Internally, enhanced cross agency working was adopted to ensure harmonised decisions (alignment) were delivered, relationships were developed and built upon. Externally, enhanced communications with academia and industry were supported by different IT platforms which occasionally presented their own technical challenges."
        },
        {
            "text": "Working in a fast-changing scientific environment presented its challenges too when it came to approving clinical trials for the treatment or prevention of COVID-19. The CTU always wanted to be one step ahead of the pandemic to protect public health and predicting the behaviour of a new virus and how it might affect every member of the public presented many unknowns. Our close interactions with the Commission on Human Medicines expert working groups to obtain independent expert advice was invaluable in keeping abreast of the latest scientific thinking around the virus. Assessors also had to manage emerging safety data with the additional challenges of all vaccines and therapeutics, including the clinical trials, being more widely discussed in the public domain. Media and other external enquiries significantly increased and had to be responded to, balancing commercial sensitivities whilst providing reassurance of acceptable safety profiles. We actively listened to the public and patients and ensured transparency was a top priority."
        },
        {
            "text": "Some trials were halted, some needed to change processes and many required amendments, which was time consuming both for sponsors and regulators. We aimed to be as pragmatic and proportionate as possible on the need to submit substantial amendments and in the UK, in general if a trial was halted due to the pandemic and there were no associated safety issues then this did not require reporting to us."
        },
        {
            "text": " "
        },
        {
            "text": "Good Clinical Practice (GCP) Challenges "
        },
        {
            "text": "Of course, there were some quite specific Good Clinical Practice challenges. Patients couldn’t come in for visits, research staff were deployed to front line activities, so time and resource was really a challenge. To perform remote monitoring and remote source document verification relies on access to source documents.  Although in some cases direct remote access to medical records was possible, and source documents could be shared via a screen, this of course raised patient confidentiality questions which we mitigated. Some documents were scanned and uploaded for monitors to view, but this placed an extra burden on already stretched investigator sites."
        },
        {
            "text": "Protocol-required visits could be done via phone or a video call, so participants could be followed, but there were limits on what could be achieved if assessments needed the participant to physically attend for scans or blood draws. Electronic consent was used for some trials; whether that was fully electronic with remote electronic signatures, or a hybrid approach where the information was electronic, but signatures may be captured in wet ink and posted back to the site. Of course, many of the COVID-19 therapeutic trials concerned seriously ill patients, where emergency consent measures were put in place, which was also challenging in relation to use of documentation, signatures and infection control."
        },
        {
            "text": "As patients were not coming in for visits as planned by the protocol, ongoing trials had to use different methods to get IMP to participants so they could continue with treatment. In many cases this meant sending the IMP directly to patients’ homes. Confidentiality had to be considered, as names and addresses needed to be shared with courier companies, checks needed to be put in place to ensure that the IMP reaches the right people, and of course if there were any temperature monitoring requirements."
        },
        {
            "text": "Phase I trials in healthy volunteers also required review for potential risks. Not just volunteers who were required to travel, staff who needed to attend the clinics, but also the type of IMP under investigation. In the UK we required all phase I units to confirm that they had undertaken a risk assessment before proceeding with any trials. Considerations included the capacity of the nearest ICU for higher risk first in human trials, and the nature of the IMP; for example, if it has immuno-suppressant action that could put the volunteers at increased risk of COVID19 infection."
        },
        {
            "text": "Protocol Deviations "
        },
        {
            "text": "As the pandemic unfolded it became apparent that there would be a significant effect on data that could be collected from ongoing trials. With patient visits limited, the data collected was less and depending on the criticality of that data, this could mean that the trial objectives may not be met."
        },
        {
            "text": "We also expected to see an increase in the number of protocol deviations and advised that a risk-based approach is taken to the documentation of protocol deviations. Deviations that impact on participant safety and the reliability of results should be identified, documented and considered when the data are analysed."
        },
        {
            "text": "Therefore, we advised that minor protocol deviations should be identified, and these could be documented at a trial level, rather than an individual level. For example, trial-level file notes can be used to document participant visits that were performed remotely, and IMP that was delivered directly to homes where this was not originally intended."
        },
        {
            "text": "Following questions arising on the quality of the data after carrying out remote monitoring, we have advised sponsors who have suggested to do re-monitoring once it is safe to be back on site that it needs to be done on a risk-based approach. Therefore, if there are concerns about data quality, or there are data that are critical to the reliability of the results of the trial, such that you would only have confidence in the data if on-site monitoring took place, sponsors may want to consider re-monitoring.  But we certainly wouldn’t see the need for re-monitoring in most cases."
        },
        {
            "text": " "
        },
        {
            "text": "Risk Adapted Approach"
        },
        {
            "text": "During the pandemic sponsors started to use a more flexible and proportionate approach to trial conduct, largely out of necessity, but this flexibility is not new and risk adaptions for clinical trials have been part of the MHRA regulatory landscape since 2011."
        },
        {
            "text": "In 2011, the MHRA, developed guidance on a risk-adapted approach for clinical trials. This included a notification scheme for lower risk trials (such as those that are considered no higher risk than normal standard of care) and opportunities to risk adapt certain areas of the trial in relation to GCP.  Adaptions such as safety reporting, management of the drug, documentation and monitoring of these lower risk trials could therefore be considered, which allowed researchers to use resources effectively and adopt a proportionate approach to the management of the trial."
        },
        {
            "text": "In 2012 the GCP Inspectorate published the GCP Guide which expanded on this theme, and the practicalities of how to do this appear as a thread throughout the book.  We also published guidance to support the approach."
        },
        {
            "text": "In 2013 we also published examples of risk assessments; these are real-life assessments and adaptions that were reviewed by MHRA GCP Inspectors and Clinical Trial Unit medical assessors, to provide examples of how to manage these types of trials in a proportionate way. This was followed up in  2014 with further guidance and examples of remote monitoring."
        },
        {
            "text": "In 2020 this risk-adapted approach also featured in our guidance around COVID-19 flexibilities, and organisations have been asking if we can keep those flexibilities – in reality they are already there, but sponsors of clinical trials have been reluctant to use them in the past. There is now more widespread support of these approaches which is reflected in OECD guidance, the EU Clinical Trials Regulation and also ICH E6 guidance."
        },
        {
            "text": "GCP Inspections"
        },
        {
            "text": "The way we inspect has also adapted during the pandemic, as we have not been able to be onsite. In fact, before the pandemic, we had started to use office-based inspections as part of our inspection processes, for example we would often have the first day as remote, to ensure we had access to the systems we needed. We were also running a pilot of a focussed pharmacovigilance inspection that was entirely office based."
        },
        {
            "text": "We rapidly changed and adapted our inspection model to conduct remote inspections, we re-prioritised inspections based on COVID19 vaccine and treatments – and the only onsite inspections were those that were considered critical for public health and could not be done remotely. We used video conferencing, remote access to systems and used file sharing to request and review documents, which proved to be successful."
        },
        {
            "text": "When we conduct onsite inspections, we are usually there for a set number of consecutive days, but with remote working this could be different days over a number of weeks, with gaps in-between to allow for other commitments and provision of inspection requests. With different time zones, childcare commitments, and home working we had to be flexible with demands on peoples’ time."
        },
        {
            "text": "Remote inspections allowed us to maintain our oversight, and to observe the requirements for staying at home, not travelling and maintaining a social distance. Remote inspections entail lots of document review, with less interaction with those we were inspecting and of course a limited review of facilities as we could not physically be there."
        },
        {
            "text": "An aspect we all enjoy on inspection are the informal questions and chat, and the chance to offer general support and pass on best practices. This is usually done over a coffee or lunch and is missing in remote inspections."
        },
        {
            "text": "We have identified critical findings on remote inspections, so, although they have their limitations, remote inspections have proven very effective. They work well for focussed inspections, for example follow-up to specific issues or a CAPA review, or those that are very data orientated."
        },
        {
            "text": "We’ve had some technical difficulties along the way, with poor connections, video freezing, slow response of some systems. We’ve also been challenged by the number of systems needed to inspect remotely – so for one investigator site we had to access 7 different systems at the same time."
        },
        {
            "text": "What has surprised us is that it takes a lot longer to conduct a remote inspection, we may not have to spend so much time travelling, but the time spent accessing, requesting, reviewing and cross-checking documents, asking questions, is much longer than we anticipated."
        },
        {
            "text": "Don’t miss the next post, sign up to be notified by email when a new post comes out."
        }
    ]
}