{
    "url": "https://deframedia.blog.gov.uk/2022/02/14/telegraph-coverage-on-water-quality/",
    "title": "Telegraph coverage on water quality",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-02-14T17:08:36+00:00",
    "content": [
        {
            "text": "There has been coverage in today’s Telegraph about raw sewage discharges into rivers to mark the launch of its Clean Rivers Campaign, which calls for action to tackle pollution from water companies, industrial agriculture and urban waste."
        },
        {
            "text": "The Telegraph has analysed data on storm overflow spills to suggest these may have occurred when there was no heavy rain. It also references a major investigation into possible unauthorised spills at over 2,000 sewage treatment works launched by the Environment Agency in November."
        },
        {
            "text": "The Environment Agency is separately analysing the 2020 Event Duration Monitoring data and has identified 1,300 overflows for further assessment. It is currently undertaking further analysis on these, which will be used to find out why permits might be being breached to inform any necessary enforcement action."
        },
        {
            "text": "We have been consistently clear that the current failure of water companies to adequately reduce sewage discharges is unacceptable. We have significantly increased the transparency and monitoring of sewage spills over the last five years, meaning that we now have a much clearer picture of the data compared to before."
        },
        {
            "text": "Under our Environment Act, which puts in place more protections against water pollution than ever before, water companies have agreed to further increase transparency around when and how storm overflows are used so that we can better tackle the problem."
        },
        {
            "text": "More than 12,000 of England’s 15,000 storm overflows now have Event Duration Monitors to capture data on the frequency and duration of storm overflow discharges, with all the data published online so the public can see what is happening in their area, and the remaining 3,000 will have them by end of next year."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}