{
    "url": "https://defrafarming.blog.gov.uk/2022/02/14/the-future-farming-resilience-fund-an-opportunity-for-advice-providers-and-a-call-for-farmer-feedback/",
    "title": "The Future Farming Resilience Fund: an opportunity for advice providers and a call for farmer feedback",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2022-02-14T05:48:00+00:00",
    "content": [
        {
            "text": "One of the ways we’re supporting farmers is through the Future Farming Resilience Fund. Through the fund, independent advisers can provide free business advice to farmers in England. "
        },
        {
            "text": "In this post, I’ll share 2 new pieces of information about the fund. The first is a new opportunity for advice providers.  "
        },
        {
            "text": "The second is a request for farmers to give us feedback on the advice they’ve received through the fund.  "
        },
        {
            "heading": 3,
            "text": "A new opportunity for advice providers "
        },
        {
            "text": "We’re inviting advice providers to apply for a share of funding in the final £32 million phase.  "
        },
        {
            "text": "In return, we’re asking providers to deliver resilience support to farmers and land managers from September 2022 until March 2025. "
        },
        {
            "text": "Resilience support should help farmers and land managers to learn more about: "
        },
        {
            "text": "As with previous phases, the support will be offered free of charge by organisations known and trusted in the farming community. It could be delivered through workshops supported by experts, or through direct, one-to-one advice.  "
        },
        {
            "text": "The system is open for applications and the deadline for submitting applications is 25 March 2022."
        },
        {
            "text": "Apply for a Future Farming Resilience Fund grant."
        },
        {
            "text": "The successful providers will be announced in July and support will be available to farmers and land managers from September 2022. We’ll update you on the blog once the providers have been selected. "
        },
        {
            "heading": 3,
            "text": "An opportunity to give us feedback  "
        },
        {
            "text": "As you know, farmers can apply for free support in the current phase of the fund. It is due to end in September.  "
        },
        {
            "text": "If you’ve received resilience support during the interim phase (from September 2021 onwards) we’d love to hear from you. We’d like to know how you found the experience. What advice did you get? What was useful? What would you change? We want to know. "
        },
        {
            "text": "Sharing your feedback with us will improve how we develop support across the programme.  "
        },
        {
            "text": "Join the online community to speak to other farmers who have received resilience support, and let the evaluator know your thoughts about the support. "
        },
        {
            "text": "Sign up and share your thoughts."
        }
    ]
}