{
    "url": "https://legalaid.blog.gov.uk/2022/09/22/be-a-voice-for-change-on-our-accessibility-panel/",
    "title": "Be a voice for change on our accessibility panel",
    "authors": [
        "markworkman"
    ],
    "categories": [
        "legal aid agency"
    ],
    "pub_date": "2022-09-22T11:44:02+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What sort of people do we want?"
        },
        {
            "text": "We recognise that there are individuals who may need to:"
        },
        {
            "text": "Achieving good outcomes in these areas is more likely if we can recruit a panel of volunteers with a range of different accessibility needs. The idea is to put ourselves on the same page as the user so we can help as many people as possible."
        },
        {
            "text": "It’s all about giving people the right tools to do their jobs. So, if someone has trouble using assistive technologies with our products, we want to know."
        },
        {
            "text": "It would be great to have people working in all aspects of legal aid. But you do not necessarily need to work in legal aid to take part. We welcome people from all areas of the law."
        },
        {
            "heading": 2,
            "text": "Why is this important?"
        },
        {
            "text": "There is increasing awareness of the wide spectrum of obstacles that life throws up for people and the importance of being responsive as a society. At least 1 in 5 people in the UK have a long-term illness, impairment or disability."
        },
        {
            "text": "Some people may have issues with vision or motor functions. There may be cognitive or learning issues. Others may have deafness or impaired hearing. And these problems may be life-long, or they may have arrived later in life. Others may face short-term difficulties. For example, someone who has broken an arm or temporary loss of vision."
        },
        {
            "heading": 2,
            "text": "How will the panel work?"
        },
        {
            "text": "When we start a research project, we select a sample of appropriate people from our panel and contact them explaining what the project is about and what their involvement would look like. This could range from online surveys to interviews or group work, in person or by phone or video call. There is no commitment – people can always say no."
        },
        {
            "heading": 2,
            "text": "Why are we doing this now?"
        },
        {
            "text": "Our digital systems are constantly evolving. We’re working hard on developing services that are reliable, intuitive and based on user needs. As this happens, we need to make sure that everyone working with us can do so as effectively as possible."
        },
        {
            "text": "We will be constantly designing, testing and then trying new approaches based on user feedback. This isn’t just altruistic, it’s also sound business. If we want people to use our systems, then they have to be universally accessible."
        },
        {
            "text": "We will also be working to ensure that addressing accessibility needs is integrated into the planning and design of our systems as we move forwards. This is in line with our:"
        },
        {
            "heading": 2,
            "text": "How do I take part?"
        },
        {
            "text": "You can volunteer by using this online form:"
        },
        {
            "text": "Accessibility research panel registration"
        }
    ]
}