{
    "url": "https://digitaltrade.blog.gov.uk/2022/09/22/cardiff-community-culture-and-creating-opportunities/",
    "title": "Cardiff: community, culture and creating opportunities",
    "authors": [
        "Andy Davies, Lead Interaction Designer",
        "Kai Hellstrom, Senior Product Manager",
        "Michał Poręba, Chief Data Architect"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-09-22T11:54:49+01:00",
    "content": [
        {
            "text": "Cardiff is one of the new regional hub offices we have been recruiting to as part of the cross-government Places for Growth programme. This is in addition to our existing locations across the UK and the world. DIT’s Digital, Data and Technology (DDaT) team are excited to be working closer to the communities we build services for and products to serve. Read on to find out all there is to love about living and working in and around Cardiff!"
        },
        {
            "heading": 2,
            "text": "Community in and around Cardiff"
        },
        {
            "text": "Cardiff offers all the benefits and convenience of a modern capital city. Yet, it’s only an hour away from some of the UK’s finest beaches in the Gower, or the picturesque rolling mountains of the Brecon Beacons – some of the finest landscapes the UK has to offer."
        },
        {
            "text": "The city has undergone significant development over the last decade, with heavy investment in the centre transforming the city’s skyline. This development has created growth, jobs and significant opportunities for the surrounding communities. Much of this development has come through government investment and the creation of government jobs in the area. Furthermore, Cardiff houses the Senedd, the home of the Welsh Government. The Welsh Parliament is located at the heart of Cardiff Bay, another area which has undergone significant development. It’s a great place to go to relax, enjoy great food, beautiful views, and maybe even learn a thing or two about Roald Dahl or Doctor Who!"
        },
        {
            "text": "Cardiff has a vibrant city culture. As the country famous for Tom Jones, Shirley Bassey and many others, Wales has long punched well above its weight in the arts. This is reflected in the local music scene. On the one hand, there are world-renowned artists and shows drawn to the Principality Stadium and the Wales Millennium Centre. On the other, there are an array of independent venues hosting up-and-coming artists, established indie artists, and traditional music within the city. Cardiff truly has something for all tastes."
        },
        {
            "text": "Cardiff is an easy place to love. It is a small, intimate city, wrapped up in the status and the amenities of a capital city. It is an area steeped in a rich cultural and social heritage, populated by a diverse, friendly, welcoming community."
        },
        {
            "heading": 2,
            "text": "Life at Tŷ William Morgan"
        },
        {
            "text": "Tŷ William Morgan is the name of the building we occupy and share with other departments. Close to Cardiff Central train station, right next to the Principality Stadium and a minute’s walk from an array of pubs and restaurants, the Cardiff office is an easy commute and even better for socialising after work."
        },
        {
            "text": "One of the big advantages of working at Tŷ William Morgan is that the building is shared with other government departments, such as HMRC and the Cabinet Office. This gives the opportunity to build cross-departmental relationships. There is also a balcony on the eleventh floor which is shared between all staff in the building, so you never know who you might end up talking to."
        },
        {
            "text": "Our home in the building is a 10 -floor lift ride up, which gives a lovely view of the city centre and has lots of spaces for collaboration, meeting rooms, quiet spaces or little nooks to escape for online meetings. The desk space for DIT is inhabited by staff from many other directorates, including colleagues from DIT Wales, UK Exports and Trade, Business Intelligence and more. With remote working and team members being in different locations, it gives the opportunity to make the Cardiff office feel like a team away from our day-to-day product teams. In some cases, this means that we see the products and services we are working on in DDaT being used in real time by DIT colleagues. It also helps give insight into the wider picture of how DIT operates and enables us to see the good work that’s being done across different parts of the department."
        },
        {
            "text": "With the Cardiff office being fairly new, and staff numbers based in Cardiff steadily growing, there is an appetite for creating a culture in the office. This has kicked off recently with the Cardiff Working Group. The group consists of members from different areas of DIT to look at ways of working, collaborating with other departments and raising DIT’s profile in the area. Most importantly, it has also started plans for the Cardiff office Christmas party!"
        },
        {
            "heading": 2,
            "text": "Creating opportunities "
        },
        {
            "text": "With the UK Government’s commitment to address regional imbalance over the last few years, there are more and more local opportunities in many places of the UK. This includes Cardiff and South Wales. It used to be the case that to make a career in government, or big business, you would have to move to London. Not anymore. Now, there is a real commitment to move Civil Service jobs out of London at all levels. This includes goals for half of all senior civil servants to be based outside of London by 2030, in order to deliver services closer to the people they are aimed at serving."
        },
        {
            "text": "This opens a host of opportunities for people at all stages in their careers. People who wanted to work for the Civil Service, but didn’t want to relocate from South Wales, can now do so. Students from all 5 of the universities in South Wales can now consider a career supporting international trade without the need to move to London. People already in London and other big cities, both in Civil Service and the public sector, can consider progressing their careers in a place where they can enjoy the different quality of life a smaller capital city offers."
        }
    ]
}