{
    "url": "https://homeofficemedia.blog.gov.uk/2022/09/22/factsheet-economic-crime-and-corporate-transparency-ecct-bill/",
    "title": "Factsheet: Economic Crime and Corporate Transparency (ECCT) Bill",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2022-09-22T14:29:32+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Why do we need the Economic Crime and Corporate Transparency (ECCT) Bill? "
        },
        {
            "text": "The UK is one of the world’s most open and most attractive places for doing business. This same openness means that the UK is exposed to criminal activities, such as money laundering, corruption, and terrorist financing, that can all have a devastating impact on our businesses and citizens. "
        },
        {
            "text": "The Government acted quickly in response to Russia’s invasion of Ukraine in February 2022 and introduced the Economic Crime Transparency and Enforcement (ECTE) Act to crack down on dirty Russian money and other foreign elites abusing our open economy. This legislation: "
        },
        {
            "text": "The Government committed to bringing forward this further Bill to deliver a suite of wider-ranging reforms to tackle economic crime and improve the transparency of corporate entities.  "
        },
        {
            "heading": 3,
            "text": "Key measures of the Economic Crime and Corporate Transparency Bill "
        },
        {
            "text": "The ECCT Bill will deliver: "
        },
        {
            "text": "These provisions will bear down further on kleptocrats, criminals and terrorists, strengthening the UK’s reputation as a place where legitimate business can thrive, whilst driving dirty money out of the UK. "
        },
        {
            "heading": 3,
            "text": "Reforms to Companies House "
        },
        {
            "text": "The Bill will reform the role of Companies House and improve transparency over UK companies and other legal entities. The reforms include:  "
        },
        {
            "heading": 3,
            "text": "Reforms of limited partnerships  "
        },
        {
            "text": "The ECCT Bill will tackle the misuse of limited partnerships, including Scottish limited partnerships, to make them more transparent. One of the key measures will be a requirement for limited partnerships to maintain a connection to the UK. The Bill will also enable the Registrar to deregister any limited partnerships that are dissolved or which are no longer conducting business.  "
        },
        {
            "heading": 3,
            "text": "Seizure and recovery of suspected cryptoassets "
        },
        {
            "text": "The Bill will provide additional powers to law enforcement so they are able to more quickly and easily seize and recover cryptoassets which have been acquired through illegal routes such as money laundering, fraud and ransomware attacks. The Bill will introduce amendments to the Proceeds of Crime Act 2002 to enable law enforcement to tackle criminal use of cryptoassets more effectively.  "
        },
        {
            "heading": 3,
            "text": "Strengthening Anti-Money laundering measures  "
        },
        {
            "text": "The Bill will strengthen anti-money laundering measures for suspected money laundering, fraud and other economic crimes. The reforms will: "
        }
    ]
}