{
    "url": "https://ofqual.blog.gov.uk/2022/09/22/focus-on-mental-health-how-to-help-students-navigate-their-education/",
    "title": "Focus on mental health: how to help students navigate their education",
    "authors": [
        "Professor David Putwain"
    ],
    "categories": [
        "A levels and GCSEs"
    ],
    "pub_date": "2022-09-22T10:02:36+01:00",
    "content": [
        {
            "text": "School and college qualifications are important, whether GCSEs, A levels, Applied Generals or other vocational and technical qualifications. It is no surprise, then, that teachers and parents spend a lot of time talking to young people about the importance of achievement – and often the flip side: what failure can result in.  "
        },
        {
            "text": "All these messages are well-intentioned. After all, who does not want young people to achieve their potential and take the next step of their lives and careers?  "
        },
        {
            "text": "For 2022 Youth Mental Health Day, we asked Professor David Putwain of Liverpool John Moores University how teachers and parents can approach talking to young people about their education and exams in ways that support their mental wellbeing. "
        },
        {
            "heading": 2,
            "text": "What the research shows"
        },
        {
            "text": "There is now an accumulated body of evidence to show that students can react in remarkably different ways to messages about the importance of their GCSEs and other studies. On the one hand there are students who respond well to such messages, which act as a reminder for why it is important to work hard. On the other hand, there are students for whom such messages intensify pressure around study and act as a trigger for anxiety.  "
        },
        {
            "text": "Consider, for example, what a Year 11 student told me when I asked if this was a topic worth researching: "
        },
        {
            "text": "Research studies of students in Years 10 and 11 have shown that the different ways in which students respond to messages about the importance of exams do matter. Students’ responses can, and do, impact motivation, engagement, and ultimately achievement. Students who respond positively to such messages are more hopeful and optimistic about their exams, are more motivated and engaged, and achieve higher grades. Students who respond negatively to these messages are more anxious about their exams, which interferes with motivation and engagement, and they achieve lower grades.  "
        },
        {
            "heading": 2,
            "text": "Different students need different messages"
        },
        {
            "text": "So what, if anything, can we do to ensure we are talking to and advising students in the most effective way? "
        },
        {
            "text": "The answer is not simply to stop using such messages. That would be denying those students who respond positively the benefit. The solution is to get the right message to the right student, and at the right time. This may mean reconsidering those messages delivered in a group setting, such as an assembly or whole class as there will inevitably be some students for whom this will result in negative emotional and motivational reactions. However, individualised messages could be directed to specific students, or even those in small groups, who will respond positively.  "
        },
        {
            "text": "So do we know which students will respond effectively? As students’ reactions to these messages are largely private experiences, they can be difficult to gauge from how someone is behaving. The answer to this question can, in part, be drawn from the theme of 2022 Youth Mental Health Day: “connect meaningfully”. Those best placed to be able to anticipate, and judge, students’ reactions are those that know them the best. At home this is likely parents, carers, or other family members. And in a school or college setting – at least in relation to learning – it ought to be their teachers. "
        },
        {
            "heading": 2,
            "text": "Connecting meaningfully"
        },
        {
            "text": "There is no substitute for teachers getting to know their students the best that they can within a professional and supportive context. Teachers who do this will be able to understand students’ motivations, aspirations and fears more effectively, and judge how and when to use motivating messages to their greatest effect. Taking the time to talk to students, showing an interest in them, and being non-judgemental, empathetic and supportive will help to build these important positive relationships.  "
        },
        {
            "text": "In the educational literature, developing positive teacher-student relationships is described as “relational” support. Alongside instructional support (effective teaching and learning) and behavioural support (effective classroom structure and behaviour management), relational support is the cornerstone of developing motivated, engaged, and positive students. All of which contribute to a student’s sense of wellbeing at school or college. That setting is the place where they feel valued, can flourish, and achieve their aspirations. "
        },
        {
            "text": "It therefore follows that it is important for teachers to take a little time to reflect on what they say, when they say it, and to whom.  "
        },
        {
            "text": "The best way to judge all this is by getting to know a student well in a professional capacity. In doing so, it is possible to make a positive contribution to not only their learning and achievement, but also their mental wellbeing."
        },
        {
            "text": "Professor David Putwain, School of Education, Liverpool John Moores University"
        }
    ]
}