{
    "url": "https://prisonleaversproject.blog.gov.uk/2022/09/22/funding-innovative-local-partnerships/",
    "title": "Funding innovative, local partnerships to tackle reoffending, through the Local Leadership and Integration Fund",
    "authors": [
        "Karen Asamoah"
    ],
    "categories": [
        "Local Leadership and Integration Fund"
    ],
    "pub_date": "2022-09-22T16:44:05+01:00",
    "content": [
        {
            "text": "The Prison Leavers Project (PLP) launched the Local Leadership and Integration Fund (LLIF) back in February 2020. Public and third sector organisations were invited to present joint solutions to turn repeat offenders away from crime by tackling the drivers of their offending in a bid to reduce reoffending."
        },
        {
            "text": "LLIF recognised that the issues experienced by those leaving prison are often specific to the local area, therefore we are empowering and supporting local leaders working together in partnerships to develop innovative ways to tackle reoffending that are tailored to their localities, across England and Wales."
        },
        {
            "text": "The LLIF is made up of two funding rounds, with the first group of partnerships receiving funding in June 2021.  Their interventions include providing accommodation, peer support and employment opportunities through partnerships which create real-work environments within the prison estate – find the full scope of round one partnerships here."
        },
        {
            "heading": 2,
            "text": "Welcome to Round Two partnerships - live now! "
        },
        {
            "text": "Applications for the second round of funding closed last year and four new exciting partnerships have now been successful in their bid - amongst strong competition!  So how will these successful partnerships support prison leavers to build productive lives that will contribute to the communities they are released into? Let us introduce you to the who, what, and where of the partnerships we are funding: "
        },
        {
            "text": "In launching a second round of LLIF partnerships, we’re able to expand the locations in which these innovative and local solutions to reoffending can contribute to their communities. And, with these partnerships, motivated by supporting prison leavers with specific needs, we look forward to seeing their pilots live in action over the coming months. "
        },
        {
            "heading": 2,
            "text": "The road to success - Round 1"
        },
        {
            "text": "We are already seeing the exceptional efforts of the partnership led by Change, Grow, Live, based in the West Midlands and one of our partnerships from Round One.  Change, Grow, Live are helping to motivate a positive mindset change in prison leavers to actively engage with workshops geared towards self-improvement.  "
        },
        {
            "heading": 3,
            "text": "Change, Grow, Live - West Midlands  "
        },
        {
            "text": "Having identified an opportunity to help prison leavers post-release across the West Midlands, the partnership led by Change, Grow, Live wanted to support those with experience of the care system through training, peer mentoring and employment coaching, in and out of custody. "
        },
        {
            "text": "Change, Grow, Live have already demonstrated the positive success their approach can achieve through one participant’s journey, Nigel – who was initially resistant to receiving any help or support. However, through Nigel’s participation in their Mental Health workshop, he was able to engage with other people and discuss this reluctance, positively changing his perspective on receiving support post release.  "
        },
        {
            "text": "Nigel has since gone on to complete an accredited Level 1 employability and education training course called ‘Realise Your Vision’. This empowers prison leavers to rethink negative thought and behaviour patterns which, until now, have stood in their way. Nigel has also participated in workshops on Mental Health, Rights and Accessing Social Care Records which supports prison leavers to understand and navigate their records and rights whilst in custody. Nigel has since continued his efforts post release, with the determination to stay out of prison. "
        },
        {
            "heading": 2,
            "text": "Stay tuned"
        },
        {
            "text": "As partnerships continue to deliver their fantastic interventions over the coming months, it is our intention to not only support, but to listen, learn and share our findings across the services offered. "
        },
        {
            "text": "In learning from our partnerships and understanding the challenges of working collaboratively across sectors, it is our hope to influence systemic change in the way voluntary sector and public sector work together to deliver services. The project will test a wide range of interventions at a small scale initially. Whilst being supported by evaluation experts, we’re set to gain a better understanding of what works, with the view to scale up the approaches that prove effective in the future. "
        }
    ]
}