{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/09/22/g7-laboratory-operations-manager/",
    "title": "G7 Laboratory Operations Manager",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-09-22T14:50:14+01:00",
    "content": [
        {
            "text": "The Role:\nWe require two Laboratory Operations Managers to lead a team of technical experts and help shape the function and vision for our new testing facilities. You will apply your strong technical expertise to manage the delivery of relevant work programmes, acting as lead reviewer to ensure laboratory policies and outputs provide effective outcomes and impact for the organisation. Your contribution will be critical in ensuring that our scientists and engineers can work in the most functional and safe laboratory environment, enabling them to deliver a high-quality and efficient service. Success in this role will be enabled by collaboration with existing team members and measured by minimising any downtime caused by equipment failure, safety issues or delayed orders. This is a key post at our newly refurbished Teddington site, requiring close collaboration with other evidence and H&S teams to ensure the effective, efficient and safe operation of our laboratories."
        },
        {
            "text": "Our Team:\nWe are a multidisciplinary team of scientists and engineers delivering testing capability across the broad portfolio of OPSS regulatory requirements. The team works across our new laboratories at the Centre of Product Testing and Research which include metrology, mechanical, electrical, chemical and flammability facilities. We seek to implement fit for purpose practices and procedures to deliver robust, scientific outputs. In collaboration with other internal evidence teams including those in science, engineering, research and analysis, our outputs inform policy development, incident investigation and the delivery and enforcement of product regulations."
        },
        {
            "text": "Vacancy reference: 238916 Teddington; closing date:  11:55 pm on Sunday 9th October 2022."
        }
    ]
}