{
    "url": "https://lifeathmrc.blog.gov.uk/2022/09/22/graduates-join-our-tax-specialists-programme-hear-jonnys-story/",
    "title": "Graduates, join our Tax Specialists Programme: Hear Jonny’s story",
    "authors": [
        "Jonny Brown"
    ],
    "categories": [
        "Graduate",
        "Guest blog",
        "Recruitment"
    ],
    "pub_date": "2022-09-22T14:55:12+00:00",
    "content": [
        {
            "text": "Applications for our graduate Tax Specialist Programme (TSP) are now open! You have until 26 October to apply. Get inspired by reading our blog from one of the TSP’s newest intakes, Jonny Brown, as he shares his story about what it’s like to work at HMRC and why he decided to join the programme.  "
        },
        {
            "heading": 2,
            "text": "What's it like working for HMRC "
        },
        {
            "text": "It’s an interesting and challenging job. I am currently a compliance caseworker in AAS (attacks against the system) in the individuals and small business compliance team. This involves investigating tax returns that have been fraudulently inflated and stopping payments that aren’t due. No two days are the same and no two cases are the same. There is a lot to learn as it all evolves and changes so rapidly, so you can never be in a situation where you know it all. However, there are plenty of opportunities for continued professional development and my colleagues have been a big support. HMRC has also been very supportive through the COVID-19 pandemic, and now that we have returned to the office, the support has continued with morale boosting team activities to try and bond teams who haven’t seen each other for the past 2 years. "
        },
        {
            "heading": 2,
            "text": "What your favourite thing about your team? "
        },
        {
            "text": "I like the fact that we come from all different age groups and backgrounds and yet everyone is made to feel welcome. We bond so well and work together as one cohesive unit, pulling on each other’s points of view and experience to deliver a positive experience for the taxpayer. I think this also helps in supporting each other through our work and social lives. "
        },
        {
            "heading": 2,
            "text": "Why did you join the TSP programme? "
        },
        {
            "text": "I started the TSP on 14 September 2022. I decided to apply as it provides a fantastic opportunity to accelerate your knowledge and push you through a couple of promotions to a higher grade in a shorter amount of time. "
        },
        {
            "heading": 2,
            "text": "What piece of advice would you give someone starting on the TSP? "
        },
        {
            "text": "My advice for anyone applying would be to take a deep breath and dive in! Jokes aside, it is a challenging programme due to the fact it is designed to stretch and develop you to the maximum of your potential. I would say use the benefit of your colleagues and wider workplace to help support you, make the most of the revision time, be very organised and stay focused on what you need to do to complete the course. Its 3 years of hard work for a great result at the end.  "
        },
        {
            "heading": 2,
            "text": "What else are you involved in at HMRC, beyond the day job? "
        },
        {
            "text": "At the minute I am not involved in any other “extra-curricular” activities, however the potential for these for anyone interested is huge. From sports and social clubs, to volunteering, continuous development, and communities (LGBTQIA+, race, mental health) – there’s something for everyone. HMRC is so supportive, for example, they have schemes to release members of staff to volunteer at the Commonwealth Games and for reserve armed forces.  "
        },
        {
            "heading": 2,
            "text": "Were you worried about anything before starting with HMRC? How has that worked out in reality? "
        },
        {
            "text": "I joined HMRC during the pandemic when we were all working from home, so I was slightly worried that there wouldn’t be the same level of interaction as there would be in the office. I wondered how that would impact the quality of training and support in our job, but I didn’t need to be concerned. The level of preparation, support and training has been excellent, and the support between teams and from the trainers has been both timely and useful. "
        },
        {
            "heading": 2,
            "text": "Is there a good work-life balance at HMRC? "
        },
        {
            "text": "Yes, after working for 17 years in retail and having a poor work life balance, the difference at HMRC is amazing. The availability of flexi -time and a real focus on employee welfare is refreshing to see. As an example of this, I had a dentist appointment and as I was worried and pre-occupied, so I forgot to take my break. My manager noticed and said, “you need to take time away to ensure you are not neglecting your welfare.” This is a prime example of how well you will be looked after by HMRC during your career. "
        },
        {
            "heading": 2,
            "text": "Come work for us! "
        },
        {
            "text": "You can apply for the programme on Civil Service Jobs. Applications open on 28 September 2022 and close on 26 October 2022.  "
        }
    ]
}