{
    "url": "https://civilservice.blog.gov.uk/2022/09/22/how-i-helped-at-hm-queen-elizabeths-lying-in-state/",
    "title": "How I helped at HM Queen Elizabeth’s lying-in-state",
    "authors": [
        "Kitty Buchanan-Gregory"
    ],
    "categories": [
        "A great place to work",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-09-22T12:31:36+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Cabinet Office marshal Kitty Buchanan-Gregory was one of more than 600 volunteer civil servants supporting mourners queuing to see Queen Elizabeth’s lying-in-state at Westminster Hall. Below, we publish Kitty’s diary of her experiences "
        },
        {
            "text": "Shift 1"
        },
        {
            "text": "Wednesday. I’ve been posted to the prime post of Westminster Hall and I’m one of the first people you see as you exit onto Parliament Square. ‘The emotional shift’ as I call it. "
        },
        {
            "text": "So many mourners come out crying softly. Some are so overwhelmed, they crumple sobbing into the gates. Part of our job is to help them recover, giving them space and a few kind words before pointing them onto tubes, or the nearest pub. "
        },
        {
            "text": "Many are too emotional to speak. “Thank you,” they whisper, and we acknowledge each other with a British nod. I bite my lower lip many times. "
        },
        {
            "text": "Police are brilliant , they’ve allowed me to escort the disabled to easier areas. It’s heartwarming to see impeccably behaved assistant dogs in bow ties, I sneak ear fuss and tell them Her Majesty would be thrilled. An assistance cat yesterday - who knew!  We agreed that she was most likely the first ever feline to see a monarch lying-in-state. "
        },
        {
            "text": "The gun carriage arrived late in the night with busloads of soldiers ready to rehearse the final farewell. Not just another ceremonial rehearsal - but the final journey. "
        },
        {
            "text": "I am desperate to go and see the Queen myself, but a 10 hour wait on top of a 8.5 hour shift felt too much last night. I need to buckle up. Seven decades of hard shifts, she put in for us all. I’m just the tiniest of cogs in the machine doing what I can. "
        },
        {
            "text": "Shift 2"
        },
        {
            "text": "Thursday, Westminster Hall. people come out exhausted  - their emotion is palpable. The blue Marshals are the faces of comfort, along with the Samaritans, British Red Cross and faith teams dotted along the queue. When the police cordon is removed, the press are everywhere - we try to console and give directions whilst battling 'Coming live to you from NBC where the British Public are grieving' in-your-face broadcasts. We exchange a few words* and  they protest to the Police. "
        },
        {
            "text": "“Don't ask me mate, she's the boss,” and they nod at me and wink.  The BBC are delightfully polite. My tactic is to PROJECT MY VOICE and talk in my firmest British accent. “Please keep moving, thank you so much ladies and gentlemen.” The back of my jacket and headmistress voice is big in LA. NBC exit in a strop, police high-five me. God, I love the police."
        },
        {
            "text": "The assistance queue is moving well, I help the most beautiful family, including young David resplendent in his crown and wheelchair. I get a hug from his parents. “You've all made our day so special, everyone helping us” and they start a long journey home, departing to  waves from us all.  "
        },
        {
            "text": "Dramas solved, - a lady lost her expensive watch. “I wanted to wear my best diamonds for the Queen,' she sobs “ but  now it's gone.”"
        },
        {
            "text": "“Follow me,” I say. The  amazing Parliamentary staff and Police find it to tears of gratitude. "
        },
        {
            "text": "“A present from the Queen for coming today,” I whisper and wave her off. Someone hands me flowers and a card for the King, “It's very personal” and they’re crying and beg me to give it to him. I promise to send it to the Palace - I will. Promises like this carry weight."
        },
        {
            "text": "Westminster is a family, and we all work together - Parliament, police from over the UK, and TfL tube are fantastic as I wheel the infirm to their journey home as they take retired and tired old soldiers to the District Line. "
        },
        {
            "text": "The Inspector finds a £20 note on the floor. “Right you're in charge,'” he says.  A City Police and Cabinet debate ensues on what would the Queen prefer - a dog or horse charity. We decide on horse, and the Fell Pony Association gets a bank transfer.   "
        },
        {
            "text": "SHIFT 3"
        },
        {
            "text": "Friday: Tower Bridge. The Timeshift.  The queue is vast and desperate for a wristband to be issued. On the far side, The Tower of London is missing its jewels, resting upon HM’s coffin. Soon to be returned to the Tower, soon worn by a new Monarch. We will no longer have a Queen in our lifetime. History stands firm amidst a skyline of skyscrapers, a skyline changed over her reign. I wave people forward, the queue continues, we continue."
        },
        {
            "text": "SHIFT 4"
        },
        {
            "text": "Saturday: Oxo Tower. The Practical and cold shift. This time it's all about keeping HMS Queue EII moving. I'm stationed by the river and TALKING LOUDLY."
        },
        {
            "text": "“Ladies and Gentlemen! The wait time is about six hours from here, the portaloos are over to your right. Please ensure you have your wristbands safe. The nearest cafes are to your right, please stock up on hot drinks. Thank you for your patience.\" The queue shuffles forward and every few minutes I repeat the whole thing again. For hours."
        },
        {
            "text": "Sunsets on rooftops and London basks in golden sunshine, the river police cruise by and we wave back. Friendly counter terrorism is paying off. Autumn is here and in the shadows of the Oxo Tower it gets bitterly cold. I find a sunny spot and repeat the patter."
        },
        {
            "text": "This is the middle section of  the queue, 6-7 hours in with the same to go. I advise on a six hour wait and get groans, so I say the same thing differently. \"Ladies and Gentlemen we estimate you’ll arrive at midnight tonight\" - to cheers. I stick with arrival times trying not to sound like a flight attendant."
        },
        {
            "text": "People walk by with 'thank you \" nods. Diet flies out the window as children, egged on by parents, shyly offer me donuts. I crouch down and we talk about the stuffed corgis they carry, and isn't the Queen special. A  real corgi walks past and allows me an ear fuss. I'm pretty sure HMQ is silently walking through the queue, thrilled at the turnout. "
        },
        {
            "text": "It gets dark and cold. The Salvation Army hand out blankets, LFB hand out water and I stand on Westminster Bridge - the Houses of Parliament, a beacon of 'You're nearly there' with the end in sight. No one wants the queue to end -  if the queue continues, the Queen contines. But the hours are slipping by and it will all end. Sunday will be my final shift."
        },
        {
            "text": "Shift 5 "
        },
        {
            "text": "Sunday: Last Post. My Final Shift"
        },
        {
            "text": "'What would the Queen wear to stand in a queue? I decide on tweed skirt, Skyfall Barbour and coronation scarf.  James Bond with a pocket of dog biscuits. I hope this gets nods of approval from above."
        },
        {
            "text": "4pm.  Today MP's are on shift and I find myself next to the former Home Secretary. Priti Patel stays for hours, quietly ushering people until someone notices; 'Is that who I think it is?'. She lets the line go wobbly so I shout, 'No this way', and with her protection officer she's back on track smiling, pleased to be one of the crew, all grades compressed under a high-vis vest."
        },
        {
            "text": "The queue has a magnetic pull, everyone wants to watch it, film it, meet friends in it - queue without queuing. For many this is the closest they'll get to Her Majesty. Just witnessing 'the queue' makes people feel involved."
        },
        {
            "text": "7pm. The shift is hard, medical issues are rife with the old and infirm. We wrap them in DMCS blankets, fetch cups of tea and check, 'Are you sure?' But their determination is admirable, so we rally wheelchairs and taxis, and ensure they don't miss out on their own goodbyes to one of their own."
        },
        {
            "text": "Sunset,he pinkest of skies, our final night of the second Elizabethan age. I catch  it just as it fades behind Westminster. The sands are slipping through the hourglass; sunrise will bring a new mourning."
        },
        {
            "text": "At 8pm we stand on the bridge. No chime from Big Ben, but a ripple of applause and 'THREE CHEERS.'"
        },
        {
            "text": "22.38. The queue has closed, he first of the endings. Further down someone is the last mourner, barriers are taken down and roads swept. We end our shift soon, but this all feels the 'new normal' so we carry on longer than needed."
        },
        {
            "text": "1am. I’m at the top of the steps looking at her. The Queen’s final day with us, the grains of time all but disappeared. The Duty Officer taps his sword for the changing of the guard, the sound echoing through history. In candlelight they march in ancient ceremonies. We are back 700 years. Now I stand in front of her, 'Thank you for your service Ma'am,' I bow. It's been a pleasure,a moment in history, you shaped OUR history. My final act of service was in a blue Marshall Vest."
        },
        {
            "text": "RIP HMQ and give those Corgis some ear fuss from me."
        }
    ]
}