{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/09/22/making-policy-inclusive/",
    "title": "Making policy inclusive",
    "authors": [
        "Selvin Brown"
    ],
    "categories": [
        "Events",
        "Thought leadership"
    ],
    "pub_date": "2022-09-22T12:00:16+01:00",
    "content": [
        {
            "text": "I have worked in the Civil Service, for government and across enough departments to know that equalities considerations and inclusive practices must become part of the day-to-day thinking of all policy makers. For me, the bottom line is that being a good policy maker means knowing who your policies are affecting, in what ways and how these impacts differ for different groups of people. This is not a nice-to-have nor an add-on, but a core part of the role."
        },
        {
            "text": "That’s why I am delighted to be part of the team kicking off a new learning campaign which encourages and helps policy makers do exactly that. The campaign is going to spotlight case studies from across government which have incorporated inclusive policy making practices into their work. It will also provide practical guidance on how to develop the relevant skills and knowledge and apply these to your own policy area."
        },
        {
            "heading": 2,
            "text": "Inclusive policy is good policy"
        },
        {
            "text": "Our goal as policy makers should be to design and deliver policy which improves outcomes for citizens and society through the realising of government intentions. Therefore, the most effective and successful policies will be the ones that consider how different groups of people will be impacted and adjust to mitigate the negatives. This is how we’ll tackle the disproportionate impacts that some policies have on certain groups and improve policy overall for all. Not only is this an obvious way to make effective and efficient policy, it is also a legal requirement placed on every public sector worker under the Public Sector Equality Duty (PSED). It requires all public authorities to pay due regard to the need to eliminate unlawful discrimination, advance equality of opportunity and foster good relations between people. Considering equalities in policy design is also important to achieve fairness and remain in accordance with Civil Service values, particularly to act with integrity."
        },
        {
            "text": "During COVID-19 there was some good practice to understand equalities impacts and consider PSED – including working in multidisciplinary teams, collaborating across departments, and adding standard paragraphs about PSED considerations into submissions. However, this sort of practice was not done uniformly across departments. For example, we quickly discovered that the masks given to frontline workers were tested on the ‘Sheffield head’, a mannequin head modelled on a 6’1’’ Caucasian male, meaning it was not effective on a large number of staff who did not fit this description. Brilliant teams from the Department for Health and Social Care and the NHS collected data on the diverse range of staff from across the NHS via an online survey and used the findings to engage effectively with different manufacturers. The result was the use of a broader range of face shapes and sizes in manufacture design and prototypes (including men and women, different ethnicities and different ages) and testing of masks on a diverse range of people including glasses wearers and deaf people."
        },
        {
            "text": "While the team recognised the importance of having an individual rather than a one-size-fits-all approach for the protection of front-line staff, this policy was developed under huge pressure in the early days of the pandemic. The team used their experience to identify work they would do differently in future. This included:"
        },
        {
            "text": "One of the key lessons from this sort of case study is that in a crisis it is difficult to gather new intel and evidence in a robust, high-quality and consistent way. Leaving these important considerations until a crucial moment means that, in a best-case scenario, some people will already have been disadvantaged."
        },
        {
            "text": "In a crisis we can really only use what we already know, and so it is imperative that we use non-crisis times to do the work. Equalities considerations must become part of the day-to-day thinking of policymakers, they must see it as a basic tenet of good policy-making."
        },
        {
            "heading": 2,
            "text": "Diversity adds value to the policy design process"
        },
        {
            "text": "As well as inclusive policy making, it is also important for us to strive toward a diverse and policy workforce. Not only is this important for inclusion and representation, but it should also have knock-on benefits for our policy-making. The more diverse our workforce is, the more representative of the public we’re delivering for, the more likely those voices and experiences are brought into policy-making and the more likely policy will take into account differential impacts. I therefore really advocate for diverse and inclusive teams and leadership and promoting a culture that values the lived experience of staff in the policy making process."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "Helping policy professionals develop their skills and knowledge in inclusive policy making and promoting ways to improve inclusion in policy teams is what the learning campaign that I’m launching next week is all about. The question I most often get asked on Equality, Diversity and Inclusion is – ‘I really want to make my policy more inclusive, but I don’t know how? How do I do this?’  Much of this campaign is about supporting you as a policy professional practitioner, the ‘how to do this’ stuff."
        },
        {
            "text": "There will be seminars, blogs and other resources continually available to showcase and share the innovative and effective work already going on across government. The campaign also includes specialist support for Senior Civil Servants to assist them in their leadership and role modelling of an inclusive Civil Service, and a wider action-based offer for all civil servants to develop their skills and knowledge."
        },
        {
            "text": "Find out more about the campaign here (from when it launches on Monday 26th September) and register your interest by signing up to the Policy Profession website now. I hope you get involved!"
        }
    ]
}