{
    "url": "https://socialcare.blog.gov.uk/2022/09/22/staying-safe-beyond-the-pandemic/",
    "title": "Staying safe beyond the pandemic",
    "authors": [
        "Vickie Peters"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-09-22T09:06:54+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A campaign to protect us all"
        },
        {
            "text": "At Cygnet Health Care, we have just launched a flu campaign which will run from September 2022 to February 2023. We’re calling for flu vaccination volunteers to provide jabs at local services to help us make vaccinations available to as many of our staff, patients and residents as possible."
        },
        {
            "text": "Social contact has now returned to pre-pandemic levels, which means there is likely to be a resurgence in influenza activity in winter. The potential for co-circulation of influenza, COVID-19 and other respiratory viruses, could add substantially to pressures in health and social care services."
        },
        {
            "text": "It is, therefore, no surprise vaccination remains an important priority for us this autumn and winter to protect those we care for and to reduce hospitalisations."
        },
        {
            "text": "For most healthy adults, the common symptoms of flu - fever, chills, headache, aches and pains in the joints and muscles, and extreme tiredness – usually disappear after two to seven days and a full recovery is made."
        },
        {
            "text": "But for some, including the individuals we care for, this kind of infection can lead to hospitalisation, permanent disability or even death. That is why we take our annual vaccination rollout extremely seriously and encourage all frontline health and social care workers to have both flu and COVID-19 booster jabs in order to protect the individuals in their care."
        },
        {
            "heading": 2,
            "text": "Vaccination volunteers"
        },
        {
            "text": "To be a flu vaccination volunteer in our health and social care services, we are asking for staff who are registered nurses or doctors, willing to vaccinate colleagues in their service and other local facilities and who have up to date intermediate life support training."
        },
        {
            "text": "We will also be asking our volunteer staff to complete an online educational module about flu."
        },
        {
            "text": "While pandemic restrictions have long been lifted and we have returned to more familiar ways of life, we know coronavirus is still present in our communities. That’s why all our colleagues at Cygnet Health Care continue to act carefully to protect each other and those in their care."
        },
        {
            "text": "It is vital we continue to do all we can to prevent the virus spreading and mitigate the risk of infection. Our teams support some of the most vulnerable people in society and I am immensely proud of how everyone has worked hard to protect all our residents and patients."
        },
        {
            "text": "On this point, we’ll be encouraging all staff and service users to receive the COVID-19 booster vaccine. Across many of our services, we have excellent community partnerships with local GP practices, many of which have already arranged to attend our facilities and administer vaccines to service users and staff."
        },
        {
            "text": "My message to everybody is that booking a vaccine, whether it be for flu, a Covid-19 booster, or both, is easy and we encourage everyone to do so to keep friends, family, colleagues and the wider community safe. Please book your appointment without delay."
        }
    ]
}