{
    "url": "https://naturalengland.blog.gov.uk/2022/09/22/the-death-of-asta-a-natural-england-tagged-hen-harrier/",
    "title": "The death of Asta, a Natural England-tagged hen harrier",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2022-09-22T13:46:33+01:00",
    "content": [
        {
            "text": "By: John Holmes, NE Strategy Director"
        },
        {
            "text": "Hen harriers are currently extremely rare in England due to illegal persecution and nest disturbance, primarily in areas associated with grouse shooting. Natural England satellite-tracks hen harriers in order to investigate patterns of dispersal and survival, and the causes of any deaths. I said in my last blog that some areas of Natural England’s hen harrier recovery work remain controversial, and this is especially so because illegal persecution rightly evokes strong feelings for all of us. This is the story of one of our tagged hen harriers, Asta, and what happened to her."
        },
        {
            "text": "Asta was one of four chicks fledged from a nest in Northumberland in 2020 in an area managed by Forestry England. She had spent almost all of her short life in the north Pennines, and before her death had established a defined home range in an area managed for grouse shooting, centred on Gilmonby Moor, County Durham, ranging onto other nearby moors."
        },
        {
            "text": "As with all our tagged hen harriers, our staff were constantly checking up on Asta. Concerns were raised when Asta appeared to suddenly move to a new location – near Arrathorne, south-east of Richmond – and stopped moving. As always, the police were immediately informed, and no efforts were spared in tracking down the tag. Finding tags calls for considerable expertise, and our dedicated staff spent many long hours chasing the signals. What they eventually found was shocking and unexpected: the tag, which they had last seen on the healthy nestling Asta, attached to the scavenged carcass of a carrion crow. It was hard to make sense of this finding, but our staff acted fast, involving the police and other specialists."
        },
        {
            "text": "Here is what we know: it was quickly and clearly established that the tag and harness were intentionally fitted to the crow by a person. We know that Asta must have died before or soon after her tag was removed, because the harness straps were not cut or broken, and there would have been no way to remove the harness intact from a live bird without severe injury."
        },
        {
            "text": "Here’s what we do not know:"
        },
        {
            "text": "We are clear that the evidence points to a crime being committed, and that this will be shocking to anyone interested in improving the prospects for birds of prey in our uplands. This has been upsetting for all of our staff involved, especially those who had been monitoring and tracking Asta all her life."
        },
        {
            "text": "Our focus since this discovery has been to maximise the chances of finding the person who fitted the tag to the crow. The police launched a criminal investigation, which by its nature, has taken a long time to play out to its full conclusion; over a year. We have had many discussions during this time about whether sharing the details of this event with the public would increase or decrease the chances of a successful conviction, and the consistent advice of the police has been that this would decrease the chances. Therefore, on the specific request of the police, no statements were made, as is often the case when there are ongoing and sensitive police investigations, and we are still not sharing the details of the police investigation to avoid influencing future police work."
        },
        {
            "text": "Unfortunately, we have recently been informed that the police investigation did not gather enough information to identify a suspect. We remain deeply distressed and angered by this evidence of a wildlife crime, and an apparent effort to attempt to deceive or frustrate our monitoring programme, but without further evidence the police and Natural England have no basis for further action. Any requests for more details about this case, or new evidence, should be directed to North Yorkshire Police."
        },
        {
            "text": "Accusations that we have unduly withheld information "
        },
        {
            "text": "Despite the decision of the police to not publicise the details of the case, the full information was passed, by someone familiar with all the details, to anti-raptor-persecution campaigners. These campaigners have claimed that Natural England has not shared the information publicly in order to protect the grouse shooting industry. On 25th August 2022 these campaigners published a blog, accusing Natural England of being reluctant to share information because of alleged biases toward the shooting industry, because by that point the investigation had been closed and Natural England had not shared the facts of the case."
        },
        {
            "text": "Our work must always be open to scrutiny and criticism and we share and support the aims of anyone who wants to see an end to raptor persecution, but unfounded allegations are insulting and upsetting to our dedicated staff. The details of the case were not shared before now in order to maximise chances of a conviction and on the express request of the police. Natural England was only informed by the police that the case was closed, and no further action would be possible, on 31 August 2022, after the publication of this blog, so this claim has no substance."
        },
        {
            "text": "Furthermore, it has been alleged by the same campaigners that a contribution by The British Association for Shooting and Conservation (BASC) of £75,000 to Natural England’s hen harrier work is related to our decision to not publicise details of this case, and has influenced our wider work tackling persecution. This is a serious allegation which we strongly reject. As published in March 2022, the BASC funding supports some Natural England staff time spent on monitoring, and on liaising with shooting land managers, and we welcome this support. As clearly set out in our agreement with BASC, this funding in no way constrains our wider statutory functions, and is not related to our work on cases of suspected persecution."
        },
        {
            "text": "What next? "
        },
        {
            "text": "We will continue our work tracking hen harriers and will make every effort to track down tags that stop transmitting. Some dead birds will be found, and investigations will conclude that they died naturally. Some birds will be found in suspicious circumstances, and the police will investigate, fully supported by our fieldwork and enforcement teams. In many cases the birds and tags will never be found – some of these losses will be birds that have been shot or trapped, and the bodies and tags hidden or disposed of, while others will be due to natural mortality, with low battery levels or topography meaning that the final signals are too imprecise for the tag to be tracked down. Still others could be due to tags failing while the birds are still alive. Whatever the possible reason, all tags that stop transmitting will continue to be referred to the police, and will be kept on file by the National Wildlife Crime Unit and local police forces, who monitor patterns of disappearances and take action where warranted. We will tirelessly continue this work, alongside all other work with our partners under the Hen Harrier Action Plan to tackle and discourage hen harrier persecution."
        },
        {
            "text": "Though the evidence continues to show hen harriers remain persecuted in parts of their range, we are pleased to be working with organisations including the Moorland Association, BASC and the Game and Wildlife Conservation Trust, as well as individual landowners and gamekeepers, to return breeding hen harriers across our uplands. The illegal acts perpetrated by criminals – whoever they may be – continue to cast a shadow over these efforts. Despite this, and the unfounded allegations that our staff are sometimes subjected to, we are approaching our work with renewed determination, recognising that there is much work to be done to address illegal persecution but encouraged by this year’s hen harrier breeding figures, with over 100 young fledged for the first time in 100 years."
        },
        {
            "text": "Note: this blog was prepared for publication in early September 2022. However, publication was postponed due to the national mourning period."
        }
    ]
}