{
    "url": "https://apprenticeships.blog.gov.uk/2022/09/22/transport-and-logistics-route-review/",
    "title": "Transport and logistics - route review",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "have your say",
        "Route review"
    ],
    "pub_date": "2022-09-22T09:12:35+01:00",
    "content": [
        {
            "text": "Following a successful pilot of our new approach to route reviews earlier this year in the construction route, we are pleased to announce the launch of the route review for transport and logistics."
        },
        {
            "text": "The aim of the route review is to provide an opportunity to listen to employers and stakeholders within the transport and logistics sector and sub-sectors to ensure they get the technical qualifications and apprenticeships they need, both now and in the future."
        },
        {
            "text": "Partnered with the implementation of our new revisions prioritisation approach and our restructure into route specific teams, we hope that employers and stakeholders will be keen to engage with us to make sure our suite of technical education products provide the best possible experience for apprentices and students."
        },
        {
            "text": "Consultation with employers and industry is at the heart of the route review and you can use our online survey to give us your views. This will run from September to November and will be supported by five sub-sector specific online consultation events to encourage conversation and provide clarification."
        },
        {
            "text": "Alongside this, we will be consulting with the sector to understand what the key principles and characteristics are, which should be reflected in all occupational standards. As per previous route reviews, these can be over-arching or sector specific, ranging from sustainability to providing opportunity for neurodiversity."
        },
        {
            "text": "We anticipate the route review will conclude in the spring of 2023 when we publish the final report including recommendations for changes to our occupational maps as well as the principles and characteristics we expect to be included in future occupational standards."
        },
        {
            "text": "We will then support trailblazer groups to implement these recommendations as swiftly and easily as possible. This is a growing sector with exciting occupations already available and more to come. We want to support you to attract new talent to support this growth and look forward to working with you to design the technical education products needed to support this."
        },
        {
            "text": "If you would like us to meet with you to discuss any aspects of the route review, please do not hesitate to contact us on construction.transport@education.gov.uk. In the meantime, please do take a look at our occupational map ahead of completing the online survey."
        },
        {
            "text": "You can also book on on of our webinars:"
        },
        {
            "text": "Rail Webinar – Monday 3 October 2022 at 1pm"
        },
        {
            "text": "Maritime Webinar – Thursday 6 October 2022 at 10am"
        },
        {
            "text": "Aviation webinar – Thursday 6 October 2022 at 1pm"
        },
        {
            "text": "Logistics and Supply Chain Webinar – Friday 7 October 2022 at 9am"
        },
        {
            "text": "Warehousing Webinar – Friday 7 October 2022 at 11am"
        }
    ]
}