{
    "url": "https://prisonjobs.blog.gov.uk/2022/09/22/what-its-like-working-as-a-community-payback-placement-coordinator/",
    "title": "What it’s like working as a Community Payback placement coordinator",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Community Payback",
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2022-09-22T09:30:42+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Community Payback placement coordinators play a key role in ensuring people sentenced to Community Payback are allocated to appropriate unpaid work projects. If you have good organisational and communication skills, plus an eye for detail, read what Mia has to say about her work and see if it’s for you. "
        },
        {
            "text": "Visit our website to find out more and to apply."
        },
        {
            "text": "Why did you decide to become a Community Payback (CP) placement coordinator?"
        },
        {
            "text": "Following my degree in health and social care, I worked as a support officer with people with mental health, substance misuse and homelessness issues. Many of them had been to prison and I was interested in their experiences after leaving custody. The CP placement coordinator role gave me an opportunity to learn more about Probation’s role in working with ex-offenders. The risk assessment part of the role was particularly attractive to me as it builds on the skills I developed in my last job."
        },
        {
            "text": "What is the main focus of your role as a CP placement coordinator?"
        },
        {
            "text": "I source projects that provide people on probation, who have been sentenced to CP, with an opportunity to do meaningful unpaid work that benefits the community. I assess each project to make sure it’s suitable, ensuring the necessary risk and health and safety assessments are done. Once they are, I let the admin team know so they can start allocating CP supervisors and people on probation to them."
        },
        {
            "text": "What does a typical working week look like for you?"
        },
        {
            "text": "It’s a very varied role and every single day is different."
        },
        {
            "text": "On a typical week, I’ll spend some time looking for, and planning, new CP projects. Initially, this might involve doing some internet research to find potential organisations – such as local authorities or charities – that might be able to provide suitable unpaid work for our people on probation. I also spend time speaking to contacts, who we refer to as beneficiaries, at organisations I’ve found though my research. The next few days, I might be out doing site visits to assess what work needs doing at CP projects, how long it will likely take, and to identify any potential risks. And the rest of the week might be spent attending meetings, reviewing current projects to make sure all the relevant documentation is up-to-date, and doing admin."
        },
        {
            "text": "I have set admin tasks – such as such as preparing mileage reports for the minibuses CP supervisors use to transport equipment and people on probation – that I need to do every month. So, I always set aside a couple of days to do them. Plus, I go to a monthly meeting with the local Community Safety Partnership, that’s attended by a wide range of organisations such as the police."
        },
        {
            "text": "What are some of the key skills you need to be a CP placement coordinator?"
        },
        {
            "text": "You need to be organised and able to plan ahead. But often things come up which mean you need to change your plans and re-prioritise. So, you need to be flexible, be able to think on your feet, make decisions, and act quickly too. And you need to be resilient."
        },
        {
            "text": "It’s important you have good communication skills and are confident talking to a wide range of people. You need to be able to promote the benefits of CP to potential beneficiaries and answer any questions they may have."
        },
        {
            "text": "Teamwork is also important as you work closely with other CP placement coordinators in your region, CP supervisors, the admin team and probation officers."
        },
        {
            "text": "You also need to have good IT skills."
        },
        {
            "text": "What do you like about your work?"
        },
        {
            "text": "I like the fact that every day is different. And that, while I obviously have to complete priority tasks when they need to be done, I can pretty much plan out my own schedule."
        },
        {
            "text": "I also enjoy getting out and about visiting CP project sites."
        }
    ]
}