{
    "url": "https://deframedia.blog.gov.uk/2022/08/02/biodiversity-indicator-data/",
    "title": "Biodiversity indicator data",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2022-08-02T12:15:34+01:00",
    "content": [
        {
            "text": "There has been coverage in recent days by New Scientist and ENDS Report of Defra’s decision to only publish key biodiversity indicator data in 2022."
        },
        {
            "text": "The coverage includes incorrect claims that publishing the data has been “cherry picked” and that the department has been “burying the evidence”. Such claims fail to recognise that this is part of wider work to improve our indicator data, and therefore lead to improved transparency and policy making to protect and enhance nature."
        },
        {
            "text": "We last reviewed our indicators in 2012, and since then much has changed, including the passing of the Environment Act 2021 and our new species abundance target. As we move towards the vitally important Convention of Biological Diversity (CBDCOP15), where the UK government will be pushing for ambitious global action to halt and reverse biodiversity loss globally, we are conducting a thorough review of our suite of biodiversity indicators. This will ensure that the best possible data is available, helping to inform the best possible decisions on biodiversity policy into the future."
        },
        {
            "text": "As well as ensuring the indicators fit with UK targets and England level strategies, the review also considers wider user needs beyond policy making. This includes potentially increasing the marine content of the indicators and identifying opportunities to improve the dissemination and accessibility of the indicators. We expect to finish the review by the end of the year."
        },
        {
            "text": "While this review is ongoing, key indicators are still being published. These cover important areas such as pollinating insects, protected areas, global biodiversity impacts and the relative abundance of priority species. We have prioritised the indicators needed for reporting on the 25 Year Environment Plan or the State of Nature Report to maximise transparency."
        },
        {
            "text": "All data which would have been published in 2022 will be available next year, meaning there will be no missing data and our progress on protecting and enhancing the natural environment can be fully scrutinised."
        },
        {
            "text": "This review is just one part of our wider efforts to improve our data and monitoring of the natural environment. The government has also committed £140m towards the Natural Capital and Ecosystem Assessment (NCEA), a science innovation and transformation programme being carried out by Defra and its delivery partners, that will provide key ecosystems data and analysis."
        },
        {
            "text": "NCEA will provide data on the location, extent and condition of England’s ecosystems over time through a systems approach. This will identify trends and provide indications of why they may be occurring, providing essential information for effective biodiversity policy decisions, including, for example, informing local authorities and Local Nature Recovery Strategies with data and evidence. The NCEA will provide opportunities to develop new or improve existing indicators on biodiversity, to enhance the evidence base we need to develop successful, long-term policies to improve biodiversity across the UK."
        },
        {
            "text": "More broadly we also publish indicators beyond biodiversity as part of our regular reporting on progress made towards delivering the 25 Year Environment Plan. We intend to finish developing and publishing the entire suite of 66 broader indicators by 2024."
        }
    ]
}