{
    "url": "https://mhclgdigital.blog.gov.uk/2022/08/02/celebrating-four-years-of-the-local-digital-declaration/",
    "title": "Celebrating four years of the Local Digital Declaration",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Declaration",
        "Local Digital Team"
    ],
    "pub_date": "2022-08-02T09:18:06+01:00",
    "content": [
        {
            "text": "Every July, the Local Digital team holds a month-long campaign to celebrate the anniversary of the launch of the Local Digital Declaration."
        },
        {
            "text": "Digital Declaration Month is about more than just our own achievements; it’s about celebrating the achievements of our Declaration signatories and the wider Local Digital community in making digital services that better meet the needs of citizens and deliver better value for money."
        },
        {
            "text": "Since it was launched in 2018 by 45 organisations, the Local Digital Declaration has grown to a community of 288 signatories with a shared vision to “co-create the conditions for the next generation of local public services, where technology is an enabler rather than a barrier to service improvements.”"
        },
        {
            "text": "In this blog post, we want to celebrate some of our highlights from the fourth anniversary of the Declaration and share some of the stories that we’ve heard from the Local Digital community throughout July."
        },
        {
            "heading": 2,
            "text": "Our highlights from the last year"
        },
        {
            "text": "The last 12 months in particular have seen a lot of exciting change and growth for the team—and there’s plenty more to come. Since our last anniversary we have:"
        },
        {
            "text": "The past year has also seen many of our funded projects from previous rounds reach important milestones in their development:"
        },
        {
            "text": "In an interview with UK Authority, Lawrence Hopper (DLUHC Deputy Director of Digital), also reflected on some of the achievements of the Local Digital Declaration to date—including how it has supported councils to 'fix the plumbing'—and shared an update on the future of Local Digital."
        },
        {
            "heading": 2,
            "text": "What impact has the Declaration had?"
        },
        {
            "text": "- Barnsley Council’s Local Gov IMS project"
        },
        {
            "text": "This year, we invited our signatories and the Local Digital community to join in the celebrations by tweeting using the hashtag #LocalDigital4Years, or by sharing a blog post that we can promote for them."
        },
        {
            "text": "We’ve received more than 30 tweets throughout the month and it’s been incredible to hear about the wide-ranging impact of the Declaration, including:"
        },
        {
            "text": "Several signatories also chose to blog about the impact of the Declaration on their organisation or project:"
        },
        {
            "text": "If you have a story to tell and would like to share your achievements with us, why not contribute to an upcoming issue of our Council Spotlight blog series? To nominate yourself or your team, complete this short form and we will be in touch for more information."
        },
        {
            "text": "https://twitter.com/digitalwastesvc/status/1544355484769157120"
        },
        {
            "heading": 2,
            "text": "What’s next for the Declaration?"
        },
        {
            "text": "Our upcoming programmes of work are currently being designed around the core principles of the Declaration, and this includes supporting the sector to improve cyber health, move away from legacy technology, and work collaboratively to build more user-centred digital services."
        },
        {
            "text": "We are also planning to work with councils to review and refresh the Declaration to ensure it meets the evolving needs of the Local Digital community."
        },
        {
            "text": "- Lawrence Hopper, DLUHC Deputy Director of Digital, in UK Authority magazine."
        },
        {
            "text": "In this recent blog post you can read about how we’ve started engaging with councils to help shape our work through the Local Digital Roadshow."
        },
        {
            "text": "We’ll continue to share more on our plans as they develop via our usual channels:"
        },
        {
            "heading": 3,
            "text": "Are you ready to become a Declaration signatory?"
        },
        {
            "text": "Any public sector and non-profit organisation that is working to improve local services is invited to join the Local Digital movement by signing the Declaration."
        },
        {
            "text": "If your organisation has been inspired by the stories from Digital Declaration Month month and is ready to become a Declaration signatory:"
        }
    ]
}