{
    "url": "https://insideDIO.blog.gov.uk/2022/08/02/excavating-a-saxon-cemetery/",
    "title": "Excavating a Saxon cemetery",
    "authors": [
        "Richard Osgood"
    ],
    "categories": [
        "Archaeology",
        "Operation Nightingale",
        "Salisbury Plain Training Area"
    ],
    "pub_date": "2022-08-02T16:23:21+00:00",
    "content": [
        {
            "text": "The dig site on Salisbury Plain. [Crown Copyright/MOD 2022]I’ve been running Operation Nightingale archaeological digs now for more than ten years. It’s an initiative to assist the recovery of wounded, injured and sick military personnel and veterans by getting them involved in archaeological investigations."
        },
        {
            "text": "It’s always a real thrill and privilege to excavate with a group of military personnel, both serving and veterans, as well as other trained specialist and local volunteers."
        },
        {
            "text": "The original concept behind these digs - to support the health and wellbeing of military personnel and veterans by getting them involved in archaeological investigations - is still very much the focus of these exercises today."
        },
        {
            "text": "Owning around 1% of the UK mainland, the Defence estate holds a lot of the nation’s heritage. This work not only assists the wellbeing of participants but also contributes towards DIO’s commitment to the stewardship of the historic estate."
        },
        {
            "heading": 2,
            "text": "Excavating a Saxon cemetery"
        },
        {
            "text": "Last month we were out on Salisbury Plain on an exciting excavation of a 7th century Saxon cemetery and have uncovered around 26 burials in 22 graves. We have also had some really wonderful finds, including Roman coins, bronze and silver discs and a beautiful necklace made of glass beads."
        },
        {
            "text": "A disc from the necklace, found during the excavation. [Crown Copyright/MOD 2022]We’ve had 16 veterans on this dig as well as regular and serving soldiers. In addition to developing new skills and learning about the archaeology of the area, the benefits of getting together as a group are massive. Most of us are camping on site and kinship is a big part of what we are doing here. In the evenings, there’s bonding round the campfire and that’s really part of it. Watching the sunsets at the end of the day is good for the soul."
        },
        {
            "text": "The kinship is especially important for the military community. The military is like a family for many and if that is taken away abruptly, if something happens, then that’s a difficult thing. We’ve had soldiers digging with us who’ve been out to Iraq or Afghanistan, who have experienced trauma. We also work closely with the diversity networks to make sure we are representing the whole Army on these exercises and for me that sums up archaeology - it’s all about people. Understanding how they lived, the land they lived on and sharing that experience by how we live on the land today."
        },
        {
            "text": "Sgt David Heron MBE, an Army Welfare Worker, took part in the excavation. [Crown Copyright/MOD 2022]And, looking at this site today, the landscape really hasn’t changed at all. Fundamentally, it looks today as it would have done in the 7th Century. Training doesn’t affect the land. The military presence is really important for these sites, others around the country have been built on or ploughed up, so the military being here has preserved it."
        },
        {
            "heading": 2,
            "text": "Cultural protection"
        },
        {
            "text": "As well has having a team of archaeologists and ecologists in DIO, there is also a dedicated Cultural Property Protection Unit in 77 Brigade which advises senior leaders on cultural heritage, ensuring it is preserved and protected in areas where conflict is taking place and the British military are involved. DIO aims to assist in part of this training process; something we were involved with in the campaigns in Afghanistan and Iraq."
        },
        {
            "text": "The excavation sites selected for Op Nightingale are carefully chosen to meet the needs of the exercise. The wide vistas and sense of space provides a place to really switch off and we choose sites that we know will provide some interesting archaeology. The process of carefully uncovering the finds is part of the therapeutic process, it helps to focus the mind and provides a sense of achievement."
        },
        {
            "text": "And this dig has not disappointed. We’ve found a 1400-year-old comb made of deer antler, pieces of Neolithic pots – around 5000 years old – even some structures on the site that could be Roman. One of the most interesting finds is a sharpening stone, we haven’t found one of those before!"
        },
        {
            "text": "The sharpening stone found during the excavation. [Crown Copyright/MOD 2022]Preserving these sites and properly curating the finds is really important too and this is where DIO are really able to add value to the way the Defence Estates are managed. MOD is assessed by statutory bodies on how we look after our heritage; these assets are inspected regularly to consider their condition. I think we are pretty good custodians, and the statistics seem to back this up. We also want to ensure that as many people as possible are aware of this wonderful history – all at the same time as making sure that the military achieve their training requirements."
        },
        {
            "text": "There is a natural affinity with what we aim to achieve on Op Nightingale and archaeology – it’s all about humanity and exploring what it is to be human. There’s something deep about looking at where we have come from, there’s a connection and this allows us all to experience something bigger than ourselves. Being able to share that on these digs with military personnel who may be having a tough time is highly beneficial."
        }
    ]
}