{
    "url": "https://mojdigital.blog.gov.uk/2022/08/02/our-peoples-experience-the-beating-heart-of-our-strategy/",
    "title": "Our Peoples’ Experience -The Beating Heart of Our Strategy",
    "authors": [
        "Jon Lund"
    ],
    "categories": [
        "employee experience",
        "Our People",
        "strategy"
    ],
    "pub_date": "2022-08-02T11:49:38+01:00",
    "content": [
        {
            "text": "Once you have been around for a while and have seen numerous strategies come and go, you understand that the most important ingredient in any of them is your people. They will be the difference between whether you achieve them and do the great things you want to do or whether you will fall short and have to rein in your ambitions. Here in Justice Digital, our strategy  is going to make a difference to millions of people, from our colleagues across the Ministry of Justice, to users of the many services we provide and this is why it is important that we make Justice Digital a great place to work, where our brilliant people can get on and do brilliant things."
        },
        {
            "text": "Our approach to employee experience and building employee engagement is very much a reflection of our strategic themes as we build flexibility into the organisation by investing in our people with a 10% policy - enabling colleagues to use 10% of their working time to learn new skills, develop and grow with the organisation. We have internal and external apprenticeships and are the only place I have ever worked where you could decide you wanted to do something completely different and be supported in a path to a completely new career. Our Heads of Profession are building communities to share knowledge and experience. Hybrid working is the norm here, with flexible working giving the people the autonomy to get on and do great work! Our National Talent Location Strategy is also helping us to attract the best people in the UK wherever you are."
        },
        {
            "text": "Data is driving where we are investing our efforts with our fortnightly, short, sharp surveys covering all aspects of people's experience and helping us to ensure that we are on the right track and continuously improving things over time, whilst working on the things that need improving. Our users are our people, all of us,  our feedback and employee voice is at the centre of our communications - which are focused on the things people are telling us in their feedback, in this way we can align our communications with what people are talking about, worried about or want to know more about and use their input to form an important component in our decision making and where we put our efforts."
        },
        {
            "text": "But of course, as Peter Drucker once said, ‘Culture eats Strategy for Breakfast’ so we asked our people to tell us the culture they want and this is our guiding compass when we consider how we are doing things and whether we are doing it in a way that supports and reinforces the culture we all want."
        },
        {
            "text": "We are also fortunate that the culture we already have marries up with this very well and this means we are already eating away at our strategy together."
        },
        {
            "text": "So what are the best things about working somewhere with an ambitious, exciting strategy, a focus on our people and making work a great experience for everyone? Our people tell us the top 4 things are:"
        },
        {
            "text": "So if you are looking to be part of something bigger, somewhere looking to connect you with your work, future direction and the people around you. A place that wants broad involvement to get the best solutions and that works openly and honestly to build trust, then why not take a look at our vacancies and help us deliver the MoJ vision of ‘A world class justice system that works for everyone.'"
        }
    ]
}