{
    "url": "https://traderemedies.blog.gov.uk/2022/08/02/trade-remedies-and-climate-change-policy-allies-or-enemies/",
    "title": "Trade remedies and climate change policy – allies or enemies?",
    "authors": [
        "Aproop Bhave, Chief Economist",
        "Joanne Gill, Head of Economics Unit"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-08-02T09:08:19+01:00",
    "content": [
        {
            "text": "Trade remedies and climate change are both topical policy issues. But how do they fit together? Do they pull in the same direction? What might the future look like?  "
        },
        {
            "heading": 2,
            "text": "What are trade remedies?"
        },
        {
            "text": "The UK’s Trade Remedies Authority (TRA) investigates whether trade remedy measures are needed to counteract unfair import practices like dumping or subsidisation and surges in imports. Trade remedies usually take the form of tariffs on imports of certain goods. "
        },
        {
            "text": "Anti-dumping remedies address goods being sold in the UK at prices which are below the normal value in the country they are being exported from, while countervailing remedies address imports of goods that are subsidised by foreign governments. Safeguard remedies protect domestic industries against an unforeseen surge of imports. "
        },
        {
            "text": "The TRA’s ongoing investigations include a number of industrial products manufactured by the UK’s steel, aluminium and glass sectors.   "
        },
        {
            "heading": 2,
            "text": "How does climate change policy play into trade remedies?"
        },
        {
            "text": "Products that frequently have trade remedies applied to them are often manufactured in ways that use a lot of energy and/or produce greenhouse gas emissions. Climate change policies aimed at reducing levels of greenhouse gas emissions do so by increasing the costs of ‘dirty’ production – either directly through policies like cap-and-trade schemes, carbon taxes and regulatory standards, or indirectly through policies to decarbonise energy generation like renewable energy targets and phasing out carbon intensive energy sources. "
        },
        {
            "text": "This means producers around the world face varying production costs due to different climate change policies. In countries where domestic producers have transitioned to less carbon-intensive manufacturing, they might find themselves competing with cheaper, more emissions-intensive, imports from countries that are yet to make this transition. The different costs can therefore affect global competitiveness. Over time, production could relocate to regions with less stringent emissions standards to exploit lower costs. This ‘carbon leakage’ could thwart efforts to reduce global emissions. "
        },
        {
            "heading": 2,
            "text": "What do the rules on trade remedies say?"
        },
        {
            "text": "Neither the WTO Agreements nor UK legislation require authorities to assess the inherent cause of unfair trading practices as part of trade remedy investigations. Nor do they set out whether and how climate change policies should be taken into account in trade remedy investigations. However, the existing framework allows for some ways to do this:  "
        },
        {
            "text": "Globally, there have been a number of high-profile trade remedy investigations into environmental goods like wind towers, solar cells and panels, across jurisdictions including the EU, US and India. Environmental technologies are a developing area, seeing rapid expansion of demand and often characterised by global supply chains. These factors make the potential use of trade remedies contentious, with arguments that developing domestic industries need protection to become cost-competitive over the longer term, countered by arguments that trade remedy measures will increase prices and deter uptake of the green technologies needed to meet climate goals.  "
        },
        {
            "heading": 2,
            "text": "Climate change and trade remedies: what might we see in future?"
        },
        {
            "text": "Climate change is, and will remain, a key priority for policy makers and governments around the world in the years ahead.  "
        },
        {
            "heading": 3,
            "text": "An optimistic outlook"
        },
        {
            "text": "If there were swift progress on coordinated action at future UN Climate Change Conferences of the Parties (COPs), the differentials between climate policy costs faced by producers around the world could be lowered to some extent. For steel, a sector where trade remedies are regularly applied, a few recent developments suggest that some coordinated action could begin to narrow the climate policy cost differential:  "
        },
        {
            "text": "It’s still too early to know what these two developments will achieve. If global coordination proves hard to progress, countries could choose to implement Border Carbon Adjustments (BCAs). These work by taxing the carbon embodied in imported goods, aligning costs domestically by making imports from countries with lower standards more expensive. The precise methodologies used to estimate the amount of embodied emissions will affect the ability of BCAs to align policy costs.  "
        },
        {
            "text": "With sufficient political support and international consensus, it could even be possible in the longer term to integrate and align the multilateral frameworks for international trade under the WTO and climate change under the United Nations Framework Convention on Climate Change (UNFCCC). However, this would require a fundamental overhaul of the existing system.  "
        },
        {
            "text": "In any of these scenarios, international competitors would all face costs of decarbonising their production, so we might not expect climate policy differentials to be a driver of trade remedies investigations.  "
        },
        {
            "heading": 3,
            "text": "A pessimistic outlook"
        },
        {
            "text": "In a more pessimistic scenario however, if further progress could not be achieved in climate negotiations, then trading partners’ climate ambitions and policy efforts could diverge further. This could put more pressure on trade remedies to become the tool that tackles these differentials - something it was not originally designed for. "
        },
        {
            "text": "To the extent that inadequate action increases the risk of adverse climate events, there could be more disruption and shocks to international supply chains for goods. This could potentially lead to applications for safeguards in the face of import surges or requests for interim reviews of existing trade remedy measures in light of volatile and changing circumstances. "
        },
        {
            "text": " "
        },
        {
            "text": "Time will tell how the complex interplay between climate change and trade evolves over the coming years. International trade can be an ally in the fight against climate change, but it needs to be genuinely free and fair; that’s where trade remedies can make a difference. "
        }
    ]
}