{
    "url": "https://deframedia.blog.gov.uk/2022/08/02/uk-governments-action-to-halt-bird-flu-outbreaks/",
    "title": "UK Government’s action to halt bird flu outbreaks",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-08-02T09:19:25+01:00",
    "content": [
        {
            "text": "In recent weeks, there has been widespread coverage including in The Guardian, The Telegraph and BBC News of thousands of wild seabirds dying in a bird flu outbreak on the Farne Islands and Coquet Island off the Northumberland coast and along the north Norfolk coast."
        },
        {
            "text": "The UK’s seabirds are an important part of our natural heritage, and we are committed to protecting them, not least as part of our commitment to leave the environment in a better state for future generations. We recognise the significant threat that bird flu is posing to seabird populations and it is very distressing to see the impact this is having on these vitally important species."
        },
        {
            "text": "Our approach to tackling this year’s bird flu outbreak continues to be led by international best practice and the latest evidence, which suggest that mitigation measures are not very effective in reducing transmission within seabird colonies."
        },
        {
            "text": "However, there are a number of actions we’re taking, including to monitor its impact on seabird species. We will continue to work with stakeholders and consider the latest evidence to assess whether any further action can be taken to protect these important species."
        },
        {
            "text": "Surveillance and testing "
        },
        {
            "text": "To better inform our assessment of the risk posed by bird flu and help us understand how the disease is distributed geographically and in different wild bird species, the Animal and Plant Health Agency operates a robust, year-round programme of surveillance in dead wild birds."
        },
        {
            "text": "During the current outbreak, over 1,400 wild birds have tested positive for bird flu across 347 different locations in 61 species. A report outlining the findings of wild bird surveillance programme is updated weekly and can be found on the GOV.UK website."
        },
        {
            "text": "Research and investigation "
        },
        {
            "text": "Alongside the Government’s continued investment in the National Reference Laboratory and APHA’s Weybridge site, earlier this year we launched an eight-strong consortium that received £1.5 million in funding to develop new strategies to tackle bird flu outbreaks. Our world-leading researchers will help build our understanding in a number of key areas, including why the current virus strains have formed larger and longer outbreaks and understanding transmission and infection in different bird populations."
        },
        {
            "text": "In addition to the existing Joint Nature Conservation Committee’s Seabird Monitoring Programme, Natural England has set up a seabird reporting system to collect data on seabird mortality at key sites. This will be used to assess the impact on populations and inform recovery programmes. Equivalent systems have been established in Wales and Scotland, enabling data to be readily compared across the administrations."
        },
        {
            "text": "Defra has commissioned Natural England to assess the vulnerability of seabird species in light of the pressures they are facing, including avian influenza, and propose actions to address them."
        },
        {
            "text": "Removal and disposal "
        },
        {
            "text": "Generally, we do not recommend that wild bird carcases are removed. There is limited evidence to indicate whether the removal of carcases reduces transmission risk within seabird colonies, given the significant levels of environmental contamination that will remain in the area where carcases have been removed. Removal in these areas should be assessed by land managers on a case-by-case basis with site accessibility and the health protection of those involved in the removal of carcases being a significant consideration in whether to proceed with removal."
        },
        {
            "text": "Where dead birds are not required for surveillance purposes, and if a decision is taken to remove dead wild birds, it is the landowner’s responsibility to arrange safe disposal of the carcases. Landowners are responsible for any costs associated with the removal and disposal of dead wild birds. Where dead birds are on public land, it is the local authority’s responsibility to arrange disposal of the carcases."
        },
        {
            "text": "Guidance on the disposal of wild birds has been developed, in conjunction with the UK Health Security Agency and has been made available to local authorities and NGOs."
        },
        {
            "text": "The public are encouraged to report findings of a single bird of prey; three or more dead wild waterfowl and gulls; or five or more dead birds of any species, to the Defra helpline on 03459 335 577. However, they should not touch or pick up any dead or visibly sick birds."
        },
        {
            "text": "A Defra group spokesperson said:"
        }
    ]
}