{
    "url": "https://nationalscreening.blog.gov.uk/2024/07/18/annual-report-highlights-examples-of-uk-nscs-evolution-and-innovation/",
    "title": "Annual report highlights examples of UK NSC’s evolution and innovation",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-07-18T13:42:38+01:00",
    "content": [
        {
            "text": "Today we have published the UK National Screening Committee’s (UK NSC’s) latest annual report, summarising the committee’s work and achievements during the year 1 April 2023 to 31 March 2024."
        },
        {
            "text": "All those achievements were made possible thanks to the expertise and hard work of UK NSC and expert group members, our NHS colleagues across the 4 nations, the secretariat in the Department of Health and Social Care (DHSC) and many other stakeholders."
        },
        {
            "text": "The annual report highlights examples of how the committee is evolving and innovating to meet the challenge of a seemingly exponential growth in technologies, such as genomics and artificial intelligence (AI), and the growing number of new screening proposals it receives under its expanded remit."
        },
        {
            "text": "These examples include the promotion of research into the use of AI in breast screening, expert advice provided by the research and methodology group, the blood spot task group’s workstreams, and the growing importance of in-service evaluations in real world NHS services in providing evidence on the feasibility and effectiveness of screening."
        },
        {
            "text": "During the year, the UK NSC made a positive recommendation to approve the use of digital pathology as an alternative to light microscopy for the review of cancer screening histopathology slides. This recommendation has been endorsed by the English and Scottish governments, and is being considered by the governments in Wales and Northern Ireland, so that it can be implemented by the NHS."
        },
        {
            "text": "Following a public consultation, the committee also recommended modifying the offer of antenatal screening for Edwards’ syndrome (Trisomy 18 or T18) as part of the fetal anomaly screening programme in the 4 nations. This modification, if endorsed by ministers, would mean that pregnant women who miss the combined test could in future be offered the quadruple test to screen for Edwards’ syndrome in the second trimester of pregnancy."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}