{
    "url": "https://mhclgmedia.blog.gov.uk/2024/07/18/coverage-of-announcements-in-the-kings-speech/",
    "title": "Coverage of announcements in the King’s Speech",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Communities",
        "Devolution",
        "Elections",
        "Housing",
        "Local government",
        "Planning"
    ],
    "pub_date": "2024-07-18T14:57:44+01:00",
    "content": [
        {
            "text": "There has been significant coverage of the King’s Speech today, with many outlets reporting prominently on legislation which will be brought forward by the Ministry of Housing, Communities and Local Government."
        },
        {
            "text": "Following the Chancellor’s speech last week to grasp the nettle of planning reform and get Britain building again, the Planning and Infrastructure Bill will be introduced to speed up housebuilding and fast-track the delivery of major infrastructure to take the brakes off economic growth. This will include modernising planning committees, changing compensation rules for compulsory purchase orders, increasing local authorities’ capacity, and using development to fund nature recovery where both are currently stalled. Today’s front pages in The Guardian and The Financial Times lead on planning reforms saying new measures in the Bill will unlock economic growth, The Daily Telegraph focus on the Government’s plans to toughen up rules on compulsory purchase orders by making them “fair but not excessive”, and BBC News reports that the Bill will turbocharge building of houses and infrastructure."
        },
        {
            "text": "Our Renters’ Rights Bill will ban Section 21 evictions with immediate effect and takes decisive action to prevent private renters being exploited and discriminated against. It will also extend Awaab’s Law to the private rented sector, empowering millions of renters to raise concerns about damp, dangerous and cold homes and landlords must take swift action to fix homes that are unsafe. A quote from the Deputy Prime Minister in the Manchester Evening News pays tribute to the paper and the Ishak family for their campaigning, and says that the “avoidable death of Awaab Ishak sent shockwaves across the country and must never be allowed to happen again\". The Bill’s inclusion in the King’s Speech was also featured in The Independent, The Evening Standard and The i paper, highlighting its steadfast commitment to protecting millions renters and creating a fairer rental market for all."
        },
        {
            "text": "The government will bring the feudal leasehold system to an end with the Leasehold and Commonhold Reform Bill. This will make Commonhold the default tenure for new flats, tackling ground rents, reforming the egregious practice of forfeiture and ending the ‘fleecehold’ scandal. Our ambitious package of reforms will give homeowners security into the future, and support the creation of a housing sector for modern Britain. The inclusion of the draft Bill in the King’s Speech was met with a positive response, with The i reporting the government had ‘made good on their promise’ to implement reforms. There has been further coverage in City AM, the Manchester Evening News, The Independent and Inverness Courier, while a piece from Inside Housing carries supportive comments from Harry Scoffin, founder of the campaign group Free Leaseholders, who said that this is a “fantastic moment for leaseholders”."
        },
        {
            "text": "Plans to widen and deepen devolution across England were cemented in a new and ambitious English Devolution Bill, which will transfer more power out of Westminster and into the hands of local people. This has seen widespread positive coverage, with reports highlighting the Bill’s important role in boosting regional growth – giving local leaders new powers over areas like transport, skills training and employment support and housing and planning. The Guardian, Financial Times, Sky News, Reuters, BBC News, Bloomberg, The Independent and Western Daily Press, all positively highlight the Bill in their wider reporting of the King’s Speech."
        },
        {
            "text": "The Holocaust Memorial Bill, which will update a Victorian piece of legislation which limits building on Victoria Tower Gardens, has been reintroduced to Parliament reaffirming the new Government’s commitment to delivering the project. A press notice from MHCLG included comments from the Deputy Prime Minister, Karen Pollock, Chief Executive of the Holocaust Educational Trust and the Chief Rabbi, Sir Ephraim Mirvis which have been carried in the coverage so far. The  BBC, Standard, Jewish Chronicle and Jewish News all reported on the reintroduction of the Bill to parliament."
        },
        {
            "text": "Getting more people involved in the UK’s democratic process is a key priority of this government, as is strengthening the integrity of the country’s elections from outside interference. To achieve this, the government will legislate in the future to give 16- and 17-year-olds the right to vote, review voter ID rules to evaluate how they have impacted citizens and tighten rules around donations to political parties."
        }
    ]
}