{
    "url": "https://naturalengland.blog.gov.uk/2024/07/18/delivering-for-nature-and-the-economy/",
    "title": "Delivering for nature and the economy",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Development",
        "Nature-based solutions",
        "Nutrient Neutrality"
    ],
    "pub_date": "2024-07-18T10:29:06+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Home builders in the Poole Harbour catchment area can apply for Nutrient Credits from 31 July."
        },
        {
            "text": "Natural England is playing its part in getting Britain building by enabling sustainable growth and safeguarding our rivers, lakes and seas. One way we do this is by putting in place strategic solutions that enable developers to swiftly and simply meet their environmental obligations through buying credits that fund environment improvement. So far, our Nutrient Mitigation Scheme has offered credits to build 4,730 homes to date by creating 260 hectares of new habitat, also contributing to nature recovery.  "
        },
        {
            "text": "We are pleased to announce from 31 July 2024, you can apply to Natural England for nutrient credits in Poole Harbour. This is an opportunity for developers of any size who have submitted a planning application for a permanent residential development in the Poole Harbour catchment area."
        },
        {
            "text": "The application round opens at 10:00 on 31 July 2024 and closes at 23:55 on 27 August 2024. A single credit costs £3,250, which is based on the cost of securing and selling mitigation solutions."
        },
        {
            "text": "One nutrient credit from Natural England mitigates 1 kilogram (kg) of nitrogen pollution. Therefore, buying the required number of credits is one way for you to meet the nutrient neutrality requirements within the planning process."
        },
        {
            "text": "Nutrient neutrality helps protect Poole Harbour and its internationally important wildlife, like the spoonbill, right, from additional nutrient pollution."
        },
        {
            "text": "There are a few steps to complete your purchase of nutrient credits, depending on where you are in the planning process."
        },
        {
            "text": "If you are yet to secure your planning permission and your nutrient credit application is successful, we aim to provide your provisional nutrient credit certificate within six weeks of the application closing date."
        },
        {
            "text": "This will help you towards securing planning permission as it shows you have a solution to meet the required nutrient mitigation. Once full planning permission is secured, get in touch to complete the steps for your final nutrient credit certificate."
        },
        {
            "text": "If you have full planning permission, subject to obtaining nutrient mitigation, and hear from us that your nutrient credit application is successful you can pay the full credit amount. This option, to make one payment, means you can get your full nutrient credit certificate from as little as 10 weeks."
        },
        {
            "text": "More information is available on Nutrient Neutrality and Mitigation: A summary guide and frequently asked questions."
        },
        {
            "text": "The full process including step-by-step guidance and application form is available at GOV.UK."
        },
        {
            "text": "If you are unsuccessful or not able to apply this time, we are looking to launch again in December 2024."
        },
        {
            "text": "If you have any further questions, please read our guidance page, previous blog or contact us at nutrientmitigation@naturalengland.org.uk."
        }
    ]
}