{
    "url": "https://educationhub.blog.gov.uk/2024/07/18/the-kings-speech-2024-what-does-it-mean-for-education/",
    "title": "The King’s Speech 2024: What does it mean for education?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "Skills"
    ],
    "pub_date": "2024-07-18T09:24:55+01:00",
    "content": [
        {
            "text": "During the State Opening of Parliament on Wednesday 17 July, the King set out the government’s priorities for the coming months."
        },
        {
            "text": "This included commitments relating to education, including children’s social care, schools, and further education."
        },
        {
            "text": "Together, these important changes will help to break down barriers to opportunity, and drive high and rising standards in schools, to create better life chances for everyone."
        },
        {
            "text": "Here, we explain what the King’s Speech means for young people, parents and the education sector."
        },
        {
            "text": "You can read more about the King’s Speech and how it works on Gov.uk."
        },
        {
            "heading": 3,
            "text": "What was announced for education?"
        },
        {
            "text": "A Children’s Wellbeing Bill and a Skills England Bill were announced in the King’s Speech."
        },
        {
            "text": "A bill is a proposed law which is introduced into Parliament. After being debated, passed through Parliament, and receiving Royal Assent, it becomes law."
        },
        {
            "heading": 3,
            "text": "What is included in the Children’s Wellbeing Bill?"
        },
        {
            "text": "The Children’s Wellbeing Bill will put children and their wellbeing at the centre of the education and children’s social care systems, and make changes to ensure children are safe, healthy, happy and treated fairly."
        },
        {
            "text": "There are a range of changes which the government will aim to pass through the bill, to remove barriers to opportunity and make sure that the school system is fair for every child, no matter their background."
        },
        {
            "text": "These include, but are not limited to:"
        },
        {
            "heading": 3,
            "text": "What is included in the Skills England Bill?"
        },
        {
            "text": "Skills England will bring together businesses, providers, unions and other bodies to try to boost skills training and tackle skills shortages to support sustained economic growth."
        },
        {
            "text": "A Skills England Bill will work towards this, simplifying the skills system by transferring responsibilities from the Institute for Apprenticeships and Technical Education (IfATE) to a new Skills England organisation, to make skills sector more efficient."
        },
        {
            "heading": 3,
            "text": "When will the education bills be introduced?"
        },
        {
            "text": "Before becoming law, the education bills will be debated by Parliament."
        },
        {
            "text": "Both bills are planned to be introduced in the first session of Parliament."
        },
        {
            "text": "You can read more about how a bill becomes law on Gov.uk."
        }
    ]
}