{
    "url": "https://insideDIO.blog.gov.uk/2024/06/05/map-used-by-eisenhower-to-plot-d-day-is-still-preserved-by-dio/",
    "title": "D-Day Map used by Eisenhower is still preserved by DIO",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "D-Day 80"
    ],
    "pub_date": "2024-06-05T11:34:21+00:00",
    "content": [
        {
            "text": "In June 1944, the official order to launch the Normandy Landings was made from a small room in an Officers’ Mess. That room, and the history it holds, is cared for by the Defence Infrastructure Organisation (DIO) as part of our commitment to preserving the history and heritage of our Armed Forces.  "
        },
        {
            "text": "Grade II-listed Southwick House, in Portsmouth, was at the heart of preparations for D-Day, and became the headquarters for the main Allied Commanders, led by General Eisenhower. "
        },
        {
            "text": "Much of this work was carried out in a single room, known as the Map Room, getting its name from a huge map of southern England and west coast of Europe, including Normandy. Each of the landing beaches, now committed to memory for many of us, was highlighted on the map as well as the routes for Royal Navy ships to pass through after underwater mines had been cleared.  "
        },
        {
            "text": "Also preserved with the map are the meteorological reports, provided by Group Captain James Stagg, that were used to inform exactly when D-Day would happen. As early June had been hit with bad weather, the Germans were confident there would not be an invasion until later in the month, but when the reports showed a small break in the weather overnight on 5 June, the Allied Commanders took the opportunity to launch the invasion.  "
        },
        {
            "text": "DIO’s Senior Archaeologist, Richard Osgood, said: "
        },
        {
            "text": "“This map gave the Allied Commanders a broad view of exactly what was going to happen on D-Day. It gave Eisenhower, in his role of Supreme Commander of the Allied Forces, the knowledge and the confidence to give the word to launch the invasion. "
        },
        {
            "text": "“D-Day was a massive event, it changed history. And all of it was meticulously planned on this very map. That’s how important this map truly was, and still is today.”"
        },
        {
            "text": "The map itself was shrouded in secrecy, with decoy maps depicting the entire west coast of Europe also made to confuse the Axis Forces if it got into the wrong hands. There was so much secrecy around it, that when it was delivered, staff from the manufacturing company were not allowed to return home, over fears the target for the Allied invasion got out.  "
        },
        {
            "text": "While you may think the creation of the map involved countless experts in cartography, it was actually constructed by toy manufacturer, Chad Valley. During the War Years, the company had moved from toymaking to producing equipment to support the war effort, such as cases for the barrels of anti-aircraft guns, hospital beds and electrical coils. "
        },
        {
            "text": "Richard added:  "
        },
        {
            "text": "“DIO has a huge portfolio of military history among all our work in archaeology and the protected buildings we care for. We’ve got to make sure the building itself is in good condition, but also any artefacts inside such as this one. We take these responsibilities incredibly seriously.  "
        },
        {
            "text": "“I do think this map, in particular, is one of the most important artefacts we own, and it’s vital that we continue our work to protect this piece of the nation’s heritage.” "
        },
        {
            "text": "Ultimately, this map allowed the Allied Command to have a physical snapshot of how D-Day itself would play out. It is believed to have been a vital part of the success of D-Day, and ultimately, the Allied liberation of Europe. "
        }
    ]
}