{
    "url": "https://dwpdigital.blog.gov.uk/2021/06/08/a-year-of-shared-channels-experience-our-path-to-truly-user-centred-services/",
    "title": "A year of Shared Channels Experience: our path to truly user-centred services",
    "authors": [
        "Cheryl Stevens, Director, Shared Channels Experience"
    ],
    "categories": [
        "DWP Digital Strategy",
        "Shared Channels Experience"
    ],
    "pub_date": "2021-06-08T16:32:12+01:00",
    "content": [
        {
            "text": "Shared Channels Experience (SCE) was established around a year ago, in the midst of the first lockdown, as part of our ambition to create truly user-centred services. The goal for our team is to really understand our users’ needs, so that we can deliver solutions to meet those needs. I think it’s fair to say that it’s been a challenging first year, but there’s been a lot of positives as well."
        },
        {
            "text": "We recently held an internal event for SCE team to mark the first anniversary of us coming together. It was great to reflect on some of the fantastic achievements we’ve made over the last 12 months, and also to look ahead with our objectives and ambitions for the future."
        },
        {
            "text": "We were even able to recognise the fantastic achievements of our team with an awards ceremony – and I was delighted to receive a special award for setting up a new directorate from your bedroom during a global pandemic in your slippers! Not many people can claim to have been recognised in that category!"
        },
        {
            "heading": 2,
            "text": "Reflecting on the last year"
        },
        {
            "text": "Looking back on the last year gave us an opportunity to remember just what we’ve achieved in a short period of time. Some of the highlights for me include working across government to set up the shielding service, accelerating the introduction of Confirm Your Identity for Universal Credit claimants and enabling over 30,000 colleagues to work from home using softphones."
        },
        {
            "text": "Our transformation journey has continued at pace throughout this period, with the DWP Notifications Service established and the development of the Customer Notifications Management Platform. We have worked across DWP and beyond, working with GDS on the new future identity service and Notify, progressing user and colleague experience and establishing SCE as the custodian of user experience - all whilst keeping our live services running."
        },
        {
            "text": "For me, it was just as important that we did all of this while establishing SCE as a positive place to work. Wellbeing is something we all genuinely care about, and we’ve tried to embed that in everything we do. We host regular wellbeing sessions and aim to make everyone on the team feel connected. DWP Digital has been shortlisted for a national CIPR (Chartered Institute of Public Relations) award under the 'Best Staff Wellbeing Initiative' award category which is brilliant news, especially as we are up against tough competition."
        },
        {
            "heading": 2,
            "text": "Our aims as we move forward"
        },
        {
            "text": "Looking ahead, and with the department recently sharing our goals for the next year, I think it’s important to look at how we want to build on these foundations. The strategy for DWP as a whole is powered by the work of DWP Digital, and the objectives and ambitions of SCE feed directly into that."
        },
        {
            "text": "The Digital strategy paves the way for a modernised service delivery, where we put users and their needs at the heart of our work – getting them the support they need based on their whole situation, and moving away from our product silos."
        },
        {
            "text": "Why is this so important? 33% of our users claim more than one benefit from us, but the platforms they use to access those different benefits might all look different. This adds uncertainty and complexity for the user, which leads to calls into the department from people looking for guidance and assurances about their claims. We need consistency across our services to reassure users and to create simpler experiences, as ultimately it will help us to reduce the amount of unnecessary queries we receive."
        },
        {
            "text": "Just one example on the difference this could make is that we currently receive around 800,000 calls a year about a change of address or change of bank details. If we were able to reduce that so that most people can update their details without any intervention, and do it once across their benefits, the amount of time saved would be significant – for us and our users."
        },
        {
            "text": "We have a number of channels that all operate well but separately and joining them up through data and technology enables a shared channels experience and the ability to seamlessly move between channels where that is beneficial for the user."
        },
        {
            "heading": 2,
            "text": "Our four objectives"
        },
        {
            "text": "So, how can SCE help with that overall aim for a joined-up user experience, across all channels? We have our own objectives; four key things that we’re looking to achieve that will help deliver the overall goal for our department."
        },
        {
            "text": "First of all, enabling users to interact with us through new and existing channels appropriate to their circumstances, and delivering tailored services to improve our user experience. So for example, using next generation contact centres to improve user experiences and reduce operational costs. Or, bringing in video as a new channel alongside chat-bots and web-bots to help users, developing a DWP text SMS service, and measuring user experience so we can understand it and share insights across the department."
        },
        {
            "text": "Second, enabling a detailed view of the user, particularly for colleagues to help them do their job. We need to really look at where our colleagues and users require that end to end view, and use our content management system and notifications platform to meet those needs. It’s about giving colleagues the best view of our users to better serve their needs, and giving users more self-serve opportunities where appropriate."
        },
        {
            "text": "Our third objective is about moving towards prevention, whilst enabling secure self-service, straight-through processing and automation for our users. By improving remote identification across all channels, we can improve the user experience and improve security by reducing the reliance on less robust solutions."
        },
        {
            "text": "Our final objective alongside these is to make SCE a great place to work. Whilst what we do really matters, we want everyone on the team to feel that they really matter too. We will continue with our activity to help support and lift our colleagues with a focus on wellbeing and inclusion."
        },
        {
            "text": "Ultimately, these goals should all feed into the wider objectives of DWP Digital, and DWP as a whole. It’s been a great first 12 months for SCE, but we need to make sure that the next year is even better."
        }
    ]
}