{
    "url": "https://dataingovernment.blog.gov.uk/2021/06/08/accelerating-data-visualisation/",
    "title": "Accelerating public sector data science and visualisation",
    "authors": [
        "Sophie Nelson - Programme Officer, Office for National Statistics"
    ],
    "categories": [
        "Data science",
        "Data Science Accelerator",
        "Data Visualisation",
        "People and Skills"
    ],
    "pub_date": "2021-06-08T12:30:45+01:00",
    "content": [
        {
            "text": "\nThe Data Science Accelerator programme has been providing analysts with the opportunity to develop their data science skills through dedicated mentoring, time and access to technology since 2015. "
        },
        {
            "text": "Over 250 data science projects have been completed, and recently we’ve seen an increasing demand for mentoring on data visualisation projects. And in response, the Office for National Statistics (ONS) Data Science Campus and the Analysis Function have partnered to deliver a data visualisation branch of the Accelerator, a deliverable of the Government Data Science Partnership."
        },
        {
            "text": "Skevi Pericleous, Head of Analytical Learning and Development for the Analysis Function, and Paul Littler, Head of Data Science Capability for the Data Science Campus, explain:"
        },
        {
            "text": "“The Analysis Function is committed to providing development opportunities to support all analysts and the ONS Data Science Campus has been dedicated to building data science capability for public good. We are excited to create a partnership to deliver the new data visualisation category of the Accelerator and to increase the data visualisation capability of the government.”"
        },
        {
            "heading": 2,
            "text": "Important information for applicants"
        },
        {
            "text": "On Thursday 14 June, applications open and participants can propose to work on a data science or data visualisation project for one day a week over 3 months. They will have the support of an experienced data science or data visualisation mentor throughout this time and the opportunity to experiment with different data science and visualisation techniques and open source software.\n\nSuccessful applicants will also have access to the ONS Learning Hub to complete analytical and data science courses provided by the Analysis Function and the ONS Data Science Campus to support them with their project work. "
        },
        {
            "text": "The Accelerator is open to all UK public sector staff, including central and local government. Depending on the level of interest for the data visualisation branch, we may need to prioritise analysts in the first instance. \n\nIf you are looking to build your data visualisation skills through applied learning, you should consider these techniques used to approach projects:"
        },
        {
            "heading": 2,
            "text": "Register for the project clinic"
        },
        {
            "text": "A project clinic will be hosted by experienced mentors and the programme delivery team on Thursday 17 June. After an introduction to both branches of the Accelerator, the panel will provide general guidance on how to decide if the programme is right for you, develop an idea for your project and write a good proposal."
        },
        {
            "text": "If you want to register for the clinic, or would like the information that will be shared with attendees, please email the team."
        }
    ]
}