{
    "url": "https://deframedia.blog.gov.uk/2021/06/08/government-marks-world-ocean-day-with-marine-commitments/",
    "title": "Government marks World Ocean Day with marine commitments",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "marine"
    ],
    "pub_date": "2021-06-08T13:25:47+01:00",
    "content": [
        {
            "text": "To mark World Ocean Day, today (8th June 2021), the UK government has set out its marine commitments as it advances its role as a global leader in marine protection both domestically and internationally."
        },
        {
            "text": "The announcement included plans to increase protections for England’s waters through a pilot scheme to designate marine sites in England as “Highly Protected Marine Areas”. This received coverage across national titles such as I News, The Sun, Politics Home and Daily Telegraph; regional titles such as the Yorkshire Post and international titles such as Mirage News."
        },
        {
            "text": "Secretary of State George Eustice appeared on Sky News, Times Radio, LBC, Today programme, Good Morning Britain and BBC Radio 5 Live this morning discussing the UK’s international role – outlining during several interviews the significance of World Ocean Day and the government’s plans to pilot Highly Protected Marine Areas (HPMAs)."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "Plans to launch pilot HPMAs, which would see a ban on all activities that could have a damaging effect on wildlife or marine habitats in selected sites, follow the independent Benyon Review. The review recommended that Highly Protected Marine Areas would have an important role in helping the marine ecosystem recover. The government has today published its response to the review, including plans to assess other potential benefits of HPMAs, including increased tourism."
        },
        {
            "text": "The government also celebrates that 80 countries have now signed up to an international target to protect at least 30 per cent of the world’s ocean by 2030 which is being championed by the UK-led Global Ocean Alliance."
        },
        {
            "text": "Today, with the Ocean Conservation Trust, the UK government also published the results of the largest ocean literacy survey undertaken to date to measure public awareness, attitudes, knowledge and behaviours related to the marine environment and pressures on it."
        },
        {
            "text": "The survey underlines the important link between the health of our ocean and the multiple pressures on it - with 94% of people believing that the fate of the ocean and humans is inextricably linked and 85% of people stating that marine protection is personally important to them."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "The UK government also highlighted its global efforts today as the UK steps up as a co-leader of The International Partnership on Marine Protected Areas, Biodiversity and Climate Change and by moving to full membership of the Ocean Risk and Resilience Action Alliance (ORRAA). All of which come ahead of the G7 Summit taking place in Cornwall this week and international climate conference COP26, to be hosted in Glasgow later this year."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}