{
    "url": "https://stratcommand.blog.gov.uk/2021/06/08/mods-universal-soldier/",
    "title": "MOD’s Universal Soldier",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "Innovation",
        "Science",
        "Technology"
    ],
    "pub_date": "2021-06-08T09:14:13+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Move over Van Damme, the MOD looks at the realities of Human Augmentation in a new paper."
        },
        {
            "heading": 4,
            "text": "It’s all very 2000 AD "
        },
        {
            "text": "At the start of the millennium, the year 2000, a video game company called Edios Interactive released an action role-playing game called “Deus Ex”. The game imagined the dystopian future of 2052 in which humankind’s capabilities could be enhanced through nanotechnology, pushing the boundaries of what a person could ordinarily do."
        },
        {
            "text": "Two decades later, another video game company, CD Projekt Red, released one of the most highly-anticipated games of all time: “Cyberpunk 2077”. Like Deus Ex, the game imagined a world only 50 years from now in which nearly all of humankind has embraced the enhancement capabilities of merging the human with the machine, also known as Human Augmentation."
        },
        {
            "text": "For a long time this was the stuff of science fiction and video games, but Human Augmentation is a topic which is equally both fascinating and terrifying. This is mainly because it presents both an incredible opportunity, but also a Stark danger."
        },
        {
            "heading": 4,
            "text": "A fitbit in your brain"
        },
        {
            "text": "Iron Man suits aside, the ability to enhance a person’s abilities, both mentally and physically, present us with the vision of an incredible future. In that future we’ll be able to think and act faster, compute and exploit massive amounts of data with ease, and command physical force many times greater than even the world’s strongest people."
        },
        {
            "text": "Someone already trying to make that future happen is the entrepreneur Elon Musk. If he’s to be believed then the benefits of Human Augmentation are huge.  He’s publicly stated he believes that computer chips implanted into the human brain could one day be used to help cure conditions such as Parkinson’s or Dementia."
        },
        {
            "text": "That future might sound far-fetched, but Musk’s company Neuralink is actively pursuing the realities of cognition boosting computer chips implanted directly into the brain, and in August 2020 they unveiled a live working protype. A pig named Gertrude had a chip approximately the size of a coin implanted directly into her brain which was used to monitor her neural activity. More recently, Neuralink released a 3 minute video of a macaque called Pager playing the classic game Pong against its own mind via their technology."
        },
        {
            "text": "It was also announced that Musk’s company are already preparing for their first human trials."
        },
        {
            "heading": 4,
            "text": "Robotic Guardians?"
        },
        {
            "text": "Human Augmentation is not just about computer-enhanced brainpower though, the body’s physical functions can also be directly improved by machinery. The American company Sarcos Robotics, previously part of the defence giant Raytheon, has worked closely with the American military for many years on the development of powered exoskeletons."
        },
        {
            "text": "In 2019 they demonstrated their latest achievement, the Guardian XO, a strength-multiplying exoskeleton which allows its operator to lift 90 kilograms but feel as if they are only lifting 4.5 kilograms. The system is fully electric and untethered, allowing the user to move about freely for the 2 hours a battery will last."
        },
        {
            "text": "This technology presents an incredible opportunity for the industrial sector; allowing workers to perform tasks that presently require many people, or the operation of forklifts and cranes, to complete. But the military’s involvement in development of such technologies also highlights the potential dangers of such advancements."
        },
        {
            "heading": 4,
            "text": "The greater the tech, the greater the danger"
        },
        {
            "text": "For every new technology, there is the capability to use it in warfare. Indeed, some the greatest technological developments were often made as a necessity of war, or in one nation’s efforts to outpace their opponents. The Cold War’s Space Race is great example of this."
        },
        {
            "text": "Human Augmentation is no different. The strategic advantage of having soldiers who can think and act faster than their opponents, or can command a strength that exceeds that of an entire opposing squad, is a very attractive idea when it comes to winning battles."
        },
        {
            "text": "And if you were to believe that countries are not already exploring the warfighting capabilities of these technologies then you would be gravely mistaken. For example, the French military recently publicly announced their intention to start research on developing “enhanced soldiers”."
        },
        {
            "text": "The French Defence Minister Florence Parly stated in a speech on the subject that: “We must face facts…Not everyone shares our scruples and we must be prepared for whatever the future holds”."
        },
        {
            "heading": 4,
            "text": "The risk of being left behind"
        },
        {
            "text": "Being prepared for the future is exactly why Britain needs to understand both the risks and the rewards of Human Augmentation. To not do so would place us at an enormous disadvantage against our adversaries. This is something which Defence already understands all too well, but in another area of warfare: the Cyber Domain."
        },
        {
            "text": "The exponential advancement of computer technology changed warfare forever. For each new piece of hardware or software developed, there becomes a new way to seek to exploit it for a military advantage. British Defence is currently working hard to make sure that we can use technologies such as Machine Learning and Artificial Intelligence (AI), and to properly exploit sources of data to create and maintain a military advantage."
        },
        {
            "text": "Why? Because other nations are already doing so. By their nature, cyber-attacks are difficult to pin onto a specific actor, something called attribution, but in recent years cyber-attacks attributed to countries such as Iran and Russia have been reported in the media.  Most recently, the Solar Winds hacks of a number of US government departments, uncovered in late 2020, has been attributed by US security agencies to APT29, a division of the Russian Foreign Intelligence Service."
        },
        {
            "text": "So what does this have to do with Human Augmentation? Well, whilst cyber warfare and Human Augmentation are different, the idea is the same: those that can use this technology have the advantage over those that cannot or will not. Britain is already working hard to make sure we keep up with our adversaries in Cyber, and it could be even more dangerous if we get left behind in Human Augmentation technology."
        },
        {
            "heading": 4,
            "text": "A future of cyborg soldiers? "
        },
        {
            "text": "Like the French, Britain seeks to both understand and prepare for the dangers that Human Augmentation could pose. Strategic Command’s Development, Concepts and Doctrine Centre have published a paper titled Human Augmentation - The Dawn of a New Paradigm which seeks to explore the potential of these technologies and to ensure that Defence’s leaders are prepared for the changes that they will bring."
        },
        {
            "text": "So do you still believe that, 50 years from now, Cyberpunk 2077’s vision of a future of mechanically-enhanced soldiers with computer-assisted vision or blades embedded in their arms is just a videogame fantasy?"
        },
        {
            "text": "Just remember that 50 years ago, in 1971, the most powerful computers took up entire rooms. Now, a pig named Gertrude has one implanted into her brain, with enough processing power to make those computers look obsolete."
        }
    ]
}