{
    "url": "https://educationinspection.blog.gov.uk/2021/06/08/our-inspections-of-professional-development-for-teachers-what-to-expect/",
    "title": "Our inspections of professional development for teachers – what to expect",
    "authors": [
        "Helen Matthews, Senior HMI for Teacher Development"
    ],
    "categories": [
        "CPD",
        "professional development",
        "teachers"
    ],
    "pub_date": "2021-06-08T13:35:11+01:00",
    "content": [
        {
            "text": "Helen Matthews, our Specialist Adviser, Initial Teacher Education, explains Ofsted’s role in quality assuring national professional qualifications and the early career framework."
        },
        {
            "text": "It’s been a tough year for everyone in education. The pandemic has tested everyone’s resilience in so many ways, and the challenges of COVID-19 have emphasised just how invaluable good, well-trained teachers are to our education system recovery."
        },
        {
            "text": "Earlier this year, the Department for Education (DfE) announced the roll-out of the early career framework (ECF) and a suite of reformed national professional qualifications (NPQs) for teachers and school leaders, available from autumn this year. As part of this, the DfE also confirmed that lead providers delivering the ECF and NPQs would be inspected by Ofsted, to make sure schools and teachers are getting the best possible support."
        },
        {
            "heading": 3,
            "text": "How it will work"
        },
        {
            "text": "We’re developing a framework for inspecting the delivery of ECF and NPQ training and will announce more details in autumn 2021. It will be aligned with our EIF and ITE inspection frameworks, and we’ll be talking to stakeholders as we develop our approach. We expect inspections to begin in spring 2022."
        },
        {
            "text": "We will only inspect DfE-funded lead providers delivering the ECF and NPQ training programmes. However, we’ll also be engaging with teachers on the programmes, mentors, and a sample of delivery partners (for example, multi-academy trusts and teaching schools hubs) to help inform our assessment of a lead provider."
        },
        {
            "heading": 3,
            "text": "A force for improvement"
        },
        {
            "text": "As an organisation, we are committed to being a force for improvement in education. Quality assuring the delivery of the ECF and NPQs builds on our existing role inspecting initial teacher education and will give us oversight of teacher development for trainee, newly qualified and established teachers."
        },
        {
            "text": "We support the ambition to improve training and development opportunities for qualified teachers, making teaching an attractive career that recruits and retains the best professionals. High-quality continuous professional development is good for school leaders and teachers. But most importantly, it’s good for pupils. And as everyone works hard to get children back on track, this couldn’t be more important."
        }
    ]
}