{
    "url": "https://marinescience.blog.gov.uk/2021/06/08/the-blue-belt-programme-looking-back-on-2020-2021/",
    "title": "The Blue Belt Programme: looking back on 2020/2021",
    "authors": [
        "Kylie Bamford"
    ],
    "categories": [
        "Climate Change",
        "International",
        "Policy",
        "Science",
        "Technology",
        "Vulnerable species"
    ],
    "pub_date": "2021-06-08T05:45:20+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Kylie Bamford, Head of Marine Conservation for the UK Overseas Territories, Foreign, Commonwealth and Development Office:"
        },
        {
            "text": "The Blue Belt Programme supports delivery of the UK government’s commitment to provide long term protection and sustainable management of marine environments across the UK Overseas Territories."
        },
        {
            "text": "Now into its fifth year, we’ve just published the new Blue Belt Programme Annual Update for 2020/2021, outlining the key achievements of the programme from across the last 12 months."
        },
        {
            "text": "The last year was a landmark one for this unique programme. The announcement of Tristan da Cunha’s new Marine Protection Zone (MPZ) brought the programme over its target of protecting four million square kilometres of ocean. While this milestone target has been achieved, there is still much more to do to ensure the protection of these diverse environments, and so the programme will continue to work to build on this success during the coming year."
        },
        {
            "text": "The marine environments across each of the Overseas Territories that make up the programme are some of the most biologically unique and important on Earth. From the elephant seals and penguins of South Georgia to the butterfly fish and whale sharks of St Helena, these incredible ecosystems need our protection."
        },
        {
            "text": "The Blue Belt Programme aims to do this by working across five key themes:"
        },
        {
            "text": "To mark the publication of our latest Annual Update, we wanted to share and celebrate some of the recent work of the programme, and ultimately our UK Overseas Territories partners. The Territories have been central and driven the work of the programme since its creation in 2016, and their commitment and determination continue to underpin the programme’s success."
        },
        {
            "text": "Looking back on the highlights from 2020/2021"
        },
        {
            "text": "The UK Overseas Territories that make up the Blue Belt Programme are: Ascension Island, St. Helena and Tristan da Cunha, British Antarctic Territory, British Indian Ocean Territory, Pitcairn Islands, and South Georgia & the South Sandwich Islands. Across the last year, each have achieved significant milestones and progress."
        },
        {
            "text": "On Ascension Island, the Government, Island Council and Fisheries and Conservation Department led the development and implementation of new management and monitoring strategies for their Marine Protected Area, significantly strengthening governance. Approved in February 2020, the Blue Belt Programme assisted them with advice and acted as a sounding board on the management plan, research and monitoring plan and financial plan."
        },
        {
            "text": "On St Helena, a new laboratory – funded by the programme – to enable safe and effective marine science studies is currently under construction. Opening in late 2021, the lab will also include a new interactive interpretation board to provide information on St Helena’s unique marine environment."
        },
        {
            "text": "Tristan da Cunha made global news with the designation of the largest Marine Protection Zone in the Atlantic. The designated no-take zone encompasses over 90% of its waters, where fishing and other extractive activities are now banned. The programme worked closely with the Tristan da Cunha Government in helping them reach this historic decision and will continue to do so as new management plans are developed."
        },
        {
            "text": "Through the Commission for the Conservation of Antarctic Marine Living Resources (CCAMLR) regulatory framework, the programme has supported increased scientific understanding to underpin krill management negotiations, due to take place later this year. This will ensure activities around the British Antarctic Territory are highly precautionary and provide protection for krill eating predators such as penguins and whales."
        },
        {
            "text": "Cutting edge technology has been pivotal in helping fulfil the Blue Belt Programme’s objectives since 2016. Previously trialled in British Indian Ocean Territory, a drone is currently under development with Loughborough University, aiming to maximize its ability to monitor and detect any illegal, unreported and unregulated (IUU) fishing."
        },
        {
            "text": "Within the Pitcairn Islands, the programme funded a new MPA Officer role for the territory, who will help implement the day-to-day management of the MPA. The post was filled early in 2021 and will be guided by the new Pitcairn Islands MPA Management Plan."
        },
        {
            "text": "Monitoring the impact of fishing activity within South Georgia & the South Sandwich Islands has been improved with new underwater cameras funded by the programme. Attached to over 500 fishing longline sets, these cameras have enabled monitoring of operations and provide key information on the unique deep-water biodiversity, including elephant seals."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "The oceans upon which we all rely need our protection. This is a ‘super year’ for the world’s oceans, with a number of key international summits set to occur, including the G7, Convention on Biological Diversity (COP15) and the United Nations Framework Convention on Climate Change (COP26). We are also one year into the UN Decade of Ocean Science."
        },
        {
            "text": "The threat to our oceans is a global one, and as a result it requires coordinated global action. That is why the government is calling upon the global community to work with the UK to protect 30% of the world’s oceans by 2030. In working towards this target, the UK Government is committed to taking significant steps to protect the rich biodiversity within its marine environments. The Blue Belt Programme demonstrates the major role that small, remote islands can have in achieving global change, and its continuation into 2021 – 2022 reflects the UK Governments ongoing ambition and commitment."
        },
        {
            "text": "Over the next year the programme will focus on:"
        },
        {
            "text": "Click here to read more about the work of the Blue Belt Programme over 2020/21 "
        },
        {
            "text": "Featured image credit: Luke Hosty, Protect Blue"
        }
    ]
}