{
    "url": "https://insolvencyservice.blog.gov.uk/2023/04/06/at-a-glance-the-bankruptcy-process-from-start-to-finish/",
    "title": "At a glance: the bankruptcy process from start to finish",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Bankruptcy",
        "Debt management",
        "Debt solutions"
    ],
    "pub_date": "2023-04-06T10:50:20+01:00",
    "content": [
        {
            "text": "It is important to seek free debt advice from a money adviser on the various debt solutions available before making any decision. Free advice can be sought from: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "text": "If you decide that bankruptcy is the right solution for you, it is important to know the steps and understand the process."
        },
        {
            "text": "Here we provide an overview of the bankruptcy process from start to finish."
        },
        {
            "heading": 3,
            "text": "1. Make sure bankruptcy is the right solution for you"
        },
        {
            "text": "It is important to get free and impartial debt advice before making the decision to go bankrupt. Free advice can be sought from: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "heading": 3,
            "text": "2. Apply"
        },
        {
            "text": "You can apply to make yourself bankrupt online and to declare yourself bankrupt, you'll need to pay a fee of £680. You can see more about the application process here."
        },
        {
            "heading": 3,
            "text": "3. The Adjudicator’s decision"
        },
        {
            "text": "Once you’ve submitted a bankruptcy application, the Adjudicator (who is employed by the Insolvency Service) will assess your application and make a decision on whether to approve your application."
        },
        {
            "text": "The Adjudicator has up to 28 days to make a decision on your application but will usually take less time. If your application is approved, you’ll usually be made bankrupt that day."
        },
        {
            "text": "Once you have been made bankrupt the trustee – the person appointed to manage your bankruptcy – takes control of your valuable assets – the things you own. For more information on assets, please visit: Applying to become bankrupt: Your assets - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "4. The Interview"
        },
        {
            "text": "Once you have been made bankrupt, the Official Receiver will be your first trustee and will write to you explaining what you need to know and what you must do."
        },
        {
            "text": "You may have an interview with the Official Receiver, either in person, over the phone or online by video call, to discuss your situation."
        },
        {
            "text": "You must attend the interview if requested and cooperate with the Official Receiver. If you don’t, you could be brought before the Court and your bankruptcy could be extended beyond the usual 12 months."
        },
        {
            "text": "More information about the interview process is available here: Guide to Bankruptcy - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "5. Working with the Official Receiver"
        },
        {
            "text": "The Official Receiver will manage your bankruptcy by using your assets to pay your creditors (the people or organisations that you owe money to), or they’ll oversee the appointment of an insolvency practitioner to replace them as trustee and manage the bankruptcy."
        },
        {
            "text": "They’ll notify your creditors – the people whom you owe money to – that you are bankrupt. This will remove the stress of you having to deal with them directly."
        },
        {
            "heading": 3,
            "text": "6. Discharge"
        },
        {
            "text": "Discharge is the formal end of your bankruptcy restrictions. It usually takes place 12 months after the bankruptcy order was made. The bankruptcy can be extended if you do not carry out your duties under the bankruptcy proceedings."
        },
        {
            "text": "Once discharged, your bankruptcy restrictions are lifted, and your trustee cannot claim any new assets that come into your possession (unless you owned them before your discharge). You will be free from most of your debts. Depending on your circumstances, if you agreed, or were required to make payments into the bankruptcy, those payments will continue for up to three years."
        },
        {
            "text": "The details of your bankruptcy will stay on your credit record for up to six years."
        },
        {
            "text": "The bankruptcy restrictions can also be extended if you’re found to have acted carelessly or dishonestly. Information on bankruptcy restrictions can be found: Bankruptcy Restrictions Orders and Undertakings - GOV.UK (www.gov.uk)."
        }
    ]
}