{
    "url": "https://deframedia.blog.gov.uk/2023/04/06/coverage-of-our-frequently-flooded-allowance-announcement/",
    "title": "Coverage of our Frequently Flooded Allowance announcement",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2023-04-06T12:25:50+01:00",
    "content": [
        {
            "text": "On Wednesday 5 April, we announced the first communities in England to receive better flood protection as part of the government’s £100 million Frequently Flooded Allowance to protect areas which have been affected by repeated flooding."
        },
        {
            "text": "There has been widespread coverage of this announcement, including in the Daily Mirror, i News, the Yorkshire Post, BBC West Midlands, the Chard & Ilminster News, the Newark Advertiser, and Agriland."
        },
        {
            "text": "The first 53 projects will be allocated more than £26 million in total, better protecting more than 2,300 households and businesses across the country."
        },
        {
            "text": "Communities that will be better protected include those in Worcestershire, which faced severe flooding with Storm Christoph in 2021, and Cumbria, whose residents suffered major flooding from Storm Desmond in 2015 and Storm Ciara in 2020."
        },
        {
            "text": "It will also better protect properties in the Calder Valley, which was devastated by flooding when it was hit by both Storm Ciara and Storm Eva in 2015."
        },
        {
            "text": "The allowance targets communities where 10 or more properties have flooded twice or more in the last 10 years. These communities are often smaller and can face barriers to access funding due to the relative complexity and cost of building flood defences compared to the size of the community."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}