{
    "url": "https://nationalscreening.blog.gov.uk/2023/04/06/deadline-extended-to-apply-for-vacancies-on-uk-nsc-expert-groups/",
    "title": "Deadline extended to apply for vacancies on UK NSC expert groups",
    "authors": [
        "Maryam Abdu"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-04-06T09:52:28+01:00",
    "content": [
        {
            "text": "The deadline has been extended to join 2 expert groups for the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "The UK NSC is the independent scientific committee which advises ministers and the NHS in the 4 UK countries about all aspects of screening and supports implementation of screening programmes."
        },
        {
            "text": "The committee has 12 roles to fill in 2 of its expert groups: the fetal, maternal and child health (FMCH) group and adult reference group (ARG)."
        },
        {
            "text": "These groups help make sure the UK NSC makes high quality recommendations that are based on the best evidence and thinking."
        },
        {
            "heading": 2,
            "text": "Varied roles"
        },
        {
            "text": "The vacancies in the ARG are for a:"
        },
        {
            "text": "The vacancies in the FMCH are for a:"
        },
        {
            "text": "Both expert groups meet 3 times a year. There is no payment for the roles, but post holders can claim expenses."
        },
        {
            "heading": 2,
            "text": "Apply now"
        },
        {
            "text": "See UK NSC reference groups recruitment information to find out how to submit an expression of interest."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}