{
    "url": "https://hmlandregistry.blog.gov.uk/2023/04/06/developing-a-career-in-user-research-at-hm-land-registry/",
    "title": "Developing a career in user research at HM Land Registry",
    "authors": [
        "Alex Slowman, Lead User Researcher"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2023-04-06T11:20:59+01:00",
    "content": [
        {
            "text": "Being a user researcher requires a broad set of skills, with the level of expertise varying depending on each role. User researchers plan, design and carry out research activities with users to support and inform HM Land Registry's digital services."
        },
        {
            "text": "We work embedded in multidisciplinary teams that design and build digital services based on our users' needs, helping us to understand better and continuously improve the customer experience."
        },
        {
            "text": "If you’re considering starting your career in Digital, Data and Technology or wish to build on your existing experience, these are the benefits of joining the user research team at HM Land Registry."
        },
        {
            "heading": 2,
            "text": "Improving the customer experience"
        },
        {
            "text": "Our customers are at the heart of everything we do. As a user researcher at HM Land Registry, you’ll gain a critical understanding of the English and Welsh property markets, which currently generate around £260 billion worth of transactions every year. You’ll gather evidence about what opportunities to improve our services will make the biggest difference to our customers and whether our solutions meet user needs."
        },
        {
            "heading": 2,
            "text": "A supportive and diverse community"
        },
        {
            "text": "Our user research team are active participants in multiple professional communities, both within the department, across government and beyond. We regularly seek to share best practice by organising events with other Digital, Data and Technology professionals to explore how we can work together effectively to put user needs at the heart of how we design our services. For example, our HM Land Registry Analysis Community recently came together for an event which demonstrated how effective collaboration can inform and deliver HM Land Registry’s Strategy 2022+."
        },
        {
            "text": "In addition, we’re all members of the department’s User Research Practice, where we establish the standards required for research quality and promote an inclusive environment for success."
        },
        {
            "text": "Within the profession, there is scope to continuously develop your skills and opportunities for progression. From Junior User Researcher roles to Head of User Research, you’ll receive coaching and mentoring along the way to help you achieve your professional development goals. In the past year, more than a third of our User Research Practice members were promoted to more senior roles, either internally or across other government departments."
        },
        {
            "heading": 2,
            "text": "How do I apply?"
        },
        {
            "text": "If a career in user research sounds like something you’d be interested in, make sure you check out our current vacancies on Civil Service Jobs. You can also keep up to date with our latest news and service updates by following us on Facebook, Twitter, LinkedIn and by subscribing to our blog."
        }
    ]
}