{
    "url": "https://dragonsden.blog.gov.uk/2023/04/06/dragons-den-series-20-episode-14/",
    "title": "Dragons’ Den, Series 20 Episode 14",
    "authors": [
        "Will Fowler"
    ],
    "categories": [
        "Copyright",
        "Designs",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-04-06T21:05:16+01:00",
    "content": [
        {
            "text": "This week’s episode rounded up the end of series 20 and it was a good’n. Right from the off we got the whole set of UK registered intellectual property (IP) rights come up for a sunscreen applicator. Also this week we have water-softening shower essentials, a whisky e-commerce platform… and Dragons hugging bears."
        },
        {
            "heading": 2,
            "text": "Summer’s coming for the Solar Buddies"
        },
        {
            "text": "First up were best friends and business partners, Kelli Aspland and Laura Waters who were asking for £80k and help with scaling-up their business, Solar Buddies, in exchange for a 10% share of their business. Their product is a refillable sponge and rollerball-based sunscreen applicator that makes it easier for children to apply sunscreen themselves."
        },
        {
            "text": "With healthy sales on Amazon attributed to social media platform Tik Tok, Laura charmed the Dragons with her talk of loving numbers and having solid IP protection."
        },
        {
            "text": "As an IPO Associate Patent Examiner myself, I was really impressed when Laura went straight into asserting that they have a granted UK patent (GB2531771B) and an international patent pending (WO2023007111) covering the sponge and rollerball partnership."
        },
        {
            "heading": 2,
            "text": "So where’s the IP in Solar Buddies’ sunscreen?"
        },
        {
            "text": "The duo were clearly aware how important it is to look at what registered IP you can get early into your product development phase before it’s in the public domain. It can really help with getting funding as well as deterring and/or stopping competitors from copying your product."
        },
        {
            "text": "From a quick look at the public file for their international application, this may end up being an important point for Kelli and Laura in gaining wider valid international protection."
        },
        {
            "text": "Interestingly, lots of bits of IP-related content cropped up all over their pitch:"
        },
        {
            "text": "Kelli and Laura worked with Cardiff Metropolitan University to come up with the design. When businesses have this sort of relationship with an academic organisation, it’s likely there would be some sort of IP ownership agreement and/or non-disclosure agreement in place."
        },
        {
            "text": "Laura said they have a registered design and I was able to find this after a quick search on the IPO’s ‘find a registered design’ page. An often-overlooked bit of IP, Kelli and Laura’s registered design (90031414070001) is a useful way of stopping others from copying the outer appearance of their sunscreen applicator. Designs can last up to 25 years from the date of application. A patent will last 20 years."
        },
        {
            "text": "The Solar Buddies business name is protected by two different types of trade mark – a word mark (UK00003197810) and a figurative mark (UK00003083649) giving the pair a broad level of protection against any businesses trying to piggy-back off their brand reputation, and of course, you can keep renewing them forever!"
        },
        {
            "text": "This was a great result for the Solar Buddies entrepreneurs. I’m now personally excited to see these sunscreen applicators on the shelves this summer!"
        },
        {
            "text": "Sara Davies, Deborah Meaden and Peter Jones were impressed, judging by their faces, each of them making an offer. In the end Kelli and Laura walked out with the whole £80k in exchange for 20% of their business. Most importantly they also walked out with the expertise of both Deborah and Peter - including Peter’s all-important contact at Disney® – to help grow their business."
        },
        {
            "heading": 2,
            "text": "Klean Sweep?"
        },
        {
            "text": "Next up was husband and wife team Karlee and Omer Ozener from Hello Klean, whose products include sustainable and vegan shower essentials to soften hard water."
        },
        {
            "text": "They were looking for £100k in return for 2% of their company as well as a Dragon to help grow the company. Unfortunately, it seemed to them there was nothing that could be protected via IP, and others were doing the same thing in the market, which made Sara drop out. However, Deborah, Touker and Steven were not deterred. After some hot negotiation with Steven, Karlee and Omer left the Den with all the money for 7.5% of their business."
        },
        {
            "heading": 2,
            "text": "Scotch Galore"
        },
        {
            "text": "Whisky connoisseurs Stephen and Jacqueline Pyne from Scotch Galore Whiskies were next in the Den. They provide a free-to-use online platform for buying and selling whisky, earning a small commission on each exchange. After a muddling explanation of the finances and concerns expressed about a limitation on potential profit, all of the Dragons were out, recommending that this is a great business exactly as it is."
        },
        {
            "heading": 2,
            "text": "To a happy and hopeful Series 21"
        },
        {
            "text": "And finally, the perfect pitch to round off the last episode of series 20 - Jo Proud with Hope and Happy Bear from Moodbears. Her products include emotional support teddy bears and an associated children’s book. Jo was seeking £20k in exchange for a 10% share in her business."
        },
        {
            "text": "In a rare showing of the Dragons’ softer sides, they all joined forces in the bidding equivalent of a group hug to help spread the message of the bears and offer £20k collectively for 25% of the business."
        },
        {
            "text": "What a way to end series 20 – all five Dragons in together for a good cause!"
        }
    ]
}