{
    "url": "https://medregs.blog.gov.uk/2023/04/06/happy-75th-anniversary-to-the-world-health-organization/",
    "title": "Happy 75th Anniversary to the World Health Organization",
    "authors": [
        "George Mitchell"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-04-06T16:46:23+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "On this day in 1948, the United Nations (UN) came together to establish a global organisation that promotes health, keeps the world safe, and serves the vulnerable. Seven decades later, the World Health Organization (WHO) is celebrating its 75th anniversary. To mark the occasion, the WHO is using this World Health Day to raise awareness of its journey towards ‘Health For All’ by looking back at its greatest achievements and looking forward to how current challenges could be addressed."
        },
        {
            "text": "From the eradication of smallpox in 1980 to the interruption of wild poliovirus in Africa in 2020, the WHO has always been at the forefront of protecting and promoting global health. We have been proud to collaborate with the WHO over the years, supporting their efforts from research and expert counsel, to ensuring the quality and safety of medical products for patients and families around the world."
        },
        {
            "text": "Many WHO successes over the past 75 years have involved the development and delivery of biological medicines. These are any medicinal products that come from a living source such as a virus or bacterium, like a vaccine, which we’ve all become more than familiar with in recent years. Due to differences in their nature and how they are made, biological medicines are regulated, tested and controlled differently compared to other medicines. This is where the WHO come in, setting requirements for manufacturing and regulations to help assure their quality, safety and effectiveness. Through its collaborating centres, including the MHRA, the WHO also establishes WHO International Standards that are used to help ensure the consistency of biological products across different batches around the world."
        },
        {
            "text": "MHRA is the leading WHO collaborating centre and international laboratory for biological standards, developing, producing and supplying over 95% of all WHO Standards. The almost 400 different international standards and references we have available ensure that healthcare professionals and the patients they support can be confident in the quality of the medicines they are using."
        },
        {
            "text": "One of the most widely distributed biological medicines worldwide each year is the influenza vaccine. Influenza is constantly changing and mutating, meaning it can easily evade the immune system. We have been working on influenza for many decades and as an Essential Regulatory Laboratory (ERL) we collaborate with the WHO and the other three ERLs to prepare for every influenza season. This starts with reviewing data collected over the previous winter months to identify which flu strains have been most prevalent. An expert panel, including a representative from MHRA, then meets in February to select which strains are most appropriate for the development of vaccines for the upcoming northern hemisphere season (the same process happens in September for the southern hemisphere influenza season). The latest recommendations from this most recent meeting have just been announced."
        },
        {
            "text": "With immunisations of at-risk groups taking place in the autumn, vaccines need to be developed in half a year, 20-times faster than the usual 10-year timeline. The MHRA is essential to ensuring this deadline is met by developing candidate vaccine viruses (CVVs). These CVVs are viruses that match the selected influenza strains each year but grow much better, enabling manufacturers worldwide to develop the required amount of vaccine in the time available. Once produced, we need to confirm that the vaccine works and that it meets specifications using a vaccine potency test developed by our experts (in what was then known as NIBSC) in the 1970s, which is still the gold standard today. This potency test requires the use of two types of reagents, an antigen standard and an antiserum. These reagents are produced by the MHRA and the other ERLs and distributed to vaccine manufacturers and independent control laboratories worldwide. Once all the processes have been completed, the influenza vaccine is ready to be delivered."
        },
        {
            "text": "While influenza continues to be a yearly concern for the WHO and MHRA, a little further from home, our collaboration is close to making polio a disease of the past. In 1988, almost 1,000 children per day were paralysed by polio globally; now, due to better detection and mass vaccination programmes, led by the WHO Global Polio Eradication Initiative, the wild form of polio has been eradicated in all but two countries. However, polio remains a concern, and in fact, research conducted by MHRA scientists 25 years ago described the first known example of a vaccine used to control polio spreading widely and being responsible for new cases emerging."
        },
        {
            "text": "The oral polio vaccine (OPV) has been largely responsible for the eradication of polio and contains a weakened version of the poliovirus. It is cheap and easy to use and reduces infection risk without the need for injection. However, in an under-vaccinated population, if the weakened virus is passed between unvaccinated people enough times, its ability to cause paralysis can be reactivated. In recent years MHRA research has looked into ways of developing OPVs that do not have the ability to reactivate."
        },
        {
            "text": "There is another form of the vaccine being used in Europe and North America, made by growing large amounts of poliovirus in tanks and then killing it completely before producing a safe vaccine that can be injected. But in a world where polio is almost gone, how can we produce huge vats of virus safely around the world without it escaping and returning? As a WHO collaborating centre for reference & research on poliomyelitis, MHRA hopes to answer questions such as these and support final eradication efforts."
        },
        {
            "text": "Many of us won’t remember a time before WHO, and thanks to their efforts, more people are born each day into a world where the health of our global population is continuing to improve. We are proud to have collaborated with the WHO throughout the years and look forward to continuing to face global challenges with them to achieve ‘Health For All’."
        }
    ]
}