{
    "url": "https://environmentagency.blog.gov.uk/2023/04/06/innovative-new-habitats-bring-water-quality-boost-to-whitby/",
    "title": "Innovative new habitats bring water quality boost to Whitby",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-04-06T09:15:07+00:00",
    "content": [
        {
            "text": "By Allison Pierre, Environment Agency project lead, and Hellen Hornby, nature based solutions programme manager, Groundwork. "
        },
        {
            "text": "Wonderful Whitby is a quintessential seaside town, popular with tourists and synonymous with its famous focal point abbey looming over the bustling harbour."
        },
        {
            "text": "And amazing things are happening in that harbour."
        },
        {
            "text": "Hidden beneath the walls some of the most innovative efforts to combat the effects of climate change, restore lost habitats and improve water quality are taking place."
        },
        {
            "text": "New man-made marine habitats including a living sea wall, rock pools and hanging fish shelters are being installed as part of a pilot project which will pave the way for future coastal restoration."
        },
        {
            "text": "The efforts are part of Better Estuaries and Coastal Habitats (BEACH) Esk, a collaboration between the Environment Agency, Groundwork North East & Cumbria and Yorkshire Wildlife Trust, supported by local landowners, Scarborough Borough Council, Yorkshire Water and community groups."
        },
        {
            "text": "Water quality in Yorkshire’s estuaries is adversely affected by human activity in the harbours as well as in the river tributaries that lead to the estuaries and coasts."
        },
        {
            "text": "Historic land reclamation for industry and sea wall construction – a problem known as ‘coastal squeeze’ – has also led to a loss of habitat for the migratory Atlantic salmon and sea trout, and other species such as sea lamprey and the European eel."
        },
        {
            "text": "The Esk estuary is also home to the rare and endangered freshwater pearl mussel, which depends on trout to complete its life cycle."
        },
        {
            "text": "BEACH Esk, which started in 2020, is taking a ‘big picture’ approach – with interventions right from the river’s source upstream all the way through to the sea at Whitby."
        },
        {
            "text": "Activity in the harbour includes Living Sea Wall panels, an award-winning design created by teams of marine ecologists and designers at the Sydney Institute of Marine Science. The panels are being fixed to concrete under New Quay and are being installed by Swiftwater Solutions."
        },
        {
            "text": "Also being trialled are artificial rock pools and fish refuges that have been developed in the UK by eco-engineers Artecology and Biomatrix Water."
        },
        {
            "text": "Marine scientists at Hull University, working alongside Groundwork’s Monitoring Assistants, will closely monitor all the interventions to see how they attract marine life species. It’s hoped these interventions will stimulate and encourage marine life, and create shelter, feeding grounds and refuges for fish and wildlife."
        },
        {
            "text": "Meanwhile upstream in the River Esk tributaries that lead into the harbour, our partners at Yorkshire Wildlife Trust are working to tackle agricultural pollution – reducing the amount of sediment running off the land and into the water to bring benefits to water quality and habitat."
        },
        {
            "text": "Together with landowners they are fencing off livestock, restoring grassland and wetland, and planting trees and hedges – 1,470 trees and 3,313m of hedgerow were planted last year."
        },
        {
            "text": "Yorkshire Wildlife Trust is also currently exploring a possible future project to place a small population of native oysters in Whitby harbour to identify any improvement in water quality they provide."
        },
        {
            "text": "Saltmarsh has also been restored and extended providing habitat for a range of birds, invertebrates and juvenile fish as part of the project."
        },
        {
            "text": "And we’ve all worked together in large scale public engagement and education efforts to encourage people to stop pouring fats and oils down the drains, as well as working with boat users to reduce oil and fuel spills into the water and reduce the impact of anti-fouling paints."
        },
        {
            "text": "Crucially BEACH Esk is creating valuable opportunities for local communities to get involved and connect with the river, bringing with it social, health and well-being benefits."
        },
        {
            "text": "There is an urgent need for this type of ecological intervention to trial innovative techniques that encourage the re-creation of unique habitats and improve water quality."
        },
        {
            "text": "We hope our efforts will be successful and will add to the growing bank of knowledge and expertise in this specialist area, so that the work can be extended here and elsewhere in the future."
        },
        {
            "text": "Follow the Environment Agency Yorkshire and North East, Groundwork North East & Cumbria, and Yorkshire Wildlife Trust  on Twitter."
        }
    ]
}