{
    "url": "https://opss.blog.gov.uk/2023/04/06/join-the-conversation-welcome-to-the-opss-careers-blog/",
    "title": "Join the Conversation: Welcome to the OPSS Careers Blog",
    "authors": [
        "Simone King"
    ],
    "categories": [
        "General",
        "OPSS Culture and Values"
    ],
    "pub_date": "2023-04-06T17:00:03+01:00",
    "content": [
        {
            "text": "We're excited to introduce the new Office for Product Safety and Standards (OPSS) Blog, your go-to resource for all things related to careers at the OPSS."
        },
        {
            "text": "Whether you're a seasoned industry professional or just starting out in your career, this blog is designed to help you stay up to date on our career opportunities, culture, and the work that we do. We have a wide remit and so for us working here means many different things."
        },
        {
            "text": "At OPSS, our mission is to protect consumers and promote business confidence, productivity, and growth by ensuring the safety and integrity of products. We work closely with local, national, and international regulators, consumer representatives, and businesses to deliver effective protections and support compliance."
        },
        {
            "text": "This blog is an extension of this mission, providing valuable insights and information on the world of product safety."
        },
        {
            "text": "Here are just a few topics you can expect to see covered on the OPSS Blog:"
        },
        {
            "text": "We'll also be sharing updates on our own work here at OPSS, including news and events, job postings, and other career development resources."
        },
        {
            "text": "We believe that sharing knowledge and insights is key to advancing the field of product safety and ensuring the safety and well-being of consumers. We hope you'll join us on this journey by subscribing to our blog, leaving comments and feedback, and sharing our posts with your colleagues and network."
        },
        {
            "text": "Thank you for visiting the OPSS Blog – we look forward to connecting with you soon!"
        }
    ]
}