{
    "url": "https://opss.blog.gov.uk/2023/04/06/launch-your-career-with-an-apprenticeship-at-the-office-for-product-safety-and-standards/",
    "title": "Launch your career with an apprenticeship at the Office for Product Safety and Standards",
    "authors": [
        "Simone King"
    ],
    "categories": [
        "Apprenticeships",
        "Careers at OPSS",
        "Civil Service Apprenticeships",
        "Civil Service Careers",
        "Environmental Protection",
        "Regulatory Compliance",
        "Vacancies"
    ],
    "pub_date": "2023-04-06T17:30:44+01:00",
    "content": [
        {
            "text": "Do you like working through a problem and finding solutions?"
        },
        {
            "text": "Can you use a range of interventions to ensure that individual businesses are meeting their obligations?"
        },
        {
            "text": "Look no further than the Regulatory Compliance Officer apprenticeship with the Office for Product Safety and Standards (OPSS)."
        },
        {
            "text": "Join our Regulatory Compliance Officer programme and you’ll get a permanent job in the Civil Service, with a starting salary of at least £25,310 and Civil Service benefits * the range of benefits offered will be confirmed once you start."
        },
        {
            "text": "You’ll work on real projects that make a positive impact on millions of people’s lives and you will also gain industry-standard qualifications."
        },
        {
            "text": "As a Regulatory Compliance Officer you will get to work on three different teams, giving you a range of experiences to draw on no matter what you focus on in the future. This is an exciting opportunity to work in a dynamic and varied role as part of a high-profile national regulator."
        },
        {
            "text": "And the best part? As soon as you complete your apprenticeship, there are opportunities to progress within our Enforcement teams."
        },
        {
            "text": "You will be part of our Apprenticeship Programme, studying for a Level 4 Regulatory Compliance Officer apprenticeship qualification. This is equivalent to the first year of a University Degree. Our apprentices are our future enforcement officers and leaders. Whether you are at the start of your career, or are an experienced professional looking for something new to move your career forward, we believe in supporting people to develop and grow."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Regulatory Compliance Officer Apprenticeship"
        },
        {
            "text": "We’ve got 6 apprenticeship roles available in Regulatory Compliance, starting in September. These roles will be based in Birmingham or Teddington and offer a salary of £25,310 - £27,515 in Birmingham or £28,510 - £31,825 in London."
        },
        {
            "text": "This is an exciting opportunity to earn as you learn and get hands on practice in Regulatory Compliance, while studying towards an industry-standard qualification."
        },
        {
            "text": "You’ll develop crucial skills, knowledge and behaviours for your role and be part of a great team working and delivering on different projects and work streams."
        },
        {
            "text": "Find out more and apply on the Civil Service Jobs website."
        },
        {
            "heading": 3,
            "text": "What you’ll get as an apprentice"
        },
        {
            "text": "You’ll benefit from a stable job within the Civil Service, with plenty of progression prospects, as part of a diverse, vibrant community."
        },
        {
            "text": "You’ll also be based in either Birmingham or Teddington  but we’re also set up for hybrid working. You’ll benefit from all the IT Kit that you need to get you up and running."
        },
        {
            "text": "So why not apply today and start your journey towards a successful enforcement career in OPSS?"
        },
        {
            "text": "OPSS has diverse customers, and is an inclusive employer. We welcome applications from diverse candidates."
        },
        {
            "text": "Find out more about what our current and former apprentices think about the programme and click here to apply. Applications will close 15th May 2023"
        },
        {
            "heading": 3,
            "text": "Register your interest in future apprenticeships"
        },
        {
            "text": "We’ll be launching more apprenticeships throughout the year. Register your interest and we’ll contact you as soon as we have any opportunities."
        }
    ]
}