{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/04/06/measuring-the-impact-of-design-training/",
    "title": "Measuring the impact of design training",
    "authors": [
        "Suzanne How",
        "Diane Pochard"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2023-04-06T12:00:43+01:00",
    "content": [
        {
            "text": "We are a small team and are passionate about our impact. Department of Health and Social Care’s transformation directorate aims is to support the delivery of user-centred policies and services in health and social care. We use human-centred design and agile methodologies to foster systemic, collaborative thinking and to ensure people are at the heart of services delivered."
        },
        {
            "text": "One way our team enables this is by providing training to help people to develop skills, mindsets in user-centred design, and agile working. We have worked on lots of policy areas like weight management, cancer, adult social care, mental health, just to name a few."
        },
        {
            "text": "As we refine our long-term vision, we are doing some self-reflection and developing a model to evaluate the impact of our work so we can improve our approach and offer to DHSC. We are particularly keen on measuring improvements in agile and user-centred design."
        },
        {
            "heading": 2,
            "text": "How do you measure the impact of learning?"
        },
        {
            "text": "We are looking for learning and development (L&D) experts across government who have experience in evaluating how effective their capability building interactions are, particularly those who have experience working in user-centred policy design. We want to understand how to measure improvements in digital capability but also interested in any measurements that relate to other work that might be relevant. We want to learn from your experience, practice and work to identify the best possible way of evaluating capability."
        },
        {
            "text": "We would love to hear from you. We want to know what you are measuring, what methods you are using and if there was anything you have tried that hasn’t worked. Do you have any resources or examples you can share? We are also interested to hear how you have presented your findings and used them to make changes."
        },
        {
            "heading": 2,
            "text": "A knowledge sharing exercise"
        },
        {
            "text": "We plan to share our thoughts and progress in future posts on this blog. We are also considering forming a thinking group of people to discuss measurement and evaluation. If you are a capability or L&D professional, or someone who interacts and works on a digital transformation project, or just a curious mind who is keen to contribute, please get in touch to let us know!"
        },
        {
            "text": "Please send us your thoughts or get in touch for a chat so that we can pick your brains! contact us at digitalcapabilitytransformation@dhsc.gov.uk"
        }
    ]
}