{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/04/06/quantum-technologies-a-regulatory-perspective/",
    "title": "Quantum technologies – A regulatory perspective",
    "authors": [
        "Joshua Kilpatrick"
    ],
    "categories": [
        "DRCF"
    ],
    "pub_date": "2023-04-06T11:00:05+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Advances on the quantum frontier "
        },
        {
            "text": "If you’ve ever thought this world behaves in unexpected ways, it gets even more so the smaller you go. As you get smaller and smaller, down to atomic or subatomic scales, tiny particles can act in ways you never observe in day-to-day life. Particles can exist in multiple states simultaneously, or can become connected so that even when two things are as far apart as at opposite ends of a galaxy, they can still be somehow thought of as one object."
        },
        {
            "text": "Whilst surprising from the perspective of our everyday experience, quantum properties hold out a transformative potential that could potentially unleash vastly more computational power than would be possible with even the fastest supercomputers available today, leading to benefits across the economy and society. For example, quantum computers could offer a variety of benefits such as new ways to optimise financial portfolios, logistics, or accelerate breakthroughs in drug discovery. Harnessing quantum properties could open whole new ways to make communications more secure. However, in time these technologies could break current standards of cryptography, requiring a major evolution in how we secure information."
        },
        {
            "text": "It was these topics, and what they might mean for businesses, citizens and consumers, that was the focus of the recent Digital Regulation Cooperation Forum’s (DRCF) Quantum Symposium. The event, led by Ofcom, with the Information Commissioner’s Office (ICO), the Competition and Markets Authority (CMA) and the Financial Conduct Authority (FCA) and in collaboration with Digital Catapult and the National Quantum Computing Centre brought together over 170 colleagues from industry, academia, government and the regulatory community."
        },
        {
            "text": "This blog is intended to reflect on views shared at the DRCF’s Quantum Symposium and should not be taken as an indication of current or future policy by any of the DRCF member regulators."
        },
        {
            "heading": 2,
            "text": "The Symposium"
        },
        {
            "text": "The six sessions of the day covered developments within quantum technologies’ research and commercialisation, featuring discussions between expert speakers, including:"
        },
        {
            "heading": 2,
            "text": "Key learnings from the day"
        },
        {
            "text": "The day featured broad discussion about quantum computing which was suggested could be the biggest step change in computing since the 1940’s, provided the necessary technological breakthroughs occur. The biggest challenge for quantum computing is to increase the number of quantum bits, or qubits, that store and process information in the system while keeping errors in computation at manageable levels. Progress is being made, but there are still many research and development milestones yet to be hit before quantum computers can start to outperform existing supercomputers in certain tasks, and so herald in the widely anticipated ‘quantum-advantage’ era."
        },
        {
            "text": "However, quantum technologies are extremely complex and will be used in specific contexts, such as modelling extremely large and complex systems. Therefore, adoption of quantum technologies will be more successful if it can be smoothly integrated alongside existing technologies."
        },
        {
            "text": "More broadly, the consensus was that collaboration is key, not only between industry and policy makers but it will require considerable cross-sectoral work and international coordination to drive responsible innovation and standardisation."
        },
        {
            "heading": 2,
            "text": "Ongoing questions for regulators"
        },
        {
            "text": "As discussed during the event, the development of quantum technologies raises a series of questions for policy makers and regulators. These included:"
        },
        {
            "heading": 2,
            "text": "The UK as a science and technology superpower"
        },
        {
            "text": "Attendees agreed that much is still uncertain, but research is making rapid progress. And even at this early stage, there is an important role that regulators can play by bringing different communities of interest together, mapping how existing regulations apply, considering what the potential regulatory implications in time might be, and being on the front foot in encouraging innovation. All of this supports broader work to see science and technology drive forward the UK. It is reflected in quantum technologies being one of the five critical technologies identified in the Government’s Science and Technology Framework and the new National quantum strategy, announced only days ago, which has a vision for the UK to be a leading quantum-enabled economy by 2033."
        },
        {
            "text": "Reflecting on our work, one attendee to the Symposium shared the view that “The UK has a thrilling ambition to be a 'Science and Technology Superpower'. There are many opinions on how to get there. But how else should we become one than to begin, and already behave like one? This week we saw just that.”"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We would like to thank all those who have so generously shared their insights and perspectives on these topics during the symposium."
        },
        {
            "text": "The implications and questions that quantum technologies pose will continue to develop as these technologies mature and see growing adoption. These topics will therefore remain in focus, and the DRCF and its member regulators will use insight gathered during the event to consider what it means for each of us as regulators, both individually and collectively, and for our stakeholders. Further developed views on these topics will be covered in an upcoming Insights Paper in early Summer."
        },
        {
            "text": "Should you have any feedback, or further suggestions of technologies or topics relevant to the DRCF, please do get in touch via our mailbox: JoiningUpOnFutureTech@ofcom.org.uk."
        },
        {
            "heading": 2,
            "text": "The DRCF Horizon Scanning Programme"
        },
        {
            "text": "The DRCF Horizon Scanning programme ensures that its member regulators - Ofcom, the Information Commissioner’s Office (ICO), the Competition and Markets Authority (CMA) and the Financial Conduct Authority (FCA) - share a coherent view of emerging digital markets and technologies, from which to consider future regulatory opportunities and challenges. Previous work has been carried out on the topics of the Metaverse and Web 3. Read the Web3 Insights Paper. "
        }
    ]
}