{
    "url": "https://vets.blog.gov.uk/2023/04/06/take-the-survey-government-veterinary-services-gvs-wants-vets-ideas-for-vets-into-government-career-programme/",
    "title": "Share your views on a new proposal to attract vets into Government",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Disease outbreak",
        "Government Veterinary Services",
        "International Work",
        "Jobs and Experiences",
        "Policy Work",
        "Professional development"
    ],
    "pub_date": "2023-04-06T15:58:17+01:00",
    "content": [
        {
            "text": "Government Veterinary Services is considering a new veterinary programme to attract more vets into Government veterinary roles. We are calling on vets to help shape the proposal by sharing their ideas."
        },
        {
            "text": "The programme would provide a structured pathway for qualified vets at all stages of their careers, including those thinking about returning to the profession. Along with a salary, participants would receive training, experience and gain new qualifications within animal health, animal welfare and veterinary public health, including One Health; whilst working across a range of different government departments, agencies and partners."
        },
        {
            "text": "On completion of the pathway, participants would have developed a wealth of transferrable skills and be well positioned to progress their careers within government, in non-governmental veterinary public health roles, or in private practice."
        },
        {
            "text": "Our government vets have a real impact on the lives of people and animals across the country as veterinary inspectors addressing disease risks in animal by-products, artificial breeding and international trade; field operations vets working in abattoirs to make sure meat is produced safely and in line with animal health and welfare; government veterinary advisors who provide expert advice on issues from avian influenza to border controls; veterinary researchers, who collaborate on global research on animal diseases, new diagnostic techniques and vaccines; and much more."
        },
        {
            "text": "Please help us to shape the programme with your ideas by completing this short survey. It should take no longer than 5-minutes to complete. Government Veterinary Services Career Programme Survey. The survey will stay open until 14 April 2023."
        },
        {
            "text": "For further information about the programme or veterinary careers in government, please email GVS@defra.gov.uk"
        }
    ]
}