{
    "url": "https://space.blog.gov.uk/2023/04/06/the-night-sky-in-april-3/",
    "title": "The night sky in April",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-04-06T16:05:22+01:00",
    "content": [
        {
            "text": "This month sees a promising meteor shower, a wonderful opportunity to see the rocky, inner planets of our Solar System, and some of the most striking stars and constellations in our night sky."
        },
        {
            "text": "The spring constellations"
        },
        {
            "text": "As darkness falls this month, the constellation of Ursa Major (the Great Bear) can be seen climbing high in the southeast.  Look for the distinctive brighter stars that form the ‘plough’ or ‘big dipper’ – these stars make up the back and tail of the Bear."
        },
        {
            "text": "Below Ursa Major is a constellation that arguably looks a little more like the creature it is named after.  Records suggest that the lion-like pattern we now know as the constellation of Leo was recognised 6,000 years ago."
        },
        {
            "text": "It hosts some spectacular and fascinating stars that are millions of light-years beyond the edge of our galaxy. Come back for our May blog next month for more on what you can find in the constellation of Leo!"
        },
        {
            "text": "The exact timing is unclear, but around 2,000 years ago, the cluster of stars that made the fuzzy tuft of the Lion’s tail (bottom-centre in the image) was separated into a new constellation, now known as Coma Berenices."
        },
        {
            "text": "While there are few bright stars in this patch of sky, this constellation - along with neighbouring Canes Venatici and Virgo - has become known as the ‘Realm of the Galaxies’ because of the incredible number of galaxies that can be seen with a telescope in this patch of sky."
        },
        {
            "text": "Another constellation to look for is Cancer the Crab.  Visible from the light-filled skies of towns and cities, this constellation takes on a very different appearance from darker skies.  The ‘shell’ of the crab appears as a glowing patch of light, due to a large open cluster of around 1,000 stars known as ‘Praesepe’, or the Beehive Cluster, that lies around 600 light-years away."
        },
        {
            "text": "The Moon and planets"
        },
        {
            "text": "April is a great month to spot the rocky planets of our Solar System."
        },
        {
            "text": "Mercury orbits just 55 million kilometres (35 million miles) from the Sun, so it never appears far from it in our skies and is often hidden in the glare of sunrise or sunset."
        },
        {
            "text": "This month, Mercury reaches ‘greatest elongation’, meaning it is furthest from the setting Sun and will be easier to spot low in the west around half an hour after the Sun sets."
        },
        {
            "text": "Venus is also climbing higher into our evening skies.  Look to the west around 11 April to see the brightest planet in our night sky appear to pass close to the Pleiades star cluster in the constellation of Taurus."
        },
        {
            "text": "Also, while Mars still shines in the constellation of Gemini, the outer planets are harder to spot this month.  From our perspective on Earth, Jupiter passes directly behind the Sun on the opposite side of our Solar System this month, while Saturn has just re-emerged in the morning skies having done the same a few weeks ago."
        },
        {
            "text": "The Moon has a couple of conjunctions with the brighter planets this month.  On 22-23 April, a 10% illuminated crescent moon will appear close to Venus (and the Pleiades), while the evening of 25 April will see a 30% illuminated Moon setting in the west near to Mars."
        },
        {
            "text": "The Lyrids meteor shower"
        },
        {
            "text": "Meteors, often called ‘shooting stars’, occur when small fragments of rock, dust and ice left in the wake of comets or asteroids, fall into our atmosphere, and burn up. This month brings the Lyrid meteor shower, which occurs as Earth passes through the material left behind the comet C/1861 G1 Thatcher."
        },
        {
            "text": "It's likely there will be an increased number of meteors visible throughout the second half of the month, with the peak of the shower is expected to fall on 22 - 23 April.  This coincides with the new Moon this month (where the Moon lies between the Sun and Earth) and without the glow of the Moon, it will be easier to spot more meteors."
        },
        {
            "text": "If you can, get away from any bright sources of light, give your eyes time to adapt to the dark and spend some time looking up at the stars – good luck!"
        },
        {
            "text": "Did you know?"
        },
        {
            "text": "The Lyrids are the oldest recorded meteor shower, with Chinese astronomers recording its appearance in the night sky over 2,500 years ago!"
        },
        {
            "text": "Finally, there will be a solar eclipse on 20th April, but sadly it won’t be visible from the UK – only a small number of people in Australia and Indonesia will get to see it."
        },
        {
            "text": "Space Exploration"
        },
        {
            "text": "Watch out for the launch of ESA’s ‘JUICE’ (JUpiter ICy moons Explorer) mission this month.  It is scheduled to begin the nearly eight-year voyage to Jupiter on 13th April."
        },
        {
            "text": "You can find out more about JUICE and the UK’s involvement in the mission here."
        }
    ]
}