{
    "url": "https://defrafarming.blog.gov.uk/2023/04/06/the-net-zero-growth-plan-and-our-farming-offer/",
    "title": "The Net Zero Growth Plan and our farming offer  ",
    "authors": [
        "Stephen Ayres"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2023-04-06T11:35:08+01:00",
    "content": [
        {
            "text": "Published last week, The Net Zero Growth Plan sets out how government plans to meet net zero while supporting economic growth and prosperity in the UK.  "
        },
        {
            "text": "Decarbonising agricultural emissions is a challenge — as is the whole mission to create a net-zero emission economy by 2050. "
        },
        {
            "text": "Farming is one sector where we expect some residual emissions because some aspects of farming, such as raising animals or using fertiliser, have unavoidable emissions. "
        },
        {
            "text": "We need to continue those activities whilst at the same time reducing emissions as far as possible. We are committed to doing it in a way that supports thriving farm businesses and maintains food production at current levels.  "
        },
        {
            "text": "To achieve this, we developed a range of measures that we think can help decarbonise agricultural emissions. These are set out in the Carbon Budget Delivery Plan, which was published alongside the Net Zero Growth Plan last week. These measures can be found on page 89 of the document."
        },
        {
            "text": "The measures build on the progress that farmers have already made. Since 1990, agricultural emissions have reduced by 12%. "
        },
        {
            "text": "The dairy sector reduced greenhouse gas (GHG) emissions by 12% between 2000 and 2020, while still increasing milk production by 11% with 21% fewer cows.  "
        },
        {
            "text": "We recognise the value of the work taken to reduce emissions by many farmers already. We want to support them to build on this. "
        },
        {
            "text": "Many of the measures outlined, for example introducing cover crops, can help support the long-term foundations of a healthy environment and food production. "
        },
        {
            "text": "Farmers will also be important in reducing and sequestering emissions from the land use sector including through tree planting, peatland restoration and agroforestry. "
        },
        {
            "text": "Reducing further the greenhouse gas emissions of the sector will require a combination of incentives, clear and well enforced rules and supporting market driven innovations.  "
        },
        {
            "text": "The incentives for several of those measures are covered through the Sustainable Farming Incentive and Countryside Stewardship. For example introducing grass-legume mixtures."
        },
        {
            "text": " You can refer to our recent environmental land management update to see how you can be paid for delivering those.  "
        },
        {
            "text": "We’re also supporting other measures through the Farming Investment Fund, for example, providing funding towards slurry covers. Or they’re being developed in the Farming Innovation Programme, for example, on precision feeding technology. "
        },
        {
            "text": "The full range of one-off and ongoing payments can be found on Funding for Farmers and Land Managers on GOV.UK. "
        },
        {
            "text": "For some of the measures, we think we need to work out the best balance between the industry, the market and government. We will work with the industry to develop the arrangements for these and understand how they are best delivered."
        },
        {
            "text": "The scale of the challenge requires a step change in investment. Our intention is that farmers and land managers can earn income from public sources like our environmental land management schemes but also attract greater finance from the private sector for sequestering carbon, improving water quality, and increasing biodiversity.   "
        },
        {
            "heading": 2,
            "text": "The Carbon Budget Delivery Plan"
        },
        {
            "text": "The Carbon Budget Delivery Plan contains the full list of proposals and policies including the name, description and, where possible, the quantified savings in Carbon Budgets 4, 5 and 6 (covering 2023-27, 2028-32 and 2033-37 respectively). "
        },
        {
            "text": "We’re  going up to Carbon Budget 6 because it’s the furthest budget ahead for which the government has a legally required emissions reduction total.  "
        },
        {
            "text": "I'll pull out some of the headlines below."
        },
        {
            "heading": 2,
            "text": "Feed additives"
        },
        {
            "text": "Ruminant livestock and their wastes are the leading cause of farm emissions, but feed additives with methane inhibiting properties have the potential to reduce some of these emissions, especially from farm systems encompassing periods of housing for cattle. "
        },
        {
            "text": "We anticipate entry of high efficacy methane suppressing products to the UK market from 2025 and will explore the role of industry and government to maximise uptake of such products for suitable cattle farm systems at pace, through a phased approach."
        },
        {
            "text": " In the Net Zero Growth Plan, we set out ambition to mandate the introduction of products with proven safety and efficacy in compound feeds for cattle as soon as practically possible in England. "
        },
        {
            "heading": 2,
            "text": "Carbon audits"
        },
        {
            "text": "We also confirmed in the Net Zero Growth Plan that we want to develop a harmonised approach to carbon audits. "
        },
        {
            "text": "We’ve heard that because there are a lot of different tools and approaches, this can be confusing. We also said Defra will set out how it intends to support farmers with carbon auditing by 2024. "
        },
        {
            "text": "This is a really important step to demonstrate carbon savings and unlock private finance opportunities to complement public funding. "
        },
        {
            "heading": 2,
            "text": "Agroforestry"
        },
        {
            "text": "We noted farmers’ efforts are vital to reducing emissions not just from farming but also from the wider land use sector. "
        },
        {
            "text": "One example of that is through introducing agroforestry systems and we have set out our ambition to introduce agroforestry systems on 10% of arable land by 2050."
        },
        {
            "text": " This represents an important step to sequester carbon and we know that agroforestry systems can provide multiple benefits including shade and shelter for livestock and protection against flood risk."
        },
        {
            "text": "We will be introducing an agroforestry standard in the Sustainable Farming Incentive in 2024 so that farmers can be paid for introducing agroforestry systems. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "If you have any questions about our approach or would like to share your thoughts, do leave a comment."
        },
        {
            "text": "I'll add links to the publications I've mentioned and to others for further reading in the box below."
        },
        {
            "text": "Don’t forget to subscribe to the Farming blog for updates from the team. "
        }
    ]
}