{
    "url": "https://marinescience.blog.gov.uk/2023/04/06/this-little-shark-went-to-market-the-importance-of-data-collection-to-protect-sri-lankas-sharks-and-rays/",
    "title": "This little shark went to market: the importance of data collection to protect Sri Lanka’s sharks and rays",
    "authors": [
        "Emily Roebuck"
    ],
    "categories": [
        "biodiversity",
        "Fisheries",
        "International"
    ],
    "pub_date": "2023-04-06T13:46:32+01:00",
    "content": [
        {
            "text": "Warning: This blog contains images of mobulid ray gill plates. Some people may find this distressing."
        },
        {
            "text": "Sri Lankan waters are home to at least 105 different species of sharks and rays (known collectively as elasmobranchs). These animals provide a vital income for fishers, an important protein source for local communities, and potential opportunities for tourism, as well as supporting a healthy ocean ecosystem. Recent trends have shown fewer elasmobranchs are being landed at markets in Sri Lanka, which is a possible indicator of reduced numbers in the ocean. To support the improved management of these animals, robust scientific data on catches, fishing effort, and trade is needed."
        },
        {
            "text": "Cefas are working with Blue Resources Trust (BRT), a marine conservation non-profit organisation based in Sri Lanka, to improve data collection of sharks and rays. This work is funded through the UK Government’s Ocean Country Partnership Programme (OCPP), which supports countries to strengthen marine science expertise, develop science-based policy and management tools, and create educational resources for coastal communities. Through the OCPP, the UK government partners with eligible countries to deliver positive impacts on the livelihoods of coastal communities that depend on healthy marine ecosystems, focussing on sustainable seafood, marine pollution and marine biodiversity."
        },
        {
            "heading": 2,
            "text": "Wildlife trade and the need to protect sharks and rays in Sri Lanka"
        },
        {
            "text": "Sharks and rays are slow growing animals and produce few offspring, life-history traits which make them particularly susceptible to overfishing. In Sri Lanka, 66% of shark and ray species are listed as threatened by extinction by the International Union for Conservation of Nature (IUCN), and 81% of the total elasmobranch landings fall within this threatened category."
        },
        {
            "text": "Daniel Fernando, co-founder, and Director of Blue Resources Trust explains “To effectively manage sharks and rays in Sri Lanka, we require science-based management.”"
        },
        {
            "text": "CITES (the Convention on International Trade in Endangered Species of Wild Fauna and Flora), is an international agreement which ensures trade in (listed) wild animals does not threaten their survival and it includes many elasmobranch species. Many species landed in markets in Sri Lanka are listed under Appendix II of CITES which means trade is allowed but should be regulated. Regulation of this trade is based on a Non-Detriment Finding (NDF) which is an assessment showing that trade is only allowed at sustainable levels. Data on what sharks and rays are being caught and landed is currently limited, but improving this will support better NDFs and potentially, enable stock assessments to inform appropriate (sustainable) catch and trade levels.  Throughout the world there is a significant market for elasmobranch products. Sharks and rays are traded for their fins for use in traditional Asian cuisine, mobulid rays are caught for their gill plates to supply the Chinese medicine market, and other species of rays for their skin which is used for leather-like products. For this reason, elasmobranchs are often processed at landing sites and markets with fins and other body parts detached. Therefore, not only do sharks and rays need to be identified correctly, they may also need to be identified correctly from their constituent body parts at the point of trade."
        },
        {
            "heading": 2,
            "text": "Collaborative working in Sri Lanka"
        },
        {
            "text": "In February 2023, colleagues from Cefas travelled to Sri Lanka to facilitate a two-day shark and ray identification workshop. The workshop was delivered by international shark expert, Dr. Rima Jabado, and mobulid ray expert, Daniel Fernando. Over twenty frontline fisheries officers attended from across Sri Lanka working for the National Aquatic Resources Research and Development Agency (NARA) and Department of Fisheries and Aquatic Resources (DFAR), in addition to several researchers at BRT."
        },
        {
            "text": " "
        },
        {
            "text": "Daniel Fernando continues, \"Through training workshops such as this, we are able to improve our ability to identify sharks and rays, which in turn ensures we can collect better species-specific data.\""
        },
        {
            "text": "The workshop was held in the coastal city of Negombo, and was divided into identification presentations, interactive group work and an eye-opening trip to the local fish market. Expert training on shark and ray identification techniques was delivered by Dr. Rima Jabado and Daniel Fernando with the aid of three new training guides created in collaboration with Cefas. Throughout the workshop, the trainers stressed the need for species-specific data. Currently, the Sri Lankan authorities collect a large amount of aggregated species data due to the high numbers of elasmobranch species landed at markets and the lack of experience in species identification. This makes it harder to monitor trends in and estimate the total removals from elasmobranch populations. Without data on specific species, we are not able to implement effective protection measures."
        },
        {
            "text": "Daniel Fernando continues, \"Through training workshops such as this, we are able to improve our ability to identify sharks and rays, which in turn ensures we can collect better species-specific data.\""
        },
        {
            "text": "An early morning alarm to get to the Negombo fish market allowed participants to put their new skills into action.  The fast-paced fish market highlighted the true extent of the challenges facing data collection in Sri Lanka. The Negombo fish market is just one landing site in over 900 across the country which can be as small as a local beach front. The vessels landing into the market made just a fraction of the >50,000 registered fishing boats of Sri Lanka, a far cry away from the ~6,000 vessels registered here in the UK."
        },
        {
            "text": "On witnessing the fish market in full swing, Dr. Joanna Murray from Cefas remarked, “The scale of the task for fisheries staff monitoring landings of elasmobranchs at markets and landing sites is huge. They need to identify what species are being landed and sold, how many, their size and where they were caught, in a matter of minutes. The ID training workshop we are supporting here will give fisheries staff the practical skills needed to support this challenge.”"
        },
        {
            "text": "Ending the two-day event, the participants presented their findings from the market, equipped with new identification tools and skills to correctly identify sharks and rays. Final discussions among participants highlighted the success of the theory and practical training at the workshop.  "
        },
        {
            "heading": 2,
            "text": "Looking to the future "
        },
        {
            "text": "It is clear that improving management of elasmobranchs in Sri Lanka starts with improving data collection, and the fisheries officers of NARA and DFRA are an integral link between fishing activity and fisheries management.  "
        },
        {
            "text": "Daniel Fernando added, \"This is however just one small step forward, and we need to do a lot more to ensure shark and ray populations do not collapse as that would be a great loss to our national biodiversity and en even larger issue for communities relying on these species for income and food security.\"."
        },
        {
            "text": "Through the OCPP, Cefas will continue working with BRT on shark and ray data collection in Sri Lanka. We aim to build upon identification training delivered to frontline fisheries staff who are responsible for recording accurate data and will collaborate on the updating of Sri Lanka's National Plan of Action for sharks and rays in support of future elasmobranch fisheries and trade management. "
        },
        {
            "text": " "
        }
    ]
}