{
    "url": "https://digitalhealth.blog.gov.uk/2022/06/21/bigger-role-for-dhsc-in-leading-health-and-care-digital-service-assessments/",
    "title": "Bigger role for DHSC in leading health and care digital service assessments",
    "authors": [
        "Karina Lewis",
        "Lizzy Bell"
    ],
    "categories": [
        "Assurance",
        "Service assessments"
    ],
    "pub_date": "2022-06-21T16:09:04+01:00",
    "content": [
        {
            "text": "On Thursday 9 June, the Central Digital and Data Office (CDDO) published their roadmap, Transforming for a digital future: 2022 to 2025 roadmap for digital and data."
        },
        {
            "text": "This includes some changes to who will organise service assessments. "
        },
        {
            "text": "CDDO will focus primarily on supporting the top 75 gov.uk services, while all other services will have assessments organised by their department, in the same way that departments currently organise assessments of services under 100,000 annual transactions. "
        },
        {
            "text": "This means a bigger role for the DHSC assurance team, who - from the summer - will start to run all service assessments, including those with over 100,000 transactions a year. "
        },
        {
            "text": "The DHSC assessment team has recently expanded, is well-established, and regularly facilitates assessments for major services, including those over the 100k threshold and rapid Covid reviews. This is an exciting opportunity to build on the great work of health assessors and assurance teams and the CDDO assessment team. "
        },
        {
            "text": "Existing health assessors will not be expected to take on more assessments or to assess bigger services, unless they want to. There is an existing pool of cross-government assessors. CDDO and departments are working together now on the practicalities. "
        },
        {
            "heading": 2,
            "text": "What this means for service teams"
        },
        {
            "text": "There is no change to the level of assurance and support that services will receive. All national digital services will still need to have a service assessment in exactly the same way they do now, working to the same standards. "
        },
        {
            "text": "The only change will be that DHSC will lead on organising all assessments. Right now, the assessment process and standard to which services must work is identical, whether an assessment is currently organised by DHSC or CDDO, and whether a service is delivered via gov.uk, nhs.uk, on a partner organisation’s website, or elsewhere.    "
        },
        {
            "heading": 2,
            "text": "What this means for the assessor community "
        },
        {
            "text": "CDDO will support DHSC with assessor capacity as the department takes on more assessments. There is no change to the assessment process or the service standard. "
        },
        {
            "text": "CDDO and DHSC will work together to continue to grow the department's assessor community. If you would like to become an assessor for DHSC, you can read more about the role including training, commitment and how to apply.  "
        },
        {
            "heading": 2,
            "text": "How to get involved "
        },
        {
            "text": "DHSC has some practical details to work out with CDDO and we will share more in the next few weeks. If you would like to ask a question about the changes, you can reach the assurance team on assurance@nhsx.nhs.uk or reach us on our #dhsc-assessors Slack channel. "
        }
    ]
}