{
    "url": "https://gds.blog.gov.uk/2022/06/21/building-digital-foundations-globally-with-service-standards/",
    "title": "Building digital foundations globally with service standards",
    "authors": [
        "Tony Richards - Standards and Assurance Lead, Government Digital Service",
        "Sarah Crandall - Regional Engagement Manager, Government Digital Service",
        "Jude Hanan - Principal Digital Advisor, Government Digital Service"
    ],
    "categories": [
        "Digital strategy",
        "People and skills",
        "Service design",
        "Transformation"
    ],
    "pub_date": "2022-06-21T10:00:43+01:00",
    "content": [
        {
            "text": "\"Simple, clear purpose and principles give rise to complex intelligent behaviour. Complex rules and regulations give rise to simple stupid behaviour.\" - Dee Hock"
        },
        {
            "text": "GDS Advisory International works across the globe helping countries on their digital transformation journey."
        },
        {
            "text": "In some of the countries we partner with, our focus is on co-delivering service standards. Written for digital people, by digital people, the standards are a set of principles that helps departments create great digital products or services. They are one of the foundations for any digital transformation project."
        },
        {
            "text": "Service standards are deployed in different forms in countries around the world, including the United Kingdom, Argentina, India and Singapore."
        },
        {
            "text": "We’re currently partnering with Cyprus, and one of the areas of work is their first service standard. The adoption of their contextualised service standard has changed their approach to public and private sector digital delivery."
        },
        {
            "text": "This proved critical in the delivery of their first exemplar service, through simplified language to make it more accessible and reduced input requirements for the user by applying integrations. The service standard enabled Cypriot colleagues to think of the service from a user’s perspective, reducing content and questions that are not relevant to their situation and making it easier for users to provide documents."
        },
        {
            "text": "The new Cyprus Service Standard, that is easy to understand and use, is fundamental to ensure quality and consistency to all government services.\" - Theodoros Demetriades, Cyprus Standards Lead"
        },
        {
            "text": "The unique principles that make up a service standard are  developed with each country and are the source of useful guidance for achieving quality digital services and products. Having simple principles such as \"understand users and their needs\" makes it easy for everyone to understand and follow."
        },
        {
            "text": "Most national or state governments’ service standards focus on 3 main themes for their principles:"
        },
        {
            "text": "We have been working on our own service standards since 2012, with several iterations along the way to reach the current 14 principles. To help grow the community, we have developed a process to support partner countries as they develop and tailor their own service standards and guidance."
        },
        {
            "heading": 2,
            "text": "Our approach to international co-delivery"
        },
        {
            "text": "By focusing on a country’s unique needs, GDS Advisory’s International Team supports countries to develop service standards that are bespoke to their requirements, markets and contexts. This drives not only what their final service standard looks like, but also how the service standard is developed. No matter whether it is in-person, delivered remotely, or a mix of both, we start with user needs, iterate, and develop a Minimum Viable Product (MVP) Service Standard for testing."
        },
        {
            "heading": 2,
            "text": "What we learned"
        },
        {
            "text": "Of course our own experience feeds into this process, but we’ve learned from and worked with many governments around the world."
        },
        {
            "heading": 3,
            "text": "1. Research early, research often"
        },
        {
            "text": "We start with thorough research about our partner country’s aims. We identify key priority areas for developing standards with them and focus on those."
        },
        {
            "text": "In 2020, our team worked with the digital agency of Penang in Malaysia to establish bespoke user research guidance for their service standard, to support their Digital Transformation Masterplan. Working with their team, we were able to test if the user research standards and guidance helped improve their understanding."
        },
        {
            "text": "Based on the findings, we changed their standards to focus more on user research. We also used our user research findings while working in Penang to help UK teams iterate and improve our digital and technology guidance."
        },
        {
            "heading": 3,
            "text": "2. Understanding user needs over user wants"
        },
        {
            "text": "We have learned the importance of listening to our stakeholders and the value of providing supportive challenges to ensure we are meeting their needs effectively."
        },
        {
            "text": "An example of this is with a partner in Eastern Africa, which wanted to work with GDS to improve its digital spend controls to get better value for money from its digital products and services. They had a form of assurance, but it did not meet user needs as projects were still being approved without clarity on outcomes or benefits."
        },
        {
            "text": "From our experience, assurance processes cannot add value on their own without clear standards to assure services against. Although standards were not a priority for them at the start of our work with them, we recognised their need and co-developed standards to complement the new spend controls process."
        },
        {
            "heading": 3,
            "text": "3. Keep a multidisciplinary approach throughout"
        },
        {
            "text": "Multidisciplinary expertise is central to creating user-centred and practical standards. Using a multidisciplinary team can bring together many different perspectives and areas of expertise to deliver a common goal."
        },
        {
            "text": "A key example of this is our work with the Government of Cyprus’s Digital Services Factory team. As mentioned, our GDS multidisciplinary team has been co-creating a new national service standard with our Cypriot counterparts. These standards define our work in building exemplar services for GOV.CY, with practical delivery experience."
        },
        {
            "text": "We used the service standards while co-delivering our first exemplar service. Each member of our multidisciplinary team is paired with a counterpart in the Cyprus Digital Services Factory to support the sharing of knowledge, build capacity and experience on how to apply the newly created service standards to a service."
        },
        {
            "text": "This ‘learning by doing’ approach enables the Digital Services Factory team to deliver better services that meet user needs. A multidisciplinary team working together helps us demonstrate how the standards work in practice. The experience we gain from working with the team forms the next iteration of the standards."
        },
        {
            "heading": 2,
            "text": "What lessons can departments in the UK learn?"
        },
        {
            "text": "Using service standards is essential for digital transformation. Our work demonstrates the strategic importance of service standards to digital transformation in the UK and worldwide and shows the importance of applying service standards."
        },
        {
            "text": "For those in departments either leading teams or working in them, these 3 lessons (research early and often, understanding user needs over that of user wants, and supporting multi-disciplinary teams) will help deliver services that meet user needs, and will help digital transform your department or organisation."
        }
    ]
}