{
    "url": "https://designnotes.blog.gov.uk/2022/06/21/four-years-as-a-content-designer-in-local-government/",
    "title": "Four years as a content designer in local government",
    "authors": [
        "Lizzie Ingram-Flynn – Content designer, DWP"
    ],
    "categories": [
        "Content Design"
    ],
    "pub_date": "2022-06-21T09:00:06+01:00",
    "content": [
        {
            "text": "When I started my role at Leeds City Council, we weren’t long out of the dark days of decentralised publishing, with no standards to speak of, no direction, and a distinct lack of user needs to guide us. "
        },
        {
            "text": "Leeds.gov.uk was in need of attention, as was our relationship with many of our service partners and colleagues, who were used to a certain way of doing things. They would send updates to our inbox, and we would implement them, no questions asked. "
        },
        {
            "heading": 2,
            "text": "Do the best you can with what you have"
        },
        {
            "text": "The transition to working closely with services to provide a measured and user-centred approach which adheres to codified content standards has been a hard one. "
        },
        {
            "text": "My first project was a review of web content for one of our most popular services. The subject matter was complex, and we had around 30 pages of content, full of duplicated information and jargon, with everything a related page of everything else. Navigating it was a little like being stuck inside a giant ball of wool. "
        },
        {
            "text": "We had no user researchers at the time, so had to do our best with the tools we had, speaking to our contact centre colleagues who dealt with calls and emails from the public every day. They helped us to tease out the language people used when they contacted the service, the varying emotional states people could be in and why, and to really understand how people saw the service as one transaction at a time. "
        },
        {
            "text": "Before, we were trying to tell people how the service works, which, unsurprisingly, wasn’t what anyone needed. The redesign was a blur of prototypes, post-its and painstaking pair writing sessions with our colleagues from the service. I believe that the result, though far from perfect, gave rise to the start of a culture shift within our team as well as the wider organisation. We began having regular liaison meetings with our colleagues to ensure changes could be planned and taken into consideration as part of the wider user journey. "
        },
        {
            "heading": 2,
            "text": "Take care of what you’ve got"
        },
        {
            "text": "Changing our process for managing content change requests was instrumental in raising the overall quality and consistency of the website."
        },
        {
            "text": " We started to have conversations about content requests with subject-matter experts, delving into the who, what, why and when. We continued to pair write, and began holding content critiques which included members of the relevant services. This ensured our colleagues felt part of the design process, which became more collaborative over time, allowing positive working relationships to flourish and our team to be respected across the council for our expertise and results. "
        },
        {
            "text": "A crucial part of this change in the way we work, yet one that often gets overlooked in the world of online content, was a focus on content maintenance. "
        },
        {
            "text": "The regularity of changes in business needs and processes within local government and their impact on our end users necessitates a plan for going forward. All the time and effort spent to understand their journey and needs, along with myriad design decisions made along the way would be wasted if we didn’t somehow retain this knowledge, and use it to inform future changes. "
        },
        {
            "text": "We therefore chose to follow in the footsteps of GDS and record user needs and design decisions for each piece of content that was reviewed. Our content editing team are able to refer to this when we get change requests for these areas. This allows us to ensure that the quality and usefulness of the work is preserved, giving us a mechanism to challenge requests that don’t meet user needs. "
        },
        {
            "heading": 2,
            "text": "Be realistic (and try to make friends)"
        },
        {
            "text": "A couple of months into my role, I was lucky enough to get a spot on a content design course. I was inspired to get back to work and start putting my new learning into practice, and was thoroughly looking forward to putting Leeds.gov.uk to rights. "
        },
        {
            "text": "But I soon realised that although the user-centred approach is as important as ever at a time when local governments are feeling the pressure of budget cuts and resultant desperation to channel-shift their users, the conversations I was having felt as difficult as ever. Our service contacts were often defensive in the early days – who were we to swoop in and tell them how to present their information? "
        },
        {
            "text": "The importance of understanding who you’re talking to when managing those essential stakeholder relationships, and where they’re coming from, can’t be underestimated. "
        },
        {
            "text": "I made efforts to learn all I could about the people I needed to work with. How long had they worked for their service, what was their role, what kind of interactions had our team had with them before? As a content designer, you can’t achieve much without subject-matter experts on board to help you, so if you can bring them along with you with their experience, feelings and motivations in mind, it goes a long way towards working successfully together. "
        },
        {
            "text": "Tied in with this is the balancing act between business and user needs. Although I began as a bit of a purist, making sure every word on the page was chosen carefully for the user, and that every concession from the service was hard won, it became apparent that this wasn’t the most efficient or practical way to work. "
        },
        {
            "text": "You could sit with your pair writing partner and try to persuade them over every point of style or wording, but this may mean you don’t have as much time to work on a more significant piece of content that’s going to have a far bigger effect on the overall user experience. There’s no such thing as perfect – pick your battles, and keep in mind that some things aren’t worth degrading a good working relationship over.  "
        },
        {
            "heading": 2,
            "text": "Good content is a team sport"
        },
        {
            "text": "Designing good content is a team sport. It’s also hard work, and in an organisation where it’s been more than a little tricky to get buy in for a user centred approach, it’s at times seemed like too much of a challenge to contend with. "
        },
        {
            "text": "Despite the difficulties, I’ve been incredibly lucky to work with the people I have, and I’m so proud of how far we’ve come with our online content in just a few short years. An achievement I share not only with my immediate team, but also with our colleagues across the wider council who have been willing to do the hard work with us to make interacting with council services easier for our residents. "
        },
        {
            "text": "Since writing this post, I’ve moved on to new content design challenges in the Civil Service, but as a Leeds resident I’m looking forward to seeing how Leeds.gov.uk continues to evolve in the future."
        }
    ]
}