{
    "url": "https://civilservice.blog.gov.uk/2022/06/21/life-as-a-reservist/",
    "title": "Life as a Reservist",
    "authors": [
        "Sam Tillotson"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-06-21T11:43:06+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Armed Forces Day is celebrated on 25 June and is a chance to show your support for the Armed Forces community. Since joining the Army Reserves, civil servant Sam Tillotson has honed his leadership skills learned to drive a tank and survive in a snow hole and travelled the world."
        },
        {
            "text": "I joined the Army Reserves 20 years ago, because an advert of someone abseiling caught my eye and I thought it looked like fun. Since then, I’ve trained in close to 20 countries, deployed to Afghanistan twice, carried out 400 skydives out of planes and helicopters of all shapes and sizes, and scuba-dived in shipwrecks in tropical seas."
        },
        {
            "text": "I’ve also skied all over Europe, visited  Buckingham Palace, attained my masters degree, taught counter-terrorism in North Africa, and learned to drive a tank. I’m hoping they’ll let me try abseiling soon because all this other stuff must be costing the Army a fortune!  "
        },
        {
            "text": "I joined as a Private soldier, became a University Cadet, then a Regular Officer (i.e. full time) and now I’m a Reservist Officer. You could say the Army has been part of my life for as long as I can remember. Training over the occasional weekend adds something interesting into my spare time, and I love the fact I can continue to serve whilst working full-time in the Civil Service. The commitment depends on your unit, but I do most of my training over weekends, evenings and a two-week training package, so it’s reasonably easy to manage, even with a young family.  "
        },
        {
            "heading": 4,
            "text": "COVID-19 to crewing ambulances"
        },
        {
            "text": "The Reserves regularly deploy personnel to support operations at home and abroad, and it’s a great feeling to be able to contribute during times of need. During the last few years, my unit has provided troops to COVID-19 vaccination centres, to Wales crewing ambulances to help local communities during flooding, and to operations in Eastern Europe to bolster regular forces. It's varied, fun and provides an amazing network of people who have a shared connection and a sense of public service.  "
        },
        {
            "heading": 4,
            "text": "All walks of life"
        },
        {
            "text": "On top of that, it provides a brilliant opportunity to improve your leadership style, gain new qualifications and learn new skills. One of the most rewarding elements is the way it brings all walks of life together. My unit has airline pilots, doctors, teachers, painters, mechanics, dog walkers, window cleaners, web designers, whisky distillers and almost every other profession you can think of, all working together to achieve a collective goal. Working with people with such diverse skills and backgrounds helps challenge the way you think and injects new ideas to your ways of working. And let’s face it, it’s always handy to know a couple of good plumbers, mechanics and publicans.  "
        },
        {
            "heading": 4,
            "text": "Supportive employers"
        },
        {
            "text": "Most employers are increasingly supportive of Reservists (thanks to initiatives like the Ministry of Defence’s Employer Recognition Scheme), but the Cabinet Office is the best I’ve come across to date. I get three weeks leave to take part in training, support from the brilliant CO Armed Forces Network, and my director is really aware of the benefits Reserve service brings to my day job. And now the Civil Service has launched the Great Place to Work scheme, it makes it even more attractive for Reservists and veterans to join the Civil Service for the first time."
        },
        {
            "text": "If you are  considering joining any of the Reserve Forces, I can’t recommend it highly enough. You can leave any time if it’s not for you, and they’ll pay you for your time (including an annual tax-free lump sum)."
        },
        {
            "text": "Whether you’re interested in serving with the Royal Navy, Royal Marines, Army or RAF, there is almost certainly an opportunity for you close to home.  And if you have a specialist skill or interest, there are national units that you could join which come with a reduced commitment. There’s no need to be super fit as they’ll train you to meet even the basic entry standards. Oh, and I promise that nobody shouts at you, much.  "
        },
        {
            "text": "Want to join?"
        },
        {
            "text": "If you’d like to know more, drop me a line on sam.tillotson@cabinetoffice.gov.uk "
        }
    ]
}