{
    "url": "https://defencedigital.blog.gov.uk/2024/12/05/accelerating-defence-software-in-2024-the-latest-highlights-from-d2s/",
    "title": "Accelerating Defence software in 2024: The latest highlights from D2S",
    "authors": [
        "Hayley P"
    ],
    "categories": [
        "Digital Foundry",
        "Digital Innovation"
    ],
    "pub_date": "2024-12-05T14:01:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Defence Developer Services (D2S) is part of Defence Digital Foundry and provides products that will enable the software development community to accelerate the delivery of software and applications for Defence. "
        },
        {
            "text": "Hello everyone! It’s been a few months since my last update on D2S, so I wanted to share some key highlights from this year."
        },
        {
            "text": "D2S has become a hub for products and services that help developers accelerate software development and deployment. Recently, our team has been hard at work expanding our offerings to better support our users."
        },
        {
            "text": "Our focus has been on streamlining processes, boosting efficiency, and enhancing collaboration across Defence projects. Here’s our latest product offering:"
        },
        {
            "text": "Key developments"
        },
        {
            "text": "We’ve made significant progress this year in building our SECRET environment on the D2S Platform and preparing for a Public Beta launch. We’ve supported 3 Defence application teams to deploy their applications and the feedback so far has been fantastic, highlighting the rapid support and efficiency D2S provides."
        },
        {
            "text": "Offering both OFFICIAL and SECRET environments will support Defence teams to meet the different security classifications that they need to operate in. "
        },
        {
            "text": "The automated CDS will enable seamless data transfer from OFFICIAL to SECRET, reducing manual effort and easing the workload for teams. Initially, we’re using CDS internally to refine the service, but it will be available to users early next year—offering real-time agility for SECRET applications."
        },
        {
            "text": "Public Beta for SECRET will launch soon, and we’re excited to welcome more users. If you’re interested, reach out to the team to register!"
        },
        {
            "text": "We’ve launched Discovery and Alpha phases for several upcoming products: Access, Tools at SECRET, Reuse, and Platform Management Services. These early stages let us explore and shape these products to meet user needs effectively."
        },
        {
            "text": "We’re excited to launch our Embedded Teams offering, providing Defence teams with skilled platform engineers to support software delivery."
        },
        {
            "text": "These experts work directly within application teams, leveraging their platform knowledge to speed up development and deployment. With this tailored support, teams can accelerate software delivery, ensuring faster access for Defence end users."
        },
        {
            "text": "Partnerships and looking ahead"
        },
        {
            "text": "We’ve been exploring new collaborations, such as working with the Defence AI Centre (DAIC), to bring fresh perspectives and innovation to our services. By engaging with industry experts and external stakeholders, we aim to stay ahead and deliver the most relevant solutions to the Defence community."
        },
        {
            "text": "Our commitment to excellence and continuous improvement remains central as we adapt to the evolving needs of Defence developers and digital teams. Thank you for your ongoing support and partnership in making D2S a valuable resource for the Defence sector. Together, we’re driving innovation and achieving great things across the Defence landscape."
        },
        {
            "text": "For more details about D2S, visit the D2S Portal, or learn more about Foundry Services on MOD Digital."
        }
    ]
}