{
    "url": "https://food.blog.gov.uk/2024/12/05/bovaer-cow-feed-additive-explained/",
    "title": "Bovaer cow feed additive explained",
    "authors": [
        "Natasha Smith, Deputy Director of Food Policy"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-12-05T12:23:23+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "There has been widespread media coverage and discussion on social media about a feed additive called Bovaer being trialled to reduce methane emissions from dairy cows to help combat climate change."
        },
        {
            "text": "Here we answer some of the questions being asked about the additive."
        },
        {
            "heading": 2,
            "text": "Is milk from cows fed Bovaer safe for us to drink?"
        },
        {
            "text": "Milk from cows given Bovaer, a feed additive used to reduce methane emissions, is safe to drink. The additive is metabolised by the cows so does not pass into the milk."
        },
        {
            "text": "Bovaer, a brand name for the additive 3-Nitrooxypropanol or “3-NOP”, has undergone rigorous safety assessments as part of the FSA’s market authorisation process, and is approved for use in Great Britain. It has also been approved for use in other countries including in the EU, Australia, Canada and the US. "
        },
        {
            "heading": 2,
            "text": "How are feed additives tested and approved?"
        },
        {
            "text": "All authorised feed additives undergo the FSA's rigorous safety assessment. This ensures products are safe for the UK market. "
        },
        {
            "text": "Businesses must demonstrate the safety of the additive - for the animal, consumers, workers and the environment."
        },
        {
            "text": "To ensure the assessment is as robust as possible, independent experts from the Advisory Committee on Animal Feedingstuffs assess the evidence and provide advice to the FSA to inform the final safety assessment."
        },
        {
            "text": "The FSA safety assessment for Bovaer (3-Nitrooxypropanol or “3-NOP”) was published in March 2023 and can be found on the FSA website. The advice of the independent Advisory Committee on Animal Feedingstuffs is available on their website."
        },
        {
            "heading": 2,
            "text": "Why have you approved Bovaer when there are known safety issues?"
        },
        {
            "text": "The FSA safety assessment concluded there are no safety concerns when Bovaer is used at the approved dose."
        },
        {
            "text": "It does not cause cancer (it is not carcinogenic or genotoxic) and poses no safety concerns to consumers, animals or the environment."
        },
        {
            "text": "More than 58 studies on potential risks were evaluated and it was concluded that the additive is safe at twice the recommended dose."
        },
        {
            "text": "The additive is metabolised by the cows so does not pass into the milk. It was not found in milk in any of the trials presented to the FSA."
        },
        {
            "heading": 2,
            "text": "Is Bovaer approved in other countries?"
        },
        {
            "text": "Bovaer has been authorised for use globally including in the EU, Australia, Canada and the US. "
        },
        {
            "text": "In the EU the additive was authorised according to Regulation (EC) No 1831/2003 on additives for use in animal nutrition in April 2022. Bovaer has more recently been authorised in Canada in January 2024, and in the US in May 2024."
        },
        {
            "heading": 2,
            "text": "Will the milk from cows fed Bovaer be labelled?"
        },
        {
            "text": "Feed additives are not labelled within the ingredients list of food products. In this particular case, the additive is metabolised by the cows so does not pass into the milk."
        },
        {
            "heading": 2,
            "text": "Is it safe for the animals that eat the feed?"
        },
        {
            "text": "Animal safety was considered as part of the FSA’s safety assessment and no adverse effects related to the use of Bovaer were observed at the recommended dose."
        },
        {
            "heading": 2,
            "text": "Is it safe for those working with animals and using the feed?"
        },
        {
            "text": "Worker safety was considered within the safety assessment. There are no safety concerns for workers handling the additive when used as directed, and appropriate personal protective equipment is used."
        },
        {
            "text": "The assessment concluded the additive - in its pure form at the manufacturing stage - should be considered corrosive to the eyes, a skin irritant and potentially harmful by inhalation, but is not harmful at the point it is fed to animals."
        },
        {
            "heading": 1,
            "text": "Esbonio ychwanegyn bwyd buchod o’r enw Bovaer"
        },
        {
            "text": "Mae ychwanegyn bwyd anifeiliaid o’r enw Bovaer wedi bod yn derbyn sylw eang yn y cyfryngau a bu sawl trafodaeth amdano ar gyfryngau cymdeithasol. Mae’r ychwanegyn hyn yn cael ei dreialu i leihau allyriadau methan o wartheg godro er mwyn helpu i frwydro yn erbyn newid yn yr hinsawdd."
        },
        {
            "text": "Dyma ateb rhai o’r cwestiynau cyffredin am yr ychwanegyn."
        },
        {
            "heading": 2,
            "text": "Ydy llaeth buchod sy’n cael eu bwydo â Bovaer yn ddiogel i ni ei yfed? "
        },
        {
            "text": "Mae llaeth buchod sy’n cael eu bwydo â Bovaer, sef ychwanegyn bwyd anifeiliaid a ddefnyddir i leihau allyriadau methan, yn ddiogel i’w yfed. Mae’r ychwanegyn yn cael ei fetaboleiddio gan y buchod, felly nid yw’n trosglwyddo i’r llaeth."
        },
        {
            "text": "Mae Bovaer, sef enw brand ar gyfer yr ychwanegyn 3-Nitroocsypropanol neu “3-NOP”, wedi bod yn destun asesiadau diogelwch trwyadl fel rhan o broses awdurdodi’r Asiantaeth Safonau Bwyd (ASB) i allu rhoi cynnyrch ar y farchnad. Mae wedi’i gymeradwyo i’w ddefnyddio ym Mhrydain Fawr ac mewn gwledydd eraill, gan gynnwys yn yr UE, Awstralia, Canada a’r Unol Daleithiau. "
        },
        {
            "heading": 2,
            "text": "Sut mae ychwanegion bwyd anifeiliaid yn cael eu profi a’u cymeradwyo?"
        },
        {
            "text": "Mae pob ychwanegyn bwyd anifeiliaid awdurdodedig yn destun asesiad diogelwch trwyadl gan yr ASB. Mae hyn yn sicrhau bod cynhyrchion yn ddiogel ar gyfer marchnad y DU. "
        },
        {
            "text": "Rhaid i fusnesau ddangos bod yr ychwanegyn yn ddiogel, a hynny mewn perthynas â’r anifail, defnyddwyr, gweithwyr a’r amgylchedd."
        },
        {
            "text": "Er mwyn sicrhau bod yr asesiad mor gadarn â phosib, mae arbenigwyr annibynnol o’r Pwyllgor Cynghori ar Fwydydd Anifeiliaid yn asesu’r dystiolaeth ac yn rhoi cyngor i’r ASB sy’n llywio’r asesiad diogelwch terfynol."
        },
        {
            "text": "Cyhoeddwyd asesiad diogelwch yr ASB ar gyfer Bovaer (3-Nitroosypropanol neu “3-NOP”) ym mis Mawrth 2023, a gellir ei ddarllen ar wefan yr ASB. Mae cyngor annibynnol y Pwyllgor Cynghori ar Fwydydd Anifeiliaid ar gael ar ei wefan."
        },
        {
            "heading": 2,
            "text": "Pam ydych chi wedi cymeradwyo Bovaer pan fo materion diogelwch hysbys?"
        },
        {
            "text": "Daeth asesiad diogelwch yr ASB i’r casgliad nad oes unrhyw bryderon diogelwch pan ddefnyddir y dos cymeradwy o Bovaer."
        },
        {
            "text": "Nid yw’n achosi canser (nid yw’n garsinogenig nac yn genotocsig), ac nid yw’n peri unrhyw bryderon diogelwch i ddefnyddwyr, anifeiliaid na’r amgylchedd."
        },
        {
            "text": "Gwerthuswyd mwy na 58 o astudiaethau ar y risgiau posib, a daethpwyd i’r casgliad bod yr ychwanegyn yn ddiogel hyd at ddwywaith y dos a argymhellir."
        },
        {
            "text": "Mae’r ychwanegyn yn cael ei fetaboleiddio gan y buchod, felly nid yw’n trosglwyddo i’r llaeth. Ni ddaethpwyd o hyd iddo mewn llaeth yn unrhyw un o’r treialon a gyflwynwyd i’r ASB."
        },
        {
            "heading": 2,
            "text": "A yw Bovaer wedi’i gymeradwyo mewn gwledydd eraill?"
        },
        {
            "text": "Mae Bovaer wedi’i awdurdodi i’w ddefnyddio’n fyd-eang gan gynnwys yn yr UE, Awstralia, Canada a’r Unol Daleithiau. "
        },
        {
            "text": "Yn yr UE, awdurdodwyd yr ychwanegyn yn unol â Rheoliad (CE) Rhif 1831/2003 ar ychwanegion i’w defnyddio mewn maeth anifeiliaid ym mis Ebrill 2022. Yn fwy diweddar, awdurdodwyd Bovaer yng Nghanada ym mis Ionawr 2024, ac yn yr UD ym mis Mai 2024."
        },
        {
            "heading": 2,
            "text": "A fydd llaeth o wartheg sy’n cael eu bwydo â Bovaer yn cael ei labelu i nodi hyn? "
        },
        {
            "text": "Nid yw ychwanegion bwyd anifeiliaid yn cael eu labelu o fewn rhestr gynhwysion cynhyrchion bwyd. Yn yr achos penodol hwn, mae’r ychwanegyn yn cael ei fetaboleiddio gan y buchod, felly nid yw’n trosglwyddo i’r llaeth."
        },
        {
            "heading": 2,
            "text": "A yw’n ddiogel i’r anifeiliaid sy’n bwyta’r bwyd anifeiliaid?"
        },
        {
            "text": "Ystyriwyd diogelwch anifeiliaid fel rhan o asesiad diogelwch yr ASB, ac ni welwyd unrhyw effeithiau andwyol yn ymwneud â defnyddio Bovaer ar y dos a argymhellir."
        },
        {
            "heading": 2,
            "text": "A yw’n ddiogel i’r rhai sy’n gweithio gydag anifeiliaid ac yn defnyddio’r bwyd anifeiliaid?"
        },
        {
            "text": "Roedd diogelwch gweithwyr yn cael ei ystyried yn yr asesiad diogelwch. Nid oes unrhyw bryderon diogelwch i weithwyr sy’n trin yr ychwanegyn pan gaiff ei ddefnyddio yn ôl y cyfarwyddiadau, a phan ddefnyddir cyfarpar diogelu personol priodol."
        },
        {
            "text": "Daeth yr asesiad i’r casgliad y dylai’r ychwanegyn – yn ei ffurf pur ar y cam gweithgynhyrchu – gael ei ystyried yn gyrydol i’r llygaid, yn llidus ar y croen ac o bosib yn niweidiol wrth ei anadlu, ond nad yw’n niweidiol ar yr adeg y caiff ei fwydo i anifeiliaid."
        },
        {
            "text": "Yn gyffredinol, daeth asesiad diogelwch yr ASB i’r casgliad nad oes unrhyw bryderon diogelwch pan ddefnyddir y dos cymeradwy o Bovaer."
        }
    ]
}