{
    "url": "https://nationalscreening.blog.gov.uk/2024/12/05/health-screening-module-as-popular-as-ever-in-its-14th-year/",
    "title": "Health screening module as popular as ever in its 14th year",
    "authors": [
        "Harriet Strachan"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-12-05T08:32:25+00:00",
    "content": [
        {
            "text": "The popular annual health screening module at the University of Warwick completed another successful run in November, marking its 14th year.  "
        },
        {
            "text": "The 5-day course, run by Warwick Medical School in conjunction with the UK National Screening Committee (UK NSC) since 2010, provides an understanding of the underlying epidemiological principles of screening, as well as exploring a wide range of ethical and policy issues.  "
        },
        {
            "text": "Alongside enhancing professional development and knowledge of screening, the course brings together people who work across the screening pathway, from policy to delivery, so there is the opportunity to network and share expertise. "
        },
        {
            "text": "Attendees this year included midwives, health economists, screening policy and quality assurance leads, consultants in public health, doctors, screening commissioners and researchers. They all brought with them a wealth of knowledge and experience.  "
        },
        {
            "text": "Steven Senior, a Consultant in Public Health based in Manchester and a UK NSC bursary student on the course, said: “I have a responsibility, in my role as a consultant in public health in a local authority, around scrutinising local screening programmes and helping commissioners and providers to reach under-served communities. This includes a responsibility to champion high standards of evidence and quality in local screening programmes, and act as an advocate for the UK National Screening Committee’s advice locally.  "
        },
        {
            "text": "“The course was an excellent experience all round, not only for the technical content, which was really well delivered and organised, but also for the chance to spend some time with other people who have a deep interest in screening.” "
        },
        {
            "text": "Having completed the course, Steven and the other students are now part of a highly valued expert cohort of screening professionals which the UK NSC and the Department of Health and Social Care (DHSC) screening team can call on for advice and input when needed. "
        },
        {
            "text": "As a data analyst within the DHSC screening team myself, I found the module extremely helpful and insightful. It was inspiring to meet people from a variety of disciplines who are all passionate about running and improving national screening programmes.  "
        },
        {
            "text": "I learned a lot about the multitude of calculations and research behind every screening programme, and this highlighted the importance of continuously reviewing each programme to make sure it runs to the highest standard. I will apply this to my work analysing the effectiveness of screening programmes so that both successes and areas of improvement continue to be identified.   "
        },
        {
            "text": "For more information on education and training resources for people working in and with UK NSC-recommended NHS screening programmes, please see Education and training for screening-related professionals. "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}