{
    "url": "https://environmentagency.blog.gov.uk/2024/12/05/world-soil-day-unearthing-the-secrets-of-soil/",
    "title": "World Soil Day: Unearthing the secrets of soil ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Sustainability"
    ],
    "pub_date": "2024-12-05T08:39:37+00:00",
    "content": [
        {
            "text": "Happy World Soil Day! Let's take a moment to appreciate the incredible role soil plays in our lives. Healthy soil is the foundation of sustainable agriculture, biodiversity, and climate resilience. This year, we delve deeper into our internal efforts to measure, monitor, and manage soil health, with three ground-breaking case studies that show our dedication to sustainable soil science. Let’s hear their stories:  "
        },
        {
            "text": "Measuring soil with Agnes Maina "
        },
        {
            "text": "Hi, I am Agnes Maina, and I am an Agriculture Regulatory Inspection Officer. Growing up on a farm, my passions for the soil and desire to understand soil were natured from an early age. I am deeply engaged in soil, with a diverse background in various facets of agriculture. This included contributing to research supported by the Tropical Agriculture Association, focusing on the practicality of conservation agriculture in mixed crop-livestock systems for fodder production with the African tillage Network, and contributing to advancement of soil management practice and techniques. "
        },
        {
            "text": "My Role is funded through the Agriculture Regulatory Taskforce, which has provided me with extensive training to understand and measure soils. This involves visual assessment of soils on agricultural land for compaction, soil health and identifying potential or actual problems with land management. The training has equipped me with the skills to ensure I am able to identify potential or ongoing issues, discuss issues with land managers and offer advice and guidance. "
        },
        {
            "text": "Looking after our soil is critical to addressing interconnected challenges of climate change biodiversity loss, food security and water quality. A deeper understanding is needed to understand this beautiful resource. Feed the soil and it will feed us! "
        },
        {
            "text": "Monitoring soil with Stephen Webster "
        },
        {
            "text": "Hi, I’m Stephen Webster. I am an expert on soil health and management in the Devon and Cornwall land management team. I work closely with land managers to reduce the risk of flooding and soil erosion polluting watercourses.  "
        },
        {
            "text": "One of the tools we use to understand the inherent risks a field has for soil erosion is the ALERT tool, developed by agricultural specialists across the EA including our scientists from the Chief Scientist’s Group. It is a mapping tool that is based on a collection of very detailed remotely sensed data. You can use it, too, as it is publicly available via the FAS website.  "
        },
        {
            "text": "The tool could also help us to understand where surface water flows could occur. I say could as depending on the soil type this surface water flow pathway should not occur unless the soil is compacted or in an extreme weather event. "
        },
        {
            "text": "Managing soil with Alison Douglas "
        },
        {
            "text": "Hello! I’m Alison Douglas, a farming officer working for the Wader EU Life Project, a major £5.8m nature recovery project helping to reverse the decline of river, coastal and marine habitats in the Tweed Catchment and Northumberland Coast.  "
        },
        {
            "text": "We are working in partnership with farmers and landowners in Northumberland to help them manage and improve soil health thereby reducing diffuse pollution. Soils in poor condition can severely impact local water quality as well as biodiversity and productivity of farmland.  "
        },
        {
            "text": "I joined the project in July 2024 and am continuing the work of identifying issues and advising on good soil husbandry. We are using the results to understand and manage soils across the region and support soil improvement and nourishment. "
        },
        {
            "text": "Improved soils will not only allow the land to better retain nutrients and absorb pollutants so less ends up leaching into watercourses but will also boost crop production. This will be a big win for nature and biodiversity, climate resilience and also food security. "
        },
        {
            "text": "What's Next? "
        },
        {
            "text": "There are many more projects we are working on right now within and beyond the Chief Scientist’s Group. These projects cover a range of studies such as monitoring carbon that is stored in the soil, managing harmful substances in soil, and measuring the properties of peat in farms. Our dedication to soil science is more important than ever as we face global environmental challenges. By continuously improving our methods to monitor, measure, and manage soil health, we contribute to a more sustainable future. Let's continue to nurture our earth and ensure that our soils remain healthy and fertile for generations to come."
        },
        {
            "text": "Visit the official World Soil Day website for more information on how world soil day is marked internationally. "
        },
        {
            "text": "Subscribe to get new blog updates from the Environment Agency delivered to your inbox.   "
        }
    ]
}