{
    "url": "https://defrafmp.blog.gov.uk/2025/05/01/bridging-the-evidence-gap-update-on-research-projects-supporting-fmps/",
    "title": "Bridging the evidence gap: update on research projects supporting FMPs",
    "authors": [
        "​​Jennifer Scott - Fisheries Science Advisor, Defra​",
        "Katie St John Glew - FMP Evidence Lead, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Evidence"
    ],
    "pub_date": "2025-05-01T09:00:05+01:00",
    "content": [
        {
            "text": "In our introduction to evidence and fisheries management plans (FMPs), blog post we talked about taking an evidence-based approach to developing our plans and identifying where there are gaps in evidence. "
        },
        {
            "text": "Last year, we commissioned six Research and Development (R&D) projects to start addressing some of these gaps and are pleased to share our recently published newsletter which gives updates on some of this exciting research. "
        },
        {
            "text": "You’ll find updates on some of these projects, as well as some longer-term research which contributes to all the published FMPs, alongside key facts and context, scope, timeframes and expected outcomes. "
        },
        {
            "text": "Read it here: Fisheries Management Plans Research and Development projects newsletter "
        },
        {
            "text": "This collaborative programme of work brought together policy makers, industry representatives, and academic researchers to co-design practical, evidence-based solutions for sustainable fisheries.  "
        },
        {
            "text": "The research focused particularly on understudied but economically valuable species. By addressing challenges such as data limitations and the unique lifecycle characteristics of species like cuttlefish, these projects aimed to support coastal communities while ensuring long-term sustainability of marine resources. "
        },
        {
            "text": "Each of the projects highlighted in the newsletter are listed under the FMPs they relate to: "
        },
        {
            "text": "Crab and lobster FMP and whelk FMP "
        },
        {
            "text": "Southern North Sea and Channel demersal non-quota species FMPs "
        },
        {
            "text": "King scallop FMP "
        },
        {
            "text": "Bass FMP "
        },
        {
            "text": "All FMPs "
        },
        {
            "text": "On 18 March Defra hosted a “Science and FMPs: progress made and exploring the future” event where we discussed the outputs of these projects in more detail.  "
        },
        {
            "text": "Subscribe to the blog for further insights on the event and to see the final outputs of these projects. "
        }
    ]
}