{
    "url": "https://educationhub.blog.gov.uk/2025/05/how-can-schools-celebrate-ve-day-and-what-resources-are-available/",
    "title": "How can schools celebrate VE day and what resources are available?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools",
        "Schools"
    ],
    "pub_date": "2025-05-01T16:23:43+01:00",
    "content": [
        {
            "text": "The 80th anniversary of VE Day will be marked on 8 May 2025 – signalling eight decades since the end of the Second World War in Europe."
        },
        {
            "text": "This year's commemorations provide a unique opportunity to connect younger generations with this pivotal chapter in history. Through personal stories, community events, and educational resources, we can ensure that the significance of VE Day and the sacrifices made during those challenging years are remembered and understood."
        },
        {
            "text": "This guest post is presented by the Imperial War Museum and includes a range of ideas for schools to mark the occasion – including activities and resources for classroom teaching, celebrations, and assemblies."
        },
        {
            "heading": 3,
            "text": "What is VE day and when was it?"
        },
        {
            "text": "On 8 May 1945, people in Britain and across the world celebrated Victory in Europe, now known as VE Day. This marked the unconditional surrender of Germany and meant an end to nearly six years of a war. Some people celebrated early. Many people in Britain didn't wait for the official day of celebration and began the festivities as soon as they heard the news on 7 May. After years of wartime restrictions and dangers – from food and clothes rationing to blackouts and bombing raids – many were finally able to let loose and enjoy themselves."
        },
        {
            "text": "The day became a public holiday, with parties on the streets across the nation, running late into the night. Villages, towns, and cities were decorated with flags and bunting."
        },
        {
            "text": "Prime Minister Winston Churchill addressed a crowd of thousands from the balcony of the Ministry of Health in Whitehall. The future Queen, Princess Elizabeth, secretly joined in the festivities, while servicemen, servicewomen, and civilians from Britain, the USA and other Allied Nations celebrated together in a day of unity."
        },
        {
            "heading": 3,
            "text": "How can schools celebrate VE day and what resources are available?"
        },
        {
            "text": "VE 80: Learning from Letters Learning Resource"
        },
        {
            "text": "As part of a national callout to mark the 80th anniversary of VE Day, the Imperial War Museum has launched a new schools resource for KS2 learners. Schools can use this resource ahead of VE Day, as well as on the day to explore themes around the 'when', 'what', and 'why' of VE Day."
        },
        {
            "text": "It will help students understand the significance of VE Day, using a broad range of sources from the Imperial War Museum’s collection to explore Victory in Europe and how the consequences of the Second World War reached beyond VE Day itself. It will also include links to eyewitness videos, providing an engaging insight into the memories of people who experienced VE Day in 1945. A letter writing workshop included in the resource will invite pupils to write or draw their own responses to what they have learnt about the wide variety of themes covered. Whether you focus on a single source, use several together or even all 12, the stories of real people will offer insight and inspiration to be used in the workshop activity."
        },
        {
            "text": "As well as a range of sources with starter activities, VE 80: Learning from Letters invites pupils to take part in a letter writing or drawing workshop. This workshop, with downloadable templates, offers students the chance to reflect on what they have learnt, to demonstrate their understanding and to offer their own responses. The templates help encourage students to imagine that they are a witness to VE Day, either as themselves, or as a created character."
        },
        {
            "text": "These resources can be used as part of a whole school assembly to share information or with smaller groups to complete suggested activities. Tag your work with #LearningFromLetters #VE80 to share your celebrations."
        },
        {
            "text": "Our shared story – all ages"
        },
        {
            "text": "Our Shared Story is a collection of educational resources to support young people to engage with VE Day 2025 80th anniversary commemorations, both inside and outside the classroom. We want every school child in the country to have the opportunity to connect with the stories of the end of the Second World War."
        },
        {
            "text": "The pack includes a range of curriculum resources for any school to use alongside activities or events relating to the VE and VJ Day 80 commemoration. It includes real experiences of sailors, soldiers, pilots and the children who were evacuated, as well as those who stepped in to support the efforts at home."
        },
        {
            "text": "The education pack will give primary and secondary schools as well as youth organisations the resources needed to create a meaningful assembly, classroom session, project or celebration in commemoration of VE Day.  "
        },
        {
            "text": "Discover more VE Day activities here: Education Pack."
        },
        {
            "heading": 3,
            "text": "How else is the Imperial War Museum commemorating VE Day 2025?"
        },
        {
            "text": " As part of the celebrations and commemorations taking place across the UK, Imperial War Museums has developed a range of family focused activities and learning resources."
        },
        {
            "text": "Family Street Parties on Monday 5 May 2025, 10-3pm"
        },
        {
            "text": "Families and communities are invited to join the Imperial War Museum at our family hubs at IWM London and IWM North."
        },
        {
            "text": "Celebrate 80 years since VE Day, the end of the Second World War in Europe, and enjoy street party activities, including interactive workshops on paper hat making, paper flower making, and paper plate portraiture and games for children."
        },
        {
            "text": "VE Day 80: Choir Performance on Monday 5 May 2025, 3-3.45pm"
        },
        {
            "text": "Visit IWM London and hear a live performance of songs from the 1940s to the present day, sung by a collection of local London choirs."
        },
        {
            "text": "This performance organised in collaboration with Sweet Track Productions, will evoke the unique blend of relief, celebration, sadness and community felt across the country 80 years ago, as the Second World War in Europe came to an end."
        }
    ]
}