{
    "url": "https://defraenvironment.blog.gov.uk/2025/05/01/single-use-vapes-why-its-time-to-ditch-them-for-good/",
    "title": "Single-use vapes: why it’s time to ditch them for good",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Recycling",
        "Resources and waste",
        "Sustainability"
    ],
    "pub_date": "2025-05-01T08:57:27+01:00",
    "content": [
        {
            "text": "On 1 June 2025, it will become illegal for businesses to sell or supply all single-use vapes. These include all ‘disposable’ vapes which are not refillable and use a battery which cannot be recharged.   The ban will come into force on the same day across England, Wales, Scotland and Northern Ireland.  "
        },
        {
            "text": "Read this post to find out how we got here and what this means for you. "
        },
        {
            "text": "Single-use vapes seemed to appear almost overnight a few years ago. The use of a few popular brands then skyrocketed, particularly among younger people.  "
        },
        {
            "text": "In eye-catching colours and sweet fruity flavours, it wasn’t long before these vapes became a familiar sight in supermarkets, convenience stores and pub beer gardens in communities across the United Kingdom.    The same products soon began to litter our high streets and green spaces. It became impossible to miss them on the ground of parks, pavements, playgrounds and beaches.  How single-use vapes damage our environment    As well as being eyesores, discarded vapes have a hugely damaging impact on our environment and wildlife. Animals such as birds, fish, and marine mammals can mistake vapes for food and ingest poisonous chemicals.   Whether littered or thrown in a bin and sent to landfill, single-use vapes also release substances like lead and mercury into our soil, rivers and streams. This damages ecosystems and habitats.  The plastics used in these products are nearly impossible for nature to completely break down. Instead, they break into tiny pieces of ‘microplastics’ which can enter our food chains.  These vapes may take a few days to finish, but their environmental harms stick around for a very, very long time.   Say one ‘disposable’ vape promises about 600 puffs - its plastic casing will easily last for 600 years buried in the earth. "
        },
        {
            "text": "An avalanche of waste   After being used for a very short time, most single-use vapes are thrown away and the materials are not recycled.  Last year, Material Focus estimated that almost five million single-use vapes were either littered or thrown away in general waste every week in the UK. That's the equivalent of eight being thrown away per second.   This is extremely wasteful of the valuable resources contained in these vapes, such as cobalt and copper. In 2022, the same group found that more than 40 tonnes of lithium were discarded in single-use vapes. This is the same amount used to power 5,000 electric vehicles.   For the small number of single-use vapes which are sent for recycling, it’s a difficult job, because they contain many chemical components and are not designed to be taken apart. They usually have to be disassembled by hand – a slow and tricky process which struggles to match the avalanche of vapes that are produced and discarded.   The lithium-ion batteries in these vapes can also cause fires, which risks the safety of waste management workers, firefighters and the public.   In 2023 there were over 1,200 battery fires in bin lorries and waste sites across the UK -  a 70% increase on the year before. Aside from the obvious safety issues, these fires are bad for the quality of air breathed by local communities.  Time to turn the page    Taking these products off the shelves by banning their sale and supply will help to tackle these problems. It will prevent them from being thrown into bins with general waste, and littering of reusable alternatives will be reduced."
        },
        {
            "text": "This will help to build a more circular economy, where our resources are kept in use for longer and things are built to last.  A majority of the public support this change, with 69% in favour when asked in a consultation in February 2024.   The ban will also help curb the rise in youth vaping. Over half of children who use vapes report that ‘disposable’ models are their product of choice. "
        },
        {
            "text": "The long-term health impacts of vaping are still emerging, but most vapes contain nicotine which carries the risk of harm and addiction, especially for young people whose brains are still developing. Withdrawal can cause anxiety, irritability, trouble concentrating and headaches.   What people who buy vapes should know  If you’ve got a collection of used up vapes in a drawer at home, don't bin them.  Return them to your vape supplier for recycling or take them to your nearest recycling point.  What businesses who sell vapes should know   Businesses that sell vapes should stop buying new stock of single-use vapes and sell all existing stock before 1 June 2025. If a vape is reusable, you’ll still be able sell or supply it.  Retailers have a legal duty to provide collection points for waste vapes to their customers. Read our guidance for businesses. "
        }
    ]
}