{
    "url": "https://digitalhealth.blog.gov.uk/2021/12/10/2021-a-year-in-nhsx-service-assessments/",
    "title": "2021: A year in NHSX service assessments",
    "authors": [
        "Karina Lewis"
    ],
    "categories": [
        "Assurance",
        "Service assessments"
    ],
    "pub_date": "2021-12-10T16:45:10+00:00",
    "content": [
        {
            "text": "Service assessments are peer to peer reviews of digital government and national NHS services to check for compliance with government standards. A panel of assessors will ask questions and review information about a service and make a decision whether it meets the Service Standard. At NHSX, we run internal assessments on behalf of DHSC. That means we assess all public or NHS facing services, commissioned by DHSC or any of its partner organisations, that have under 100,000 transactions per year. "
        },
        {
            "text": "In 2021, we facilitated 31 assessment activities. We ran 10 alpha assessments, 8 beta assessments, 2 live assessments, 7 COVID peer reviews and 4 workshops. We could not have done this without the commitment and help of our wonderful community of assessors, who give up their time on a voluntary basis on top of their busy day jobs. By assessing, they are sharing their valuable knowledge and expertise to help other services across health and social care. A huge thank you to everyone that has helped out this year!"
        },
        {
            "text": "Here are some highlights from a year of NHSX service assessments. "
        },
        {
            "heading": 2,
            "text": "Introducing new processes to help teams succeed"
        },
        {
            "text": "This year we focussed on how we might better prepare teams for service assessments and spot any red flags ahead of the day. One new process we have introduced is a pre-assessment show and tell with the assurance team. This session gives the service team a chance to have a practice with some friendly faces in an informal setting, 2-4 weeks before their assessment, and receive advice from the assurance team. "
        },
        {
            "text": "Feedback has generally been positive, with one team reflecting that: "
        },
        {
            "heading": 2,
            "text": "Creating new guidance for service teams"
        },
        {
            "text": "The NHSX assurance team ran a project looking at how we explain and define assurance. Research from this project over discovery and alpha showed that finding out about assessments is a significant pain point. Working with a content designer, service designer and user researcher, new guidance was drafted. There is now an assurance section on the NHSX website, describing what we do in assurance across spend approvals and service assessments. On top of this, we created a slide-deck to send to teams booking an assessment with more detail about the process and timelines."
        },
        {
            "heading": 2,
            "text": "Building a community of assessors"
        },
        {
            "text": "At the beginning of 2021, we had a committed team of a handful of assessors. The demand for assessments quickly outstripped our supply of assessors, so this year we have focussed on building a community of assessors across health. So far this year, we have trained 65 assessors and have more training scheduled this side of Christmas. Our assessor community includes colleagues from across the health landscape, including NHSX, NHS Digital, NHS Business Services Authority, NHS England and Improvement, the Care Quality Commission and more. "
        },
        {
            "text": "In 2021, we also: "
        },
        {
            "text": "For more information on NHSX assessments or becoming an assessor, please email assurance@nhsx.nhs.uk  "
        }
    ]
}