{
    "url": "https://mhrainspectorate.blog.gov.uk/2021/12/10/global-reflections-on-international-inspection-transformation-icmra-remote-inspections/",
    "title": "Global reflections on international inspection transformation: ICMRA remote inspections",
    "authors": [
        "Paula Walker"
    ],
    "categories": [
        "Compliance matters",
        "Good clinical practice",
        "Good manufacturing practice"
    ],
    "pub_date": "2021-12-10T10:20:49+00:00",
    "content": [
        {
            "text": "In August 2020 the International Coalition of Medicines Regulatory Authorities (ICMRA) established a working group to look at the move to remote inspections for GCP and GMP during the pandemic.  On behalf of MHRA, I was fortunate to chair this group of highly experienced regulators, reporting in to the ICMRA COVID-19 working group."
        },
        {
            "text": "The working group was chaired by MHRA and included representatives from US-FDA, EMA, Health Canada, Swiss-medic, HPRA Ireland, AEMPS Spain, ANSM France, PEI Germany, MHLW/PMDA Japan, TGA Australia, ANVISA Brazil, HSA Singapore, WHO, Saudi-FDA.  After an initial deep dive presented to the ICMRA Policy group in October 2020 on initial experiences of the changes to regulatory oversight to remote ways of working driven by the pandemic, the group moved forward to start work on a reflection paper on GCP and GMP remote inspections during the pandemic."
        },
        {
            "text": "Over the last year, as experience has built, the group has met regularly to share approaches and experiences at a time when joined up global approaches to regulation have never been more important."
        },
        {
            "text": "I am pleased to say that the ICMRA paper has now been published here .  The paper is a collective reflection on the type of remote approaches taken by the different regulators across the globe, including:"
        },
        {
            "text": "The paper also covers areas where we felt remote or distant assessment approaches were suitable versus those technical areas where on-site was required to ensure the appropriate safety and quality of products or trials, etc, being reviewed, and this is considered from both the GCP and GMP perspective.  Experiences with different types of digital means, such as visual technology, are also discussed."
        },
        {
            "text": "While this paper is a reflection paper, not a guidance document, the combined experience conveyed provides valuable insight into how regulators have managed regulatory oversight, inspections and assessments during the pandemic to support both the COVID-19 response, and also ‘business as usual’ GMP and GCP inspections.  It was great to build a collaboration between ICMRA and PIC/S via this group, with the intention for PIC/S to take forward for GMP building the distant assessment guidance into respective quality systems."
        },
        {
            "text": "While the future remains to be seen, the group reflected that remote approaches will certainly be a tool in the regulator ‘toolkit’ and have provided valuable oversight in this emergency situation."
        },
        {
            "text": "I would like to extend both my personal thanks and those on behalf of the group to Martin Reed, Senior GLP Inspector at the MHRA, for providing extensive support to the drafting process, and of course to the members of the ICMRA group who gave their time to contribute to discussions during this challenging period."
        }
    ]
}