{
    "url": "https://teaching.blog.gov.uk/2021/12/10/how-schools-are-managing-attendance-effectively/",
    "title": "How schools are managing attendance effectively",
    "authors": [
        "Various authors"
    ],
    "categories": [
        "Attendance",
        "COVID-19 support"
    ],
    "pub_date": "2021-12-10T14:20:05+00:00",
    "content": [
        {
            "text": "School is the best place for children and young people’s education and wellbeing. Schools across the country have developed a range of approaches to support regular attendance amongst their pupils and drive down rates of persistent absence. In this blog post, schools who have had success in increasing attendance rates share what works for them. "
        },
        {
            "text": " "
        },
        {
            "text": "Bringing parents on the attendance journey"
        },
        {
            "text": "Parents play a vital role in supporting attendance – particularly at primary school level – so encouraging parents to prioritise this is a key part of our strategy."
        },
        {
            "text": "In AY 2017/18, we refreshed our school’s attendance policy and made working with parents and families a core part of it. To explain the changes, we issued a clear, parent-friendly outline of our new policies to all parents, including our expectations of them. At parents’ evening, we began sharing detailed individual pupil attendance data and helped parents understand what percentages of absence meant for education time lost in real-terms and produced a ‘minutes late’ report so parents could understand the cumulative impact of their child being late. Parents of pupils who were persistently absent or late were offered support by our Family Support Worker to find ways to improve their attendance."
        },
        {
            "text": "We also organised ‘attendance surgeries’ for the parents of pupils who were at risk of becoming, or had become, persistently absent. These surgeries were an open discussion with parents to talk about reasons for absence and ways that we could support their child to attend more frequently. The surgeries were well attended, and we found some pupils’ attendance improved from just receiving the invite. We also invited feedback from parents about how our school had been managing attendance and how we could support them to ensure their child regularly attends school."
        },
        {
            "text": "Icknield Infant and Nursery School, Hertfordshire"
        },
        {
            "text": "Icknield Infant and Nursery School is an infant school and nursey located in Letchworth Garden City in Hertfordshire."
        },
        {
            "text": " "
        },
        {
            "text": "Creating an environment where pupils want to be"
        },
        {
            "text": "Our ethos is that school is a good place to be, and we’ve embedded that in our attendance strategy by creating a positive environment where pupils want to attend, and where parents want their child to be. We have a mainly non-teaching pastoral team who work directly with the families of pupils who do not attend regularly to understand the root causes of absence. One of our catchment areas is an area of high deprivation so we also support families by linking them with advocates and agencies that can coach and support them to access funding and support for their families. This fosters positive relationships with parents and means that they know we are prioritising the best interest of our pupils and their families."
        },
        {
            "text": "We have also created a ‘pastoral tool-kit’ which outlines procedures to follow and what steps to take when things become challenging. For example, if a parent says their child feels anxious about attending school we may refer them to small group sessions or school counselling. This ensures all pupils and families are being offered consistent support across the board."
        },
        {
            "text": "With pupils, we talk about the positive link between attendance and high achievement and make attendance a pre-requisite for taking part in our extensive extracurricular activities."
        },
        {
            "text": "After morning registration, we do a uniform and equipment check. If a pupil has incorrect or missing uniform or equipment, we provide them what they need for the day so they don’t feel anxious about going to classes ill-equipped and develop a negative association with school."
        },
        {
            "text": "Wheelers Lane Technology College, Birmingham"
        },
        {
            "text": "Wheelers Lane Technology College, is a boys secondary school located in Kings Heath, an area in South Birmingham."
        },
        {
            "text": " "
        },
        {
            "text": "Working together to act on data"
        },
        {
            "text": "Monitoring and acting on attendance data has been a key part of our school’s strategy to improve attendance rates. We track dips in individual pupil’s daily attendance, and our assistant headteacher, attendance officer and education welfare officer meet weekly to review every pupil’s attendance. This enables us to spot patterns in attendance behaviour and proactively identify pupils before they become – or risk becoming – persistently absent. These pupils are targeted for mentoring, incentivised rewards, additional home contact and 1-1 support to prevent any more absences."
        },
        {
            "text": "As a secondary school, we also pay close attention to transition data from the pupils’ primary school. This allows us to build a clear picture of any barriers to learning and attendance pupils may have and ensure that the transition does not result in a continued absence. To do this, the key attendance, SEND, pastoral, safeguarding and inclusion staff meet with all relevant primary schools to identify any information which may impact on school attendance, and identify appropriate interventions to support and maintain positive attendance from the start of term. Where necessary, we organise additional transition meetings and school visits so that pupils feel supported and to address any anxieties. As soon as the new academic year begins, we closely monitor the first few terms to understand their attendance behaviour and how they are adjusting to the new environment."
        },
        {
            "text": "St Thomas More Catholic Academy, Stoke-on-Trent"
        },
        {
            "text": "St Thomas More Catholic Academy is a comprehensive, Roman Catholic secondary school and sixth-form in Stoke-on-Trent."
        },
        {
            "text": " "
        },
        {
            "text": "Get support to improve and maintain attendance"
        },
        {
            "text": "For general information and guidance on how schools, trusts and local authorities can maintain high levels of school attendance, you can read our guidance on school attendance, as well as our attendance best practice framework."
        }
    ]
}