{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/12/10/introducing-our-new-myscience-videos/",
    "title": "Introducing our new MyScience Videos",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Profession Updates"
    ],
    "pub_date": "2021-12-10T13:15:27+00:00",
    "content": [
        {
            "text": "The Government Science & Engineering (GSE) Profession are proud to launch our new four-part video series entitled MyScience."
        },
        {
            "text": "The MyScience videos highlight the variety of science and engineering skills, the diverse roles in government, and the highlights of our members. We believe it is important to show the range of people and jobs within the Profession to solidify our message that anyone can become a member – from those with an interest through to deep specialists."
        },
        {
            "text": "These videos, whilst informative, help to present GSE as an accessible and exciting Profession to join. These videos are an important product that we want our members to use to promote the Profession throughout government and grow our membership. To be truly representative, we need as many scientists and engineers as possible throughout the government to join the Profession."
        },
        {
            "text": "As part of the MyScience project, we asked 10 GSE members about four theme areas. These themes were chosen because we believe they most effectively explore the benefits of being a GSE member, the importance of science within government, and the diverse make-up of our members. The four videos are available to watch today, and can be viewed by clicking the links below:"
        },
        {
            "text": "These videos form part of our wider GSE Induction pack, that will be launching in the new year. We are excited to share this first piece with you and are actively reaching out to members encouraging them to get involved with the development of our future products."
        },
        {
            "text": "We would like all our members to watch the videos and engage with the content, and to share them across their networks. The diverse range of scientists and engineers represented in the videos help to reiterate that anyone can be a member of the Profession. By helping us to share these videos, we believe we can reach new members who might discover that GSE is the best Profession for them to join."
        },
        {
            "text": "We want to say a special thanks to everyone involved, particularly to the 10 members who volunteered to participate in this video series. We understand the importance of having a diverse and inclusive range of members participate in our communications. We hope that these videos to encourage people to join our Profession and hope they will provide benefits as an effective marketing tool for the Profession."
        },
        {
            "text": "If you have any questions, please email us at gse@go-science.gov.uk."
        }
    ]
}