{
    "url": "https://lifeathmrc.blog.gov.uk/2021/12/10/rescon-4-0-user-research-conference/",
    "title": "Rescon 4.0: user research conference",
    "authors": [
        "Shila Odedra",
        "Emma Aldred"
    ],
    "categories": [
        "General",
        "Guest blog"
    ],
    "pub_date": "2021-12-10T12:46:31+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The 4th Annual ResCon (user research conference) was held on 12 and 13 October this year. Over 100 professional user researchers came together virtually to hear from a number of external speakers."
        },
        {
            "heading": 3,
            "text": "Making Reconnections "
        },
        {
            "text": "This year’s theme for the conference was making reconnections. Although the User Research team in HMRC has continued to do research during the pandemic, we’ve had to change how we do it. ResCon gave us a chance to see what we have done well and what needs improving."
        },
        {
            "text": "ResCon was launched by our very own Head of User Research and Digital Inclusion, Accessibility and Standards at HMRC - George Papaztanis. He talked about how our community has grown to 120 user researchers across the digital centres, how the user panel has increased since last year by 23% - to over 92,000 users - and how our community is continuously advocating for user needs and user-centred design within the digital services."
        },
        {
            "text": "Create meaningful connections in a hybrid environment  "
        },
        {
            "text": "The first keynote speaker was Jenny Perkins, Head of Engagement at Cirrus, who talked about ‘How to foster affinity and belonging in a hybrid world’. This session explored what we’ve learned during the pandemic, and how to build more meaningful connections as we balance remote working with a return to the office. We’ve since added an informal and social element to our regular team meetings to help build and maintain relationships with our colleagues."
        },
        {
            "text": "Teamwork makes the dream work"
        },
        {
            "text": "The second speaker was Tom Holtgreve, Head of Experience Design and Research team at Frog. This session explored ‘How interdisciplinary teams make their mark’ and how to work with diverse and interdisciplinary teams to produce inspiring and exciting outcomes that make their mark."
        },
        {
            "text": "The takeaway for the community from this session were:"
        },
        {
            "text": "What makes a good – and bad – workshop?"
        },
        {
            "text": "Opencast & Newcastle OpenLab ran a workshop on ‘How we can best communicate online’. The conference delegates discussed and shared how to best conduct online workshops and looked at tools for facilitation, communication, and how to structure workshops."
        },
        {
            "text": "The top tips from this session included:"
        },
        {
            "text": "The second day of the conference started with acknowledging and rewarding our community with our Third User Research Community Awards."
        },
        {
            "text": "The winners were:"
        },
        {
            "text": "We were then joined by the Design Community with Jeremy Davis (Deputy Director of Product & User Centred Design) who talked about the future of the Product and User Centred Design professions."
        },
        {
            "text": "Finally, James Chudley from cxpartners ran a workshop which focused on ‘Co-designing our post-pandemic UCD working practice’. The workshop allowed our user research and design communities to explore how we might adapt our working practices to take the best aspects of what we have learnt from remote working and modify them to result in new hybrid working practices to suit a post-pandemic world."
        },
        {
            "text": "As a result of this workshop, we have identified key principles for working in a hybrid environment. These principles, created by the User Centred Design community, include:"
        },
        {
            "heading": 2,
            "text": "Working together…works"
        },
        {
            "text": "Overall, everyone thoroughly enjoyed the conference with such excellent speakers and engaging workshops, it was great to see the whole community come together despite the restrictions of the pandemic and be able to work together in a hybrid way."
        },
        {
            "text": "Professional development is high on our agenda, so it was great for our User Researchers to attend ResCon 2021."
        }
    ]
}