{
    "url": "https://geospatialcommission.blog.gov.uk/2021/12/10/unlocking-the-value-of-location-data/",
    "title": "Unlocking the value of location data",
    "authors": [
        "Hayden Greenfield, Assistant Economist Faststream, Geospatial Commission"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2021-12-10T10:14:26+00:00",
    "content": [
        {
            "text": "Over the last 30 years, data, and specifically, location data, has gone from an occasional and specific tool (such as an A-Z for a new city) to something fundamentally embedded in our daily lives. It forms the backbone to a wide range of information products and services which comes from its ability to be combined with other datasets. This provides immense value to society, businesses and wider organisations, which, for example, stem from highly visible tools like live traffic updates on your phone to the sensors controlling junctions which speed up journeys while generally going unnoticed by the general public. "
        },
        {
            "text": "Recent developments in location data also allow us to better observe the environment we live in, making it a vital tool in our fight against climate change and achieving Net Zero. Having up-to-date location data at our fingertips will help us make the best use of the land around us and support the identification of biodiversity hotspots that require preservation. "
        },
        {
            "text": "However, despite its ever-increasing importance, projects looking to invest in the creation, improvement or sharing of location data struggle to articulate the impacts and benefits of doing so, which is important to unlocking future funding. Many believe that this has led to location data being undervalued and underinvested in. "
        },
        {
            "text": "The Geospatial Data Market Study published last year, identified that location data has the potential to generate a significant amount of value through widespread adoption. To overcome the challenge of valuing this data, the Geospatial Commission will start to build and develop consistent approaches to understanding the value of location data, culminating in published guidance on measuring the economic, social and environmental value of location data."
        },
        {
            "heading": 2,
            "text": "What makes location data so difficult to value?"
        },
        {
            "text": "As you might expect, valuing data is no easy task - it is a technical area that is tricky to unpack with some context being quite abstract. Understanding and being consistent in how we value data is fundamental to creating opportunities for economic growth and the betterment of society.  "
        },
        {
            "text": "The difficulties behind valuing data can be broken down into several important challenges. The first challenge comes from the fact that the value of location can only be realised when combined with other datasets. Once a location dataset is linked with another set, it provides new insights resulting in potentially boundless opportunities when it comes to its use, making it difficult to fully value at any given point in time without being underestimated. This combining of datasets comes with its own ethical and privacy considerations which may act as barriers to further use. "
        },
        {
            "text": "The second is that value differs depending on the intended uses, traits and characteristics of the data, meaning there is no one size fits all valuation method. For example, mobile phone data could be considered more valuable for understanding total hourly footfall on high streets, but less valuable for understanding priority land preservation areas (as opposed to, say, topographical or habitat data). "
        },
        {
            "text": "The third, but related challenge, is the time and effort required to identify the traits and uses of a particular dataset. Many valuation approaches require a lot of work to identify the intended uses, understanding gaps in the data and assessing how accurately the data describes the “real world”. This variation in time and effort ultimately affects how beneficial (and therefore valuable) the data is to the person using it. "
        },
        {
            "text": "Despite an array of valuation methods, there is currently no definitive or concrete approach to addressing these challenges across the public or private sector. Our research to date has found a variation of methodologies with some direct approaches concentrating on the cost of collecting and processing data into a usable format, whilst others concentrated on the current price or willingness to pay. It is understandable that such methods are used as they are either already available or can be obtained through some survey work. These methods provide a relatively good benchmark for how users value specific datasets. "
        },
        {
            "text": "However, these methods are not able to capture the economic benefits that “spill over” across to other users in the economy, providing additional value that is not routinely captured. For example, timely location data can provide better routing decisions that avoid congestion areas for drivers, resulting in faster journey times (direct impact).  Fewer cars on popular roads will ease congestion leading to a reduction in emissions and pollution improving health outcomes (spillover impact). Were these spillover impacts to be captured more regularly, they would further support the case for investment in location data."
        },
        {
            "text": "Some approaches have gone to great lengths to identify and value every instance of data use, which can be very resource-intensive, and still not able to cover the future use cases! There is therefore a balance that needs to be struck between the methods that best inform decision making whilst also being practical to undertake. "
        },
        {
            "heading": 2,
            "text": "What is the Geospatial Commission doing about this?"
        },
        {
            "text": "The Geospatial Commission is joining the current data assessment efforts by publishing guidance by spring 2022 on valuing the economic, social and environmental value of location data. The guidance, announced in the UK’s Geospatial Strategy and reiterated in our Annual Plan, will look to provide direction on how to measure the economic, social and environmental value of location data both within government and in the private sector."
        },
        {
            "text": "The guidance will enable a consistent understanding of the categories and characteristics of location data, helping the public and private sector to articulate the case for improving and creating location datasets. Finally, our guidance will influence decision making by helping authorities to prioritise investment in location data programmes, which will unlock value for consumers and the private sector."
        },
        {
            "heading": 2,
            "text": "So what is happening next?"
        },
        {
            "text": "There are several significant stepping stones between us and our goal. We will begin by establishing a working group that will bring together experts from across the public and private sector to guide our research and development. We will produce a framework and guidance for measuring the value of location data by outlining the different approaches for measurement. As part of this we will provide examples of how to effectively measure the value of location data and identify areas for future development."
        },
        {
            "text": "If you would like to stay up to date, or get involved, in our efforts to value location data, then please follow us on Twitter and LinkedIn or get in touch with us at geospatialcommission@cabinetoffice.gov.uk."
        },
        {
            "text": "Sign up to this blog to get an email notification every time we publish a new blog post."
        }
    ]
}