{
    "url": "https://veteranstoday.blog.gov.uk/2021/12/10/veterans-get-record-3m-from-charity/",
    "title": "Veterans get record £3.3m from charity",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Veterans Today"
    ],
    "pub_date": "2021-12-10T13:14:36+00:00",
    "content": [
        {
            "text": "A charity has defied the Covid slump to award a record £3.3million in grants to British veterans in need, according to its latest annual figures. The Veterans’ Foundation (VF), a registered charity based in Edinburgh, helped more than 130 military charities and organisations in the year to June 2021. The VF provides funds to charities and other organisations that support serving and former members of the British Armed Forces, operationally qualified seafarers and their dependants. It acquires its funds through the Veterans’ Lottery and donations and primarily supports low and medium-wealth charities that need funds to continue their good work. The £3.3million sum represents a year-on-year increase of more than 70%. Since its inception in 2016 the VF has given £7.1million in grants to more than 240 military charities and organisations, including Scotty’s Little Soldiers, Service Dogs UK, Walking With The Wounded, Rock 2 Recovery and Veterans Into Logistics. Most of the VF's income comes from the Veterans' Lottery, which had 64,000 players at the end of the financial year, up by more than 40% on the previous year. The top prize is £35,000. ‘This represents an exceptional performance during a period in which most charities saw a drop in their fundraising income and one which made the grant-making of the Veterans' Foundation even more important,’ said chairman Peter Mountford. The Veterans' Foundation has had a significant incremental impact on the support given to servicepeople and their families, not just in the year, but cumulatively over the last five years,' he added. Health and wellbeing, particularly mental health support, have been important areas of attention for the VF over the 12 months and more than £1.2million has gone to help our ex-service personnel get healthier. A fifth of the year's awards have also directly assisted veterans with educational and unemployment issues, helping them to learn new skills and find a new career. Charities helping veterans to address homelessness, family welfare and wellbeing, and community hubs that provide signposting and advice, have also received financial support. 'The Veterans' Foundation not only grew its income year-on-year during the pandemic period, but it has been able to provide funding to more organisations helping members of the Armed Forces who are in need,' said Major General David Shaw, CEO and founder. 'The growth is a reflection of public support, the hard work of our creative teams that reach members of the public and the work of the trustees and staff of the Veterans' Foundation. 'More importantly, we know the beneficiaries have had their lives improved through the funds raised, but it doesn't stop there - with continuing support we will work hard to achieve more.' "
        }
    ]
}