{
    "url": "https://socialcare.blog.gov.uk/2021/12/10/what-social-care-reform-could-and-should-mean-for-people-with-dementia/",
    "title": "What social care reform could and should mean for people with dementia",
    "authors": [
        "Laura Vicinanza"
    ],
    "categories": [
        "Care and support",
        "Dementia",
        "Workforce"
    ],
    "pub_date": "2021-12-10T15:24:28+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Reforming care around personal need"
        },
        {
            "text": "Social care is vital for people with dementia. As the condition progresses, many people will need to draw on homecare to support them to maintain independence in their own home for as long as possible, and many will also find they need a greater level of support at some point from a care home."
        },
        {
            "text": "This support is what many people with dementia rely on to live their lives, and everyone has the right to to live well. The social care system should be reformed to deliver the care people with dementia need and deserve."
        },
        {
            "text": "Alzheimer’s Society has been calling for social care reform for a long time and so I welcomed the opportunity to participate in two South West roundtable events, arranged by the Department of Health and Social Care, to discuss what we want to see from this process."
        },
        {
            "text": "I was able to draw on my experience of engaging with people affected by dementia and the evidence and recommendations we developed in our Alzheimer’s Society policy reports."
        },
        {
            "text": "As a regional public affairs and campaigns officer, I engage with a wide range of local stakeholders, raising awareness of the needs of people with dementia and their carers and discussing how the care and support they receive can be improved to make it personalised, high-quality and integrated."
        },
        {
            "text": "I really valued being able to share Alzheimer’s Society’s vision for what people with dementia need from social care. We believe personalised care, focused on what matters most to people and giving them choice and control over their own care, must be at the centre of a new vision."
        },
        {
            "heading": 2,
            "text": "A regional view"
        },
        {
            "text": "There has been significant progress in improving dementia care over the last few years across the different areas of the South West of England. However, while I find there are certainly good pockets of best practice happening in the region, the quality of care and support people with dementia and their carers receive on the ground very much varies depending on where they live in the region. It’s important that reform delivers improvements for everyone, so that everyone can access high-quality, personalised, integrated care and support, regardless of where they live."
        },
        {
            "text": "It was great to hear many others at the roundtables representing a wide range of voices from across the sector. They echoed our own thoughts on the principles needed to underpin effective social care. There was a real sense of unity in where we want care services to be headed, as well as a shared understanding of just how important it is for this change to happen as soon as possible."
        },
        {
            "text": "In the second roundtable, it was great to discuss some of the major challenges and potential solutions in more detail. We discussed the needs of the care workforce and I highlighted how dementia training is really important to provide staff with the knowledge and skills to deliver high quality care."
        },
        {
            "text": "This must go hand in hand with enhancing support for the workforce, including their own wellbeing, skills development and career progression. There was strong consensus on the need for workforce reform, with all stakeholders recognising how vital these changes are for both staff and the people they support."
        },
        {
            "text": "Other themes discussed included improving support for unpaid carers, the benefit of care coordinators to help people with dementia navigate the highly complex social care system, and the role of integration. I really enjoyed these opportunities to engage with developing plans for reform and I’m now looking forward to continuing engagement as we move towards implementation."
        },
        {
            "text": "A central vision for reform is vital for all those who draw on care and support, including those with dementia, but how these plans are delivered will be the true test, and the experiences of people who draw on care the ultimate measure of success."
        }
    ]
}