{
    "url": "https://ukhsa.blog.gov.uk/2025/01/07/meningitis-i-underwent-multiple-surgeries-including-the-amputation-of-several-fingers/",
    "title": "Meningitis: I underwent multiple surgeries, including the amputation of several fingers",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Immunisation and vaccination",
        "immunisations",
        "Uncategorized"
    ],
    "pub_date": "2025-01-07T17:17:05+01:00",
    "content": [
        {
            "text": "Things were going well during my first weeks at university. I was living independently and enjoying the freedom, attending classes, and meeting new people. The previous 2 years of stress and preparation had led to this moment. But one weekend, while a friend from home was visiting, everything changed dramatically."
        },
        {
            "text": "We hadn’t been out drinking - as you might expect - and went to bed at a reasonable time, feeling perfectly fine. In the middle of the night, I woke up vomiting uncontrollably. After hours of it not stopping, alarm bells rang. We contacted NHS 111, who directed me to A&E."
        },
        {
            "text": "By the early hours of the morning, I was still vomiting relentlessly, but there weren’t any other warning signs. The doctors gave me anti-sickness tablets and were preparing to discharge me when my condition suddenly deteriorated. I became feverish, clammy and disoriented. I vaguely recall getting up to go to the bathroom, but I’m told I collapsed and possibly had a seizure. Within hours, I’d gone from healthy to hospitalised."
        },
        {
            "text": "Doctors worked frantically to cool me down, surrounding me with fans and ice packs. My parents arrived, visibly worried, and  I was placed in an induced coma for 2 weeks and moved to intensive care. By Monday evening, my condition had worsened, and my family were warned I might not survive the night due to sepsis. Yet somehow, I made it through."
        },
        {
            "text": "By Tuesday, my chances were still grim. My parents had to explain the situation to my 2 younger sisters, and my family said their goodbyes. My condition remained touch and go, and scans revealed swelling in my brain caused by meningitis. Doctors told my family that if the swelling increased, I wouldn’t survive."
        },
        {
            "text": "When I eventually woke up 2 weeks later, I had no idea what had happened. I was disoriented, foggy from medications, and frustrated at not being able to enjoy simple pleasures like a hot chocolate. I gradually learned that I had been battling meningitis and sepsis, and looking down, I saw that my hands and patches of skin were completely black. The texture was unreal, almost like the surface of a brick."
        },
        {
            "text": "Over the next six weeks in intensive care, I underwent multiple surgeries, including the amputation of several fingers and the debridement of necrotic skin. My hands were bandaged, and I remember asking a nurse to draw on my godmother’s hand to show how much I had left. Seeing her hand covered in pen - the reality hit me."
        },
        {
            "text": "Friends sent care packages - mostly socks, which seemed silly, as I was preparing to have my feet amputated. By December, I was on the trauma and orthopaedics ward, undergoing more skin grafts and surgeries. The pain was excruciating. After one procedure, I screamed from the burning sensation, like sitting in acid. Small joys, like opening advent calendars with my mum and godmother in the middle of the night, became my lifeline."
        },
        {
            "text": "At Christmas, I managed to leave the hospital for 6 hours to spend the day with my family in a house the university provided. In January, I was transferred to Salisbury for specialist surgery, where both legs were amputated. The operations were agonising, but once they were done, my focus shifted to rehabilitation."
        },
        {
            "text": "I threw myself into prosthetic rehab with determination. Monday to Friday, I was in the gym all day, learning to use my prosthetics and regaining strength. By the weekends, I was eager to go home and enjoy a sense of normality. After 7 weeks, I was walking independently with my prosthetics."
        },
        {
            "text": "In 2020, I returned to university to restart my medicine degree. It was the right time, and I was proud to reclaim my life. Despite my disability, I was determined not to let it change my path. In the midst of my studies, I joined the hand transplant list. Last year, I received a donor hand in Leeds. This was a major step forward, and the experience was much more positive since it was a choice I made while healthy."
        },
        {
            "text": "Now, I’m pursuing a Master of Medical Science, with plans to complete my degree and become a doctor. I’m grateful that despite the permanent effects of meningitis, I can manage my disability and lead an independent life."
        },
        {
            "text": "Meningitis is so easily preventable now with a vaccine. To any parents with young children or those eligible for the catch-up programme, I urge you to take this simple, life-saving step. If I could have prevented my infection, my life might have taken a very different course. While I feel incredibly lucky to be here today, I know not everyone gets that chance."
        }
    ]
}