{
    "url": "https://foresightprojects.blog.gov.uk/2023/11/06/integrating-futures-thinking-in-the-crown-prosecution-service/",
    "title": "Integrating futures thinking in the Crown Prosecution Service",
    "authors": [
        "mikeaskew"
    ],
    "categories": [
        "Futures Capability & Resource",
        "Methodologies"
    ],
    "pub_date": "2023-11-06T11:54:45+00:00",
    "content": [
        {
            "text": "by Rose Cowley and Alex Scott"
        },
        {
            "text": "How can you focus on tomorrow’s challenges when today’s are so all-encompassing?"
        },
        {
            "text": "Like many operational agencies across the Civil Service, the Crown Prosecution Service (CPS) continues to operate in the long and difficult shadow of the pandemic. The challenges we face do not have quick or simple solutions, and they have translated into sustained workload pressures for our people."
        },
        {
            "text": "Yet, the pace of change in society has never been faster than it is today. And this change will continue to bring new  opportunities and risks for our organisation."
        },
        {
            "text": "In acknowledgement of this, the CPS emphasised the importance of futures thinking in our organisational strategy, CPS 2025. We aim to lead on futures thinking to understand issues across the criminal justice system so we can prepare today for tomorrow’s challenges."
        },
        {
            "text": "In the CPS Strategy Team, over the past two years, we have designed a bespoke model to operationalise futures thinking and drive preparedness."
        },
        {
            "text": "To design a process that worked for us, we built on the foundations of others, conducting a discovery exercise to learn about how other futures teams had approached their work. We found three common challenges:"
        },
        {
            "text": "These formed the basis of our process design. We focused on ensuring we could incorporate futures techniques and best practice into a simple model which prioritised action on the insights we unearthed."
        },
        {
            "text": "This process is already paying dividends for the organisation. In our first year, after a broad horizon scan, we focused in on two issues in particular: the potential impact of increased use of deepfakes in crime, and the role of the CPS in an increasingly polarised world."
        },
        {
            "text": "We analysed these topics in detail, and then commenced a wide range of engagement with experts inside and outside the organisation. By testing these emerging insights with frontline staff of all grades, from all professions, we were able to obtain thorough reflections and suggested actions to complement the initial breadth of our horizon scanning. By creating the space to consider these issues, engagement was very high."
        },
        {
            "text": "We took these findings to our Executive Group and Non-Executive Directors and agreed a series of actions we could take today to help us prepare for these challenges in the future. These were then embedded in our future business planning, to quickly create change and demonstrate to our organisation the immediate benefit this long-term thinking can bring."
        },
        {
            "text": "We have continued our work this year and are taking three more deep dive projects through this process, including crime in augmented and virtual reality, the use of artificial intelligence and machine learning within criminal justice, and challenges and opportunities brought about by an ageing workforce. "
        },
        {
            "text": "Futures thinking can’t predict the future, but it can help us prepare for what the future might bring. There is value in understanding the uncertainty we face."
        },
        {
            "text": "By hard-wiring  futures insights into how we work, we are leading on futures thinking in the criminal justice system and ensuring we can take action today to prepare for our challenges tomorrow."
        },
        {
            "text": "If you’d like to find out more about futures thinking in the Crown Prosecution Service, please reach out to the team at Futures@cps.gov.uk"
        }
    ]
}