{
    "url": "https://nda.blog.gov.uk/showing-progress-in-how-were-delivering-our-mission-david-davidson-nda-reporting-manager/",
    "title": "Showing progress in how we're delivering our mission - David Davidson, NDA Reporting Manager",
    "authors": [
        "samfrench"
    ],
    "categories": [
        "Mission delivery"
    ],
    "pub_date": "2023-11-06T09:59:59+00:00",
    "content": [
        {
            "text": "Our first Mission Progress Report (MPR) was published in July 2019 and today we are sharing our 5th iteration."
        },
        {
            "text": "But what exactly is it and what does it aim to do?"
        },
        {
            "text": "Back in 2015, the NDA was challenged to show progress against its extremely complex mission of decommissioning the UK’s earliest nuclear sites. Through a lot of hard work and collaboration with our group colleagues and stakeholders we were able to present progress in a variety of ways. For example, we can now show just how many buildings we’ve demolished, how much fuel has been reprocessed, how much uranium has been produced, how much radioactive waste has been treated and how much land has been delicensed. From having vast amounts of information across our estate that uses different metrics and terminology, we’ve been able to standardise units and language to tell a simpler, more consistent story."
        },
        {
            "text": "It’s no mean feat and involves hundreds of data sets and expert people to assess and assure them."
        },
        {
            "text": "But it’s crucial that we have a way of demonstrating just how what we say in our Strategy ultimately translates into the progress we’re making against the mission."
        },
        {
            "text": "If you’ve seen our Strategy, you’ll know that we use five strategic themes to deliver all the activities needed to achieve our mission. The MPR concentrates on four of those – Spent Fuels, Nuclear Materials, Integrated Waste Management and Site Decommissioning and Remediation. We cover everything from how much spent fuel we have left from reactors and reprocessing, how much plutonium and uranium we have to the various different types of radioactive waste we manage and how many radioactive buildings there are to decommission as well as how much land there is to ultimately delicense."
        },
        {
            "text": "Each of the four themes are broken down into their key components and further divided into huge milestones we call strategic outcomes. These are the 47 significant steps that once achieved will show we’ve achieved our mission."
        },
        {
            "text": "This year we can say that we have successfully achieved another four strategic outcomes that relate to the end of reprocessing. It brings our total to eight strategic outcomes completed, but there’s a long way to go."
        },
        {
            "text": "It’s a mission that will last well into the next century, but the MPR at least gives us an opportunity for a snapshot overview of progress at a point in time. Every year we continue to build a more accurate picture of work that’s still to be completed across our sites. It will keep evolving as uncertainty about our inventory reduces and we begin to include new data that we will become responsible for with the transferral of AGR sites from EDF Energy."
        },
        {
            "text": "Please watch our animation to help you understand more and take a look at the report itself. In 2020, the NAO included the MPR within its reporting guidance as an example of best practice for showing complex data more simply which we’re really proud of!"
        }
    ]
}