{
    "url": "https://moderncivilservice.blog.gov.uk/2023/11/06/skills-wargaming-and-red-teaming-how-the-mod-is-challenging-defence-thinking/",
    "title": "Skills: Wargaming and Red Teaming - How the MoD is challenging defence thinking",
    "authors": [
        "Modernisation and Reform Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Skilled"
    ],
    "pub_date": "2023-11-06T16:31:43+00:00",
    "content": [
        {
            "text": "How do you test ideas and policies? The Ministry of Defence (MoD) is using a range of new tools to examine complex global problems as well as sharing its methods with other departments to improve decision making across government - all part of our commitment to being a Skilled Civil Service."
        },
        {
            "text": "The Secretary of State’s Office of Net Assessment and Challenge (SONAC) gives independent advice to the Secretary of State for Defence, Grant Shapps. SONAC, and its challenge function is part of the Defence Secretary’s plans for reform, laid out in the 2021 Defence Command Paper, which reinforces the commitment to modernise defence and address new and emerging threats across the globe. The 2016 Chilcot Report recognised a need to build challenge, critical thinking and diversity of thought into decision making, in order to safeguard against groupthink."
        },
        {
            "text": "The work of SONAC includes extensive wargaming and red teaming, informed by Defence Intelligence, to ensure current and emerging strategies are tested by independent and diverse voices before they are implemented in the face of future strategic challenges."
        },
        {
            "heading": 2,
            "text": "Serious games"
        },
        {
            "text": "Wargaming and red teaming are discrete exercises that aid decision making by using structured simulations; they apply specific rules, data, methods and procedures to explore serious subjects. Participants challenge decision making and explore the consequences of a complex chain of events; they stress test plans, explore alternative points of view, identify flaws in logic, uncover hidden biases and challenge assumptions. It’s not just used by the military; public and private sector organisations use it around the world to understand complex problems from health education to cybersecurity."
        },
        {
            "text": "SONAC provides net assessment and challenge on policies and issues for the MoD, using a core team of around 25 people who can also draw on internal and external expertise to deliver analysis and challenge projects."
        },
        {
            "text": "Its challenge function has three main purposes; to challenge, to offer alternatives and to improve decision-making:"
        },
        {
            "heading": 2,
            "text": "Collaboration across government"
        },
        {
            "text": "Red team exercises are often run in collaboration with the MoD’s partners, including the Defence Science and Technology Laboratory, the Defence of Operational Capability and the Development, Concepts and Doctrine Centre - the Ministry of Defence's think tank."
        },
        {
            "text": "The team is also continuously building up the capacity for challenge across defence and the wider Civil Service. SONAC has co-funded a challenge training pack with the Foreign, Commonwealth and Development Office and hosts quarterly sessions with other departments involved in challenge, to share expertise and best practice. They recently ran a public consultation exercise to shape the next Defence Command Paper, an achievement that was recognised within the Department, and are launching a Challenge Speakers Series in November, to bring external thinkers and experts into the department to further build on their culture of challenge."
        },
        {
            "heading": 2,
            "text": "Hard but vital work"
        },
        {
            "text": "Challenge is not always successful, but it’s impactful and worthwhile. It’s also hard work that requires a great deal of focus and capacity. Further strengthening of MoD’s capabilities and sharing those skills across government are a key part of our vision for A Modern Civil Service, one that is skilled, innovative and ambitious in providing high quality advice to the Government, outstanding services to the public and safeguarding the UK’s prosperity and security at home and overseas."
        }
    ]
}