{
    "url": "https://space.blog.gov.uk/2023/11/06/tackling-the-growing-risks-of-space-debris-in-earth-orbit/",
    "title": "Tackling the growing risks of space debris in Earth orbit",
    "authors": [
        "ClearSpace"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "Satellites",
        "Space sustainability"
    ],
    "pub_date": "2023-11-06T15:48:31+00:00",
    "content": [
        {
            "text": "An artistic impression of the CLEAR mission in orbit. Image credit: ClearSpace"
        },
        {
            "heading": 2,
            "text": "What is space debris?"
        },
        {
            "text": "Cluttering up the near-Earth space environment with unwanted junk and debris could be storing up a catastrophic problem for humankind because the global economy is now increasingly reliant on space services for everyday activities."
        },
        {
            "text": "Space debris is defined as any type of anthropogenic space object that is no longer in active use. It can range from a spacecraft the size of a bus right down to tiny fragments that hurtle around Earth at breakneck speeds."
        },
        {
            "text": "Larger objects are monitored and catalogued through the use of radar and other technologies but the smaller shards and fragments, often broken up from larger items, are the most worrying because they are impossible to track or measure accurately."
        },
        {
            "text": "Space debris has been getting progressively worse since the start of the Space Age in 1957. Since then, there have been more than 6,300 successful rocket launches, placing nearly 15,000 satellites in Earth’s orbit."
        },
        {
            "text": "Of these, almost 10,000 are still in space today and a staggering one-third of them are either inactive or defunct."
        },
        {
            "text": "In reality, satellites and spent rocket stages comprise only a small percentage of the estimated 32,000 objects larger than 10cm orbiting our planet in low-Earth orbit (LEO) that contribute to the bludgeoning space junk problem facing humankind."
        },
        {
            "text": "The larger objects tracked by global space surveillance networks are only a small proportion of an estimated 131 million pieces of hazardous space debris that cannot be monitored. The unpredictability and high speed of the smaller fragments mean they are potentially an even bigger threat."
        },
        {
            "heading": 2,
            "text": "Where does space debris come from?"
        },
        {
            "text": "Launching satellites into Earth’s orbit is the most obvious source of space debris."
        },
        {
            "text": "The process of deploying a spacecraft involves discarding spent rocket bodies, protective shields, covers, and other incidental hardware items."
        },
        {
            "text": "Some fragments burn up in Earth’s atmosphere but others just stay in orbit and add to the escalating debris problem. Even blocks of ice from the waste management systems of Space Shuttle missions up to several decades ago continue to hurtle around Earth."
        },
        {
            "text": "However, it is collisions or ‘fragmentation events’ that are thought to be the largest source of space debris. Since 1961, a staggering 630 such events have been recorded, with three countries (China 42%, USA 27.5% and Russia 25.5%) responsible for roughly 95% of the fragmentation debris currently in Earth’s orbit."
        },
        {
            "text": "The destruction of satellites in space is another worrying source of orbital debris. Anti-satellite tests (ASAT), where a country deliberately destroys one of its own satellites, are increasingly contentious."
        },
        {
            "text": "Such actions potentially release thousands of extra untrackable debris fragments into orbit, all travelling at speeds of up to 10 km/s, which is 10 to 20 times faster than a bullet."
        },
        {
            "text": "Collisions of these lightning-fast fragments with larger objects can theoretically cause a cascading effect, with each impact generating ever-more debris. This is known as the “Kessler Syndrome”, named after NASA scientist Donald J. Kessler, who first proposed in 1978 the possibility of such a self-sustaining chain reaction of space debris collisions."
        },
        {
            "heading": 2,
            "text": "How does space debris affect life on Earth?"
        },
        {
            "text": "The dangers of space debris are rapidly increasing, threatening operating satellites and orbiting infrastructure, including the International Space Station (ISS) and the safety of astronauts working in orbit."
        },
        {
            "text": "Satellites are more important than ever before in today’s interconnected world. They provide global communications, television broadcasts, banking and navigation services, weather forecasting and vital data on Earth’s terrestrial environment."
        },
        {
            "text": "Almost every industry and business worldwide – from computing to retail, from farming to power and from entertainment to travel – now rely on satellites and the infrastructure created in Earth’s orbit for day-to-day operations."
        },
        {
            "text": "So reducing orbital debris and making the space environment more sustainable is crucial for the future of the global space business, as well as for future developments such as in-orbit servicing and manufacturing, living in space, and the growth of Earth’s in-orbit economy."
        },
        {
            "heading": 2,
            "text": "What are we doing about space debris?"
        },
        {
            "text": "The UK is pioneering ways forward, both in identifying the severity of the space debris problem and through its commitment to developing solutions."
        },
        {
            "text": "As such, the UK Space Agency is demonstrating leadership in the field and has invested £4 million to fund 2 pioneering space missions that will remove at least 2 inactive UK satellites from orbit by 2026 and bring them back to Earth. ClearSpace is leading one of these missions as part of a 9-company consortium of cutting-edge UK-based space companies. It is named CLEAR (Clearing of the LEO Environment with Active Removal)."
        },
        {
            "text": "The CLEAR mission is a vital step on the path to making the removal of space debris a routine reality. In the process, it will also stimulate new state-of-the-art space technologies, including robotics and AI-based algorithms."
        },
        {
            "text": "ClearSpace, established in 2018, was previously selected by the European Space Agency (ESA) to lead the first-ever mission (ClearSpace-1) to remove debris from Earth orbit, before going on to win funding of £2.2 million from the UK Space Agency to develop CLEAR. Such projects are expected to create more than 70 new direct jobs in the UK, as well as support indirect employment and supply chain opportunities."
        },
        {
            "text": "As a leading contributor to ESA’s Space Safety programme, the UK is also enabling collaboration and funding opportunities for British scientists and space technology."
        },
        {
            "text": "The UK has also previously provided funding for the implementation of the UN Office for Outer Space Activities (UNOOSA) guidelines for the long-term sustainability of outer space. It is playing a leading role alongside UNOOSA in adopting those guidelines, which set out how countries and companies can help preserve the outer space environment for future generations."
        },
        {
            "text": " "
        }
    ]
}