{
    "url": "https://socialcare.blog.gov.uk/2023/11/06/the-importance-of-speaking-up-in-the-workplace/",
    "title": "The importance of speaking up in the workplace",
    "authors": [
        "Agnes Tutani"
    ],
    "categories": [
        "Care and support",
        "Workforce"
    ],
    "pub_date": "2023-11-06T14:47:52+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Promoting safety and support"
        },
        {
            "text": "October was the sixth annual Speak Up Month, led by the National Guardian’s office. It provided an opportunity to raise awareness and highlight the difference which Freedom to Speak Up is making in the workplace."
        },
        {
            "text": "Across Cygnet Health Care and Cygnet Social Care services, we want to make sure all staff are empowered to speak up regardless of their role or background. We have worked tirelessly to make sure each site has a Freedom to Speak Up Ambassador."
        },
        {
            "text": "Today, we have more than 180 ambassadors across our many sites. It's a real achievement and something that gives us a sense of pride as an organisation."
        },
        {
            "text": "We want to make sure we are protecting our patients' safety and improving the lives of all our colleagues. We spend more time at work than we do anywhere else, so it's important staff feel there is a safe way to raise concerns, without negative repercussions."
        },
        {
            "text": "The ambassador role is voluntary. Colleagues who choose to take it on are passionate about supportive workplace cultures and patient safety. They have been drawn from all different kinds of roles, including doctors, support workers and our administrative teams. This creates a diverse network, where we can all learn from each other."
        },
        {
            "heading": 2,
            "text": "Giving colleagues a voice"
        },
        {
            "text": "My role within the organisation is to give colleagues an extra level of support if they are worried, unsure or feel they can’t talk to someone within their line management or team."
        },
        {
            "text": "At Cygnet, there are many channels for speaking up – from a discussion with a line manager to submitting suggestions for improvements. They can raise concerns anonymously and confidentially. Or they can use our whistleblowing helpline, an independent service, available 24 hours a day."
        },
        {
            "text": "Staff can also raise concerns with us in person openly and we can then give them advice on next steps. It’s important colleagues feel listened to and their feedback acted on. Following-up closes the loop and makes sure we demonstrate positive change, learning and improvement as an organisation. Ultimately this will help us all to deliver better care, share knowledge to identify best practice and review guidance where necessary."
        },
        {
            "heading": 2,
            "text": "Never stop listening"
        },
        {
            "text": "The sign of a healthy organisation is one that listens to its colleagues. We have learnt the healthiest – and safest – cultures for patient care are those that are aware, transparent and reflective."
        },
        {
            "text": "All these values are fed by one crucial skill: our capacity to listen. Cultures of silence, where colleagues feel unable to alert others to things they believe are wrong, are the most dangerous."
        },
        {
            "text": "Colleagues need to feel heard and understood, and leaders must demonstrate they are open to new ideas. Leaders who do not listen will eventually be surrounded by staff who have nothing to say. A valued, motivated and committed team will improve care outcomes, so listening is at the very core of better service delivery and improving the lives of those we care for."
        },
        {
            "text": "I urge all those working in the health and social care sector to raise awareness of Freedom to Speak Up Guardians to help foster a culture which will improve the care provided to those who need it."
        }
    ]
}