{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/09/26/exploring-career-journeys/",
    "title": "Exploring career journeys",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "GSE Opportunities",
        "Learning & Development",
        "Talent & Leadership"
    ],
    "pub_date": "2025-09-26T15:55:32+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Civil servants joining the Science and Engineering Fast Stream "
        },
        {
            "text": "Are you a current civil servant with a background in science or engineering and want to accelerate your career through leadership development? The Science and Engineering Fast Stream could be the next chapter in your career. It offers a fast-tracked route into leadership and provides opportunities to build your skills, gain hands-on experience, and access tailored learning and development. "
        },
        {
            "text": "Ready to take the next step in your career? Read how Olivia and Alex made the move. "
        },
        {
            "text": "Meet Olivia, second year Science and Engineering Fast Streamer, Ministry of Defence (MOD) working as a Scientific Advisor based in London "
        },
        {
            "text": "What did you do before joining the Fast Stream? "
        },
        {
            "text": "Before joining the Fast Stream, I worked as a court clerk at HM Courts & Tribunals Service (HMCTS), supporting courtroom operations in a fast-paced environment. The role was both challenging and rewarding, helping me develop key Civil Service skills and learn from knowledgeable colleagues. Earlier, I held various roles from teaching English abroad to managing data, after studying Physics at university. "
        },
        {
            "text": "Why did you apply to the Fast Stream?  "
        },
        {
            "text": "Seeing the impact of public services during my time at the court inspired me to apply to the Fast Stream. I wanted to be at the heart of problem-solving, exploring options and finding the best solutions. I also saw an opportunity to apply my scientific background to major UK challenges like climate change, national security, and public health. "
        },
        {
            "text": "How has the Science and Engineering Fast Stream journey been so far for you?  "
        },
        {
            "text": "Incredibly surprising in the best way. From international work at the Department for Business and Trade to scientific research at the MOD, and a secondment with WWF UK supporting evidence-based policymaking, I’ve had opportunities I never imagined. I’ve learned a lot quickly and met inspiring people along the way. "
        },
        {
            "text": "What would you say to other civil servants interested in applying? "
        },
        {
            "text": "Firstly, remember that you bring a unique perspective to shaping policies that truly serve the public. Secondly, don’t be discouraged by the application process, I applied more than once, and the experience I gained in between helped me contribute even more. Finally, best of luck if you decide to apply! "
        },
        {
            "text": "Alex, second year Science and Engineering Fast Streamer, Department for Energy Security and Net Zero (DESNZ) working as Systems Advisor based in Manchester "
        },
        {
            "text": "What did you do before joining the Fast Stream? "
        },
        {
            "text": "Before joining the Science and Engineering Fast Stream, I completed a BSc in Biology and an MSc in Parasitology. I then worked as an assistant scientific officer at the Animal and Plant Health Agency, running diagnostic tests to support animal disease surveillance. It was hands-on, technical work that gave me a solid grounding in applied science, but I was ready for a new challenge. "
        },
        {
            "text": "Why did you apply to the Fast Stream? "
        },
        {
            "text": "I applied to the Fast Stream to broaden my experience and explore how my scientific background could be used beyond the lab. The Science and Engineering Fast Stream stood out for its variety of science-based roles across government, alongside opportunities to build leadership skills and grow my civil service career.  "
        },
        {
            "text": "How has the Science and Engineering Fast Stream Journey been so far for you?   "
        },
        {
            "text": "It’s been a rewarding and varied experience. I’ve worked in departments aligned with my interests, Defra, Natural England, and DESNZ, each offering fresh insight into how science informs government decisions. "
        },
        {
            "text": "A standout moment was managing a research portfolio on plant and tree health, where I saw how scientific evidence is commissioned and used to shape policy. "
        },
        {
            "text": "Beyond placements, I’ve networked with fellow Fast Streamers, met the Government Chief Scientific Adviser, and visited sites like Rothamsted Research, HMS Belfast, and the Satellite Applications Catapult.  "
        },
        {
            "text": "What would you say to other civil servants interested in applying?  "
        },
        {
            "text": "If you're a scientist or engineer in the Civil Service thinking about applying, go for it! The Fast Stream has allowed me to apply my science skills in new ways, explore different departments, and grow professionally. It’s rewarding to see how a scientific background can shape real-world outcomes and support government priorities.  "
        },
        {
            "text": "Inspired to take the next step in your career? The Fast Stream campaign opens at midday on 9 October 2025. Find out more about scheme on the Fast Stream website.  "
        }
    ]
}