{
    "url": "https://dwpdigital.blog.gov.uk/2025/09/26/from-pitch-to-progress/",
    "title": "From pitch to progress",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Collaboration",
        "Digital With Purpose",
        "DWP Digital",
        "Hacks",
        "innovation"
    ],
    "pub_date": "2025-09-26T14:50:15+01:00",
    "content": [
        {
            "text": "In October 2024, the Department for Work and Pensions (DWP) and Ministry of Justice (MoJ) hosted a series of ground-breaking Reverse Pitch events in Leeds, London and Manchester, welcoming over 200 innovators from 34 small businesses."
        },
        {
            "text": "They were a unique collaboration between government and start-ups to co-create innovative solutions to tackle some of the most complex challenges facing citizens today."
        },
        {
            "text": "At DWP Digital, we wanted new ideas on how to tackle some of our biggest challenges, help small companies engage with public sector and bring together people, decision makers and share insights."
        },
        {
            "text": "Andrew Western, Minister for Transformation, said of the events: “Reverse Pitch was a fantastic opportunity for start-ups to work with government to overcome the complex challenges we face. The organisations used innovation and technology to discuss how we can solve real life problems and support us to deliver high quality public services.”  "
        },
        {
            "heading": 2,
            "text": "Tackling real world problems"
        },
        {
            "text": "The events focused on specific challenges, including how DWP could design more transparent, efficient and accessible communication, reducing the learning curve for operations staff using digital products and improving rehabilitation processes for offenders on parole with MoJ."
        },
        {
            "text": "Participants engaged directly with subject matter experts in breakout sessions, generating lively discussions and innovative thinking."
        },
        {
            "text": "The day featured live demonstrations of technology solutions, user journey mapping exercises, and explorations of AI and virtual reality applications, ending in the competitive pitches."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We’ve been making steady progress with suppliers and sponsors. We supported through mentoring, resources, and working alongside on the solutions."
        },
        {
            "text": "We’ve worked with one organisation in improving numerical literacy in communications to support customer understanding, making complex information clearer, fairer, and more effective. With nearly half of UK adults having primary school-level numeracy skills, when numbers aren’t clear, it’s harder for customers to understand decisions they may need to make."
        },
        {
            "text": "We looked at how easy it is for our customers to understand the content of letters we send, the numbers, and what it actually means for them. Customers want to know simply, how much they’re due to be paid and when."
        },
        {
            "text": "If customers understand communications better, it will also reduce the number of inbound calls to DWP, saving colleagues time to then to focus on calls that need urgent support."
        },
        {
            "text": "Several workshops have been conducted, leading to advancements in analysing letter formats and online view for Debt Management colleagues. The organisation presented their methodology and outcomes to a diverse range of colleagues working in customer communications, as part of our wider Service Modernisation Programme."
        },
        {
            "text": "The other organisation focused on addressing the future of probation by replacing traditional paper CVs with online profiles suited to a more digital job environment, helping customers build and maintain their professional brand."
        },
        {
            "text": "Significant progress has been made with multiple workshops held at Finsbury Park Jobcentre, with over 30 participants. Both customers and Work Coaches provided positive feedback, indicating that the product effectively supports career advancement."
        },
        {
            "heading": 2,
            "text": "Lessons learnt"
        },
        {
            "text": "As we approach the conclusion of the fixed timeframes of the contracts, these initiatives show promising results. We recognise that barriers remain for small businesses seeking to engage with government, which was the purpose behind the Reverse Pitch events."
        },
        {
            "text": "We're currently awaiting outcome reports from both organisations. Following this evaluation, we'll explore how we can continue to collaborate to further improve DWP services."
        }
    ]
}