{
    "url": "https://defrafarming.blog.gov.uk/2025/09/26/introducing-the-commissioner-for-the-tenant-farming-sector/",
    "title": "Introducing the Commissioner for the Tenant Farming Sector",
    "authors": [
        "Alan Laidlaw"
    ],
    "categories": [
        "Tenanted sector",
        "Things we're doing"
    ],
    "pub_date": "2025-09-26T10:37:15+01:00",
    "content": [
        {
            "text": "My background in farming runs deep. I grew up on a farm in south-east Scotland. I spent my teenage years working on local farms to get a better understanding of how farming businesses operate and gained as much practical experience as I was allowed.  "
        },
        {
            "text": "That hands-on experience fuelled my passion for agriculture and gave me a deeper understanding of the land. It led me to study a land-based subject at university and start a career in farming."
        },
        {
            "text": "Since then, I’ve worked in auction marts, banking and finance, and held leadership roles in land management and investment. Most recently, I served as Chief Executive of the Royal Highland and Agricultural Society of Scotland. "
        },
        {
            "text": "Throughout my career, I’ve been a passionate advocate for the food and farming sector, and tenant farming lies at the heart of it."
        },
        {
            "text": "In England, 45% of holdings are either wholly tenanted or mixed tenure, and a third of all agricultural land in England is tenanted. This means that when tenants thrive, the whole industry benefits.  "
        },
        {
            "text": "The tenanted sector has seen significant change over the last 10-15 years. Tenancies offer flexibility and lower capital requirements, helping tenants adapt and innovate. "
        },
        {
            "text": "For landlords, they provide productive land, a stable income, and a way to support new entrants. Yet the sector remains vulnerable to policy shifts, and with average tenancies lasting just 3 years, long-term planning can be a challenge. Strong tenant-landlord relationships are therefore essential.  "
        },
        {
            "text": "The government created the role of Commissioner for the Tenant Farming Sector to strengthen relationships between tenant farmers, landlords and advisers. "
        },
        {
            "text": "This means: "
        },
        {
            "text": "This is the first time England has had a commissioner dedicated to the tenanted sector. There’s real potential to make a difference. "
        },
        {
            "text": "As this is a new role, I’m taking time to get fully up to speed – understanding the department’s ambitions and the sector’s expectations. Setting up the office and our processes is also well underway. "
        },
        {
            "text": "I’ve already met with Minister Eagle and visited a tenanted farm with the Secretary of State, Emma Reynolds.  "
        },
        {
            "text": "I’ve met team members with years of experience on tenant issues, and they’ve made steady progress. "
        },
        {
            "text": "One major milestone was the publication of the Rock Review, its recommendations and the government’s response. As mentioned above, it included the creation of the Farm Tenancy Forum to strengthen engagement with the sector.  "
        },
        {
            "text": "Together, we’re putting the foundations in place so we can make a strong start. "
        },
        {
            "text": "Some of the Rock Review recommendations were things that could be acted on and implemented quickly. Others are still in progress, and some will take longer.  "
        },
        {
            "text": "I’ll be honest about where the challenges are where change may not be possible. Without trust, we won’t achieve the change that’s needed to support a thriving tenanted sector. "
        },
        {
            "text": "I can now build on that work by having our small team work directly with the sector to promote the Code of Practice, keep up the momentum, strengthen positive relationships and share what we learn through the Farm Tenancy Forum. "
        },
        {
            "text": "The Farm Tenancy Forum brings together experts from the sector and government to focus on the big issues. When that happens constructively, with real commitment, progress can be made.  "
        },
        {
            "text": "Over the coming months, I’ll meet with stakeholder organisations across the country. I’ll also draw on my own experience and speak directly with farmers. Some of that will be in public forums. Some will be in one-to-one conversations. The aim is the same: making sure everyone has a voice. "
        },
        {
            "text": "Whenever there’s an opportunity to get involved, we’ll share it on the blog, whether that’s joining industry discussions, or taking part in events and visits. "
        },
        {
            "text": "In simple terms, I want tenant farmers and land managers to feel confident using tenancies to meet their goals – whether that’s growth, output, sustainability, or lifestyle. "
        },
        {
            "text": "I want to see a flexible, functioning, well-supported sector that’s ready to meet the changing needs of the land and the people who manage it – whatever form that takes.  "
        },
        {
            "text": "I’ll work hard to strike the right balance, to speak truth to power where needed, and to be honest about what’s working – and what isn’t. To do that, we need open engagement, active discussion from different viewpoints, and a bit of patience. Change takes time. You can’t expect a tractor and drill to turn on a sixpence, just as you can’t expect relationships and culture to shift instantly. Small, steady movements are necessary. "
        },
        {
            "text": "We’re currently working on providing more information on the Commissioner for the tenant farming sector GOV.UK page and setting up communication channels. Once these are ready, we’ll share them – and I’d welcome input from farmers, landlords, agents, industry organisations, and anyone involved in the sector on what would be most useful to include. "
        },
        {
            "text": "Our aim is to make engagement as straightforward as possible; while ensuring we maintain privacy and impartiality. In the meantime, if you’ve got ideas for how we can do that better, drop the team a line: AgriculturalTenancies@defra.gov.uk. "
        },
        {
            "text": "I am attending a number of events over the coming weeks, including the next Tenant Farming Forum meeting – a great opportunity to meet both those who have already contributed to progress and new voices from across the sector. I look forward to meeting you and to what we will achieve together.  "
        },
        {
            "text": " "
        }
    ]
}