{
    "url": "https://mhclgmedia.blog.gov.uk/2025/09/26/pride-in-place-coverage/",
    "title": "Pride in Place coverage",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-09-26T12:19:26+01:00",
    "content": [
        {
            "text": "This week the Ministry of Housing, Communities and Local Government (MHCLG) announced the Pride in Place Programme, a landmark £5 billion initiative that will see money handed to communities to invest in their priorities and revitalise high streets over the next decade."
        },
        {
            "text": "There is widespread, positive national and regional coverage of the announcement, focussing on the funding for areas and how local people will be in charge of where money goes.   "
        },
        {
            "text": " The Mirror writes the announcement up as a “major investment” as part of the PM’s backing for the UK’s ‘true patriots’. The piece goes on to quote the Prime Minister’s speech yesterday, announcing the funding, and also carries comments from MHCLG’s Secretary of State and the Chancellor. The paper’s editorial, titled ‘Streets of Hope’, sets out the announcement isn’t just about “bricks and mortar” but about bringing “hope and opportunity” to communities. The Independent takes a closer look at the programme, explaining what it means, highlighting the fact that the money will be given to communities to spend as they see fit for their areas."
        },
        {
            "text": "BBC News also newly features an interactive map as part its online explainer on the announcement, showing where the funding has gone to."
        },
        {
            "text": "There has also been widespread regional coverage across England, with stories positively reporting on the individual funds going to their areas to invest in their communities, with many local papers welcoming funds for their “long overlooked” towns - from the South (Sussex World, Bristol World, Kent Online) to the East of England (Southend Echo and Colchester Gazette), the Midlands (BBC Birmingham & Black Country, Birmingham Live, BBC Telford and Derbyshire Live) North West (Lancashire Post, Lancashire Telegraph, Cumbria News & Star and Liverpool Echo), North East (Chronicle Live and Sunderland Echo) and Yorkshire and the Humber (BBC Yorkshire)."
        },
        {
            "text": "In Scotland, headlines focus on the “decade of national renewal” and the “boost for high streets” with £292m going to Scottish towns (Daily Record,  The Herald, Glasgow Times,  The Edinburgh Reporter, Cumnock Chronicle and Inverness Courier) and in Wales, reports lead with the total £214m to help “clean up their towns” (Wales Online, BBC Wales online, Caerphilly Observer, Swansea Bay News, Business News Wales, Deeside.com and South Wales Argus)."
        },
        {
            "text": "Prime Minister Keir Starmer said: "
        },
        {
            "text": "“For too long, people have watched their towns and streets decline – powerless to stop boarded-up shops and neglected parks. That ends now.  "
        },
        {
            "text": "“We’re investing in the UK’s future, by backing the true patriots that build our communities up in neighbourhoods across every corner of the country. Because it’s people who bring pride, hope and life to our communities."
        },
        {
            "text": "“This is a huge investment, but what matters most is who decides how it’s spent: the neighbours, volunteers and parents who know their communities best – the people with real skin in the game. "
        },
        {
            "text": "“We’re choosing renewal over decline, unity over division. This is our Plan for Change in action – giving power and pride back to the people who make Britain great.” "
        },
        {
            "text": "Secretary of State for Housing, Communities and Local Government, Steve Reed said:  "
        },
        {
            "text": "“Building pride in place starts with people, not politics. Local people know what they want to see in their neighbourhoods – and they don’t need government to dictate it. "
        },
        {
            "text": "“This plan will spark an historic grassroots movement that will restore local people’s power, boost national pride and help people get on in life across the UK as part of our Plan for Change.” "
        },
        {
            "text": "The Chancellor of the Exchequer, Rachel Reeves said:  "
        },
        {
            "text": "\"We’re giving local people the power to transform their hometowns. Giving them more control of how money is spent where they live so that together we can invest in Britain’s renewal and build an economy that rewards working people. "
        },
        {
            "text": "“This £5 billion investment doesn't just reverse decades of underinvestment in our public infrastructure – it cuts through the bureaucracy by giving local people the power to deliver the change they want to see.\" "
        }
    ]
}