{
    "url": "https://nationalscreening.blog.gov.uk/2024/09/04/a-busy-first-year-for-uk-nscs-expert-research-guidance-group/",
    "title": "A busy first year for UK NSC’s expert research guidance group",
    "authors": [
        "David Thompson"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-09-04T08:12:15+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee's (UK NSC) Research and Methodology Group (RMG) was set up to provide guidance on the UK NSC’s research requirements and ensure that future screening research addresses critical questions in ways that can effectively inform policy decisions."
        },
        {
            "text": "Looking back on the group’s first year, it’s clear the RMG has already made significant strides in fulfilling its mission."
        },
        {
            "heading": 2,
            "text": "The role of the RMG"
        },
        {
            "text": "The RMG is a team of 8 screening research experts who have a wealth of knowledge and experience. Over the past year, the group has been busy advising scientists from across the UK on a variety of research proposals. These have spanned topics ranging from screening for type 1 diabetes to cancer, sudden cardiac death, preterm birth prevention and other conditions."
        },
        {
            "text": "Feedback from researchers has been overwhelmingly positive, with many finding the RMG’s advice invaluable in shaping their research to align with policy needs and to ensure the outcomes are meaningful and actionable."
        },
        {
            "heading": 2,
            "text": "Focus on cutting-edge technologies "
        },
        {
            "text": "An important focus for the RMG in its first year has been helping the UK NSC understand the potential impacts of new and emerging technologies in the field of screening. The group has provided crucial advice on several groundbreaking advancements, including multi-cancer detection tests (MCDs), AI technologies for breast cancer and diabetic eye screening, and the potential use of whole genome sequencing in newborn screening."
        },
        {
            "text": "In addition to advising on new technologies, the RMG has also supported the UK NSC and researchers on a number of cross-cutting projects. These have included work on addressing inequalities in screening, evaluating surrogate outcomes, screening using multi-disease tests, and the impact of incidental findings in screening programmes."
        },
        {
            "heading": 2,
            "text": "Group’s growing importance "
        },
        {
            "text": "As the RMG continues to expand its role, it is quickly becoming an indispensable part of the UK NSC’s efforts to advance screening research and policy. In an era of rapid technological advancement, the RMG has already proven the need for an expert research subgroup within the UK NSC, as recommended by the UK’s 4 chief medical officers."
        },
        {
            "text": "Prof Sian Taylor-Phillips, the chair of the RMG, said:"
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "By providing expert guidance, the RMG will help make sure the UK NSC's screening recommendations are informed by the most robust and relevant research available. It is clear the group has already had a significant impact on the future of screening research in the UK."
        },
        {
            "text": "Over the next year the group will look to expand its range of expertise by recruiting new members. We will publish more information on this process in the autumn."
        },
        {
            "heading": 2,
            "text": "Submitting research proposals to the RMG"
        },
        {
            "text": "The RMG meets 4 times a year to review new research proposals."
        },
        {
            "text": "Researchers submitting research proposals for the RMG to comment on should follow the online guidance for research applicants."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}