{
    "url": "https://insideDIO.blog.gov.uk/2024/09/04/life-as-an-mgs-dog-handler/",
    "title": "Life as an MGS dog handler",
    "authors": [
        "Chris Moore"
    ],
    "categories": [
        "MOD Guard Service",
        "Recruitment",
        "Working at DIO"
    ],
    "pub_date": "2024-09-04T00:30:22+00:00",
    "content": [
        {
            "text": "Chris and Wraith at work. [Crown Copyright / MOD 2024]Working within the Ministry of Defence Guard Service (MGS), colleagues and I play a key part in safeguarding national security. Our teams work around the clock to keep MOD sites safe and secure and enable those who work in them to focus on their important work."
        },
        {
            "text": "There are various unique roles within the MGS, including my own as a Dog Handler."
        },
        {
            "heading": 2,
            "text": "Meet Wraith"
        },
        {
            "text": "I work with Wraith, a two-year-old Belgian Malinois, who is one of our invaluable patrol dogs at DMS Whittington, in Staffordshire."
        },
        {
            "text": "While he is highly trained patrol dog, who performs his role perfectly, in his down time, Wraith is a really energetic dog who loves to chase his toys and has a particular fondness for squirrels."
        },
        {
            "text": "As most of my 12-hour shifts are spent with Wraith by my side, we have a great bond together, very different to the one you would have with a pet dog. He is brilliant and I know he will have my back at work should a dangerous situation or threat ever arise."
        },
        {
            "text": "Chris and Wraith on patrol. [Crown Copyright / MOD 2024]When patrolling sites, the questions I’m most frequently asked are ‘Does he bite?’ and ‘Can I stroke him?’. However, because Wraith is a military working patrol dog, he is trained to bite if required to help protect MOD sites and staff. Because of this, it would be inappropriate to allow people to stroke him while he is on duty, as he has a very important job to do."
        },
        {
            "heading": 2,
            "text": "Always training"
        },
        {
            "text": "Wraith’s initial training was at the Defence Animal Training Regiment, in Melton Mowbray, Leicestershire, before he was assigned to work with me in the MGS."
        },
        {
            "text": "But his training didn’t stop there, our MGS dogs regularly undertake Continuation Training to ensure they are always ready to protect our people. This comprises training on agility, obedience, restraint and manipulation, man work or bite work, conditioning, distraction and patrolling."
        },
        {
            "text": "An MGS dog handler takes a dog through an enrichment exercise. [Crown Copyright / MOD 2024]It’s not just the working dogs that have to go through a lot of training, as us handlers have to complete extensive training too."
        },
        {
            "text": "One of the most challenging times in my career was getting my first dog licence before I was teamed up with my first dog, Ziva, who has now retired. During the course, I was assessed on all aspects of dog handling, including dog welfare, obedience and the strict criteria for when you can and cannot release your dog."
        },
        {
            "text": "The hard work paid off though, and I was delighted to be given the Top Student Award by the course instructors."
        },
        {
            "heading": 2,
            "text": "Interested in working with us?"
        },
        {
            "text": "I’ve been with the MGS for three years now, and knew working with dogs was what I wanted after being invited to see how the MOD Police train their dogs."
        },
        {
            "text": "My advice for anyone considering becoming an MGS Dog Handler would be to go for it. If you love dogs, this could be job for you – plus getting chased by a dog in a bite sleeve is great fun!"
        },
        {
            "text": "Interested in joining the Ministry of Defence Guard Service? See our current vacancies and apply on the Civil Service Jobs website."
        }
    ]
}