{
    "url": "https://marinescience.blog.gov.uk/2024/09/04/navigating-fisheries-science/",
    "title": "Navigating Fisheries Science: Insights and emerging issues by fisheries scientists",
    "authors": [
        "Rui Pedro Vieira",
        "Fiona Gilmour",
        "Carl O'Brien",
        "Robert Thorpe",
        "David Murray"
    ],
    "categories": [
        "Careers",
        "Fisheries",
        "Monitoring",
        "Renewables",
        "Science",
        "Technology",
        "Uncategorized"
    ],
    "pub_date": "2024-09-04T11:29:14+01:00",
    "content": [
        {
            "text": "In July 2023, The Fisheries Society of the British Isles (FSBI) 2023 Annual Symposium, co-convened by the University of Essex and the Centre for Environment, Fisheries and Aquaculture Science (Cefas) aimed to discuss the latest fish biology and fisheries science, under the theme ‘Fish Habitat Ecology in a Changing Climate’.  "
        },
        {
            "text": "The FSBI 2023 Annual Symposium not only put under the spotlight Cefas’ leading science role in fisheries science but was an opportunity to establish new collaborations. Following the conference, a group of scientists from Cefas shared their views on emerging issues affecting fisheries and suggested where research efforts could contribute to achieving sustainable fisheries. "
        },
        {
            "text": "Ahead of the International Council for the Exploration of the Sea (ICES) ‘Annual Science Conference’ (ASC), hosted by the United Kingdom in Gateshead from 9-12 September 2024, Cefas Scientists, Rui Vieira, Robert Thorpe, David Murray, Fiona Gilmour and Carl O'Brien discuss this new paper in our latest marine science blog."
        },
        {
            "text": "Can you give the top headlines of the paper and the main challenges facing fisheries science? "
        },
        {
            "text": "The marine environment is ever-evolving, meaning fisheries science must adapt to change. The most obvious change in the marine environment is the human expansion of offshore wind (OSW) energy. The rate of development is accelerating both nationally and internationally, and it is important that science can keep pace. Evidence of the ecological impacts of OSW developments on fisheries species at an individual, populations and stock level are currently limited. Even less is known about the cumulative impacts of OSW and developing new technologies, such as floating OSW.  "
        },
        {
            "text": "To address these knowledge gaps, it is important that there is access to baseline fisheries data and that monitoring of fisheries resources is occurring at an appropriate scale, within and around the OSW sites prior to and during construction and their operation. However, traditional fisheries monitoring techniques such as trawl surveys are often not compatible with OSW areas. This means new monitoring techniques should be trialled, which is a big challenge. "
        },
        {
            "text": "We also focus on challenges regarding the rapid development of advanced scientific techniques and modern statistical packages, which have provided new tools for fisheries scientists. For example, genomics has provided a unique insight into fish demographics; opening paths to assess the structure of populations both in the immediate term but also over evolutionary timescales, allowing us to predict how climate change may impact fish populations in the future. One of the crucial issues is how we sensibly integrate current and long-term population structure information within existing advice frameworks for helping to achieve sustainable fisheries.  "
        },
        {
            "text": "Another focus is the use of an ecosystem approach to fisheries management. The current approach has generally improved the state of managed fisheries, however a holistic approach that considers the entire ecosystem makes sense when managing fish stocks due to predation and competition for resources.  In this paper, we have pioneered a new integrated indicator to assess whether individual stocks are depleted. This will allow fisheries managers to set an acceptable level of risk in collaboration with stakeholders alongside the scientific process. "
        },
        {
            "text": " "
        },
        {
            "text": "Given the rapid advancements in technology (e.g., satellite tracking, genetic analysis), how do you stay up-to-date and incorporate these tools into your research? "
        },
        {
            "text": "Currently, we keep up to date with research and publications on fisheries. Each person is a member of different ICES working groups and we actively participate in activities and discussions with other members and other working groups. We collaborate with working group members representing other countries to learn about ongoing science and data collection from across Europe and the USA.  "
        },
        {
            "text": "Currently, OSW research at Cefas is not incorporating new technologies in our research, specific to the ecological impact of OSW on fisheries species, instead focusing on what can be detected and determined with existing data. However, we are actively looking at incorporating new technologies into research and monitoring, for example, the joining of different methods to collect real time data for different life-stages is an area under development (e.g. AI-assisted plankton imaging, juvenile surveys as well as adults, applying traditional and remote methods for data collection).  Cefas’ Offshore and Marine Renewable Energy (OMRE) group meets regularly and helps us keep up to date with ongoing research across various topics associated with OSW.   "
        },
        {
            "text": " "
        },
        {
            "text": "What excites you about where the technology for fisheries science is going? "
        },
        {
            "text": "Improved technology creates better opportunities for efficient and potentially more cost-effective methods of data collection and monitoring. This could help to provide the required data and evidence to address knowledge gaps on the topic. By combining methods and taking account of different life-history stages, occurrence, distribution, and behavioural response to human activities to increase understanding of spatial habitat use and the ability to obtain good time-series data is exciting. "
        },
        {
            "text": "For genetics, fisheries scientists are seeking to find applied uses for state-of-the-art techniques, such as long-read sequencing, and epigenetics. Working in collaboration with academia, Cefas’ scientists are seeking to use the natural degradation of DNA to age endangered or protected species of fish, including sharks, which can then be used to inform stock assessments for data-limited species without the need for lethal sampling.  "
        },
        {
            "text": " "
        },
        {
            "text": "In the paper, you state that planning, clear communication and engaging with all interested parties is key. What role does stakeholder engagement including with communities play in addressing emerging fisheries issues? "
        },
        {
            "text": "Effective engagement and communication are particularly important with respect to fisheries and OSW developments. Through engagement with fishers, we can help to better understand changes in perception of OSW over time; there is potential for perception to change with increased longer-term evidence. Engagement with stakeholders is crucial to understand concerns, informing targeted data collection to provide the evidence needed to determine whether mitigation is needed. The value of anecdotal, local knowledge from fishers should not be underestimated as it provides useful indications of fish distribution and abundance in response to OSW developments, however, this information can only be obtained with clear communication. Good relationships with the fishing industry and stakeholders creates the potential for collaborative research and monitoring - a great example of this would be the Westermost Rough wind farm which became operational in May 2015 and the Holderness Fishing Industry Group.    "
        },
        {
            "text": " "
        },
        {
            "text": "How would you like to see the fisheries science community moving forward with some of the recommendations in the paper?  "
        },
        {
            "text": "It would be great to see the increased use of an ecosystems-based approach in fisheries science, considering the broader picture and all factors influencing fisheries.  "
        },
        {
            "text": "With regards to OSW and fisheries, collaboratively identifying the key barriers impacting the effective implementation of policies, and the consenting process is important. From this, we hope to develop research questions that can address these and then planning robust monitoring and data collection methods that can provide the data needed to benefit multiple stakeholders.  "
        },
        {
            "text": " "
        },
        {
            "text": "It’s clear that being a fisheries scientist is an ever-changing landscape and some may feel overwhelmed by this. What advice would you give to someone interested in a career in fisheries science?   "
        },
        {
            "text": "View the changing landscape as a positive; that it is a field of science with many unknowns and ever-expanding opportunities to work on new areas of science. Many areas of expertise not traditionally thought of as fisheries science have an increasing role to play in developing solutions to incredibly complex problems. Converse with people throughout your career and be open to new and challenging ideas - you can learn a lot from others who have witnessed the changes in fisheries science over many decades.  "
        },
        {
            "text": " "
        },
        {
            "text": "Why is ICES so important for fisheries scientists/early career scientists? "
        },
        {
            "text": "ICES Annual Science Conference is a great forum to meet and engage with diverse communities and people from different scientific backgrounds to share ideas. In this context, we need our fisheries science to continue to innovate to understand better how fish populations are changing in response to changes in climate or other human-induced pressures.  We also need to challenge the status quo, moving away from single species assessments and advice when these are no longer appropriate for long-term sustainability and management applications. "
        },
        {
            "text": "In the UK and within ICES, Cefas is committed to engaging, supporting, and developing the next generation of marine scientists, as well as taking steps to ensure our new talent reflects the breadth of our society.  Early career researchers are an essential element of every ASC; many will establish life-long connections with ICES and develop their own networks and groups. Throughout the week, there will be many opportunities to engage with the ICES network and broaden personal connections. "
        },
        {
            "text": " "
        },
        {
            "text": "Looking forward to the ICES ASC "
        },
        {
            "text": "This year the ICES conference will address the critical science and advisory challenges that we in the UK and across the ICES’ network are striving to address biodiversity loss, marine climate change, pollution, and energy security.  By bringing together our collective expertise and enabling knowledge exchange, we aim to strengthen our partnerships, evidence, and advice, working together to support healthy and productive marine ecosystems as well as balancing societal needs. "
        },
        {
            "text": "The ICES ASC offers another great opportunity to expand and develop our thinking in the areas discussed within the paper and we hope to encourage those within and outside of the community to consider attending to join the conversations.  "
        }
    ]
}