{
    "url": "https://actuaries.blog.gov.uk/2021/08/18/apprenticeships-then-now-and-next/",
    "title": "Apprenticeships - then, now and next",
    "authors": [
        "Miriam Singh - Business Development Administrator"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2021-08-18T09:51:16+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "I joined GAD as a Business Development apprentice at the end of February 2020, a month before the lockdown began. After spending months applying for jobs, I decided to narrow down my search to business, marketing and communications, areas which I found most interesting."
        },
        {
            "text": "I always had an interest in working for the Civil Service as I enjoyed my work experience placement at a local council. Like most of the other apprentices I found the Business Development apprentice role on the Civil Service Jobs website. I thought that it was a great way to start in a field in which I didn’t have any previous experience or qualifications."
        },
        {
            "heading": 2,
            "text": "Reflections"
        },
        {
            "text": "When I reflect on my past year a half at GAD, I realise that I have developed immensely since I first started. I have moved from helping with business development support to taking over the support practices myself, as well as providing support to communications."
        },
        {
            "text": "There have been so many opportunities to learn throughout the apprenticeship. Whether that’s been through work tasks, qualification modules or learning from senior staff. This combined with the extensive support from my team and the department has enabled me to develop vastly in a short space of time."
        },
        {
            "text": "From this role I have gained analytical skills, developed my creative skills, and gained overall confidence in my abilities. I have also learnt more about my own strengths which will help me with deciding my future career path."
        },
        {
            "text": "Ruby Voss - Human Resources apprentice - on initial impressions of GAD."
        },
        {
            "text": "“I have really enjoyed my time working at GAD and have learnt so much over the past few months. Working for a fairly small organisation has been a really positive experience and I have felt welcomed as an employee from the start.”"
        },
        {
            "heading": 2,
            "text": "Challenges"
        },
        {
            "text": "Perhaps the most challenging part of the apprenticeship is managing the work alongside studying. As you progress both on the qualification and at work it can be difficult to stay on top of your workload. Support from staff and the training establishment however is always there to aid if it becomes unmanageable. Furthermore, effective organisation is a key skill that is developed."
        },
        {
            "text": "I personally found that my qualification was particularly useful with helping me understand about my organisation and my role. I was able to develop my communication skills and learn about some project management techniques. I’ve found that project management tools have been a useful addition to the planning stages of my long-term work tasks."
        },
        {
            "text": "Charles Pettit - Project Management apprentice - discusses the benefits of studying."
        },
        {
            "text": "“Having led on projects at my previous workplace without any real training, I have found the apprenticeship hugely useful."
        },
        {
            "text": "“I have not employed all the modules or skills that I have been taught yet, however as my time at GAD moves on, I’m sure I will. I’m granted a protected day which I use for the study element of my apprenticeship - therefore it’s easily manageable.”"
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "What happens to apprentices after they have qualified? This is currently the stage I’m at. I’m exploring ways in which I can further support the department and gain more useful skills. Some apprentices have stayed to take on roles at the department, and others have left after finding jobs elsewhere."
        },
        {
            "text": "Other former apprentices who've moved into roles at GAD, share their views."
        },
        {
            "text": "Mary Tennyson - HR Officer"
        },
        {
            "text": "“I completed my HR Level 3 qualification last year and since then have progressed on to becoming an HR Officer here at the Government Actuary’s Department. Being able to study and apply my knowledge in my day-to-day work activities has been a rewarding experience as I gained various skills within this apprenticeship."
        },
        {
            "text": "\"I’ve developed my confidence in the work that I do by going on to train my colleagues with the processes that I’ve learnt. By doing this apprenticeship, it has given me a boost of motivation and sense of achievement. I know what I want to do and where I want to be."
        },
        {
            "text": "\"I definitely recommend apprenticeships to anyone who’s looking for a kickstart in their career. You get plenty of support from your colleagues and equally the training establishment. To progress on to meeting my goal, I have even started my Level 5 Chartered Institute of Personnel Development qualification this year and hope to complete it soon!”"
        },
        {
            "text": "Nicola Melgarejo - Finance Officer"
        },
        {
            "text": "“Completing an apprenticeship gave me a foot in the door to starting a career within finance. It was an opportunity to gain an overview of the profession despite not previously having any previous experience in the area."
        },
        {
            "text": "\"My job description was also varied to allow me to practice some of the different areas of learning within the apprenticeship qualification. It means I feel I gained a wider level of experience in a shorter space of time than if I'd gone into a non-apprenticeship entry level role.”"
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}