{
    "url": "https://deframedia.blog.gov.uk/2021/08/18/better-welfare-conditions-for-millions-of-farm-animals-during-transit/",
    "title": "Better welfare conditions for millions of farm animals during transit",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-08-18T11:57:13+01:00",
    "content": [
        {
            "text": "There is widespread media coverage this morning follow our announcement of new welfare rules for transporting farm animals in England and Wales. The story was covered by I News, Daily Telegraph, The Sun and Daily Express."
        },
        {
            "text": "Independent evidence has shown that very long journeys can cause heat stress, dehydration and physical injuries in transported animals such as horses, pigs, sheep, poultry and cattle."
        },
        {
            "text": "EU rules had previously prevented any changes to animal welfare rules, however as an independent nation the UK is now able to go further and build on the UK’s position as a world leader in this field through a series of reforms to improve standards, as set out in the Action Plan for Animal Welfare."
        },
        {
            "text": "The new rules will raise welfare standards for farm animals by introducing shorter maximum journey times, provide animals with more headroom and implement strict rules on transport during extreme temperatures."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "The Government has listened to early feedback from industry and will now work with the farming sector and welfare groups to develop these proposals and prepare for the transition to the higher standards to build on the high-welfare outcomes already being delivered on farms across England and Wales."
        },
        {
            "text": "The announcement follows a twelve-week consultation launched in December, which sought industry and public views on proposals to improve animal welfare in transport. Read our consultation response on GOV.UK."
        }
    ]
}