{
    "url": "https://civilservice.blog.gov.uk/2021/08/18/civil-service-awards-2021/",
    "title": "Civil Service Awards 2021",
    "authors": [
        "Lorraine McBride"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-08-18T10:13:39+00:00",
    "content": [
        {
            "text": "It’s that time again! The Civil Service Awards is back on 16 December 2021 and we want you to nominate."
        },
        {
            "text": "The popular Civil Service Awards is an annual celebration of stellar work achieved across the Civil Service, in areas ranging from evaluation to collaboration, leadership to partnership, lifetime achievement and many more. "
        },
        {
            "text": "For 16 years, these unique, inspiring and empowering awards have helped share innovation, learning and leadership."
        },
        {
            "text": "The Civil Service Awards 2021 will be hosted live from Lancaster House on 16 December 2021 - when our winners will be revealed. Now, we want to know which person, programmes and teams have really impressed you most over the past 12 months. "
        },
        {
            "text": "Following a full refresh, the CS Awards 2021 will span 13 categories and they’re all nominated by you. "
        },
        {
            "text": "The vision for A Modern Civil Service that is skilled, innovative and ambitious was launched in June. The new awards embody this vision and each category sits under the following banners."
        },
        {
            "text": "◼︎Skilled: Investing in skills, championing expertise and strengthening leadership. Reflecting the country we serve and creating opportunities around the UK. "
        },
        {
            "text": "◼︎Innovative: Finding new ways to solve problems to deliver for the public. Showing commitment to new ideas and experimentation, accepting that some ideas won't work."
        },
        {
            "text": "◼︎Ambitious: Achieving excellence in project and public service delivery. Making it easy to collaborate and provide a seamless experience for the public."
        },
        {
            "text": "So, if you know a colleague or team who has done some brilliant work this year, you can nominate them for an award by 5pm on 15 September 2021 for their chance to be recognised for their work. And after you’ve all had your say, a shortlist of nominees will be selected for each award, and then the winners will be announced at the ceremony in December."
        }
    ]
}