{
    "url": "https://civilservicelocal.blog.gov.uk/2021/08/18/policy-pathway-programme-policy-insight-sessions/",
    "title": "Policy Pathway Programme- Policy Insight Sessions",
    "authors": [
        "dianecoates"
    ],
    "categories": [
        "A National Spotlight"
    ],
    "pub_date": "2021-08-18T13:35:58+00:00",
    "content": [
        {
            "text": "We are delighted to share the latest news from the Policy Pathway Programme with you.  We have some amazing events and opportunities lined up in the weeks and months ahead and we are very pleased to say that some of them are getting closer and tickets are available right now."
        },
        {
            "text": "If you’re looking for a career in the North West, interested in broadening your horizons and seeing what careers are available to you then we would like to start by showcasing the Policy Profession. Policy is for everyone, and we want to tell you all about it, so why not grab yourself a ticket for one of our upcoming Policy Insight Sessions and let us do just that!"
        },
        {
            "text": "These online Teams sessions are designed to give you an insight into what the policy world is really like and we have some wonderful colleagues from the policy profession who are here to answer your questions, dispel myths about the profession and offer advice and support.  "
        },
        {
            "text": "In policy you get to make a real difference, change things for the better and be instrumental in creating citizen centred policy that lands better in our communities.  If that sounds like the type of career you want then take the first step and come along to one of our insight sessions because you never know where it might lead.   Your future is in your hands and we are more than happy to open the door to the Policy world for you."
        },
        {
            "text": "We want to help you become as passionate about policy as we are.  "
        },
        {
            "text": "We have lots of different days and times for our sessions available, so it couldn’t be easier to come along, just choose a time and day that is convenient for you and jump onto Teams to say hello. "
        },
        {
            "text": " "
        },
        {
            "text": "We have amazing guest speakers for you and an array of stalls showcasing the Policy departments across the Civil Service in Northwest.  What are you waiting for?   Remember, one experience, one choice, can change your life.   "
        },
        {
            "text": "To keep up to date on all of our future events, subscribe to this blog, or email cslocalnw@cabinetoffice.gov.uk to sign up to the Civil Service Local North West newsletter,  and why not like our Facebook page too, everything we do, is for civil servants, just like you.   "
        },
        {
            "text": " If you need further information about the programme please contact the lead and developer fiona.gilbert@cabinetoffice.gov.uk"
        },
        {
            "text": " "
        }
    ]
}