{
    "url": "https://dataingovernment.blog.gov.uk/2021/08/18/spreadsheets-in-government/",
    "title": "Our new guidance on improving spreadsheets in government",
    "authors": [
        "Data Standards Authority Team, CDDO"
    ],
    "categories": [
        "Data literacy",
        "Data Standards",
        "Excel",
        "Google Sheets",
        "Spreadsheets"
    ],
    "pub_date": "2021-08-18T15:42:16+01:00",
    "content": [
        {
            "text": "The Data Standards Authority recently published guidance on creating and sharing spreadsheets with the aim of improving how people in government use spreadsheets to share and publish data."
        },
        {
            "text": "All kinds of people in government use spreadsheets to record and share information. This includes data experts like analysts and statisticians, but also people in roles as diverse as finance, project management, research and design. "
        },
        {
            "text": "However, people do not always use best practices for data when creating spreadsheets, which leads to common problems that make them difficult or inefficient to use. Poor spreadsheet practice can also lead to errors in things like data accuracy or data privacy, which can have serious consequences on organisations and citizens. "
        },
        {
            "heading": 2,
            "text": "Who we worked with"
        },
        {
            "text": "Having identified an opportunity for clear guidance on good spreadsheet practice, we spoke with colleagues across government to understand user needs and how best to address them. "
        },
        {
            "text": "We ran a survey and held workshops for colleagues in a range of departments and functions to learn about how they use spreadsheets and the challenges they face with them. We also consulted with experts in topics ranging from data architecture to content accessibility to help us draft guidance that was comprehensive but user-friendly. "
        },
        {
            "heading": 2,
            "text": "What the guidance covers"
        },
        {
            "text": "The guidance on creating and sharing spreadsheets outlines best practices and practical considerations, including:"
        },
        {
            "text": "No matter what role you’re in or how much you work with data, you can help make government data sharing better by reading this guidance, sharing it with your colleagues and encouraging your team or organisation to follow it. "
        },
        {
            "heading": 2,
            "text": "How we’ll keep improving this guidance"
        },
        {
            "text": "As with any other guidance we publish, the work doesn’t stop when we hit the ‘Publish’ button. To make this guidance as useful as possible, we will continue to:"
        }
    ]
}