{
    "url": "https://environmentagency.blog.gov.uk/2021/08/18/the-buzz-of-the-cut-off-channel/",
    "title": "The buzz of the cut-off channel",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Other areas of our work"
    ],
    "pub_date": "2021-08-18T10:34:36+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "By Simon Ross, a floods and coastal risk management officer for East Anglia. "
        },
        {
            "text": "Living in Lakenheath and very close to the cut-off channel* all my life, I have always been surrounded by wildlife and nature. But it never dawned on me just how much I could help the bee population until lockdown."
        },
        {
            "text": "I have worked for the Environment Agency in the Flood Coastal Risk Management (FCRM) team for 5 years.  My role consists of me travelling across the Anglia region to review and improve FCRM assets however, when lockdown struck I was unable to get out as much and my curiosity of bees began to peak."
        },
        {
            "text": "After 2 months of studying beekeeping books and woodworking plans, I set about building my first beehive using reclaimed materials from a recent building project. It took me a week to complete but within just a few days it attracted a swarm of wild bees! The sound was terrifying but within an hour they were all happily inside the hive with just a few buzzing about getting their bearings. I had learned that during this time the bees are relatively harmless as they have no young to protect and are only moving to a new home."
        },
        {
            "text": "After that success I then began purchasing more hives and supplies to accommodate the ever-growing colony."
        },
        {
            "text": "My success encouraged me to join a local bee keeping association and then the national databases to become a fully registered beekeeper."
        },
        {
            "text": "As a result, I have been called to collect many local swarms and now have 2 large healthy colonies that consist of an estimated total of 60,000 bees. The bees work hard pollinating the nearby nature reserve and surrounding crops."
        },
        {
            "text": "I also helped and encouraged my colleague Ben Di Giulio to become a beekeeper too. He introduced beehives onto the Environment Agency Denver Complex. You can read his story here."
        },
        {
            "text": "When my hive starts to produce enough honey I plan to complete a food hygiene course so I can sell the honey to a local farm shop which has recently opened in my village."
        },
        {
            "text": "Once the bee population grows I am also going to look into having my own larger apiary in some privately owned land not far from my home that will also benefit the farmland in that area."
        },
        {
            "text": "Members of the public can help the bee population in their own garden by planting flowers, letting areas grow wild, not over-mowing the grass and not using pesticides."
        },
        {
            "text": "*The cut-off channel is a key component of the Ely Ouse Flood Protection Scheme constructed in the 1950s-60s following devastating flooding of the Fens in both 1937 and 1947. It is a man-made channel that flows from Mildenhall, to convey flood waters from the River Lark, Little Ouse River and the River Wissey away from the South Level of the Great Ouse Fens. It connect with the Relief Channel at our Denver Complex and flood water is discharged to the Tidal River via Tail Sluice near King’s Lynn. The Cut-Off Channel now also plays an important role in terms of public water supply in transferring water from the Ely Ouse to Essex. For more information on this and other Fens flood infrastructure please see our report available here."
        }
    ]
}