{
    "url": "https://dfedigital.blog.gov.uk/2021/08/18/ucd-professions/",
    "title": "How we brought our user-centred design professions closer together",
    "authors": [
        "Jen Staves, Head of Content Design"
    ],
    "categories": [
        "Content design",
        "User-centred design"
    ],
    "pub_date": "2021-08-18T10:05:31+01:00",
    "content": [
        {
            "text": "Sometimes we can take it for granted that professionals in the same job family understand what the others do."
        },
        {
            "text": "That can lead to issues with stereotyping professions. For example, I can safely say that:"
        },
        {
            "text": "But when we’re busy, we fall back on those assumptions."
        },
        {
            "text": "It can also lead to a sense of irritation, if you feel that another profession is ‘taking away’ what you do. This isn’t healthy practice, and slows down great user-centred service delivery."
        },
        {
            "text": "Those were just a couple of the reasons why the user-centred design (UCD) professions were keen to create a job family community and come together."
        },
        {
            "heading": 2,
            "text": "Designing with people in our communities of practice"
        },
        {
            "text": "Our burgeoning user-centred design community kicked off in December 2020. At our first meet-up, we welcomed Ben Holliday, who was one of the first heads of user-centred design in central government. Ben talked to us about the importance of user-centred design at our first meeting and since then, we’ve made them quarterly."
        },
        {
            "text": "At our next meeting, we worked with our Communities of Practice manager, Alex Rippon, to corral communities together and help us to achieve more than we could on our own. My fellow Heads of Profession, Sophie Boyd (user research), Jaskiran Kang (service and interaction design) and I worked with Alex to plan it."
        },
        {
            "text": "We recruited a representative from each community and asked them as a UCD team to design an activity that would help us learn more about each other's professions. What they came back with was seriously impressive."
        },
        {
            "text": "They used the evidence we had, established the user needs, designed a prototype, tested it, and iterated it before the day. The result was an activity that helped us discover the traits we share, areas where we can support each other and how to work well together across our different professions."
        },
        {
            "text": "We had about 100 people attend the day, and 73 people took part in the activity. It was a mix of:"
        },
        {
            "text": "28 user researchers\n8 service designers\n23 content designers\n9 interaction designers\n3 policy designers\n1 strategic communications specialist\n1 research operations specialist"
        },
        {
            "text": "We created 10 groups and asked them to consider and discuss the strengths, weaknesses, opportunities and risks within their own professions. And we also wanted them to highlight any overlaps."
        },
        {
            "text": "Now, it would have been easy to just leave it there. It was a great activity, we met a lot of new people, and learned something new. But there was a lot of rich data sitting in those boards. I often feel worried about how inaccessible some of our work is in these interactive boards in the long term."
        },
        {
            "text": "So we extracted the data into a spreadsheet, capturing where there was overlap between professions for any of the strengths, weaknesses, opportunities and risks."
        },
        {
            "text": "Then I did some light-touch analysis, which we shared at our third user-centred design meet-up."
        },
        {
            "heading": 2,
            "text": "Common strengths, weaknesses, risks and opportunities"
        },
        {
            "text": "All 4 UCD professions reported these strengths:"
        },
        {
            "text": "All 4 UCD professions reported challenging policy as a weakness"
        },
        {
            "text": "There were no opportunities or risks that all 4 UCD professions identified. But 3 of 4 agreed these as opportunities:"
        },
        {
            "text": "Three of 4 professions agreed these as risks:"
        },
        {
            "heading": 2,
            "text": "Generating deeper insights we can use"
        },
        {
            "text": "From that analysis, I had 4 insights (though I reckon we could pull out even more if we went deeper into the data)."
        },
        {
            "text": "The fourth point was the perfect segway into our third meet-up, which focused on policy design. And on that day we generated so much brilliant insight into how to work better with policy, thanks to Andrew Knight and Matt Nicol."
        },
        {
            "text": "We’re not going to rest on that progress - we’re really keen to tackle all of these points and more. Our learning is already affecting our work."
        },
        {
            "text": "This month, we kick-off our cross-discipline accessibility community, and we’re already planning for our fourth UCD meet-up in September. This will also focus on accessibility and inclusive design so that it’s no longer a mixed picture."
        }
    ]
}