{
    "url": "https://movingon.blog.gov.uk/2021/08/18/using-the-find-an-atf-service/",
    "title": "Using the 'Find an ATF' service",
    "authors": [
        "Clare Williams"
    ],
    "categories": [
        "Features",
        "Vehicle testing"
    ],
    "pub_date": "2021-08-18T11:27:03+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Last year we developed the ‘Find an ATF’ service. This allows Authorised Testing Facilities (ATFs) to share information about short-term test availability and helps operators to find sites that have tests available."
        },
        {
            "text": "The improvements were introduced after we restarted testing in July 2020. We wanted to support operators and ATFs as initial MOT exemptions started to come to an end. So we worked with ATFs and vehicle operators to improve the ‘Find an ATF’ service."
        },
        {
            "text": "As we enter the busy autumn period, we are reminding ATFs to keep their booking availability up to date on the service. This will help ATFs attract business and help operators who need appointments."
        },
        {
            "text": "There are just over 550 ATFs in Great Britain and the ‘Find an ATF’ page helps ATFs to promote their service."
        },
        {
            "text": "It’s interactive and shows which sites have provided their availability. Operators can also click on the name of the ATF to access to their website directly, where this link is provided."
        },
        {
            "heading": 2,
            "text": "Helping ATFs to build business"
        },
        {
            "text": "A recent survey about the new service brought positive responses. A number of ATFs reported that they had got new business from using the service."
        },
        {
            "text": "Tom Pincott at ETM Group in Bristol describes how the service is driving business and making better use of their ATF lane:"
        },
        {
            "text": " “We just stick all the data in and it basically does everything for us. We seem to get new business because all the information is there.”"
        },
        {
            "heading": 2,
            "text": "Helping operators to find an ATF with tests available "
        },
        {
            "text": "The service is really straightforward to use."
        },
        {
            "text": " All customers need to do is enter their postcode which will find the nearest ATFs to their location and show whether a site has availability. It’s now a lot easier for a customer to find sites with appointments before they call to book a test."
        },
        {
            "text": "It offers operators a wider choice of ATFs because every site within their postcode area will be listed and whether they have test availability. This helps operators to find alternative sites more quickly than they may have previously been able to. For some sites, there will be no availability information because we have not received any details from the ATF."
        },
        {
            "text": "Ian Evans, Owner of Mile Trade Centre in Lydney, Gloucestershire and Tom Pincott of ETM group, Bristol, share their experience of using the service."
        },
        {
            "heading": 2,
            "text": "How availability is updated"
        },
        {
            "text": "ATFs receive an email every Friday asking for their availability."
        },
        {
            "text": "When they reply to this email, their details on the ‘Find an ATF’ service will be updated immediately when they use the ‘update’ link."
        },
        {
            "text": "ATFs can update availability at any time by using the email they receive on the Friday. Their amended details will be updated by the next day."
        },
        {
            "heading": 2,
            "text": "Check the ATF facility can test your vehicles "
        },
        {
            "text": " When booking an ATF site, check:"
        },
        {
            "text": "The web page shows the ATF classification and what it is approved to test."
        },
        {
            "heading": 2,
            "text": "If you are having problems finding a test"
        },
        {
            "text": "If you’ve contacted all the ATFs within a reasonable distance and have not been able to book a test with them, you can report this to us using the link at the bottom of the ‘Find an ATF’ page."
        },
        {
            "text": "We will ask you to explain your circumstances and when you need a test for. We particularly want to help operators who are unable to get a test during the months we are expecting high demand."
        },
        {
            "text": "We are encouraging operators to use the MOT expiry checker on GOV.UK to check the vehicle expiry in advance of the high demand this autumn."
        },
        {
            "text": "We’re keen to hear more from operators and ATFs about the service, so please share your views in the comments section below."
        }
    ]
}