{
    "url": "https://environmentagency.blog.gov.uk/2021/08/18/wilder-for-water-a-new-forest-project-to-champion-cleaner-water/",
    "title": "Wilder for Water – a New Forest project to champion cleaner water",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Community"
    ],
    "pub_date": "2021-08-18T12:46:21+00:00",
    "content": [
        {
            "text": "The New Forest is one of the most visited National Parks in England.  With over 6000 camping pitch spaces per day, it is certainly a popular staycation offering an opportunity not only for people to reconnect with their families and friends but also to have a ‘close up’ experience with the landscape they choose to ‘pitch up’ in.  Each year thousands of holiday makers choose to camp in the New Forest, giving the local economy a boost and providing some well-deserved down time from the busy lives people lead. However, are the visitors aware of the special nature of the New Forest’s wetlands, or possibly inadvertently damaging the very thing that attracts them here in the first place?"
        },
        {
            "text": "The New Forest is the second smallest National Park with the highest proportion of conservation designated land than any other in England.  This wetland landscape from source to sea is ancient, fragile, with areas boasting pristine streams, ponds and mires bursting with rare species, making it one of the best and most Important Freshwater Areas and coastal landscapes in the UK.  These habitats and species are dependent on the ancient practice of traditional grazing and clean water free from pollution."
        },
        {
            "text": "However, there are signs that these habitats are under increasing pressure from visitors.  Through discussions with landowners, partner organisations and local businesses coupled with regular catchment walkovers (a type of freshwater survey), over the years, a pattern has begun to emerge:"
        },
        {
            "text": "This year, and over the coming years, Freshwater Habitats Trust are delivering a project – Wilder for Water – through the Catchment Partnership, seeking opportunities to raise awareness amongst visitors and businesses and promote clean water camping and recreation throughout the National Park. The project, funded by the Environment Agency, aims to:"
        },
        {
            "text": "We have an ambition to go beyond the minimum requirements in the management of waste water here in the New Forest, and we aspire to develop an educational and voluntary ‘clean water standard’ achieving best practice ensuring camping and recreation seeks to reduce, reuse and recycle, helping to maintain the high quality landscape into the future."
        },
        {
            "text": "Our Water Code sets out how visitors can play a major role in protecting the New Forest wetland landscape."
        },
        {
            "text": "You can also make a difference by becoming a #WaterWarrior this summer and take some small steps to protect water quality:"
        }
    ]
}