{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/11/coverage-of-the-english-devolution-community-empowerment-bill/",
    "title": "Coverage of the English Devolution & Community Empowerment Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Devolution",
        "Local government"
    ],
    "pub_date": "2025-07-11T10:53:54+01:00",
    "content": [
        {
            "text": "Following the introduction of the English Devolution and Community Empowerment Bill in Parliament, there has been ongoing positive coverage across national and regional media."
        },
        {
            "text": "LBC ran a comment piece from the Deputy Prime Minister, where she outlined how the Bill will drive the biggest transfer of power out of Whitehall to our regions in a generation and make devolution the default setting."
        },
        {
            "text": "The Independent highlighted the Bill will enable protections for local businesses and includes measures to enable collaboration across areas such as transport. There is similar coverage in the Evening Standard."
        },
        {
            "text": "The Financial Times and I News reported on a measure in the Bill that will allow companies renting premises to negotiate cheaper deals with landlords for the first time, helping ensure our high streets can flourish again. Craig Beaumont, Executive Director at the Federation of Small Businesses, told the FT this will bring “relief for small businesses”."
        },
        {
            "text": "There is also coverage across regional outlets including the Yorkshire Post, Express and Star, Manchester Evening News and regional BBC outlining what changes mean for local areas."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said: "
        },
        {
            "text": "Minister of State for Local Government and English Devolution, Jim McMahon OBE MP said:  "
        },
        {
            "text": "More details of the announcement are available on Gov.uk."
        }
    ]
}