{
    "url": "https://earlyyears.blog.gov.uk/2025/07/11/nannies-what-you-need-to-know/",
    "title": "Nannies: what you need to know",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Nannies",
        "Registration"
    ],
    "pub_date": "2025-07-11T11:45:08+01:00",
    "content": [
        {
            "text": "If you’re a nanny, you can look after children from any number of families, but you can only care for the children of 2 families at any one time. This is a requirement set by the Department for Education (DfE)."
        },
        {
            "text": "The DfE has recently asked us to clarify how this works, so in this blog I’ll explain what it means in practice and what you need to do to make sure you’re properly registered."
        },
        {
            "text": "We’ve worked with the DfE to set out some examples of the childcare you can provide as an unregistered or registered nanny."
        },
        {
            "heading": 2,
            "text": "What is a nanny?"
        },
        {
            "text": "The law, set by the DfE, defines a nanny as a person providing childcare for a child or children from up to 2 families, and that childcare must be carried out wholly or mainly in either of the parents’ homes."
        },
        {
            "text": "The law says that this type of childcare taking place in a child’s own home is exempt from registering with Ofsted. This means nannies have a choice whether to register voluntarily on the Childcare Register."
        },
        {
            "heading": 2,
            "text": "Caring for children from multiple families"
        },
        {
            "text": "We know that the way nannies work has become more agile and flexible in recent years. Some nannies provide childcare for several sets of parents on different days. But it’s important that you continue to work in line with the requirements set by the DfE."
        },
        {
            "text": "Nannying is classed as ‘exempt childcare’. This means if you’re working as a nanny, you don’t need to register. However, you must make sure you continue to work in line with the legal exemptions."
        },
        {
            "text": "As explained above, although you can work with as many families as you like, you must only care for children from 2 families at any one time. For example, you can care for 2 children who are not related on Monday, and then 2 different unrelated children on Tuesday. You could also care for different children in the morning and the afternoon, but they still must be from only 2 families and in one of their homes."
        },
        {
            "text": "If you want to care for children from more than 2 different families at once, you can’t do this as a nanny and must legally register as a childminder (either with us or with a childminding agency). If you start doing it without registering as a childminder, you’re running unregistered childcare. This is an offence."
        },
        {
            "heading": 2,
            "text": "Choosing to register as a nanny"
        },
        {
            "text": "If you’re a nanny, you don’t have to register with us, but you may choose to."
        },
        {
            "text": "The Childcare Register has 2 parts:"
        },
        {
            "text": "Nannies can only register on the voluntary part. We inspect and regulate registered nannies to make sure that childcare is safe and suitable for children. We inspect 10% of all providers on the Childcare Register each year. You can read our guidance about Childcare Register compliance inspections to find out more."
        },
        {
            "text": "Our most recent official statistics from March 2025 say that 7,362 nannies have chosen to register. Many do this so that parents who use them are able to claim tax-free childcare entitlements. The Childcare Choices website explains everything about this."
        },
        {
            "text": "If you choose to register, you have to meet all the requirements of your registration at all times. This includes having appropriate insurance and relevant first aid training, even when you’re not caring for children."
        },
        {
            "heading": 2,
            "text": "Letting Ofsted know where you’re working"
        },
        {
            "text": "If you’re a nanny registered with Ofsted, you’re required by law to keep your contact information and care arrangements up to date, including the addresses of all the places where you provide childcare. You can email us at any time to update us."
        },
        {
            "text": "We need to know this information so that we can contact you to let you know about an inspection, or to discuss the details of your registration."
        },
        {
            "heading": 2,
            "text": "Existing childminders can also work as nannies"
        },
        {
            "text": "If you’re already registered as a childminder with Ofsted, you can also operate as a nanny using your current registration."
        },
        {
            "text": "All you need to do is contact us to let us know that you want to start providing this type of care. We’ll then send you an updated certificate. You can email us from the email address we have on record."
        },
        {
            "text": "As of March 2025, nearly 2,000 registered childminders had done this."
        },
        {
            "heading": 2,
            "text": "More information"
        },
        {
            "text": "Did you know that, as a nanny, you:"
        },
        {
            "text": "We have a collection of guidance pages for Ofsted-registered nannies. We’ve done this so that everything is easier to understand and all available in one place. You can also read all of the legal requirements for registered nannies – remember, once registered, you need to meet these requirements at all times."
        }
    ]
}