{
    "url": "https://mhclgdigital.blog.gov.uk/2025/07/11/rapid-policy-insights-how-user-centred-approaches-support-improved-policy-design-in-mhclg/",
    "title": "Rapid Policy Insights: How user-centred approaches support improved policy design in MHCLG ",
    "authors": [
        "Greg Winfield, Head of User-Centred Design"
    ],
    "categories": [
        "Policy design"
    ],
    "pub_date": "2025-07-11T09:14:30+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Embedding digital into policy "
        },
        {
            "text": "In MHCLG, a central element of our digital strategy is ‘embedding digital in policy’. For clarity, when we say 'digital', this includes the ethos, methods, skills and mindset that is typical in digital working. User-centred design you might say.  "
        },
        {
            "text": "Towards the end of 2024 we established a new team – the Rapid Policy Insight (RPI) team. This team works with policy teams to embed user-centred design (UCD) practices in the way work is done. The logic is that the more UCD activity there is in policy, the better our policy work in the department meets the needs of users. "
        },
        {
            "heading": 2,
            "text": "Compressed discovery – expanded influence "
        },
        {
            "text": "RPI is a 4-person unit – a product manager, a service designer and 2 user researchers. Each person brings profession-specific expertise but is comfortable overlapping and supporting each other to help speed the work along – facilitating workshops, analysing research, liaising with the policy team. "
        },
        {
            "text": "RPI spends just 7 weeks with each team, establishing the problem, the assumptions, the shape of the system, and the journeys and challenges that the users go through. By quickly exploring the riskiest assumptions that drive the policy activity, the RPI team is able to leave the policy team with clear practical advice on how to refine existing ideas, refocus on more pressing ones and even stop those initiatives that appear to not be aligned with the most pressing needs.  "
        },
        {
            "heading": 2,
            "text": "Two tracks to positive change "
        },
        {
            "text": "The logic of the rapid approach is to be able to partner with as many policy teams as possible. The more teams we work with, the more the approach grows, the more positive outcomes and the greater the efficiency gains as well. The theory is this: "
        },
        {
            "heading": 3,
            "text": "Provide practical value "
        },
        {
            "text": "Delivering the insights and recommendations from our 7-week project gives immediate value of UCD to the policy team. It captures the imagination but also shapes the policy work in a way that will shape decision making on that topic in the short term. "
        },
        {
            "heading": 3,
            "text": "Change behaviours "
        },
        {
            "text": "Our collaborative, open way of working during the project makes UCD and agile methods more visible, giving the policy team the understanding and confidence to deploy them on future challenges. This supports more effective decision making in the long term. "
        },
        {
            "heading": 2,
            "text": "We’ve changed a lot in a short time "
        },
        {
            "text": "You can read that subtitle in 2 ways: "
        },
        {
            "text": "We build in (albeit small) reflection periods between our projects and look to reiterate our model before we start again.  "
        },
        {
            "text": "We have pushed ourselves to test the 7-week model overall, plus reflect in detail on each workshop and interaction in a way that can hone a robust and replicable playbook. We’ve done that based on the feedback from the teams we’ve worked with, asking ourselves – does our service work for our users?  "
        },
        {
            "text": "We’ve learned we need to embed ourselves more closely with policy teams, to understand the constantly changing landscape they work in and be responsive to that.  "
        },
        {
            "text": "We’ve learned to do less – create a tighter scope and pick a key assumption to focus our work around. Deliberately not try to explore the whole problem. There isn’t time. We’ve clarified our role in terms of being the starter for good user-centred working, rather than the whole service.  "
        },
        {
            "text": "We’ve also learned that we’ve created value in all of our projects. Often lots of value. "
        },
        {
            "text": "We have: "
        },
        {
            "text": "The appetite for our work is strong and our list of potential projects is growing.  "
        },
        {
            "heading": 2,
            "text": "In it for the long haul "
        },
        {
            "text": "The challenge next is – keeping up the momentum. Can we really say that our second ‘track’ of change – embedding user-centred behaviours for the long term – works in the long term? So far it looks really positive. We have teams returning to us to use templates and methods that we deployed with them. We have referrals to other policy teams where our previous teams can see the opportunity for our work. This suggests the effort and the focus that policy teams put in while working with us doesn’t just drop away as soon as the final show and tell finishes.  "
        },
        {
            "text": "Our next challenge is: what more can we do to really push forward that ‘digital-ness’ in policy. "
        },
        {
            "text": "How can the wider support offer from digital continue with teams on that journey – acknowledging that while policy teams learn lots while with us, they are not experts in UCD at the end of 7 weeks (in the same way that we are not experts on their policy then either). What can we do to support them in other ways through the often (always?) complex and convoluted policy journey. "
        },
        {
            "text": "We’ve created this model and are seeing it working. We want to continually examine it and think about where it should go next given our overall aim. We’re aware others have similar approaches and have tried similar things.  "
        },
        {
            "text": "So, if you have seen parallels in your work, want to know more, or just want to comment on what you’ve read, please do get in touch by email: policyinsight@communities.gov.uk."
        }
    ]
}