{
    "url": "https://space.blog.gov.uk/2025/07/11/uk-space-safety-centre-marks-one-year-milestone/",
    "title": "UK space safety centre marks one-year milestone  ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities"
    ],
    "pub_date": "2025-07-11T12:16:41+01:00",
    "content": [
        {
            "text": "Millions across the UK are benefiting from the protection of vital space infrastructure provided by the National Space Operations Centre (NSpOC) - which celebrates its first anniversary. "
        },
        {
            "text": "Space is becoming more a busier and more challenging environment. As of June 2025, there were over 14,000 satellites in orbit, with over 800 operated by UK organisations The amount of satellites and other objects in space is rising rapidly, with more than 100 global launches recorded so far this year each with an average of 14 satellites on board.  "
        },
        {
            "text": "Led by the UK Space Agency, UK Space Command, and in partnership with the Met Office, NSpOC has become the backbone of the UK’s space safety and security efforts, protecting UK interests in space and on Earth.  "
        },
        {
            "text": "The risks NSpOC protects the UK from are increasingly varied. Some of these are showcased below.  "
        },
        {
            "heading": 2,
            "text": "Uncontrolled Re-entry Early Warnings"
        },
        {
            "text": "NSpOC monitors the uncontrolled re-entry of space objects, issuing alerts to the government and response agencies in the event an object might pose a risk to the UK or UK interests.  "
        },
        {
            "text": "In its first year, the centre monitored the uncontrolled re-entry of over 870 objects from space, including rocket bodies, defunct satellites and debris, resulting in an average of five alerts per month to government response teams. One notable incident involved Starship Flight 7, which failed in January 2025 and scattered debris over the UK Overseas Territory of the Turks and Caicos Islands, where NSpOC played a leading role in UK efforts to support local authorities. "
        },
        {
            "heading": 2,
            "text": "Satellite Collision Avoidance and Fragmentation Alerting "
        },
        {
            "text": "NSpOC currently provides collision warning services to over 90% of all UK-licensed satellites including 100% of UK satellites in the most congested Low Earth Orbit (LEO). "
        },
        {
            "text": "In its first year NSpOC issued just under 30,000 collision alerts to UK-licensed satellite operators, helping prevent damage to critical assets that support everyday services such as telecommunications, navigation, and weather forecasting.  "
        },
        {
            "text": "NSpOC also monitors satellite fragmentations in space, caused by collisions with debris, exploding fuel tanks and potentially even malicious acts. NSpOC models and tracks new debris caused from the breakup of spacecraft in orbit, providing UK operators essential information on how to protect their assets.  "
        },
        {
            "text": "The centre plays a vital role in protecting infrastructure that underpins an estimated £360 billion - or 17% -of the UK’s non-financial business GDP. A disruption to global satellite systems could cost the UK economy up to £5.2 billion over just five days. "
        },
        {
            "heading": 2,
            "text": "Planetary Defence "
        },
        {
            "text": "NSpOC leads the UK’s monitoring and alert service for asteroids that pose a risk to Earth.  "
        },
        {
            "text": "Shortly after joining the International Asteroid Warning Network (IAWN) in early 2025, giving the UK access to a global network of optical sensors which could be deployed to monitor and provide additional tracking data on asteroids of concern, NSpOC led the UK response to asteroid 2024 YR4, which briefly posed a 3.1% Earth impact risk. "
        },
        {
            "text": "NSpOC leads the UK delegation to the International Asteroid Warning Network (IAWN) and Space Mission Planning Advisory Group (SMPAG). NSpOC continues to monitor around 500 asteroids each month.  "
        },
        {
            "heading": 2,
            "text": "Space Weather "
        },
        {
            "text": "The Met Office Space Weather Operations Centre (MOSWOC) provides NSpOC with forecasts, timely warnings and alerts regarding space weather events that can disrupt satellite communications, impact on capabilities used to locate and track satellites and even damage satellite equipment, issuing more than 400 alerts over the last year. During the largest geomagnetic storm in two decades in May 2024, nearly 100 alerts were sent, helped satellite operators to operate safely throughout an event where nearly 5,000 satellites needed to manoeuvre to maintain station on-orbit. "
        },
        {
            "text": "Over the coming years NSpOC will bolster its space surveillance, tracking and analysis capabilities to meet future challenges and provide essential support to exciting and critical UK missions into space. "
        }
    ]
}