{
    "url": "https://defraenvironment.blog.gov.uk/2024/04/11/improving-environmental-outcomes-in-protected-landscapes/",
    "title": "Improving environmental outcomes in Protected Landscapes",
    "authors": [
        "Catherine Brabner-Evans"
    ],
    "categories": [
        "Community",
        "Environmental Improvement Plan",
        "Nature",
        "Outcomes Framework",
        "Peat",
        "Protected Landscapes"
    ],
    "pub_date": "2024-04-11T09:34:57+01:00",
    "content": [
        {
            "text": "I’m Catherine and I work in the Environmental Outcomes in Protected Landscapes team at Defra. We work with 44 National Parks and National Landscapes in England to improve these unique and beautiful places for nature, and for future generations to enjoy. "
        },
        {
            "text": "Why Protected Landscapes are so important "
        },
        {
            "text": "I expect that many of you reading this will have visited a Protected Landscape, even if you didn’t know it at the time. They truly are iconic places – home to our highest mountain, largest lake and (very nearly) the source of our longest river. "
        },
        {
            "text": "They are home to some of our most important habitats and wildlife. Protected landscapes contain around half of all England’s priority habitats including 46% of peat, 34% of broadleaf woodland, and 88% of heather and acid grassland habitats. They are also home to around half of our most precious sites for nature, land designated as Sites of Special Scientific Interest. "
        },
        {
            "text": "They are connected across the country and beyond by our network of National Trails, which run through many of our Protected Landscapes, helping around 270 million visitors a year get closer to nature and the outdoors.  "
        },
        {
            "text": "Not only do these sites offer access to nature, but they are also steeped in history as well. From dinosaurs along the Jurassic coast to Roman forts, Hadrian’s Wall, and imposing medieval castles. "
        },
        {
            "text": "The places within our National Parks and National Landscapes were once home to the likes of William Wordsworth, Beatrix Potter, Jane Austen and John Constable. And these special places inspired many of their works. "
        },
        {
            "text": "The natural, historical and cultural significance of these places is why they were designated as Protected Landscapes.  "
        },
        {
            "text": "And, it is even more important that we conserve and enhance these areas now we are in a climate and biodiversity emergency. "
        },
        {
            "text": "Each of these unique and beautiful landscapes has the potential to be richer in wildlife and store more carbon in its peat and trees. They can provide a strong sense of place and cultural heritage, and introduce a more diverse range people to the benefits of being immersed in nature.  "
        },
        {
            "text": "Improving Environmental Outcomes "
        },
        {
            "text": "We know that National Parks and National Landscapes can make huge contributions to our Environmental Improvement Plan goals and our commitment to protect 30% of land for nature by 2030. "
        },
        {
            "text": "We are working hard with the Protected Landscapes bodies to strengthen the contribution of these places. "
        },
        {
            "text": "For example, following our response to the Landscapes Review, we established the Protected Landscape Partnership. The partnership has a workstream dedicated to nature recovery. "
        },
        {
            "text": "We also extended the Farming in Protected Landscapes programme until March 2025, doubling its funding to £100 million in recognition of its success. This will help more farmers working in Protected Landscapes to deliver projects around the four themes of climate, nature, people and place. In the first two years it has engaged around 5,000 farmers and land managers who have planted more than 100 miles of hedgerow and 100,000 trees, created or restored 262 ponds, undertaken positive management on 27,000 hectares of Sites of Scientific Interest, created or better managed 90 miles of footpaths and approved around 200 projects delivering educational access. "
        },
        {
            "text": "And in January this year, we published the Protected Landscapes Targets and Outcomes Framework. The framework sets out ambitious targets. If achieved, they will help reverse the decline in nature, mitigate and adapt to the worst impacts of climate change and improve access to nature for all. "
        },
        {
            "text": "Working Collaboratively "
        },
        {
            "text": "Our Protected Landscapes bodies have a strong and trusted relationship with their local farmers, landowners and other partners. "
        },
        {
            "text": "They have expert knowledge of their communities, how the land is used, the pressures on it and the priority habitats, heritage assets and species that thrive within it. "
        },
        {
            "text": "Protected Landscapes bodies work collaboratively through their management plans to set out the special qualities of their areas, and to provide a clear vision for how the landscape should be managed to achieve national targets and priorities at a local level. "
        },
        {
            "text": "Through their management planning process, they bring together a wide range of partners, from farmers to charities to local councils, to help deliver those targets. "
        },
        {
            "text": "Now we have set clear targets to be achieved in Protected Landscapes, we will be able to track our progress towards them annually. This will allow us to assess and demonstrate whether we are on track, and to demonstrate the contribution that Protected Landscapes are making to halting and reversing the decline in nature. "
        },
        {
            "text": "New legislation "
        },
        {
            "text": "Alongside these actions, we have reflected the importance of Protected Landscapes in law. "
        },
        {
            "text": "There are new powers set out in the Levelling Up and Regeneration Act 2023. These ensure that ‘relevant authorities’ who might be undertaking activities or making decisions affecting land within a Protected Landscape must now ‘seek to further’ the purposes of that landscape. "
        },
        {
            "text": "This places a duty on a wide range of organisations such as government departments and their agencies, local authorities and road, rail, telecoms and water companies. Now, they must not just avoid damaging these special areas but must actively try to improve them. "
        },
        {
            "text": "So next time you are out and about – be it by foot, train or road – keep an eye out for a sign that you are in a National Park or National Landscape. "
        },
        {
            "text": "Take a moment to contemplate the landscape around you, how it came to be, and how it is working to achieve our national targets. "
        },
        {
            "text": "To receive an email notification when we publish new posts like this one, please subscribe to the Environment blog.   "
        }
    ]
}