{
    "url": "https://insidehmcts.blog.gov.uk/2024/04/11/preparing-for-the-requirement-to-mediate-in-small-claims-what-you-need-to-know/",
    "title": "Preparing for the requirement to mediate in small claims: What you need to know",
    "authors": [
        "Rosemary Rand",
        "Chris Kane"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform"
    ],
    "pub_date": "2024-04-11T12:00:24+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Dispute resolution, such as mediation, can offer a swifter and less stressful way to resolve legal problems.  We offer a free small claims mediation service, saving parties the time and cost of going to court for a judge to resolve their case.  "
        },
        {
            "text": "Mediation is soon to be an integral part of the small claims process, meaning parties will need to attend an appointment to try and resolve their case ahead of having a court hearing. "
        },
        {
            "text": "Here, Rosemary Rand, Deputy Director and Service Owner for Civil, and Chris Kane, Head of the Small Claims Mediation Service, explain why the service is changing and what the benefits are. "
        },
        {
            "text": "Disputes can arise in many areas of daily life, from contesting a parking ticket to disagreeing over payment for goods and services. This can lead to people making a claim in the civil courts to seek money they believe they’re owed by another person or business. "
        },
        {
            "text": "Since 2007, parties making a claim for less than £10,000 have been able to choose to take part in a mediation session. This free telephone session is conducted by a trained mediator, who speaks to both parties separately and works to find a solution that everyone can agree on. Under this approach, mediation has led to around half of these types of small claims case being settled without the need for a court hearing. "
        },
        {
            "text": "Mediation is often a quicker, cheaper way for parties to resolve their dispute without the need to pay a hearing fee. We currently aim for appointments to take place within 28 days of a case being referred to our mediation service, whereas in some instances, it can take many weeks for a case to be heard in a County Court.  "
        },
        {
            "text": "It can also be a less stressful alternative for those who would feel anxious about attending a court hearing. "
        },
        {
            "heading": 2,
            "text": "Changes to be ready for"
        },
        {
            "text": "For court cases filed from 22 May 2024, attending a mediation session will become an integrated, required step in resolving a money dispute under £10,000 for those who have made a new civil court claim on paper or through our traditional online systems. "
        },
        {
            "text": "This means that you will be required to take part in mediation. Mediation will remain free-of-charge, and there is no pressure to settle the case through mediation and if an agreement cannot be reached - the case will go before a judge. We will offer support to vulnerable parties, or those who need assistance during their appointment.  "
        },
        {
            "text": "The new policy is part of the government’s plan to increase the use of dispute resolution across the county courts, family courts and tribunals, to resolve claims quicker and more consensually. "
        },
        {
            "text": "We have recruited and trained 39 new mediators who are ready to meet the increase in appointments. The team is already working to identify cases which may benefit from mediation and offering appointments to all parties. "
        },
        {
            "heading": 2,
            "text": "The next steps "
        },
        {
            "text": "Later this year, the new policy will be extended to cover all small money claims under £10,000, meaning that parties involved in claims submitted through our Online Civil Money Claims (OCMC) service – delivered as part of the HMCTS Reform Programme – will also need to attend a mediation appointment. "
        },
        {
            "text": "We are introducing mediation as a necessary step in two phases so that we can make sure we get the changes to OCMC right for the people using the service. "
        },
        {
            "text": "Introducing mediation as a requirement for all cases submitted on paper and on our legacy systems from May will allow us to bring the benefits of mediation to as many people as possible as quickly as possible. "
        },
        {
            "heading": 2,
            "text": "Further information "
        },
        {
            "text": "Our Small Claims Mediation video explains what you can expect from the service and gives more information about appointments. "
        },
        {
            "text": "More widely, we’re transforming services across all jurisdictions under the Reform Programme which we are in the process of concluding.  You can read more about the latest progress in the civil jurisdiction in our recent blog piece. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Paratoi ar gyfer y gofyniad i gyfryngu mewn hawliadau bychain: Beth sydd angen i chi ei wybod"
        },
        {
            "text": "Mae dulliau o ddatrys anghydfodau, fel cyfryngu, yn cynnig ffordd gyflymach a llai straenus i ddatrys problemau cyfreithiol. Rydym yn cynnig gwasanaeth cyfryngu hawliadau bychain am ddim, gan arbed amser a’r gost o orfod mynd i'r llys i farnwr ddatrys eu hachos."
        },
        {
            "text": "Cyn bo hir, bydd cyfryngu yn rhan annatod o'r broses hawliadau bychain, sy'n golygu y bydd angen i bartïon fynychu apwyntiad i geisio datrys eu hachos cyn cael gwrandawiad llys."
        },
        {
            "text": "Yma, mae Rosemary Rand, Dirprwy Gyfarwyddwr a Pherchennog Gwasanaeth Sifil, a Chris Kane, Pennaeth y Gwasanaeth Cyfryngu Hawliadau Bychain, yn esbonio pam fod y gwasanaeth yn newid a beth yw'r manteision"
        },
        {
            "text": "Gall anghydfodau godi mewn sawl ffordd yn ystod bywyd bob dydd, o herio tocyn parcio i anghytuno ynghylch talu am nwyddau a gwasanaethau. Gall hyn arwain at bobl yn gwneud hawliad yn y llysoedd sifil i geisio am arian y maent yn credu bod unigolyn neu fusnes arall yn ddyledus iddynt."
        },
        {
            "text": "Ers 2007, mae partïon sy'n gwneud cais am lai na £10,000 wedi gallu dewis cymryd rhan mewn sesiwn gyfryngu. Cynhelir y sesiwn dros y ffôn am ddim hon gan gyfryngwr hyfforddedig, sy'n siarad â'r ddau barti ar wahân ac yn gweithio i ddod o hyd i ateb y gall pawb gytuno arno. O dan y dull hwn, mae cyfryngu wedi arwain at setlo tua hanner yr achosion bychain hyn heb fod angen gwrandawiad llys. Mae cyfryngu yn aml yn ffordd gyflymach a rhatach i bartïon ddatrys eu hanghydfod heb yr angen i dalu ffi gwrandawiad. Ar hyn o bryd, rydym yn anelu at gynnal apwyntiadau o fewn 28 diwrnod i achos gael ei gyfeirio at ein gwasanaeth cyfryngu, ond mewn rhai achosion, gall gymryd wythnosau lawer i achos gael ei wrando mewn Llys Sirol."
        },
        {
            "text": "Gall hefyd fod yn ddewis arall sy’n peri llai o straen i'r rhai a fyddai'n teimlo'n bryderus am fynychu gwrandawiad llys."
        },
        {
            "heading": 2,
            "text": "Newidiadau i fod yn barod ar eu cyfer"
        },
        {
            "text": "Ar gyfer achosion llys a ffeiliwyd o 22 Mai 2024 ymlaen, bydd mynychu sesiwn gyfryngu yn gam integredig, gofynnol wrth ddatrys anghydfod ariannol o dan £10,000 i'r rhai sydd wedi gwneud hawliad newydd yn y llys sifil ar bapur neu drwy ein systemau ar-lein traddodiadol."
        },
        {
            "text": "Mae hyn yn golygu y bydd gofyn i chi gymryd rhan mewn cyfryngu. Bydd cyfryngu yn parhau i fod yn rhad ac am ddim, ac nid oes pwysau i setlo'r achos trwy gyfryngu ac os na ellir dod i gytundeb - bydd yr achos yn mynd gerbron barnwr. Byddwn yn cynnig cefnogaeth i bartïon bregus, neu'r rhai sydd angen cymorth yn ystod eu apwyntiad."
        },
        {
            "text": "Mae'r polisi newydd yn rhan o gynllun y llywodraeth i gynyddu'r defnydd o ddatrys anghydfod ar draws y llysoedd sirol, y llysoedd teulu a’r tribiwnlysoedd, i ddatrys hawliadau yn gyflymach ac yn fwy cydsyniol."
        },
        {
            "text": "Rydym wedi recriwtio a hyfforddi 39 o gyfryngwyr newydd sy'n barod i gwrdd â'r cynnydd mewn apwyntiadau. Mae'r tîm eisoes yn gweithio i adnabod achosion a allai elwa o gyfryngu a chynnig apwyntiadau i bob parti."
        },
        {
            "heading": 2,
            "text": "Y camau nesaf"
        },
        {
            "text": "Yn ddiweddarach eleni, bydd y polisi newydd yn cael ei ymestyn i gwmpasu pob hawliad bychain am arian o dan £10,000, sy'n golygu y bydd angen i bartïon sy'n ymwneud â hawliadau a gyflwynir drwy ein gwasanaeth Hawliadau Arian Sifil Ar-lein (OCMC) - a gyflwynir fel rhan o Raglen Ddiwygio GLlTEF - fynychu apwyntiad cyfryngu hefyd."
        },
        {
            "text": "Rydym yn cyflwyno cyfryngu fel cam angenrheidiol mewn dau gam fel y gallwn sicrhau ein bod yn cael y newidiadau i OCMC yn iawn i'r bobl sy'n defnyddio'r gwasanaeth."
        },
        {
            "text": "Bydd cyflwyno cyfryngu fel gofyniad ar gyfer pob achos a gyflwynir ar bapur ac ar ein systemau etifeddiaeth o fis Mai yn ein galluogi i ddod â manteision cyfryngu i gynifer o bobl â phosibl cyn gynted â phosibl."
        },
        {
            "heading": 2,
            "text": "Mwy o wybodaeth"
        },
        {
            "text": "Mae ein fideo am Gyfryngu Hawliadau Bychain yn esbonio'r hyn y gallwch ei ddisgwyl gan y gwasanaeth ac yn rhoi mwy o wybodaeth am apwyntiadau."
        },
        {
            "text": "Yn ehangach, rydym yn trawsnewid gwasanaethau ar draws pob awdurdodaeth o dan y Rhaglen Ddiwygio yr ydym yn y broses o'i chwblhau. Gallwch ddarllen mwy am y cynnydd diweddaraf yn yr awdurdodaeth sifil yn ein blog diweddar."
        }
    ]
}