{
    "url": "https://stratcommand.blog.gov.uk/2024/04/11/rg-leadership-day/",
    "title": "Royal Gibraltar Regiment leadership day",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-11T09:10:56+01:00",
    "content": [
        {
            "text": "Yesterday, Wednesday 10 April 2024, as part of the continued development of the Royal Gibraltar Regiment (RG) soldiers and officers, the RG’s recruiting team ran an impactful and inspiring leadership day in Devil’s Tower Camp."
        },
        {
            "text": "Over 50 soldiers and officers gathered in the Seniors’ Mess to observe presentations and listen to keynote speakers whose topics focused on how to improve communication throughout the RG."
        },
        {
            "text": " "
        },
        {
            "text": "Throughout the leadership day, which was organised by Warrant Officer Class Two Tom Nicholls, Sergeant Liam Conroy and Corporal Arnold Rogers, soldiers took part in group discussions and activities where they learned how effective leaders communicate, what skills can be used to develop communication throughout the RG, the art of listening and non-verbal communication, constructive challenge and the benefits of continuous improvement."
        },
        {
            "text": "An RG spokesperson said: “The aim of the leadership day was to provide a fun and interactive experience for the soldiers rather than asking them to participate in an online course which doesn’t allocate any room for feedback or participation."
        },
        {
            "text": "We hope this leadership day has taught the soldiers valuable lessons about communication and to take personal responsibility for their own success."
        },
        {
            "text": "Together, we want to empower the soldiers to become leaders regardless of their rank within the RG, providing them with skills they can then use in their private lives."
        },
        {
            "text": "Leadership, and the skills needed to be a good leader, are key attributes of the British Army and key features that we require within the Royal Gibraltar Regiment.”"
        }
    ]
}