{
    "url": "https://ruralpayments.blog.gov.uk/2024/04/11/the-rural-payments-agency-podcast-episode-9/",
    "title": "The Rural Payments Agency Podcast: Episode 9",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "External engagement",
        "Grants",
        "RPA podcast"
    ],
    "pub_date": "2024-04-11T17:10:30+01:00",
    "content": [
        {
            "text": "Welcome to the ninth episode of The RPA Podcast."
        },
        {
            "text": "In our latest episode, we discuss the opening of the claim window for existing Countryside Stewardship revenue and Environmental Stewardship agreements with CS processing manager Gregg Bulman. We discuss how farmers must submit an annual declaration or claim form before 15 May 2024 to receive payment for works carried out through the schemes in 2024 and how the existing online claim process for CS has been supplemented with a more straightforward annual declaration option, as well as a reminder about delinked payments."
        },
        {
            "text": "We also take some time to talk to Katie Yon from RPA’s Shows and Events team, a previous guest on the podcast, who tells us about the range of shows and events the team will be visiting this year as well as what visitors to the RPA stand can expect."
        },
        {
            "text": "Earlier this year, the Prime Minister made a speech at the annual NFU conference where he announced the biggest ever package of grants to boost productivity and resilience in the farming sector, including the largest ever grant offer for farmers in the coming financial year. In this episode, we’re joined by Caitlin Smith from RPA’s Grants Service team who shares details about the new round of the Farming Equipment and Technology Fund (FETF)."
        },
        {
            "text": "Marie Hardeman, RPA’s Customer Director, is also a special guest on the podcast and takes the time to talk about what she and her team have achieved and delivered for customers over the past year, as well as how she’s going to make sure that RPA continues to deliver great service and provide what’s really important to those using RPA’s services."
        },
        {
            "text": "You can also read the transcript for this episode here."
        },
        {
            "text": "The RPA Podcast is an opportunity to engage with customers in a new way, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to episode 9 of The RPA Podcast on Apple and Spotify or through Buzzsprout. You can also listen to earlier episodes of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}