{
    "url": "https://ruralpayments.blog.gov.uk/2024/04/11/the-rural-payments-agency-podcast-episode-9-transcript/",
    "title": "The Rural Payments Agency Podcast: Episode 9 Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "External engagement",
        "Grants",
        "RPA podcast"
    ],
    "pub_date": "2024-04-11T17:05:55+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Executive Summary"
        },
        {
            "heading": 4,
            "text": "Item 1:"
        },
        {
            "heading": 4,
            "text": "Item 2: "
        },
        {
            "heading": 4,
            "text": "Item 3:"
        },
        {
            "heading": 4,
            "text": "Item 4:"
        },
        {
            "text": "In our last segment, we are joined by Marie Hardeman, RPA’s Customer Director who is here to talk about all things Customer Service."
        },
        {
            "heading": 3,
            "text": "Transcript"
        },
        {
            "text": "The RPA Podcast – Episode 9: Script (April 2024)"
        },
        {
            "text": "Caroline: Hello and welcome to the ninth episode of The RPA Podcast. I’m Caroline Ling and in today’s programme we discuss the opening of the claim window for existing Countryside Stewardship revenue and Environmental Stewardship agreements with Countryside Stewardship Processing Manager Gregg Bulman. We also have a preview of the shows and events that RPA will be attending with Katie Yon from the events team and Caitlin Smith from the Grants Service team also talks about the new round of the Farming Equipment and Technology Fund. And in a special interview we’re joined by RPA’s Customer Director Marie Hardeman, who talks about her first year with RPA and what is coming up in the customer area over the next few months."
        },
        {
            "text": "****Intro music to fade****"
        },
        {
            "heading": 4,
            "text": "Item 1: Opening of the claim window for existing Countryside Stewardship revenue and Environmental Stewardship agreements and delinked payments. "
        },
        {
            "text": "Caroline: The claim window for existing Countryside Stewardship revenue and Environmental Stewardship agreements opened last month. Today I’m joined by Gregg Bulman a Countryside Stewardship Processing manager to talk more about this. Welcome Gregg."
        },
        {
            "text": "Gregg: Thank you for having me, it’s great to be here."
        },
        {
            "text": "Caroline: So, before we go into what farmers need to do could you tell briefly about what Countryside Stewardship and Environmental Stewardship do?"
        },
        {
            "text": "Gregg: Yes of course. Both Countryside Stewardship and Environmental Stewardship provide financial incentives for farmers, foresters and land managers to support sustainable food production whilst looking after the environment by implementing measures that increase biodiversity, grow habitats, expand woodland areas, improve water quality and enhance natural flood management."
        },
        {
            "text": "Caroline: Thank you, and what do farmers need to do now that the claim window has opened?"
        },
        {
            "text": "Gregg: Farmers must submit an annual declaration or claim form for Countryside Stewardship or Environmental Stewardship before the 15th of May to receive payment for works carried out through the schemes in 2024. If you miss this deadline, you still have until Wednesday the 2nd of September to submit a claim, but a reduction will be applied to the value of your claim – the later you submit it, the greater the reduction, so I would encourage eligible farmers to submit their claims  before the deadline to ensure they’re rewarded for their efforts to produce food sustainably while improving the environment."
        },
        {
            "text": "Caroline: And I believe you’ve simplified the process?"
        },
        {
            "text": "Gregg: Yes, last year we supplemented the existing online claim process for Countryside Stewardship with a more straightforward annual declaration option in cases where no changes are required. This will remain available in the Rural Payments service for 2024, with farmers able to generate and submit an automated revenue claim with a single click without needing to complete each section of the claim form.  There’s a video available on YouTube called How to submit a revenue claim using the Rural Payments portal which is worth watching. "
        },
        {
            "text": "If there are any changes to your claim from last year or your agreement includes rotational options, you’ll need to tell us."
        },
        {
            "text": "Caroline: And is there anything else farmers need to do before submitting their claim?"
        },
        {
            "text": "Gregg: Yes, before submitting your Countryside Stewardship claim, please make sure you’ve updated your land use codes by signing into the Rural Payments service. If you’re unable to access the Rural Payments service, you can email us at ruralpayments@defra.gov.uk."
        },
        {
            "text": "If you’re an ES agreement holder, you’ll receive your claim form by either email or post. You need to complete it and return it to us to submit your claim."
        },
        {
            "text": "Caroline: Thanks xxxxx. Before we finish, I’d also like to touch on delinked payments, because when RPA made the announcement about the CS and ES revenue claims opening, RPA also made a reminder about delinked payments. Can you tell us more about that?"
        },
        {
            "text": "Gregg: Yes that’s right. We want to remind farmers that those who wish to transfer some, or all, of their ‘reference amount’ for delinked payments to another business, must do so by the 10th of May 2024. For example, farmers may wish to do this if their business has split, merged with another business or been given a new Single Business Identifier since they were paid BPS 2020."
        },
        {
            "text": "Caroline: And can you just give us a bit of background about delinked payments?"
        },
        {
            "text": "Gregg: Yes of course. The RPA replaced the Basic Payment Scheme in England with delinked payments which will be paid each year from 2024 to 2027. Advance payments will be made to farmers of around 50% from the 1st of August and the balance of the payment from the 1st of December. There’s no need to apply for delinked payments, but farmers should be aware that the amount you receive will decrease each year as the progressive reductions are applied. It’s calculated based on a ‘reference amount’ which will normally be the average of your BPS payments made for the 2020 to 2022 scheme years. You must have claimed, and been eligible for, BPS payments in England in the 2023 scheme year, except for some inheritance cases."
        },
        {
            "text": "Caroline: Thanks very much Gregg. And where can farmers get more information on what we’ve talked about today?"
        },
        {
            "text": "Gregg: Yes, to get more information on all this on Gov.uk. You can search for ‘How to make a capital or revenue claim for Countryside Stewardship,’ also  ‘How to get paid under an Environmental Stewardship agreement’ and further information about the delinked payments transfer period can be found on the RPA blog via the blog post, ‘Delinked payments guidance: information about transferring reference data.’"
        },
        {
            "text": "Caroline: Gregg, thank you so much for that and for joining us today."
        },
        {
            "text": "Gregg: It’s been a pleasure"
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "heading": 4,
            "text": "Item 2: RPA’s shows and events programme for 2024 "
        },
        {
            "text": "Caroline: So, our next guest today is Katie Yon from RPA’s shows and events team who is going to talk about the range of shows and events the team will be visiting this year and what visitors to the RPA stand can expect. Welcome to the podcast Katie."
        },
        {
            "text": "Katie: Thanks Caroline, it’s great to be here."
        },
        {
            "text": "Caroline: So, you’ve got a packed and exciting show season ahead, can you tell us some more about it?"
        },
        {
            "text": "Katie: Yes, of course. As you say, the RPA’s shows and events team has a very busy 2024 coming up. We want to ensure our external engagement is as successful, if not even more so, than last year’s. And this year we’ll be engaging with even more farmers and rural communities across the country, with a presence at almost 40 agricultural shows and events, including all the main shows and most of the regional ones. We’ll be in the North West and East, the West and East Midlands, Yorkshire and Humberside, the South West, South East and East of England."
        },
        {
            "text": "So, if you’re attending any of the shows over the rest of the year, come and have a conversation with us. We’ll primarily be there to talk to farmers and agents about all current and future land management schemes and we’ll also be specifically promoting the Sustainable Farming Incentive, Farming Investment Fund grants and Countryside Stewardship."
        },
        {
            "text": "Caroline: Thanks Katie, that’s really helpful. You and your team are going to be doing a lot of travelling around this year! And I believe at some shows you’ll also be giving talks?"
        },
        {
            "text": "Katie: Yes, that’s right, we’ll be doing some demo’s on how to apply for some of our funding and talks from our field officers and Grants colleagues. We’ve also delivered presentations at the Farm Update North conference, the Dartmoor Hill Farming Network, Farm Cornwell and Upper Teasdale Support Services."
        },
        {
            "text": "Caroline: And I believe that you’re co-locating at a number of stands?"
        },
        {
            "text": "Katie: Yes, that’s right. We’ll be with colleagues from Defra Farming and Countryside Programme, at around 29 shows. It means that we can chat with customers around the Defra Policies and also how RPA are delivering. We’ll also be joined by relevant experts, such as the RPA’s Grants Service team at the ag machine shows where people will be able to find out about the grants on offer."
        },
        {
            "text": "Caroline: That sounds really great Katie. And why would you encourage people to come and see you at the shows?"
        },
        {
            "text": "Katie: Well, visiting our stand at an event is often the only face-to-face contact people have with RPA, and for us, being able to meet farmers and agents in person provides us with unique feedback which then influences the way we write guidance and design processes. It’s also a chance for us to gain some early insight into how people feel about our schemes. Plus, we’re actually very nice and we really enjoy a chat and doing our best to help people with any queries they might have!!"
        },
        {
            "text": "Caroline: You and the whole team are very lovely Katie, I can confirm that. So, where can people find out what shows you’ll be attending?"
        },
        {
            "text": "Katie: There’s a list on the RPA blog, and also a list on the farming blog on which ones the Farming and Countryside Programme will be attending."
        },
        {
            "text": "Caroline: Thank you so much for that Katie. I’ll also be attending a few of the shows, so I’ll catch up with you and the team again there. It’s been a pleasure to talk to you."
        },
        {
            "text": "Katie: Thanks very much Caroline."
        },
        {
            "text": "               ****Music – leading to next segment ****"
        },
        {
            "heading": 4,
            "text": "Item 3: Next round of FETF grants. Script currently in draft form "
        },
        {
            "text": "Caroline: Earlier this year the Prime Minister made a speech at the annual NFU conference where he announced the biggest ever package of grants to boost productivity and resilience in the farming sector, including the largest ever grant offer for farmers in the coming financial year, expected to total £427 million. I’m joined today by Caitlin Smith from RPA’s Grants Service team who will talk to us about the new round of the Farming Equipment and Technology Fund. Caitlin, welcome to the podcast."
        },
        {
            "text": "Caitlin: Thanks Caroline, it’s good to be here."
        },
        {
            "text": "Caroline: So following the announcement at the NFU Conference what can you tell us about Round 2 of the Farming Equipment and Technology Fund?"
        },
        {
            "text": "Caitlin: Yes, we’ve opened a new round of the Fund, which is worth £70 million, and that’s designed to support farmers with the costs of eligible items to build the resilience of the farming sector and boost our food security. The Farming Equipment and Technology Fund has three grants to help farmers buy items to improve productivity, manage slurry and improve animal health and welfare.  You can apply for more than one grant, for items that suit your business.  Under the Productivity element you can apply for a maximum of £50,000 and this focuses on improving agricultural sustainability and horticultural and forestry productivity, helping farmers use less inputs, reduce emissions and cut waste. The Slurry grant is also a maximum of £50,000 and this helps farmers to improve their slurry management and maximise environmental benefit. The Animal Health and Welfare grant gives a maximum of £25,000 which will offer improvements in the health and welfare of livestock, potentially helping farmers improve biosecurity or decrease environmental stress."
        },
        {
            "text": "Caroline:  Thanks Caitlin, and what sort of uptake are you expecting this year?"
        },
        {
            "text": "Caitlin: Well, the 2023 FETF round received over 6,000 applications and to date has paid farmers over £26m. We’re expecting an increased uptake this year with over 200 items available, including over 50 new items.  These items will enable farmers, horticulturalists, forestry owners and contractors providing services to these sectors, to raise farm productivity, improve animal health and welfare outcomes and achieve environmental sustainability and innovation."
        },
        {
            "text": "Caroline: And what does this mean for farmers?"
        },
        {
            "text": "Caitlin: These grants will help businesses boost farm productivity, reduce waste and cut input costs, as well as increase environmental sustainability. There are also more opportunities for farmers to be able to apply for grants at different times within the year, and that allows them to align when they apply with their individual farming calendars."
        },
        {
            "text": "Caroline: Is there anything new for 2024?"
        },
        {
            "text": "Caitlin: For the first time we’ll be introducing multiple application windows through the year. There will be three windows opening in 2024 for each of the three grants. Also, applicants for the Animal Health and Welfare grant can apply for a 20% vet advice uplift to their score and applicants for the Productivity and Slurry grants will be able to apply for up to £50,000 of grant funding towards eligible items, which is an increase of £25,000 from last year. This means applicants could receive up to £125,000 in total towards the purchase of new equipment and technology."
        },
        {
            "text": "We’ve also introduced two different scoring methodologies which can be found in the item lists for the grant applicants are applying for and we’ve increased the intervention rate for grants from 40% to between 50% and 60% for eligible costs."
        },
        {
            "text": "And finally we.ve introduced reference costs meaning the RPA will pay applicants an increased grant amount of 50% (for most items) or 60% towards either the average cost of the item (if an item costs you the same or more than the expected average cost in the item lists) or the actual cost you pay for the item (if an item costs you less than the expected average cost in the item lists)"
        },
        {
            "text": "Caroline: That’s really helpful, thanks Caitlin. And I believe that the Grants Service team are attending a number of shows over the rest of the year and you’re encouraging people to come and talk to you on the stand?"
        },
        {
            "text": "Caitlin: Yes, that’s right. We’ll be on the RPA stand at many of the larger shows this year to answer face-to-face queries relating to what grants are available, how the grants work and the time frames. We want as many people as possible to come and talk to us to get advice or ask questions, which hopefully we’ll be able to answer on the day, but if we can’t, we’ll take your details and get back to you with the correct information after the event."
        },
        {
            "text": "Caroline: And in the meantime, where can people find more information on the grants that are available?"
        },
        {
            "text": "Caitlin: Yes, you need to visit Gov.uk, and search for funding for famers. The guidance on funding for farmers is regularly updated and sets out every payment on offer, with links to learn more, including links to the Rural Payments blog and the farming blog. And it’s worth mentioning that we’ve also introduced a brand new user portal with improved functionality for our customers. This year applicants will be able to use the new service making it easier to apply for the grants. Applicants will need to be quick though, the first application window for productivity and slurry grants will close at 12 noon on 17 April. The first application window for animal health and welfare has opened and will close at 12 noon on 1 May. However, there are two more application windows for all 3 grants expected to open in 2024."
        },
        {
            "text": "Caroline: Thank you so much Caitlin."
        },
        {
            "text": "                   ****Music – leading to next segment ****"
        },
        {
            "heading": 4,
            "text": "Item 4: Interview with Marie Hardeman, RPA’s Customer Director. "
        },
        {
            "text": "Caroline: Today we’re joined by Marie Hardeman, RPA’s Customer Director who is here to talk about all things Customer Service. It’s lovely to have you here Marie."
        },
        {
            "text": "Marie: It’s lovely to be here."
        },
        {
            "text": "Caroline: So, you’ve been in your role as RPA’s Customer Service Director for almost a year now, what’s that year been like for you?"
        },
        {
            "text": "Marie: It’s been a really varied and inspiring first year. I’ve spent a lot of time out and about meeting our customers and that’s been varied because we deliver support to so many agricultural and rural communities, so from fruit and veg growers and traders, to small family farmers, right through to really large land owners and huge agricultural organisations and then it’s been inspiring because everyone I’ve met has been really passionate about what they do and really honest about the challenges the sector faces and how we at the RPA can impact them, positively and negatively, if we’re not getting it right, and no matter how challenging their circumstances are, everyone I’ve met has been welcoming and really wanting to work in partnership with us to shape our services. I’ve met many organisations and stakeholders who provide services to our customers and that’s a really great community of people who also want to work in partnership with us. It’s been my first year at RPA, so as well as being my first year in the role, it’s been my first year working with colleagues and another observation would be that the passion and the willingness to deliver great outcomes has been shown right across the agency. Everyone I work with has been welcoming, supportive and is genuinely motivated by wanting to provide a great service."
        },
        {
            "text": "Caroline: I know that you’ve got some interesting plans for customers going forward, but before we talk about that, could we talk about what you’ve achieved and delivered for RPA’s customers over the past year?"
        },
        {
            "text": "Marie: Yes, I suppose linked to what I’ve just said with my reflections on our colleagues at the agency, it’s probably important to highlight that what’s been achieved is because of a great group of people working together. We’ve supported thousands of customers this year to access funding so as well as continuing to deliver funding through existing schemes, we’ve delivered a variety of new schemes and new grants. We’ve then improved how our customers can contact us, how they can get through to the right person on our telephone lines or by web chats, how they can tell us about information and changes and then how we can better direct their queries or information they’re sharing with us to the right people. We’ve increased the way we share information to reach more customers, so this is things like our newsletters, videos to show guidance, videos to share real life examples from customers on how they’re using our funding to deliver great outcomes and then of course things like this podcast. I talked about our stakeholder community and we engage with a large number of stakeholders and that’s a really important group. Some of our customers choose to be members of these organistions and some choose to use land agents, for example. So in the last year we’ve increased how much we get out and about, whether that’s at shows and events or whether it’s how we inform and engage with our stakeholders through meetings and workshops and getting out and about in our rural communities. In the last year we launched our farmer panel and that’s really important for us to gather insight but also test some of those improvements that we’re making and we’ve increased our customer insight activity. So, what I mean by that is how we capture feedback from that broad group of customers I talked about, in different ways and at different parts of their interaction with us. We get feedback in such a variety of ways – direct, so say from a customer survey or from the farmer panel or perhaps a social media comment, but also indirectly through our data and our performance information, and from colleagues out in the field or taking calls from our customers. So we’re improving how we pull all that together to help drive improvements across our services."
        },
        {
            "text": "Caroline: That’s really useful, thanks Marie. So, as well as collecting feedback through surveys and engagement as you’ve mentioned, I know that you’re very keen on listening to customers by visiting farms, talking to farmers and making sure their voice is heard. How’s that allowed you to make improvements?"
        },
        {
            "text": "Marie: It’s really helping us to shape how we deliver services. So far it’s helped with probably quite individual things, so we might have shared some guidance with customers to get their feedback on ‘does that makes sense to them, do we need to make any changes?’ We’ve involved our customers in how to improve our mapping function, although there’s a lot more work that we can and will be doing to improve mapping. So far it’s been helping us shape how we deliver individual things. Moving forward we’re talking to our customers about what they want overall from us as an agency and how we can better shape our end-to-end customer services."
        },
        {
            "text": "Caroline: This is all great to know, I and RPA’s customers would also like to know how you’re ensuring that the people working for you have the right skills to deliver the customer service that farmers, agents and landowners need?"
        },
        {
            "text": "Marie: That’s a really interesting question because we are changing the types of services that we need to deliver to our customers and how we deliver those and it’s really important that we upskill our colleagues across the agency to be able to deliver those changes, so a really good example of that is things like our field officers. Previously under EU funding we’ve had to inspect and check compliance against agreements. While it’s important to ensure that our public money is being used for good,  we want to move more towards supporting our customers to deliver those brilliant outcomes, helping them to get it right, preventing mistakes happening, so that’s a real shift in what’s expected of our field colleagues. I talked earlier about the increased funding streams that we’ve provided, whether that’s schemes or grants. All of that means that our colleagues, on the telephones or in the fields, need to be more informed to advise, guide and support customers, so we’re keen to upskill our contact centre colleagues so that they can provide accurate and useful information to our customers. With all of that we also need to provide the technology to support colleagues in delivering those services."
        },
        {
            "text": "Caroline: Thanks Marie. And what about giving customers a choice in how they engage with RPA – one size doesn’t necessarily fit all?"
        },
        {
            "text": "Marie: Absolutely. We’ve talked a little bit today about the different customer groups that we provide support to, and what that means is that different customers want to contact us in different ways at different times of the day or the week and for some customers the type of service they like differs, so whether they want  to be able to self-serve that information without needing to talk to a person, they want to be able to get information quickly, tell us of changes quickly at a time that’s convenient for them, or whether it’s face to face contact in the field or whether they want to speak to that person about multiple things to do with their farm or business, so one of the things we’re looking for in the next 12 months is to look at the best contact model we can provide, both in the field, over the phone or through our customer portal, how do we provide the right contact model for all of the customers we’re trying to support, so we absolutely want to give customers a choice in how they engage but we also want to make sure that whatever way they choose, they receive a consistent and a great service."
        },
        {
            "text": "Caroline: Thanks Marie, that’s been really interesting. Just one final question – is there anything RPA has planned for this year that you’re introducing that’s going to enhance the customer service RPA provides?"
        },
        {
            "text": "Marie: I think the biggest thing will be our contact model, so improving how we engage with our customers. We’d really like to give customers a choice in how they engage with us. I talked earlier about all the different customer groups that we provide support to. They all have different ways of wanting to contact us, perhaps the time they’d like to contact us and then the type of service they’d like. So for some customers they’re quite happy to self-serve information and to tell us of changes without necessarily talking to a person, whereas for others they’d like more complex support, they’d like to talk to a person, whether that’s in the field or over the phone, so we’d like to improve how we engage, how we support customers to deliver those outcomes and how we make it easier for customers to get the information and support they need from us. Also a big part of that is how we use our customer insight and how we engage with customers to help us improve that, so really getting customer feedback to help us shape and design those services."
        },
        {
            "text": "Caroline: Marie, thanks very much for taking the time to talk to us today."
        },
        {
            "text": "Marie: Thank you for talking to me. I hope it was useful."
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Caroline: So, that’s all we’ve got time for today. Thank you to all our participants, and thank you once again for listening. We’ve covered a range of topics again today but we’re always happy to receive your questions and suggestions. So, if you’d like us to cover a particular topic or issue with our subject experts, please get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on X - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the tenth episode of the RPA podcast as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": "****Close music to fade****"
        },
        {
            "text": " "
        }
    ]
}