{
    "url": "https://forestrycommission.blog.gov.uk/2024/04/11/trees-and-biodiversity-net-gain-on-small-sites/",
    "title": "Trees and biodiversity net gain on small sites",
    "authors": [
        "Amanda Newsome",
        "Jim C Smith"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2024-04-11T17:18:02+01:00",
    "content": [
        {
            "text": "On 2 April, the requirement for new developments to deliver a biodiversity net gain (BNG) was extended to small sites, bringing tens of thousands more planning applications within scope of the legislation. Small sites are those with less than 10 houses or, for commercial development, sites less than 1ha or where the building footprint is less than 1000m². "
        },
        {
            "text": "On these smaller sites it can be more difficult to find the space to deliver BNG alongside the development. Let us talk you through the different ways that trees can contribute towards BNG for any scale of development.  "
        },
        {
            "heading": 2,
            "text": "Retaining trees in developments "
        },
        {
            "text": "One of the first things you should consider when planning any new development, is retaining as many existing trees on the site as possible and minimising the impact the development will have on them. They will count towards your site’s baseline BNG value, and any that are retained will also count towards its post-development value.  "
        },
        {
            "text": "So, the more trees you can keep on site, the smaller your BNG losses will be and the fewer additional biodiversity units you will need to reach your target 10% net gain. Individual trees, lines, blocks or groups of trees found within and around the perimeter of urban land are all counted.  "
        },
        {
            "text": "The type of tree surveys that are routinely required for most planning applications consider the health and amenity value of each tree, whereas the BNG condition assessment uses different criteria to look at their biodiversity value (see tab 9 of Statutory Biodiversity Metric Condition Assessments – Individual trees). When considering which trees you want to retain on site, it’s important to consider all survey results – for example, a tree with a low amenity value, doesn’t automatically have a low biodiversity value.  You should always ensure that retained trees have sufficient space above and below ground for their roots and branches to grow once the development is finished. "
        },
        {
            "heading": 3,
            "text": "Ancient or veteran trees"
        },
        {
            "text": "If you have ancient or veteran trees on your site, these are considered irreplaceable habitats and already have special protection through the planning system. Development should not result in loss or deterioration of these habitats, unless there are wholly exceptional circumstances, and a suitable compensation strategy exists. Assessment of the impacts on irreplaceable habitats and what constitutes suitable compensation sits outside the BNG process.  "
        },
        {
            "text": "You should still include ancient and veteran trees in your biodiversity metric calculation and select the option that identifies them as an irreplaceable habitat. This takes them out of the baseline calculation, and you will need to agree compensation for any impacts separately with the local planning authority. You can find out more in the government guidance explaining how BNG applies to development on irreplaceable habitats.  "
        },
        {
            "heading": 3,
            "text": "Trees in private gardens"
        },
        {
            "text": "Normally habitats within private gardens are not assessed separately for BNG purposes – they are recorded as either ‘vegetated’ or ‘unvegetated’ gardens. However, for trees this is slightly different; you must include all garden trees in your baseline assessment that have a trunk diameter of 30cm or more (measured 150cm from the ground). This is regardless of whether they have a Tree Preservation Order on them or not (an order made by a local planning authority to protect specific trees in the interests of amenity)."
        },
        {
            "text": "This is to ensure that the biodiversity value of significant trees in gardens is properly accounted for in the BNG calculation and to encourage their retention.  "
        },
        {
            "heading": 2,
            "text": "Incorporating new trees into small developments"
        },
        {
            "text": "Planting new trees within your development is a good way of generating biodiversity units. They can be incorporated along streets or into any public spaces, as individual trees, lines or groups. Trees that are successfully integrated into new developments will avoid the negative consequences that are sometimes cited as reasons not to plant them, such as interference with services or building foundations. It’s a matter of choosing the right species for the location (right tree, right place), and designing buildings and infrastructure with trees in mind.  "
        },
        {
            "text": "The most important factor is ensuring newly planted trees have sufficient room for their roots to develop as well the above ground space to grow to maturity without needing intensive pruning."
        },
        {
            "text": "Another unique advantage of incorporating new trees into a development, when compared with other habitats, is that any habitat underneath the tree canopy is measured and counted separately. So, every tree you plant counts in addition to the habitat beneath, enabling you to create more biodiversity units from the same piece of land. As well as helping with your BNG requirements, trees have been shown to have a positive impact on the desirability and sale price of new properties. "
        },
        {
            "heading": 3,
            "text": "Maintaining trees in developments to deliver greater benefits"
        },
        {
            "text": "When actively managed, trees deliver many benefits including cooling our streets, supporting mental health and wellbeing, improving air quality and reducing the risk of flooding. The BNG legislation requires a 30-year legal agreement to create and maintain ‘significant’ on-site net gain, which includes the trees. A developer, or any management company who subsequently takes on the management of the site, has to manage those trees for the full 30 years.  "
        },
        {
            "text": "This is a big improvement on the usual 5-year period imposed by local authorities for the maintenance and replacement of trees and other green infrastructure. It should ensure that newly planted trees are better cared for and become established, enabling them to grow to their full potential and deliver multiple ecosystem services.  "
        },
        {
            "heading": 2,
            "text": "So why plant trees as part of a development?"
        },
        {
            "text": "Integrating trees into a development makes total sense from a BNG perspective, especially on small sites, but they deliver so many other benefits in our urban environments. They improve the view, aid privacy, provide shade and help reduce pollution and ﬂash ﬂooding. Community green spaces bring people together; local parks and woods are valuable places for people to walk, play and connect with nature.  "
        },
        {
            "text": "With all these reasons to justify their inclusion in new developments, we hope to see many more trees planted as a result of BNG, managed well and thriving into the future. "
        }
    ]
}