{
    "url": "https://stratcommand.blog.gov.uk/2023/08/27/80th-anniversary-of-the-death-of-commandant-rene-mouchotte/",
    "title": "80TH ANNIVERSARY OF THE DEATH OF COMMANDANT RENÉ MOUCHOTTE",
    "authors": [
        "blythevictor"
    ],
    "categories": [
        "Gibraltar",
        "Military History",
        "Overseas Bases"
    ],
    "pub_date": "2023-08-27T09:32:32+01:00",
    "content": [
        {
            "text": "August 27, 2023 is the 80th anniversary of Commandant René Mouchotte’s death. In order to join the Free French Forces, Mouchotte and five colleagues escaped the Vichy Francecontrolled Oran, Algeria, in 1940 by flying a partly disabled plane to Gibraltar. A highly capable pilot and leader, Mouchotte was the first non-Commonwealth aviator to command\nan RAF squadron."
        },
        {
            "text": "Born on August 21, 1914, Mouchotte volunteered for military service as World War II swept across Europe. He chose to join the French Air Force (Armée de l'air), achieving his pilot wings in February 1937. When his country capitulated to Nazi Germany in 1940, Mouchotte didn't: he escaped with five others in a stolen aircraft, flying just above the wavetops to Gibraltar. From there, he\nmade his way to England and RAF Fighter Command. In 1941, he flew operational missions defending the United Kingdom during the Blitz. While in command of 65 Squadron, he was awarded the Distinguished Flying Cross on September 1, 1942."
        },
        {
            "text": "Mouchotte’s final posting was to 341 Free French Squadron at RAF Biggin Hill. While commanding 341 Squadron, he was shot down and killed in combat with a Focke Wulf 190 on the first daylight raid to Blockhaus d'Éperlecques in the Pas de Calais on August 27, 1943. Though he was only in Gibraltar briefly, RAF Gibraltar is extremely proud of their association with one of the most famous and admired French fighter pilots of World War II. The RAF headquarters in Gibraltar was renamed the Mouchotte Building on the weekend of the Battle of Britain Commemorations on September 14–15, 2013."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}