{
    "url": "https://deframedia.blog.gov.uk/2022/10/18/drought-may-remain-beyond-spring-2023-eas-national-drought-group/",
    "title": "Drought may remain beyond spring 2023 - EA’s National Drought Group",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "water"
    ],
    "pub_date": "2022-10-18T13:40:54+01:00",
    "content": [
        {
            "text": "There was widespread media coverage this weekend following the latest National Drought Group meeting on Friday (14 October), chaired by Environment Agency (EA) Chief Executive Sir James Bevan."
        },
        {
            "text": "The meeting – covered by the Telegraph, the Guardian, the Sun, the Star, the Mirror, and the Express among others – forecast that average rainfall levels over winter will still not be sufficient to avoid impending drought or drought conditions next year."
        },
        {
            "text": "The group, made up of senior decision-makers from the EA, government, water companies and key farming and environmental groups, discussed projections for a dry autumn and winter on the water, agriculture and environment sectors in 2023. Many water companies have suggested impending drought or drought conditions will remain beyond spring in some areas – notably in parts of the South West, South East, East and Yorkshire and East Midlands - if rainfall is below average."
        },
        {
            "text": "The Group also discussed the actions needed over the next six months to sustain essential water supplies in preparation for spring/summer next year, which includes water companies implementing their drought plans and accelerating infrastructure plans to improve resilience of water supplies in the medium term."
        },
        {
            "text": "NDG members heard that:"
        },
        {
            "text": "This is despite the EA’s latest monthly national water situation report highlighting that for the first time since February 2022, September rainfall across England as a whole reached average levels. Due to soils remaining drier than usual, this has made limited difference to river, groundwater and reservoir levels which remain low - demonstrating that recent rainfall has not changed the underlying drought situation caused by the prolonged dry weather of the last several months."
        },
        {
            "text": "The Environment Agency is taking action to manage the impacts of the drought, including by managing water abstraction licences, taking decisions on drought permits and operating its water transfer schemes."
        },
        {
            "text": "The EA is also working closely with farmers and growers to support the industry. The package of measures to assist farmers announced this summer, which continues through this winter, includes water trading between farmers in catchments to help improve access to water, as well as the temporary ability to abstract additional water where it doesn’t impact existing abstractions or harm the environment."
        },
        {
            "text": "EA Chief Executive and NDG chair, Sir James Bevan said:"
        },
        {
            "text": "Water Minister Trudy Harrison said:"
        },
        {
            "text": "The NDG’s projections place more focus than ever on the actions that must be taken now to enhance resilience to dry periods and the Environment Agency is redoubling its efforts to secure long term water security, including through the National Framework for Water Resources. On Friday the NDG identified a set of actions to help accelerate delivery of new water infrastructure and the water security it will help to ensure."
        },
        {
            "text": "The group will meet again later this autumn, on 28 November, to assess the latest position and take further action as necessary."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}