{
    "url": "https://food.blog.gov.uk/2022/10/18/emily-miles-stakeholder-update-safer-takeaways-and-the-power-of-online-platforms/",
    "title": "Emily Miles' stakeholder update - Safer takeaways and the power of online platforms",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Food Hygiene Ratings",
        "Our mission",
        "Partners"
    ],
    "pub_date": "2022-10-18T12:17:02+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Since the pandemic, almost 40% of us order takeaway food through an app or online. Some 170,000 food businesses are on three of the biggest online platforms, Just Eat, Uber Eats and Deliveroo. They have significant reach across the takeaway, restaurant and food-to-go sectors."
        },
        {
            "text": "These three online platforms, supported by the FSA, have developed a new Food Safety Charter. The Charter commits them to make sure businesses selling food through their platforms are registered with their Local Authority and meet a minimum standard under the Food Hygiene Rating Scheme (FHRS). The Charter also commits them to use their communication channels to businesses and customers to share FSA hygiene and safety information and support those with food hypersensitivities."
        },
        {
            "text": "This initiative is a great starting point for our work with online platforms and we believe it will improve compliance of food businesses with minimum standards. We are working to ensure food is safe wherever you buy it, and the Food Safety Charter is an example of the FSA following our guiding principle of working with and through others to protect consumers."
        },
        {
            "text": "If you have any thoughts on regulating online food sales, we would be really interested to hear them. Please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "Diweddariad i randdeiliaid gan Emily Miles - Siopau tecawê mwy diogel a grym llwyfannau ar-lein"
        },
        {
            "text": "Ers y pandemig, mae bron i 40% ohonom yn archebu bwyd tecawê trwy ap neu ar-lein. Ceir rhyw 170,000 o fusnesau bwyd ar dri o'r llwyfannau ar-lein mwyaf – Just Eat, Uber Eats a Deliveroo. Mae ganddynt gyrhaeddiad sylweddol ar draws y sectorau bwyd tecawê, bwytai a bwyd-i-fynd."
        },
        {
            "text": "Mae'r tri llwyfan ar-lein hyn, a gefnogir gan yr ASB, wedi datblygu Siarter Diogelwch Bwyd newydd . Mae’r Siarter yn eu rhwymo i sicrhau bod busnesau sy'n gwerthu bwyd ar eu llwyfannau wedi cofrestru gyda'u Hawdurdod Lleol ac eu bod yn bodloni safon ofynnol o dan y Cynllun Sgorio Hylendid Bwyd. Mae’r Siarter hefyd yn eu rhwymo i ddefnyddio eu sianeli cyfathrebu ar gyfer busnesau a chwsmeriaid i rannu gwybodaeth hylendid a diogelwch yr ASB ac i gefnogi'r rheiny sydd â gorsensitifrwydd i fwyd."
        },
        {
            "text": "Mae'r fenter hon yn fan cychwyn gwych ar gyfer ein gwaith gyda llwyfannau ar-lein, a chredwn y bydd yn gwella cydymffurfiaeth busnesau bwyd â safonau gofynnol. Rydym yn gweithio i sicrhau bod bwyd yn ddiogel, lle bynnag y byddwch yn ei brynu, ac mae'r Siarter Diogelwch Bwyd yn enghraifft o'r ASB yn dilyn ein hegwyddor arweiniol o weithio gydag a thrwy eraill i ddiogelu defnyddwyr."
        },
        {
            "text": "Os oes gennych unrhyw syniadau am reoleiddio gwerthiannau bwyd ar-lein, hoffem yn fawr eu clywed. Rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}