{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/10/18/engineering-biology-industrial-biotech-policy-officer/",
    "title": "Engineering Biology & Industrial Biotech policy officer",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-10-18T20:33:49+01:00",
    "content": [
        {
            "text": "The role is within the Technology Strategy and Security Team (TSS), which sits within the BEIS Business Growth Directorate. TSS’ mission is to drive policy that helps translate UK science excellence into economic innovation, helping grow the technology businesses of tomorrow. The team supports the growth of future sectors of our economy, from quantum to robotics to engineering biology. It is not just the economic implications of these technological changes that we need to grapple with, but the security and societal implications too."
        },
        {
            "text": "This role is within the Engineering Biology team, which is developing Government’s ambitions for engineering biology and industrial biotechnology more broadly. The sector was identified in the 2021 Innovation Strategy as one of the ‘Seven Technology Families’ of UK strength and opportunity."
        },
        {
            "text": "Day to day, you will take ownership of policy projects that advance and grow the UK’s engineering biology sector. These may address questions such as “what are the most important, impactful and credible opportunities for using engineering biology?”, “what international collaborations on engineering biology are needed for UK academics and firms?”, or “what support do UK academics and firms need to develop this technology in a security-conscious way?” You will be responsive to Ministerial priorities and interests for the sector."
        },
        {
            "text": "You will collaborate across Government to answer these questions and design pro-growth policies. As well as working closely with established players like UK Research & Innovation, you will cultivate new links with teams across BEIS and other Departments leading exciting application areas such as agriculture and food, biofuels, chemicals, materials and animal and human health. The role will also involve a lot of external facing joint-working and consultation with the engineering biology and industrial biotech academic and business communities."
        },
        {
            "text": " "
        },
        {
            "text": "The deadline for the role is 6 November, you can find out more or apply here."
        }
    ]
}