{
    "url": "https://civilservice.blog.gov.uk/2022/10/18/giving-young-people-a-brighter-future/",
    "title": "Giving Young People a Brighter Future",
    "authors": [
        "Keeley Usher"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-10-18T08:27:22+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Department for Work and Pensions (DWP) Youth Employability Programmes Team is passionate about helping young people into work. They celebrate their achievements through reflections from the young people they support. Based in Newcastle, Leeds, Sheffield, Blackpool and London, they comprise 12 staff who work remotely."
        },
        {
            "text": "Our team leads the Movement to Work (MtW) programme across the Civil Service, supporting various Diversity Internship Programmes and colleagues in Kickstart jobs in the department."
        },
        {
            "text": "Movement to Work"
        },
        {
            "text": "Movement to Work placements are for young people aged between 16 and 30, in receipt of benefits and not in education, employment, or training (NEET). The programme provides work experience and gives them the skills and confidence to improve their job prospects through the provision of high-quality placements. "
        },
        {
            "text": "Gavin – Youth Work Coach, Birmingham"
        },
        {
            "text": "Gavin was born and raised on a council estate in south Birmingham. Coming from a struggling family, he found it tough to do well in school, worsened by bullying. Gavin says, “I entered the working world with poor grades and no experience. I was left to face my challenges alone with no knowledge of where to start.”"
        },
        {
            "text": "During his MtW placement with DWP, Gavin “gained heaps of knowledge” demonstrating Civil Service behaviours and competencies. “I left the programme with much more confidence and experience to enter the Civil Service,” said Gavin. “The personal support was something I’d never experienced. Sharing that time with someone who knew what they were talking about was pivotal to my success.”"
        },
        {
            "text": "Gavin secured a role with the department shortly after completing his placement. He said, “It’s added unbelievable opportunities and opened so many doors both in my personal and work life. It includes working with the Future Leaders’ Network and helping shape policy for young people, gaining leadership experience to help my role at DWP and above all else, it keeps me motivated at work to try and change young people’s lives. Young people are the future, who need an opportunity now.”"
        },
        {
            "text": "Diversity Internship Programmes focus on our commitment to improve social mobility in the UK by offering paid internships to diverse groups of young people, giving on-the-job experience, and helping to build confidence and capability with potential permanent employment."
        },
        {
            "text": "Faith - Data Protection Advisor, London"
        },
        {
            "text": "“Coming into DWP, I had no idea what to expect. My personal advisor told me about the opportunity following a difficult time in my life after my mother passed. Coming from foster care, life has always been a rollercoaster, but this motivated me to better myself. I took a leap of faith and applied. I’m so grateful the Talent Diversity Internship Programme saw something that, at the time, I couldn’t see in myself.”"
        },
        {
            "text": "I couldn’t ask for more supportive colleagues. They welcomed me and made me feel heard during my induction, allowing me to take my time to understand how their business area is run. My line manager and I are currently looking into apprenticeships to help me gain a qualification. I look forward to building on my existing knowledge in order to excel in DWP."
        },
        {
            "text": "The Talent Diversity Internship Programme has done an amazing job at making sure young people like me have a voice. They’re always in contact and have provided sessions where I can meet young people with similar experiences. It’s been a breath of fresh air, working with people new to Civil Service like me who are still finding their way around.”"
        },
        {
            "text": "Brodie, Child Maintenance Group, Dudley"
        },
        {
            "text": "“I’m 24 years old and started my Kickstart job with the Child Maintenance Group (CMG) back in February 2022. My confidence took a nose-dive this time last year as I was in and out of work after losing my job. I was nervous initially and felt a little out of place knowing I didn’t complete my education and my head was filled with thoughts that everyone here would look down on me.”"
        },
        {
            "text": "Well… everyone proved me wrong! Almost four months later I’ve used my experience and skills to help me find a permanent job within DWP."
        },
        {
            "text": "Since starting, I’ve met some wonderful people. Everyone has been an absolute diamond. I think the support and love I received was a driving factor in keeping me going when I wasn’t feeling so confident, and I hope that I’ve inspired them. I’ve made solid friends for life during my time here. There has also been masses of support, training, and advice from more experienced colleagues too. The managers who look after us day-to-day have been fabulous and I’ve not a single negative thing to say about any of the trainers and tutors. "
        },
        {
            "text": "I learnt so much during my first two months, as well as in the ongoing employability sessions. With so much encouragement from the whole team, I can honestly say that I could not be in better hands."
        },
        {
            "text": "I’m certain that I will receive the same level of support from my new team as I did here with the CMG, and I really look forward to the challenge. Bring it on!”"
        }
    ]
}