{
    "url": "https://space.blog.gov.uk/2022/10/18/how-satellite-operators-are-shaping-a-new-collision-assessment-service/",
    "title": "How satellite operators are shaping a new collision assessment service",
    "authors": [
        "Monitor Your Satellites team"
    ],
    "categories": [
        "Space surveillance and tracking",
        "Space sustainability"
    ],
    "pub_date": "2022-10-18T15:23:52+01:00",
    "content": [
        {
            "text": "It is estimated that more than a million pieces of debris over 1cm in size are orbiting the Earth, one piece of which is enough to destroy satellites that are essential to our everyday lives."
        },
        {
            "text": "Ensuring the safe and sustainable use of space is a priority for the UK Space Agency as part of the National Space Strategy. But the question of ‘how do we achieve this?’ remains. Monitor your Satellites is one part of the solution."
        },
        {
            "text": "Monitor Your Satellites, a collision assessment service developed by the UK Space Agency’s Space Surveillance and Tracking team, aims to help in this mission by:"
        },
        {
            "heading": 3,
            "text": "Operator Focused"
        },
        {
            "text": "During the early stages of the project, we hosted over 20 user research sessions, engaging with around 75% of all UK-licensed satellite operators at the time. This helped us to develop a service that plugged a gap in existing Space Surveillance and Tracking (SST) offerings and addressed some of the pain points in current processes, one of which being receiving multiple alerts for the same event."
        },
        {
            "text": "In response to this, Monitor Your Satellites groups multiple alerts into a single event and allows users to set their own notification thresholds, meaning operators can quickly identify what events are of high interest and require further action."
        },
        {
            "heading": 3,
            "text": "Listening to our users"
        },
        {
            "text": "With a new and exciting service, we were ready to onboard four satellite operators - Inmarsat, Surrey Satellite Technology Ltd, Sky and Space Global and OneWeb - to help shape the service and where to go next. Operators identified additional analysis provided by our expert orbital analysts as a huge asset. Therefore, we continue working with orbital analysts to provide more information and trial allowing operators to contact them regarding their analysis."
        },
        {
            "text": "We opened up the service to all remaining UK satellite operators to gain additional industry insight and attended Farnborough International Airshow and Space-Comm Expo during the summer to talk to potential users in person. Since then, we have on boarded three more operators; AAC Clyde Space, Astroscale and Space Forge, and look forward to hearing their insights on how the service could best work for them."
        },
        {
            "heading": 3,
            "text": "What’s next on the Horizon for Monitor your Satellites?"
        },
        {
            "text": "In the last year we have over a third of UK satellite operators signed up to the service, with 32 individual users monitoring almost 100 satellites between them. However, there is more to be done. We continue to refer back to core user needs identified and remain committed to ensuring that Monitor Your Satellites enhances the capabilities of its users."
        },
        {
            "text": "Want to find out more, or join the service? Schedule an introductory webinar with our team by emailing monitoryoursatellites@ukspaceagency.gov.uk."
        }
    ]
}