{
    "url": "https://hmlandregistry.blog.gov.uk/2022/10/18/making-our-services-more-efficient/",
    "title": "Making our services more efficient",
    "authors": [
        "Angie Clarkson, Deputy Director - Registration Services"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-10-18T11:01:26+01:00",
    "content": [
        {
            "text": "At the end of August, we published our Strategy 2022+ and our three-year Business Plan. Alongside a number of other commitments to support the property market and UK economy, both set out how we will improve the speed of our services – providing truly outstanding, resilient, secure services.  "
        },
        {
            "text": "We believe this can only be delivered through a combination of recruitment and training as well as automation. The next five years will see us increasingly automate our simpler cases - and partially automate the more complex ones – while training our caseworkers so they can focus on those more complex cases where their expertise and professional judgment make the most difference. "
        },
        {
            "heading": 2,
            "text": "Recruiting and strengthening our expertise  "
        },
        {
            "text": "The property market can be volatile with demand rising and falling sharply. While the last few years has seen sharp changes in economic fortunes, the fluctuations in the property market is nothing new. Historically this has caused backlogs for HM Land Registry during periods of economic growth, which we have managed entirely through recruitment. Automation will provide a more resilient service for our customers in the future, reducing our dependency on the long process of hiring and training people. "
        },
        {
            "text": "At the moment, 29% of our applications to change the register are automated. While we work to increase this, we need to grow our capacity to better meet our customers’ current needs. We’ve been doing that through record levels of recruiting and training, with hundreds of additional caseworkers joining our teams over the last few years.We believe it’s the right thing to do, and we have been starting to see improvements despite the high levels of demand for our services over the last two years. Our caseworkers have processed 18% more register change applications year to date, compared with the same period last year.  "
        },
        {
            "text": "But it does bring with it a few challenges. Providing our caseworkers with the expertise they need to make judgements requires training. This has reduced our daily processing capacity as expert caseworkers train new caseworkers.  "
        },
        {
            "text": "Recognising this, our efforts to increasingly automate and improve our casework systems will ensure we maximise our increasing capacity, delivering better efficiencies in the near term, as we begin fully automating our simpler services. "
        },
        {
            "heading": 2,
            "text": "What we’ve already automated and what we will automate "
        },
        {
            "text": "The overwhelming majority of our daily workload is requests for information about existing titles. These are required ahead of every property transactions and we deliver 115,000 results every day to support the ongoing operation of the property market. Around 90% of these requests are already automated. While the remaining 10% are delivered within our service standards, we plan to automate (as far as is possible) the remaining manually processed applications by the end of 2025-26. "
        },
        {
            "text": "Our priority is on applications to change an existing title, as these represent most of our manually processed work. We get around 18,000 of these every day and 29% (more than 5,200) are already automated. These automated updates are mostly discharges; the removal of mortgages. All other applications to change an existing title are processed by our people. We believe we can greatly increase the number of automated applications  from 29% with much of the work having been done for this over the last five years.  "
        },
        {
            "text": "We will also begin to digitally transform those applications to create new titles, such as First Registrations and Transfers of Part. These are usually more complex, requiring caseworkers to make qualified decisions and judgements. While we’re working on digitising what we can of these applications, by automating our simpler cases we will allow caseworkers to focus on those areas where their expertise and professional judgment make the most difference: the more complex casework "
        },
        {
            "text": " While the majority of our work is already automated, we have set an ambitious timetable for our continuing digital transformation. We know this will not be easy. Land registration may sometimes seem simple but each case can contain a myriad of complexities which makes it hard to process quickly. We will always need our caseworkers’ expertise to process those areas which cannot be automated, however through automation we can reduce the time spent on the simpler aspects of the work. "
        },
        {
            "text": "This is a complex area of work, and we will be sharing more about our intentions and ambitions in the coming weeks and months. You can either follow our blog or subscribe to our monthly Landnet newsletter to receive regular updates on our transformation. "
        }
    ]
}