{
    "url": "https://insidedio.blog.gov.uk/2022/10/18/reduce-reuse-recycle-managing-waste-on-the-uk-defence-training-estate/",
    "title": "Reduce, Reuse, Recycle: managing waste on the UK Defence Training Estate",
    "authors": [
        "Penny Arnold"
    ],
    "categories": [
        "Climate Change",
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Landmarc",
        "Sustainability"
    ],
    "pub_date": "2022-10-18T11:44:02+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "A Site Operative at Lydd Waste Sorting Station [Copyright Landmarc Support Services]Recycle Week is back! This year it’s all about ‘getting real’ and providing clarity about recycling. Penny Arnold, a Team Supervisor at Landmarc, explains how waste is managed on the UK Defence Training Estate."
        },
        {
            "heading": 2,
            "text": "Recycle Week in a nutshell"
        },
        {
            "text": "Recycle Week is the nation's biggest annual celebration of recycling, which aims to demonstrate that recycling is worthwhile. Last year over 3,000 businesses and individuals joined the #RecycleWeek conversation."
        },
        {
            "text": "Here at Landmarc, waste management is a hugely important part of what we do – not only is it a contract requirement, but it is legally and morally the right thing to do. Effective waste management will reduce costs, maintain clean workplaces and improve resource efficiency, positively impacting the environment."
        },
        {
            "text": "Recycling and waste management forms a key part of the UK Government’s ambition to bring greenhouse gas emissions in the UK to net zero by 2050. As the infrastructure provider for Defence, DIO is committed to becoming an expert in sustainability, climate change and the environment, and working together with them we can help them reach their targets."
        },
        {
            "heading": 2,
            "text": "Waste management – what it all means"
        },
        {
            "text": "Recycling is a part of waste management. In the year 2021/22, we sent just 2% of our non-construction waste to landfill, with 20% sent to incineration and 78% recycled (which includes recycling, composting and anaerobic digestion). 87% of construction waste in 2021/22 was recycled, with the remaining 13% sent to landfill. This material was asbestos and stop butt waste which has to be managed in this manner due to its hazardous nature."
        },
        {
            "heading": 2,
            "text": "Working with troops to manage waste at Lydd"
        },
        {
            "text": "We manage eight Waste Sorting Stations across the UK Defence Training Estate, and believe me they are busy places."
        },
        {
            "text": "I am based at Lydd and the Waste Sorting Station here manages all the waste generated from Lydd Camp and Hythe, as well as bulky waste and metal from St Martin's Plain Camp. If the accommodation is full, that's waste from 1,600 people!"
        },
        {
            "text": "At Lydd, visiting troops are encouraged to bag their waste in clear plastic bags, including general waste and mixed recycling. These bags are dropped in centralised cages, which our site operatives then routinely collect."
        },
        {
            "text": "Once collected, the bags of waste are taken to the Waste Sorting Station, a dedicated space for managing waste. A site operative will visually check each bag of waste, ensuring there is nothing that shouldn't be there – particularly ordnance, munitions and explosives, which clearly could be exceptionally dangerous. They will also separate out all the recycling, including plastic bottles, cardboard, aluminium cans, etc, ready for separate waste collections."
        },
        {
            "heading": 2,
            "text": "Recycling at home"
        },
        {
            "text": "We’re doing our bit to support waste management and recycling on the training estate, but what can you do at home to help the environment? If you're not sure what you can recycle at home, or if you have some waste you know you can't recycle in your usual council bin, check out Recycle Now's Recycling Locator to find local facilities near you. You might be surprised by what you can recycle!"
        },
        {
            "text": "And remember – although important, recycling shouldn't be your first instinct. You should firstly try to reduce your waste, then try to reuse what you can, and then only recycle what you can’t reuse."
        }
    ]
}