{
    "url": "https://environmentagency.blog.gov.uk/2022/10/18/regulating-a-nuclear-reactor-at-the-end-of-its-life/",
    "title": "Regulating a nuclear reactor at the end of its life",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2022-10-18T15:12:43+00:00",
    "content": [
        {
            "text": "In August Hinkley Point B’s nuclear reactor ‘3’ was switched off after 46 years of energy generation. Victoria Thomas, our Hinkley Point B nuclear regulator, talks about her work at the power station as it moves to the next stage of the nuclear life cycle."
        },
        {
            "text": "The famous NASA mathematician, Katherine Johnson once said, “In maths you’re either right or you’re wrong”. She later went on to say that the certainty was what she loved most about the subject. Shutting down the longest running reactor in the UK is certainly not as “cut and dry”. The delicately balanced decisions to be made today have the potential to affect the environmental impact of the station in the future, as it enters the next stage of its life cycle."
        },
        {
            "text": "Regulating in the seventies"
        },
        {
            "text": "Hinkley Point B power station began generating power in 1976. During its lifetime it provided enough electricity to meet the need of every home in the UK for almost 3 years."
        },
        {
            "text": "When the station was constructed, little thought was given to how the reactors would be decommissioned, which has created challenges now and for the future. There was no ‘Generic Design Assessment (GDA)’, the process we have now where we and the Office for Nuclear Regulation (ONR) scrutinse reactor designs at an early stage. We can identify potential design or technical concerns early on and ask the designer to resolve them ahead of construction."
        },
        {
            "text": "In those days there was also no ‘funded decommissioning plan’ (FDP). Today new nuclear power stations, such as HPC, have a FDP which ensures the developer meets the costs of decommissioning, and managing and disposing of its waste."
        },
        {
            "text": "During the station’s lifespan environmental law and protection has continued to evolve as our scientific knowledge and understanding has progressed. Before 1996 most environmental regulation of Hinkley Point B was carried out by Her Majesty’s Inspectorate of Pollution (HMIP) and its predecessors. The big change to environmental regulation of nuclear power stations came in 1996 with the formation of the Environment Agency."
        },
        {
            "text": "Regulating from the 90s to today"
        },
        {
            "text": "We’ve been regulating Hinkley Point B for 26 years."
        },
        {
            "text": "Operators of nuclear sites must have an environmental permit for radioactive substances activities. EDF’s permit for Hinkley Point B contains strict conditions (rules) that they must follow at all times. We set limits on what they are allowed to release when carrying out certain activities such as disposing of radioactive waste or discharging to air and water into the environment."
        },
        {
            "text": "As well as asking Hinkley Point B to monitor its radioactive discharges and waste, we carry out our own independent monitoring to reassure both ourselves and the public. We publish the results of the monitoring programme in our annual report."
        },
        {
            "text": "I’m at the site six/seven times a year, looking at permit compliance across a range of topics such as solid radioactive waste, radioactive discharges, the environmental monitoring programme, the management and maintenance of key environmental plant and environmental leadership. The golden thread that runs through all the inspections is whether the station is using what is termed the ‘Best Available Techniques’ (BAT)."
        },
        {
            "text": "Here in the UK, unlike many other environmental regulators of nuclear power stations around the world, we apply the concept of BAT. This means the operator must optimise their waste disposals in a way that ensures that both the volume and radioactivity of the discharge or waste produced is minimised."
        },
        {
            "text": "Community engagement is also an important part of my role. I attend and report to the Site Stakeholder Group and respond to general enquiries from the community about our regulation of the site."
        },
        {
            "text": "Regulating in the future"
        },
        {
            "text": "We know there will be a huge culture change at the site as EDF staff move away from generating electricity to the safe removal of fuel. In the background preparations are on-going to hand the station over to the Nuclear Decommissioning Authority (NDA) at the end of defueling."
        },
        {
            "text": "We’ll be continuing our routine regulation at the site, noting the cultural shift. I’ll be looking at how any changes made now could affect decommissioning and optimised waste disposal in the future."
        },
        {
            "text": "The Environment Agency has many years of experience in regulating old Magnox stations through defueling. Many are now in the stages of decommissioning, including Hinkley Point A."
        },
        {
            "text": "Our Hinkley Point team, including regulators from A, B and C, discuss regulation at the different sites. We work alongside other Environment Agency teams who regulate other activities on the site that need a permit such as Large Combustion Plant (LCP) and water discharges."
        },
        {
            "text": "While the regulation of the closure of the nuclear reactor may lack the cut and dry certainty that Katherine Johnson took comfort in - we take reassurance from our previous knowledge, experience, and expertise in regulating and guiding a range of nuclear sites through various stages of their life cycles."
        },
        {
            "text": "As Hinkley Point B closes a final chapter on energy generation - the end of an era, it moves on to the next chapter in its life cycle. It is often said that you can’t move on with a story if you keep re-reading the last chapter, and this will be true in Hinkley’s case. Whist they look back on what the reactor has achieved over the last 46 years, the focus will now be on the safe and environmental optimised removal of the fuel and treatment of wastes."
        },
        {
            "text": "If you’ve got any questions about our work at Hinkley Point B contact us at nuclear@environment-agency.gov.uk"
        }
    ]
}