{
    "url": "https://defrafarming.blog.gov.uk/2022/05/26/6-months-on-how-the-pilot-is-shaping-the-sustainable-farming-incentive/",
    "title": "6 months on: How the pilot is shaping the Sustainable Farming Incentive  ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "environmental land management schemes",
        "Sustainable Farming Incentive pilot"
    ],
    "pub_date": "2022-05-26T17:03:49+01:00",
    "content": [
        {
            "text": "In November, we started to offer agreements to farmers taking part in the Sustainable Farming Incentive pilot.  We now have 873 farmers with agreements in the pilot, helping us to learn and make sure that the scheme works for farmers."
        },
        {
            "text": "In this post, we'll share an overview of the things we’ve learned over the past 6 months and how we’re incorporating them into the design of the full scheme.  "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "The Sustainable Farming Incentive is 1 of 3 new environmental land management schemes. It will pay farmers to take actions that benefit the environment, climate and animal health and welfare, alongside food production.  "
        },
        {
            "text": "The purpose of the Sustainable Farming Incentive is to encourage and enable large numbers of farmers to take actions that, when taken at scale across the whole of the farmed landscape, will really make a different to biodiversity, flood risk management, water quality, air quality, climate change and animal health and welfare.  "
        },
        {
            "text": "It’s about farming with nature, as many farmers are already doing, to produce food in a way that also has wider benefits (rather than choosing between food production and nature). For example, the soils standards being introduced this year will help improve soil health, structure, organic matter and biology - these improvements can also benefit food production. "
        },
        {
            "text": "We’re working to make the scheme as accessible and straightforward as possible for farmers and making sure the actions we’re asking farmers to take make sense for their business as well as benefiting the environment, climate and animal health and welfare. "
        },
        {
            "text": "Many of the actions we will pay for through this scheme will also help improve farm productivity by, for example, improving soil health and resilience, reducing input costs and helping farmers to reduce waste through animal and plant pests, diseases, and poor welfare. It sits alongside Local Nature Recovery and Landscape Recovery."
        },
        {
            "text": "We want to make sure the scheme works in practice in the way we’ve just described, so we invited farmers to test it. "
        },
        {
            "heading": 2,
            "text": "A recap on the pilot "
        },
        {
            "text": "The Sustainable Farming Incentive pilot is built on standards. A standard is a set of land management actions which taken together can result in positive outcomes for the environment, climate and / or animal health and welfare alongside food production.  "
        },
        {
            "text": "There are 8 standards in the pilot: "
        },
        {
            "text": "Our pilot participants are testing these standards over 3 years (until 2024). "
        },
        {
            "text": "What we learn through the pilot is shaping both the full Sustainable Farming Incentive and the other environmental land management schemes.  "
        },
        {
            "text": "In total, we received 938 applications. Of that number, 873 farmers now have pilot agreements. The 59 applications which weren’t taken forward were either unsuitable for the pilot or were withdrawn by applicants.\n"
        },
        {
            "text": "The farmers represent: "
        },
        {
            "text": "To learn as much as possible, we’re looking at every step of the journey so that we make it as easy as possible for farmers to sign up and get paid for the good work they do.  "
        },
        {
            "heading": 2,
            "text": "What we've learned so far and what we’re doing about it  "
        },
        {
            "text": "Farmers are sharing their experiences and opinions on the standards, actions and payment rates through workshops, surveys and interviews. We’ve received direct feedback from farmers and their agents. We have also learnt about the administration and processing of applications and agreements.  "
        },
        {
            "text": "Here's a summary:  "
        },
        {
            "text": "What we heard: The application process took too long.   "
        },
        {
            "text": "What we did: The application process was complex and, in some places, ambiguous or confusing, which meant we had to do a lot of checking and corrections behind the scenes. We’ve simplified the online application system to make it faster and easier for farmers to apply when the full scheme launches in June, to automate some of the checks we need to do and to reduce the scope for errors or misunderstandings  We blogged about our work to improve the applications process."
        },
        {
            "text": " "
        },
        {
            "text": "What we heard: Half our pilot participants said that they would like to apply different ambition levels to a standard across their farm. "
        },
        {
            "text": "What we’re doing about it: this will be a feature of the full scheme when we launch it this year. "
        },
        {
            "text": " "
        },
        {
            "text": "What we heard: Farmers wanted the flexibility to apply over a longer period. "
        },
        {
            "text": "What we’re doing about it: During the pilot, we decided to extend the application window. After reflecting on it further with the help of farmers, we’ve decided that we will launch the full scheme with rolling applications rather than a set deadline for applications, so that farmers can apply and join the scheme whenever they want to during the year. "
        },
        {
            "text": " "
        },
        {
            "text": "What we heard: Farmers said the actions for each standard and guidance needed to be clearer and more practicable on farm. "
        },
        {
            "text": "What we’re doing about it: We’ve dramatically simplified the standards we’re launching with in June. The actions we’ll pay for are clear and self-explanatory. We’ve simplified guidance, too, and separated out mandatory actions from optional 'how to' guidance, making it clear what farmers must do and where there is flexibility. "
        },
        {
            "text": " "
        },
        {
            "text": "What we heard: Farmers wanted us to show how the actions of other schemes (Landscape Recovery and Local Nature Recovery) fit together. "
        },
        {
            "text": "What we’re doing about it: All of our Future Farming activity is brought together under a single service; The Sustainable Farming Incentive is the first part of that – our aim is to create a simple one-stop-shop for all the actions that you can take on your farm. Today, we blogged about the design of our Sustainable Farming Incentive Standards and we will publish another blog post on the Local Nature Recovery Options soon."
        },
        {
            "text": " "
        },
        {
            "text": "What we heard: Almost 90% of farmers in the pilot confirmed that regular payments are the way to go. "
        },
        {
            "text": "What we’re doing about it: We were already confident that paying more frequently would be popular, but part of the point of the pilot is to verify this. Moving to quarterly payments has been a change for Rural Payments Agency, but one that we’ve managed and is going well. All payments have gone out on time and as expected. "
        },
        {
            "text": " "
        },
        {
            "text": "What we heard: Fewer than half of farmers in the entry survey said they were clear on how monitoring and compliance would work. "
        },
        {
            "text": "What we’re doing about it:  We are putting a supportive regime in place: one that encourages and supports conversations between Defra and farmers. Where there is an issue, the response should be proportionate and pragmatic.  Essentially, we believe that if the standards are clear, everyone will benefit. They’ll be easier to understand, and easier to check on both sides. "
        },
        {
            "text": "As we continue to test and improve the scheme, our goal remains the same: we must make sure the simplified standards work for busy farmers and deliver the environmental improvements that we need. "
        },
        {
            "heading": 2,
            "text": "Learn more  "
        },
        {
            "text": "The pilot complements both our co-design and Test and Trials work, which we are also undertaking with help from farmers, practitioners and stakeholders. We’ll blog about our progress, so do subscribe to the blog for the latest.  "
        }
    ]
}