{
    "url": "https://civilservice.blog.gov.uk/2022/05/26/civil-service-live-whats-on-and-what-to-expect/",
    "title": "Civil Service Live: What's on and what to expect",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-26T08:20:38+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Civil Service Live is just around the corner with six dates spanning five cities in June and July 2022. Lorraine McBride’s here with a run-down on what’s on."
        },
        {
            "text": "After two years online, Civil Service Live (CSL) is back with an impressive live bill that promises something for everybody. Over the last year, the Civil Service has been at the heart of the global pandemic, helping to handle the evacuation of civilians when Afghanistan’s government collapsed, and recently, welcomed refugees fleeing the bombardment in Ukraine. The learning and discovery event enables civil servants to get together with colleagues from every grade and background across the organisation. "
        },
        {
            "text": "First class lineup"
        },
        {
            "text": "Event organiser Alexandra Whiteley has curated a first-class lineup of speakers. Topics span everything from mentoring to management, comms, collaboration, comedy and digital data to diversity, with more than 600 content sessions, hundreds of expert speakers, one-to-one mentoring sessions and even a chance to quiz senior leaders during the open sessions. With no shortage of inspirational talks to engage, educate and empower, tickets are being snapped up fast."
        },
        {
            "heading": 3,
            "text": "Edinburgh International Conference Centre - 15 June"
        },
        {
            "text": "The Exchange, 150 Morrison St, Edinburgh, EH3 8EE"
        },
        {
            "text": "Head of the Civil Service Simon Case and Permanent Secretary to the Scottish Government JP Marks top the bill at CSL’s Scottish date, giving the Opening Address providing a progress check on their vision to deliver A Modern Civil Service. In Succeeding Under Challenging Circumstances, you’ll feel inspired listening to the conversation with Anoushe Husain, award-winning paraclimber. "
        },
        {
            "text": "Keen to hone your written skills? Check out How to Improve your Writing (aimed at EOs to Grade 7s) which takes a look at some of the core communication skills you need to write for your audiences, improve the impact of your writing and get the results you need. Elsewhere, you can get your head around the challenges facing national security (Working together to keep the UK safe), gain insight into Delivering Net Zero, or drop in on A Civil Service Fit for the Digital Age."
        },
        {
            "text": "On the bill in the afternoon, the Crown Commercial Service steers you in how to add Power to your Procurement, squeeze every penny from every pound and channel resources where they’re needed most."
        },
        {
            "heading": 3,
            "text": "Winter Gardens, Blackpool - 28 June"
        },
        {
            "text": "97 Church St, Blackpool, FY1 1HL"
        },
        {
            "text": "Civil Service Live moves to the iconic Grade II-listed entertainment mecca on 28 June. If you fancy yourself as a policy pundit, The Armchair Analyst allows you to “choose your own adventure session”. ‘Jen’ has a burning policy issue to solve and needs your help, pronto. In this interactive session, you’ll steer Jen’s journey through the world of government analysis. Where should you start, then what will you do… but which path will you choose - decisions… decisions!"
        },
        {
            "text": "In Leadership That Delivers with headline act Alex Chisholm [right], this taster session will arm you with practical leadership tips debating the skills, knowledge and networks that each of us need to deliver for the country. Succeeding in Challenging Circumstances acknowledges that we all get things wrong sometimes, but the trick is to learn and move forward. Listen to leaders open up as they recall the time something went wrong - and the valuable lessons learned."
        },
        {
            "heading": 3,
            "text": "ExCeL, London - 5-6 July"
        },
        {
            "text": "Royal Victoria Dock, 1 Western Gateway, London E16 1XL"
        },
        {
            "text": "CSL goes out with a bang at London’s ExCeL over two days at the 100-acre exhibition and international convention centre. In Unconference: your agenda, your discussions, you, the delegates, set the agenda and shape the talks."
        },
        {
            "text": "If you fancy a break from the talks, there are 20-minute speed mentoring sessions to give you insight into what a mentoring relationship is all about, and how it just might develop your career. And if you have aspirations to shoot to the very top of the career service, you’ll want to experience first-hand the discussions that go on at Wednesday Morning Colleagues meetings, where you can be a fly on the wall as they gather to discuss key topics affecting government. Tickets have all been snapped up, but fear not! You can watch the recording after the event."
        }
    ]
}