{
    "url": "https://hmlandregistry.blog.gov.uk/2022/05/26/digital-applications-6-months-to-go/",
    "title": "Digital applications – 6 months to go",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services"
    ],
    "categories": [
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2022-05-26T15:05:47+01:00",
    "content": [
        {
            "text": "Six months ago, we told customers we had a year to switch to digital applications. Now at the midway point, we reflect on how far we’ve come in building out our digital application platforms and how customers are responding to the challenge of switching to digital. "
        },
        {
            "heading": 2,
            "text": "What do we mean by switching to digital?"
        },
        {
            "text": "On the HM Land Registry (HMLR) portal, customers can make applications to change the register using the Document Registration Service and uploading a scanned copy of PDF of the AP1 form. This is an electronic copy and can only be reviewed manually by our caseworkers. It acts like paper. "
        },
        {
            "text": "Digital applications, created and submitted either using the HMLR Digital Registration Service or via a case management system that is connected to HMLR, can be automated. Applications are checked for errors prior to submission, and elements of the form can be pre-populated or automated. This makes it easier for customers to submit better quality applications.  "
        },
        {
            "text": "When we receive a digital application we can automate some of the work our caseworkers normally do and process those applications more quickly. Digital effectively makes the whole process quicker and more efficient for all involved. Digital applications submitted via the portal have reduced requisition points for basic errors by 30%. "
        },
        {
            "heading": 2,
            "text": "How many have made the switch to digital?"
        },
        {
            "text": "In April 2021, 64% of applications to change the register were lodged electronically using the Document Registration Service. In April 2022, we saw just 46% of applications coming via that route due to the growth in adoption of the Digital Registration Service and case management systems connected to HMLR. "
        },
        {
            "heading": 2,
            "text": "Electronic uploads will be switched off on 30 November 2022"
        },
        {
            "heading": 2,
            "text": "Is HM Land Registry ready? "
        },
        {
            "text": "HMLR has been accepting digital applications for over 12 years via third parties and customers who have integrated directly to the HMLR API (application programming interface) platform, Business Gateway. "
        },
        {
            "text": "The Digital Registration Service (DRS) was launched in April 2021 to enable customers who use the HMLR portal to create and submit applications digitally. DRS was launched with limited functionality, but has since made big leaps in both the customer experience and the number of application types the service can be used for. More than 2,000 applications come through the DRS door every day and the service now supports the majority of application types. By the summer, 90% of application types will be supported, with just transfers of part and lease applications to be made available ahead of switch off. "
        },
        {
            "heading": 2,
            "text": "Are customers ready? "
        },
        {
            "text": "Over 40% of applications are now digital and the numbers continue to increase week on week. We are speaking to a wide range of customers about their plans. In a recent HMLR survey, 70% of respondents said they had a plan for switching, 20% were still thinking about it and 10% were unaware the switch was coming.  "
        },
        {
            "text": "We will continue to work with customers to make sure they are aware and ready for the changes they will need to make ahead of 30 November.  "
        },
        {
            "text": "We recently held a virtual Digital Showcase event to help customers review their options when it comes to choosing how to create and submit digital applications. Ten suppliers joined the HMLR team to explain the benefits of each service. "
        },
        {
            "text": "We would encourage any customer that currently uses the Document Registration Service for AP1 applications to give the new Digital Registration Service a go now – don’t wait. The service is simple and easy to use. No training is required. Customers can immediately benefit from fewer requisitions and automatic fees calculation. "
        },
        {
            "text": "For more information visit our Digital applications page or get in touch with us at DRS@landregistry.gov.uk."
        }
    ]
}