{
    "url": "https://insolvencyservice.blog.gov.uk/2022/05/26/disqualification-claims-a-judges-view/",
    "title": "Disqualification claims: a judge’s view",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "Disqualification",
        "Investigation and enforcement",
        "Legal services"
    ],
    "pub_date": "2022-05-26T11:52:43+00:00",
    "content": [
        {
            "text": "Professional Support Lawyer, Matt Pope, hosted a learning and development event in our Birmingham office on 19 May 2022 where leading insolvency expert, His Honour Judge Abbas Mithani QC, spoke about disqualifications from a judge’s point of view."
        },
        {
            "text": "Insights into director disqualification"
        },
        {
            "text": " "
        },
        {
            "text": "During 2021/22, 802 directors were disqualified under the Company Directors Disqualification Act 1986 following the investigative and legal work of Insolvency Service officials."
        },
        {
            "text": "Nearly 20% of those disqualifications were secured by court order where officials applied to court and a judge would have considered whether the misconduct alleged justified banning a director from running companies without leave of the court."
        },
        {
            "text": "Matt said that he organised the event for Insolvency Service colleagues so that they could gain an understanding of a judge’s perspective in considering their disqualification cases."
        },
        {
            "text": "“Following the huge success of a similar talk delivered previously by Judge Mithani to insolvency practitioners, we wanted to do something similar for all of the agency’s investigation and enforcement colleagues to build their understanding,” said Matt."
        },
        {
            "text": "“So, when Judge Mithani agreed to give an exclusive talk to the Insolvency Service, we felt very privileged. Not only does Judge Mithani sit as a deputy High Court Judge and is the Designated Civil Judge for Warwickshire and the West Midlands and an expert in disqualification matters, he is also the former general editor – and now contributory editor – to the practitioner work on disqualification entitled Mithani on Director Disqualification.”"
        },
        {
            "text": "Judge Mithani’s talk was titled ‘Disqualification Claims - a Judge’s View’ and speaking in his personal capacity, Judge Mithani delivered an interesting and insightful presentation on many of the latest developments and hot topics in director disqualification."
        },
        {
            "text": "This included allegation formulation, the compensation order regime, misconduct related to bounce back loans and dissolved companies and the effect of recent case law."
        },
        {
            "text": "He also produced a helpful and detailed handout for the Insolvency Service, summarising his personal views on several of the subjects which he spoke about."
        },
        {
            "text": "Question time"
        },
        {
            "text": "“We had around 200 colleagues from across the country attend the talk, virtually and in person, including our Chief Executive, Dean Beale,” said Matt. “Judge Mithani ’s presentation was extremely insightful and thought-provoking, all delivered with his trademark wry humour."
        },
        {
            "text": "“It was pleasing to see so many investigation and enforcement colleagues take the opportunity to enthusiastically put questions to Judge Mithani at the end of the talk, which also demonstrated the depth of knowledge we hold in the Insolvency Service.”"
        },
        {
            "text": "Matt added that attendees were highly complimentary, saying the presentation was really insightful and that they will benefit from what Judge Mithani shared."
        },
        {
            "text": "Judge Mithani said: “It was an absolute pleasure doing the talk, being in the company of so many people who know so much about disqualification and related matters and having the opportunity of discussing so many varying views about the many different issues which arise in such claims”."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}