{
    "url": "https://traderemedies.blog.gov.uk/2022/05/26/enhancing-digital-experience-internal-external-service-users/",
    "title": "How we're working to enhance our digital experience to benefit both internal and external service-users",
    "authors": [
        "Michael Pollitt, Head of Digital & Technology"
    ],
    "categories": [
        "Digital"
    ],
    "pub_date": "2022-05-26T11:51:10+01:00",
    "content": [
        {
            "text": "The Trade Remedies Authority (TRA) is a year old! The organisation behind the TRA however, has been in place for three plus years, as has the technology stack, which was defined a long time before case investigations started. Whilst our current systems are a good standard for government (Cloud supported and no old enterprise system to contend with), the TRA is always looking forward. "
        },
        {
            "text": "The TRA is an arm’s length body of the Department for International Trade and was established to defend UK economic interests against unfair international trade practices. Our work helps to create a level playing-field for UK industries. Businesses can apply for a new trade remedies investigation and view our active cases and reviews on our online platform, the Trade Remedies Service (TRS).  "
        },
        {
            "text": "As the TRA matures, our understanding of case investigation policy and process has matured too. As such, our ambitions have become clearer. "
        },
        {
            "text": "We recognise that whilst the front door to the TRA is already digital, we think being a digital organisation is not just about having a user centric web presence. The essence of being ‘digital’ is broader and spans how we work as an organisation – the environment we create for our people (in the office, at home and on site), the collaborative approach to working, the digital skills we help our people build for their roles now and in the future (wherever they may be employed).  "
        },
        {
            "text": "We’re determined to provide a high-quality experience for users, through digitally enabled delivery. So, we have been asking ourselves some tough questions about how we can achieve this – how do we interact with the world? are we set-up to do our jobs? what tasks are complex and take too much time? – and we have been exploring the answers to help shape our future and to develop a digital vision so that we can support the corporate strategy. "
        },
        {
            "text": "The TRA Digital Vision will be our guiding light, but we also need a strategy and a roadmap to help us achieve that vision. "
        },
        {
            "text": "Parts of the strategy may be bold and new, parts may be fine tuning, but as a young government organisation we need to ensure we seek opportunities to continuously improve our ‘digital’ persona so that we can ensure case work and organisation performance also continues to improve at the pace and scale that it has done so far.  "
        },
        {
            "text": "With the creation of our Digital Vision, we are striving for a high-quality experience for end users, with integrated systems, robust technology, and an improved TRS, our case management platform which is used by case teams and interested parties alike.  "
        },
        {
            "text": "Less traditional, more digital. "
        },
        {
            "text": "We’ll be back soon to reveal our vision, strategy, and roadmap for the next three years. In the meantime, please contact us if you want to know more about our vision for the future. "
        }
    ]
}