{
    "url": "https://defrafarming.blog.gov.uk/2022/05/26/how-we-designed-the-sustainable-farming-incentive-standards/",
    "title": "How we designed the Sustainable Farming Incentive Standards ",
    "authors": [
        "Jonathan Marsden"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Payments to improve soil health",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-05-26T16:47:39+01:00",
    "content": [
        {
            "text": "As a farmer, I am only too aware of the financial pressures which force farmers to make short-term decisions to address an immediate need. This isn’t always ideal for the environment and the sustainability of farming in the longer term.  "
        },
        {
            "text": "The marketplace is very good at driving the efficient production of high-quality grain, meat, milk and vegetables for today and tomorrow, but less so at rewarding high water quality, great soil or increasing the numbers of birds and insects over time.  "
        },
        {
            "text": "In this post, I’ll explain how the Sustainable Farming Incentive will start to redress the balance and how it will reward farmers for delivering environmental benefits as well as efficient food production. "
        },
        {
            "heading": 2,
            "text": "The Standards "
        },
        {
            "text": "The Sustainable Farming Incentive will be based on standards. A standard is a set of land management actions.  "
        },
        {
            "text": "Each standard will reward farmers and land managers for the delivery of a set of environmental goods.  "
        },
        {
            "text": "Eventually there will be between 12 and 15 different standards, and farmers will be able to select as many or as few as they please to suit their farm business. Farmers will also be able to add Local Nature Recovery options on top of their SFI standards, in a combination that works for them. "
        },
        {
            "text": "Each standard will have multiple payment rates that reward farmers and growers for different levels of delivery of environmental goods. "
        },
        {
            "text": "This year we are starting with 3 standards: "
        },
        {
            "text": "The Annual Health and Welfare Review also falls within the Sustainable Farming Incentive. "
        },
        {
            "text": "We plan to introduce the remaining standards between 2023 and 2025. "
        },
        {
            "heading": 2,
            "text": "Timetable for the introduction of standards"
        },
        {
            "text": "Please note, the dates in the following table could change."
        },
        {
            "heading": 2,
            "text": "Why Soils and Moorland in 2022? "
        },
        {
            "text": "We decided to introduce the soils and moorland standards first because they allow the largest number of farmers and land managers to engage early with the new approach, whilst collectively delivering important outcomes, at scale, for soil health, water quality and climate change.  "
        },
        {
            "text": "They are also topics that offer the least overlap with schemes such as Countryside Stewardship and its improved and more ambitious successor, Local Nature Recovery, which enables our existing customers to join the Sustainable Farming Incentive alongside their existing agreements. "
        },
        {
            "text": "Soil is a critical national asset. Healthy, functioning soil means we can ensure profitable food production in the longer term.  "
        },
        {
            "text": "Having healthy soils also maximises the amount of carbon they hold, while poorly managed soils impact water quality. Organic matter is central to improving soil health, but the data indicates that the levels of organic matter in many of our arable soils are now at low levels and at risk of deteriorating further.  "
        },
        {
            "text": "The Sustainable Farming Incentive will reward growers for testing soil for organic matter levels and in the case of arable land, taking steps to increase these levels. "
        },
        {
            "text": "Another key component of soil health for both arable and improved grassland is diversity in cropping. Different crops bring different benefits to the soil. As well as improving soil structure, they can also contribute to improving soil biology. Again, the Sustainable Farming Incentive will reward farmers and growers for including these crops in their cropping plans.  "
        },
        {
            "text": "Having healthy soil is one thing but keeping it in the fields is another. Keeping soil covered by a growing crop is key to preventing soil eroding into our water courses, particularly over the winter months.   "
        },
        {
            "text": "The Sustainable Farming Incentive will reward farmers and growers that ensure there is good ground cover over the critical winter period. In addition to minimising soil erosion, this will also help improve soil heath. "
        },
        {
            "text": "Moorlands can offer a wealth of public goods, ranging from carbon sequestration, flood mitigation, protecting the historic environment and wildlife. They are also important in the stratification of UK sheep industry and many moors also support shooting enterprises. "
        },
        {
            "text": "As we began work on a standard for moorland last year, two issues soon became clear.  First, despite many moorlands being in agri-environment schemes for many years, there remained a considerable disconnect between moorland managers and the environmental objectives. In the past we have been focused on prescribing how a moor should be managed without clearly setting out what success looks like environmentally. Secondly, every moor is different. Each has a unique mix of habitats and growing conditions. Neighbouring moors can have very different stock carrying capacity. A ‘one size fits all’ approach is difficult to justify.  "
        },
        {
            "text": "We identified that at this stage, the most important thing we could do regarding moorland is to help farmers better understand the habitats moorlands contain, their condition and how these relate to the current delivery of public goods.  "
        },
        {
            "text": "This applies equally to those moorlands in existing schemes and those yet to join schemes. It is for this reason that the introductory level of ambition for moorland standard is based on an annual assessment of the moorland. As time moves on, we will introduce additional levels to the SFI moorland standard and options in the Local Nature Recovery scheme that will incentivise delivery of those public goods. "
        },
        {
            "heading": 2,
            "text": "Co-design "
        },
        {
            "text": "In order to meet our ambitious environmental objectives, alongside food production, and make sure our new schemes work for farmers, we need to ensure that the standards we roll out in the Sustainable Farming Incentive work for as many farmers as possible so that they can be rewarded for delivering public goods. This is why our approach to designing standards has been centred around co-design. We have been working with farmers and land managers throughout the standard development process to make sure that the standards are simple to understand, feasible to achieve, and that they address the environmental issues and opportunities that are important to us. "
        },
        {
            "text": "We want to give farmers the opportunity to share their views and help us solve the issues that matter to them most. Joining one of our co-design groups is your chance to get involved. You’ll partner with us and help shape how we’re developing rural policies. This could include attending discussion forums to share your experience with scientists and policy makers or testing new online services (such as applying for a grant). Find out more and sign up. "
        },
        {
            "heading": 2,
            "text": "Update to the guidance "
        },
        {
            "text": "Today (26 May) we updated our guidance on the Sustainable Farming Incentive, ahead of opening for applications this summer. The guidance now includes the scheme terms and conditions, ‘How to’ guides to help farmers deliver actions in the standards, and various other updates to the scheme information published on 30 March. "
        },
        {
            "text": "We recommend that farmers read the guidance to help get ready for the opening of applications this summer. "
        },
        {
            "text": "The scheme information is available for you to read on GOV.UK.  "
        }
    ]
}