{
    "url": "https://dcmslibraries.blog.gov.uk/2022/05/26/joining-up-for-the-jubilee/",
    "title": "Joining up for the Jubilee",
    "authors": [
        "Cheryl Shorter, Libraries Team, DCMS"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-05-26T13:00:38+01:00",
    "content": [
        {
            "text": "Towards the end of last year, DCMS Libraries Team joined up with the Ceremonials Team to consider how to involve libraries in their plans to mark Her Majesty’s Platinum Jubilee."
        },
        {
            "text": "Instead of doing things in isolation, we pitched the idea of joining together  to Libraries Connected, Arts Council England (ACE), The British Library, BBC, BFI, The Reading Agency, The National Archives and the Local Government Association to see if we could collectively make the most out of individual plans to ensure that libraries received plenty of support and were aware of the many exciting opportunities there were to take part in the Platinum Jubilee celebrations. "
        },
        {
            "text": "All stakeholders were very keen on the idea and soon discovered that there was a lot of cross over and potential to support each other.  For DCMS this was a chance to get a really good overview of the different events taking place, and more importantly, how we could encourage libraries to make plans and help bring celebrations to every community.  For each of the partners involved, they made connections that would help them to promote their own events and to offer advice to each other.  The meetings even provided the opportunity to ask for things that might not have been considered otherwise.  This is how we got libraries included in the TV licensing exemption if they wanted to screen the broadcasted events for their users."
        },
        {
            "text": "Communications channels proved really important, with newsletters and online forums promoting funding opportunities and resources to a wider audience.  "
        },
        {
            "text": "There is much on offer to support libraries in celebrating the Jubilee:"
        }
    ]
}