{
    "url": "https://teaching.blog.gov.uk/2022/05/26/national-professional-qualifications-how-npqs-have-transformed-cpd-in-our-multi-academy-trust/",
    "title": "National Professional Qualifications: how NPQs have transformed CPD in our Multi Academy Trust",
    "authors": [
        "Dave Ellison-Lee"
    ],
    "categories": [
        "Professional Development"
    ],
    "pub_date": "2022-05-26T09:56:57+01:00",
    "content": [
        {
            "text": "Dave Ellison-Lee is the Director of Education at RISE multi-academy trust in the East Midlands. He is also a programme facilitator for the new National Professional Qualification in Headship (NPQH)."
        },
        {
            "text": "I’ve been in education a long time and as a Multi Academy Trust (MAT) leader, I’ve worked with a range of schools - from those in crisis to those moving from good to outstanding. This broad experience has been invaluable in my role as a National Professional Qualification (NPQ) programme facilitator."
        },
        {
            "heading": 3,
            "text": "Why do you want teachers and leaders across your MAT to undertake an NPQ?"
        },
        {
            "text": "We take professional development extremely seriously at RISE as we know our staff deserve the best possible opportunities to develop. Not only this, but developing teachers helps to bring out the best in students and their learning."
        },
        {
            "text": "Earlier this academic year, we asked all the schools in our trust to enrol at least one teacher or leader on the NPQ in Leading Teacher Development. We want a network of professionals who can establish a consistent approach to teaching and learning, assessment, and teacher development across our trust. With the introduction of the Early Career Framework (ECF), we saw NPQs as an opportunity to really integrate our CPD."
        },
        {
            "text": "Rather than focusing only on new teachers and their CPD, we wanted to broaden the experience of developing teachers across our workforce – not just those at the outset of their careers. The ECF works alongside NPQs in helping us do that, giving opportunities for experienced teachers to take on the mentorship of early career teachers and develop their leadership skills that way."
        },
        {
            "text": "We also have staff enrolled on other NPQs to deepen their understanding of specialist pedagogy. By introducing greater specialism into our schools, we can raise standards across the different facets of school life, as well as supporting the career aspirations of our staff."
        },
        {
            "text": "These programmes have been designed using the latest evidence and they’re quality assured by experts. It gives trustees confidence that we are investing our time and resources wisely, whilst also helping staff to feel confident that their knowledge and skills are rooted in what works in the classroom."
        },
        {
            "heading": 3,
            "text": "How will NPQs help with continuing professional development planning in your multi academy trust?"
        },
        {
            "text": "NPQs have changed the way we plan our continuing professional development (CPD). The funding designated to the programmes means that more teachers and leaders than ever before can access qualifications. At RISE, we are seizing this opportunity to supplement trust-wide CPD programmes and replace some external programmes which may not be as cost-effective or time-efficient."
        },
        {
            "text": "Critically, having professionals who are engaged in consistent, high-quality development opportunities across the trust accelerates school improvement in joined up way. This join up can sometimes be difficult to achieve when schools are engaged in contrasting professional development opportunities."
        },
        {
            "text": "When working on trust-level CPD, having somebody from each school who has been engaging with the high-quality research that runs through the NPQs enables us to create a shared language and understanding of evidence-led practice."
        },
        {
            "heading": 3,
            "text": "What would you say to potential applicants who are concerned about the workload and resource demands of an NPQ?"
        },
        {
            "text": "One of the great things that we’ve found with the NPQs is their flexible delivery. This CPD works around teachers’ and leaders’ current responsibilities."
        },
        {
            "text": "The revamped assessment also helps with workload management. This is great because we can train highly skilled practitioners without adding substantial pressure to their role. From a school leader perspective, the funding dedicated to the NPQs means that training doesn’t impact budgets hugely as many programmes are being delivered asynchronously and virtually."
        },
        {
            "heading": 3,
            "text": "What is the impact of an NPQ on pupil outcomes?"
        },
        {
            "text": "The research is clear on this one: one of the most effective ways to raise pupil outcomes is through effective teacher professional development. The qualifications allow time for professionals to network with other teachers and leaders around the country to share best practice. It’s a great opportunity for the profession to develop by ensuring research is interwoven in our practice."
        },
        {
            "text": "I truly believe that the new qualifications will have a positive impact on staff development, but most importantly pupil outcomes."
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}