{
    "url": "https://insidehmcts.blog.gov.uk/2022/05/26/new-london-tribunals-building-part-of-uk-wide-property-developments/",
    "title": "New London tribunals building part of UK wide property developments",
    "authors": [
        "Rupert Morgan"
    ],
    "categories": [
        "Court and tribunal reform",
        "Tribunals"
    ],
    "pub_date": "2022-05-26T11:00:00+01:00",
    "content": [
        {
            "text": "Our estate is complex. We occupy a range of different types of buildings, including older and listed buildings which are not always easy to use, so need modernising to make them fit for purpose."
        },
        {
            "text": "When I first joined the organisation in February 2021, after working in the private property sector for 33 years, it was quickly apparent that developing the estate was unlike anything that I had worked on before. I knew that I would need to think carefully about our approach to our buildings to meet the bespoke needs of the justice system.\nOur priority during the pandemic was to keep justice going, but now that we’ve emerged, it’s time to reset our property development plans to make the best use of our existing buildings and open new ones."
        },
        {
            "heading": 2,
            "text": "Our future commitments across the estate"
        },
        {
            "text": "We care about our buildings and the people who use them and over the next decade we’ll be focussed on delivering improvements to the efficiency of our buildings and supporting open justice and resilience. Our work in this area is underpinned by a range of design principles, which we published in our ‘Court and Tribunal Design Guide’ in 2019. This sets out our vision and minimum standards for refurbishing existing sites and building new ones."
        },
        {
            "text": "Alongside better use of data, and what we’ve learned from the pandemic – which emphasised more clearly than ever the importance of having a flexible, accessible and user -friendly court estate – these principles will remain central to our work."
        },
        {
            "text": "We’ll continue to work on reducing the outstanding case backlog through increased capacity and efficiency and deliver a variety of dispute resolution systems and alternatives, helping to build an inclusive and proportionate system."
        },
        {
            "text": "At the heart of everything, we’ll prioritise the safety of our buildings, ensuring they’re fit for purpose to underpin the capacity we need to hear cases."
        },
        {
            "heading": 2,
            "text": "New buildings "
        },
        {
            "text": "In London, an 18-room court building based in the heart of the city on Fleet Street, is expected to open in 2026 and is part of a wider development by the City of London Corporation. The development will also house a new city of London police headquarters and will provide state of the art facilities. It will increase our capacity by 10 extra courtrooms with 8 of those being Crown Court rooms."
        },
        {
            "text": "We’ve also acquired a new building based in Newgate Street, London, just a stone’s throw away from the Central Criminal Court at the Old Bailey. The building is around 110,000 square feet and will be redeveloped into a modern, flexible and efficient tribunal centre. It will provide around 30 hearing rooms that are flexible and capable of hearing a wide range of tribunal case types and we expect it to be operational by the end of 2023."
        },
        {
            "heading": 2,
            "text": "Meeting local needs and going forward"
        },
        {
            "text": "Equally as important are property developments in our regions and we’ve a number in the pipeline. These include the new Medway Civil and Family Court in Gun Wharf, which we’re close to completing. While we complete works, we’re using temporary facilities at the Holiday Inn, to ensure people can access justice in the Medway area. The new court is expected to become operational by the end of this year."
        },
        {
            "text": "We’ve also bought Royalty House in Watford, which is currently being converted for use and when it opens for hearings at the end of 2022, it will provide 8 civil and family rooms."
        },
        {
            "text": "And we’ve acquired a new lease at Endeavour House for tribunals hearings in Dundee, where 2 social security and child support and 2 employment tribunal hearing rooms will become operational during this financial year. Being Scottish, that one is particularly close to my heart!"
        },
        {
            "text": "And more broadly, we’ll continue to play our part in the UK’s commitment of reaching net zero carbon by 2050. We’re already starting to do this by looking to de-carbonise as much of our estate as possible, for example through replacing fossil-fuel heating and increasing our use of solar."
        },
        {
            "text": "I joined HMCTS because I wanted to give something back to public service. If we can achieve these things in my time as HMCTS Property Director and help improve services for the public, it will be one of my proudest moments during many years of working in property."
        },
        {
            "text": "Look out for more updates as we continue to make progress across our estate."
        }
    ]
}