{
    "url": "https://forestrycommission.blog.gov.uk/2022/05/26/right-tree-right-place-to-support-water-and-wildlife/",
    "title": "Right tree, right place, to support water and wildlife",
    "authors": [
        "Michael Rogers"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-05-26T09:41:42+01:00",
    "content": [
        {
            "text": "We all know the multiple benefits trees bring to our landscape. They provide us with oxygen, shade, rainfall interception, ground stability and protection from erosion. They provide habitat for an enormous assortment of wildlife, from birds, bats and small mammals to an incredible array of invertebrates including moths and butterflies."
        },
        {
            "heading": 2,
            "text": "Woodland, water and wildlife"
        },
        {
            "text": "Trees have a major role to play in tackling our climate and biodiversity crises along with other carbon-storing habitats like peatland, fen, bog and floodplain grassland. That’s why The Rivers Trust and our member trusts, are invested in supporting landowners to understand how trees can benefit our watercourses."
        },
        {
            "text": "In Cumbria, managing and reducing flood risk remains a key focus for Eden Rivers Trust – and trees do help reduce flood risk. Rain hits the ground at higher speeds where there is a lack of tree cover, whilst a canopy of leaves, branches and trunks slows down the rain before it hits the ground simply by getting in the way (interception) and slowing its route to the ground and running off into the river. Some of the water will evaporate back into the atmosphere directly from the canopy without ever reaching the ground."
        },
        {
            "text": "Root systems also help water penetrate deeper into the soil at a faster rate under and around trees. This means less surface run-off and more water storage in the soil and that can help slow the flow of water which in turn take the peak off the flood downstream."
        },
        {
            "text": "Woodland cover in the UK is one of the lowest in Europe. One third of all woodland wildlife species are in decline and one in 10 woodland wildlife species are at risk of extinction (Woodland Trust, 2021). We know we need more trees and planting a young sapling, or a whip, is one of the most compelling and satisfying things we can do in the world of conservation land management. But we cannot just plant trees."
        },
        {
            "heading": 2,
            "text": "Planting the right tree, in the right place"
        },
        {
            "text": "Right place – this is key to ensuring time isn’t wasted on planting trees that won’t survive and flourish, and critically, won’t damage other equally important habitats including rare grassland – such as upland hay meadows and floodplain meadows, and carbon storing peatland ecosystems."
        },
        {
            "text": "Peat is formed by dead vegetation that is unable to fully decompose in the waterlogged environment, thereby locking up carbon. Globally, the carbon stored in peat is estimated to be twice that found in forests and whilst both are important, the absence of tree cover from the bog system ensures peat forming sphagnum mosses can thrive. The UK Forestry Standard framework provides further advice on tree planting, urging that new woodland design consider the site’s landscape, suitability, environmental, economic, and social factors."
        },
        {
            "text": "The right species of tree in the right place reduces the chance that pests, diseases, natural disasters and other threats can make a drastic impact on a habitat or area. For example, take the current loss we face from the threat of ash dieback disease: we are set to lose around 80% of ash trees in the UK, and this will have a devastating impact on the landscape and the species that rely on the tree. To mitigate some of the damage, we need to plant (or encourage natural regeneration of) other species of trees not impacted by the disease to replace the role of ash in the ecosystem."
        },
        {
            "text": "They have the potential to sequester carbon throughout their lifetime and can contribute to the ‘natural capital’ assets on a farm. The assets could be a combination of carbon storage, habitat creation and run-off control. The type of tree planted can also benefit in other ways:"
        },
        {
            "text": "And you don’t even have to have a lot of space. Yes, there are grants and incentives out there to plant larger woodlands, but it is also important to plant hedgerows, wood pasture, scrub and give woodland edges more structure. It all helps!"
        },
        {
            "heading": 2,
            "text": "Active management for resilient trees"
        },
        {
            "text": "So why is it so important to plant the right tree, in the right place? Well as we have experienced in the Croglin Valley, not taking care of tree planting before and after can result in massive losses."
        },
        {
            "text": "Over the last 10 years, landowners in the Croglin Valley have entered into various woodland planting schemes. It is hard to estimate the total amount of trees planted, but there have been at least 80,000, possibly many more, and the survival rate has been hampered by several elements."
        },
        {
            "text": "The Woodland Trust carried out a full walkover report on the condition of the tree planting in the valley in 2018/2019. Eden Rivers Trust, through our Slow the Flow funding (Environment Agency) is addressing the priority items that were identified in this report."
        },
        {
            "text": "These were:"
        },
        {
            "text": "If you have recently planted trees, some of the issues found on the fellside in Croglin may be familiar, so here are our tips on how to address them:"
        },
        {
            "text": "Simple, regular maintenance will manage most issues."
        }
    ]
}