{
    "url": "https://teaching.blog.gov.uk/2022/05/26/teachers-your-hard-work-is-so-appreciated-thank-you-for-transforming-childrens-lives/",
    "title": "Teachers, your hard work is so appreciated: thank you for transforming children’s lives!",
    "authors": [
        "Various authors"
    ],
    "categories": [
        "Inspiring teachers"
    ],
    "pub_date": "2022-05-26T09:28:29+01:00",
    "content": [
        {
            "text": "On National Thank a Teacher Day, we’re celebrating education staff for the huge impact they have on students and in society. We are incredibly grateful for the brilliant, dedicated and inspiring teams in our schools all across England. Here are some of our favourite thank you messages from students, parents and colleagues so far."
        },
        {
            "heading": 3,
            "text": "\"You have given him confidence to achieve his full potential when no one else could”"
        },
        {
            "heading": 4,
            "text": "Thank you to Miss Tarry, specialist lead teacher at Thetford Academy Specialist Resource Base in Norfolk"
        },
        {
            "text": "We want to thank you so much for giving Mason the skills to reach his absolute full potential in his secondary education. You have been able to give him the best start to his secondary education by conquering his negativity towards school and in return giving him confidence to achieve to his full potential when no one else could!"
        },
        {
            "text": "You are always at the end of a call or email no matter how big or small and we are truly grateful for all the hard work you do."
        },
        {
            "text": "Gaynor, Mason’s mum"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "“Because you have gone above and beyond to truly understand our daughter’s needs, she is feeling part of something for the first time”"
        },
        {
            "heading": 4,
            "text": "Thank you to Philippa Bourne, Project Manager and former SENCO at Project Alternative Provision in Wiltshire"
        },
        {
            "text": "Thank you for providing the support my daughter needs to be able to access an education. You understand how vital it is for our daughter’s health needs to be understood and supported appropriately, and because of this for the first time in many years she is accessing an education and thriving in every area."
        },
        {
            "text": "Since starting in September, she’s gone from being frightened of being in an educational setting because of previous trauma to absolutely loving it. Because you have gone above and beyond to truly understand our daughter’s needs, she is feeling part of something for the first time and feels she belongs which is important to her."
        },
        {
            "text": "She also has an opportunity to be with her peers while being supported with her social, emotional and mental health. Thank you for building such a beautiful relationship with our young lady. You have been the first professional in her life who she trusts to express how she’s feeling - this is massive and she’s never done it before."
        },
        {
            "text": "There is something truly special about you and our young lady is very in tune with people, so she must pick up on that too. We will never be able to thank you enough for all that you do."
        },
        {
            "text": "Claire, Kaylah’s mum"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "\"You make the children happy when they are feeling down”"
        },
        {
            "heading": 4,
            "text": "Thank you to Mrs Saxby, senior midday supervisor, at Ferndown Middle School in Dorset"
        },
        {
            "text": "Thank you so much for all your hard work and support for both the children and staff over the last 20 years that you have worked at our school."
        },
        {
            "text": "Everyone respects you so much, you are a real hero and without you lunch times would not function."
        },
        {
            "text": "You put in so much effort to give children their Christmas lunch together and organise charity-based events. You give all you have to the children at school and the support you give your staff (even when they have left) is wonderful. You make the children happy when they are feeling down, and you have a real infectious sense of humour."
        },
        {
            "text": "We all love and respect you very much Mrs Saxby. Please don't ever leave as school wouldn't be the same without you."
        },
        {
            "text": "Carlie Faramus and everyone at Ferndown Middle School"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "“Working with you has been an inspiring experience”"
        },
        {
            "heading": 4,
            "text": "Thank you to Mrs Carpenter at Haybridge High School in Worcestershire"
        },
        {
            "text": "Anna,"
        },
        {
            "text": "You are an amazing, passionate educator."
        },
        {
            "text": "Working with you has been an inspiring experience and hopefully we will have many more years to come. No other teacher goes above and beyond like you do and I think the whole school knows what an asset you are. Keep inspiring the students and the staff."
        },
        {
            "text": "Mr Martin"
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}