{
    "url": "https://nationalscreening.blog.gov.uk/2022/05/26/updated-definition-of-targeted-screening-will-help-clarify-remit-of-expanded-uk-nsc/",
    "title": "Updated definition of targeted screening will help clarify remit of expanded UK NSC",
    "authors": [
        "Ania Bobrowska",
        "Farah Seedat"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-26T13:38:58+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has been making evidence-based recommendations on population screening programmes for the past 26 years."
        },
        {
            "text": "The UK NSC’s functions have recently expanded so it can now also actively consider:"
        },
        {
            "text": "Previously, targeted screening topics had been considered by other bodies such as the National Institute for Health and Care Excellence (NICE) and the Scottish Intercollegiate Guidelines Network (SIGN), but not by the UK NSC."
        },
        {
            "text": "But exactly what is targeted screening and how does it differ from population screening?"
        },
        {
            "heading": 2,
            "text": "Literature review findings published"
        },
        {
            "text": "The UK NSC, in collaboration with healthcare consultancy Costello Medical, reviewed the literature to assess existing definitions of targeted screening, population screening and other terms such as selective screening, cascade screening and case finding."
        },
        {
            "text": "The findings have now been published in a paper in the Lancet Regional Health Europe. This work has helped define the committee’s targeted screening remit, but it may also be relevant to screening policymakers worldwide."
        },
        {
            "text": "Comparing various components of health screening, the literature review found that definitions of targeted screening and population screening were clearly distinguished, especially in relation to the eligible population."
        },
        {
            "text": "Both types of screening aim to detect a condition at a stage when treatment can be effective in order to intervene to alter its course. Targeted screening focuses on smaller groups that have a heightened risk of a condition  before screening. Population screening focuses on large demographically defined populations with a generally low level of risk."
        },
        {
            "text": "Such comparisons contributed to the literature review describing targeted screening as ‘A systematic process in which testing, of variable speed and frequency, is offered in community-based settings for the purpose of risk refinement, to individuals in groups defined by above average risk but who are apparently healthy, asymptomatic or unaware with respect to the condition being screened for. The aim of this is to improve health outcomes’."
        },
        {
            "text": "This work has informed the development of the following UK NSC definition of targeted screening."
        },
        {
            "text": "The literature review found that any distinction between targeted screening and the other screening terms was less obvious. Targeted and selective screening were found to be interchangeable. Cascade screening, while conceptually similar to targeted screening, was a term only used within the context of genetic diseases."
        },
        {
            "text": "The considerable overlap between definitions implies that a very broad range of disease areas may fall under the expanded remit of the new UK NSC, including genetic conditions, infectious diseases and cancers."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "Hopefully this blog article has given you a flavour of work the new group will be getting involved in and we’ll be sure to keep you updated on progress. You can register to receive updates direct to your inbox whenever we publish a new article. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC."
        }
    ]
}