{
    "url": "https://hodigital.blog.gov.uk/2022/05/26/want-to-manage-exciting-tech-projects-our-graduate-dynamic-development-scheme-opens-soon/",
    "title": "Want to manage exciting tech projects? Our graduate Dynamic Development Scheme opens soon",
    "authors": [
        "Prathaphan Sivakumar, DDS Project Support Officer Associate"
    ],
    "categories": [
        "Graduates",
        "Recruitment"
    ],
    "pub_date": "2022-05-26T10:06:31+01:00",
    "content": [
        {
            "text": "The Dynamic Development Scheme (DDS) is an exciting two-year rotational programme for graduates with a minimum 2.2 degree in any subject who are passionate about working in Digital, Data and Technology (DDaT)."
        },
        {
            "text": "During your first year you will complete six-month placements supporting DDaT projects working within DDaT multidisciplinary teams."
        },
        {
            "text": "In the second year you will complete a 12-month placement and choose a preferred specialism from five options. You will also have a great opportunity to develop and broaden your skills and undertake specialist training."
        },
        {
            "text": "You will form part of a diverse and supportive graduate network, with mentors to help support you shape your career."
        },
        {
            "text": "Our Associates on the scheme receive a competitive starting salary (£35,054) London, (£30,817) National."
        },
        {
            "text": "Prath tells us about his experiences as a Project Support Officer on the scheme."
        },
        {
            "text": "Tell us how you came to join the Civil Service on the DDS? "
        },
        {
            "text": "Hello, I’m Prath Sivakumar! I’m so grateful for the opportunity to join the DDS – it has really exceeded my expectations! I initially applied for the Civil Service graduate fast stream but unfortunately didn’t make it through. However, my assessment centre scores were high enough to allow me to join the Direct Appointment Scheme which led to the Home Office DDS."
        },
        {
            "text": "What appealed to you about the DDS compared to other pathways into tech?"
        },
        {
            "text": "A huge bonus of this scheme is the variety of roles and tech areas you work in. Rather than sticking to just one role over two years like other schemes, here you rotate through a variety of different roles such as data analysis and delivery management."
        },
        {
            "text": "The roles are so different and, due to the choice available, you really can develop a huge variety of skills."
        },
        {
            "text": "The focus on development on the DDS is unparalleled. I’ve already had the opportunity to take exams and acquire multiple professional accreditations."
        },
        {
            "text": "You were an accountant in a previous job – why did you change course to tech? "
        },
        {
            "text": "I soon realised that the accounting profession wasn’t for me as I found the role quite repetitive and slightly tedious. I wanted to work in an environment that was constantly changing, and tech delivers that."
        },
        {
            "text": "The breadth of opportunities within tech are so vast that you’re always learning new skills and experiencing different technologies."
        },
        {
            "text": "Tell us what it’s like on the job as a Project Support Officer"
        },
        {
            "text": "Every morning the team has a ‘daily stand-up’ meeting to discuss priorities and decide what meetings we’ll attend in our roles as Project Support Officers (PSOs)."
        },
        {
            "text": "With guidance from my placement manager I’ll create project documentation, such as PowerPoint presentations and reports, that help a team move a project through to completion. This involves ongoing engagement with relevant stakeholders."
        },
        {
            "text": "Any updates I make to the documentation are peer reviewed and in this way I learn different project and management techniques."
        },
        {
            "text": "What support do you enjoy on the DDS? "
        },
        {
            "text": "I couldn’t ask for a better support system. It’s been so good having such a large cohort within DDS who are all going through a similar experience. We’re able to share our work and experiences and learn from that process."
        },
        {
            "text": "My managers help ensure that my placements contribute toward my career development and they encourage me to stretch myself by leading and managing projects."
        },
        {
            "text": "Do you have a good work-life balance on the DDS?"
        },
        {
            "text": "I’ve been impressed with how we’re encouraged to maintain a healthy work-life balance on the DDS. You can manage your hours so that you get the job done and still enjoy life outside of work."
        },
        {
            "text": " "
        }
    ]
}