{
    "url": "https://grantscommunity.blog.gov.uk/2022/05/26/whats-happened-in-the-last-week-there-is-a-new-alert-on-find-a-grant-to-help/",
    "title": "What’s happened in the last week? There is a new alert on Find a Grant to help",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Accessibility",
        "Civil Service",
        "Digital transformation",
        "Government Grants Management Function",
        "Grants Applicant Programme",
        "New Release"
    ],
    "pub_date": "2022-05-26T13:00:09+01:00",
    "content": [
        {
            "text": "Find a Grant has been up and running on GOV.UK for a month now and the response has been overwhelming. "
        },
        {
            "text": "So far, this month, over 3,380 people have visited the site with over 70 people going on to click ‘apply’. We have also now reached over 660 people in the Government Grants Community with over 530 wanting to actively support us to co-create the new pilot service - which has been going on in the background. "
        },
        {
            "text": "We have also been collecting up the feedback that we have received since we went live on 12 April via all the different ways you can let us know what you think. "
        },
        {
            "text": "There have been so many suggestions and thoughts about how to improve and enhance the service further - which is brilliant. We are working our way through the ideas to see which ones we can take forward and test out between now and March 2023.  "
        },
        {
            "text": "There were some that we have been able to put into action now. So today we have released our first upgrade to our Beta Find a Grant. "
        },
        {
            "heading": 2,
            "text": "What's new?"
        },
        {
            "heading": 2,
            "text": "What else have we been up to?"
        },
        {
            "text": "Well, as usual we have been busy bees in the Grants Applicant Programme looking at the next big upgrade - how we add an integrated ‘Apply for a Grant’ service on to Find a Grant.  This might sound straightforward but - oh my word - it really isn’t. "
        },
        {
            "text": "So far we have ten BIG things on our wish list. Over the weeks and months ahead, with our 660-strong Government Grants Community, we will see if we can make some or all of these a reality. "
        },
        {
            "heading": 2,
            "text": "Ten months and ten focus areas"
        },
        {
            "text": "In no particular order, our top ten areas of focus over the next ten months, to address the problem areas raised during our discovery work, are: "
        },
        {
            "text": "We are definitely up for the challenge  - particularly if we keep getting the feedback and encouragement that creating a single, online place to find and apply for all government grants is the way to go for applicants, administrators and taxpayers. "
        },
        {
            "text": "Let us know what you think. "
        },
        {
            "text": " "
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Applicant Programme"
        }
    ]
}