{
    "url": "https://despatch.blog.gov.uk/2022/09/27/dvsa-rider-policy-specialist-talks-about-the-enhanced-rider-scheme/",
    "title": "DVSA rider policy specialist talks about the Enhanced Rider Scheme",
    "authors": [
        "jodywhitfield"
    ],
    "categories": [
        "Learning to ride",
        "Motorcycle test",
        "Motorcycle trainers",
        "Resources for instructors"
    ],
    "pub_date": "2022-09-27T15:38:58+01:00",
    "content": [
        {
            "text": "As part of our commitment to a lifetime of safe riding, we’re always looking for ways to get more motorbike riders through some sort of advanced rider training. Over the last couple of years, we’ve had a real success story evolve in Wales with our own Enhanced Rider Scheme (ERS). "
        },
        {
            "text": "The Enhanced Rider Scheme is designed for many types of rider. Whether they want to brush up after some time off the bike, or whether they’ve just passed their test and want progress safely and quickly, or are moving up to a bigger bike. It’s also designed for specific riders such as blood delivery riders, or other professional riders. There are seven core modules and an increasing number of optional modules, specialising in such things as alternative environments, like off road or race tracks. "
        },
        {
            "text": "During the first lockdown in 2020, we were contacted by a motorbike trainer In Swansea who wanted to provide more ERS courses in the local area. Russ Widlake from the Motorcycle Academy in Swansea pitched a course to us that would enable the trainers employed by him and his business partner, Adrian Davies, to deliver ERS to local riders.  "
        },
        {
            "text": "The course aimed to bring competent riders (many of whom were professional riders such as police) up to the standard to enable them to teach the ERS standard without having been a DAS (Direct Access Scheme) or CBT (Compulsory Basic Training) instructor before. We gave him a bit of feedback on the course, and he made the changes. "
        },
        {
            "text": "Given the restrictions COVID had placed on the country, we travelled over to Swansea as soon as lockdown had finished. It was impressive to see that Russ had taken our bit of feedback on board, and we witnessed him deliver the course to a high standard. "
        },
        {
            "text": "Russ Widlake said:"
        },
        {
            "text": "“Working with both DVSA and Powys has enabled us to provide some high quality training to motorcyclists, making them more skilled, and safer riders."
        },
        {
            "text": "“To be able to tailor the training to the type of riding done by our clients is great, it means they get the training they want and need, whether they’re a pro rider or just enjoy to ride the mountain roads of Powys and beyond”."
        },
        {
            "text": "Russ had done his research, with his links to the emergency services, he collected anecdotal accounts of injured riders. He recognised a theme that riders involved in an accident were often riding in a group, so he designed a new ERS module about how to ride in a group or on a tour. "
        },
        {
            "text": "To top it off, Powys County Council, as part of their bid to reduce casualties in their area, are now offering riders free places on the ERS course with Russ and Adrian. This is great news, for anyone that knows: some of the best riding in Britain is to be found in Powys, which stretches from the valleys on the edge of Swansea, through the Brecon Beacons and up through the mountains of Mid Wales to the edge of Snowdonia.   "
        },
        {
            "text": "Cllr Jackie Charlton, Powys County Council Cabinet Member for a Greener Powys said: "
        },
        {
            "text": "\"Keeping Powys roads safe is paramount. We appreciate that our large, expansive county, with its network of picturesque roads is a mecca for motorcyclists. Which is why we not only offer this free course to all riders living in Powys, but also to all riders who use Powys' roads, regardless of where they live. Tourism plays an important role in the local economy of our beautiful and attractive county, and we welcome careful drivers and riders. However, when you get on your bike you need to be aware of the individual responsibility of your actions and consider road safety for yourself and others, please remember to drive respectfully and stay safe whilst enjoying Powys’ scenic roads. "
        },
        {
            "text": "\"We are lucky to have an experienced team of road safety officers within Powys County Council who work with trainers on many schemes and projects, including offering these weekend courses for motorcyclists wishing to improve their riding skills.\" "
        },
        {
            "text": "The work we’ve been doing with Russ, Adrian and Powys has seen the number of ERS riders increase significantly in Wales. Roughly a third of riders who have completed the ERS course across Britain since its relaunch in 2018 have either taken it in Wales or come from Wales. This is a huge win for road safety in Wales. In fact, it is not just Powys Council who have been supportive of the scheme: Dragon Rider Cymru, funded through other local authorities including, Carmarthenshire County Council, Neath Port Talbot, Pembrokeshire and Swansea play a large part in getting riders the advanced training also."
        },
        {
            "text": "This is just one success story, but there are ERS trainers across Britain. If you’re a rider looking to learn more skills and become safer, you can find trainers on gov.uk. "
        },
        {
            "text": "If you’re a trainer or school owner, you can find more about what’s involved in becoming an ERS trainer also. "
        }
    ]
}