{
    "url": "https://disabilityunit.blog.gov.uk/2022/09/27/harrys-story-how-autsome-ideas-are-bettering-our-world/",
    "title": "Harry's story: How Autsome ideas are bettering our world",
    "authors": [
        "Disability Unit",
        "Harry, Autsome Advocate"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-09-27T14:29:35+01:00",
    "content": [
        {
            "text": "Harry is an Autsome Advocate. The advocates are a great bunch of neurodiverse children and young people based in North East Essex who give their views on health, education and social issues which affect their daily lives of autistic children and young people. They meet once a month, for often vibrant and straight-talking discussions to help make products and services better for all."
        },
        {
            "text": "Autsome Advocates was made possible by generous funding from North East Essex Clinical Commissioning Group (CCG) as ​​Autism Anglia North East Essex Advocacy Service felt it was important to have stakeholder views and influence."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "A bit about me"
        },
        {
            "text": "My name is Harry and I'm 22 years old. I have autism and other conditions. I have attended a special needs school from the age of 11 and while I was there I discovered football. I'd never had anyone to play with before as I'd never been included in football clubs at school. It was a challenge to get into the right school, I spent much of my time feeling excluded socially and from society, so I'm very passionate about inclusion."
        },
        {
            "text": "I went on to play for Ipswich Town Football Clubs disability team and trialled for the England learning disability team. I started coaching football a few years ago with the multi-schools council and love it."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Creating change with Autsome Advocates"
        },
        {
            "text": "She recently managed to attend an Autism Anglia and CCG autism friendly vaccination session in order to have her COVID-19 vaccine. She had been frightened for months even thinking about it but she managed for the first time in years to have a vaccine because of the relaxed and supportive staff and atmosphere. This made me think about other vaccines for autistic children, and in particular, the Human papillomavirus (HPV) vaccine which my sister is due this year."
        },
        {
            "text": "Harry's sister Lily at the vaccination centre."
        },
        {
            "text": "I'm so pleased that the CCG have decided to take this idea forward and provide more autistic friendly vaccine sessions, not just for HPV but also other vaccinations going forward. These autistic friendly sessions included making someone with autism feel safe and understood is so important, working at the autistic person's pace and supporting them through. Also, the use of sensory items helps people feel calmer in an environment that doesn't have bright lights or lots of people."
        },
        {
            "heading": 2,
            "text": "The impact of Autsome Advocates"
        },
        {
            "text": "We spoke to two organisations who have benefited from working with the Autsome Advocates."
        },
        {
            "text": "Wendy Burt, Co-ordinator at Essex Family Carers Network, recently attended a meeting with Essex County Council Commissioners and the advocates."
        },
        {
            "text": "She said: “We really wanted to show that thinking differently and asking young autistic people what good should look like is a much better way at looking at what work needs to be done to make sure autistic people have great opportunities to have good lives."
        },
        {
            "text": "It was wonderful to see the confidence these young people had feeling able to speak up in a meeting. I really hope we can make sure that their voices continue to be there every step of the way for any future work.”"
        },
        {
            "text": "Elizabeth Moloney, who leads the Suffolk and North East Essex Integrated Care System’s Vaccination Programmes and is Deputy Director of Strategic Change at Suffolk and North East Essex CCGs, said:"
        },
        {
            "text": "“I’m delighted we’ve been able to respond to the need for autism-friendly vaccination sessions in quieter settings, away from the general hustle and bustle of larger sites which can be very frightening for people with neurodevelopmental conditions."
        },
        {
            "text": "“Vaccination remains our best defence, not only against COVID-19, but against other viruses and, in the case of the HPV jab, even cancer.”"
        },
        {
            "text": "“It’s vital we ensure that access to vaccines is open to all, whatever their needs may be, and we look forward to welcoming more people into these special sessions so they can get the protection they need.”"
        },
        {
            "text": "“It is great to support Harry and the Autsome Advocates like this.”"
        },
        {
            "text": " "
        },
        {
            "text": "The Disability Unit is always interested to hear about work underway across to the regions to make their local area accessible for all. Please get in touch if you are interested in sharing your story or experience."
        }
    ]
}