{
    "url": "https://nda.blog.gov.uk/national-inclusion-week-how-were-making-sellafield-ltd-more-inclusive/",
    "title": "National Inclusion Week – how we’re making Sellafield Ltd more inclusive",
    "authors": [
        "Emma Law - Head of Corporate Communications at Sellafield Ltd"
    ],
    "categories": [
        "diversity",
        "Mission delivery",
        "Safety and Wellbeing",
        "Skills"
    ],
    "pub_date": "2022-09-27T08:43:34+01:00",
    "content": [
        {
            "text": "Employees who feel able to bring their whole selves to work, better business decisions thanks to diversity of thinking, and a business better able to attract and retain talent for the long term… just some of the benefits of a more inclusive workplace."
        },
        {
            "text": "As we celebrate the start of National Inclusion Week, here are some of the ways that we’re working to make Sellafield Ltd more inclusive and some of the people who are driving the change."
        },
        {
            "heading": 3,
            "text": "We’re making sure that our definition of inclusion is inclusive – Warren Underwood"
        },
        {
            "text": "The idea of inclusion may bring to mind specific groups of people, demographics or communities. That might include ethnic minorities or people with visible disabilities. We’re working hard in these areas but we’re also trying to ensure that our view of inclusivity is truly inclusive."
        },
        {
            "text": "Being a truly inclusive organisation means that everyone feels able to bring their whole selves to work, and that they feel supported in whatever ways are important to them."
        },
        {
            "text": "It means considering things like how we can support people with invisible disabilities, and I am delighted to see that the latest of our employee networks, the Deafness, Hearing Loss and Tinnitus Network is doing just that."
        },
        {
            "text": "I only recently joined Sellafield Ltd but am already impressed by both the progress being made and the commitment to doing more. As executive sponsor in this area I will do all I can to work with our employee-led networks and others to help drive that continual improvement."
        },
        {
            "heading": 3,
            "text": " We are clear on the undeniable benefits of inclusion for our employees – Terri Hargreaves"
        },
        {
            "text": "As part of the diversity and inclusion team I’ve seen first-hand the difference that feeling included can have on people at work."
        },
        {
            "text": "Whether you work part-time or full-time, you spend a significant percentage of your life at work. It’s so important that the workplace – wherever that is – feels psychologically safe and physically supportive and inclusive."
        },
        {
            "text": "As employees, we all want to feel that we can make best use of our skills and experience, that all of the different elements that make up ‘you’ are not only welcome but actively sought out."
        },
        {
            "text": "That means creating what we call a psychologically safe space. Where people feel like not only the business but also their colleagues want them to bring their whole selves to work."
        },
        {
            "text": "At Sellafield Ltd we’re doing that by promoting and making the most of our Reasonable Adjustment Passports so that we can identify the barriers individuals face and take reasonable steps to remove them."
        },
        {
            "text": "We also encourage everyone to be part of our employee-led networks including as allies to help create and continue the conversations that make a difference."
        },
        {
            "text": "Celebrating success is an important part of creating a space where people feel included. We highlight and celebrate the things that make us the same, such as being nuclear professionals, as well as recognising the diversity and differences that give us a wealth of combined experiences from which we all benefit."
        },
        {
            "heading": 3,
            "text": "We also understand that there are clear business benefits of being more inclusive – Warren Underwood"
        },
        {
            "text": "We know that an inclusive and diverse culture is a key part of what potential employees are looking for when deciding which business to work for, and what current employees need to see in order to stay."
        },
        {
            "text": "But employee retention and attraction are just two of the business benefits of creating a more inclusive workplace."
        },
        {
            "text": "People who feel included, respected, and able to work at their best are also more productive, contribute to an improved safety performance, and to be engaged and proud of their work and our collective purpose."
        },
        {
            "text": "It’s also true to say that inclusion needs to be constant, it isn’t something that you can work on, bank, and then move on to the next topic. It is a daily effort. That’s why, for Sellafield Ltd, we know there is always more that we can do, and when there are such clear benefits for both our employees and business, why wouldn’t we?"
        },
        {
            "heading": 3,
            "text": " We’re taking action at a business level – Alan Rankin"
        },
        {
            "text": "The theme of this year’s National Inclusion Week - ‘Time to Act: The Power of Now’ – reflects the need to turn commitment to the theme of inclusion into tangible actions that create a more inclusive workplace."
        },
        {
            "text": "I am proud to work for a business that is mature enough to recognise that it needs to be more inclusive, that puts ownership of the issue at the very top of the organisation, and that also empowers employees to make changes and to be the difference."
        },
        {
            "text": "In the last year alone the tangible actions at Sellafield Ltd have included us setting very clear expectations for all employees through business wide diversity and inclusion training."
        },
        {
            "text": "These clear standards and expectations set out the kind of business that we want to be, and how we expect people to treat each other."
        },
        {
            "text": "Where standards aren’t met, or where situations need to be resolved we have streamlined what we call our ‘people processes’. These are simply the systems, processes and support that employees can use to resolve situations quickly and we know that to work they need to be simple and easy to access. The information about each of them is available to every employee as we know that openness is an important part of creating a psychologically safe environment."
        },
        {
            "text": "Our ambition, of course, is to have a workplace where those systems are never needed, and that’s what we will continue to strive for."
        },
        {
            "heading": 3,
            "text": "Our employees are empowered to help drive the change – Sadia Samas"
        },
        {
            "text": "There is an expectation that the employer to create an inclusive workplace, but I feel like it is the responsibility of all employees to make inclusivity a reality. There are some changes that can only be delivered at a business level, but everyone has a role to play."
        },
        {
            "text": "As part of one of Sellafield Ltd’s employee networks, groups of people who join together to support colleagues who are facing similar challenges and who help the business to implement changes and improvements that will help with those challenges."
        },
        {
            "text": "In my case I am part of the Black Asian and Minority Ethnic network, but the networks cover a wide range of topics:"
        },
        {
            "text": "It is the people who are closest to the issues, whether that experience is first-hand or not, who are usually best placed to give advice to colleagues about the help that is already available, or to advise the business on what further help would make a difference."
        },
        {
            "text": "Sometimes that means we flag things that we think the business should do, but more often it is a case of us asking for the business to support an idea that we want to deliver ourselves."
        },
        {
            "text": "For us in the BAME network last year, that meant asking the business to support us in our campaign to educate employees about becoming an ally, what they meant and how they could do it."
        },
        {
            "text": "It wasn’t something that we wanted the business to do for us, we just needed some help. Together we produced the video below and the result is more people approaching our group to become allies."
        },
        {
            "text": "We want to start, and continue, the conversations about these issues. By connecting with others and talking about issues, we can include everyone."
        }
    ]
}