{
    "url": "https://civilservice.blog.gov.uk/2022/09/27/nearly-10-million-people-tuned-into-a-map-of-a-queue/",
    "title": "Nearly 10 million people tuned into a map of a queue!",
    "authors": [
        "Andrew Simpson"
    ],
    "categories": [
        "A great place to work",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-09-27T13:54:37+00:00",
    "content": [
        {
            "text": "As Head of Digital Communications at the Department for Digital, Culture, Media and Sport (DCMS), Andrew Simpson’s team came up with the livestream funeral queue tracker that drew almost 10 million views on YouTube. Interview: Lorraine McBride"
        },
        {
            "text": "In a world of 24/7 news, it seems so British that millions of people were fascinated by a map showing people in a queue and estimated waiting times. Was there a eureka moment or has the tech been used before? "
        },
        {
            "text": "We had the idea for some time to provide real-time updates for the Lying-in-State queue. But what we didn't have was a single solution - despite speaking to lots of map providers. The result is a combination of a few tools - that's why it worked so well. "
        },
        {
            "text": "First, we bashed around how to capture rolling location data into a single source, with input from a provider who'd helped with the Platinum Jubilee map and created the map engine that drove the tracker. We then combined this with the approach we take to livestreaming Remembrance Sunday every year on social media, which we know works via YouTube and other social media platforms. The map is key, but being able to host and share it as a live broadcast for days on end is what made it so useful."
        },
        {
            "text": "The queue tracker was a brainwave that helped millions see the sheer scale of it. How does it feel to play a part in the biggest funeral for centuries?"
        },
        {
            "text": "Our stats show it was viewed by 9.4 million people, which is incredible. 'QueueTube' became a handy go-to tool for the media and public, and overnight became a viral news story in its own right. All the team is hugely proud of what we achieved, and went above and beyond to ensure we could maintain 24/7 coverage from the moment Lying-in-State opened. Seeing it being broadcast at regular intervals on BBC and Sky News was a truly humbling 'pinch me' moment for the team."
        },
        {
            "text": "Was your whole team constantly inputting reams of info to update it, or did it update automatically?"
        },
        {
            "text": "The data input was simple, it just required an amazing team of digital volunteers at the back of the queue to update and save their location (once checked for accuracy) - literally two taps on a smartphone. The rest was initially inputted manually but over the course of its 4.5-day life, we were constantly iterating in the background. By the end, almost all of it was automated just from saving your location (including the weather!)"
        },
        {
            "text": "Any plans to use the same tech for anything else?"
        },
        {
            "text": "While we don't have any long queues looming, lots of lessons learnt will be applied to future events and projects, and we'll ensure we share this across government. We livestream Remembrance Sunday every year and we'll certainly be looking how we can give audiences far and wide an even more immersive experience."
        },
        {
            "text": "What's your abiding memory of your royal funeral involvement?"
        },
        {
            "text": "Working with such a talented and motivated team. Seeing how committed everyone remained throughout to serve the public, despite long hours and little sleep, was testament to their determination."
        },
        {
            "text": "As work achievements go, how will you ever top it?"
        },
        {
            "text": "I've worked on a few large-scale projects focused on providing the public with a quality service and experience - including the Platinum Jubilee and Commonwealth Games, each of which were career highlights, so it's been quite a year. Let's not forget there will be a Coronation to prepare for. So we have plenty to focus on and learn from going forward."
        },
        {
            "text": "Did you know…"
        },
        {
            "text": "If you added the cumulative total time people spent watching the live tracker, it comes to 94 years!"
        }
    ]
}