{
    "url": "https://insidedvla.blog.gov.uk/2022/09/27/new-law-change-allows-more-flexibility-for-healthcare-professionals-completing-dvla-medical-questionnaires/",
    "title": "New law change allows more flexibility for healthcare professionals completing DVLA medical questionnaires",
    "authors": [
        "Dr Nick Jenkins"
    ],
    "categories": [
        "Driver licensing",
        "Drivers medical",
        "Features"
    ],
    "pub_date": "2022-09-27T14:56:37+01:00",
    "content": [
        {
            "text": "Since I last spoke to you, asking for your views on our proposals to widen the pool of medical healthcare professionals who may complete our medical questionnaires, I'm delighted to share that our work with you enabled a change in the law to widen the pool of medical professionals who can now complete DVLA medical questionnaires following a referral from a doctor."
        },
        {
            "text": "The consultation showed 82% of those surveyed, were supportive of this approach to improve and speed up the medical licensing process."
        },
        {
            "text": "These changes came into force in July this year."
        },
        {
            "text": "The amendment to the Road Traffic Act 1988 means more healthcare professionals for example, clinical nurse specialists, physiotherapists and optometrists can now fill in DVLA questionnaires."
        },
        {
            "text": "This change does not apply to the D4 Medical Examination Report which will still need to be filled in by a doctor who is registered with the GMC."
        },
        {
            "heading": 2,
            "text": "Why has it changed?"
        },
        {
            "text": "In some instances we need to contact you when we’re told about a medical condition which might affect someone’s driving, and we use the information to decide what action we need to take. This can sometimes be very time consuming and we’re very much aware of the need for GP practices and hospital teams to prioritise and manage their resources."
        },
        {
            "text": "Until recently, only doctors registered with the General Medical Council (GMC) were allowed by law to fill in the questionnaires. This change now means healthcare professionals from the following councils can also fill in our medical questionnaires:"
        },
        {
            "text": "We’ll continue to send the medical questionnaires to the GPs or hospital doctors in charge of care, but they can now pass the questionnaire to the most appropriate medical professional for completion."
        },
        {
            "heading": 2,
            "text": "Benefits"
        },
        {
            "text": "Reducing the burden on doctors and healthcare professionals is important to us:"
        },
        {
            "text": "We also believe it’s essential that the hard work and expertise contributed by all professionals involved is acknowledged and reflected in the information that DVLA uses when considering applications."
        },
        {
            "text": "For drivers, most importantly, the information we receive can be provided by the most appropriate healthcare professional who knows best how a medical condition affects the applicant. By spreading the work across a wider range of healthcare professionals, it’s likely the information will be returned to DVLA quicker, allowing us to make decisions about their case sooner."
        },
        {
            "text": "We recognise that individual GP surgeries and hospital teams work very differently, and this law change also allows them as much flexibility as possible to manage the enquiries they receive from us."
        },
        {
            "text": "Ultimately, the aim of the change is to enable the most appropriate healthcare professional to provide the information they have. In some cases, this will remain with the doctor, but in other cases GP surgeries and hospital teams will be able to change their current practice and allow a different healthcare professional to provide the information, where possible. We believe that this change will benefit not only driving licence applicants for the reasons above but will help to reduce the administrative burdens on doctors, freeing up time to allow them to focus on patient care."
        },
        {
            "heading": 2,
            "text": "What we’ve done"
        },
        {
            "text": "We’ve made changes to our letters and forms and updated our medical questionnaires on GOV.UK. We’ve also shared our updated advice and guidance and the process to follow with the healthcare community."
        },
        {
            "text": "A dedicated monitoring process has been set up to make sure there is a continuous improvement of the service."
        },
        {
            "text": "All drivers must meet the medical standards for fitness to drive at all times, and we need to carry out more checks for bus or lorry drivers."
        }
    ]
}