{
    "url": "https://rpc.blog.gov.uk/2022/09/27/regulatory-policy-committee-issues-2022-corporate-report/",
    "title": "Regulatory Policy Committee issues 2022 Corporate Report",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2022-09-27T13:20:12+01:00",
    "content": [
        {
            "text": "We have today published our 2022 Corporate Report which summarises the RPC’s activities and performance over the year to March 2022."
        },
        {
            "text": "In the period covered by the report, the RPC received 122 submissions from over 23 different departments, agencies and public bodies. This is a significant increase from 2020-21 and reverses the previous decline, reflecting an upturn in government regulatory activity. Based on analysis of these opinions, we highlight below areas that have generally been undertaken well and those where there remains room for improvement."
        },
        {
            "heading": 2,
            "text": "Pre-consultation stage IAs – as a policy is developed"
        },
        {
            "text": "Pre-consultation stage IAs are submitted to the RPC on a voluntary basis at an early stage in the policy development process to provide clarity over the objectives of the policy and support the identification and assessment of potential policy options."
        },
        {
            "text": "Since November 2020, 57% of pre-consultation stage IAs we reviewed received at least one red (not fit for purpose) rating across the identification of impacts, small and micro business assessment (SaMBA) and rationale and options categories."
        },
        {
            "text": "For the six-month period to March 2022, only one-third (32%) of pre-consultation stage IAs received green ratings for rationale and options (Figure 1). This has improved over the four months to July 2022 to 60% being green rated, but it still shows a large room for improvement in the quality of these IAs. The most common weakness was insufficient identification and analysis of credible non-regulatory options."
        },
        {
            "text": "The Government’s review of the better regulation framework (BRF) is considering ways to improve the consideration of non-regulatory options in policymaking, and our findings highlight the relative lack of attention to assessing whether non-regulatory options may offer a better way to tackle a particular problem than a regulatory approach."
        },
        {
            "heading": 3,
            "text": "Figure 1: Percentage of pre-consultation stage IAs receiving green ratings by category"
        },
        {
            "text": " "
        },
        {
            "text": "Since the introduction of our current template in November 2020, there has been a general worsening in those aspects of the pre-consultation stage IAs that are not picked up in our fitness for purpose rating, but which we provide a ‘good’, ‘satisfactory’, ‘weak’ or ‘very weak’ quality rating for – aspects such as cost benefit analysis, the assessment of wider impacts and the monitoring and evaluation (M&E) plans. Across the opinions, over half (58%) of pre-consultation stage IAs received at least one ‘weak’ or ‘very weak’ quality rating (i.e. the analysis is not sufficiently robust to address the issue or has significant flaws)."
        },
        {
            "text": "In Figure 2, analysis of wider impacts on the environment, on innovation and competition and on trade has consistently been a particular area of concern, with only 15% of IAs being rated ‘good’ between November 2020 and July 2022 (compared to 23% for M&E plans and 26% for cost benefit analysis). The continued shortfalls in this area support the case we made in a prior blog post for using the BRF review to strengthen our assessment of these wider impacts and make them red-rateable."
        },
        {
            "heading": 3,
            "text": "Figure 2: Percentage of pre-consultation stage IAs receiving a good rating by category"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Final stage IAs – supporting the selected approach to regulation"
        },
        {
            "text": "Independent scrutiny of final stage IAs by the RPC is mandatory for some regulatory proposals under the current BRF and aims to support ministerial decision-making over the selected approach as well as parliamentary scrutiny of the evidence and analysis supporting the proposed policy. Final stage scrutiny also provides independent validation of the expected annual net direct costs to business counting towards the business impact target."
        },
        {
            "text": "Where we have significant concerns over a final stage IA that has been submitted to us by a department, rather than directly issue a red (not fit for purpose) rating, we typically issue an Initial Review Notice (IRN) which identifies issues that would otherwise lead to a red rating and offers the department the opportunity to resubmit their IA having addressed the issues of concern. Of the 104 final stage IAs we have scrutinised since the introduction of the new template, 24 received an IRN, while all but 5 received a green rating when revised and resubmitted – this highlights the value that the RPC adds at this stage in the policy-making process."
        },
        {
            "text": "As with pre-consultation stage IAs, we often identify weaknesses in the quality of the analysis at final stage; more than half (­56%) of final stage IAs received at least one ‘weak' or ‘very weak’ rating."
        },
        {
            "text": "The assessment of the wider impacts of the proposed regulation remains an area for improvement, with 22% being rated ‘weak’ or ‘very weak’ (Figure 3). In addition, there is still considerable scope to improve the quality of M&E plans, with 38% ‘weak’ or ‘very weak’ between October 2021 and March 2022. Given the importance of evaluating the effectiveness of regulations, we want to reiterate that it is essential that impact assessments contain good M&E plans, to ensure that arrangements are in place to support the post-implementation review and allow a proper evaluation of the effectiveness of the regulation and inform decisions to repeal, amend, retain or replace the regulation. Again, this issue is being considered as part of the Government’s current review of the BRF."
        },
        {
            "heading": 3,
            "text": "Figure 3: Percentage of final stage IAs receiving a weak or very weak rating by category"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The impact of early scrutiny on the quality of impact assessments"
        },
        {
            "text": "Under the current BRF, only some IAs are submitted to the RPC for scrutiny at both pre-consultation and final stages; others are only reviewed at final stage. Looking across our quality ratings, we find that 97% of final stage IAs received ‘good’ or ‘satisfactory’ ratings for rationale and options when the RPC had previously provided a pre-consultation stage opinion. This compares to 68% when there was no earlier scrutiny. Similarly, our rating of M&E plans were higher (100% compared to 60%) for measures scrutinised at the pre-consultation stage, although early scrutiny made little difference to our rating of cost-benefit analysis (88% compared to 86%). We continue to argue for mandatory early scrutiny of IAs to improve the quality of analysis and help policy-makers and ministers to make better and more effective regulation, to complement mandatory final stage scrutiny to inform ministers and parliament of the costs and benefits of the final policy option chosen."
        },
        {
            "heading": 2,
            "text": "Post-implementation Reviews (PIRs) – checking if the regulation is working well or needs revising"
        },
        {
            "text": "As noted above, we are concerned that the weakness of M&E plans in final stage IAs reduces the robustness of departments’ PIRs after the regulation has been in place for five years, but a larger concern is the lack of any evaluation at all. Since November 2020, we have received only 26 PIRs for scrutiny, compared to the 160 IAs receiving an opinion during the same period. This highlights the need for departments properly to comply with the statutory requirement for PIRs to inform decisions over whether regulations should be repealed, retained, amended or replaced. Again, we argued in a prior blog post for the Government to improve this in its review of the BRF."
        }
    ]
}