{
    "url": "https://design102.blog.gov.uk/2022/09/27/what-inspires-you-how-to-encourage-your-creative-spark/",
    "title": "What inspires you? How to encourage your creative spark",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Creative",
        "Design",
        "Team"
    ],
    "pub_date": "2022-09-27T12:00:15+01:00",
    "content": [
        {
            "text": "At Design102, we live and breathe creativity. But with all the changes the pandemic has brought – lockdowns, virtual meetings and the ‘new normal’ of hybrid working – we’ve had to find new ways of keeping our creative spark alive."
        },
        {
            "text": "So with the return to the office, we asked everyone at Design102 to answer a survey about our creativity over the last two years – where we find it, how we keep hold of it, and how working from home has or hasn’t changed it. There are times when we could all use some inspiration, so we hope to learn from each other’s responses and inspire others."
        },
        {
            "heading": 2,
            "text": "How has working from home positively impacted our creativity?"
        },
        {
            "text": "The survey revealed that our creativity at work is intrinsically linked to our personal interests. And for 70% of us, working from home has enhanced, rather than hindered, our creativity by freeing up time for ourselves and for the things that make us happy outside of work."
        },
        {
            "text": "Without the to-and-fro of the daily commute, one-third of us found more time for our own passion projects during lockdown – such as painting, illustration or photography – while others started new hobbies, from embroidery and journaling to language learning and nail art. Breathing space for personal creativity means we approach our work feeling more energised and less stressed, with greater freedom in our day to pause, reflect and explore ideas."
        },
        {
            "heading": 2,
            "text": "Is there something in our work-from-home routine that motivates us?"
        },
        {
            "text": "Making use of our additional time, one-third of us have built a daily walk into our work-from-home routine. Whether it’s a morning stroll or a lunchtime wander, we can all agree that stepping away from the screen and into fresh air does wonders for our productivity. Suddenly, that challenging brief is back in perspective and we feel more inspired to tackle it."
        },
        {
            "text": "Elsewhere, we find motivation in the small moments – from tea breaks with flatmates to family mealtimes. Moments that perhaps, in our pre-pandemic routines, got lost in the rush of everyday life."
        },
        {
            "heading": 2,
            "text": "Where do we find our inspiration online and offline?"
        },
        {
            "text": "If we find ourselves stuck for ideas, tapping into creative communities on Instagram, Twitter, Pinterest or YouTube is our favourite way of finding new styles and concepts. Social media is brimming with fellow designers and studios doing inspiring work – often a scroll is all it takes to get our own creative juices flowing again."
        },
        {
            "text": "Offline, we’re most inspired by the great outdoors. Getting out into nature allows the brain fog to clear, our minds to recharge and new creative routes to open up. We also browse art galleries, people-watch in coffee shops and turn to our bookshelves in search of inspiration."
        },
        {
            "heading": 2,
            "text": "How do we stay creative and connected as a team?"
        },
        {
            "text": "We all have our own ways of staying creative from home. But what about keeping creativity up as a team?"
        },
        {
            "text": "Our almost-unanimous answer: Microsoft Teams. Whether they’re daily check-ins or weekly catch-ups, we’ve continued to discuss exciting projects, share inspiration boards and brainstorm ideas virtually."
        },
        {
            "text": "Beyond the work talk, we’ve replicated those casual office chats on Teams by sharing anything we’ve been enjoying: books, TV shows, films, pets, events – even Christmas adverts and Wikipedia pages of the week."
        },
        {
            "text": "And now everyone is back in the office, we’ve restarted in-person events and collaboration sessions, from book club and sketch club to biscuit breaks and project ‘show and tells’."
        },
        {
            "text": "At our first creatives’ gathering post-pandemic, we held an ideas generation workshop with group exercises to stretch our ideas in different directions and come up with unique designs, in true testament to how valuable in-person collaboration is for the team."
        },
        {
            "text": "So right now, our creativity has the best of both worlds: the office as a hub of activity, discussion and connection, and home as a focused, personal space – with collaboration only ever a Teams call away."
        },
        {
            "heading": 2,
            "text": "What advice would we give to someone who’s lost their creative mojo?"
        },
        {
            "text": "Pandemic or no pandemic, creativity will always come in peaks and troughs. We’ve all been there: some days you’re a creative genius, and other days you’re out of ideas with no clue where to start. Collated from our survey responses, here are our top tips for getting your creative mojo back."
        },
        {
            "text": " "
        },
        {
            "text": "We hope sharing our survey responses has made you feel inspired. If you’d like to know more about Design102 or you’ve got a project we can help with, just drop us a line at hello@design102.co.uk"
        },
        {
            "text": " "
        }
    ]
}