{
    "url": "https://naturalengland.blog.gov.uk/2025/07/30/crayfish-clawing-their-way-back-in-nottinghamshire-a-conservation-success-story-in-the-making/",
    "title": "Crayfish clawing their way back in Nottinghamshire: A conservation success story in the making",
    "authors": [
        "Danielle Greaves"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Monitoring",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Science and evidence",
        "Species recovery",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2025-07-30T09:30:00+01:00",
    "content": [
        {
            "text": "By Danielle Greaves, Higher Officer - Species Reintroduction and Recovery, Natural England"
        },
        {
            "text": "Hidden beneath the surface of Nottinghamshire's rivers and streams lives an increasingly rare species – the white-clawed crayfish. As the UK's only native freshwater crayfish, these creatures play a vital role in our aquatic ecosystems."
        },
        {
            "text": "But this native species faces an existential threat. The introduction of the North American signal crayfish in the 1970s has had devastating consequences. These invasive crayfish don't just outcompete our native species for food and habitat, they carry a deadly fungal disease known as crayfish plague, to which white-clawed crayfish have no natural resistance."
        },
        {
            "text": "The result? A decline in white-clawed crayfish populations, with isolated strongholds remaining across Nottinghamshire."
        },
        {
            "heading": 4,
            "text": "A collaborative conservation effort"
        },
        {
            "text": "An ambitious partnership has formed to protect this endangered species. The Environment Agency is leading the initiative with a permit from Natural England to secure the future of white-clawed crayfish in Nottinghamshire."
        },
        {
            "text": "This multi-partner approach includes Birmingham Sealife Centre providing crucial quarantine facilities, alongside Nottinghamshire Biodiversity Action Group (BAG), Derbyshire Wildlife Trust, and White Post Farm, north of Nottingham. Volunteers from the Midlands Crayfish Group (hosted by Buglife), Nottingham Crayfish Group (led by Nottinghamshire BAG), and individual volunteers are all contributing their time and expertise."
        },
        {
            "text": "Together, they're working on several complementary strategies:"
        },
        {
            "heading": 4,
            "text": "Conservation in action"
        },
        {
            "text": "As a Higher Officer for Species Reintroduction and Recovery at Natural England, I've been fortunate to participate directly in these conservation efforts. Over the past few years, I've joined Nottinghamshire BAG for signal crayfish removal sessions in Bulwell, Nottingham. These sustained efforts are paying dividends and we're now seeing a noticeable decline in the invasive population in ponds at Bulwell Hall."
        },
        {
            "text": "The most rewarding aspect of my work has been participating in the translocation project, moving vulnerable, white-clawed crayfish populations from Hucknall, close to Nottingham, to specially selected ark sites in Nottinghamshire. These new homes provide protection from both the invasive signal crayfish and the deadly plague they carry."
        },
        {
            "text": "This month marked a significant milestone in the Nottinghamshire white-clawed crayfish conservation journey. I had the privilege of taking part in crucial fieldwork that confirmed the continued presence of a white-clawed crayfish population under threat from nearby invading signal crayfish."
        },
        {
            "text": "Following this assessment, the team successfully carried out a major translocation operation on 24 July which achieved two objectives: releasing 43 quarantined crayfish from Birmingham Sealife Centre into their new ark site and collecting 100 healthy individuals from Baker Lane Brook in Hucknall to begin their own quarantine period."
        },
        {
            "text": "The collection process proved successful, with the team catching 121 adult crayfish and dozens of juveniles. From this abundance, they were able to carefully select the 100 healthiest adult specimens (the maximum number able to be housed at the quarantine facility) within the required size range (15-40mm carapace length), ensuring a good gender ratio and age range."
        },
        {
            "text": "One of the most effective capture methods was using 'brash bundles' – collections of various sized branches tied together that provide shelter for the crayfish. A single brash bundle captured an impressive 17 adults and over a dozen juveniles."
        },
        {
            "heading": 4,
            "text": "Crayfish plague and quarantine"
        },
        {
            "text": "A critical element of the conservation effort is preventing the spread of crayfish plague. Environmental DNA (eDNA) testing has confirmed the presence of plague in some watercourses, necessitating strict quarantine procedures."
        },
        {
            "text": "Birmingham Sealife Centre plays a vital role by providing specialised quarantine facilities. Under the Natural England license requirements, rescued crayfish must spend a minimum of 28 days in quarantine to ensure they are disease-free before being released to ark sites. This crucial step prevents the accidental spread of plague to the protected sites."
        },
        {
            "heading": 4,
            "text": "Why this work matters"
        },
        {
            "text": "The white-clawed crayfish isn't just another species – it's a vital component of healthy river ecosystems. These native crayfish help maintain water quality by feeding on decaying matter and serve as an important food source for otters, fish, and various bird species."
        },
        {
            "text": "Their decline represents not just the loss of a single species, but the unravelling of complex ecological relationships that have evolved over thousands of years. By protecting the white-clawed crayfish, we're helping to preserve the biodiversity and ecological health of Nottinghamshire's waterways for future generations."
        },
        {
            "heading": 4,
            "text": "How you can help"
        },
        {
            "text": "Everyone can play a part in protecting our native crayfish:"
        },
        {
            "text": "With continued collaboration and dedicated conservation efforts, there's hope that the white-clawed crayfish will not only survive but eventually thrive once again in Nottinghamshire's waterways."
        }
    ]
}