{
    "url": "https://environmentagency.blog.gov.uk/2025/07/30/partnership-power-the-future-of-drought-research-in-the-uk/",
    "title": "Partnership power: the future of drought research in the UK",
    "authors": [
        "phillee"
    ],
    "categories": [
        "Science",
        "Water"
    ],
    "pub_date": "2025-07-30T08:50:30+00:00",
    "content": [
        {
            "text": "By Stuart Allen (Environment Agency Principal Scientist) with Dr Gemma Coxon (University of Bristol) and Dr Glenn Watts (UKCEH)  "
        },
        {
            "text": "England has just emerged from its driest spring in 132 years. Summer has seen little relief, with back-to-back heatwaves and drought being declared in several areas across the country. "
        },
        {
            "text": "As a climate scientist, I’m interested in how these extreme events have become the new normal. My first job after graduation was working as a Water Resources Officer in East Anglia supporting the Ely Ouse to Essex Transfer Scheme, an Environment Agency asset that moves water from rivers in Norfolk to the rivers and reservoirs of Essex. Working in one of the driest parts of the country, and on a strategically significant water resources asset, left a lasting impression on me. I’ve since brought that interest to the Chief Scientist’s Group, where I’ve been lucky to build a career investigating the current and future challenges around water resources and drought.  "
        },
        {
            "text": "Building consensus and community "
        },
        {
            "text": "In November 2023, the Environment Agency published its largest ever review of drought science. We worked with leading drought scientists from 13 universities, research institutes, and consultancies, each contributing knowledge from their specialist fields. The review set out what is known, and not well known, about the physical and social factors that come together during drought.  "
        },
        {
            "text": "One year later, we co-hosted a workshop with the University of Bristol and UK Centre for Ecology and Hydrology (UKCEH) to build on the review. We brought together 48 experts from universities, research institutes, government agencies, environmental consultancies, and water companies. The workshop focused on understanding catchment processes during drought conditions in the UK. We’ve now published a summary of the workshop, which sets out what we identified and what’s next for drought research.  "
        },
        {
            "text": "It's been a real privilege to lead this work for the Environment Agency with our partners at UKCEH and the University of Bristol. Like any great scientific challenge, drought can’t be addressed alone. Working together, sharing knowledge, and bringing in the best of all disciplines is needed.  "
        },
        {
            "text": "We now have alignment on what areas of research are most needed to build drought resilience in England. And, more importantly, we have a community of researchers ready to take it forward.  "
        },
        {
            "text": "What makes drought science so complex? "
        },
        {
            "text": "Despite how the recent hot, dry weather might feel, serious droughts are rare in England. This means there is little observational data to tell us how water systems behave when soils are very dry and river flows and groundwater levels are very low. Major droughts are usually separated by a decade or more, and hydrological systems – catchments, water supply systems, types and locations of water use – change over time. As such, each drought is different.  "
        },
        {
            "text": "“All of this means that it’s hard to predict the impact of the next drought and to work out what to do when it happens,” said Dr Glenn Watts, Associate Science Director of Water and Climate Science at UKCEH. I’ve been fortunate to work with and learn from Glenn for many years, including both phases of our drought review and workshop.   "
        },
        {
            "text": "The workshop addressed this complexity head-on to see where our biggest challenges lie. We identified four main research areas to collectively take forward: "
        },
        {
            "text": "“These research priorities come together to tackle the whole drought problem,” said Glenn. “It will help us understand how people act during drought, how environments respond to drought, and which management measures are most effective.” "
        },
        {
            "text": "Why does working together matter more than ever?  "
        },
        {
            "text": "The workshop’s aims were twofold: identifying research priorities and creating a community.    "
        },
        {
            "text": "“Because droughts are complex events that are difficult to predict and adapt to, they require lots of different expertise,” said Dr Gemma Coxon, Associate Professor in Hydrology at the University of Bristol’s School of Geographical Sciences. “That’s exactly why we wanted representation from climate, hydrology, ecology, social science, water systems engineering, and beyond.” "
        },
        {
            "text": "Gemma and I worked together to convene drought experts for this project. Early on, we knew we needed a whole system approach to see real progress in drought science. The workshop was a way to nurture diversity of thought – across scientific disciplines, sectors, and areas of the country – and to take on new work in partnership. This ensures future research is as interconnected as drought itself.    "
        },
        {
            "text": "“Having a community means we can share knowledge and ideas, establish new connections between disciplines, and foster innovation to provide solutions to drought challenges,” said Gemma. It’s been heartening to see the level of engagement from everyone involved and their willingness to be part of a collective effort. "
        },
        {
            "text": "Maintaining our momentum"
        },
        {
            "text": "Future drought research will be supported by the Floods and Droughts Research Infrastructure (FDRI) project, a £38million UK Research and Innovation (UKRI) initiative. With the aim of improving resilience to floods and droughts, FDRI will monitor the whole hydrological system in three contrasting catchments across the UK. The data generated through FDRI will be freely available for anyone to use. "
        },
        {
            "text": "“This breaks down one of the major barriers to new research on both droughts and floods: the cost and time it takes to collect new data. This frees researchers across the UK and beyond to concentrate on developing new analyses that give new insights into both flood and drought hydrology,” said Glenn. "
        },
        {
            "text": "As an Environment Agency representative for FDRI, I’m excited by what it offers us. This investment is an unprecedented opportunity to capture new observations, better understand the processes that control droughts, and help us prepare operationally for what’s to come. It will keep the spirit of our workshop alive. "
        },
        {
            "text": "“FDRI will help sustain the drought community of practice by supporting community events and delivering training to the next generation of drought scientists,” said Gemma. “We can expect more events in the next three years exploring emerging research challenges and capabilities for floods and droughts!” "
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "This project is just one way the Environment Agency is exploring the science of droughts. In the Chief Scientist’s Group, my team is working to understand different angles to drought. Our research includes: "
        },
        {
            "text": "Final thoughts  "
        },
        {
            "text": "We know the climate is changing, and we expect drought will change with it. That is why we are planning for the future with our ambitious, multi-disciplinary research plan.  "
        },
        {
            "text": "While we can’t prevent drought, a better understanding of how people and the environment interact during drought will make sure the impacts are reduced. Thinking ahead and working together are the best way forward to make us more resilient. "
        }
    ]
}