{
    "url": "https://socialcareinspection.blog.gov.uk/2025/07/30/restraint-and-restrictive-practices-positive-environments-for-children/",
    "title": "Restraint and restrictive practices: positive environments for children",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes",
        "looked after children",
        "residential special schools",
        "secure children's home"
    ],
    "pub_date": "2025-07-30T14:35:06+01:00",
    "content": [
        {
            "text": "In this blog, I want to talk to providers of children’s homes, residential special schools and boarding schools about what we’re currently seeing on inspection when it comes to restraint and restrictive practices. "
        },
        {
            "text": "I want to emphasise how important it is to prioritise creating a positive environment for children in your care."
        },
        {
            "heading": 2,
            "text": "Our guidance on creating positive environments"
        },
        {
            "text": "We regularly review our guide for inspectors on physical intervention and restrictions of liberty: Positive environments where children can flourish. Whenever we review it, we’re reminded of how important it is to protect and promote children’s rights."
        },
        {
            "text": "We created the guidance to help inspectors evaluate how providers, managers and carers create a positive environment for all children – and in particular, disabled children, those who have communication support needs and those with special educational needs."
        },
        {
            "text": "Restraint and restrictive practices can negatively affect children’s mental health and well-being. Although restraint is permissible, it should only be used when all less restrictive measures have been unsuccessful."
        },
        {
            "heading": 2,
            "text": "Professional curiosity"
        },
        {
            "text": "On inspection, we see many examples where staff have good quality relationships with children, and these have a positive effect on children’s experiences. We celebrate good practice like this by acknowledging it in our inspection reports."
        },
        {
            "text": "Inspectors will always be curious. We want to understand the context around children’s experiences. Professional curiosity starts valuable open conversations with providers. These conversations help inspectors to gain insight into how staff work positively and confidently with children to empower and support them. These conversations also help inspectors understand how a child’s past experiences affect the way the child responds to their environment, people or situations. "
        },
        {
            "text": "When we show curiosity to understand the reason for any blanket approaches to restrictive practices, it can lead to organisational change. We expect providers to make sure that staff are appropriately trained to engage and communicate meaningfully with children, and to avoid any practice that could expose children to trauma. We expect leaders and managers to maintain an open safeguarding culture."
        },
        {
            "heading": 2,
            "text": "Disabled children"
        },
        {
            "text": "Staff caring for disabled children have a responsibility to understand individual children’s communication style. They can then help children to develop their skills in communication, so that the children can better express their feelings and views. Disabled children and children who communicate without speech have the right to be consulted about their experience of restraint and restrictive practice."
        },
        {
            "text": "Inspectors spend time with children. They often observe the children’s care and staff’s practice, in order to understand the culture and the quality of care. Our inspections show us much good practice. Many providers are expertly using children’s individual communication systems to continually improve children’s progress and experiences every day. These providers also make sure that, following any incident, there is a natural flow of communication to explore the child’s experience. We also see independent advocacy services being used to meaningfully gather children’s views and promote positive action for them. "
        },
        {
            "text": "During inspections, we meet and talk to lots of inspiring leaders and managers who can show how the use of restraint and restrictive practice affects the children they are caring for. They can also explain how they try to reduce or minimise these restrictions."
        },
        {
            "text": "These leaders and managers clearly set out their expectations where restraint and restrictions are concerned. They rigorously monitor and review any use of restrictive equipment or chemical restraint that could undermine the well-being and welfare of children in their care."
        },
        {
            "heading": 2,
            "text": "The environment"
        },
        {
            "text": "We expect to see leaders and managers making sure the environment in the home gives children as many freedoms and flexibilities as possible. The home should be a nurturing, safe and homely place to live. We also expect leaders and managers to ensure the safety of children in the least intrusive way."
        },
        {
            "text": "We’re seeing real improvements in the quality of the environments in children’s homes, residential special schools, and boarding schools. There’s been a move away from bedroom-door alarms and locked doors. Children now have more control over their daily choices and experiences."
        },
        {
            "heading": 2,
            "text": "Records, language and management oversight"
        },
        {
            "text": "Regulations require providers to record written information to explain:"
        },
        {
            "text": "Leaders and managers must show how they understand trends and patterns, and identify the actions needed to improve children’s experiences."
        },
        {
            "text": "We know it can be too easy to focus on recording and the quality of report writing rather than on the impact and understanding of restraint. Records are important, but what really matters is that you focus on how well children’s behaviour is supported, and make sure that their personal development is nurtured by informed, intuitive staff."
        },
        {
            "text": "Inspectors will always try to gather information directly from children, carers and leaders first and foremost. Records should give inspectors some of the detail about the progress and resolution of a restrictive practice, but they will always want to talk to those involved."
        },
        {
            "text": "The challenge for providers is to make sure records about restraint or restrictive practices show the child's point of view and experience, and the staff’s response, rather than blaming children or solely focusing on a compliance matter."
        },
        {
            "text": "We do see many providers successfully supporting staff to make accurate and balanced records that help managers to review children's needs, oversee staff’s practice and promote change where necessary. However, this should be common practice. I hope to see more improvements over time."
        },
        {
            "text": "I’ll be writing more blogs about restraint and restrictive practices over the coming, so please do subscribe for updates if this is relevant to your work."
        }
    ]
}