{
    "url": "https://environmentagency.blog.gov.uk/2025/07/30/slurry-storage-sort-it-in-the-summer-be-winter-ready/",
    "title": "Slurry storage: sort it in the summer, be winter ready",
    "authors": [
        "phillee"
    ],
    "categories": [
        "agriculture"
    ],
    "pub_date": "2025-07-30T14:08:51+00:00",
    "content": [
        {
            "text": "As we launch this year’s farm winter ready campaign, with a very dry spring passed and many areas of the country in drought, a wet winter may not at the forefront of our minds."
        },
        {
            "text": "But time never stands still, and the summer months really are the best time to plan for winter slurry storage. Doing it now means maintenance jobs are easier to carry out than in the middle of winter, planning can happen without panic and storage requirements can be considered carefully."
        },
        {
            "text": "Last year we met with Tom, a dairy farmer in Cornwall. He had built a new slurry lagoon following a farm inspection, and in this video, he told us how much of difference it made to him through the winter months."
        },
        {
            "text": "The weather and planning ahead"
        },
        {
            "text": "As we exited spring last year, we wondered if it was ever going to stop raining. Hot on the heels of a wet winter, many farmers had found their slurry storage under a lot of pressure. The very dry spring and summer this year has been the polar opposite, but it does tell us one thing we can rely on with the weather: past performance is not an indicator of future results – wet weather will be around the corner somewhere."
        },
        {
            "text": "So, what is there to think about to make sure you have storage that’s fit for purpose when winter comes?"
        },
        {
            "text": "Regulations and good practice"
        },
        {
            "text": "Regulatory compliance may seem onerous, but in fact the regulatory requirements for storing and using slurry and other organic fertilisers are based around good practice. They are good for the environment but also boost efficiency and productivity on the farm. Here is a quick run down on the regulations covering storage requirements and spreading."
        },
        {
            "text": "Storage requirements"
        },
        {
            "text": "To see you through winter, the Silage, Slurry, and Fuel Oil Regulations (SSAFO) require a minimum of 4 months storage capacity, which goes up to 5 months for cattle and sheep, and 6 months for pigs and poultry, if you are in a Nitrate Vulnerable Zone (NVZ). We strongly recommend having six months storage to be sure you can make it through with contingency to spare."
        },
        {
            "text": "Rules on spreading"
        },
        {
            "text": "The Farming Rules for Water allow spreading of organic and inorganic fertilisers according to soil and crop need, without giving rise to significant risk of pollution. This means that if you are having to spread to land because your slurry storage is full, rather than for any soil or crop requirements, you are breaching these regulations."
        },
        {
            "text": "Whilst there are some exceptions, there is generally no soil or crop need for spreading during autumn and winter. Any slurry or other materials spread to land at this time will not be taken up, and are at high risk of running off or leaching to the nearest water course."
        },
        {
            "text": "We routinely check compliance with these regulations, so you can expect us to review them if we carry out a farm inspection. We also carry out monitoring for spreading during the winter months across the country."
        },
        {
            "text": "This video tells you more about what happens during one of our farm inspections."
        },
        {
            "text": "Get in touch"
        },
        {
            "text": "If you have concerns about slurry storage, or want to clarify the regulations, we will be happy to talk to you. Get in touch with us below and ask to put in contact with the agriculture regulation team covering your area of the country."
        },
        {
            "text": "Email: enquiries@environment-agency.gov.uk"
        },
        {
            "text": "Tel. 03708 506 506"
        }
    ]
}