{
    "url": "https://mojdigital.blog.gov.uk/2025/07/30/user-centred-infrastructure-bringing-agile-thinking-to-the-backbone-of-justice-services/",
    "title": "User-Centred Infrastructure: Bringing Agile Thinking to the Backbone of Justice Services ",
    "authors": [
        "Darren Rooke",
        "Nava Ramanan"
    ],
    "categories": [
        "Agile",
        "Our services",
        "user-centred"
    ],
    "pub_date": "2025-07-30T09:26:32+01:00",
    "content": [
        {
            "text": "Here at Justice Digital, we design and deliver products that make a meaningful difference in the lives of citizens, often at some of their most challenging moments. Whether it's applying for compensation after a criminal injury or securing lasting power of attorney for a loved one, our services aim to support people when they need it most. "
        },
        {
            "text": "One of the key enablers of this work is the way our teams are structured. Like many modern digital organisations, we work in multidisciplinary teams that operate in an agile way. Constantly learning, iterating, and improving based on user feedback. "
        },
        {
            "text": "Agile helps us break down complex challenges into smaller, more manageable pieces so we can deliver value early and often. It enables our teams to adapt quickly to changes in user needs, technology, or government policy. Through regular collaboration, reviews, analysis and user research, we’re able to test assumptions, reduce risk, and build services that are accessible and genuinely meet the needs of the people who rely on them. "
        },
        {
            "text": "But do we apply the same mindset when it comes to how we deliver infrastructure and technology services within our organisations? These are just as critical as the products themselves, so why do so many of us still default to project-based thinking and waterfall principles in these areas? "
        },
        {
            "text": "I don’t have all the answers, but I do believe there is a better way. By adopting a more agile, outcome-focused approach to how we manage and evolve our infrastructure, we can ensure we’re solving the right problems and delivering greater value for our users and the wider organisation. "
        },
        {
            "text": "I have recently joined the Digital Infrastructure and Security Operations (DISO) team as Lead Product Manager. In short, the team is responsible for the live services, delivery, product changes and development of all networking, security, voice and video, and hosting services across the Ministry of Justice estate. With the support of my Deputy Director, Nava Ramanan, we are actively exploring how we can improve the way we operate and deliver these services. "
        },
        {
            "text": "We have just completed a discovery phase to better understand the challenges and blockers that are preventing us from working in a truly agile way. Through this, we have identified key opportunities to create the space, support, and clarity our teams need to adopt more agile and product-led approaches. By doing so, we aim to unlock stronger collaboration, accelerate delivery, and drive more meaningful outcomes for our users and the wider organisation. "
        },
        {
            "text": "“This transformation isn't just about technology. It’s about culture, courage, and clarity of purpose. Shifting long held mindsets hasn't always been easy and at times, its meant challenging the very systems/processes and leadership styles we are part of. But by bringing agile and product thinking into our infrastructure teams, we have created the space for people to thrive. With 23 product and service teams now operating within DISO, we are fostering deep collaboration, sharper focus, and a renewed commitment to delivering meaningful outcomes. This is about more than modernisation. it’s about strengthening people and services, so we leave them better than we found them”.  - Nava Ramanan "
        },
        {
            "text": "We are at the beginning of an exciting transformation, shifting towards a more agile, product-led and outcome-focused way of working. As we start to embed these new approaches and learn along the way, we will keep you updated on our progress, sharing best practices and lessons learned as we go. "
        },
        {
            "text": "If you are undertaking a similar journey in your organisation, we would be keen to connect and exchange experiences, insights, and lessons learned. Alternatively, if this work interests you and you would like to know more, please don’t hesitate to get in touch with me at darren.rooke1@justice.gov.uk"
        }
    ]
}