{
    "url": "https://aphascience.blog.gov.uk/2024/09/05/asian-hornet-week-2024/",
    "title": "Joining forces with Kent beekeepers in the fight against the yellow-legged hornet (Asian hornet)",
    "authors": [
        "Lisa Jenkins"
    ],
    "categories": [
        "Bee health"
    ],
    "pub_date": "2024-09-05T10:14:21+01:00",
    "content": [
        {
            "text": "Yellow-legged hornets (Vespa velutina), also known as Asian hornets, originally from Asia, are an invasive species that have made their way to mainland Europe in recent years. Their presence now poses a serious risk to honeybees and other native pollinators of the United Kingdom."
        },
        {
            "text": "In this blog, Seasonal Bee Inspector Lisa Jenkins from APHA’s National Bee Unit (NBU) talks about working with a local Yellow-Legged (Asian) Hornet Team in Dover to track down a nest of this invasive predator."
        },
        {
            "text": "--------"
        },
        {
            "text": "One of the standout moments in our efforts to tackle the threat of yellow-legged hornets, also known as Asian hornets, in Kent this year was working on the front line with the local Yellow-Legged (Asian) Hornet Teams (YLHTs). YLHTs are members within beekeeping associations who are often called when potential sightings of yellow-legged hornets are reported."
        },
        {
            "text": "Many of the hornet nests in Kent were found near Dover, Deal, and Folkestone, areas known for their beekeeping communities. Our first sighting of the day was in a village near Dover. Beekeepers, Sue Court and Eric Cattrell, were observing yellow-legged hornets hawking their bees in the garden."
        },
        {
            "text": "While we awaited the arrival of the full National Bee Unit  team, Eric and I spent the morning setting up a trap in his garden. We made the most of this time by observing the hornets and mapping out their flight path after feeding. We realised we needed additional help to monitor the hornets' flight direction from the other side of the house and were eagerly anticipating the arrival of the NBU team to begin our work."
        },
        {
            "text": "Upon the arrival of the full NBU team, we were made to feel wonderfully welcome, with access to the Scout hut, tea, and facilities, which were greatly appreciated during our days of observing and tracking the hornets in all weathers."
        },
        {
            "text": "Eric had to be at work during the day, and Sue was tending to her livestock, but we always kept them updated on our progress and the challenges and successes we encountered. Their support, along with that of the local community, was crucial in our journey to successfully locating the hornet nest."
        },
        {
            "text": "APHA Regional Bee Inspector, Tom Bickerdike, reached out to Jackie Thomas, who works within the local YLHT, to understand how we could work better together. A plan was developed swiftly, and things moved fast. Jackie shared her insights on how Dover beekeepers could contribute, demonstrating a thorough understanding, meticulous planning, and unwavering determination that Dover would hold the line against a yellow-legged hornet incursion."
        },
        {
            "text": "You have to sit at Jackie’s large kitchen table to appreciate her tenacity and planning skills. The table, covered in a full-sized Ordnance Survey map of Kent, is marked with sticky label dots, which show the monitoring traps set out by her army of Dover volunteers. They complement traps set by the NBU in areas where active track and trace (T&T) are taking place. Each sticky dot is placed in a grid at a measured distance, to make sure that there are a sufficient number of traps across the region."
        },
        {
            "text": "Jackie’s local YLHT army, and particularly her husband Allyn, were absolutely focussed on setting out and then monitoring the traps. Monitoring traps is the first vital step in finding any hornet nest. They provided immediate feedback on hornets found to Jackie, who coordinated the response both on her map, and to Tom, who organised the rapid dispatch of an advanced NBU team to set up bait stations ready for T&T to commence. This dynamic teamwork resulted in multiple nests being rapidly located and destroyed around the Dover and Southeast Kent area."
        },
        {
            "text": "This working relationship was incredibly successful, and Jackie, along with a selection of her dedicated YLHT team, were invited to observe one of the T&Ts with an NBU team working in the area. The work was physically demanding, and their stamina was commendable, staying with the team for several days, not wishing to miss a thing. All expressed how much they enjoyed contributing to the experience, although they commented that it was not as easy as they thought it would be."
        },
        {
            "text": "This collaborative approach continued right up until the final hornet nest was removed. Jackie is already planning the spring catch activities, with Tom who was invited back for the Dover and District Beekeepers Association’s (DDBKA) January and February meetings. I was also particularly honoured to be asked to present the prizes at the Dover Beekeepers Honey Show and Jackie’s certificate for achieving ‘Master Beekeeper’ status."
        },
        {
            "text": "It would be wonderful to think that we eliminated all the yellow-legged hornets in Kent this year, but if we have to start the fight again, we know that we will have a warm and supportive, collaborative welcome from the DDBKA."
        },
        {
            "heading": 3,
            "text": "How you can help in the fight against yellow-legged hornets"
        },
        {
            "text": "This yellow-legged hornet week, please look out for this type of hornet in your garden."
        },
        {
            "text": "Yellow-legged hornets can be spotted on flowering plants and, particularly at this time of year, on Ivy as well as fruit including apples, pears, plumbs and grapes. Whilst they are feeding, and if safe to do so, please take a photograph of it and send this to us via the “Asian Hornet Watch” app."
        },
        {
            "heading": 3,
            "text": "What to look out for"
        },
        {
            "text": "Yellow-legged hornets are mainly black in colour with yellow ends to their legs and a clear orange/yellow band of the abdomen."
        },
        {
            "text": "For further information on yellow-legged hornet identification, you can watch this video or look at our identification sheet."
        },
        {
            "heading": 3,
            "text": "How to report yellow-legged hornet sightings"
        },
        {
            "text": "A quick and easy way to report sightings is by downloading and using the “Asian Hornet Watch” app."
        },
        {
            "text": "The app was launched in 2017 by the UK Centre for Ecology & Hydrology (UK CEH) to make recording yellow-legged hornet sightings as simple as possible. It provides lots of information on similar looking insects."
        },
        {
            "text": "You can download the app for iPhone or Android."
        },
        {
            "text": "An alternative to using the app is to complete our online recording form."
        },
        {
            "text": "Sightings without photos need to include enough information to make it credible to trigger a visit from a British Beekeepers Association Yellow-Legged Hornet Team member. Sightings become more credible if they include:"
        },
        {
            "text": "All reports are reviewed, and if a clear photo or enough detailed information is provided to make it credible, it is forwarded to the National Bee Unit to follow up. Many reports turn out to be similar looking insects to the yellow-legged hornet such as the native European hornet. Credible reports without enough evidence are either asked for more detail or forwarded to British Beekeepers Association Yellow-Legged (Asian) Hornet Teams, who help monitor for yellow-legged hornets in the suspect area. You can find your local Yellow-Legged (Asian) Hornet Team Coordinator on the BBKA’s website."
        }
    ]
}