{
    "url": "https://mhclgmedia.blog.gov.uk/2024/09/05/further-reporting-on-right-to-buy/",
    "title": "Further reporting on Right to Buy",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-09-05T19:05:33+01:00",
    "content": [
        {
            "text": "There has been widespread media reporting this week on the future of the Right to Buy scheme."
        },
        {
            "text": "We have no plans to abolish Right to Buy but instead we are reviewing the scheme more widely, which includes looking at eligibility criteria and increasing protections on newly-built social homes. A consultation on the scheme will be brought forward in the Autumn."
        },
        {
            "text": "We are facing the most acute housing crisis in living memory and social housing waiting lists remain far too high. That is why we are working at pace to reverse the continued decline in the number of social rent homes and deliver the biggest increase in affordable and social housing in a generation to stop people becoming homeless in the first place."
        },
        {
            "text": "As set out in our manifesto, we have already started to review the increased Right to Buy discounts that were introduced in 2012, with changes to be implemented in the Autumn."
        },
        {
            "text": "We have also already given councils more flexibility to use Right to Buy receipts to build and buy more social homes. This is on top of an additional £450 million for councils to secure homes for families at risk of homelessness."
        },
        {
            "text": "Ministers are committed to working closely with councils, including signatories of the Southwark report, to address the challenges that they are facing and have already begun talking to the sector."
        },
        {
            "text": "A Ministry of Housing, Communities and Local Government spokesperson said:"
        },
        {
            "text": "“Right to Buy remains an important route for council housing tenants to be able to buy their own home but it’s scandalous that only a third of council homes sold under the scheme have been replaced since 2012. That is why we are working at pace to reverse the continued decline of social rent homes."
        },
        {
            "text": "“Increasing protections on newly-built social homes and eligibility criteria will be looked at as part of our wider review but there are no plans to abolish the Right to Buy scheme.”"
        }
    ]
}