{
    "url": "https://socialcare.blog.gov.uk/2024/09/05/new-e-learning-tool-puts-prevention-first-in-social-care/",
    "title": "New e-learning tool puts prevention first in social care",
    "authors": [
        "Deborah Sturdy",
        "Professor Jamie Waterall"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Guidance",
        "Information sharing",
        "Innovation",
        "Technology and data",
        "Workforce"
    ],
    "pub_date": "2024-09-05T10:11:06+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making good ideas happen"
        },
        {
            "text": "Most people will support the idea that ‘prevention is better than cure’ but we know from both the data and our own professional and personal experiences, this is not always the reality."
        },
        {
            "text": "Although many people are living longer, we know that there are far too many people who are living with conditions which could have been prevented in the first place."
        },
        {
            "text": "We also know that many people die prematurely due to things which could have been avoided. That’s why it is so important that we make prevention everyone’s business."
        },
        {
            "text": "The social care workforce plays a hugely important role in public health, but this has not always been celebrated to the extent that it should be."
        },
        {
            "text": "With over 1.7 million people working in adult social care, the opportunities for taking a ‘prevention first’ approach is huge. Given that the workforce is imbedded in our communities and places, reaching millions of people every day, your impact on supporting people and families to live more independent, healthier lives for longer is huge."
        },
        {
            "heading": 2,
            "text": "Boost your public health confidence"
        },
        {
            "text": "To support you in your role, the Department of Health and Social Care (DHSC) and the Office for Health Improvement and Disparities (OHID) have worked with the Royal Society of Public Health and colleagues from across the social care sector to develop a new e-learning resource, which will help to increase your knowledge and confidence in public health approaches."
        },
        {
            "text": "We have tested the resource with those who work in adult social care, who have found it to be extremely helpful and say they would recommend it to their colleagues."
        },
        {
            "text": "The resource looks at ten areas, such as infection prevention control, mental health and wellbeing, and healthy aging. The resource has been designed specifically for people working in adult social care settings, providing practical advice and suggestions on how you can imbed public health approaches to your role."
        },
        {
            "text": "This could be related to things which you may want to consider for those people and families that you are supporting but will also consider your own health and wellbeing and those of the colleagues that you work with."
        },
        {
            "heading": 2,
            "text": "Explore the resource today"
        },
        {
            "text": "The training resource is free to access and has been designed in a way which allows you to explore those topics of most interest to you. We would recommend that you explore one or two areas to get started and then aim to cover all of the sections which you would fine most helpful."
        },
        {
            "text": "We recommend you share this with your colleagues and consider ways in which this could be promoted across the places that you work."
        },
        {
            "text": "Finally, we want to thank you and all our colleagues who work across social care for everything you do. By working together, we can make an even bigger impact on supporting people to live healthier lives longer."
        }
    ]
}