{
    "url": "https://nda.blog.gov.uk/sellafield-five-facilities-we-have-repurposed-to-support-mission-delivery/",
    "title": "Sellafield: Five facilities we have repurposed to support mission delivery",
    "authors": [
        "Billy Simpson"
    ],
    "categories": [
        "Mission delivery",
        "Waste management"
    ],
    "pub_date": "2024-09-05T10:43:59+01:00",
    "content": [
        {
            "text": "Sellafield is home to one of the biggest portfolios of major construction projects in the UK today."
        },
        {
            "text": "We’re building on an epic scale to provide safe and secure storage of nuclear waste and special nuclear materials."
        },
        {
            "text": "Sellafield is also home to more than 200 existing nuclear facilities."
        },
        {
            "text": "Some of them need to be emptied and decommissioned – our highest hazard buildings, the legacy ponds and silos."
        },
        {
            "text": "Some need to be demolished to make space for new facilities."
        },
        {
            "text": "And some hold the key to us being able to accelerate our work while we wait for new buildings to become available."
        },
        {
            "text": "Our teams have been working to repurpose 5 buildings at Sellafield, ensuring we get maximum value from them, for our mission and for the tax payer."
        },
        {
            "text": "Here is a quick look at what these 5 buildings have already delivered for Sellafield, and how they’re shaping up to deliver new missions."
        },
        {
            "heading": 3,
            "text": "1. Decontamination plant"
        },
        {
            "text": "The value it has already delivered"
        },
        {
            "text": "Sitting in the heart of our separation area – the oldest and most hazardous part of the Sellafield site – the decontamination plant did what it says on the tin."
        },
        {
            "text": "It decontaminated plant items from around the site, before it became redundant in 2018."
        },
        {
            "text": "It’s new mission"
        },
        {
            "text": "It is now home to equipment that is reducing the size of large intermediate level waste items so that they can be more efficiently stored in our Miscellaneous Beta Gamma Waste Store."
        },
        {
            "text": "Using a diamond wire cutter, the team is removing any areas of high contamination from items retrieved from one of our legacy storage ponds. The material can then be segregated into intermediate or low level waste."
        },
        {
            "text": "Processing the first item in this way – it was an old bogie ram – meant that we could save nearly £1 million in waste disposal costs because only 20% of the original item was intermediate level waste."
        },
        {
            "text": "The team is working on 18 different types of legacy pond items, gaining valuable insights into the techniques needed to address a range of other items from across the site."
        },
        {
            "heading": 3,
            "text": "3. Mox Demonstration Facility"
        },
        {
            "text": "It’s original purpose"
        },
        {
            "text": "The Mox Demonstration Facility was a pilot plant for mixed oxide fuel manufacturing and was replaced by the full scale Sellafield Mox Plant."
        },
        {
            "text": "It’s new mission"
        },
        {
            "text": "The building is now home to several active demonstrators, including the Alpha Sort and Segregate facility."
        },
        {
            "text": "Former laboratories are now a containment room where operators can safely ‘unwrap’ items sent to them for treatment."
        },
        {
            "text": "We’ve also incorporated technology from the pharmaceutical industry to build effective containment and contamination barriers."
        },
        {
            "text": "Teams in this facility are removing Plutonium Contaminated Material from items, so that all that remains is low-level waste rather than intermediate level waste, creating significant cost savings."
        },
        {
            "text": "The teams are currently working on more than 650 ‘legacy crates’ containing waste from some of the world’s earliest nuclear decommissioning efforts."
        },
        {
            "text": "Over the years, these crates have been overpacked to maintain their integrity, creating a ‘Russian Doll’ effect. We are now in the process of unpacking these layers and thanks to the Sort and Segregate facility, we can ensure that each element of waste is treated appropriately."
        },
        {
            "heading": 3,
            "text": "3. Rig Hall"
        },
        {
            "text": "It’s original purpose"
        },
        {
            "text": "The Rig Hall was a storage area for redundant test rigs."
        },
        {
            "text": "It’s new lease of life"
        },
        {
            "text": "The Rig Hall is now a fully functional training facility for operators who will work in one of our new, the Box Encapsulation Plant."
        },
        {
            "text": "Currently under construction and due to begin operations in 2027, the Box Encapsulation Plant will treat waste from our legacy facilities."
        },
        {
            "text": "The operators needed a place to practice using robotics for handling and categorising waste items in a non-active environment. So, they cleared out and re-homed the old equipment and installed a new concrete platform for the robots."
        },
        {
            "text": "Our pre-operations and craft teams are also making use of the new space to run through the logistics of remotely maintaining the robots. This setup not only adds resilience for Box Encapsulation Plant operations, it also provides the ability to house a ‘back-up’ robot, ready to be deployed if there’s a failure at the plant."
        },
        {
            "heading": 3,
            "text": "4. Thorp Receipt and Storage Pond"
        },
        {
            "text": "The value it has already delivered"
        },
        {
            "text": "The Thorp receipt and storage pond was the first step of the reprocessing journey in the plant. Fuel from oxide fuel reactors in the UK and abroad came to Sellafield and was placed in the pond to cool before it was moved to the main storage pond prior to reprocessing."
        },
        {
            "text": "Reprocessing in the plant stopped in 2018."
        },
        {
            "text": "It’s new mission"
        },
        {
            "text": "Since reprocessing stopped, we have continued to use the pond to store used fuel from EDF reactors across the UK."
        },
        {
            "text": "The new challenge our teams faced was how to maximise space in the pond."
        },
        {
            "text": "Enter the 63-can rack - a stainless-steel framework that can store 63 fuel cans in less space than the previous triple stacked 20-compartment skips. This innovation allows us to store more fuel in the pond."
        },
        {
            "text": "As nuclear fuel is hot more fuel means more heat, so we are improving our cooling system and have altered the pond chemistry to deal with prolonged storage of fuel."
        },
        {
            "text": "The fuel will remain here until a Geological Disposal Facility is available."
        },
        {
            "heading": 3,
            "text": "5. Encapsulated Product Stores"
        },
        {
            "text": "Their original mission"
        },
        {
            "text": "Our 3 Encapsulated Product Stores at Sellafield are highly engineered, heavily shielded storage facilities for Intermediate Level Waste."
        },
        {
            "text": "Their new mission"
        },
        {
            "text": "Our encapsulation plant teams have modified the stores so that they can receive and store waste that is being retrieved from one of our highest hazard facilities, the Magnox Swarf Storage Silo."
        },
        {
            "text": "Ultimately the waste will go to our new Box Encapsulation Plant when it comes online in 2027."
        },
        {
            "text": "Instead of delaying retrievals from the Silo until then, we’re making maximum use of the encapsulation plants."
        },
        {
            "text": "The changes that the team have made to the encapsulation plant include modifying a route once used to bring in solids from low active effluent treatment, introducing a robot to handle skips and adding new surveillance equipment."
        },
        {
            "text": "They have also modified a gamma gate (think nuclear rated transfer hatch) to accept new containers."
        }
    ]
}