{
    "url": "https://space.blog.gov.uk/2024/09/05/the-night-sky-in-september-3/",
    "title": "The night sky in September",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-09-05T10:26:19+01:00",
    "content": [
        {
            "text": "September is an exciting month for UK stargazers."
        },
        {
            "text": "There’s a chance to see a partial lunar eclipse and several of our Solar System’s planets. The autumn constellations make a return to our evening skies and you can join Moon-watchers from around the world by taking part in NASA’s ‘Observe the Moon’ night."
        },
        {
            "heading": 2,
            "text": "Partial lunar eclipse"
        },
        {
            "text": "In the early hours of 18 September, a tiny slice of the Moon will pass into the shadow of our planet and be eclipsed."
        },
        {
            "text": "The amount of the Sun’s light that reaches the surface of the Moon starts to reduce at around 01.40am in what is known as a ‘penumbral’ eclipse, as the Earth starts to move between the Sun and the Moon."
        },
        {
            "text": "On this occasion however, the three bodies are not perfectly aligned, so only a few percent of the Moon’s surface will enter the darker ‘umbral’ phase, passing into Earth’s shadow. UK stargazers will have to wait until September next year for a full lunar eclipse."
        },
        {
            "text": "This umbral phase begins shortly after 03.10am, and peaks at around 03.40am while the Moon is in the south-west."
        },
        {
            "heading": 2,
            "text": "NASA’s ‘Observe the Moon’ Night"
        },
        {
            "text": "14 September is NASA’s International ‘Observe the Moon’ night, where people from around the world will be watching our Moon on the same night. You can learn more about the Moon and find more information on the event, including a forum to share your photos, here."
        },
        {
            "text": "On that date here in the UK, the approximately 80% illuminated Moon rises in the south-east at around 7pm in the evening, reaches its highest point in the southern sky at just after 10pm, and sets in the south-west just before 2am."
        },
        {
            "text": "Orbital predictions indicate that the International Space Station, which is travelling around our planet at 28,000km/hour (17,500mph), will make a bright visible pass that same evening, appearing low in the south-west around 9.05pm."
        },
        {
            "text": "Within a minute or two the Space Station will be high in the southern sky, appearing to pass over the Moon and underneath bright star Altair, before disappearing from sight in the east a minute or so after that."
        },
        {
            "text": "The exact timings will vary slightly depending on your location, but you can find the timings for visible space station passes over your location here."
        },
        {
            "heading": 2,
            "text": "The Autumn Equinox"
        },
        {
            "text": "As darkness falls this month, all the celestial signs of summer are still there. Distinctive constellations Lyra, Cygnus and Aquila lie high in the southern sky, hosting the bright stars Vega, Deneb and Altair respectively."
        },
        {
            "text": "But stargazers may recognise some of the signs that the seasons are changing. Aside from the cooler nights, the autumnal constellations Andromeda, Perseus and Auriga can be seen rising in the east soon after dark."
        },
        {
            "text": "High overhead by midnight, the summer constellation of Cygnus has given way to the distinctive ‘W’-shaped autumnal constellation of Cassiopeia."
        },
        {
            "text": "On 22 September, Earth reaches the point in its orbit where the Sun is directly above the equator, neither pole of our planet is tilted more towards the Sun and the day and night is equal in length."
        },
        {
            "text": "This point in time is called an ‘equinox’, which is derived from the Latin words ‘equi’ (equal) and ‘nox’ (night), and this month’s marks the start of astronomical autumn."
        },
        {
            "heading": 2,
            "text": "The Planets"
        },
        {
            "text": "Early risers this month have a great opportunity to see some of the planets of our solar system.  Saturn is visible throughout the night, rising in the south-east as darkness falls, reaching its highest point in the south just after midnight."
        },
        {
            "text": "The ringed planet reaches ‘opposition’ this month – its closest point to Earth as the two planets orbit the Sun. This means it will be at its brightest in our night skies, and if you have a telescope it’s a great time to try and observe Saturn’s rings."
        },
        {
            "text": "After their close conjunction last month, Mars (now in the constellation of Gemini) and Jupiter (in the constellation of Taurus) both rise in the north-east before midnight, and sit high and bright in the south-eastern skies before dawn."
        },
        {
            "text": " "
        },
        {
            "text": "Will you be observing the Moon this month?  Share your photos with us on social media!"
        },
        {
            "text": " "
        }
    ]
}