{
    "url": "https://space.blog.gov.uk/2025/09/02/first-astronaut-with-a-disability-learns-to-fly/",
    "title": "First astronaut with a disability learns to fly",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space",
        "European Space Agency"
    ],
    "pub_date": "2025-09-02T10:18:47+01:00",
    "content": [
        {
            "text": "John McFall, who could become the world's first astronaut to be assigned to a long duration mission with a physical disability, is training to fly as part of his preparation for a ground-breaking space mission."
        },
        {
            "text": "John, who is based at the European Astronaut Centre in Cologne, Germany, is back in the UK to assess how his disability could affect Private Pilot Licence training."
        },
        {
            "text": "The assessment is being conducted with the charity Aerobility at Blackbushe Airport in Hampshire, as part of Fly! Mission Ready, which aims to put in place all the necessary actions to enable John’s potential assignment to a long-duration mission aboard the International Space Station."
        },
        {
            "text": "The former NHS surgeon was selected by the European Space Agency for a pioneering study on astronauts with physical disabilities in 2022."
        },
        {
            "text": "He achieved a historic milestone in 2024 by becoming the first person with a physical disability to be medically cleared for long-duration missions to the International Space Station."
        },
        {
            "text": "John said:"
        },
        {
            "text": "John, who lost his right leg in a motorcycle accident at 19 and went on to win bronze in the 100m sprint at the 2008 Beijing Paralympics before qualifying as a doctor, began the assessment with Aerobility in June and hopes to complete his PPL by October."
        },
        {
            "text": "He said:"
        },
        {
            "text": "Aerobility’s Chief Flying Instructor Al Rosser said:"
        },
        {
            "text": "Neil Tucker, a Trustee for Aerobility, added:"
        },
        {
            "text": "Matthew Cook, Head of Space Exploration at the UK Space Agency, said:"
        }
    ]
}