{
    "url": "https://teaching.blog.gov.uk/2025/09/02/from-reluctant-student-to-inspirational-teacher/",
    "title": "From reluctant student to inspirational teacher",
    "authors": [
        "Kieran Anderson"
    ],
    "categories": [
        "Inspiring teachers",
        "Teacher wellbeing",
        "Teaching profession"
    ],
    "pub_date": "2025-09-02T12:03:54+01:00",
    "content": [
        {
            "text": "Kieran Anderson's journey to teaching shows how lived experience becomes a powerful tool for motivating others."
        },
        {
            "heading": 2,
            "text": "Motivation to teach"
        },
        {
            "text": "Kieran Anderson's journey into teaching is unconventional yet deeply inspiring. Growing up, he struggled with school attendance and engagement, unable to recall a single positive teacher role model. \"I can't remember a favourite teacher. I never felt like I had a role model in school, and I feel that was half the reason that I never went. I was a persistent absentee.\""
        },
        {
            "text": "This absence of mentorship became the driving force behind his decision to enter education. Now an English teacher in a school serving a community similar to where he grew up, Kieran has become the role model he never had. \"I can now be that person for someone...if you can change just one person's life, then I've already succeeded.\""
        },
        {
            "text": "Beyond classroom teaching, Kieran runs after-school clubs for students facing challenges or disciplinary issues. These sessions explore protected characteristics from the Equality Act, reinforced through discussions about British values and their practical community application. He consolidates learning through social action projects. \"That's the moment where it clicks and how much people actually want to change and learn.\""
        },
        {
            "heading": 2,
            "text": "Finding direction through mentorship"
        },
        {
            "text": "Kieran's turning point came through Liam Watson at Middlesbrough Football Club Foundation, who recognised his potential and introduced him to community work. \"He kept me grounded and out of trouble by giving me purpose. I still speak to him now.\""
        },
        {
            "text": "Before teaching, Kieran worked in the police force but felt constrained by bureaucracy. \"There was so much paperwork. I felt like I didn't really help in the way I could, and that's what got me back into education.\""
        },
        {
            "text": "He entered teaching through an apprenticeship route, which proved essential to his success. Being based in one school allowed him to build strong relationships while developing his teaching style within a supportive environment. \"I could express myself in my teaching without feeling judged. That made all the difference.\""
        },
        {
            "heading": 2,
            "text": "Redefining role models"
        },
        {
            "text": "Kieran believes true role models are people with lived experience who have made mistakes and chosen to grow from them. \"A role model to me is someone who hasn't necessarily always got something right but has made the change and is showing others that change can be made.\""
        },
        {
            "text": "His students, many sharing similar backgrounds, see him as someone who genuinely understands their experiences. This connection breaks down barriers and builds trust. \"They know I'm here for them, not just for the money. They know I'm here to help and make them better.\""
        },
        {
            "heading": 2,
            "text": "The power of supportive culture"
        },
        {
            "text": "Initially nervous about teaching English as a new subject, Kieran found strength in his school's collaborative culture. Weekly department meetings, mentoring, and genuine collegiality helped him flourish. \"If I've had a really good lesson, the first thing I do is run out and tell someone. That culture has made a huge difference.\""
        },
        {
            "text": "This supportive environment enabled him to develop subject knowledge, experiment with strategies, and reflect on practice safely."
        },
        {
            "heading": 2,
            "text": "Transforming lives"
        },
        {
            "text": "Despite teaching's challenges, Kieran remains committed because of the transformative impact he witnesses. \"The students… the fact that you can support them and then come August when they're opening the envelopes….that's the day you look forward to.\""
        },
        {
            "text": "He recalls one student who previously faced suspension within minutes of arriving at school. Through consistent mentoring and trust-building, this student now attends regularly, participates in lessons, and reads aloud in class. \"He knows someone's there for him. I'm not going to let him down.\""
        },
        {
            "heading": 2,
            "text": "From accident to inspiration"
        },
        {
            "text": "On Thank A Teacher Day, Kieran was described as \"the accidental teacher\" who found his way into the profession by chance. However, his impact is profound. Kieran demonstrates how personal struggle can be transformed into purpose, and how lived experience becomes a powerful tool for motivating others."
        },
        {
            "text": "\"I love it here [at the school]. I love the job. I wouldn't change it for the world.\""
        },
        {
            "heading": 2,
            "text": "Find out more about teaching"
        }
    ]
}