{
    "url": "https://kingsawards.blog.gov.uk/2025/09/02/reagent-a-family-run-chemical-manufacturing-company-celebrate-their-kings-award-for-enterprise/",
    "title": "ReAgent, a family-run chemical manufacturing company, celebrate their King's Award for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Recipients"
    ],
    "pub_date": "2025-09-02T12:18:05+01:00",
    "content": [
        {
            "heading": 2,
            "text": "How did you hear about The King’s Awards for Enterprise?"
        },
        {
            "text": "We’ve known about the King’s Awards for many years as they’re widely recognised as the UK’s highest honour for business."
        },
        {
            "heading": 2,
            "text": "Why did you apply for the Awards?"
        },
        {
            "text": "We applied to acknowledge the scale of our international growth and the long-term relationships we’ve built with customers around the world. It was also a way to recognise the team whose work made that success possible - and it’s one of the most respected accolades a UK company can receive."
        },
        {
            "heading": 2,
            "text": "How did you find the application process?"
        },
        {
            "text": "It was detailed and rigorous, which is what you’d expect from an award of this calibre. It also gave us a valuable opportunity to reflect on our progress and clarify our long-term goals."
        },
        {
            "heading": 2,
            "text": "How does it feel to win?"
        },
        {
            "text": "It’s a huge honour, and a proud moment for the entire team."
        },
        {
            "heading": 2,
            "text": "How do you plan to celebrate?"
        },
        {
            "text": "We’ll be celebrating with the team in person -  they’ve all earned it! We’re also planning to mark the occasion more formally when the award presentation takes place."
        },
        {
            "heading": 2,
            "text": "How do you plan to use the award/ tell others about your success?"
        },
        {
            "text": "We’re sharing the news with our customers, partners, and community through our website, social media, and press. The King’s Award emblem is also a symbol of trust and quality which we’ll use proudly across our communications and materials."
        },
        {
            "heading": 2,
            "text": "What top tips do you have for others applying?"
        },
        {
            "text": "Be honest, be specific, and take the time to reflect on what makes your business different. Involve your team, as their insights and impact are part of your story."
        },
        {
            "text": "Find out more about ReAgent here."
        }
    ]
}