{
    "url": "https://charitycommission.blog.gov.uk/2025/09/02/reflections-on-the-consultation-for-the-charities-sorp-2026-from-the-charities-sorp-making-body/",
    "title": "Reflections on the consultation for the Charities SORP 2026 from the Charities SORP-making body",
    "authors": [
        "Joint Chairs of the Charities SORP Committee"
    ],
    "categories": [
        "Consultation"
    ],
    "pub_date": "2025-09-02T10:01:13+01:00",
    "content": [
        {
            "text": "The Charities SORP-making body (SMB)[1] would like to start by extending a sincere thanks to the nearly 150 individuals and organisations who took the time to share their views during our recent consultation phase."
        },
        {
            "text": "We are working to analyse your responses and carefully consider the various issues you have raised supported by our advisory SORP Committee. "
        },
        {
            "text": "Ahead of the publication of the new SORP[2], which is planned for this October, we offer a brief update of our current reflections on some of the key issues."
        },
        {
            "text": "We also want to remind charities that they need to get ready for some critical changes to requirements that are being introduced to the UK accounting standard known as ‘FRS 102’[3] and will apply to charities producing SORP accounts. "
        },
        {
            "text": "Get ready now: what won’t change"
        },
        {
            "text": "Changes to the accounting standard mean there is limited, or no room for manoeuvre around certain reporting requirements."
        },
        {
            "text": "Whatever the final shape of the new SORP, charities will need to get used to changes in the way they report lease arrangements that they have - which must now be included on the balance sheet, except where recognition exemptions apply.  We know from our consultation that some respondents believe that the SORP can change this requirement.  This change comes from FRS 102 and the SORP cannot change or override this requirement."
        },
        {
            "text": "Charities will also need to familiarise themselves with the new five-step revenue recognition model for income from exchange contracts."
        },
        {
            "text": "We have created helpful guidance to support charities navigate both these compulsory changes."
        },
        {
            "text": "Tiered reporting: broad support"
        },
        {
            "text": "The move to a three-tier reporting framework was well supported, with 89% of respondents endorsing the concept. However, there was no clear agreement on what the threshold levels should be. Many suggested raising the tier 1 ceiling above £500,000, and some proposed aligning thresholds with audit limits."
        },
        {
            "text": "We are aware of potential threshold changes outside of the SORP and are seeking to support a system which maintains simplicity and clarity in tier definitions. In addition, we are aware of jurisdictional differences in audit thresholds, which reinforce the need to avoid conflating the reporting frameworks. The SMB is considering all of the views received in determining the way forward with tiered reporting."
        },
        {
            "text": "Trustees’ Annual Report: promoting meaningful disclosure"
        },
        {
            "text": "Across the consultation, feedback on Module 1 of the SORP (Trustees’ Annual Report) has been largely positive. Support for prompt questions, sustainability reporting, and enhanced reserves disclosures show a healthy appetite for more transparent and thoughtful reporting - a major contributor to continued high-levels of trust in charities."
        },
        {
            "text": "Still, concerns were voiced about creating “tick-box” exercises and imposing burdens on small charities. Striking the right balance between compliance and communication is key."
        },
        {
            "text": "Technical Modules: complexity vs. clarity"
        },
        {
            "text": "Modules on lease accounting, income recognition, and social investments drew commentary around terminology and complexity."
        },
        {
            "text": "We appreciate the importance of not overloading the SORP with exhaustive detail. But we also recognise the need for well-signposted support materials that help charities navigate tricky terrain with confidence and we will be looking to work with partners in this space. This is particularly relevant where new or complex accounting treatments are concerned.  The more accessible the SORP is, the more confident charities can be in meeting their obligations and telling their stories well."
        },
        {
            "text": "What comes next?"
        },
        {
            "text": "The SORP-making body continues to consider the consultation feedback, alongside monitoring external developments.  We are finalising changes to the SORP ahead of submission to the Financial Reporting Council (FRC) for final approval. It’s clear that thoughtful refinements, informed by the consultation, will improve clarity, consistency, user understanding and promote public trust through clear, relevant and proportionate reporting."
        },
        {
            "text": "[1] The Charities SORP-making body comprises:"
        },
        {
            "text": "[2] Statement of Recommended Practice – Accounting and Reporting by Charities"
        },
        {
            "text": "[3] FRS 102 The Financial Reporting Standard applicable in the UK and Republic of Ireland"
        }
    ]
}