{
    "url": "https://defrafarming.blog.gov.uk/2025/09/02/talking-farming-face-to-face/",
    "title": "Talking farming, face to face ",
    "authors": [
        "Alice Brown"
    ],
    "categories": [
        "Conversations we're having"
    ],
    "pub_date": "2025-09-02T10:50:19+01:00",
    "content": [
        {
            "text": "If you’ve met someone from my team at an auction mart, a town hall, or an agricultural show, you’ve experienced a small part of what we call 'engagement.'"
        },
        {
            "text": "Engagement means having the right conversations with the right people at the right time. We do this year-round in different ways. "
        },
        {
            "text": "We hold regular calls with organisations that represent rural interests. "
        },
        {
            "text": "Online, we engage through the Farming blog and webinars, which help us reach thousands of people quickly. But we know not everyone wants to get their information from a screen. That’s why face-to-face engagement is just as important, as it allows us to meet people where they are. "
        },
        {
            "text": "The conversations my team and I have aren’t always easy, but they’re always open. There might be frustration or disagreement, but every time we hear from you, it’s valuable for us – and I hope for you too. Talking and listening to you helps us understand what’s working, what’s not, and the local challenges you’re dealing with – often before they show up in reports."
        },
        {
            "text": "We take what we hear back to the teams shaping policy. What you share – your experiences and the everyday detail – really brings these situations to life."
        },
        {
            "text": "Not everything can be changed immediately, but your feedback helps guide decisions and priorities. And if you need advice or support on a specific issue, we can point you to the right people or resources.  We’re typically joined by colleagues from the Rural Payments Agency (RPA) and Catchment Sensitive Farming (CSF)."
        },
        {
            "text": "Every year, we meet thousands of farmers at events all over the country. This year we’ve been to 60. And it’s not just our team.  "
        },
        {
            "text": "Both our farming minister Daniel Zeichner and Secretary of State, Steve Reed, have also been out and about, from the Royal Cornwall Show to the Great Yorkshire Show, hearing your views first-hand.  "
        },
        {
            "text": "We’re keen to keep up momentum."
        },
        {
            "text": "As we shape the roadmap for the future of farming, we want to hear from you. If you’d like to share your vision for farming in 2030 and 2050, you can find us at shows across the country for the rest of the summer. "
        },
        {
            "text": "You can see the events we’ve currently got lined up on the Talk to us page."
        },
        {
            "text": "I'll share them here for ease:"
        },
        {
            "text": "We’re always looking for new places to visit and new people to hear from. If you have ideas for where we could go next, whether it is a stand at a county show or a chat in a village hall, you can get in touch with me by leaving a comment below. And if you know friends, family, or neighbours who would benefit from a face-to-face conversation, send them our way. "
        }
    ]
}