{
    "url": "https://food.blog.gov.uk/2023/11/20/common-or-garden-antimicrobial-resistance-two-citizen-science-projects/",
    "title": "Common or Garden Antimicrobial Resistance - Two Citizen Science Projects",
    "authors": [
        "Amy Hale, Microbiological Risk Assessor"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-11-20T09:59:21+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Citizen science is a research method that involves engaging with communities and asking them to be part of scientific enquiry, either through engaging them in data collection or through other ways of co-creation."
        },
        {
            "text": "Citizen science offers learning opportunities for participants, the satisfaction of contributing to scientific evidence and the potential to influence policy. For us at the Food Standards Agency (FSA), it provides data, which is high in volume, has a wide geographical spread, is relatively quick to deploy and that we wouldn’t be able to access with traditional methods. As we all eat, and are all stakeholders in the wider food system, food is a topic particularly suited to exploration with citizen science approaches."
        },
        {
            "text": "Our Citizen Science Programme Review details several projects we have now completed. Two of our recent Citizen Science projects looked at the presence of antimicrobial-resistant organisms on home-grown food, and the bacterial species present on home chopping boards. The project utilised real homes and gardens, enlisting citizen scientists to provide us with data from real-world food usage."
        },
        {
            "text": "Antimicrobial Resistance (AMR) is one of the critical challenges facing microbiology today. It is a battle between bacteria and other organisms (most notably, us) of constant one-upmanship that has been waged for thousands of years. Our reliance on antibiotics both in medicine and food production has meant that AMR is becoming a more pressing issue. As we attempt to fight diseases that can cause harm, AMR delays treatment which means patients are infectious for longer and increases the risk of spreading resistant microorganisms to others."
        },
        {
            "heading": 2,
            "text": "Antimicrobial Resistance in the Garden"
        },
        {
            "text": "Although industrial food production has been studied for the presence of bacterial contamination and AMR microbes, home growing of produce has had comparatively little research. The project Citizen Science Antimicrobial Resistance (CSAMR) has sought to provide insight into the presence of these microbes in the garden environment, and how the produce grown in gardens may be impacted."
        },
        {
            "text": "CSAMR utilised members of the public who grow their own vegetables to take part in the study. By providing swabs of their lettuces whilst in the ground, and after preparation, we discovered which bacteria were present, and whether they showed AMR. The purpose of the study was not only to provide an analysis of the bacteria present and their AMR status but also to give us insight into the food preparation practices of participants."
        },
        {
            "text": "One of the most interesting conclusions found in the study was the observed link between animal presence in the garden and AMR microbes found on produce. The presence of cats and foxes in the garden showed a significant association with increased odds of AMR. Though, it is recognised that the presence of animals in gardens was speculative which would highlight an interesting area for future study."
        },
        {
            "text": "Participants fed back to researchers about their experience with an overwhelmingly positive result, for example, one participant said: “I enjoy participating in citizen science projects and like the idea that the public can contribute to scientific analysis.” "
        },
        {
            "text": "70% of participants said they learned something from being involved in the study. It is important to recognise everyone’s role in scientific advancement and studies like this can use the enthusiasm of home growers in our understanding of food systems."
        },
        {
            "text": "Read the report: Learnings from the pilot citizen science and AMR project."
        },
        {
            "heading": 2,
            "text": "Chopping Board Microbiome"
        },
        {
            "text": "The chopping board is a piece of kitchen equipment that is often understood to be contaminated by bacteria from food preparation. Kitchen cleaner companies will claim that chopping boards ‘have more bacteria than toilet seats’ but how true is this kind of claim? This citizen science project employed students from Aston University (as well as their friends and relatives) to swab their household’s chopping boards (made from both wood and plastic) with sponges which were then sent to the lab for testing."
        },
        {
            "text": "The findings from the study show gut bacteria was present on 44% and skin bacteria were present on 52% of chopping boards. Both gut and skin bacteria were isolated from 24% of chopping boards, and 28% of chopping boards harboured neither skin nor gut bacteria. As only 25 chopping boards were sampled, this study would ideally be repeated with more participants."
        },
        {
            "text": "One of the positive aspects to the study was the demographics of the participants involved. Often, it is difficult to have representation from minority ethnic (ME) groups especially ME women. Many of the participants were living in multi-generational households which also allows for more understanding of the ways in which this would impact the microbiome of the kitchen."
        },
        {
            "text": "Read the report: Exploring the chopping board microbiome"
        },
        {
            "heading": 2,
            "text": "Why are they relevant to the FSA?"
        },
        {
            "text": "Understanding how households grow and prepare food is an important and often overlooked aspect of research that can impact the safety of the food we eat. FSA guidance is based upon evidence gained from research so studies like this allow that guidance to be as accurate and realistic as possible. These studies also help to provide insight into the bigger picture of how our food systems directly impact our homes and gardens."
        },
        {
            "heading": 2,
            "text": "Does further research need to be done?"
        },
        {
            "text": "The small sample size of these studies suggests that further work should be done to get an accurate picture of both AMR in gardens and the microbiome of our kitchens. Citizen science projects are an excellent way to do this, as they provide real-world findings and allow participants to learn more about the microbiology of their homes."
        },
        {
            "heading": 1,
            "text": "Ymwrthedd Gwrthficrobaidd Cyffredinol neu yn yr Ardd: Dau Brosiect Gwyddoniaeth Dinasyddion"
        },
        {
            "text": "Dull ymchwil yw gwyddoniaeth dinasyddion sy’n cynnwys ymgysylltu â chymunedau a gofyn iddyn nhw fod yn rhan o ymholiad gwyddonol, naill ai drwy eu gwahodd i gasglu data neu drwy ffyrdd eraill o gyd-greu."
        },
        {
            "text": "I’r sawl sy’n cymryd rhan, mae gwyddoniaeth dinasyddion yn cynnig cyfleoedd dysgu, y boddhad o gyfrannu at dystiolaeth wyddonol a’r posibilrwydd o ddylanwadu ar bolisi. I’r Asiantaeth Safonau Bwyd (ASB), mae gwyddoniaeth dinasyddion yn darparu data, a llawer iawn ohono, sydd â gwasgariad daearyddol eang, sy’n gymharol gyflym i’w ddefnyddio, ac na fyddem yn gallu cael gafael arno drwy ddulliau traddodiadol. Gan fod pob un ohonom yn bwyta, ac yn rhanddeiliaid yn y system fwyd ehangach, mae bwyd yn bwnc sy’n arbennig o addas i’w archwilio gan ddefnyddio dulliau gwyddoniaeth dinasyddion."
        },
        {
            "text": "Mae ein hadolygiad o’r Rhaglen Wyddoniaeth Dinasyddion yn manylu ar sawl prosiect rydym bellach wedi’u cwblhau. Gwnaeth dau o’n prosiectau gwyddoniaeth dinasyddion diweddar archwilio presenoldeb organebau sydd ag ymwrthedd i gyffuriau gwrthficrobaidd ar fwyd wedi’i dyfu yn y cartref, a’r rhywogaethau bacteriol sy’n bresennol ar fyrddau torri mewn cartrefi. Roedd y prosiect yn defnyddio cartrefi a gerddi go iawn, gan sicrhau bod gwyddonwyr-ddinasyddion yn darparu data i’r ASB am sut y defnyddir bwyd yn y byd go iawn."
        },
        {
            "text": "Ymwrthedd gwrthficrobaidd (AMR) yw un o’r heriau allweddol y mae microbioleg yn eu hwynebu heddiw. Mae’n frwydr hirhoedlog rhwng bacteria ac organebau eraill (yn fwyaf nodedig, ni) o fod ar y blaen drwy’r amser; brwydr sydd wedi bod wrthi ers miloedd o flynyddoedd. Mae ein dibyniaeth ar wrthfiotigau mewn meddyginiaeth ac wrth gynhyrchu bwyd wedi golygu bod AMR yn dod yn fater pwysicach fyth. Wrth i ni geisio brwydro yn erbyn clefydau a all achosi niwed, mae AMR yn gohirio triniaeth, sy’n golygu bod cleifion yn heintus am fwy o amser, ac mae’n cynyddu’r risg o ledaenu micro-organebau ymwrthol i eraill."
        },
        {
            "heading": 2,
            "text": "Ymwrthedd gwrthficrobaidd yn yr ardd"
        },
        {
            "text": "Er bod astudiaethau i’w cael ar bresenoldeb halogiad bacteriol a microbau sydd ag ymwrthedd i gyffuriau gwrthficrobaidd wrth gynhyrchu bwyd mewn cyd-destun diwydiannol, nid oes llawer iawn o ymchwil wedi’i chynnal ar dyfu bwyd yn y cartref. Mae’r prosiect Ymwrthedd Gwrthficrobaidd Gwyddoniaeth Dinasyddion (CSAMR) wedi ceisio rhoi cipolwg ar bresenoldeb y microbau hyn yn yr ardd, a sut y gellir effeithio ar gynnyrch a dyfir mewn gerddi."
        },
        {
            "text": "Gwnaeth y prosiect CSAMR ofyn i aelodau o’r cyhoedd sy’n tyfu eu llysiau eu hunain gymryd rhan yn yr astudiaeth. Trwy ddarparu swabiau o’u letys yn y ddaear, ac ar ôl eu paratoi, gwnaethom ddarganfod pa facteria oedd yn bresennol, ac a oeddent yn dangos AMR. Diben yr astudiaeth oedd darparu dadansoddiad o’r bacteria sy’n bresennol a’u statws o ran AMR, yn ogystal â rhoi cipolwg ar arferion paratoi bwyd y sawl a oedd yn cymryd rhan yn yr astudiaeth."
        },
        {
            "text": "Un o’r casgliadau mwyaf diddorol a nodwyd yn sgil yr astudiaeth oedd y cysylltiad a welwyd rhwng presenoldeb anifeiliaid yn yr ardd a microbau ag ymwrthedd i gyffuriau gwrthficrobaidd a ddarganfuwyd ar gynnyrch. Roedd presenoldeb cathod a llwynogod yn yr ardd yn dangos cysylltiad arwyddocaol â mwy o AMR. Serch hynny, cydnabyddir bod presenoldeb anifeiliaid mewn gerddi yn ddamcaniaethol, ond gallai cynnal astudiaethau pellach ar hyn yn y dyfodol fod yn faes ymchwil diddorol."
        },
        {
            "text": "Roedd adborth cyfranogwyr i ymchwilwyr am eu profiad yn hynod gadarnhaol. Er enghraifft, dywedodd un cyfranogwr: “Rwy’n mwynhau cymryd rhan mewn prosiectau gwyddoniaeth dinasyddion ac yn hoffi’r syniad y gall y cyhoedd gyfrannu at ddadansoddi gwyddonol.” Dywedodd 70% o’r cyfranogwyr eu bod wedi dysgu rhywbeth drwy gymryd rhan yn yr astudiaeth. Mae’n bwysig cydnabod rôl pawb mewn datblygiadau gwyddonol, a gall astudiaethau fel hyn ddefnyddio brwdfrydedd y rheiny sy’n tyfu cynnyrch gartref i’n helpu i ddeall systemau bwyd yn well."
        },
        {
            "text": "Gwersi a ddysgwyd yn sgil y prosiect peilot ar wyddoniaeth dinasyddion ac AMR – Way, West et al."
        },
        {
            "heading": 2,
            "text": "Microbiom Byrddau Torri"
        },
        {
            "text": "Offer cegin yw byrddau torri, a’r ddealltwriaeth gyffredin sydd ar led yw eu bod yn cael eu halogi â bacteria wrth baratoi bwyd. Bydd cwmnïau glanhau ceginau’n honni bod gan fyrddau torri ‘fwy o facteria na seddi toiled’ ond pa mor wir yw’r math hwn o honiad? Fel rhan o’r prosiect gwyddoniaeth dinasyddion hwn, cyflogwyd myfyrwyr o Brifysgol Aston (yn ogystal â’u ffrindiau a’u perthnasau) i swabio’r byrddau torri (rhai pren a rhai plastig) yn eu cartrefi gan ddefnyddio sbyngau, a gawsant eu hanfon wedyn i’r labordy i’w profi."
        },
        {
            "text": "Mae canfyddiadau’r astudiaeth yn dangos bod bacteria’r perfedd yn bresennol ar 44% o fyrddau torri, a bod bacteria’r croen yn bresennol ar 52% o fyrddau torri. Cafodd bacteria’r perfedd a’r croen eu harunigo oddi ar 24% o fyrddau torri, ac nid oedd 28% o fyrddau torri’n cynnwys bacteria’r perfedd na bacteria’r croen. Gan mai dim ond 25 o fyrddau torri a samplwyd, yn ddelfrydol byddai’r astudiaeth hon yn cael ei chynnal eto gyda mwy o gyfranogwyr."
        },
        {
            "text": "Un o agweddau cadarnhaol yr astudiaeth oedd demograffeg y cyfranogwyr dan sylw. Yn aml, mae’n anodd cael cynrychiolaeth o grwpiau ethnig lleiafrifol, yn enwedig menywod o’r grwpiau hyn. Roedd llawer o’r cyfranogwyr yn byw mewn cartrefi aml-genhedlaeth, a oedd hefyd yn rhoi cyfle i ddeall yn well y ffyrdd y byddai hyn yn effeithio ar ficrobiom y gegin."
        },
        {
            "text": "Archwilio microbiom byrddau torri – gwersi a ddysgwyd. Goddard a Patemen."
        },
        {
            "heading": 2,
            "text": "Pam mae’r astudiaethau’n berthnasol i’r ASB?"
        },
        {
            "text": "Mae deall sut mae cartrefi’n tyfu ac yn paratoi bwyd yn agwedd bwysig ar ymchwil sy’n aml yn cael ei hanwybyddu a all effeithio ar ddiogelwch y bwyd rydym yn ei fwyta. Mae canllawiau’r ASB yn seiliedig ar dystiolaeth a geir o ymchwil, felly mae astudiaethau fel hyn yn sicrhau bod y canllawiau hynny mor gywir a realistig â phosib. Mae’r astudiaethau hyn hefyd yn helpu i daflu goleuni ar y darlun ehangach ynghylch sut mae ein systemau bwyd yn effeithio’n uniongyrchol ar ein cartrefi a’n gerddi."
        },
        {
            "heading": 2,
            "text": "Oes angen gwneud mwy o ymchwil?"
        },
        {
            "text": "Mae maint bach y samplau yn yr astudiaethau hyn yn awgrymu y dylid gwneud mwy o waith i gael darlun cywir o AMR mewn gerddi a microbiom ein ceginau. Mae prosiectau gwyddoniaeth dinasyddion yn ffordd wych o wneud hyn, gan eu bod yn darparu canfyddiadau o’r byd go iawn, ac yn galluogi cyfranogwyr i ddysgu mwy am ficrobioleg eu cartrefi."
        }
    ]
}