{
    "url": "https://teaching.blog.gov.uk/2023/11/20/teaching-awards-silver-winner-shares-tops-for-school-leaders/",
    "title": "Teaching Awards Silver Winner shares top tips for school leaders",
    "authors": [
        "Julie Deville"
    ],
    "categories": [
        "Inspiring teachers"
    ],
    "pub_date": "2023-11-20T13:47:52+00:00",
    "content": [
        {
            "text": "Award-Winning Julie Deville, CEO of Extol Academy Trust, talks about her career and shares some top tips for fellow school leaders."
        },
        {
            "text": "How did it feel to win a Silver National Teaching Award?"
        },
        {
            "text": "I am absolutely delighted to receive a Silver Award in the National Teaching Awards 2023 for Lifetime Achievement. This is a special year as The Teaching Awards Trust celebrates its 25th anniversary."
        },
        {
            "text": "The award is truly humbling and, as the product of a tough council estate, I feel a great sense of pride. Although, for me, it’s not just about personal achievement, it's also a testament to the collaborative and collective commitment of an entire educational community here in the North East."
        },
        {
            "text": "No one in education works in a vacuum and I thank my lucky stars that over my 37 year career I have worked alongside some amazing and dedicated colleagues. These colleagues have supported and inspired me throughout the years. Their belief and challenge have seen my career span from a Nursery Nurse to Headteacher and latterly CEO. The quote “standing on the shoulders of giants” comes to mind."
        },
        {
            "text": "Balancing the responsibilities of parenthood and pursuing the career I loved, has been a challenge and one I know many single parents face. My journey has been marked by perseverance, resilience, and a relentless determination to provide a better future for myself, my children and the children I serve. However, I wouldn’t want to understate the struggles, triumphs, and strategies needed to raft a career as a single mum."
        },
        {
            "text": "What are your top tips for school leaders?"
        },
        {
            "text": "Do you have any reflections from your career?"
        },
        {
            "text": "My career has been filled with inspiring moments, growth, and a deep sense of purpose. My journey has instilled in me a passion for talent spotting and nurturing the next generation of teachers and leaders. I feel a great sense of satisfaction knowing I have walked the journey with a number of now  Headteachers across the North East who are making a positive impact within their school communities."
        },
        {
            "text": "I do strongly believe that great education holds a sacred place in our society. It has the power to transform lives, break down barriers, and build a brighter future. Each day, educators step into classrooms armed not just with knowledge but with a profound sense of responsibility. As a collective, we have the privilege of igniting curiosity, nurturing talents, and instilling in our pupils and colleagues the belief that they can achieve greatness."
        },
        {
            "text": "The impact of a teaching hero extends far beyond the classroom, shaping the future of individuals and society as a whole. As educators we are essential pillars of our educational system, nurturing the leaders, innovators, and changemakers of tomorrow."
        },
        {
            "text": " "
        },
        {
            "text": "Nominate your colleagues for a National Teaching Award"
        },
        {
            "text": "Entries for the 2024 National Teaching Awards are now open. The awards are free and there are 16 individual and team categories covering the early years, primary, secondary and FE sectors, open to schools and colleges across the UK."
        },
        {
            "text": "Visit the National Teaching Awards website to enter now"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}