{
    "url": "https://opss.blog.gov.uk/2023/11/20/the-opss-regulatory-leaders-graduate-scheme-pave-your-way-to-becoming-one-of-our-regulatory-leaders/",
    "title": "The OPSS Regulatory Leaders Graduate Scheme: Pave your way to becoming one of our regulatory leaders",
    "authors": [
        "Simone King"
    ],
    "categories": [
        "Careers at OPSS",
        "Civil Service Careers",
        "Civil Service Graduate Schemes",
        "Graduate Scheme",
        "Vacancies"
    ],
    "pub_date": "2023-11-20T14:21:59+00:00",
    "content": [
        {
            "text": "We’re looking for people who are passionate about making a difference to join us on this exciting journey.  "
        },
        {
            "text": "The Regulatory Leaders Graduate Scheme (RLGS) offers real-world experience across a range of teams. "
        },
        {
            "text": "Over 30 months you will have 4 rotations within the pillar areas of the Office for Product Safety and Standards (OPSS) providing the opportunity for you to discover what roles really interest you and play to your strengths.   "
        },
        {
            "text": "Alongside the practical experience, you will participate in a learning and development programme designed to equip you with the skills and tools to be a future leader within the OPSS.   "
        },
        {
            "text": "At the end of the programme, you will have a permanent role within the OPSS and the opportunity to further develop and progress your career.   "
        },
        {
            "text": "Here, your personality and passion for effective regulation matter more to us than your employment or academic history.   "
        },
        {
            "text": "That’s why, even if you haven’t worked in regulation before, you could be the perfect fit for our exciting Regulatory Leaders Graduate Scheme, and you’ll be poised to embark on an exciting career pathway within the OPSS and on your way to becoming one of the very best regulatory leaders.  "
        },
        {
            "text": "We’re looking for people who are passionate about making a difference, helping to tackle market failures, promoting positive action, and enabling growth and productivity to join us on this exciting journey. The RLGS will enable you to be who you want to be in a growing, inclusive, and rewarding organisation that makes a difference and prevents product-related harm. "
        },
        {
            "heading": 3,
            "text": "About OPSS "
        },
        {
            "text": "View our YouTube video to see more about our work and who we are. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How to Apply "
        },
        {
            "text": "If you are excited about the prospect of contributing to product safety and making a meaningful impact, we encourage you to apply for this role. To do so, please click on the link to apply on Civil Service Jobs. "
        },
        {
            "text": "We are committed to creating an inclusive and diverse workforce, and we welcome applications from all backgrounds. If you require reasonable accommodations during the application or interview process, please don't hesitate to contact us.  "
        },
        {
            "heading": 3,
            "text": "Benefits "
        },
        {
            "text": "Alongside your salary of £31,443, the Department for Business and Trade contributes £8,489 towards you being a member of the Civil Service Defined Benefit Pension scheme.  "
        },
        {
            "heading": 3,
            "text": "Eligibility"
        },
        {
            "text": "Applications are open to everyone who meets the nationality requirements and has or is expecting to have by September 2024 a 2:2 or higher in any degree subject, including degree apprenticeships. There are no specific degrees required.  "
        },
        {
            "heading": 3,
            "text": "Important Dates "
        },
        {
            "text": "Don't miss your chance to become one of our regulatory leaders. Embrace the challenges, drive innovation, and elevate your career within the Civil Service. "
        },
        {
            "heading": 3,
            "text": "Visit our Careers Site to learn more about what we do"
        },
        {
            "text": "https://opss-careers.co.uk/ "
        }
    ]
}