{
    "url": "https://charitycommission.blog.gov.uk/2023/11/20/the-lease-based-model-of-supported-housing-charity-commission-view/",
    "title": "The lease-based model of supported housing – Charity Commission view",
    "authors": [
        "Helen Earner"
    ],
    "categories": [
        "Guidance",
        "Risk",
        "Trustees"
    ],
    "pub_date": "2023-11-20T15:47:22+00:00",
    "content": [
        {
            "text": "The supported housing sector is a space where many aspects of civil society come together to meet the needs of vulnerable people. Although supported housing can be provided by local authorities, housing associations and private landlords, in many cases supported housing is provided by charities."
        },
        {
            "text": "Charities are therefore an important part of the supported housing sector, helping their beneficiaries access specialised accommodation and support services to ensure their needs are met."
        },
        {
            "text": "As for all charities which provide services, particularly for vulnerable people, trustees need to be aware of and attentive to risks to both their beneficiaries or their charity. Having identified potential challenges in the supported housing sector, the Charity Commission wishes to make trustees of charities which provide supported housing aware of the risks associated with providing accommodation via the lease-based model."
        },
        {
            "text": "Supported housing and lease-based model defined"
        },
        {
            "text": "Supported housing is accommodation provided alongside support, supervision, or care to help people live as independently as possible in the community. Examples of supported housing may include group homes, hostels, refuges, supported living complexes and sheltered housing."
        },
        {
            "text": "Increasingly, the Commission is becoming aware of charities providing this type of accommodation via the lease-based model. This is where a charity does not own the properties through which it provides accommodation but instead holds lease agreements with an individual or entity such as an investor or property developer."
        },
        {
            "text": "In some instances, a charity may even sell property that it owns to a third party and then lease the property back from that third party so that it can provide accommodation."
        },
        {
            "text": "The key risks associated with the lease-based model"
        },
        {
            "text": "The lease based model of providing supported housing presents a number of potential risks which you, as a trustee of a charity providing supported accommodation, need to consider before making such an arrangement, and/or manage once entered into. These risks include:"
        },
        {
            "text": "Commission guidance"
        },
        {
            "text": "As the regulator of charities, a key part of our role is to alert the sector to emerging risks so that trustees can take the appropriate action. Although the Commission urges charities to be mindful of these risks, we accept that, in certain circumstances, the lease-based model of providing supported housing can allow charities to provide services to a greater number of beneficiaries."
        },
        {
            "text": "In such circumstances, we expect that you, as trustees and charity leaders, will have considered the following guidance and ensure you discharge your duties:"
        },
        {
            "text": "Alongside understanding, and following, the above guidance, trustees must assess the risks associated with the lease-based model to their charity, taking appropriate advice where necessary. Fulfilling these duties will help you ensure that you charity can thrive, delivering positive outcomes for your beneficiaries."
        }
    ]
}