{
    "url": "https://stratcommand.blog.gov.uk/2023/11/20/tri-service-competition-ends-in-medals-for-the-royal-gibraltar-regiment-catering-team/",
    "title": "Tri-Service competition ends in medals for the Royal Gibraltar Regiment Catering Team.",
    "authors": [
        "chloehobbs"
    ],
    "categories": [
        "Gibraltar",
        "International",
        "Overseas Bases",
        "Training"
    ],
    "pub_date": "2023-11-20T10:43:38+00:00",
    "content": [
        {
            "text": "Two members of the Royal Gibraltar Regiment catering team have been awarded medals at Exercise Joint Caterer."
        },
        {
            "text": "Corporal Gareth Walton and Private Dominic Salmon who represented the Royal Gibraltar Regiment (RG) were both awarded bronze medals in their respective categories. The competition, which attracts hundreds of chefs from across the Army, Royal Air Force and Royal Navy, allows participants to display their skills and demonstrate the role military caterers play in the delivery of an effective Armed Forces."
        },
        {
            "text": "The two-day event which took place at the Exhibition Centre (NAEC) Stoneleigh gave the RG chefs an opportunity to compete against some of the Armed Forces’ top chefs. This competitive environment also allowed for some great learning and gave them a chance to perfect their techniques. Both Cpl Walton and Pte Salmon were rewarded with a bronze medal in the Restaurant Dessert category."
        },
        {
            "text": "Pte Salmon has also now been selected to represent the British Army Culinary Arts Team (BACAT) for 2024. The first competition is the 48th Joint Culinary Training Exercise (JCTE) which will be held in Fort Gregg-Adams, Virginia, USA on 27 February."
        },
        {
            "text": "When asked what his favourite part of the event was, Pte Salmon said, “Meeting lots of people from different units and working in a different environment was really enjoyable”."
        }
    ]
}