{
    "url": "https://nationalscreening.blog.gov.uk/2023/11/20/uk-nsc-welcomes-major-new-prostate-cancer-screening-research/",
    "title": "UK NSC welcomes major new prostate cancer screening research  ",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-11-20T10:13:37+00:00",
    "content": [
        {
            "text": "Prostate cancer is the most common cancer in men in the UK with 1 in 8 men being diagnosed with prostate cancer in their lifetime."
        },
        {
            "text": "There is currently no screening programme for prostate cancer in the UK. This is because the prostate specific antigen (PSA) blood test, which is usually the first step towards a diagnosis, is not nearly accurate enough as a primary screening test."
        },
        {
            "text": "The PSA test misses lots of prostate cancers that might benefit from treatment and PSA levels can be raised when there is no prostate cancer present. The PSA test also detects disease that would not cause problems in a man’s lifetime, leading to many cases of overtreatment and serious side effects."
        },
        {
            "text": "The UK National Screening Committee (UK NSC) is therefore very excited by the news, announced on International Men’s Day, of a major new prostate cancer screening trial backed by £42 million of funding from Prostate Cancer UK and the government."
        },
        {
            "text": "The TRANSFORM randomised controlled trial will aim to establish if various testing strategies, including using MRI scans up front for screening, could tip the balance in favour of a screening programme by detecting disease that PSA testing alone misses and by reducing the amount of insignificant disease found."
        },
        {
            "text": "Prof Sir Mike Richards, Chair of the UK National Screening Committee, said:"
        },
        {
            "text": "In the meantime, the UK NSC is itself commissioning a review of updated evidence on prostate cancer screening in response to 6 submissions that were put forward during its annual call for topics:"
        },
        {
            "text": "This UK NSC review will consider evidence on the use of MRI scans in the diagnostic pathway for early detection of disease."
        },
        {
            "text": "Prof Richards added:"
        },
        {
            "text": "We will keep you updated on the UK NSC’s prostate cancer screening evidence review via this blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}