{
    "url": "https://naturalengland.blog.gov.uk/2023/11/20/world-childrens-day-for-every-child-every-right/",
    "title": "World Children’s Day: for every child, every right",
    "authors": [
        "Martin Gilchrist"
    ],
    "categories": [
        "Climate change",
        "Coast and access",
        "Education",
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2023-11-20T16:31:29+00:00",
    "content": [
        {
            "text": "“Let’s give children opportunities to fall in love with nature because you protect what you love.” — Andrea Koehle Jones"
        },
        {
            "text": "Today is World Children's Day and celebrates the power of children to change the world and to support their rights and participation in both conversations and actions that build a better world."
        },
        {
            "text": "The United Nations Sustainable Development Goals are designed to radically improve the lives of people and the planet by 2030. The goals call for improvements in the environment so that everyone can benefit from clean air, safe water, nutritious foods and biodiversity-rich natural spaces. Every child has a right to a safe and liveable planet so that they can rest, relax, play and thrive."
        },
        {
            "text": "Nature provides the perfect setting for this, and we’ve all watched and wondered why children love to jump in puddles, make mudpies, run down hills flat-out, climb trees to dizzying heights. Reminding us we were once young and fearless. The excitement and adventures are obvious."
        },
        {
            "text": "Many of us aspire to create a happy and healthy society and one way to do this is to support the connection people have with nature, which provides better mental and physical health. For children, the effects are more profound, with a wealth of evidence showing those who spend time outside connecting with nature see improvements in school attendance, behaviours, academic achievement, and social skills like teamwork. "
        },
        {
            "text": "Natural England has been working to support time in nature at school and beyond for over a decade. Most recently our Children and Nature Programme produced learning from this to support schools to successfully embed outdoor learning into their day-to-day activities and to inform the development of the Department for Education’s National Education Nature Park which aims to ensure that nature is at the heart of education and learning."
        },
        {
            "text": "At Natural England we are strong supporters of the National Education Nature Park which is working to empower children and young people to make a positive difference to both their own future and that of the natural world. This initiative will provide educators with the resources, support and guidance needed to put nature at the heart of education. Embedding nature across everyday teaching and learning will give every child and young person in England the opportunity to develop a meaningful connection to nature, contribute to nature recovery across the country and build resilience for a changing world. This is even more important in a changing climate: healthy natural systems help us to reduce and adapt to climate change and understanding our place in the world matters more than ever."
        },
        {
            "text": "The National Education Nature Park is delivering on commitments in the Environmental Improvement Plan such as to ‘ensure learning in and about nature happens at every level of education’ but also with a wider focus ‘…to ensure that anyone can reach green or blue space within 15 minutes from their front door’ and remove barriers that prevent people from accessing these spaces, including canals, rivers and the sea."
        },
        {
            "text": "This is important as for many children and young people school provides a place where they can be in, and connect, with nature that otherwise might not feature in their day. Green spaces at school, provide a vital place where children can learn about and develop a relationship with the natural world, and reap the essential mental health and wellbeing benefits from time spent in nature."
        },
        {
            "heading": 3,
            "text": "#ForEveryChild, Every Right!"
        },
        {
            "text": " "
        }
    ]
}