{
    "url": "https://civilservice.blog.gov.uk/2025/12/03/how-dhsc-is-delivering-for-the-british-public/",
    "title": "How DHSC is Delivering for the British Public",
    "authors": [
        "Sam Jones"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-12-03T12:27:24+00:00",
    "content": [
        {
            "heading": 2,
            "text": "How DHSC is Delivering for the British Public"
        },
        {
            "text": "In part three of our series spotlighting civil servants driving the government’s Plan for Change, we meet Samantha Jones, Permanent Secretary at the Department for Health and Social Care. "
        },
        {
            "text": "From tackling childhood obesity to revolutionising how we book GP appointments, DHSC is driving a transformation of health and care in England. Samantha Jones, who started her career as a nurse 37 years ago, explains how the department is delivering the government's pledge to build an NHS fit for the future - and why technology, prevention, and community care are at the heart of that change."
        },
        {
            "text": "If you had to explain what your Mission is about to a member of the public in a lift in 30 seconds, what would you say?"
        },
        {
            "text": "Our job is to improve the health and care of the population we serve. Everything we do is about keeping people well for longer, fitter for longer, and supporting them to have the best life possible."
        },
        {
            "text": "Practically, what has actually been achieved on this goal since it began?"
        },
        {
            "text": "We published the 10 Year Health Plan in July, setting out a clear roadmap with three big shifts: analogue to digital, sickness to prevention, and hospital to community. It means making the best use of our resources, including through digital technology, preventing illness for as long as possible. And if they do have an underlying health condition, keeping them as well as possible.  "
        },
        {
            "text": "Other successes have included delivering an extra 5.2 million appointments, recruiting over 2,500 additional GPs, and launching NHS League Tables so people can see how their local hospital is performing. We’ve also legislated for new restrictions on unhealthy food and drink to tackle obesity. As the mother of 16-year-old twins, that’s particularly close to my heart. It’s a generational shift that will make a big difference. "
        },
        {
            "text": "What's the one moment in the past three months that made you think, \"This is why I do this job\"?"
        },
        {
            "text": "The north star for all of us in DHSC is to improve the health and care of the nation. As an example of how we’re supporting this, we are already seeing the NHS app in action. 39.5 million people now use it - that’s three in four adults. One in four patients registered with a GP have logged into the app, and primary care appointments booked through it are up 8% on the year before. People are ordering repeat prescriptions digitally, up by 33% in the last year, accessing care at a time that’s convenient to them. That reduces workload at GP surgeries and gives people control over their healthcare. "
        },
        {
            "text": "Combined with ambient voice technology, where AI takes the notes of an appointment, which a clinician then checks, supporting extra outpatient capacity, and areas such as the long-term work on obesity and tobacco, we’re seeing real change happening now whilst building for the future."
        },
        {
            "text": "Name one barrier standing between you and your goal - and how are you smashing through it?"
        },
        {
            "text": "Deep breath - the size and scale of the challenge! Lord Darzi’s independent investigation set it out clearly. But the opportunity is that everyone cares deeply about the NHS and health. The 10 Year Health Plan shows where we’re taking health for the next decade, and we’re getting everyone behind it because it matters to every single one of us."
        },
        {
            "text": "What's your biggest win that nobody's talking about yet, but should be shouting from the rooftops?"
        },
        {
            "text": "The fact that technology really is changing the way that we’re doing things, because it makes a difference to the individual citizen. We know people care about this because the 10 Year Health Plan was built on one of the largest conversations about the NHS in history. Over 250,000 ideas from the public, all synthesised to identify the key themes. "
        },
        {
            "text": "It wasn’t written by someone in a room by themselves. It came from people asking, “Why can’t I book my GP appointment online?” or “Why can’t I see my records online? Why do I have to repeat my story so many times?” "
        },
        {
            "text": "That’s why we’re focusing on prevention through things like tobacco and vape restrictions, why we’re investing in technology, and why we’re shifting to community-based care. It’s what people told us they wanted."
        },
        {
            "text": "What's the biggest myth about your delivery area, you'd love to bust right now?"
        },
        {
            "text": "That we’re just the Department for the NHS. We’re the Department of Health and Social Care in its broadest sense - life sciences, innovation, technology, accelerating the development of new drugs. And social care is fundamental to what we do. That’s something we feel particularly strongly about here. "
        },
        {
            "text": "We have the Casey Commission but in addition, the work on The Fair Pay Agreement as an example in social care demonstrates we’re serious about the whole system."
        },
        {
            "text": "Finally, what gets you out of bed in the morning?"
        },
        {
            "text": "I’ve worked in health for nearly 37 years, starting as a nurse a long time ago. What gets me out of bed is seeing the impact we are having, can have, and will have on the health of the nation we serve."
        },
        {
            "text": "This series runs from 10 November to 15 December, where we quiz senior leaders on their department’s goals, what progress they’re making, and the challenges they face."
        }
    ]
}