{
    "url": "https://mhclgdigital.blog.gov.uk/2025/12/03/mapping-the-housing-safety-and-quality-system/",
    "title": "Mapping the housing safety and quality system",
    "authors": [
        "System Design Team"
    ],
    "categories": [
        "Design",
        "System Design"
    ],
    "pub_date": "2025-12-03T09:58:38+00:00",
    "content": [
        {
            "text": "The System Design team at the Ministry of Housing Communities and Local Government (MHCLG) includes designers, researchers and analysts. We bring user-centred design and systems thinking skills to complex building safety challenges. Our work involves doing projects with policy teams and strategic systems thinking."
        },
        {
            "text": "Where we live has a huge impact on our lives. The safety, quality and sustainability of our homes is part of a vast and complex system. Our first big job as a new team was to help make sense of that system, and support others in the department to have a shared view of that complexity to better inform policy development and decision making."
        },
        {
            "heading": 2,
            "text": "What we did"
        },
        {
            "text": "At the end of 2024, we were asked to visualise and research how the housing safety and quality system is working in practice."
        },
        {
            "text": "Our first step was to gain a base understanding of the people in the system, their roles and responsibilities, and what policies say should be happening. When we say ‘people in the system’, that includes everyone from regulators, to people working in construction, those providing insurance and finance, and of course residents. "
        },
        {
            "text": "We then did primary research with people working in the system to understand their behaviours, relationships and experiences. We used our research to map how different parts of the system interact, understand how people experience the system, and identify levers for change. "
        },
        {
            "text": "We turned our research into tools and reports to ensure our policy colleagues can easily access insights to make decisions and develop policies for the future. Visit our GitHub repository to view the resources resulting from our research."
        },
        {
            "heading": 2,
            "text": "What we learnt"
        },
        {
            "heading": 3,
            "text": "Regulatory complexity is currently difficult to navigate"
        },
        {
            "text": "When mapping the different organisations and activities involved in regulating and setting standards within the system, we found over 75 organisations from government regulators to private standard setting organisations. Those organisations enforce and work to over 70 pieces of legislation. The people who design, build and maintain every home need to navigate that complexity. Depending on their role, professionals might also work to professional standards as well. We heard that complexity and ambiguity in regulations has left some people unsure of their roles, responsibilities and expectations of others, even where they understand and agree with a policy's underlying aims."
        },
        {
            "text": "All of the insights, reports and maps from our work support policymakers to consider the whole regulatory landscape when they’re designing and bringing in changes."
        },
        {
            "heading": 3,
            "text": "Role-based profiles help identify impacts beyond the surface"
        },
        {
            "text": "We heard about issues relating to recruiting, training and retaining skilled staff across key roles. There are many systemic root causes for these issues, which we are looking to explore further. In particular, local and national regulators reported capacity and capability struggles which can impact regulation  enforcement activity, proactive work and the ability to build trust between teams."
        },
        {
            "text": "We created role-based profiles to help policy and delivery teams think about the changes they are making to the system, and how it impacts different roles. They also help policy teams to think about the cumulative impact of changes in the system, and how this adds up over time."
        },
        {
            "heading": 2,
            "text": "People are always at the heart of the system"
        },
        {
            "text": "People are always at the heart of the system. Housing quality and safety impacts residents the most, but they often have the least influence within the system. Vulnerable residents can be worried about and experience more barriers when accessing support. Concern about and perception of risk also impact how people – from regulators to residents – make decisions across the system. "
        },
        {
            "text": "It’s people who ultimately shape activity in the system. Their actions will be shaped by policies and services, but also by their own experiences. So, we need to design with people's emotions, relationships and perceptions in mind."
        },
        {
            "text": "That’s why our team is bringing user-centred research and system design into policy processes. We want to ensure that the experiences of those most affected by changes are considered when designing policy, and that the people at the heart of the system are being supported."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "If you want to learn more, you can access versions of our maps and reports on our GitHub repository. This includes:"
        },
        {
            "text": "If you’d like to get involved in our research, or hear more about our work, you can sign up to take part in our user research sessions or email us at SystemDesignTeam@communities.gov.uk."
        }
    ]
}