{
    "url": "https://marinedevelopments.blog.gov.uk/2025/12/03/new-guidance-published-the-consenting-lifecycle-of-marine-geological-co%e2%82%82-stores/",
    "title": "New guidance published: The Consenting Lifecycle of Marine Geological CO₂ Stores",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-12-03T09:56:23+00:00",
    "content": [
        {
            "text": "We are pleased to share that the Department for Energy Security and Net Zero has published a new guidance document, The Consenting Lifecycle of Marine Geological CO₂ Stores. The MMO has been closely involved in shaping this guidance, with our Marine Planning and Marine Licensing teams contributing expertise throughout its development. Our involvement helps ensure the guidance reflects practical regulatory experience and provides developers with greater clarity on how MMO processes fit within the wider carbon storage consenting pathway."
        },
        {
            "text": "The document is designed to support early and effective engagement between regulators and industry and is based on information available as of 31 May 2025. While informative and comprehensive, it should not be considered legal advice."
        },
        {
            "text": "This document outlines the roles and responsibilities of organisations involved in the consenting lifecycle of marine geological carbon dioxide storage in the UK, serving as a reference for the regulatory framework and key interaction points. It is intended to aid the carbon storage sector by providing a common reference framework. This will assist the understanding of the complexities of the carbon storage consenting process, allowing organisations to engage with the appropriate bodies in a timely manner, facilitating the consenting process. The sector's stakeholders have expressed strong endorsement for such a resource. The government had made it a core aim to kickstart growth by streamlining development processes and decision-making, thereby reducing the regulatory burden on businesses and investors. This document serves as an initial step by outlining current roles and processes. By providing a common foundation, the document enables developers to navigate the regulatory landscape with greater efficiency and confidence. This alignment with government goals not only facilitates smoother planning but also helps propel the UK towards a more sustainable and economically robust future."
        },
        {
            "text": "The full guidance is now available on GOV.UK: Marine geological carbon dioxide stores: consenting lifecycle."
        }
    ]
}