{
    "url": "https://prisonjobs.blog.gov.uk/2022/04/09/the-skills-you-need-to-be-a-community-payback-supervisor/",
    "title": "The skills you need to be a Community Payback supervisor",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation",
        "Uncategorized",
        "Ways of working"
    ],
    "pub_date": "2022-04-09T09:51:15+01:00",
    "content": [
        {
            "text": "Community Payback (CP) supervisors play a key part in supporting people on probation to do unpaid work to improve local communities and get their lives back on track. If you're a people person and looking for a rewarding career where you can make a real difference, find out more and take a look at our latest vacancies."
        },
        {
            "text": "Barbara, who’s done the job for 22 years, gives us an insight into what makes a good CP supervisor."
        },
        {
            "text": "We spend up to 7 hours a day with people on CP projects – often for many weeks. So, first and foremost, you’ve got to be a people person. If you can relate to the people in your group, in the main they’ll respond positively to you. Yes, people on probation have committed an offence, but they’re people just like you and me."
        },
        {
            "text": "Of course, you do sometimes get individuals who are disruptive and seem determined to make everyone’s day as difficult as possible. And it’s then that it’s important to try to understand why they’re behaving like that. Sometimes, it can simply be because it’s the weekend and they’re resenting missing out on the football, or spending time with their kids, partner or mates. Or, more often than not, they don’t think they should have been sentenced to CP and have to do unpaid work."
        },
        {
            "text": "Good communication skills are important"
        },
        {
            "text": "If people aren’t being co-operative or are disrupting the group, I’ll take them to one side for a chat. Listening, understanding and relating to what people have to say about their personal situation, can help improve their attitude and co-operation. I find that spending time working alongside them, talking, and discussing their concerns, can sometimes be all it takes."
        },
        {
            "text": "Your really do need good communication skills, patience, and a sense of humour. It’s not just what you say that can make a difference, but how you say it. And getting people to think more positively. Even if it’s focusing on the date of their last CP session, rather than dwelling on the total number of hours they need to complete, can set someone’s mood for the day."
        },
        {
            "text": "‘Walk a mile in their shoes’"
        },
        {
            "text": "I’m a very hands-on supervisor and always work alongside my group, while supervising and instructing them. I do  the same tasks as them – whether that’s restoring furniture for a local refugee charity, litter picking in a local park, or painting church railings."
        },
        {
            "text": "For me, it’s all about ‘walking a mile in their shoes’: understanding what it feels like being on CP, and the impact it may be having on their families."
        },
        {
            "text": "I enjoy new challenges and getting to know new people, learning as much from them as hopefully they learn from me."
        },
        {
            "text": "Making a difference"
        },
        {
            "text": "I enjoy seeing the difference we make working in, and with, the community. Looking back at the end of the day and reflecting on what we’ve achieved – the number of fence panels we’ve painted or the number of bags of leaves we’ve collected – is rewarding. It’s great seeing the sense of satisfaction and pride this can give to the people in my groups."
        },
        {
            "text": "It’s a great job. Every day, every group and every project is different. And I still enjoy getting up and going to work."
        }
    ]
}