{
    "url": "https://healthmedia.blog.gov.uk/2022/03/22/actiononcancer/",
    "title": "Government action on cancer",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-03-22T11:40:14+00:00",
    "content": [
        {
            "text": "Earlier this year, on World Cancer Day, the Health and Social Care Secretary  made clear that tackling cancer is a priority. We committed to making this country’s cancer outcomes the best in Europe over the next 10 years. "
        },
        {
            "text": " "
        },
        {
            "text": "In order to do this, we launched a Call for Evidence so we could hear directly from cancer patients, healthcare staff and any else who wanted to have their say – and there are just 10 days left to respond."
        },
        {
            "text": " "
        },
        {
            "text": "The responses will help inform our new 10-Year Cancer Plan – and we want as many people as possible to tell us what they think. "
        },
        {
            "text": " "
        },
        {
            "text": "The following Q&A helps explain why we’re taking this approach, and what else we’re doing to tackle cancer.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why do we need a 10 year plan?"
        },
        {
            "text": "Cancer remains the biggest cause of death from disease in the UK and the Covid pandemic has had a serious effect on care and services, with people not coming forward for checks."
        },
        {
            "text": "As the NHS tackles the Covid backlog, we want to diagnose more cancers early, and put more focus on innovative treatments."
        },
        {
            "text": "Having a longer term plan means we can set our sights on bigger ambitions, including being be able to harness the amazing efforts shown in development of the Covid vaccines, and see how we could use that expertise for cancer patients’ benefit. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What are we doing to tackle the existing backlogs and waiting times for cancer care?"
        },
        {
            "text": " "
        },
        {
            "text": "The NHS is working incredibly hard to offer all cancer patients the best possible care in a timely way. "
        },
        {
            "text": " "
        },
        {
            "text": "In some key areas cancer services proved very resilient to the pandemic. In chemotherapy, the latest statistics show that 99% of NHS patients have received their subsequent treatment within 31 days, against a target of 98%. In radiotherapy, 94% of patients have received their subsequent treatment within 31 days, against a target of 94%. "
        },
        {
            "text": " "
        },
        {
            "text": "In areas where the pandemic had more impact on the NHS and led to backlogs developing, such as cancer surgery, we know we have more to do. This is why we are investing £1.5 billion over the next three years in expanded NHS treatment capacity."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why aren’t we using the private sector to tackle this? "
        },
        {
            "text": " "
        },
        {
            "text": "We already have many existing suppliers for cancer treatments and therapies, in both the NHS and independent (private) sector. "
        },
        {
            "text": " "
        },
        {
            "text": "In fact, we currently have more than enough capacity in certain therapies including chemotherapy, radiotherapy and proton beam - which means we are treating almost everyone on time. "
        },
        {
            "text": " "
        },
        {
            "text": "Our strategy once published will set out our long-term plan, and in the meantime we’re providing billions of pounds worth of investment into our NHS to increase the number of scans, tests and operations it can carry out. This includes using the independent sector where appropriate to carry out procedures or treatments where the need is urgent or demand is outstripping supply."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}