{
    "url": "https://dluhcdigital.blog.gov.uk/2022/03/22/exciting-next-steps-for-local-digital-and-cyber/",
    "title": "Exciting next steps for Local Digital and Cyber",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Cyber",
        "Local Digital",
        "Local Digital Declaration",
        "Local Digital Fund",
        "Local Digital Team"
    ],
    "pub_date": "2022-03-22T13:50:43+00:00",
    "content": [
        {
            "text": "The Local Digital and Cyber teams are going to be making some exciting changes over the next few months, backed by multi-year funding to the tune of £85 million."
        },
        {
            "text": "We’re developing an enhanced approach that will allow us to support the local government sector to achieve even more brilliant things, as well as fix the core problems."
        },
        {
            "text": "Read on to find out about our plans, how we got here, and what this means for local government."
        },
        {
            "heading": 2,
            "text": "Our progress to date"
        },
        {
            "text": "The Local Digital Collaboration Unit launched in 2018 to support a digital community that was drawn together around the Local Digital Declaration."
        },
        {
            "text": "We’ve achieved a lot in four years, including:"
        },
        {
            "text": "We’ve had many successes, but now it’s time to look ahead. We want to take on some of the key challenges the sector faces and fix the structural issues that hold us back."
        },
        {
            "text": "Last Autumn’s Budget and Spend Review not only recognised our achievements to date, but has given us a mandate to go further with multi-year funding. This will enable us to plan our work for the next three years and be even more ambitious, which is a really exciting next step for us."
        },
        {
            "heading": 2,
            "text": "What we’ve learnt"
        },
        {
            "text": "We’re now at a stage where we have a better understanding of what works—from how we engage with our Declaration signatories, to how we work with councils, to how we provide continued support and funding to our projects—but we’re ready to take it further."
        },
        {
            "text": "Our approach has always been to support the Local Digital community to deliver more user-centred, cost-effective and secure local public services. This won’t change, and neither will the core principles of the Declaration."
        },
        {
            "text": "We want to expand on that approach, but embed it to an even greater extent into council's core systems. This will make it easier for councils to respond to user needs and drive improvements when it comes to the delivery of public services."
        },
        {
            "text": "Through our Cyber workstream, we’ve seen how the threat of cyber attacks on councils is ever present. Our greater reliance on technology since the pandemic has made it even more urgent that we develop systems that are secure by design and move away from legacy systems, which are both a cyber risk and a blocker to the delivery of modern, user-friendly services."
        },
        {
            "heading": 2,
            "text": "What we want to achieve"
        },
        {
            "text": "We know that a longer-term programme of work is needed. Multi-year funding gives us the ability to act on what we’ve learnt, scale up our support and really tackle the key challenges head-on."
        },
        {
            "text": "To focus our efforts, we’ve identified five core objectives that will form the foundation of the programme:"
        },
        {
            "heading": 2,
            "text": "What this means for local government"
        },
        {
            "text": "In the Local Digital Declaration we outline our commitment to working with councils as equal partners to create the tools and conditions for reform—but how will this work in practice to drive change within local government?"
        },
        {
            "text": "The programme will give councils the opportunity to work more closely with us to address specific problems, and to make sure they have the tools, funding and capability to deliver better services."
        },
        {
            "text": "We hope it will give councils greater choice, help to improve standards, and make it easier to move away from legacy systems and embrace modern alternatives."
        },
        {
            "text": "Our experience has also taught us that cyber and digital are two sides of the same coin. That’s why our Cyber and Local Digital teams will be working more closely with councils, and each other, to develop replicable solutions for building resilience to cyber threats."
        },
        {
            "text": "In addition to this, our teams will provide a clearer set of best practice standards following the Government Cyber Security Strategy 2022-2030, which highlighted the greater need for the public sector to act as one to improve cyber defences to meet the growing threat."
        },
        {
            "heading": 2,
            "text": "What happens now"
        },
        {
            "text": "As always, we want to co-create our plans with councils, and we're already starting to engage with them about our plans for the next three years."
        },
        {
            "text": "This Spring, we’re hosting a series of regional roadshows where councils can share their challenges and ideas with us through interactive workshops and discussion."
        },
        {
            "text": "There’s still time to register for the North East Roadshow on Thursday 31 March, and we’ve also organised a number of other roadshows around the country in May and June. We hope you’ll be able to join us."
        },
        {
            "text": "We will also be scaling up the Local Digital and Cyber teams over the coming months to help us deliver these programmes. If you’re interested in joining the team, make sure to keep a close eye on our channels for career opportunities."
        },
        {
            "heading": 2,
            "text": "Follow our progress"
        },
        {
            "text": "We’ll be sharing further updates on our plans on the DLUHC Digital Blog and across our usual channels, so stay in touch to find out more:"
        }
    ]
}