{
    "url": "https://food.blog.gov.uk/2022/03/22/food-hypersensitivity-perspectives-and-practice-symposium-2022-the-role-of-local-authorities-and-businesses/",
    "title": "Food Hypersensitivity Perspectives and Practice Virtual Symposium 2022 – The role of local authorities and businesses",
    "authors": [
        "Rebecca Sudworth, Director of Policy"
    ],
    "categories": [
        "Allergy"
    ],
    "pub_date": "2022-03-22T12:05:35+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Rebecca Sudworth, FSA Director of Policy, reflects on the recent Food Hypersensitivity Perspectives and Practice Symposium, and how local authorities and businesses can support the food hypersensitive consumer."
        },
        {
            "text": " "
        },
        {
            "text": "On 10 March 2022 I chaired our Food Hypersensitivity Symposium alongside Professor Robin May, the FSA’s Chief Scientific Adviser. Our first blog reflecting on the symposium came from Robin, who spoke about the scientific, psychological and clinical perspectives of food hypersensitivity (FHS). In this second blog, I will be looking at some of the good practice and advice that exists for embedding allergen management in both local authorities and business environments."
        },
        {
            "heading": 2,
            "text": "Putting food hypersensitivity into practice"
        },
        {
            "text": "A large part of our work involves collaborating with local authorities and food businesses to ensure allergens are effectively managed and controlled. We have run several communications campaigns on allergens with the purpose being to educate and support people, and to help improve the lives of consumers living with them. Most recently, we launched our Speak Up For Allergies campaign for 2022, which encourages young people to support their friends with food allergies and advises food businesses to ensure their staff have good, up-to-date knowledge of allergies, as well as embedding effective allergen management within their day-to-day processes such as this handy allergen checklist."
        },
        {
            "text": "We recognise food businesses are still dealing with the consequences of COVID-19. However, the safety of individuals with FHS continues to be a key priority, so we want to support businesses, particularly those who are small-to medium-sized, with their allergen management. We provide free online allergen training on our website for food businesses and local authorities, and a wide range of supporting guidance. By working closely with local authorities, we help to ensure consumer information is accurate, accessible and easy to understand."
        },
        {
            "text": "The last decade has seen many developments in allergen management which have impacted food businesses and local authorities alike. This includes the introduction of the new allergen labelling legislation for prepacked for direct sale foods (PPDS), known as Natasha’s Law. We also recently launched a consultation on Precautionary Allergen Labelling (PAL) to help collect information and views relating to PAL labelling often seen as ‘may contain’ labelling on food products. The consultation will enable the FSA to gather views on how to ensure PAL works for food businesses and keeps consumers safe, without limiting their food choice."
        },
        {
            "text": "We have just completed a 4-month pilot of a reporting tool which allowed consumers with an allergy, intolerance or coeliac disease to report any reaction, or ‘near misses’ they had with foods. We are reviewing the data collected, alongside other options for gathering information on reactions to determine the next steps."
        },
        {
            "text": "We are also exploring options for improving safety and trust for people with FHS when they purchase food outside of the home, for example from restaurants, cafes and takeaways. As part of this work, we are considering the potential of a Food Allergy Safety Scheme to help consumers make choices when they eat out. The different options for progressing this work will be considered by the FSA Board later this year."
        },
        {
            "heading": 2,
            "text": "The role of local authorities"
        },
        {
            "text": "Dilys Harris, Senior Trading Standards Officer at Caerphilly County Borough Council was one of our guest speakers at the symposium. Dilys spoke about the council’s work to help local business and communities to effectively manage food hypersensitivities. Dilys was the Chartered Trading Standards Institute Hero 2021 award winner for her role in developing and producing an online multilingual allergen resource for use in England, Wales and Northern Ireland."
        },
        {
            "text": "This resource, which launched in September 2021, is highly important for consumers with FHS as it helps ensure food safety messages and resources are published in multiple languages to assist communities that don’t have English or Welsh as a first language. Dilys commented on the need for the resource, which helps businesses to improve safety, choice and quality of life for individuals with FHS. The resource plays a huge part in minimising risk around food allergens and Dilys has received lots of positive feedback on the impact it has made in local communities."
        },
        {
            "heading": 2,
            "text": "The role of food businesses"
        },
        {
            "text": "We welcomed Ashleigh Moore, Group Food Safety & Retail Technical Manager at Greggs plc, who shared their experiences of implementing and embedding allergen management processes. Ashleigh is responsible for food safety across all Greggs supply sites and retail shops, which includes accountability for the dissemination and application of food law with regards to policy, procedure and practical implementation. There are now 2,000 Greggs shops in the UK, and allergen management is a top priority for the business, its staff, supply sites and retail shops. Staff at Greggs undertake mandatory allergen training, including refresher sessions and focus weeks, but Ashleigh emphasised that this training is only the first step within their robust package of allergen management processes."
        },
        {
            "text": "In recent years, Greggs have taken practical measures to ensure allergen management is properly embedded, including setting up an Allergen Working Group, which meets fortnightly and deals with customer complaints around allergens, as well as tracking allergen trends to inform the continuous improvement of their products."
        },
        {
            "heading": 2,
            "text": "Helping schools manage allergies"
        },
        {
            "text": "We were also joined by Sarah Baker, Campaigns Manager from Anaphylaxis Campaign and Maggie Young, Communications and Public Affairs Manager from Allergy UK. Maggie and Sarah discussed the importance of implementing allergy management processes in schools and a new model policy which has recently launched. Schools have a responsibility to keep pupils with FHS safe, and the policy has been developed to help them create and maintain a safe environment."
        },
        {
            "text": "Maggie explained that as schools already have so many policies, they needed to make the new policy as straightforward and easy to access as possible. Sarah and Maggie emphasised the importance of implementing effective risk assessment processes, as well as explaining how crucial it is for all staff to undergo appropriate training to keep children safe. Not only does the model policy include tips and guidance on risk assessment, but it also features links to free training and tips for catering staff."
        },
        {
            "text": "It was great to hear from all our speakers. Each presentation was informative and contributed to some very interesting panel discussions. I encourage businesses and local authorities to carry on with the fantastic work they are doing, and I hope we continue to share information and good practice to minimise risk and improve the lives of those with FHS."
        },
        {
            "text": "The Symposium will be available to view-on-demand by registered delegates on the event website until mid-June 2022, and we will also be sharing the presentations on our YouTube channel in the next few weeks."
        },
        {
            "heading": 1,
            "text": "Symposiwm Rhithwir 2022 yr Asiantaeth Safonau Bwyd ar Safbwyntiau ac Arferion Gorsensitifrwydd i Fwyd – rôl awdurdodau lleol a busnesau"
        },
        {
            "text": "Ar 10 Mawrth 2022 bûm yn cadeirio ein Symposiwm ar Orsensitifrwydd i Fwyd gyda’r Athro Robin May, Prif Gynghorydd Gwyddonol yr Asiantaeth Safonau Bwyd (ASB). Gwnaeth Robin fyfyrio ar y symposiwm yn ein blog cyntaf gan drafod safbwyntiau gwyddonol, seicolegol a chlinigol ar orsensitifrwydd i fwyd. Yn yr ail flog hwn, bydda i’n edrych ar rai o’r arferion da a’r cyngor sy’n bodoli ar gyfer ymgorffori dulliau rheoli alergenau mewn awdurdodau lleol a busnesau."
        },
        {
            "heading": 2,
            "text": "Rhoi gorsensitifrwydd i fwyd ar waith"
        },
        {
            "text": "Mae rhan fawr o’n gwaith yn ymwneud â chydweithio ag awdurdodau lleol a busnesau bwyd er mwyn sicrhau bod alergenau’n cael eu rheoli’n effeithiol. Rydym ni wedi cynnal nifer o ymgyrchoedd cyfathrebu ar alergenau. Diben yr ymgyrchoedd hyn yw addysgu a chefnogi pobl, a helpu i wella bywydau defnyddwyr sydd â gorsensitifrwydd i fwyd. Yn fwyaf diweddar, gwnaethom lansio ein hymgyrch ‘Codi Llais Dros Alergeddau’ ar gyfer 2022. Mae’r ymgyrch yn annog pobl ifanc i gefnogi eu ffrindiau sydd ag alergeddau bwyd ac yn cynghori busnesau bwyd i sicrhau bod gan eu staff wybodaeth dda a chyfoes am alergeddau. Mae hefyd yn sicrhau bod y busnesau hynny’n ymgorffori dulliau rheoli alergenau’n effeithiol fel rhan o’u prosesau pob dydd fel y rhestr wirio alergenau ddefnyddiol hon."
        },
        {
            "text": "Rydym ni’n cydnabod bod busnesau bwyd yn delio ag effeithiau Covid o hyd. Fodd bynnag, mae diogelwch unigolion sydd â gorsensitifrwydd i fwyd yn parhau i fod yn flaenoriaeth allweddol. Felly rydym am gefnogi busnesau, yn enwedig y rheiny sy’n fach neu’n ganolig eu maint, i reoli alergenau. Rydym ni’n cynnig hyfforddiant alergenau ar-lein rhad ac am ddim i fusnesau bwyd ac awdurdodau lleol, yn ogystal ag ystod eang o ganllawiau ategol. Trwy weithio’n agos gydag awdurdodau lleol, rydym ni’n helpu i sicrhau bod yr wybodaeth sydd ar gael i ddefnyddwyr yn gywir, yn hygyrch ac yn hawdd i’w deall."
        },
        {
            "text": "Yn ystod y degawd diwethaf, gwelwyd llawer o ddatblygiadau ym maes rheoli alergenau sydd wedi effeithio ar fusnesau bwyd ac awdurdodau lleol. Mae hyn yn cynnwys cyflwyno deddfwriaeth labelu alergenau newydd ar gyfer bwyd wedi’i becynnu ymlaen llaw i’w werthu’n uniongyrchol (PPDS), a elwir yn Gyfraith Natasha. Fe wnaethom hefyd lansio ymgynghoriad ar Labelu Alergenau Rhagofalus (PAL) yn ddiweddar i helpu i gasglu gwybodaeth a safbwyntiau sy’n ymwneud â labelu alergenau rhagofalus, a welir yn aml fel labeli ‘gallai gynnwys’ ar gynhyrchion bwyd. Bydd yr ymgynghoriad yn galluogi’r ASB i gasglu safbwyntiau ar sut i sicrhau bod Labelu Alergenau Rhagofalus yn gweithio i fusnesau bwyd ac yn cadw defnyddwyr yn ddiogel, heb gyfyngu ar eu dewis bwyd."
        },
        {
            "text": "Rydym newydd gwblhau cynllun peilot a barodd 4 mis ar gyfer adnodd rhoi gwybod am alergenau. Roedd yr adnodd yn galluogi defnyddwyr sydd ag alergedd bwyd, anoddefiad bwyd neu glefyd seliag i roi gwybod am unrhyw adweithiau neu ‘achosion a fu’n agos at ddigwydd’ (near misses). Rydym wrthi’n adolygu’r data a gasglwyd, ochr yn ochr ag opsiynau eraill ar gyfer casglu gwybodaeth am adweithiau i benderfynu ar y camau nesaf."
        },
        {
            "text": "Rydym hefyd yn archwilio opsiynau ar gyfer gwella diogelwch a hyder pobl sydd â gorsensitifrwydd i fwyd pan fyddant yn prynu bwyd y tu allan i’r cartref, er enghraifft mewn bwytai, caffis a siopau tecawê. Fel rhan o’r gwaith hwn, rydym ni’n ystyried Cynllun Diogelwch Alergeddau Bwyd posib i helpu defnyddwyr i wneud dewisiadau pan fyddant yn bwyta allan. Bydd Bwrdd yr ASB yn ystyried y gwahanol opsiynau ar gyfer datblygu’r gwaith hwn yn ddiweddarach eleni."
        },
        {
            "heading": 2,
            "text": "Rôl awdurdodau lleol"
        },
        {
            "text": "Roedd Dilys Harris, Uwch Swyddog Safonau Masnach yng Nghyngor Bwrdeistref Sirol Caerffili, yn un o’n siaradwyr gwadd yn y symposiwm. Siaradodd Dilys am waith y cyngor i helpu busnesau a chymunedau lleol i reoli gorsensitifrwydd i fwyd yn effeithiol. Dilys oedd enillydd gwobr Arwr Sefydliad Siartredig Safonau Masnach 2021, a hynny am ei rôl wrth ddatblygu a chynhyrchu adnodd alergenau amlieithog ar-lein y gellir ei ddefnyddio yng Nghymru, Lloegr a Gogledd Iwerddon. Mae’r adnodd hwn, a lansiwyd ym mis Medi 2021, yn hynod bwysig i ddefnyddwyr sydd â gorsensitifrwydd i fwyd. Mae’n helpu i sicrhau bod negeseuon ac adnoddau diogelwch bwyd yn cael eu cyhoeddi mewn sawl iaith i gynorthwyo’r cymunedau hynny nad yw’r Gymraeg na’r Saesneg yn iaith gyntaf iddynt. Soniodd Dilys am yr angen am yr adnodd, sy’n helpu busnesau i wella diogelwch, dewis ac ansawdd bywyd unigolion sydd â gorsensitifrwydd i fwyd. Mae’r adnodd yn chwarae rhan enfawr wrth leihau’r risg ym maes alergenau bwyd ac mae Dilys wedi cael llawer o adborth cadarnhaol ar yr effaith y mae wedi’i chael ar gymunedau lleol."
        },
        {
            "heading": 2,
            "text": "Rôl busnesau bwyd"
        },
        {
            "text": "Fe wnaethom ni groesawu Ashleigh Moore, Rheolwr Technegol Diogelwch Bwyd a Manwerthu Grŵp yn Greggs plc, a rannodd ei phrofiadau o weithredu ac ymgorffori prosesau rheoli alergenau. Mae Ashleigh yn gyfrifol am ddiogelwch bwyd ar draws safleoedd cyflenwi a siopau manwerthu Greggs, sy’n cynnwys atebolrwydd am ledaenu a chymhwyso cyfraith bwyd mewn perthynas â pholisi, gweithdrefnau, a gweithredu ymarferol. Erbyn hyn mae 2,000 o siopau Greggs yn y Deyrnas Unedig, ac mae rheoli alergenau yn brif flaenoriaeth i’r busnes, ei staff, y safleoedd cyflenwi a’r siopau manwerthu. Mae staff Greggs yn ymgymryd â hyfforddiant gorfodol ar alergenau, gan gynnwys sesiynau gloywi ac wythnosau ffocws. Fodd bynnag, pwysleisiodd Ashleigh bod yr hyfforddiant hwn yn rhan fach yn unig o’u pecyn adnoddau cadarn ar gyfer prosesau rheoli alergenau. Yn ystod y blynyddoedd diwethaf, mae Greggs wedi cymryd camau ymarferol i sicrhau bod dulliau rheoli alergenau wedi’u hymgorffori’n iawn, gan gynnwys sefydlu Gweithgor Alergenau, sy’n cwrdd bob pythefnos ac yn delio â chwynion cwsmeriaid ynghylch alergenau, yn ogystal ag olrhain tueddiadau o ran alergenau i wella eu cynhyrchion drwy’r amser."
        },
        {
            "heading": 2,
            "text": "Helpu ysgolion i reoli alergeddau"
        },
        {
            "text": "Ymunodd Sarah Baker, Rheolwr Ymgyrchoedd o Ymgyrch Anaffylacsis a Maggie Young, Rheolwr Cyfathrebu a Materion Cyhoeddus o Allergy UK â ni hefyd. Trafododd Maggie a Sarah bwysigrwydd gweithredu prosesau rheoli alergeddau mewn ysgolion a pholisi enghreifftiol newydd sydd wedi’i lansio’n ddiweddar. Mae gan ysgolion gyfrifoldeb i gadw disgyblion sydd â gorsensitifrwydd i fwyd yn ddiogel, ac mae’r polisi wedi’i ddatblygu i’w helpu i greu a chynnal amgylchedd diogel. Esboniodd Maggie bod angen iddynt sicrhau bod y polisi newydd mor syml â phosib a’i fod yn hawdd cael gafael arno, a hynny oherwydd bod gan ysgolion gynifer o bolisïau eisoes. Pwysleisiodd Sarah a Maggie bwysigrwydd gweithredu prosesau asesu risg effeithiol, yn ogystal ag egluro pa mor hanfodol yw hi i bob aelod o staff gael hyfforddiant priodol i gadw plant yn ddiogel. Mae’r polisi enghreifftiol yn cynnwys cyngor a chanllawiau ar ddulliau asesu risg yn ogystal â dolenni i hyfforddiant am ddim a chyngor i staff arlwyo."
        },
        {
            "text": "Roedd yn wych clywed gan ein holl siaradwyr. Roedd pob cyflwyniad yn addysgiadol ac yn cyfrannu at drafodaethau diddorol iawn ymhlith y panel. Rwy’n annog busnesau ac awdurdodau lleol i barhau â’r gwaith gwych y maent yn ei wneud, ac rwy’n gobeithio y byddwn ni’n parhau i rannu gwybodaeth ac arferion da i leihau risgiau a gwella bywydau’r rheiny sydd â gorsensitifrwydd i fwyd."
        },
        {
            "text": "Bydd cynrychiolwyr a gofrestrodd ar gyfer y Symposiwm yn gallu ei wylio ar-alw ar wefan y digwyddiad tan ganol mis Mehefin 2022. Byddwn hefyd yn rhannu’r cyflwyniadau ar ein sianel YouTube yn ystod yr wythnosau nesaf."
        }
    ]
}