{
    "url": "https://buyingforschools.blog.gov.uk/2022/03/22/get-help-buying-for-schools-2/",
    "title": "Get help buying for schools",
    "authors": [
        "Louise Green, Engagement and Information Manager"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-03-22T09:57:10+00:00",
    "content": [
        {
            "text": "What is this new service all about? We went to the source and asked how this is going to help school buyers."
        },
        {
            "text": "On 1 February 2022 the Department for Education (DfE) launched a new, free procurement support service called Get help buying for schools. The new service aims to help those in schools responsible for buying goods and services to get the best value for money."
        },
        {
            "text": "School business professionals have told us that buying goods and services for their school can sometimes be quite challenging, you have concerns about buying compliantly and unsure if you are getting value for money."
        },
        {
            "text": "We have, over the last four years taken account of this and everything we have learned from the DfE pilot school buying hubs. The results have provided valuable insight in to how we can best support schools and trust to buy goods and services and make savings."
        },
        {
            "text": "But we wanted to know more about what the new service looks like, what value it adds and most importantly how easy is for a school buyer to use. So we went to Rachel Cammiss, the service owner and Kevin Draisey head of our new procurement support team and put these questions to them."
        },
        {
            "text": "We first spoke to Rachel Cammiss, who, as service owner has been responsible for developing and delivering the new service."
        },
        {
            "heading": 3,
            "text": "What is our vision for Get help buying for schools’?"
        },
        {
            "text": "Our vision for the new service is to empower every school with the capability to deliver best value from their buying for the benefit of every pupil."
        },
        {
            "heading": 3,
            "text": "What are our aims for Get help buying for schools’?"
        },
        {
            "text": "Developing the service, we sought insight from those we are looking to support, and that feedback informed the key aims we set out to achieve. Namely that Get help buying for schools:"
        },
        {
            "heading": 3,
            "text": "What is the Get help buying for schools’ service?"
        },
        {
            "text": "Get help buying for schools is a free and impartial service delivered directly by the DfE. It will give schools general guidance on procurement and specific advice on buying specific goods and services for their school through a DfE-approved framework."
        },
        {
            "heading": 3,
            "text": "Who can access the Get help buying for schools’ service?"
        },
        {
            "text": "The service is available for all state-funded schools in England. The service includes general guidance on buying goods or services for schools and specific advice on buying goods or services for your school through a DfE-approved framework."
        },
        {
            "heading": 3,
            "text": "How do I access the Get help buying for schools’ service?"
        },
        {
            "text": "All buying guidance is available through GOV.UK buying for schools and the Buying Procedures manual."
        },
        {
            "text": "Some schools will already be familiar with our Find a Framework online tool that helps users to identify relevant DfE approved frameworks to meet their specific needs and the benefits each deliver."
        },
        {
            "text": "There are a wide range of goods and services available through DfE approved frameworks, everything from furniture to ICT and catering to MFDs. Each of the frameworks have been approved for use by schools by the DfE based on the quality of service and value they provide."
        },
        {
            "text": "Using frameworks also ensures that schools are buying goods and services in a legally compliant way."
        },
        {
            "heading": 3,
            "text": "Are any further updates expected to the new service?"
        },
        {
            "text": "Yes, this is just the start. We want to make sure that insight and feedback on how the new service is meeting the needs of school buyers is constantly captured."
        },
        {
            "text": "We have plans to build on the existing procurement guidance on GOV.UK Buying for schools, expand the Create a Specification tool, which currently covers catering and multi-functional printing and scanning devices (MFDs), to include more categories of spend and increase the advice and support schools can get from our Procurement Operations team if they need it."
        },
        {
            "text": "Next up, we wanted to know more about how the new service will help people who buy goods and service for schools."
        },
        {
            "text": "Kevin Draisey, Head of Procurement Operations for Get help buying for schools was the person to answer those questions as he leads our team of procurement experts. We asked Kevin about how his team will support users that may need additional one-to-one help and guidance."
        },
        {
            "heading": 3,
            "text": "How will the procurement team help? "
        },
        {
            "text": "The new service has enhanced the support available within Find a Framework, schools can now request advice and guidance on buying goods and services by clicking ‘Request advice and guidance’. You will be asked to complete a few details and then your request will be sent through to our procurement team."
        },
        {
            "heading": 3,
            "text": "How will the procurement team help?"
        },
        {
            "text": "On receipt of a request for help, my team aim to be in touch within two working days to discuss how they can support you."
        },
        {
            "text": "Once you have submitted a request for support you will receive a confirmation email with your reference number. You can reply to this email to provide further information or to request an update."
        },
        {
            "heading": 3,
            "text": "Can users get advice and support for using a non-DfE approved framework through Get help buying for schools?"
        },
        {
            "text": "There are over 50 DfE approved frameworks covering a wide range of goods and services for the things schools buy regularly. Currently, Get help buying for schools can only offer advice for using DfE-approved frameworks through Find a DfE-approved framework on GOV.UK."
        },
        {
            "text": "Each framework has been approved for use by schools by the DfE based on the quality of service and value they provide. They are assessed for compliance with procurement regulations, ease of use, suitability, and value for money."
        },
        {
            "text": "These criteria are intended to reassure you that the framework has been thoroughly benchmarked and deemed suitable for a school to consider."
        },
        {
            "heading": 3,
            "text": "If I use the service, am I committed to accept the recommendation?"
        },
        {
            "text": "Schools have the freedom to make their own decisions based on individual need and circumstances and we recognise that other organisations and suppliers may be suitable for your school. You are not obligated to use the frameworks on GOV.UK."
        },
        {
            "heading": 3,
            "text": "What more will your team offer in the future?"
        },
        {
            "text": "We have great plans for the future to develop and enhance our service, we will:"
        },
        {
            "text": "Thanks to both Rachel and Kevin."
        }
    ]
}