{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/22/improving-knowledge-exchange-programmes-in-government-academia-and-industry/",
    "title": "Improving knowledge exchange programmes in government, academia, and industry",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities",
        "Latest Stories"
    ],
    "pub_date": "2022-03-22T17:02:11+00:00",
    "content": [
        {
            "text": "The Government Science & Engineering Profession (GSEP) is working to identify and improve knowledge-exchange opportunities available to scientists and engineers across government, academia, and industry. We want to learn about current schemes in your departments, hear any success stories, learn about barriers to existing schemes, and understand what scientists and engineers want from future schemes."
        },
        {
            "text": "This is your chance to help us understand and improve knowledge-exchange schemes across government and between government, academia, and industry, so we can provide better development opportunities for you! Our aim is that future programmes will provide better skill-development opportunities for government scientists and engineers, provide more routes into government for those with specialist skills, and help embed experts into policy teams."
        },
        {
            "text": "We want to hear from you! What knowledge-exchange schemes are you currently aware of? What lessons can be learned from previous or existing programmes? Do you know of any great success stories? What potential barriers need to be overcome for future programmes to work well? How might provision for scientists and engineers need to differ from those in other professions?"
        },
        {
            "text": "Please help us by completing our survey before 10 April, and by cascading it to your wider teams and networks"
        },
        {
            "text": " "
        },
        {
            "text": "More about our knowledge exchange (or ‘interchange’) ambitions"
        },
        {
            "text": "As part of the Declaration on Government reform, there has been demand for action to improve interchange (i.e. knowledge exchange) across government, and to encourage greater introduction of science and engineering skills and expertise into government. This links to the Government Science and Engineering Profession’s own strategy where interchange is also a key theme. We aim to provide systems which allow scientists and engineers to be better connected and gain broader experiences, across government, academia, and industry."
        },
        {
            "text": "One route for this is through designated knowledge-exchange programmes, such as secondments, fellowships, internships, loans, shadowing, and other types of placements, or through mentoring and/or teach-ins. Participating in these schemes can be extremely beneficial for any individual taking part, but also for the teams and departments they join, and the teams and departments they return to. Ultimately, improving science and engineering advice and expertise in government can be achieved in part by improving knowledge-exchange (or ‘interchange’) programmes across and between government, academia, and industry."
        },
        {
            "text": " "
        },
        {
            "text": "How we are exploring and improving current and future provision"
        },
        {
            "text": "We are engaging with stakeholders to (i) identify existing opportunities available to scientists and engineers across government, academia and industry, (ii) gain an understanding of the potential barriers to engagement and success of these schemes."
        },
        {
            "text": " "
        },
        {
            "text": "What is the ultimate aim? "
        },
        {
            "text": "Effective, sustainable, and long-lasting knowledge-exchange systems that can be used by GSE professionals across government, with minimal barriers to engagement (operational, cultural, or otherwise)."
        },
        {
            "text": " "
        },
        {
            "text": "How can you help? "
        },
        {
            "text": "We have developed a survey for you to complete and pass on to your contacts and networks across government, academia, and industry. It will remain open until 10 April. Find our survey here:  https://forms.office.com/r/jKeSKinDZ1"
        },
        {
            "text": "If you have any questions or would like more information, please contact gse@go-science.gov.uk"
        },
        {
            "text": " "
        }
    ]
}