{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/03/22/oims-uk-internal-market-report-first-impressions/",
    "title": "OIM’s UK Internal Market report: First impressions",
    "authors": [
        "Rachel Merelie"
    ],
    "categories": [
        "Markets",
        "Office for the Internal Market"
    ],
    "pub_date": "2022-03-22T12:02:24+00:00",
    "content": [
        {
            "text": "The Office for the Internal Market (OIM), part of the Competition and Markets Authority (CMA), recently published its first report, giving an overview of the UK Internal Market."
        },
        {
            "text": "The UK Internal Market looks at how trade flows between the UK nations, and how it shapes an important part of the 4 nations’ economies."
        },
        {
            "text": "Cross-border activity within the UK hasn’t been reviewed in this way before so our report is a first step towards improving our understanding of trade within the UK’s internal market. It also explores regulatory environments that shape the market and identifies areas where new regulatory divergence between the 4 nations might be most likely to arise."
        },
        {
            "heading": 2,
            "text": "The OIM"
        },
        {
            "text": "The Office for the Internal Market (OIM) was launched in September 2021."
        },
        {
            "text": "Our mission is to help trade flow freely within the UK internal market, allowing people and businesses to trade across the UK without additional barriers based on which nation they are in."
        },
        {
            "text": "We do this by providing independent technical and economic advice to the four governments of the UK on how laws, rules and regulations could affect the UK Internal Market. We will also report every year on how well the market is working, collaborating with statisticians and economists from around the UK."
        },
        {
            "heading": 2,
            "text": "New economic evidence"
        },
        {
            "text": "Did you know that England doesn’t currently publish data on trade within the UK borders?"
        },
        {
            "text": "On the other hand, Scotland, Wales and Northern Ireland use different methods to produce their trade data."
        },
        {
            "text": "In our research, we’ve taken stock of the data collected by authorities in each nation to:"
        },
        {
            "text": "We asked businesses across the nations about the nature of their trading practices within the UK, and the majority told us they’ve found it easy to trade between nations. They also said there were few difficulties that arose from regulatory differences."
        },
        {
            "text": "In our research so far, there’s nothing to suggest that there is substantial new regulatory divergence since December 2020 that has affected the UK Internal Market. But that doesn’t mean to say that there won’t be, and that’s why we’re working hard to understand the effects that future regulatory divergence or barriers of trade may have in the future."
        },
        {
            "heading": 2,
            "text": "We want to hear from you"
        },
        {
            "text": "Is your business having issues with selling goods or providing services in other parts of the UK? Or, are you a professional unable to use your qualifications gained in one part of the UK to operate in another?"
        },
        {
            "text": "If so, we’d like to hear from you - even if you’re unsure if the issue is a result of trade barriers."
        },
        {
            "text": "You can report an issue you’re facing with trading across different UK nations by using our online reporting form."
        }
    ]
}