{
    "url": "https://insidehmcts.blog.gov.uk/2022/03/22/overcoming-delivery-challenges-with-common-platform/",
    "title": "Overcoming delivery challenges with Common Platform",
    "authors": [
        "Paula Potter"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Digital services"
    ],
    "pub_date": "2022-03-22T11:30:07+00:00",
    "content": [
        {
            "text": "The COVID-19 pandemic reinforced the case for reform in the justice system. It highlighted the risks of unforeseen challenges and showed how modernised systems can keep the wheels of justice turning in courts and tribunals."
        },
        {
            "text": "Common Platform is the case management system being implemented in our criminal courts. It’s at the heart of our large-scale plans to reform the justice system."
        },
        {
            "heading": 2,
            "text": "A fundamental element of our reform programme  "
        },
        {
            "text": "Many of our staff, colleagues and partners within the criminal justice system are already familiar with Common Platform."
        },
        {
            "text": "Designed to help make criminal justice more efficient, effective and transparent, it allows all parties involved in a case to access information on a single system for the first time. It’s currently live in over 100 courts – 44% of all criminal courts in England and Wales. Over 100,000 criminal cases have been managed on the system since we began introducing it in courts in late 2020."
        },
        {
            "text": "With the agreement of the senior judiciary and Crime Programme Board, we’re now ready to go live with Common Platform at the 11 criminal courts in Bedfordshire, Cambridgeshire and Hertfordshire. This will start from week commencing Monday 28 March 2022."
        },
        {
            "text": "Once this is complete, we’ll consider how well the implementation has gone and review how the system is performing. We’ve already addressed a number of technical issues to get to this point."
        },
        {
            "text": "This aims to give everyone full confidence that the system is successfully managing increased numbers of users and cases, and that we're satisfied the new changes are properly tested before we consider going on to introduce it in all remaining criminal courts across England and Wales. "
        },
        {
            "heading": 2,
            "text": "Addressing technical issues to get ready "
        },
        {
            "text": "As with the delivery of many complex and innovative infrastructure changes to delivery models, particularly those involving different organisations and requirements, the new system experienced several technical and performance issues."
        },
        {
            "text": "In order to respond to those issues effectively, we extended the planned summer pause in courts going live with the platform from September last year while we resolved them. This pause enabled us to make a range of necessary improvements to the system’s stability and speed, and these have led to far greater system reliability and performance."
        },
        {
            "text": "We’re so grateful to our staff and delivery partners for their patience, support and vital feedback while we have carried out this work."
        },
        {
            "heading": 2,
            "text": "Continuous improvement "
        },
        {
            "text": "As things progress, we'll continue to make improvements to what the system can do, and support courts and individual users in working effectively with the platform."
        },
        {
            "text": "This ‘agile’ approach to development is widely agreed by digital experts as the best way to ensure that the final, finished service will be able to meet the complex requirements of everyone who uses it."
        },
        {
            "text": "The step-by-step approach and regular software releases mean that the system will be faster and smoother overall, with more features and capabilities being added over time as development progresses."
        },
        {
            "heading": 2,
            "text": "Listening to feedback"
        },
        {
            "text": "In each area where courts go live with the system there’s a local implementation team of regional stakeholders, including representatives from the judiciary, defence professionals and criminal justice partner agencies. They work closely with us to ensure they are all ready to implement the platform."
        },
        {
            "text": "These teams, as well as our own staff, are vital for giving us the feedback we need to be able to continue improving the system over time."
        },
        {
            "text": "We value their ongoing support and commitment to ensuring this new case management system achieves its full capability. It’s essential if we’re to successfully increase the efficiency of the criminal justice system overall and bring speedier access to justice for everyone. We all have a stake in its success."
        },
        {
            "text": " "
        },
        {
            "text": "If you're a defence professional, you can register now for a Common Platform account."
        },
        {
            "text": "If you want to know more about this HMCTS Reform project, you can read our fact sheet."
        }
    ]
}