{
    "url": "https://defrafarming.blog.gov.uk/2022/03/22/the-animal-health-and-welfare-pathway-towards-a-new-welfare-state-for-farm-animals/",
    "title": "The Animal Health and Welfare Pathway: towards a new welfare state for farm animals",
    "authors": [
        "Dr Julia Wrathall"
    ],
    "categories": [
        "Guest post",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2022-03-22T12:51:05+00:00",
    "content": [
        {
            "text": "In this guest post, Dr. Julia Wrathall shares her views on the Animal Health and Welfare Pathway. Julia is an expert in farm welfare and served as the RSPCA's Chief Scientific Officer. She helped to shape species-specific priorities through co-design. "
        },
        {
            "text": "My connection with animals started early in life. We had family pets and I soon became fascinated by the farmed and wild animals that surrounded me whilst growing up in rural Hampshire."
        },
        {
            "text": "Arable farming ancestors and relatives who farmed beef cattle and ‘dabbled’ in pigs meant I always felt an affiliation with the farming community."
        },
        {
            "text": "But I well remember the moment I decided I wanted to do something tangible for farm animal welfare."
        },
        {
            "text": "As an agriculture student in the late 1980s, I visited a pig breeding unit which used the sow stall system. Back then, they were legal. "
        },
        {
            "text": "Seeing the animals so confined and restricted in their movement and behaviour had a profound effect on me."
        },
        {
            "text": "In fact, the experience shaped my entire career."
        },
        {
            "text": "I soon joined the RSPCA Farm Animals Department. In the almost 30 years since, I've encouraged many people to adopt evidence-based improvements in farm animal health and welfare."
        },
        {
            "text": "What I've observed is that to bring about change, a practical, properly supported alternative needs to be presented.  Working together is also vital to success. There must be a common goal, opportunities to talk openly and respect for others’ expertise."
        },
        {
            "text": "In this post, I'll share my thoughts on Defra’s farm animal welfare plans. I will also describe how co-design is shaping the approach."
        },
        {
            "heading": 2,
            "text": "The Animal Health and Welfare Pathway"
        },
        {
            "text": "In recent years, various sector-based and national initiatives have improved animal protection laws, attitudes and practices. These efforts have made the UK a world leader in many areas of animal welfare."
        },
        {
            "text": "Growth in the market for higher welfare products has also led to improvements, including through farm assurance and retailer schemes."
        },
        {
            "text": "But relying on market forces to bring about change has its limitations."
        },
        {
            "text": "It can leave farmers exposed to the vagaries of an unpredictable environment. It does little to address the fact that farmers face economic constraints. Uncertainties surrounding the sustainability and unintended consequences of change also remain."
        },
        {
            "text": "The Animal Health and Welfare Pathway addresses these challenges. It will help farmers progress animal health and welfare. It also offers potential for better marketing opportunities. "
        },
        {
            "text": "Its multi-layered framework, overseen by the government, links all relevant sectors."
        },
        {
            "text": "For the first time, targeted funding will support and reward both initial and on-going improvements in the health and welfare of England’s farm animals."
        },
        {
            "text": "As a first step, funding is being made available for on-farm Annual Health and Welfare Reviews. Farmers can choose their own vets."
        },
        {
            "text": "Future funding through grants and endemic disease control programmes will support changes to buildings, infrastructure and husbandry practices."
        },
        {
            "text": "Also, a ‘payment by results’ initiative could help with the costs associated with some higher welfare practices."
        },
        {
            "text": "After gathering initial views on welfare issues, Defra hosted a series of species-specific virtual workshops to help design certain elements. I participated in the meat chicken and pig meetings to shape the species-specific priorities. Farmers, vets, food industry representatives, scientists and Non-Governmental Organisations (NGOs) were also involved."
        },
        {
            "heading": 2,
            "text": "Welfare priorities and their importance"
        },
        {
            "text": "It was reassuring to find that opinions were remarkably similar amongst the varied stakeholders about which issues should be considered top priority for the first phase of the Animal Health and Welfare Pathway. The views expressed have been well reflected in the initial set of priorities."
        },
        {
            "text": "It is felt that these priority areas offer the best opportunities for improving farm animal health and welfare using this kind of support."
        },
        {
            "text": "Some, such as lameness, cover both health and welfare. Others cut across all sectors. These include stockmanship, which has a huge influence on health and welfare in all species. Grants for training will support this."
        },
        {
            "text": "The welfare priorities may have wider benefits too. For example, some have potential to reduce emissions through improved production efficiencies resulting from better health and welfare."
        },
        {
            "text": "There’s an aim to make interventions as near to emission-neutral as possible, but trade-offs may be needed where there are particularly large welfare improvements to be gained."
        },
        {
            "text": "Early engagement from eligible farmers is essential. If this is achieved, the Animal Health and Welfare Pathway has the potential to transform the livestock farming landscape by bringing tangible, sustainable benefits to all - farmers, food industry, consumers, government and most importantly, to the welfare state of many millions of farm animals, now and in the future."
        },
        {
            "text": "These species-specific priorities will feed into each funding strand. They’ll guide ongoing development of the Animal Health and Welfare Pathway. They will influence, for example, the veterinary advice given, data collected, and capital grants offered."
        },
        {
            "text": "Over time, government, alongside industry, will review and adapt priorities."
        },
        {
            "heading": 2,
            "text": "Animal welfare is a public good"
        },
        {
            "text": "The principle of paying ‘public money for public goods’, alongside official recognition that animal welfare is a public good, is a significant development."
        },
        {
            "text": "It offers an opportunity to overcome some of the most intractable economic and ‘fear of failure’ barriers that hampered previous welfare improvements."
        },
        {
            "text": "The framework can also help deliver other benefits, for trade, food security, public health, and the environment. "
        },
        {
            "text": "There is scope to connect with national initiatives currently under consideration too. These include production method/welfare labelling of animal products. This will help to link farmers with consumers more effectively."
        },
        {
            "heading": 2,
            "text": "Responding to change"
        },
        {
            "text": "Returning to those sow stalls in my student days, it’s worth noting that even then, producers were already seeking to improve welfare by moving to loose-housed systems."
        },
        {
            "text": "The will to improve has always been there."
        },
        {
            "text": "But there are concerns about conversion costs and managing unfamiliar systems. There is scepticism about the public’s professed willingness to pay more for higher welfare products. There are worries about the competition from cheaper, lower welfare imports. All these pose barriers to change."
        },
        {
            "text": "Ultimately, the UK banned sow stalls. But how much easier it would have been for farmers if there had been a framework providing support for conversion."
        },
        {
            "text": "The Animal Health and Welfare Pathway helps address these issues. It rewards positive health and welfare results and in turn, participating farmers will be recognised for delivering a ‘public good’."
        },
        {
            "text": "Of course there will be challenges ahead, but willingness to work together for a collective ‘good’ will help to keep things moving forward. "
        },
        {
            "text": "If you'd like to ask me a question or leave a comment below, please do. The Animal Health and Welfare team and I will do our best to reply."
        }
    ]
}