{
    "url": "https://charitycommission.blog.gov.uk/2022/03/22/your-role-in-improving-charity-data/",
    "title": "Your role in improving charity data",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Data",
        "Research"
    ],
    "pub_date": "2022-03-22T13:21:39+00:00",
    "content": [
        {
            "text": "If the past few years at the Commission were dominated, as they were for so many others, by our response to COVID, then the years ahead will be dominated by data. How we collect, how we use it, and how we share data, is a crucial theme of our work, and colleagues across disciplines and teams are involved."
        },
        {
            "text": "Why we’re thinking differently about data "
        },
        {
            "text": "Thinking about information is not new. Like other regulators, we have long been responsible for gathering, using and making data available. And like others, we’ve been taking a more strategic approach to data as we continue to modernise our approach."
        },
        {
            "text": "And yet a step-change in our work in this area is underway. In the past, our thinking has been concentrated narrowly on regulation, so on gathering information that helps us hold trustees to account, notably when something goes wrong. That remains a priority, and improved data will further enhance our ability to detect and tackle wrongdoing."
        },
        {
            "text": "However, we’re now also thinking more widely about the purpose and value of data, and taking into account the needs of charities and of the public in a more deliberate way."
        },
        {
            "text": "Better service for trustees "
        },
        {
            "text": "For example, we are considering what we might need to know about individual trustees to allow us to tailor and target guidance and advice. This is partly about ensuring we provide the best possible service to volunteer trustees, and it also makes ‘good business sense’. It is more efficient for us to support trustees before harm and disruption occurs than it is to investigate and unravel issues once they’ve happened. In other words – we’re looking to share the power of the data we hold about charities and trustees with charities and trustees themselves."
        },
        {
            "text": "More relevant information for the public "
        },
        {
            "text": "We also want to better serve the public, thinking beyond the legal and accounting frameworks we are required to make available. We want to use what we know about the drivers of public trust and confidence in charities to inform our approach, making public data about individual charities and the sector more widely available. This should support individuals in making more informed and confident decisions about which charities they wish to support. Improvements in this area should also benefit the wider, collective public good, supporting effective funding of charities and research about the sector."
        },
        {
            "text": "What is next for charities?  "
        },
        {
            "text": " Classification user testing "
        },
        {
            "text": "One of the early steps we’re taking is to improve basic data about what each charity does.  This will allow us and others to better identify and analyse trends in activity and regulatory engagement within different types or groups of charities."
        },
        {
            "text": "One way in which we can improve basic data is by expanding the range of categories (or ‘codes’) which charities select on the charities register to explain what they do, how they do it, and whom they help. We’re describing this work as being about ‘charity classification’."
        },
        {
            "text": "With an updated range of codes, we hope that charities can select categories that more accurately reflect the range of work they do and that this will provide greater understanding of the breadth of services they deliver."
        },
        {
            "text": "For example, education and training is a single category selected by 52% of registered charities to explain what they do, but this doesn’t provide very much information about the many different ways in which education and training services are delivered."
        },
        {
            "text": "To make sure codes are revised in a user-friendly way that is representative of your work, we are now undertaking user testing and would welcome charities’ input. We’ll be saying more about how to take part in the near future."
        },
        {
            "text": "Annual return consultation "
        },
        {
            "text": "Last month, we also started user testing with a group of charities on a set of questions for the 2023 annual return, and we will be using the results of that to inform a formal proposal for a library of annual return questions, which we will be consulting on fully later this year. In future years, we will draw selectively on questions from that ‘library’ for charities to answer in their annual returns, as circumstances require. Our hope is to make charities’ experience of the AR simpler and more streamlined whilst still collecting valuable data that we need to regulate effectively, and we encourage charities to have their say as part of that consultation."
        },
        {
            "text": "Better communications from the Commission"
        },
        {
            "text": "In the longer term, you can also expect changes in the way in which we communicate with trustees. We aim to have a direct relationship with each individual trustee, so that we can target our help and support according to their needs and circumstances."
        },
        {
            "text": "Evolving the accounting framework "
        },
        {
            "text": " As a member of the SORP-making body we will also be contributing to the evolution of the accounting framework."
        },
        {
            "text": "Separately, we are considering how we might allow charities to automatically submit reporting metrics to us – in a similar way that ‘make tax digital’ allows for organisations to automatically connect and update HMRC through their accounting platform."
        },
        {
            "text": "Some of these steps lie some way ahead. But we are keen that charities feel included as we develop and implement these improvements."
        },
        {
            "text": "Thank you "
        },
        {
            "text": "We are grateful to the support we have already received from sector organisations as we have begun this work, and for the support and cooperation of the Department for Digital, Culture, Media and Sport. We at the Commission look forward to working collaboratively with the sector in the coming months and years to further our vision."
        }
    ]
}