{
    "url": "https://insidedvla.blog.gov.uk/2024/11/08/celebrating-10-years-of-dvlas-stem-programme/",
    "title": "Celebrating 10 years of DVLA’s STEM programme",
    "authors": [
        "Mark Jones",
        "Karen Pitt"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2024-11-08T14:54:16+00:00",
    "content": [
        {
            "text": "For a decade, DVLA’s STEM programme has supported learners across Wales get into science, technology, engineering and mathematics (STEM)."
        },
        {
            "text": "Our STEM ambassadors, Mark Jones and Karen Pitt, have been at the forefront of this voluntary initiative over the past 10 years. Ahead of this year’s annual Code Challenge, they discuss what it’s taken to keep the programme thriving. "
        },
        {
            "heading": 2,
            "text": "Why did you decide to start the STEM volunteer programme?"
        },
        {
            "text": "Mark: I’ve always had a passion for encouraging young people to get into digital, and I know first-hand the importance of STEM subjects when building the foundational skills of our next generation."
        },
        {
            "text": "The volunteer STEM programme was built with a single purpose - to encourage grassroots learning and provide digital skills in a fun and engaging way. That single purpose has flourished into a number of exciting initiatives that have paved the way for young people to get into digital."
        },
        {
            "heading": 2,
            "text": "Code clubs are a big feature of the STEM programme – what are they?"
        },
        {
            "text": "Karen: As part of the programme, our volunteers set up code clubs across several local schools. The clubs provide pupils and teachers with the digital skills needed to begin their digital journey. Since 2014, with the support of volunteers from across DVLA, the programme has hosted several after-school clubs, as well as reaching out to the community to provide digital upskilling to a wide range of people."
        },
        {
            "text": "Mark: After a year of teaching children in after-school clubs, the first ever STEM school hosting event was launched, which raised awareness of STEM learning to other primary and secondary schools, as well as the wider business community. I still remember the first event; we were all full of anticipation and excitement."
        },
        {
            "text": "Over the course of a day, we guided school children through interactive coding activities, which showcased the talent that the children had, increased their confidence, and encouraged businesses to start their own STEM programmes. Ten new code clubs started in the region as a direct result of this first code event."
        },
        {
            "text": "It’s great looking back and appreciating how far we’ve come but also how many children have enjoyed the code clubs and associated events. It’s a real privilege to have been able to witness the development of their digital skills. Each year, we’re astounded with what our future digital innovators can achieve."
        },
        {
            "text": "Karen: From the very first code club, DVLA’s STEM programme has continued to develop and mature, leading to new events and opportunities to help the next generation."
        },
        {
            "text": "We’ve also supported education and curriculum improvements across Wales, including donating IT equipment that DVLA no longer needs to primary and secondary schools as part of our Digital Inclusion Scheme. By using our experience as a digital employer, combined with our commitment to support the next generation, we’ve been able to illustrate the fundamental importance that digital skills have at a young age."
        },
        {
            "heading": 2,
            "text": "DVLA’s annual Code Challenge is coming up in December – tell us more."
        },
        {
            "text": "Karen: Code Challenge was launched in 2017, and now runs annually. It challenges learners across Wales to create games using coding in the hope of winning some exciting prizes for their school or college. It’s a privilege to support school children across Wales, and our annual Code Challenge is a great celebration of this."
        },
        {
            "text": "Using coding and other digital skills, children are encouraged to use their imagination and team work to build exciting games, create a video and, if they get through to the final, present these on stage in front of a live audience. It’s much more than just a game, with the creations often tackling real-world problems such as sustainability and humanitarian aid. Every year, I’m blown away by the calibre of nominations and the sheer determination to push the envelope that much further."
        },
        {
            "text": "The event, which has previously been presented by Sian Lloyd at the Richard Ley Development Centre in Swansea, enables school children from the ages of 7 to 16 to get involved. It also includes the Commerce in Code Challenge, which encourages students aged 16 to 18 to submit a tender to redesign the Code Challenge website. The process includes design briefs, specifications, requirements and a commercial scoring matrix, giving students the feel of business and IT in a real-world situation."
        },
        {
            "heading": 2,
            "text": "What other events have you supported and what’s next?"
        },
        {
            "text": "Karen: Aside from Code Challenge and the code clubs, the volunteer programme has also had a big part to play in other events happening across Wales. It’s always challenging finding the time to make everything happen, but through the efforts of our amazing volunteers, we do."
        },
        {
            "text": "We’ve attended the Eisteddfod in previous years and are regulars at the Swansea Science Festival, where we encourage parents and children to learn all about coding and other digital skills, together."
        },
        {
            "text": "Mark: After a decade of giving back to the next generation and ahead of the next annual Code Challenge taking place on 3 December, I’d like to thank everyone that has made this journey possible."
        },
        {
            "text": "The legacy of the STEM programme wouldn’t be what it is today if it wasn’t for our important sponsors and volunteers. Every year, they come on board and provide us with much-needed investment and input into their various sectors. To all our volunteers and sponsors, past and present, thank you for everything."
        },
        {
            "text": "There’s still a long way to go and we know there’s much that needs to be done to promote digital in our community, but by working together, we do make a difference. We’re looking forward to the upcoming Code Challenge and supporting our community in the years ahead."
        },
        {
            "text": "If you’re interested in finding out about DVLA’s STEM volunteer programme or the annual Code Challenge, please visit our website (also available in Welsh)."
        }
    ]
}