{
    "url": "https://naturalengland.blog.gov.uk/2024/11/08/international-use-of-englands-biodiversity-metric-having-global-impact/",
    "title": "International use of England's biodiversity metric having global impact",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Environment Act",
        "Environmental Improvement Plan",
        "Green Infrastructure",
        "Local Nature Recovery Strategy (LNRS)",
        "Natural Capital",
        "Natural England"
    ],
    "pub_date": "2024-11-08T11:30:51+00:00",
    "content": [
        {
            "text": "By Nick White, Principal Adviser on Biodiversity Net Gain, and Steve Panks, Principal Specialist Biodiversity Net Gain and Biodiversity Metrics, at Natural England, explore the global significance of the biodiversity metric and its role in nature recovery across the world. "
        },
        {
            "text": "The biodiversity metric, developed by Natural England and now Defra's statutory biodiversity metric, is gaining attention worldwide, including being referenced at the United Nations Biodiversity Conference (COP16) in Cali, Colombia, which came to a close last Friday and was attended by Natural England chair Tony Juniper.  "
        },
        {
            "text": "It is helping countries around the globe adopt a measurable, transparent approach to biodiversity restoration. It is playing an increasing role in global efforts to create, protect, and enhance biodiversity, helping to restore nature worldwide.  "
        },
        {
            "text": "Nature is complex, but the biodiversity metric provides a robust and risk-based mechanism for quantifying habitat change in different scenarios in a way that developers and landowners of differing scales can use to understand and address how they could provide benefits for nature.  "
        },
        {
            "text": "Originally published by Natural England in 2012, the biodiversity metric has since been further developed with the support of experts across various sectors, including development, environment planning, academic and land management. The BNG legislation covering England was implemented in February 2024. "
        },
        {
            "text": "Its flexible framework allows it to be adapted to different contexts and ecosystems, enabling global stakeholders to measure biodiversity impacts consistently and transparently. The metric aids communication between ecologists and decision makers and drives positive biodiversity outcomes, ensuring that development and nature can thrive together. "
        },
        {
            "text": "It is an exciting time for international collaboration on biodiversity. Natural England is proud to be part of a movement that balances sustainable development with the need to protect and enhance nature. "
        },
        {
            "text": "Marian Spain, chief executive of Natural England, said:"
        },
        {
            "text": "“The UK is one of the most nature-depleted countries, but we are leading the way to reverse biodiversity decline. The UN’s Biodiversity COP has been an opportunity to highlight the good work that is happening to protect and enhance biodiversity across the globe, as well as learning from each other. Ensuring positive outcomes for nature is fundamental to unlocking sustainable development, and Natural England is proud to continue to play our part in a win-win for housing and the natural environment.” "
        },
        {
            "text": "The biodiversity metric is not only being utilised across England for Biodiversity Net Gain (BNG) but has also found applications across the globe, with variants now in use in places as diverse as Saudia Arabia, the US, the Netherlands and India. Organisations from America to Sweden to Oman have adapted and adopted the biodiversity metric, reflecting its international significance.  "
        },
        {
            "text": "International adoption: innovating in Sweden "
        },
        {
            "text": "One notable example of the biodiversity metric's international reach is in Sweden. Uppsala, the country’s fourth-largest municipality, has developed a program to offset negative impacts on biodiversity resulting from urban growth, with the biodiversity metric developed by Natural England playing a key role in shaping the approach. Political leaders approved a set of principles for biodiversity offsetting in June 2024, with the requirement to offset expected to be in place in 2025.  "
        },
        {
            "text": "Camilla Söderquist, city planner from Uppsala Municipality, said: "
        },
        {
            "text": "“Adapting the Natural England biodiversity metric to value losses and gains has been helpful for the development of our offset program. We are currently in the process of interpreting results and finalising a transparent and robust guidance document to support a variety of actors, including organisations required to offset losses and landowners that now have an economic incentive to invest in biodiversity gains.\"  "
        },
        {
            "text": "Scott Cole, environmental senior consultant at WSP, who worked on the Uppsala project, said: "
        },
        {
            "text": "“The municipality (local authority) is developing a step-by-step guidance document for measuring, delivering, and monitoring offsets. As part of this work, the NE BNG metric was applied in a case study in 2023 to test whether biodiversity field assessments according to the Swedish standard could be used to quantify impacts on habitat distinctiveness, quality, and strategic location. Two additional pilot studies in 2024 compared the results of the NE BNG metric to a similar Swedish metric called  CLIMB – Changing Land use Impact on Biodiversity (ecogain.se). "
        },
        {
            "text": "“The final analysis is ongoing but preliminary results suggest that the NE BNG metric is highly adaptable and may represent a viable path forward in the forthcoming guidance document.” "
        },
        {
            "text": "Innovating in the Americas: a new metric for new challenges "
        },
        {
            "text": "Global consultancy Ramboll has created a Global Biodiversity Metric (GBM) based on the NE BNG metric and underpinned by the IUCN Global Ecosystem Typology, referencing habitats around the world. The GBM was launched at COP16, with Natural England chair Tony Juniper part of a panel discussion. "
        },
        {
            "text": "Leveraging the success of the Natural England biodiversity metric, Ramboll has applied the metric to its client’s biodiversity projects in 27 countries. Based on this experience, and in the absence of a similar metric in the Americas, Ramboll also created the Americas Biodiversity Metric 1.0 (ABM), with support from NatureServe.  "
        },
        {
            "text": "Vikki Patton, senior managing consultant at Ramboll, said: "
        },
        {
            "text": "“The Americas Biodiversity Tool is designed to measure the impacts of land use change by quantifying the biodiversity value of sites across the Americas and is underpinned by the International Vegetation Classification System and NatureServe’s Ecological Integrity Assessment framework. "
        },
        {
            "text": "“Similar to the UK metric, biodiversity is evaluated using the product of habitat size, condition, conservation priority, and strategic significance, generating a score expressed as biodiversity units. "
        },
        {
            "text": "“The ABM offers a transparent and repeatable method to quantify biodiversity that supports decision-making in alignment with the mitigation hierarchy. The ABM is currently being applied to development projects that aim to achieve no net loss or net gains for biodiversity, in addition to supporting the quantified improvement of biodiversity at operational sites, including data centres and industrial sites."
        },
        {
            "text": "“These metrics can help deliver on multiple targets in the Kunming-Montreal Global Biodiversity Framework; support alignment with corporate reporting, including Science-Based Targets, Taskforce for Nature-based Financial Disclosure and European Corporate Sustainability Reporting Directive; and evidencing biodiversity credits and green claims.” "
        },
        {
            "text": "Biodiversity Net Gain at the forefront of COP "
        },
        {
            "text": "During the recent UN Biodiversity Conference (COP16) held in Cali, Colombia, Biodiversity Net Gain was a key topic of discussion. Countries came together to evaluate progress on the Kunming-Montreal Global Biodiversity Framework, highlighting the biodiversity metric as a leading example of how measurable biodiversity gains can be achieved globally. "
        },
        {
            "text": "As biodiversity continues to face unprecedented challenges, tools like the biodiversity metric pave the way for measurable, accountable, and impactful conservation efforts. Natural England remains at the forefront of this movement, driving forward biodiversity restoration across the globe. "
        },
        {
            "text": "Visit GOV.UK for more information and guidance on Biodiversity Net Gain. "
        }
    ]
}