{
    "url": "https://naturalengland.blog.gov.uk/2024/11/08/natural-england-role-in-high-speed-2/",
    "title": "Natural England role in High Speed 2",
    "authors": [
        "Oliver Harmar"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-11-08T14:21:13+00:00",
    "content": [
        {
            "text": "There has been inaccurate coverage about Natural England’s involvement in the development of HS2's bat tunnel."
        },
        {
            "text": "Natural England has not required HS2 Ltd to build the reported structure, or any other structure, nor advised on the design or costs. The need for the structure was identified by HS2 Ltd more than 10 years ago, following extensive surveying of bat populations by its own ecologists in the vicinity of Sheephouse Wood. "
        },
        {
            "text": "HS2 has an obligation throughout the whole route to abide by legislation that exists to protect nature. Natural England and HS2 have a team that work closely together to ensure that this duty is observed, so the rail line can be completed without harming important wildlife."
        },
        {
            "text": "Natural England was consulted by HS2 on whether the proposal designed to mitigate the impact of the railway on rare and protected bats was sufficient to comply with environmental law - we advised that it was. "
        },
        {
            "text": "It is for HS2 Ltd to make choices, consider risks and factor in costs when deciding how to comply with environmental law - that could be by choosing a route which avoids species and sites protected for nature or by investing in mitigations to limit the harm when the route passes through sensitive sites."
        },
        {
            "text": "Bechstein’s bats are a highly protected species across Europe. They are one of the world's rarest bat species, with fewer than ten estimated breeding colonies in in the whole of England. There is ample evidence - despite claims made to the contrary - that they are at risk of colliding with high-speed trains."
        },
        {
            "text": "We are facing a nature crisis with 1 in 6 species in the UK now facing extinction. That is why development must be sustainable and work alongside nature recovery to protect our natural environment for the future."
        }
    ]
}