{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/11/08/pricing-algorithms-and-competition-law-what-you-need-to-know/",
    "title": "Pricing algorithms and competition law: what you need to know ",
    "authors": [
        "Lucilia Falsarella Pereira"
    ],
    "categories": [
        "CMA Digital"
    ],
    "pub_date": "2024-11-08T13:42:11+00:00",
    "content": [
        {
            "text": "Do you use an algorithm to guide your pricing decisions? Maybe you get pricing recommendations using software or an external supplier that uses an algorithm? "
        },
        {
            "text": "Or perhaps you sell pricing software solutions? "
        },
        {
            "text": "The use of pricing algorithms is widespread these days and can bring substantial gains. However, algorithms can also be misused in ways that reduce competition and harm consumers."
        },
        {
            "text": "We want to make sure that businesses can reap all the benefits that come from using pricing algorithms, while staying in line with competition law."
        },
        {
            "heading": 2,
            "text": "What is a pricing algorithm?"
        },
        {
            "text": "Companies use many types of algorithms to help them make pricing decisions. A pricing algorithm is a system that sets prices or recommends prices to be set, usually based on current and past data about market conditions."
        },
        {
            "heading": 2,
            "text": "Pricing algorithms can provide lots of benefits "
        },
        {
            "text": "Companies can use pricing algorithms to monitor their competitors’ prices and inform their own price setting. This can bring benefits including:"
        },
        {
            "text": "The variety of commercial solutions on offer is increasingly making algorithmic pricing more accessible to smaller businesses, allowing them to grow, innovate and compete."
        },
        {
            "heading": 2,
            "text": "Pricing algorithms can also present legal risks "
        },
        {
            "text": "However, the use of pricing algorithms can also cause harm to consumers and businesses. For example, pricing algorithms can be used to implement or monitor price-fixing – where rival businesses agree to set prices rather than compete independently."
        },
        {
            "text": "The CMA’s case regarding online sales of posters and frames shows what this could look like."
        },
        {
            "text": "In this case, 2 companies broke the law when they agreed not to undercut each other’s prices on Amazon’s UK website. They used software which monitored and adjusted their prices to make sure neither business undercut the other. As a result, the CMA fined one company and that company’s managing director was disqualified from acting as a director of any UK company for 5 years. Our case study draws out what other businesses can learn from this in order to avoid making similar mistakes."
        },
        {
            "text": "Even if companies don’t have an explicit agreement with their competitors to fix prices, they might still break competition law. As pricing algorithms become more sophisticated it is increasingly important that you understand how prices are set. Where rival businesses use the same algorithmic system to set prices this can allow the exchange of confidential information (such as pricing plans, future market strategies, stock levels or spare capacity) between them. It can also help them to coordinate their behaviour instead of competing with each other."
        },
        {
            "text": "This is problematic because it undermines competition, resulting in higher prices, less innovation and reduced choice for consumers. So, it is important to use pricing algorithms carefully to get the best out of them, in the right way."
        },
        {
            "heading": 2,
            "text": "What to do when using a pricing algorithm"
        },
        {
            "text": "Not knowing what an algorithm is doing is no excuse: both end users and suppliers must understand how the tools and technologies they are using or supplying work – and that they are legally compliant."
        },
        {
            "heading": 2,
            "text": "Pricing consultants must also take responsibility"
        },
        {
            "text": "Providers of pricing services take note: you could be held to account for breaking competition law, for example if you give pricing recommendations to rival businesses that are based on each others’ confidential information."
        },
        {
            "heading": 2,
            "text": "Consequences of breaking competition law"
        },
        {
            "text": "There are serious consequences for breaking the law. These include:"
        },
        {
            "text": "We believe the majority of businesses want to do the right thing and make use of new technologies in pro-competitive ways, and have advice to help – including quick guides and short explainer films – on what anti-competitive practices look like in practice. "
        },
        {
            "heading": 2,
            "text": "Reporting anti-competitive behaviour "
        },
        {
            "text": "Any anti-competitive behaviour should be reported to us. If you’ve witnessed an illegal practice or been involved in one, do the right thing and report it to us. "
        },
        {
            "text": "If the information you provide leads to an investigation, you may earn a reward through our policy for witnessing and reporting."
        },
        {
            "text": "If you’ve seen something:"
        },
        {
            "text": "If you’ve been involved:"
        },
        {
            "heading": 2,
            "text": "Our ongoing research into pricing algorithms and AI "
        },
        {
            "text": "We are keeping a close eye on developments in this technological space given the growing use of algorithms and AI across the UK economy and have dedicated in-house capability in technology, data and AI working closely with investigation teams. Ultimately, we want to help support innovation and help ensure the use of new technology promotes fair, open and effective competition that benefits people, businesses and the wider economy. "
        },
        {
            "text": "Find out more about why the CMA cares about anti-competitive collusion implemented through algorithms."
        },
        {
            "text": "Read more about our work around algorithms and AI:"
        },
        {
            "text": "You can also find more detailed information about how the law applies to collusion through pricing algorithms."
        }
    ]
}