{
    "url": "https://environmentagency.blog.gov.uk/2024/11/08/take-part-in-a-consultation-on-drought-management-in-england/",
    "title": "Take part in a consultation on drought management in England ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-11-08T09:55:52+00:00",
    "content": [
        {
            "text": "After a very wet September for some parts of the country, drought may be the last thing on your mind. However, dry weather can come unexpectedly – as we saw in the summer of 2022. Our changing climate means we could see more frequent and severe weather events, including droughts, in the coming years, and we ought to think of floods and drought as two sides of the same coin. We cannot control when the next drought will be, or how severe it will be, but we can work together now to improve our preparation and resilience to dry weather and drought. "
        },
        {
            "text": "The Environment Agency has launched a public consultation on ‘Drought: how it is managed in England’, the updated version of the ‘National Drought Response Framework’ released in 2017. The document describes how drought affects England and how the Environment Agency works with government, water companies and others to manage the effects of drought on people, business and the environment.   "
        },
        {
            "text": "Drought in England "
        },
        {
            "text": "Droughts are characterised by periods of low rainfall creating a shortage of water. This can also coincide with periods of high temperatures when demand for water also substantially increases. Each drought is different and varies in nature, timing and impacts. There is therefore not a single definition of drought, but we do classify them in three broad categories: environmental, agricultural or water supply droughts. "
        },
        {
            "text": "Working with others to improve drought resilience "
        },
        {
            "text": "The National Drought Group – which includes senior decision-makers from the Environment Agency, government, regulators, water companies, farmers, conservation experts and the Met Office – meets twice a year during normal conditions, and much more frequently during dry weather and drought events. The group enables cross-sector collaboration, to improve drought planning, preparation and response, and to integrate lessons from past droughts. "
        },
        {
            "text": "Security of water supply is vital to building our drought resilience, and the challenge to meet our growing water needs is significant. By 2050, without action, we expect a shortfall in England of nearly 5 billion litres of water a day between the sustainable water supplies available and the expected demand. The Environment Agency, and other regulators review water companies Water Resource Management Plans to ensure the actions they plan to take will deliver the resilient and sustainable water supplies we all need up to 2050. The Environment Agency and Ofwat also review water company performance annually. "
        },
        {
            "text": "Water companies also produce drought plans setting out the actions they will take to manage these events. The Environment Agency is updating its guideline for water company drought plans, which will be open for public consultation in the coming weeks.  "
        },
        {
            "text": "What is the consultation about? "
        },
        {
            "text": "‘Drought: how it is managed in England’ explains drought management and the actions the Environment Agency and others take to plan for and respond to drought. "
        },
        {
            "text": "Each of the Environment Agency’s 14 operational areas produce their own area drought plans, which serve as operational guidelines for their response to drought. ‘Drought: how we manage it in England’ supports our area drought plans by providing a strategic overview. "
        },
        {
            "text": "In this consultation, we would like to hear: "
        },
        {
            "text": "Your comments will help us to refine the document and will also help us draw out any local drought-related issues and concerns that should be considered by our operational areas as they update their area drought plans in the coming months. "
        },
        {
            "text": "Get involved "
        },
        {
            "text": "The 9-week consultation opens on 8 November 2024, will close on 10 January 2025, and is available for input on Citizen Space, the Environment Agency’s consultation hub.  "
        },
        {
            "text": "Drought: how it is managed in England – proposed updated response framework - GOV.UK"
        },
        {
            "text": "Consultation on ‘Drought: how it is managed in England’. "
        }
    ]
}