{
    "url": "https://dcmslibraries.blog.gov.uk/2024/11/08/turning-the-page-understanding-the-barriers-to-library-use-and-how-to-encourage-engagement/",
    "title": "Turning the page: understanding the barriers to library use and how to encourage engagement",
    "authors": [
        "Polly Hollings and Amelia Byrne, Ipsos"
    ],
    "categories": [
        "Research",
        "Uncategorized"
    ],
    "pub_date": "2024-11-08T11:47:52+00:00",
    "content": [
        {
            "text": "Earlier this year Ipsos UK carried out research on behalf of the Department for Culture, Media and Sport to understand barriers to public library use in England and help identify the factors that could support increased engagement. "
        },
        {
            "text": "With data showing that public library use in England has declined over recent years, we spoke to people who had not used a public library service in England in the last 12 months to understand their views. The research involved 22 focus groups, 20 depth interviews and an online journal task completed by 12 participants who took part in depth interviews and did activities via a mobile app to familiarise themselves with a local library. Focus groups were conducted online with up to six participants each and in-depth interviews took place between a single participant and an interviewer via the phone or online. This provided an accessible way for those who were unable or uncomfortable in taking part in a group discussion (e.g., digitally excluded) to participate. 156 people participated overall, including people from a mix of backgrounds across regions and urban and rural locations in England. "
        },
        {
            "text": "We asked people to share their thoughts on libraries and what influences their behaviour around libraries. The research revealed that a variety of factors shape public library engagement and identified a range of ways in which engagement could be encouraged. Below we outline three key take-aways from the research."
        },
        {
            "text": "The research found that a key barrier to library use was a lack of awareness of the full range of services and activities offered by libraries, particularly those beyond the core physical library offer When provided with information about the broader library offer, we heard how surprised people were about how diverse it is. They felt that libraries were becoming more modern, offering a wider range of services to engage different people within society, reflecting changes in technology and were becoming more of a community space. "
        },
        {
            "text": "This suggests that raising awareness (both on and offline) of the breadth of the library offer and giving people a reason to visit will be central to encouraging library use. "
        },
        {
            "text": "Photos taken by online journal participants showing a range of library services offered at their local library."
        },
        {
            "text": "2. Convenience of library services and comfort of the library space are important"
        },
        {
            "text": "People told us that they felt they did not have time to use library services, sharing concerns that opening hours clashed with work or childcare commitments. Some were also worried about availability and cost of parking. Amongst participants with a disability or health condition there were also queries regarding the accessibility of the library space."
        },
        {
            "text": "Participants also talked about previous library experiences. More negative previous experiences had left people feeling that libraries were ‘dated’, or either ‘noisy’ or ‘too quiet’ depending on their preferences. These experiences left people feeling unsure whether the library was a space they would personally use. Positive experiences often involved staff who were friendly and shared extensive literary knowledge. "
        },
        {
            "text": "Those who visited a local library during the research reflected on how this challenged their perception of their local library. They were often pleasantly surprised by the look and feel of their local library, finding them to be ‘bright’ and ‘modern’."
        },
        {
            "text": "Photos taken by online journal participants showing ‘modern’ and ‘bright’ spaces at their local library."
        },
        {
            "text": "These findings suggest that considering key factors that make library engagement convenient and welcoming will be an important part of supporting people in feeling able to use libraries. This could include reviewing or making clear to people opening times, the online offer, parking facilities, accessibility and clarifying the types of spaces available in libraries."
        },
        {
            "text": "3. Whilst considered an important community resource, libraries are not always personally appealing"
        },
        {
            "text": "Participants saw the value of libraries for the local community. This was reinforced as they learned more about the library offering, however the services people associated with libraries did not always hold personal appeal. This was influenced by whether a service offer at a local library chimed with an area of personal interest. "
        },
        {
            "text": "Whilst the free or low-cost nature of library services was considered attractive, participants reflected that many of these or similar services could be conveniently accessed elsewhere, and that they would need a specific reason to access these services at the library."
        },
        {
            "text": "The research suggests that building library appeal could involve the promotion of services, targeting these to specific groups who are likely to benefit and making clear how or why they are convenient for the user. "
        },
        {
            "text": "We would like to thank participants for sharing their library views with us, and hope that these findings can help inform future library strategies. "
        },
        {
            "text": "The full report can be found here and was published alongside a Written Ministerial Statement in the Houses of Parliament. We will be hosting a webinar for the sector with Libraries Connected to discuss the research and the findings on Monday 2nd December at 2pm. "
        }
    ]
}