{
    "url": "https://services.blog.gov.uk/2022/04/25/10-tips-for-working-with-a-service-designer/",
    "title": "10 tips for working with a service designer",
    "authors": [
        "Martin Jordan – former Head of Service Design, GDS",
        "Annie Streater – Technical writer, CDDO"
    ],
    "categories": [
        "New lenses and perspectives",
        "Service design"
    ],
    "pub_date": "2022-04-25T11:47:10+01:00",
    "content": [
        {
            "text": "Service design keeps growing as a discipline, approach and profession across all parts of the UK government. However, while more service designers than ever are employed in the public sector, not everyone knows how to work with them well and let them effectively utilise their skillset."
        },
        {
            "text": "Taking inspiration from a blog post with 10 tips for working with your user researcher, this one does the same for working with a service designer. The service designer might be in your team, your programme or elsewhere. You might work with them daily or only interact with them occasionally."
        },
        {
            "text": "This blog post is for people who have worked with a service designer before and those who have not yet."
        },
        {
            "heading": 2,
            "text": "1. Join them on a ride questioning everything"
        },
        {
            "text": "Service designers ask ‘why’ a lot. They need to get to the bottom of a problem, find out why things are the way they are, and zoom out to understand the broader context to help make the service work well for its users and meet organisational goals. They cannot do this alone or find the answers all by themselves. "
        },
        {
            "text": "This might be irritating, distracting, or even annoying at first, but it is essential for the effective transformation of services. "
        },
        {
            "text": "When working with service designers you might also hear them asking questions to find out things like:"
        },
        {
            "text": "Support and join them on their investigation as it helps you unpack the current situation and gain clarity about what you are actually doing. "
        },
        {
            "heading": 2,
            "text": "2. Give them space to map things out and map with them"
        },
        {
            "text": "Creating maps is an essential activity many people expect a service designer to carry out. But it’s not done for the map’s sake. Among other things, maps help develop a shared understanding, coordinate work and identify priorities. It’s less about the map and more about the process of mapping."
        },
        {
            "text": "Mapping is a collaborative information-gathering and sense-making process that often involves various people from inside and outside the direct team, sometimes including users, subject matter experts and stakeholders. Whether done in a physical space or on a virtual whiteboard, mapping takes some time and space, often requiring multiple sessions and the involvement of people with specific knowledge or experience."
        },
        {
            "text": "The more you can get involved in the mapping process, the more you will learn and see opportunities for change. "
        },
        {
            "heading": 2,
            "text": "3. Expect them to question the scope"
        },
        {
            "text": "Typically, product managers are responsible for determining the scope of the work. But when service designers take what they learn in their investigations and while mapping the user journey and larger service area, they might see new opportunities for effective interventions. They will bring qualitative and quantitative data to provide evidence to back up their suggestions of where to shift the focus to and change the scope. "
        },
        {
            "heading": 2,
            "text": "4. Accept they will zoom far out and zoom close in"
        },
        {
            "text": "When investigating, mapping, and designing, service designers tend to oscillate between artefacts and their higher-level context, bounce between the strategic and the operational level."
        },
        {
            "text": "While working on a transactional service, they might zoom out to the broader service area and show you how things on a higher level are impacting your current work. They might also go into the very details, for example, reviewing how one question in the online form or telephony script leads to unexpected failure demand."
        },
        {
            "text": "Service designers operate on these different levels so they can find various ways to intervene and improve the service."
        },
        {
            "heading": 2,
            "text": "5. Know they will build bridges "
        },
        {
            "text": "As looking sideways and understanding the service at different levels offers novel insights, service designers might find connections to other services and reach out to their teams. They might spot another government service that many users interact with earlier in their journey, which collects valuable data you could use in your service without asking the users for the data a second time. Or the service designer might discover a transaction offered by another organisation with similar user needs, interactions or outcomes."
        },
        {
            "text": "For example, the service designer working on the ‘Prove your right to work to an employer’ service realised the similarities to the ‘Share your driving licence information’ service. The team was then able to reuse parts of that service’s well-tested flow and save significant time."
        },
        {
            "text": "Equally, inside service teams and programmes, service designers help people across disciplines understand how their work connects and contributes to outcomes users are trying to achieve."
        },
        {
            "heading": 2,
            "text": "6. Help them go beyond digital and connect all channels"
        },
        {
            "text": "The service you’re building might primarily be an online transaction. Still, responding to point 3 of the Service Standard, the service designer will look into how the service is provided across channels, including paper, phone and in-person."
        },
        {
            "text": "A service designer at the Department for Work and Pensions worked on a radically simplified online version of the ‘Check your state pension forecast’ service. Once done, they helped translate the information designs for the online to the paper version and improved the service’s telephony interactions. That helps ensure a user has to do as few things as possible – across all channels."
        },
        {
            "heading": 2,
            "text": "7. Pair up with them to spot opportunities for reducing cost and complexity"
        },
        {
            "text": "When mapping the user experience and existing service landscape across different channels, service designers regularly find unnecessary process steps, redundancies in the system and unknown waste points in existing procedures. Addressing these can reduce failure demand and simplify the user journey, cut costs and increase user satisfaction. That works best when paired with an economist, business analyst or product manager. "
        },
        {
            "text": "In one instance, a team working on designing a paperless version of a service decided to shift their focus to fixing a letter that was confusing users, resulting in a high number of calls. The team estimated the flaw in the letter led to a preventable cost of £47,000 every month. They changed the structure and wording of the letter and recovered the cost of the project’s detour in a few weeks. "
        },
        {
            "heading": 2,
            "text": "8. Realise you’re in a marathon, not a sprint"
        },
        {
            "text": "You might have to deliver a transactional service linked to a ministerial promise with an unchangeable deadline. While doing that, your team might also learn many other things outside of this work's scope, which can become highly relevant later."
        },
        {
            "text": "The service designer might find issues and opportunities in various adjacent areas. It could be a legal requirement that is impossible to change short-term but would have a transformational effect on the service experience – for example, requiring a wet signature on a Lasting Power of Attorney. Or it could be the reuse of data held by another department, which requires working out data-sharing agreements over multiple months."
        },
        {
            "text": "Fundamental service transformation takes time. Have the service designer look at the opportunities across various timeframes."
        },
        {
            "heading": 2,
            "text": "9. Wait for them to step on your and everyone’s toes"
        },
        {
            "text": "This is a good thing! The work of a service designer tends to overlap with quite a few other disciplines. They get involved in the research, work on the value proposition and scope of the service, facilitate team workshops, and map and redesign behind-the-scenes business processes. That makes service designers occasionally run into the space of user researchers, product and delivery managers, and business analysts. "
        },
        {
            "text": "While that is the case, service design is its own discipline. Service designers are the glue, looking at how to make the various parts of a service and the whole work better for users. Pair with them for the best outcomes – just remember to wear solid shoes!"
        },
        {
            "heading": 2,
            "text": "10. Have them take a strategic and holistic approach – but from a user’s point of view"
        },
        {
            "text": "Service designers are making significant contributions to individual services and transactions. But they are working most effectively in larger service areas and at a programme or higher organisational level. There, they can connect the dots, work on the bigger picture, and address the more considerable barriers to users having a good experience when interacting with government and achieving their desired outcome."
        },
        {
            "text": "Service designers are often among the very few who bring in the much-needed user perspective and advocate for their needs at that strategic level. By taking a broader view of things, and applying their efforts across many different areas, service designers make the user journey more straightforward."
        }
    ]
}