{
    "url": "https://aphascience.blog.gov.uk/2022/04/25/combating-malaria/",
    "title": "A bite size introduction to APHA’s role in combating Malaria",
    "authors": [
        "Nick Johnson"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2022-04-25T10:00:52+01:00",
    "content": [
        {
            "text": "World Malaria Day is marked on the 25 April and is a reminder of the burden of this disease, with over 600,000 human deaths reported worldwide, mostly amongst children. The World Health Organisation (WHO) has committed to reduce this by 90% by 2030, with the ultimate goal to eliminate it completely."
        },
        {
            "text": "Here Dr Nick Johnson, Head of the Vector-Borne Diseases workgroup, provides an overview of the disease and how APHA plays a role in detecting the malaria parasite."
        },
        {
            "heading": 3,
            "text": "How is malaria transmitted?"
        },
        {
            "text": "Malaria is caused by the plasmodium protozoa , a parasite that invades red blood cells to replicate and cause life-threatening disease. Species such as Plasmodium falciparum and Plasmodium vivax cause the most severe disease. Plasmodium parasites are distant relatives of the tick-transmitted cattle parasite Babesia divergens, the cause of redwater fever in cattle. However, unlike Babesia, malaria is transmitted by mosquitoes, particularly the Anopheles species."
        },
        {
            "heading": 3,
            "text": "Elimination of human malaria in the UK"
        },
        {
            "text": "Until the early 20th century, a form of malaria was present in parts of southern England and was believed to be transmitted by resident Anopheles mosquitoes that are abundant in southern England and will readily bite humans. This caused a disease known as ague that affected rural communities in areas such as the Kent marshes. Through a combination of land drainage for agricultural use and mosquito control, human malaria was eliminated from the UK."
        },
        {
            "heading": 3,
            "text": "Testing for malaria in birds in the UK"
        },
        {
            "text": "Despite the success of eliminating human malaria, a related species (Plasmodium relictum) is present in the country. This variant of the parasite is also transmitted by mosquitoes but infects birds, and in some, this can lead to disease. It can be particularly severe in captive wild birds and a number of zoological parks around the country have reported outbreaks in penguin colonies with devastating consequences. This is where APHA plays a role. As part of the Diseases of Wildlife Scheme (DoWS), bird samples are submitted to APHA to identify the parasite suspected to be in the bird tissue."
        },
        {
            "heading": 3,
            "text": "Malaria around the world"
        },
        {
            "text": "Returning to human malaria, the only cases reported in the UK now are in those returning from malaria endemic areas where the risk of infection is such that mosquito avoidance is recommended and anti-malaria treatment is advised (see guidance)."
        },
        {
            "text": "Malaria is found in many tropical regions of the world so as APHA staff begin to travel more widely, some even as far as locations in Africa and Asia, exposure to malaria should be considered as part of their occupational risk assessment."
        },
        {
            "text": "Where malaria is endemic, measures to prevent transmission have focused on preventing mosquito bites, such as the use of insecticide impregnated bed netting. To augment these measures, since 2019 the World Health Organisation has piloted several anti-malaria vaccine programmes focussing on children in sub-Saharan African countries. These studies have shown significant reduction in deaths due to malaria providing real hope that this disease can be brought under control in the future."
        },
        {
            "heading": 3,
            "text": "Further reading"
        },
        {
            "text": "You may be interested in reading some other science blogs related to our work in this area:"
        }
    ]
}