{
    "url": "https://teaching.blog.gov.uk/2022/04/25/finding-belonging-and-solidarity-in-school-leader-support-groups/",
    "title": "Finding belonging and solidarity in school leader support groups",
    "authors": [
        "Ella Hughes"
    ],
    "categories": [
        "Teacher mental health",
        "Teacher wellbeing"
    ],
    "pub_date": "2022-04-25T09:54:11+01:00",
    "content": [
        {
            "text": "Ella Hughes is the headteacher at Chapel Street Community Primary School in Manchester. Here, she shares how using peer support groups for school leaders has helped her to maintain positive mental health and wellbeing in all areas of her life."
        },
        {
            "heading": 4,
            "text": "Why did you sign up?"
        },
        {
            "text": "I first heard about Education Support, a UK charity supporting the wellbeing of teachers and education staff, and their school leader’s scheme in an email over the summer holidays. I decided to sign up for the peer-to-peer groups to support my own wellbeing; I’m passionate about positive mental health for everyone in the school community - from the pupils to every member of staff. It felt important to lead by example, making sure I was looking after my own wellbeing, as well as my team’s."
        },
        {
            "heading": 4,
            "text": "What were the peer support groups like?"
        },
        {
            "text": "The group created a supportive space for me to process high-pressure situations with other headteachers and get their insights and perspectives. This has been invaluable especially through the peaks and troughs that the pandemic has thrown at school leaders across the country."
        },
        {
            "text": "A group of us met online to provide peer-to-peer support for each other during a one-hour session, every half term. We were facilitated by a fantastic coach who understood the nature of our roles and shared their expertise and brilliant coping strategies."
        },
        {
            "text": "We used the time to laugh, cry, and listen. We talked to each other, shared the challenges we were facing in our schools and the impact this was having on us personally and professionally. There was a real feeling of solidarity as many of us could relate to each other’s concerns and feelings."
        },
        {
            "heading": 4,
            "text": "How did the support benefit you?"
        },
        {
            "text": "It provided me with a safe space where I could be open and vulnerable. I could address how I was really feeling and the impact of things at work.  There was a real sense of belonging in the group - it became a headteacher staffroom. I was able to focus on my own wellbeing using the strategies I’d learned, which helped me to manage my mental health at home and work. It had a positive effect on all areas of my life."
        },
        {
            "heading": 4,
            "text": "Would you recommend peer support groups?"
        },
        {
            "text": "I’d really recommend the headteacher peer-to-peer support groups, and any other school leader services from Education Support. They give leaders a way to prioritise their own mental health and wellbeing, so they can be as happy and well as possible. You can also share the strategies and support with your teams and pupils to support everyone in your school community."
        },
        {
            "text": "Being mentally well benefits everybody."
        }
    ]
}