{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/25/national-dna-day-2022-the-governments-ambition-to-transform-genomic-healthcare/",
    "title": "National DNA Day 2022 - The Government’s Ambition to Transform Genomic Healthcare",
    "authors": [
        "Anna Costello"
    ],
    "categories": [
        "Guest Blog",
        "Specialism Deep Dives"
    ],
    "pub_date": "2022-04-25T14:46:29+01:00",
    "content": [
        {
            "text": "Today is National DNA Day (25 April), marking the day James Watson, Francis Crick, Maurice Wilkins and Rosalind Franklin discovered the double helix in 1953. I thought it would be a great opportunity to highlight some of the exciting genomics work underway. For those of you who don’t know, genomics is the study of the complete set of DNA (including all of its genes) in a person or other organism. The UK is world-leading in this area; we completed the 100k Genomes Project in 2018 which continues to deliver benefits for patients and demonstrated the enormous potential of the use of genomics in healthcare."
        },
        {
            "text": "I am a part of the Genomics team in the Office for Life Sciences, a joint Directorate between the Department of Health and Social Care and the Department for Business, Energy and Industrial Strategy. Back in 2020, we published Genome UK, a 10-year strategy which sets out how we will transform genomic healthcare over the next 10 years and become the most advanced genomic healthcare system in the world. More recently, over the past 6 months, we have been working with colleagues in the devolved administrations to agree a series of shared commitments which, for the first time, commit the UK Government and devolved governments to work together on the implementation of the Genome UK strategy and to better coordinate and collaborate on genomic research and genomic healthcare."
        },
        {
            "text": "We are really excited about this work – it outlines how patients will benefit from earlier cancer diagnosis and innovative new treatments and forms part of the government’s wider commitment to reform healthcare, ensuring the UK and the NHS remain at the forefront of cutting-edge treatments. An example of this is using research to evaluate the use of whole genome sequencing in newborns to screen for rare genetic conditions and diagnose rare diseases earlier, enabling more tailored treatment sooner."
        },
        {
            "text": "The commitments have been very well received by our stakeholders and will be followed by four separate Genome UK implementation plans for England, Scotland, Wales and Northern Ireland by the end of 2022 – another first for genomics! The separate plans will build on the Shared Commitments and will provide more implementation detail and milestones. We plan to publish the plan for England by the Autumn."
        },
        {
            "text": "This work also helps deliver the Life sciences vision, which was published last year and recognises that to remain competitive in life sciences, the UK will need to focus on relentlessly on areas in which it already has competitive advantage – in particular genomics. It also recognises that for genomics, our ambition needs to be to scale up, by bringing expertise and tools together, in a way that is transformative and helps make the UK a science superpower."
        }
    ]
}