{
    "url": "https://educationhub.blog.gov.uk/2022/04/25/the-new-natural-history-gcse-and-how-were-leading-the-way-in-climate-and-sustainability-education-your-questions-answered/",
    "title": "The new Natural History GCSE and how we’re leading the way in climate and sustainability education – your questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-04-25T16:35:25+01:00",
    "content": [
        {
            "text": "Education is one of the key tools we have in the fight against climate change. That’s why we’re introducing a range of new measures that will mean young people are able to learn more about the natural world around them than ever before and understand how they can play a part in making sure future generations can enjoy a cleaner, safer, greener world."
        },
        {
            "text": "Last week we launched out Sustainability and Climate Change Strategy. It covers a wide range of things and commits the department to key actions over the coming years. Among them are:"
        },
        {
            "text": "Here we answer your questions about our plans."
        },
        {
            "heading": 3,
            "text": "What will the new Natural History GCSE cover?"
        },
        {
            "text": "The new Natural History qualification will enable young people to explore the world by learning about organisms and environments, environmental and sustainability issues, and gain a deeper knowledge of the natural world around them."
        },
        {
            "text": "They will also develop the skills to help them carve a future career in the natural world if they wish to – for example observation, description, recording and analysis, through sustained and structured field study."
        },
        {
            "text": "The GCSE is currently being developed by the OCR exam board and more detail on subject content will be available in due course."
        },
        {
            "heading": 3,
            "text": "When will the new Natural History GCSE be available?"
        },
        {
            "text": "The new Natural History GCSE could be taught to pupils aged 14 to 16 by 2025, although the GCSE itself will need to be approved by the independent exams regulator Ofqual before then in order to be sure it is sufficiently rigorous and suitable."
        },
        {
            "heading": 3,
            "text": "How will the new Natural History GCSE make a difference?"
        },
        {
            "text": "We think it will make a difference in a number of key ways. Firstly, it will help pupils that take it to understand the world around them – and understand their impact on it and that of society at large. Fostering a love of the natural wiorld will encourage individuals to make positive choices. But more than that, it will provide a new and clear pathway for young people to get into green careers."
        },
        {
            "heading": 3,
            "text": "Is the new Natural History GCSE the only way pupils will learn about environmental issues in school? "
        },
        {
            "text": "Absolutely not. Topics related to climate change already feature across the curriculum at primary and secondary school.  What is more, as part of our Sustainability and Climate Change strategy, by 2023, all teachers in all phases and subjects will have access to high-quality curriculum resources, so they can confidently choose those that will support the teaching of sustainability and climate change. The Natural History GCSE is an excellent addition to the wider package of climate education, including the existing environmental science A level."
        },
        {
            "heading": 3,
            "text": "What will sustainability leads in nurseries, schools, colleges and universities do?"
        },
        {
            "text": "We’re accelerating the rollout of carbon literacy training to support at least one sustainability lead in every locally maintained nursery, school, college and university. The training will support settings to develop climate action plans that will bring together and drive activity to improve climate education, put in place measures to protect them against the effects of climate change, and increase climate resilience through adaptation initiatives."
        },
        {
            "heading": 3,
            "text": "How will the new National Education Nature Park work and how will it help? "
        },
        {
            "text": "School grounds alone in England cover an area over twice the size of Birmingham. The National Education Nature Park will encourage nurseries, schools, colleges and universities to think of this land as one whole ‘park’ with vast potential to help halt the decline of biodiversity in this country."
        },
        {
            "text": "As their work starts to have an impact, young people involved will upload their progress on the park’s digital mapping services. They will be able to see how the park is ‘growing’ while increasing their knowledge of species and developing important skills, such as biodiversity mapping, data collection and analysis."
        },
        {
            "text": "The park will be developed in collaboration with children and young people and the many excellent stakeholders that work in this area."
        },
        {
            "heading": 3,
            "text": "And how will the Climate Leaders Awards work?"
        },
        {
            "text": "The Climate Leaders Award will help children and young people develop their skills and knowledge in biodiversity and sustainability, and celebrate and recognise their work in protecting the local environment. For example, young people may choose to undertake a project that delivers change in their local community, such as increasing the biodiversity of a neighbourhood piece of land or helping to deliver experiences for younger children to explore nature and local woodland."
        },
        {
            "text": "The award will be developed in collaboration with children and young people so that we can ensure it supports them in making an impact in their local communities."
        },
        {
            "text": "Pupils and students will be able to progress either individually or as groups through different levels of the award, ‘bronze’, ‘silver’ and ‘gold’, in a similar way to the Duke of Edinburgh Awards."
        },
        {
            "heading": 3,
            "text": "And what about schools themselves and their impact on the environment – are you doing anything to reduce that? "
        },
        {
            "text": "We’ve pledged that every new school delivered under the department’s school rebuilding programme will be cleaner, greener and net-zero in operation. As part of our strategy the rollout of ultra-low carbon education buildings will also be accelerated, and by 2025 at least four schools and one college will have been built via the Gen Zero Platform that the department demonstrated at COP26."
        },
        {
            "text": " "
        }
    ]
}