{
    "url": "https://beisdigital.blog.gov.uk/2022/04/25/transforming-digital-services-in-beis/",
    "title": "Transforming digital services in BEIS",
    "authors": [
        "Karl Hoods"
    ],
    "categories": [
        "Services and products"
    ],
    "pub_date": "2022-04-25T11:20:51+00:00",
    "content": [
        {
            "text": "I'm Karl Hoods, BEIS’ Chief Digital and Information Officer. I wanted to tell you about the amazing team we have here in BEIS Digital and how they're transforming digital services in the department."
        },
        {
            "text": "We're a team of around 150 professionals working across 7 teams (including Digital, Project Management, Finance, Knowledge and Information Management (KIM) and HR) in 3 locations around the UK."
        },
        {
            "text": "We work to improve the experience of everyone that interacts with BEIS’ digital services, from BEIS employees to businesses and citizens."
        },
        {
            "text": "In BEIS digital, we:"
        },
        {
            "heading": 2,
            "text": "Our teams and what we’re working on"
        },
        {
            "text": "Here’s a highlight of some of our BEIS digital teams and what exciting things they’re working on."
        },
        {
            "heading": 3,
            "text": "Design, Data and Delivery"
        },
        {
            "text": "Our design, data and delivery team work on internal and public-facing digital services, putting user needs at the heart of everything we do. They are a multi-disciplinary and collaborative team of developers, service and content designers, user researchers, data specialists, project managers and product managers."
        },
        {
            "text": "They’re currently working on a number of exciting projects, including:"
        },
        {
            "heading": 3,
            "text": "Technology and Architecture"
        },
        {
            "text": "This team delivers new technologies to approximately 12,400 employees across BEIS, the Department for International Trade (DIT) and 8 BEIS partner organisations."
        },
        {
            "text": "They support our colleagues’ laptops and mobile phones, public cloud services such as Microsoft 365, IT networks, telephone, printing, and VIP support arrangements."
        },
        {
            "text": "The team spent the last 2 years supporting staff to work from home with reliable and effective IT service available 24/7. They’re now working to support our estates team in welcoming colleagues back to the offices around the UK."
        },
        {
            "heading": 3,
            "text": "Knowledge and Information Management (KIM) and People and Development teams"
        },
        {
            "text": "The KIM team:"
        },
        {
            "text": "The People and Development team give BEIS Digital bespoke HR support, including recruitment, workforce planning, learning and development, and capability."
        },
        {
            "text": "Our KIM team is now working on information governance to automate our information retention and deletion policies and make our documents easier to find."
        },
        {
            "heading": 3,
            "text": "Shared Services"
        },
        {
            "text": "The shared services team works with our shared service provider to improve our HR, payroll, finance and procurement systems. Standardising processes and working collectively across government gives users a better and more efficient experience, freeing up colleagues to focus on their work priorities."
        },
        {
            "text": "The team has recently improved user experience on our HR and finance systems and added single sign on to improve security."
        },
        {
            "heading": 3,
            "text": "Business Partnering and Assurance"
        },
        {
            "text": "None of the amazing work we do and the projects we complete would be possible without talking to the right people in BEIS and our partner organisations."
        },
        {
            "text": "Our business partnering and assurance team find the right people so we can support and advise digital projects at every stage from coming up with a new idea to go-live."
        },
        {
            "text": "They work with the department to understand what digital technology is needed now and what might be needed in the future. That means we can make sure that each project is financed and supported by business analysis, user research, and agile delivery teams."
        },
        {
            "text": "They have:"
        },
        {
            "heading": 2,
            "text": "Our future"
        },
        {
            "text": "We’re proud that our digital team plays an active role in creating this future for the UK society and economy."
        },
        {
            "text": "It is a genuinely exciting time to be playing such an instrumental role in helping the department in:"
        },
        {
            "text": "Over the coming months, we're excited to share more details about the projects we’re working on and the things we've learnt."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}