{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/04/25/what-is-the-dhsc-health-science-engineering-network/",
    "title": "What is the DHSC Health Science & Engineering Network?",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Collaborating & Networking",
        "Guest Blog"
    ],
    "pub_date": "2022-04-25T15:05:43+01:00",
    "content": [
        {
            "text": "Zenisha Chouhan and Haskan Kaya, Co-Vice-Chairs of the DHSC Health Science & Engineering Network."
        },
        {
            "text": "The Department of Health and Social Care (DHSC) Health Science and Engineering Network (HSEN) is an exciting staff network which aims to bring together colleagues with an interest, background or role in science and engineering relating to health."
        },
        {
            "text": "While the network is based in DHSC and works to build scientific capability specifically within the department, we welcome members from across government to our community to attend our events and benefit from connecting with like-minded individuals."
        },
        {
            "text": "One of our main offerings is an exciting monthly seminar series with external academics speaking on scientific, technology and engineering topics relating to health. We have heard some very interesting talks recently on a broad range of topics including genome editing, neglected tropical disease, and big data epidemiology, with speakers from institutions across the UK."
        },
        {
            "text": "We also distribute informative monthly newsletters including information about our upcoming seminars, health-science focused job adverts and other recent stories of interest to our community."
        },
        {
            "text": "The network is evolving and currently being redeveloped to meet the needs of its members. We are looking to expand our provision to offer internal seminars from members of the Government Science and Engineering Profession, networking and social events, and potentially visits to scientific research institutions."
        },
        {
            "text": "To join the network as a member, please email science.community@dhsc.gov.uk."
        },
        {
            "text": "We also warmly welcome interest from colleagues who wish to be further involved as organising members."
        }
    ]
}