{
    "url": "https://companieshouse.blog.gov.uk/2023/10/26/changes-to-uk-company-law-a-big-moment-for-companies-house/",
    "title": "Changes to UK company law: a big moment for Companies House",
    "authors": [
        "Louise Smyth - Chief Executive and Registrar of Companies"
    ],
    "categories": [
        "Companies House transformation",
        "Legislative reform"
    ],
    "pub_date": "2023-10-26T14:45:33+01:00",
    "content": [
        {
            "text": "The Economic Crime and Corporate Transparency Bill has achieved royal assent and become law. This is one of the most significant moments for Companies House in our long history."
        },
        {
            "text": "I’m delighted that we can now play a much greater role in disrupting economic crime and preventing abuse of the register, while supporting economic growth and ease of doing business in the UK."
        },
        {
            "text": "The measures set out in the act will give us new and enhanced powers to improve the quality and reliability of our data."
        },
        {
            "text": "We’ll also be able to act more quickly if people tell us their personal information has been used on the register without their consent. This will make a real difference to individuals and it’s something I’m particularly passionate about."
        },
        {
            "text": "The measures include:"
        },
        {
            "heading": 2,
            "text": "New objectives for the Registrar of Companies"
        },
        {
            "text": "The act has introduced 4 new objectives for me as the Registrar of Companies. Alongside my colleagues, I’ll promote these objectives while carrying out my duties:"
        },
        {
            "text": "As an organisation, we’ll base our decisions on these objectives. Our new and enhanced powers will give us the tools we need to act on those decisions."
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "Although the Bill has received royal assent and is now an act, you do not need to do anything differently just yet."
        },
        {
            "text": "Some of the measures in the act, such as identity verification, will not be introduced straight away. Many of these changes need system development and secondary legislation before they're introduced."
        },
        {
            "text": "However, other measures will come into force sooner. Over time, they’ll lead to improved transparency and more accurate and trusted information on our registers."
        },
        {
            "text": "These early measures include:"
        },
        {
            "text": "We expect these measures to come into force in early 2024."
        },
        {
            "text": "We will not be able to identify every piece of information or document on the register that could be incorrect or inconsistent. However, we’ll base all our decisions on my new objectives to make sure we’re making best use of our new and enhanced powers."
        },
        {
            "heading": 2,
            "text": "Changes to our fees"
        },
        {
            "text": "We’ll be increasing some of our fees from early 2024. Companies House fees are set on a cost recovery basis. This means our fees must cover the cost of the services we deliver."
        },
        {
            "text": "We review our fees every year to make sure they’re set at the right level. Even after the increase, our fees will remain some of the lowest in the world."
        },
        {
            "heading": 2,
            "text": "Keeping up to date on the changes that affect you"
        },
        {
            "text": "We’ll share more information over the coming weeks and months about the introduction of these changes. It’s important that you understand what you need to do differently when you file information with Companies House, and when you need to do it."
        },
        {
            "text": "There are lots of different ways you can keep up to date:"
        },
        {
            "text": "Teams across Companies House have been working incredibly hard to prepare for the upcoming changes while the Bill made its way through Parliament, and I couldn’t be prouder of my colleagues."
        },
        {
            "text": "This work will continue at pace as we enter the next exciting stage of the legislative process. We can’t wait to make these changes a reality and to make a real difference in disrupting economic crime and supporting economic growth."
        }
    ]
}