{
    "url": "https://ukhsa.blog.gov.uk/2023/10/26/how-flu-and-covid-vaccinations-help-protect-you-and-your-baby/",
    "title": "How flu and COVID vaccinations help protect you and your baby",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "flu"
    ],
    "pub_date": "2023-10-26T12:39:58+01:00",
    "content": [
        {
            "text": "Flu and COVID-19 can be unpleasant for most people, but if you're pregnant, it's particularly important to get vaccinated to protect both you and your baby."
        },
        {
            "text": "We recommend that all pregnant women get flu and COVID-19 vaccines in the coming weeks as part of the winter vaccination campaign, no matter what stage of pregnancy they're at. Both vaccinations are available free on the NHS as unvaccinated pregnant women and their babies are at higher risk of complications requiring hospitalisation than women who aren’t pregnant."
        },
        {
            "heading": 2,
            "text": "Why is it crucial for pregnant women to get the jabs?"
        },
        {
            "text": "Being pregnant changes the way your body handles infections and can restrict the depth of your breathing as the baby grows and pushes on your lungs. This can make you more vulnerable to severe complications from COVID-19 and flu, such as pneumonia. If you catch flu or COVID-19 during pregnancy, it can also cause your baby to be born prematurely or have a low birth weight and, if you get infection near to delivery, you can also pass it to your newborn baby."
        },
        {
            "text": "Earlier in the pandemic, many serious cases of COVID-19 were seen in pregnant women often with serious consequences for their babies. Although disease is less likely to be serious with the Omicron variant, vaccination will protect you against getting severe disease in pregnancy and help keep your baby healthy."
        },
        {
            "heading": 2,
            "text": "Is it safe to have the flu and COVID-19 vaccines while pregnant? "
        },
        {
            "text": "All vaccines go through a regulatory approval process to ensure they meet strict safety and effectiveness checks. And it's fine to have the jabs at any stage of pregnancy."
        },
        {
            "text": "Millions of women in England have had the flu vaccine during pregnancy since this was introduced in 2011. COVID-19 vaccine has been given to millions of pregnant women worldwide with numerous studies, including those in the UK, showing reassuring safety for the mother and her baby. Flu and COVID-19 vaccines do not contain live virus and cannot infect your unborn baby."
        },
        {
            "text": "Having a vaccine while pregnant passes on some immunity to your baby once they are born, protecting them during their first months of life. This is particularly important for flu as babies are at risk of hospitalisation if they catch it."
        },
        {
            "text": "The safety record is good for breastfeeding mums too, if you're eligible due to an underlying health condition."
        },
        {
            "heading": 2,
            "text": "How do I get the flu and COVID-19 vaccines?"
        },
        {
            "text": "The best time to get the jabs is in the autumn before infections circulate more widely. But don’t worry if you find out that you’re pregnant later on – you can have the flu vaccine right up until 31 March 2024. COVID vaccine is being offered between September and December 2023."
        },
        {
            "text": "You can book your COVID-19 and flu vaccination appointment online, by downloading the NHS App or by calling 119 if you can’t get online. You can also book your flu vaccine by finding a local pharmacy or through your GP practice and some maternity services."
        },
        {
            "text": "And remember, you need the flu vaccine every year as flu viruses can change and the protection from the vaccine decreases with time. So even if you had it last year, it's important to get it again to get winter strong. You should also get a COVID-19 vaccine even if you have had one previously to increase your protection whilst you are pregnant. These vaccines provide essential protection for you and your little one."
        }
    ]
}