{
    "url": "https://ipo.blog.gov.uk/2023/10/26/meet-the-board-director-of-business-and-international-policy-ben-llewellyn-jones/",
    "title": "Meet the Board: Director of Business and International Policy, Ben Llewellyn-Jones",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "International"
    ],
    "pub_date": "2023-10-26T13:43:04+01:00",
    "content": [
        {
            "text": "Ben Llewellyn-Jones has recently taken up the role of Business and International Policy Director at the Intellectual Property Office (IPO). Here, Ben talks to us as the latest focus for our ‘Meet the IPO Board’ series.  "
        },
        {
            "text": "On loan to the IPO from the Foreign and Commonwealth Development Office (FCDO), Ben is a diplomat and has spent the last 13 years living in Africa.   "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Ben, what led you to join the IPO?"
        },
        {
            "text": "Having arrived back in the UK, what attracted me to the IPO was the really interesting set of policy work that the IPO does, domestically and also internationally. It’s about setting the balance between policy and regulation - it has to match. "
        },
        {
            "text": "For me, it was also about the very good reputation and the kind of people who work here. People told me about the really positive attitude IPO people take with them into their working day, and I’ve found it to be absolutely true.  "
        },
        {
            "heading": 3,
            "text": "Where did your career path start?"
        },
        {
            "text": "I’ve worked for the Civil Service for quite some time. Prior to working in the FCDO, I worked at the Home Office on international policy and European policy, which included about four years spent working in Brussels. To summarise, my career has been checkered with different work around policy, international engagement and multinational engagement. "
        },
        {
            "heading": 3,
            "text": "Has it been easy to adjust, settling back in the UK?"
        },
        {
            "text": "I was born and lived about a mile and a half away from the IPO in Newport, although I moved to London for work, and I’m based there now. Coming back home, I’ve thoroughly enjoyed being able to work here in Newport, especially as my parents still live close by in Cardiff. It's been really nice for my wife and especially for my two children, who've grown up overseas. This is their first time living in the UK. Now they can have more opportunity to visit Wales to see their grandparents as well as really appreciate the UK. We're all enjoying that as a family. It's been a really good part of coming back and starting work in a very different environment.  "
        },
        {
            "heading": 3,
            "text": "What are your IPO highlights?"
        },
        {
            "text": "I've been at the IPO only a few short months, but there have been number of highlights already.  "
        },
        {
            "text": "The first thing I'd say is that people are genuinely very welcoming and very friendly. That’s often said about people and organisations, I know, but it's so true of the IPO. My new colleagues have been incredibly generous with their expertise and with welcoming me into the organisation. That's been a really special highlight for me, to be honest.  "
        },
        {
            "text": "The second thing has been seeing the scale of reach the IPO has, not least in my area. I've really enjoyed the range and diversity of the work.   "
        },
        {
            "text": "So, on the international side, the extent of the work we do on free trade agreements, and also domestically on the UK ecosystem side. I also have to mention the reach we have with SMEs and on the education side, the work we're doing with higher education institutes. Then there’s the really interesting policy work we're doing on standard essential patents and also IP finance.  "
        },
        {
            "text": "As Director of International Policy, I've already had the opportunity to do just a little bit of travel and to see our reach and impact in practice. Recently I was in Brussels and then India. I'm going to go to China and hopefully Geneva fairly soon. It's been a real privilege to understand how the IPO works in practice in those places.  "
        },
        {
            "text": "I have to come back to the people though - great people working in a great place. I'm really enjoying that aspect of it.  "
        },
        {
            "heading": 3,
            "text": "Tell us about some of your projects"
        },
        {
            "text": "In terms of the projects that I've been working on, and in terms of the work focus at the moment, I think everyone knows the engagement around free trade agreements has been quite intense and those are quite sensitive negotiations. That's been really interesting.  "
        },
        {
            "text": "The UK India free trade agreement that we're working on is a really important priority for government.  "
        },
        {
            "text": "Looking at some of the work we do to support SMEs has been really fascinating, too, trying to make sure that the impact we have is the impact the SMEs need.  "
        },
        {
            "text": "While it has been a challenge, I have enjoyed getting stuck in right across the range of the policy areas I work on – it’s really important work that the teams are doing here.   "
        },
        {
            "text": "I've really enjoyed being a member of the IPO Board as well because you get to see the range of business and work and the challenges - but also the opportunities - that we have as an organisation. That's a privilege and also a responsibility I take very seriously.   "
        },
        {
            "heading": 3,
            "text": "What are your priorities for the future?"
        },
        {
            "text": "In terms of future priorities, there's so much I'm still learning. The learning curve is intense and there are a lot of different areas I still want to dig into, to really ground me in the very complex, important detail of IP. For example, I have really enjoyed spending a bit of time with some of the Patent Examiners, looking at what they do in practice.  "
        },
        {
            "text": "Secondly, I really want to make sure that we achieve the maximum range possible on the international side. I think we have excellent reach already, but there's always more we can do. It's really important to me that through the team and through our network of attachés, as well as through the FCDO missions, that we really maximise on that reach.  "
        },
        {
            "text": "Thirdly, on the UK ecosystem side, I'm really keen that we push on with the work we're doing to support innovative SMEs. It’s so important for us to make sure we align our approach to that right across the organisation in terms of making sure we're giving full support in that space.  "
        },
        {
            "text": "In terms of priorities, I know I’m not mentioning anything new here because all these areas have been worked on for some time. What I will say is that I'm really fortunate to be building on the excellent work that's gone on before. Now I’m intent on picking it up from here, and it’s up to me to see what value I can add.  "
        },
        {
            "text": "Finally, in terms of my role on the Board, there's so much happening across the organisation on our culture, on how we work and support people to develop. I'm really keen to be a key part of that. I think it's important as a Board member that I can work with people, be approachable around those issues and also really demonstrate role model leadership. I’m really keen to lend my support to the work being done here and be a visible face for that, which I hope I can be.  "
        },
        {
            "text": " "
        }
    ]
}