{
    "url": "https://defradigital.blog.gov.uk/2023/10/26/robotics-automation-is-it-like-having-a-little-r2-d2-processing-work-for-us/",
    "title": "Robotics automation: Is it like having a little R2-D2 processing work for us?",
    "authors": [
        "Linda Williams"
    ],
    "categories": [
        "Defra digital",
        "Robotics automation",
        "Software tools"
    ],
    "pub_date": "2023-10-26T07:30:59+01:00",
    "content": [
        {
            "text": "Linda Williams from the Animal and Plant Health Agency (APHA) explains how harnessing the benefits of robotics automation is making a real difference for her and her colleagues."
        },
        {
            "text": "Hello, my name’s Linda – I’m a Team Leader working as part of the Customer Registration and ID Team at APHA, based at Caernarfon. Our role is to update customer records on our customer database with up-to-date information, which is vital in the event of a disease outbreak."
        },
        {
            "text": "The work that my team does is interesting and varied, and one of the most interesting aspects of it currently is the work we’ve been doing to look at how we can use digital robotic automation."
        },
        {
            "text": "But what actually is digital robotic automation? Is it like having a little R2-D2 from the Star Wars films, sitting in the corner of the office processing work for us? And why has my team been chosen as guinea pigs for this?  Well, allow me to explain."
        },
        {
            "heading": 2,
            "text": "In the beginning……"
        },
        {
            "text": "Our robotics automation project began a year ago with myself and my colleagues Dawn and Gary attending numerous meetings with Defra’s Digital Robotic Automation Centre of Excellence team, or the DRACoE team as they’re known for short. The DRACoE team works across Defra, looking at how automation can be used to make our lives easier (and in some cases, the lives of our users and customers too)."
        },
        {
            "text": "We had no idea what was in front of us and had no previous experience of Robotic Processing Automation (RPA). Gary and Dawn were the ideal candidates to take part in the project, as they are the main leads on the customer registration work that we deliver in our team."
        },
        {
            "text": "With their wealth of knowledge, they could advise and give the DRACoE team demonstrations on how we process our work manually. We soon realised the benefits that automation would provide; freeing up resources to do other work, reducing errors, and improving customer service."
        },
        {
            "text": "The DRACoE team went away and set about building a robot (essentially a computer programme) that would automatically process customer registrations with little admin intervention."
        },
        {
            "text": "Once they had completed this work, we began discussions with them on how we would trial the automation. To start with we had temporary pause points in the automation, to enable admin colleagues to check the robot was processing each step correctly. Then, once we were happy that things were running smoothly, we removed the pause points and the robot continued under low supervision."
        },
        {
            "heading": 2,
            "text": "What’s been achieved?"
        },
        {
            "text": "I’m happy to say this has been a big success so far –the robot processed 806 registrations during the testing stage, and the number of transactions it processes is rising as we introduce different types of registrations the robot can complete."
        },
        {
            "text": "It’s been a challenge; it hasn’t been easy juggling business as usual work with the robotic work, but I am so proud of what we have achieved. I’m grateful to everyone involved for their support, and for the professionalism and commitment they’ve shown."
        },
        {
            "text": "I must admit I was apprehensive at first about automation, but I have thoroughly enjoyed working on the project, and already looking forward to phase two. As part of this we have started to train more people in the team, and hopefully they will find it a leaner, more efficient way of working."
        },
        {
            "heading": 2,
            "text": "The future’s bright"
        },
        {
            "text": "So is robotics the future for APHA? I think so. A robot can increase productivity, perform tasks faster and more efficiently, and improve quality and accuracy. But we must remember that it’s not a way of making people redundant - it’s freeing people to tackle more challenging task and learn new skills. We still need humans!"
        },
        {
            "text": "Above all I believe this project demonstrates our commitment to innovation, and how open we are to change and to making improvements to the way we do things, working with other departments and stakeholders, collaboratively and professionally, and without being afraid to take on a challenge."
        },
        {
            "text": "I want to take the opportunity to say how supportive my wider team have been, continuing with their ‘business as usual’ work, with no extra resource capacity, freeing up time for myself, Gary and Dawn to concentrate on this project."
        }
    ]
}