{
    "url": "https://insidehmcts.blog.gov.uk/2023/10/26/sharing-the-work-of-the-court-of-protection/",
    "title": "Sharing the work of the Court of Protection",
    "authors": [
        "Mala Nair, acting Operations Manager at the Court of Protection"
    ],
    "categories": [
        "Court and tribunal reform",
        "General"
    ],
    "pub_date": "2023-10-26T14:10:42+01:00",
    "content": [
        {
            "text": "I’ve been working at the Court of Protection for 19 years and feel privileged to work with judges who make important decisions about financial and welfare issues for vulnerable people in our communities. It’s a court that people are not usually aware of until they, or someone they know, needs support."
        },
        {
            "heading": 3,
            "text": "The work of the Court of Protection"
        },
        {
            "text": "The Court of Protection makes decisions for people who lack the mental capacity. to make decisions on their own. This can happen for lots of reasons, for example, they may have a serious brain injury, an illness like dementia or severe learning disabilities."
        },
        {
            "text": "For people who lack mental capacity the court can step in to:"
        },
        {
            "text": "A person’s ability to make decisions for themselves can be intermittent due to their mental health or they may regain capacity following an illness, for example, after suffering a severe stroke."
        },
        {
            "text": "People come to us in a variety of circumstances, but what does not change is our commitment to make sure the individual is at the centre of the decision-making process."
        },
        {
            "heading": 3,
            "text": "Taking important decisions"
        },
        {
            "text": "A variety of people can apply to the Court of Protection when they believe someone lacks mental capacity. Relatives, friends and even local authorities make applications for property and affairs deputyships and the role of the court is to decide whether that will be in the best interests of the individual. Decisions made by the courts can have serious implications so applications are always considered carefully, and the court never loses sight of the fact that a real person will be impacted by the outcome."
        },
        {
            "heading": 3,
            "text": "Improving the Court of Protection"
        },
        {
            "text": "In the Court of Protection, no two days are the same. The court can be asked to consider making an urgent medical decision within a couple of hours, so it’s important we look at how we work to ensure we’re helping people in the most appropriate way."
        },
        {
            "text": "We’re modernising the court to make it easier for people to apply online before they make the application. By doing this, interested parties like doctors, relatives, social workers etc can provide comments which are submitted with the application. That helps the judge making the decision by giving them more information at the start of the application process, enabling them to make the right decision quickly."
        },
        {
            "text": "We’re also continuing to use remote hearings which we began during the COVID-19 pandemic. They’re only used when a judge feels it’s appropriate, but they’re giving us the flexibility to run hearings without all the participants being physically present, saving people time and money in coming to the court building."
        },
        {
            "heading": 3,
            "text": "Finding more information"
        },
        {
            "text": "We can all find ourselves in a position where a neighbour, relative or friend needs help to make important choices and we understand that applying to the Court of Protection could feel intimidating. I’ve been working at the court for many years and my team is passionate about helping people. You do not have to be a legal professional to apply to the court, so if you’re concerned about a person and want to find out more, take a look at the Court of Protection website."
        }
    ]
}