{
    "url": "https://kingsawards.blog.gov.uk/2023/10/26/thomas-kneale-co-ltd-is-awarded-the-prestigious-kings-award-for-enterprise-in-sustainable-development/",
    "title": "Thomas Kneale & Co Ltd is awarded the prestigious King’s Award for Enterprise in Sustainable Development",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Winners"
    ],
    "pub_date": "2023-10-26T14:29:33+01:00",
    "content": [
        {
            "text": "Manchester-based textiles company, Thomas Kneale & Co Ltd, (established in 1947) celebrates after achieving the inaugural King’s Award for Enterprise for Sustainable Development, 2023."
        },
        {
            "text": "This award is considered to be the highest commercial accolade possible for a UK business, having been endorsed by His Majesty The King Charles III, further to a recommendation from The Prime Minister, Rishi Sunak."
        },
        {
            "text": "Thomas Kneale manufactures, imports and distributes B2B bed and bathroom textiles and fire retardant fabrics."
        },
        {
            "text": "Director Brett Mendell said:"
        },
        {
            "text": "“As a member of the SME Climate Hub, which is aligned to the UN’s Race to Zero, I saw a feature on the awards within a member’s newsletter. Thinking about the work we had been doing over many years in Sustainable Development, and the various awards we had won, I wanted to make a submission to show how far we have come in these important areas of our business.”"
        },
        {
            "text": "Managing Director, Richard J. Manville said"
        },
        {
            "text": " “When we studied the application, we felt we had a strong story to tell across the environmental, social and ethical areas of our business. Over the years we have, step by step, made significant progress creating positive changes and impacts both internally and externally. We are not deterred by being an SME and believe we can  positively contribute to sustainable changes and practices. We therefore engage at every level with each stakeholder in our supply chain and distribution channels to work strategically, collaboratively and purposefully on our collective journey. I believe these engagements and actions were positively viewed by the judging panel.”"
        },
        {
            "text": "It has been almost six months since the award was announced and the company have already seen significant benefit from being successful."
        },
        {
            "text": " Brett said "
        },
        {
            "text": "“Our customer base has been so pleased that we have been recognised, it is essentially a marker which provides them with added assurance that they have selected the right supplier to work with. We have also seen an upsurge in enquiries as our stakeholders want to be associated with winners of the award. As we hold the award for 5 years, we hope to see these enquiries help us grow further."
        },
        {
            "text": "This award has resulted in new opportunities- in June alone, we were involved in a panel at the Northern Sustainability Summit at Manchester Central Convention Centre, a seminar at Manchester Metropolitan University, and a Business Leaders Roundtable allowing us to network, learn and share best practice.” "
        },
        {
            "text": "When asked for any tips for aspiring businesses thinking of applying for future years, Brett said:"
        },
        {
            "text": "“I would suggest two things. Firstly, make things happen, and continue to generate actions, it will really be effective. Secondly, have a look carefully at what the application is asking in terms of evidence. It will allow you to determine if you feel you are ready to complete an application now or need to take further action first to improve the quality of the submission.”"
        },
        {
            "text": "In addition to a reception, hosted by His Majesty The King Charles III, for all winners, at the end of June, the award will be presented to the whole team at Thomas Kneale & Co Ltd by His Majesty's Lord-Lieutenant later in the year."
        },
        {
            "text": "See https://www.thomaskneale.co.uk/ for further information."
        },
        {
            "text": "Thomas Kneale have also recently featured in a BBC interview to help spread the message about the importance of the Living Wage Foundation and fair pay. Read more here: https://www.bbc.co.uk/news/business-67194691"
        },
        {
            "text": " "
        }
    ]
}