{
    "url": "https://defradigital.blog.gov.uk/2022/11/23/a-day-in-the-life-of-an-interaction-designer/",
    "title": "A day in the life of an Interaction Designer",
    "authors": [
        "Dan Leech"
    ],
    "categories": [
        "Interaction design",
        "User centred design"
    ],
    "pub_date": "2022-11-23T11:03:45+00:00",
    "content": [
        {
            "text": " \nThinking of applying for a role as an Interaction Designer at Defra? Daniel Leech tells us about a typical day as an Interaction Designer and why he chose to work in interaction design. "
        },
        {
            "heading": 2,
            "text": "Tell us about your role at Defra  "
        },
        {
            "text": "I’m a Senior Interaction Designer working on the check for flooding service. The service helps users prepare for, respond to, and recover from flooding. I’ve worked on the service for 5 years but have been with Defra much longer.  "
        },
        {
            "heading": 2,
            "text": "What’s an Interaction Designer?  "
        },
        {
            "text": "An Interaction Designer works closely with User Researchers and Content Designers to design a service that meets the needs of its users. The Interaction Designer is responsible for the journey a user takes through the service whether this is digital or non-digital.  They are also responsible for any interactions the user must make, for example completing a web form or making a telephone call. "
        },
        {
            "heading": 2,
            "text": "Why did you choose interaction design?  "
        },
        {
            "text": "I like the problem-solving nature of design, particularly with digital services. Interaction design starts with a user need or problem and through a process of research, prototyping and testing, finds the most effective solution. "
        },
        {
            "heading": 2,
            "text": "What are you working on now?  "
        },
        {
            "text": "From user feedback we discovered that users wanted to look at historic river level data so that they could compare previous conditions to river levels today.   "
        },
        {
            "text": "I’m exploring how this might be presented to the end user. I’m also making our interactive maps and charts more accessible to users with visual impairments and motor impairments such as arthritis. Finally, we are about to start designing a Progressive Web App (PWA)  variant of the service. PWA’s are new to me so I will have plenty of research to do. I am looking forward to developing new skills. "
        },
        {
            "heading": 2,
            "text": "Describe a typical day  "
        },
        {
            "text": "Support for flexible working is great. I typically start early and begin my day with a coffee and checking emails and messages on Slack and MS Teams. Each morning the team has a 15-minute stand-up. This is a great opportunity to raise any new challenges. "
        },
        {
            "text": "We recently commissioned an accessibility audit of the service.  There are a few areas that need attention. This morning I will continue working on a keyboard interface for an interactive chart. Some keyboard users only use a keyboard to navigate and can’t use a mouse. The aim is to provide the same functionality as those who use a mouse or touch interface. I really enjoy this work researching existing patterns and best practice. We don’t want to reinvent the wheel. "
        },
        {
            "text": "The flood services use a lot of data visualisation, particularly maps and charts. I’m working with colleagues across government to develop some guidance for using maps in services. When working on government services you can often find others tackling the same design challenge in a different department. There are many talented people who are always happy to share their work. This afternoon we have a steering group meeting to follow-up on a recent workshop. "
        },
        {
            "text": "Before wrapping up for the day, I have a catchup with one of our developers on a piece of work we will be releasing soon. "
        },
        {
            "heading": 2,
            "text": "Why do you want to work for Defra?  "
        },
        {
            "text": "The environment has always been important to me now more so than ever. The work we do brings very tangible benefits. There is also a strong culture of sharing and collaborating in Defra, making it a great place to learn new skills. "
        },
        {
            "heading": 2,
            "text": "What’s the best thing about working for Defra?  "
        },
        {
            "text": "The people. Defra is full of talented people with a wealth of knowledge. Their passion is quite inspiring. "
        },
        {
            "text": "What’s the most valuable thing you’ve learned while working here?  "
        },
        {
            "text": "Inclusive design is good design. If you don’t consider inclusive design, you can exclude many users from your service. It is important to make our services work for users with disabilities but in doing this we also make it better for everyone. "
        },
        {
            "text": "Great people, fascinating work, and lots of opportunities to learn. "
        },
        {
            "heading": 2,
            "text": "Look out for Interaction Designer roles"
        }
    ]
}