{
    "url": "https://environmentagency.blog.gov.uk/2022/11/23/boosting-action-on-surface-water-flood-risk/",
    "title": "Boosting action on surface water flood risk",
    "authors": [
        "Julie Foley, Director of Flood Risk Strategy & National Adaptation at the Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2022-11-23T09:36:57+00:00",
    "content": [
        {
            "text": "There are over three million properties at risk of surface water flooding in England. Surface water flooding happens when rain from major storms overwhelms local drainage. It is a real and growing threat to life, property, infrastructure, and to the economy."
        },
        {
            "text": "Our changing climate will bring more intense summer rainfall events, like those that caused so much disruption in London in 2021. The latest climate science predicts winter rainfall could increase by up to 59% by the end of the century. We must take action now to manage the increasing risks of surface water flooding."
        },
        {
            "text": "Lead local flood authorities are responsible for managing surface water flood risks on the ground, but the Environment Agency has a legal supervision over all sources of flooding. This ‘strategic overview’ role is distinct from the day-to-day operational role we have for managing flood risk from rivers and the sea."
        },
        {
            "text": "Local authorities are best placed to understand their surface water risk. However, we can play our part by assessing current and future risk, bringing partners together and allocating funding where it will have the greatest impact. Collectively all these activities allow the public, local authorities, and business, to better plan, protect, respond to and recover quickly from its effects. Here are some examples that are making a real difference."
        },
        {
            "text": "Using £2 million of government funding we supported 28 local authorities to produce detailed surface water models and maps that benefit 3.3 million people across the country. We’re not stopping there, as we will also provide a further £1.5 million to support other local authorities to do the same, benefiting a further three million people. All this information will be freely available from our Check Your Long Term Flood Risk webpage."
        },
        {
            "text": "We’ll also be overhauling our national flood risk mapping (National Assessment of Flood Risk) in 2024. The new mapping will be nationally consistent, use local information wherever possible and provide a much greater level of detail. It will show the impacts of a changing climate from increases in rainfall intensity, providing people and places with the information they need to plan and adapt."
        },
        {
            "text": "Improving our understanding of risk is only part of the story. We also need tangible actions that make a difference. As part of the government’s £5.2 billion programme for flood risk reduction, we have allocated funding for over 1,000 projects up and down the country to better protect people and properties from surface water flooding. Through the £150 million Flood and Coastal Resilience Innovation Programme we are working with local authorities to develop practical and innovative actions to bolster the resilience of communities at risk of surface water flooding. The North East Lincolnshire project is using real-time data from an urban drainage sensor network to target the best places for fitting sustainable drainage systems that reduce surface water runoff."
        },
        {
            "text": "It’s also vital we recognise the role water company infrastructure plays in draining urban areas and reducing the likelihood and impact of sewer and surface water flooding. In partnership with Ofwat we recently published a joint approach for how water companies should consider flood and coastal resilience as part of their statutory roles and duties. In future water company business plans we expect to see an increased use of sustainable drainage systems and nature-based solutions that provide a cost-effective way of keeping surface water out of sewers, increasing the resilience of communities whilst also enhancing the natural environment."
        }
    ]
}