{
    "url": "https://defencedigital.blog.gov.uk/2022/11/23/digital-discoveries-part-2-our-top-first-look-principles-and-methods/",
    "title": "Digital Discoveries Part 2: Our top First Look principles and methods",
    "authors": [
        "Jonathan Richardson"
    ],
    "categories": [
        "Digital Discovery Assessment Board"
    ],
    "pub_date": "2022-11-23T09:45:04+00:00",
    "content": [
        {
            "text": "First Looks are the Digital Discovery Assessment Branch’s (DDAB’s) way of assessing whether a project is suitable to proceed onto Discovery. "
        },
        {
            "text": "In Part 1, we covered the problems we had with assessing a submitted project’s potential for Discovery in an efficient manner and how we decided to test ways to quickly give a good enough dive into the problem."
        },
        {
            "text": "In this section we will go over the top principles and question areas in our initial conversations with project owners, which we called semi-structured interviews."
        },
        {
            "heading": 2,
            "text": "Semi-structured interview as the core of our method"
        },
        {
            "text": "The main method we used to carry out our First Look was the semi-structured interview. That is, an interview with general questions to answer but not a set of questions that must be rigidly adhered to. "
        },
        {
            "text": "To get the best out of a session we needed to prepare the interviewees. Not only did we want to ensure we spoke to the most knowledgeable individual(s) but it was also a way to introduce our ways of working, why we needed an interview and our principles (eg we work in a solution-agnostic way)."
        },
        {
            "text": "Along with the initial chat we also ensured that we had a detailed meeting agenda. We included links to the board and asked for relevant documents to be sent ahead of the meeting. "
        },
        {
            "text": "We also let them know that we planned to record the session to give us a chance to prepare if they were not happy with this."
        },
        {
            "heading": 2,
            "text": "Top 7 principles for running a First Look semi-structured interview"
        },
        {
            "text": "After a couple of test runs we decided on these key principles:"
        },
        {
            "heading": 2,
            "text": "The 6 key areas of information we needed by the end of a First Look semi-structured interview"
        },
        {
            "text": "You can see the board for yourself here - the main sections were based on what we needed to know by the end."
        },
        {
            "text": "The first two sections were basic admin for us:"
        },
        {
            "heading": 2,
            "text": "Summarising sessions"
        },
        {
            "text": "We aimed to summarise a session as soon as possible.  This meant that information was still fresh and we could check it with interviewees. It also meant that any team members who couldn’t make the call were aware of what was covered. "
        },
        {
            "text": "It also meant we could create themes for the problem and identify where we needed more information. We could draft a vision for it if we felt confident but the aim of the session was breadth of information rather than depth."
        },
        {
            "heading": 2,
            "text": "Team review"
        },
        {
            "text": "After the interview the team reviewed the outputs to determine what we should do next, which we call triage. In some cases it was to go into Discovery but in some we went into a Lean UX canvas to get more information to add depth to the problem, users and stakeholders."
        },
        {
            "text": "In other cases we discussed the willingness to work in a solution agnostic manner. If thepotential partner had a solution in mind and only that solution it could cause tension. As a team we made the decision and met the interviewee for what to do next."
        },
        {
            "text": "With so many potential projects we had to be ruthless to get through the work. "
        },
        {
            "heading": 2,
            "text": "Final output"
        },
        {
            "text": "By the end of the 4 week First Look session we produced a Problem Profile – basically a PowerPoint that summarised the work we carried out and laid out the options for next steps."
        },
        {
            "text": "The next steps involved collaboration, with the submitter deciding from the options which to proceed with. We give options to the submitter as ultimately it is their project and not for us to decide for them what happens next. But any option we do give must have evidence and reasoning."
        },
        {
            "heading": 2,
            "text": "How we are reviewing and refining First Looks"
        },
        {
            "text": "To get to this stage took a lot of discussion, iteration and refining and that work continues. Part of this is sharing it, first with the cross Defence UX community and now with this blog. "
        },
        {
            "text": "We continue to review and update each time we use the First Look template. Further problems we are looking at include:"
        },
        {
            "text": "We continue to work in the open and to open up our backlog and Kanban boards. As part of this we want to give better expectations of timings for submitters and where they are in the queue, along with reviewing the information we expect submitters to give on the gateway. "
        }
    ]
}