{
    "url": "https://naturalengland.blog.gov.uk/2022/11/23/establishing-a-conservation-breeding-programme-for-hen-harriers-in-southern-england/",
    "title": "Establishing a conservation breeding programme for hen harriers in southern England",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Licensing",
        "Protected sites and species",
        "Science and evidence",
        "Species re-introductions"
    ],
    "pub_date": "2022-11-23T12:06:47+00:00",
    "content": [
        {
            "text": "By: John Holmes, NE Strategy Director"
        },
        {
            "text": "Natural England, in partnership with the International Centre for Birds of Prey (ICBP), is establishing a conservation breeding programme for hen harriers as part of a pioneering project to reintroduce this iconic species to southern England. Ten young birds have recently been transported to England from France to found the breeding programme."
        },
        {
            "text": "Hen harriers were once found across upland and lowland Britain, but were lost from the mainland as a breeding species by the late 19th century. Despite recolonising naturally from the northern isles, they have remained rare due to ongoing illegal persecution and have failed to recolonise the lowland habitats that were used before their original decline."
        },
        {
            "text": "Reintroducing hen harriers to southern England is one of the six actions forming part of the 2016 Joint action plan to increase the English hen harrier population, published by Defra. The reintroduction is being led by Natural England and, if successful, will support wider efforts to restore the hen harrier’s historic breeding range in England."
        },
        {
            "text": "A conservation breeding programme"
        },
        {
            "text": "The aim of the reintroduction project is to re-establish a self-sustaining breeding population of hen harriers in southern England. We plan to source birds for release through captive breeding of rescued and orphaned individuals, the progeny of which will be released into the wild. The first ten birds that will found the conservation breeding programme have recently arrived in the UK from France and have completed 30 days in statutory quarantine. Veterinary checks have confirmed that they are free of disease and their health is being regularly monitored as they settle into their new home. They are not suitable for release back to the wild, but we hope they will be capable of leading long and healthy lives in captivity, and of breeding successfully to produce young birds for release."
        },
        {
            "text": "This is an exciting and experimental project; while birds of prey have been bred successfully in captivity and released into the wild as part of conservation projects across the world, this will be the first time it has been attempted for hen harriers. The conservation breeding programme is being hosted by the ICBP, world renowned experts in breeding birds of prey in captivity, and we are also working with rescue centres in continental Europe, with support from staff involved in other successful reintroductions."
        },
        {
            "text": "The Zoological Society of London (ZSL) are providing expert advice on disease risks, behaviour and welfare monitoring for captive and released birds."
        },
        {
            "text": "Releasing birds in Wiltshire"
        },
        {
            "text": "While hen harriers breeding elsewhere in Britain favour upland moorland, those in continental Europe show a strong preference for breeding in lowland arable crops. Establishing a lowland population of hen harriers in the UK would help to support a stable, self-sufficient population with the potential to expand in range. A detailed feasibility study by the University of Exeter confirmed the suitability of mixed farmland in southern England for a possible reintroduction. The Salisbury Plain and West Wiltshire Downs were identified as a prime location for releasing hen harriers, as this area contains a large expanse of high quality semi-natural grassland amongst arable habitats, a landscape that provides the birds with suitable roosting sites and an abundance of prey. It also has consistently good numbers of wintering hen harriers, which could be important for future genetics and behavioural interactions with released birds."
        },
        {
            "text": "We are working closely with farmers, land managers and game shoots to encourage further landscape-scale improvements to farmland habitats and systems in this area."
        },
        {
            "text": "These improvements will support hen harriers and bring broader benefits to farmland birds and other wildlife."
        },
        {
            "text": "Looking to the future"
        },
        {
            "text": "We hope that this long-term project will help this iconic species flourish and are excited about moving to the captive breeding phase with our partners at the ICBP. If this phase is successful, we hope to move on to releasing captive-bred birds over a number of years, perhaps even as soon as 2023. Over the course of the project, we aim to release around 100 birds, a number that would have a good chance of achieving a sustainable breeding population, according to the feasibility study and research into population viability."
        },
        {
            "text": "As with all reintroduction projects, we have considered the risks faced by birds once they are released into the wild, and we have carefully planned the release site and future work in order to mitigate and manage these risks. All released birds will be fitted with satellite tags so we can monitor their progress and survival, locate the nest sites of any that breed, and attempt to identify the causes of any deaths. Persecution remains a concern, but we are prepared for this, and will follow up any disappearances of tagged birds as assiduously as we do under our northern hen harrier tracking programme."
        },
        {
            "text": "We believe that the risks to hen harriers in lowland England would not be so high as to prevent the establishment of a breeding population. We plan to share more details and updates as we move into this new captive breeding phase, including more on the project background and aims, and insights into the progress of the conservation breeding and the fascinating lives of the released birds."
        },
        {
            "text": "Acknowledgements"
        },
        {
            "text": "We would like to thank our UK and international partners, including the International Centre for Birds of Prey, the Zoological Society of London, the rescue centres, conservation organisations and academics in France and in Spain, the University of Exeter, local landowners and stakeholders."
        },
        {
            "text": "We are grateful to the British Association for Shooting and Conservation for providing funds and advice to support our local stakeholder engagement work."
        },
        {
            "text": "The Southern Reintroduction complements the other actions set out in the hen harrier action plan which aim to support hen harriers in the northern uplands and tackle persecution. These include tagging and nest monitoring, diversionary feeding, and trialling brood management of birds nesting on grouse moors."
        }
    ]
}