{
    "url": "https://vmd.blog.gov.uk/2022/11/23/reducing-antibiotic-use-in-pets/",
    "title": "Reducing antibiotic use in pets",
    "authors": [
        "Dr Fraser Broadfoot"
    ],
    "categories": [
        "Anthelmintic Resistance"
    ],
    "pub_date": "2022-11-23T15:01:16+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Bacteria can pass between you and your pet "
        },
        {
            "text": "According to the vet charity for pets, The People’s Dispensary for Sick Animals around 52% of UK adults own a pet, with an estimated population of 10.2 million dogs and 11 million cats. 3.2 million of these pets are ’lockdown pets’ that is, acquired during the COVID-19 pandemic."
        },
        {
            "text": "Pets play an integral part in everyday life and share our living spaces. That can mean the sharing or transfer of bacteria too! Numerous studies have shown that bacteria, including antimicrobial resistant bacteria, can spread between pets and their owners. Despite this, until recently there has been limited focus on the use of antibiotics in companion animals, compared to the significant amount of work conducted to reduce use in humans and livestock."
        },
        {
            "heading": 2,
            "text": "Working together to reduce AMR"
        },
        {
            "text": "A coordinated, cross- sectoral approach in the UK has led to a reduction of antibiotic use in food producing animals by 55% between 2014 and 2021, including an 83% reduction in the use highest priority critically important antibiotics for human medicine."
        },
        {
            "text": "Coordinated by RUMA, this reduction was achieved using a collaborative, voluntary approach, working with vets and livestock professionals to change their behaviours around antibiotic prescribing, embed best practice and set realistic antibiotic reduction targets."
        },
        {
            "text": "The voluntary approach taken in the livestock sector has helped to build a sense of ownership, accountability and responsibility for the AMR issue, and this approach is now being taken within the companion animal and equine sectors."
        },
        {
            "text": "To help achieve this, the VMD is working with the newly formed RUMA Companion Animal and Equine Alliance, who are applying lessons learned from the livestock sector and working with the industry to agree on priorities for reducing antibiotic use and setting targets in the companion animal sectors."
        },
        {
            "text": "In addition, the VMD is also working with RCVS Knowledge to provide free online continuing professional development on Antimicrobial Stewardship for companion animal and equine vet practices. They are developing a tool to help small animal and equine practices benchmark their antibiotic use in a scheme called VetTeamAMR. Also part of VetTeamAMR is the existing RCVS Knowledge Farm Vet Champions project. This provides farm vets with free CPD on AMS as well as access to a SMART goals tool, to help them improve their antimicrobial use."
        },
        {
            "text": "We believe that these initiatives will help veterinary practices understand and monitor how antibiotics are being used and ensure that they are only used appropriately, which will help reduce the development of AMR and subsequently preserve the efficacy of antibiotics when they are needed for both pets and their owners."
        },
        {
            "heading": 2,
            "text": "Support the Antibiotic Amnesty"
        },
        {
            "text": "The RUMA Companion Animal & Equine Alliance (RUMA CA&E) is conducting a survey for clients to learn more about the reasons behind leftover antibiotic medications."
        }
    ]
}