{
    "url": "https://valuationoffice.blog.gov.uk/2022/11/23/revaluation-2023-and-business-rates/",
    "title": "Revaluation 2023 and business rates",
    "authors": [
        "portiagingell"
    ],
    "categories": [
        "Valuation"
    ],
    "pub_date": "2022-11-23T10:28:25+00:00",
    "content": [
        {
            "text": "Alan Colston is our Chief Valuer and Head of Surveying Profession. He outlines the main aspects of Revaluation 2023. Find out what sectors have seen changes and why. "
        },
        {
            "text": "The Valuation Office Agency regularly updates the rateable values of all business, and other non-domestic, properties in England and Wales."
        },
        {
            "text": "We do this to reflect changes in the property market. In turn, this helps ensure business rates bills are based on up-to-date information."
        },
        {
            "text": "It also helps redistribute the amount paid in business rates more fairly. And helps ensure bills reflect relative changes across sectors and locations. "
        },
        {
            "text": "Local councils use the rateable value to calculate a property’s business rates bill. "
        },
        {
            "text": " We publish future valuations now, before they come into effect on 1 April next year, to: "
        },
        {
            "text": "I really encourage people to use our Find a Business Rates Valuation Service on GOV.UK. If there is anything that is wrong or needs updating, let us know as soon as possible."
        },
        {
            "text": "Rateable values "
        },
        {
            "text": "Rateable values are the open market annual rental value a property could have been let for at a certain date. In this case, that date is 1 April 2021.  "
        },
        {
            "text": "A property’s rateable value is not the same as its business rates bill. Business rates bills are worked out by multiplying the rateable value by a ‘multiplier’ then applying any rates relief. This multiplier is set by central government. "
        },
        {
            "text": "Bills will also take into account any reliefs that a property is eligible for. In 2021-22, small business rates relief meant 740,000 business did not pay any business rates at all.  "
        },
        {
            "text": "If the rateable value goes up, it does not necessarily mean that the business rates bill will go up by the same amount.  "
        },
        {
            "text": "The overall picture "
        },
        {
            "text": "There are 2.14 million non-domestic properties in England and Wales. Together, these properties have a total rateable value of £70.3bn, compared with £65.7bn in 2017.  "
        },
        {
            "text": "It has been six years since the last revaluation. The new rateable values will reflect changes in rental values between 2015 and 2021.  "
        },
        {
            "text": "For most valuations we use rental values as the basis. So, if rents have gone up, then rateable values will go up. Likewise, if rents have decreased, so will rateable values.  "
        },
        {
            "text": "We do not set the market with our valuations; we reflect what occupiers are paying in rent to use their premises.  "
        },
        {
            "text": "The economic factors influencing rents vary by property market sectors and location. At a revaluation, it is normal to see different changes in rateable value for different types of properties and locations. Some sectors, properties and locations do better than others in the years between revaluation dates. These differences are reflected when a revaluation occurs. "
        },
        {
            "text": "We are moving to valuing properties more frequently, as pledged in the Business Rates Review. This will ensure that changes in economic conditions are fed through more rapidly into business rates liabilities. It will also be fairer as revaluations redistribute the overall level of business rates collected, reflecting changes in relative property values.  "
        },
        {
            "text": "COVID-19 impact "
        },
        {
            "text": "I know many ratepayers will want to know how COVID-19 has been reflected in their valuation. Ministers chose 1 April 2021 as the date we based our valuations on for this reason. It means our valuations will reflect the impact COVID-19 had on rental values at that time.  "
        },
        {
            "text": "In every sector there are likely to be individual properties that buck the trend. This may be down to the particular characteristics of that property and its location relative to other properties. "
        },
        {
            "text": "Changes in value across sectors  "
        },
        {
            "text": "These are the headline figures for 2023, by sector, looking at the percentage change in rateable value by sub-sector for both England and Wales. "
        },
        {
            "text": "Here we can see the percentage change in rateable value by sub-sector for England: "
        },
        {
            "text": "And for Wales, the percentage change in rateable value by sub-sector:"
        },
        {
            "text": "Of course, headline figures only ever tell part of the story."
        },
        {
            "text": "Retail, pubs and hotels are some of the sectors where rateable values have generally decreased. The evidence we collected about rents in this market show COVID-19 had a big impact. In most cases this was greater than the growth in these sectors since the last valuation."
        },
        {
            "text": "Here are some aspects of the revaluation that stand out to me."
        },
        {
            "text": "Retail"
        },
        {
            "text": "Some retail sectors like shopping malls were already seeing a reduction in values, and the pandemic continued this trend. Overall, there has been a decrease in rateable value for retail properties."
        },
        {
            "text": "But this is not universal across all retail sectors. There has been a general move to shopping locally in recent years. The evidence showed us that rents in neighbourhood parades and shops in many small-town centres and market towns or ‘staycation’ locations were stable. In some cases, they increased. "
        },
        {
            "text": " To support businesses facing changes in their bills, at the Autumn Statement the Chancellor announced a package of business rates support in England. This includes extending and expanding retail, hospitality and leisure relief. Read HMT’s business rates fact sheet for more information."
        },
        {
            "text": "Pubs and leisure"
        },
        {
            "text": "Many licensed and leisure properties saw growth between 2015 and 2020 – but were then affected by the pandemic."
        },
        {
            "text": "Some of these properties will see a reduction at revaluation and others will increase. Like for retail, this will depend on their location, and how much their growth between 2015 and 2020 was affected by the pandemic."
        },
        {
            "text": "The VOA has agreed an adjustment for COVID-19 with representatives of the pub industry. This adjustment has been applied to each pub valuation. It acknowledges that, for many, it will take time for trade to bounce back."
        },
        {
            "text": "A pub’s new rateable value will reflect growth in rent and turnover from 2015 to 2021. If that growth has been higher than the adjustment made for COVID-19, then the pub will see an increase in their rateable value. "
        },
        {
            "text": "Increasing costs"
        },
        {
            "text": "Properties that are valued using costs have seen their rateable values increase because building costs increased substantially between 2015 and 2021."
        },
        {
            "text": "These increases reflect increased material and transportation costs. In fact, the Building Cost Information Service all-in Tender Price Index (TPI) shows a 21% increase in costs over the last six years. The TPI is a trusted measure of price movements in the construction industry. It shows the average increase in building costs. Cost increases could be higher depending on what materials are used and the type of building."
        },
        {
            "text": "Specialised industrial properties are some that have been affected by this change, including steelworks, chemical works, cement works and breweries."
        },
        {
            "text": "Warehouses and logistics"
        },
        {
            "text": "The demand for logistic properties such as warehouses has been growing for some time. There were steep increases in online shopping, even before the pandemic. This has driven demand for properties in the logistic sector."
        },
        {
            "text": "Rents have increased significantly given this demand and the limited supply of this type of properties. Rateable values reflect this."
        },
        {
            "text": "Offices"
        },
        {
            "text": "In this sector, London has seen the lowest increase in rateable values. The COVID-19 pandemic has had a large effect here. There were also higher increases in the East and South East, with the increases in the East driven by increases in value along M1/M25 corridor."
        },
        {
            "text": "Not all properties pay business rates"
        },
        {
            "text": "Around 1.5m properties in England and Wales have a rateable value which means they may qualify for small business rate relief. Find out more about business rates relief."
        },
        {
            "text": "How we value"
        },
        {
            "text": "We use recognised valuation methods approved by the Royal Institution of Chartered Surveyors. These methods are used for many purposes, not just taxation."
        },
        {
            "text": "They have been clarified and confirmed by decisions from the courts over many years. The methodology we use depends on the type of property, and the evidence available."
        },
        {
            "text": "More information"
        },
        {
            "text": "The VOA publishes official statistics on non-domestic rating, and you can read the full official statistics on revaluation 2023. At this link you can find more information on the data shared in this article."
        },
        {
            "text": "You can read more about what a revaluation is and what it means for businesses."
        }
    ]
}