{
    "url": "https://defrafarming.blog.gov.uk/2022/11/23/slurry-infrastructure-grant-guidance-now-available/",
    "title": "Slurry Infrastructure grant: guidance now available",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-11-23T10:29:23+00:00",
    "content": [
        {
            "text": "Applications for the new Slurry Infrastructure grant will open on 6 December 2022. To help you prepare, we've made the full grant guidance available on GOV.UK. "
        },
        {
            "text": "The grant will help livestock farmers in England to improve or expand their slurry storage capacity to 6 months, based on existing livestock numbers. It will also fund the fitting of impermeable covers on grant-funded stores. "
        },
        {
            "text": "The GOV.UK guidance sets out the new grant offer in full and explains how to apply."
        },
        {
            "text": " You’ll also find guides on how to plan your storage, information about the prioritisation of grants in the first round if it is oversubscribed and detailed specifications for eligible items. "
        },
        {
            "text": "The Slurry Infrastructure grant is part of the Farming Investment Fund. "
        },
        {
            "heading": 2,
            "text": "Making the most of slurry "
        },
        {
            "text": "Back in February, we shared our vision for helping farmers make the most of their slurry."
        },
        {
            "text": "We explained how we are working with farmers and other experts to support investment in the systems that make best use of organic manures while minimising harm to the environment. Having sufficient, well-designed slurry storage is essential if we are to realise this vision."
        },
        {
            "text": "By law, farmers need enough storage and to apply nutrients in ways that meets crop need but does not cause pollution. "
        },
        {
            "text": "As we said in a blog post this summer, the new Slurry Infrastructure grant will complement better advice and fairer, more effective regulation. The grant will give farmers a chance to make the upgrades they need to go beyond current regulations and to invest in good storage. "
        },
        {
            "text": "We plan to run the grant over multiple years, improving it as we go. So, if you aren’t ready to apply yet or aren’t selected in the first round, don’t worry – there will be more opportunities to apply. "
        },
        {
            "heading": 2,
            "text": "Applying for a Slurry Infrastructure grant "
        },
        {
            "text": "As with other themes in the Farming Investment Fund, there are 2 stages to the application process. "
        },
        {
            "heading": 3,
            "text": "Stage 1: Online eligibility checker"
        },
        {
            "text": "An online checker will open on 6 December 2022 and close on 31 January 2023."
        },
        {
            "text": "Use the checker to see whether you can apply for a Slurry Infrastructure grant and estimate how much you could get based on your storage needs."
        },
        {
            "text": "During this stage, we’ll ask you to tell us how much storage you need to reach 6 months serviceable storage."
        },
        {
            "text": "Animal and Horticulture Development Board (AHDB) published an updated version of slurry wizard to help you work this out. "
        },
        {
            "text": "You must use the latest version (July 2022 or later) to make sure your calculations include correct rainfall figures. "
        },
        {
            "heading": 3,
            "text": "Stage 2: Full application"
        },
        {
            "text": "Once the online checker closes, the Rural Payments Agency (RPA) will identify applications which have a higher environmental benefit. This will be based on location and proximity to areas where action is most needed to reduce pollution from agriculture. "
        },
        {
            "text": "Those invited to make a full application will need to submit details about their project.  "
        },
        {
            "text": "These will be shared with the Environment Agency who will conduct a location and design check. This is to ensure that storage plans meet regulations and will reach at least 6 months storage. "
        },
        {
            "text": "We've designed the applications process in this way to save you time and money in the long run, by making sure your plans are right before you place any orders or start construction."
        },
        {
            "text": "It’s been a long time since we’ve offered slurry storage grants so, we expect demand to be high. Please don’t let this put you off."
        },
        {
            "text": "If we get more applications than we’re able to fund in the first round, the RPA will run a prioritisation exercise."
        },
        {
            "heading": 2,
            "text": "Standard costs"
        },
        {
            "text": "This grant differs from other Farming Transformation Fund themes because we use standard costs."
        },
        {
            "text": "Rather than getting a percentage towards the cost of your project, you’ll get a set contribution for each of the items your project needs. The grant contributions are based on 50% of current market costs. "
        },
        {
            "text": "This will make it much simpler for you to make an application. You won’t need to get 3 quotes for each item, and you’ll know in advance how much grant you’ll get depending on the needs of your farm. It also makes administration of the scheme easier for the RPA. "
        },
        {
            "text": "When the online checker opens, you’ll be able to enter details such as the store and cover types you want to build, the volume you need to reach 6 months capacity and choose supporting items."
        },
        {
            "text": "You’ll then get an upfront estimate of how much grant you could get based on your needs. "
        },
        {
            "heading": 2,
            "text": "Get ready "
        },
        {
            "text": "Our team will host a webinar on the Slurry Infrastructure grant on Wednesday 7 December 2022. You'll be able to put your questions to the policy leads during the session. Register to attend the webinar."
        },
        {
            "text": "Applications will open on 6 December. Subscribe to the blog to receive a reminder on the day. "
        }
    ]
}