{
    "url": "https://openpolicy.blog.gov.uk/2026/01/06/launching-a-new-co-design-toolkit-for-early-years-services/",
    "title": "Launching a new Co-design Toolkit for Early Years Services",
    "authors": [
        "Ellen Adams",
        "nehasharma",
        "Nicole Afonso Alves Calistri"
    ],
    "categories": [
        "Policy Lab",
        "Projects",
        "Skills, tools and techniques"
    ],
    "pub_date": "2026-01-06T12:11:01+01:00",
    "content": [
        {
            "text": "This blog launches a new co-design toolkit to support the development of services for early years. The co-design toolkit is a practical set of resources created to enable local authorities and communities to design public services together. It has been tested and developed with local authorities and members of the public in different locations across the country. Here, we introduce the toolkit, share reflections from those who helped to shape it and explore how it can be used to support collaborative service design in local government and beyond."
        },
        {
            "heading": 2,
            "text": "Why a co-design toolkit?"
        },
        {
            "text": "Policy Lab was commissioned by the Department of Health and Social Care (DHSC) to work with local authorities and parents and carers to support the development of early years services offered through the joint DHSC and Department for Education Family Hubs and Start for Life programme. The programme includes a strong focus on the 1,001 days from conception to the age of two, which are crucial to a child’s health, development and life chances."
        },
        {
            "text": "As part of the programme, local authorities receive funding to support parents, carers and families to co-design services, putting the needs of local babies and families at the centre of service design and delivery. The co-design toolkit emerged from a policy ambition to provide further support to bring the voices of parents and carers into the development of services which support families during those 1,001 critical days."
        },
        {
            "text": "In our initial phase of work, we engaged with nearly two thirds of the 75 local authorities receiving funding through the programme. This took place through a co-design workshop, survey and collective intelligence debate, helping us to better understand what local authorities needed to support the uptake of co-design approaches in early years services. Local authorities told us they wanted flexible, user-centred resources which could be adapted across different contexts and build on existing work. There was a strong appetite for less theory and more action."
        },
        {
            "heading": 2,
            "text": "Co-designing with communities"
        },
        {
            "text": "Our first phase of work identified the need for practical, hands-on support for local authorities to meaningfully involve people in the design of services. This pointed to the development of a co-design toolkit. In our second phase, we worked closely with parents and carers in six local authorities in Barnsley, Blackburn with Darwen, Camden, Durham, Lewisham, Sheffield to ensure the concept and content of the co-design toolkit worked on the ground, for both local authorities and families."
        },
        {
            "text": "We developed and tested the co-design toolkit in both in-person and online sessions with parents and carers, across varied environments. This included sessions with babies present, rooms without tables, and sessions with parents of children with Special Education Needs and Disabilities. Testing showed that the co-design approach and tools created space for meaningful participation by supporting quieter voices, sparking new conversations and providing just enough structure without being restrictive."
        },
        {
            "heading": 2,
            "text": "What’s inside the co-design toolkit?"
        },
        {
            "text": "The co-design toolkit for early years can be used by local authority service teams and co-design participants during in-person or online sessions."
        },
        {
            "text": "There are three core components:"
        },
        {
            "text": "Please see the short video explainer that walks you through the tools."
        },
        {
            "text": "To use the toolkit with people in person, we recommend printing it in colour and bringing it to your in-person session. More details on printing are in the playbook. We have also provided digital assets such as JPGs of activity cards. These support flexible use, including online sessions."
        },
        {
            "text": "You can download the toolkit here"
        },
        {
            "heading": 2,
            "text": "Making the co-design toolkit your own"
        },
        {
            "text": "The co-design toolkit provides a starting point for local authority teams to use co-design approaches. Although it has been tested in the context of early years services it can be adapted and used in other service areas. Since testing it, Parent and Carer Participation Leads in local authorities have continued to use the co-design toolkit as part of regular practice, supporting consistency, confidence and shared ownership."
        },
        {
            "text": "There is no right or wrong way to use the co-design toolkit for early years. Over time, we hope that other local authorities and organisations interested in co-designing services with people will add in their own activities or pieces of wisdom to make it their own and continue to share with others."
        },
        {
            "heading": 2,
            "text": "Bridging national policy and local voices"
        },
        {
            "text": "The co-design toolkit for early years services builds on Policy Lab’s work over more than ten years, to bring deep and visceral understanding of people’s experiences as well as participatory practices into policy. This experience underpins the toolkit, which enables greater participation in service development and brings voices from inside and outside of government together. The toolkit also demonstrates a practical response to a national policy ambition to increase parent and carer involvement in service development and helps to unlock local capacity and knowledge."
        },
        {
            "text": "Let us know how you are using the co-design toolkit in early years and other contexts."
        },
        {
            "text": "If you are interested in learning more about co-design approaches to develop policy or public services, get in touch with us at team@policylab.gov.uk."
        },
        {
            "text": "Acknowledgements"
        },
        {
            "text": "This toolkit was developed by Policy Lab with support from local authority teams, Parent and Carer Panel leads and members, policymakers, and sector experts from across England. We’re grateful to everyone who contributed – including Barnsley, Blackburn with Darwen, Camden, Durham, Lewisham, Sheffield local authorities, Professor Leon Cruickshank from Imagination Lancaster, and Claire Craig from Lab4Living for generously sharing their experiences, expertise and ideas."
        }
    ]
}