{
    "url": "https://mhclgdigital.blog.gov.uk/2026/01/06/modernising-democracy-transforming-the-electoral-registration-officer-portal/",
    "title": "Modernising democracy: Transforming the Electoral registration officer portal ",
    "authors": [
        "Joe Platonoff, Senior Product Manager, Elections Digital Team"
    ],
    "categories": [
        "Elections",
        "Technology"
    ],
    "pub_date": "2026-01-06T10:19:05+00:00",
    "content": [
        {
            "text": "The Electoral registration officer portal (EROP) is a secure web portal used by Electoral Registration Officers (EROs) – the officials responsible for maintaining accurate electoral registers in local authorities across the UK. The portal is used daily to process applications that directly affect people’s ability to vote. "
        },
        {
            "text": "The Elections Digital team in the Ministry of Housing, Communities and Local Government (MHCLG) recently completed a major transformation project  called ‘Optimising Services’. This long-term initiative used digital principles,  along with a phased rollout approach, to significantly improve EROP, making  the portal more efficient, easier to maintain, and better equipped to support future electoral reforms. "
        },
        {
            "heading": 2,
            "text": "What is EROP used for?  "
        },
        {
            "text": " The portal allows EROs to process applications for:  "
        },
        {
            "text": "These services were introduced or expanded as a result of the Elections Act 2022, which brought changes to how elections are run in the UK. EROP was built specifically to support these new or expanded services.  "
        },
        {
            "heading": 2,
            "text": "Why was Optimising Services needed? "
        },
        {
            "text": "EROP was originally built quickly to comply with legislative deadlines born out of the Elections Act 2022. The requirements encompassed a variety of needs, including enabling all applications to be submitted online, with each service addressed individually. To meet these stringent deadlines and  minimise technical complexity, EROP was constructed incrementally, beginning with the development of a VAC service. Consequently, each application type was created and managed as a separate service.  "
        },
        {
            "text": "As a result, within EROP:  "
        },
        {
            "text": "This fragmented structure made it harder to continue improving and  maintaining the system or respond to policy changes or the needs of EROs. These needs are well documented by the team, making great use of user feedback. However, reacting to new feedback was challenging because the fragmented structure made changes hard to implement. To address these  needs, the team outlined Optimising Services, a solution to create a  centralised application system that could handle all services in a unified way. "
        },
        {
            "heading": 2,
            "text": "A phased rollout to build confidence  "
        },
        {
            "text": "When introducing major changes to a live public service, especially one as critical as electoral administration, stability and trust are paramount. EROP is used daily by local authorities to process applications that directly affect people’s ability to vote. Any disruption could have serious consequences, and  switching over all services in EROP for all EROs at once would have carried  risk. To manage this, the team opted to develop this work through a phased rollout. "
        },
        {
            "heading": 2,
            "text": "What the phased rollout looked like "
        },
        {
            "text": "The rollout began with a group of 12 EROs from across England, Scotland and Wales. These early adopters started using the new system for some types of  applications, while all other services remained on the legacy platform. This allowed the team to: "
        },
        {
            "text": "As confidence grew, the recently tested phase was rolled out to all EROs, and  the phased launch rollout expanded to include other types of applications in phases. This created a steady flow of new services being tested, and now-tested services being released to the live product for everyone.  "
        },
        {
            "heading": 2,
            "text": "Unlocking real-time benefits "
        },
        {
            "text": "In addition to improving feature delivery times, a significant outcome of the project was our ability to unlock new improvements during the rollout itself,  not just after the transition was complete. "
        },
        {
            "text": "The benefits of Optimising Services enabled the team to deliver  enhancements that previously would have required separate development work for each service. This meant that improvements were delivered faster  and more efficiently, providing live benefits as part of this large-scale project. "
        },
        {
            "heading": 2,
            "text": "Completing the journey "
        },
        {
            "text": "The final phase involved transitioning older elector applications to the new system and decommissioning the legacy services. This was done carefully, working through services to avoid disruption.  "
        },
        {
            "text": "By August 2025, the legacy infrastructure was successfully decommissioned.  By this time, the new Optimising Services system had already processed over 2.1 million applications – a clear sign of its robustness and readiness for  future demands. "
        },
        {
            "text": "Optimising Services is a great example of how thoughtful design,  collaboration and user-centred development can deliver lasting  improvements to public services. It’s a milestone worth celebrating, and a foundation for future innovation in electoral services. "
        },
        {
            "text": "This project was delivered by a multidisciplinary team, which included colleagues from our contracted supplier, Softwire Technology Ltd."
        }
    ]
}