{
    "url": "https://digitaltrade.blog.gov.uk/2026/01/06/promoting-ethical-alternatives-to-monetary-incentives-in-user-research/",
    "title": "Promoting ethical alternatives to monetary incentives in user research",
    "authors": [
        "Adnan Mouhiddin, Senior User Researcher"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2026-01-06T13:26:16+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Adnan Mouhiddin"
        },
        {
            "text": "At the Department for Business and Trade (DBT), we take ethics in user research seriously. In our first blog in this series, we explored why ethics matter throughout the research process. In the second, we shared how we apply these principles in practice. This blog focuses on how we ensure that any incentives we offer our participants are both ethical and beneficial."
        },
        {
            "heading": 2,
            "text": "What are incentives?"
        },
        {
            "text": "To incentivise someone is to motivate them. In research, incentives are a well-established ethical principle. They are rewards offered to participants to compensate for their time and the insights they provide."
        },
        {
            "text": "Incentives can also boost recruitment and remove barriers for those who might otherwise be unable to participate. This helps make research more inclusive and can enable researchers to diversify their research sample."
        },
        {
            "text": "Monetary incentives are an intrinsic part of ethical research, but they can  impact its integrity. Our key concerns revolve around whether incentives accidentally influence participants, compromise data quality, or are too generous.  Our approach is grounded in research ethics principles: respect for autonomy, individual beneficence, and justice. These principles help us balance participants’ consent and research integrity, maximising benefits and minimising potential harm.   "
        },
        {
            "heading": 2,
            "text": "Beyond monetary incentives"
        },
        {
            "text": "At DBT, our research supports our mission to drive economic growth and help businesses access the support they need."
        },
        {
            "text": "Our researchers gather insights from our service users about their needs, to inform policy and improve users’ experience. These efforts contribute to the common social good. In this context, incentives are more than recruitment tools. They come in various forms that serve a number of purposes. This is evident in the following examples."
        },
        {
            "heading": 3,
            "text": "Building partnerships"
        },
        {
            "text": "Non-monetary incentives help us build partnerships with the public and reduce the risk of undue influence. For example, one of our projects involved creative arts students and SME businesses. In this project, the students partnered with businesses and collected data that enabled them to analyse business activities. The resulting outcome was students gaining an in-depth understanding of how businesses operate, and for business owners to gain a better understanding of their own businesses and reflect on their practices. This transformed the experience for both parties into a meaningful exercise rather than a mere function of data collection. "
        },
        {
            "text": "Highlighting the common social good of participating in research can also raise awareness of the topics we explore at DBT. Research is said to be a reflective process which involves both researchers and participants. Questions asked and the overall conversation during sessions can lead to shared knowledge and new ideas. In this sense, the process and its outcome, when explained in advance, could provide a form of incentives for participants to contribute to our projects."
        },
        {
            "heading": 3,
            "text": "Supporting participants in their work"
        },
        {
            "text": "Participants often tell us that research sessions helped them think differently about their practices, then discover new opportunities, available support, and learn more about their sector. For instance, in one of our research projects, participants were asked to find answers to questions related to their business on our website business.gov.uk. It signposted the users to further support services and networks. Many of our users shared that they were unaware of some listed services."
        },
        {
            "heading": 3,
            "text": "Giving participants a voice"
        },
        {
            "text": "Participating in our research projects also gives the participants a platform to advocate for their sector and have their voice heard, and this could also serve as an incentive for business community to share their experience with us. When we share our findings in DBT, direct quotes are often described as powerful, informative, and influential. Sharing these insights with the wider business community can foster a sense of altruism. Participation in research helps the community of the sector involved, enables the collective work of contributing to shaping public policy through expertise and opinion, and creates shared benefits. In this way, the process and outcomes of research can themselves serve as meaningful incentives."
        },
        {
            "heading": 3,
            "text": "Encouraging altruism"
        },
        {
            "text": "Even when monetary, research incentives can promote altruism and community principles. For example, participants may choose to donate their incentive to a charity or a cause they care about. This shows how both monetary and non-monetary incentives can complement each other and contribute to the public good. "
        },
        {
            "heading": 2,
            "text": "Conclusion: Monetary and non-monetary incentives: hand-in-hand"
        },
        {
            "text": "We shared in a previous blog how we take research ethics seriously in our research projects, and how they are part of every step of the research process. The sampling process (i.e. deciding on the appropriate method to select and invite participants to take part in each project) involves a significant level of safeguarding and protecting our participants.  "
        },
        {
            "text": "Every research project has its own ethical questions that are embedded in its process and methods. These issues are part of the research journey. As DBT researchers, we do not claim that we can eliminate all ethical issues completely. We are aware that this is an impossible task. Instead, we are reflective practitioners. We share a deep awareness about the impact of these ethical issues on our research participants and how we can minimise the impact of these issues. "
        },
        {
            "text": "We also acknowledge that monetary incentives, while intrinsic to any research we undertake, are not without their own issues that we highlighted above. Therefore, we embed non-monetary incentives in our practise by incorporating them in the research information sheet (the document that details research aims, processes and steps) for participants, promoting them in playbacks and sharing research findings with them. As a result, we maintain the 3 principles that guide research incentives: participants’ autonomy, individual beneficence, and fairness. "
        },
        {
            "text": "If you are interested in finding out more about how we set up some of these incentives, or use others, we’d love to hear from you in the comments."
        }
    ]
}