{
    "url": "https://foresightprojects.blog.gov.uk/2026/01/06/the-future-of-childhood-1-engaging-with-children-and-young-people/",
    "title": "The Future of Childhood #1: Engaging with Children and Young People",
    "authors": [
        "Government Office for Science"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-01-06T15:55:00+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Improving outcomes for future generations"
        },
        {
            "text": "What could childhood look like in 10-20 years? That’s what the Government Chief Scientific Adviser is exploring in GO-Science’s latest Foresight project: The Future of Childhood and Adolescence. We want to understand what factors might impact childhood in the future, how these issues impact each other, what different versions of the future could look like, and create positive visions for the future of childhood."
        },
        {
            "text": "We are working with researchers, policymakers, parents, practitioners, and – most importantly – children and young people, to bring together perspectives from across society, build evidence and understanding and ultimately increase opportunities for future generations."
        },
        {
            "text": "The project will run throughout 2026, and we’ll use the Futures, Foresight and Horizon Scanning blog to tell you more about our approach – starting with how we’re engaging with children and young people."
        },
        {
            "heading": 2,
            "text": "“Nothing about us without us”"
        },
        {
            "text": "We are engaging children and young people as each experience, idea, and story we hear makes our work more relevant and grounded in reality. This is called ‘co-production’, where we involve those who stand to benefit from the project throughout. Their voices will inform our decisions, shape our outputs and inspire our thinking, bringing essential perspectives and challenge to the project."
        },
        {
            "heading": 2,
            "text": "Youth Advisory Panel"
        },
        {
            "text": "We’ve been working with the office of the Children’s Commissioner for England to set up a Youth Advisory Group as part of our governance which will meet monthly throughout the project. The group is made up of 16 young people aged 14-18, with diverse backgrounds and interests."
        },
        {
            "text": "In our first session in November, we discussed what childhood means to them, and the biggest factors they think will shape childhood in the UK over the next 10-20 years. They told us they view childhood as a time of innocence and fun, valuing education, parental support and freedom from responsibilities. They identified many drivers of change for the future, from AI to changes in education and relationships, to inequalities and social media. In the December session, we explored how these drivers might impact childhood in the future, focusing on areas of uncertainty. For example, for AI they imagine potential positive impacts (e.g. for learning), but also negative ones, worrying about its impact on jobs, skills, creativity and social connection. Their insights will help shape the scenarios we’re developing to demonstrate the range of possible futures. We’re grateful for their input and looking forward to working with them on other parts of the project over the next year."
        },
        {
            "heading": 2,
            "text": "Looking forward: Other ways we will involve children and young people in the project"
        },
        {
            "text": "In addition to the Youth Advisory Group, we want to hear from children of all ages from across the UK. Working with partner organisations, we will investigate what children think a positive future could look like, using participatory futures and social research methods. We will also hear from parents, carers, teachers, social workers, healthcare professions, and more."
        },
        {
            "text": "We plan to publish the final report for this Foresight project in 2026/27."
        }
    ]
}