{
    "url": "https://lifeathmrc.blog.gov.uk/2022/10/10/5-top-tips-for-wellbeing/",
    "title": "5 Top Tips for Wellbeing",
    "authors": [
        "Nicola Barson"
    ],
    "categories": [
        "Culture & Values",
        "General",
        "Mental Health"
    ],
    "pub_date": "2022-10-10T08:34:13+00:00",
    "content": [
        {
            "text": "To celebrate World Mental Health Day we caught up with Mark Turpin, a Wellbeing Rep based in our Liverpool regional centre, to get some top tips for improving mental health. Mark has worked in the civil service for over 20 years and has lots of experience when it comes to managing mental health and wellbeing in the workplace."
        },
        {
            "text": "Healthy work-life balance"
        },
        {
            "text": "For me, I have found having a healthy work-life balance is essential in what can sometimes be a high-pressured environment. I believe that wellbeing is so important for our staff as there needs to be something other than work to look forward to. After all, a happy and healthy workforce is going to be a productive one."
        },
        {
            "text": "Take a look at my top tips to help improve your wellbeing:"
        },
        {
            "heading": 4,
            "text": "1. Join the Wellbeing Group"
        },
        {
            "text": "The Wellbeing Group is an inclusive place for staff at HMRC, we meet every other week to discuss any ideas we have for wellbeing in the workplace. We also have a monthly newsletter and host regular events to promote the work that we do."
        },
        {
            "heading": 4,
            "text": "2. Engage in a hobby"
        },
        {
            "text": "I feel that having a hobby or interest is so important for my wellbeing because it allows me to relieve the pressure that I sometimes face during the working day. My main interests are walking, meditating and comedy improv."
        },
        {
            "heading": 4,
            "text": "3. Practice breathing exercises"
        },
        {
            "text": "I have found meditating and breathing techniques very beneficial. All you need to do is take  a few deep breaths – this is especially useful when you are experiencing a stressful moment at work, you just need to take a moment for yourself."
        },
        {
            "heading": 4,
            "text": "4. Get in touch with nature"
        },
        {
            "text": "Taking a break from my desk and going for a walk allows my thoughts and stress to drift away, it’s especially nice when I go for a walk in a park or forest as I get to appreciate the trees and the wildlife that surrounds me."
        },
        {
            "heading": 4,
            "text": "5. Step out of your comfort zone "
        },
        {
            "text": "Pushing the boundaries of what we’re comfortable with can help us improve in so many ways, physically, mentally and emotionally. My love of improv was scary at first, but it’s given me so much confidence and really helped me be more confident in the workplace. I’ve put myself forward for so many projects that I wouldn’t have had the nerve to do a few years ago."
        },
        {
            "text": " "
        },
        {
            "text": "Come work for us!"
        },
        {
            "text": "We have a wide range of roles available, with lots being added all the time. Take a look at our current vacancies and apply now!"
        }
    ]
}