{
    "url": "https://deframedia.blog.gov.uk/2022/10/10/environment-secretary-vows-to-clamp-down-on-fly-tipping/",
    "title": "Environment Secretary vows to clamp down on fly-tipping",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2022-10-10T13:53:42+01:00",
    "content": [
        {
            "text": "There was an op-ed from the Environment Secretary in the Telegraph over the weekend which focused on the Government’s action to tackle the issue of fly-tipping."
        },
        {
            "text": "Within the piece, the Environment Secretary vowed to clamp down on fly-tipping and make sure those responsible face the full force of the law."
        },
        {
            "text": "Our new waste reforms will combat fly-tipping. Reform will see increased background checks for firms moving or trading waste, ensuring waste is managed by authorised persons only and in a safe manner, while mandatory waste tracking will mean waste is tracked from the point it is produced so regulators can better detect illegal activity."
        },
        {
            "text": "We are providing capital funding of £450,000 to enable several councils implement a range of measures to tackle fly-tipping, including installation of CCTV."
        },
        {
            "text": "We have also consulted on changing the rules to ensure households do not have to pay to get rid of DIY waste at recycling centres. At the same time, we are also reviewing the use of booking systems at recycling centres, as they could be increasing the risk of fly-tipping."
        },
        {
            "text": "Environment Secretary Ranil Jayawardena said:"
        },
        {
            "text": "In recent years we have bolstered local authorities’ powers to tackle fly-tipping. In 2016 local authorities were given the power to issue fixed penalty notices for small scale fly-tipping."
        },
        {
            "text": "In 2019 local authorities and the Environment Agency were also given the power to issue fixed penalty notices to householders who fail in their household waste duty of care and give waste to unlicenced waste carriers. This has given councils an alternative to prosecutions and assists them in taking a proportionate enforcement response."
        },
        {
            "text": "Other tools available to them include the power to seize and destroy vehicles used for fly-tipping."
        },
        {
            "text": "The Government has set up the Joint Unit for Waste Crime to disrupt serious and organised crime and reduce its impact on the environment and the economy.  The Unit brings together agencies from across the UK including the Environment Agency; Natural Resources Wales; the Scottish Environment Protection Agency; the Northern Ireland EA; the police; HMRC, the British Transport Police and the National Crime Agency."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}