{
    "url": "https://civilservice.blog.gov.uk/2022/10/10/miscarriage-civil-service-helps-to-break-the-silence/",
    "title": "Miscarriage: Civil Service helps to break the silence",
    "authors": [
        "Angela MacDonald, HMRC Deputy CEO and Second Permanent Secretary"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-10-10T10:34:36+00:00",
    "content": [
        {
            "heading": 3,
            "text": "In Baby Loss Awareness Week, Angela MacDonald, Second Permanent Secretary at HM Revenue & Customs, welcomes new guidance to offer support for Civil Service parents experiencing a miscarriage."
        },
        {
            "text": "Sadly, miscarriage affects a lot of parents - one in four pregnancies ends in miscarriage. And yet, it’s a subject that may be shared in hushed tones and shrouded in awkwardness  or self-blame. It will have happened to some of our colleagues, but we may never know about it."
        },
        {
            "text": "It’s important we recognise and support our colleagues across the Civil Service who have been affected by a miscarriage. This is why, during Baby Loss Awareness Week, I am pleased to announce the new model miscarriage guidance we have made available to departments."
        },
        {
            "text": "This guidance sets out the support available to employees who have been affected by a miscarriage. This includes counselling and advice from Employee Assistance Programmes, sick and special leave, flexible working hours and arrangements for supporting partners. The guidance also provides advice to managers to enable them to help their team member during this very difficult time."
        },
        {
            "text": "We have developed the model miscarriage guidance in consultation with the Cross-Government Pregnancy Loss Employee Network. Their lived experience has helped shape the guidance and I wish to thank them for sharing their time and experiences."
        },
        {
            "text": "The Women’s Health Strategy sets out the ambition of tackling taboos in the workplace, such as miscarriage. I hope the new guidance sends out a clear message that you are not alone and we are here to support you."
        },
        {
            "text": "If you have been affected by a miscarriage, please speak to your manager. Your department will also have other support available, such as their Employee Assistance Programme, and may have an Employee Network that you can reach out to for support. Your manager will be able to help you with this as well."
        },
        {
            "text": "Working together, we can break the silence on miscarriage in the Civil Service."
        },
        {
            "text": "Want to find out more? Civil servants can contact richard.boyd@beis.gov.uk."
        },
        {
            "text": "I am grateful to Mike for sharing his story."
        }
    ]
}