{
    "url": "https://teaching.blog.gov.uk/2022/10/10/supporting-mental-health-and-wellbeing-in-schools/",
    "title": "Supporting mental health and wellbeing in schools",
    "authors": [
        "Louisa Williams",
        "Sion Williams",
        "Hannah Woodhouse"
    ],
    "categories": [
        "Professional Development",
        "Pupil wellbeing and behaviour",
        "Teacher mental health",
        "Teacher wellbeing",
        "Uncategorized"
    ],
    "pub_date": "2022-10-10T13:28:51+01:00",
    "content": [
        {
            "text": "In this blog post, several schools from across the country share their different ways and approaches to supporting pupil and staff wellbeing."
        },
        {
            "heading": 3,
            "text": "Wellbeing in a complex needs school"
        },
        {
            "heading": 4,
            "text": "Louisa Williams is Assistant Head Teacher and Mental Health Lead, at John Grant school, a complex needs school in Norfolk.  "
        },
        {
            "text": "Enabling learning within a complex needs school means meeting children’s needs physically and mentally alongside our staff members who also need support."
        },
        {
            "text": "Handling emotions is embedded within the daily curriculum, in particular through the use of an adapted curriculum framework for “Zones of Regulation” which teaches self-regulation development and recently, our focus has been to embed ‘mindfulness’ into our daily curriculum."
        },
        {
            "text": "We have “Talking rooms” for staff and pupils to enable them time to themselves, or an opportunity to talk to someone else. Outdoor wellbeing “chill areas”, weekly visits from Nelson our therapy dog and a wide range of activities are also available throughout the year."
        },
        {
            "text": "Our dedicated Parent Support Advisor works with parents on supporting their child’s social, emotional and mental health. We also have an emotional wellbeing practitioner who helps pupils with their work, focusing on emotional awareness."
        },
        {
            "text": "Working within a complex needs school can be challenging, so we work hard to ensure our staff feel supported and valued. Suggestions from our annual staff wellbeing questionnaire are placed in the action plan and as a result, we have weekly wellbeing challenge sessions, subsidised yoga classes and social termly staff wellbeing events. We also have wellbeing weeks each half term, where no staff member attends after school meetings."
        },
        {
            "text": "Trained Mental Health First Aiders are available to pupils and staff and as a mental health first aider myself, I have an open-door policy for staff support and advice. We also encourage team de-briefs at the end of the day to help staff members to switch off from work at home."
        },
        {
            "text": "Wellbeing and mental health are an established part of our school ethos and recently completing the senior mental health lead training has further reassured me that we have the right support in place for all staff and pupils at our school."
        },
        {
            "heading": 3,
            "text": "Making mental health ‘everybody’s business’"
        },
        {
            "heading": 4,
            "text": "Sion Williams is Deputy Head Teacher at Wadebridge School in Cornwall"
        },
        {
            "text": "At Wadebridge School, we have always put a strong emphasis on promoting positive mental health with an established team of staff Health Champions and an extensive student support team."
        },
        {
            "text": "In 2019, we challenged ourselves to ensure mental health and wellbeing is everybody’s business, making this top priority on the whole school improvement plan. This status was mirrored in our performance management process, with every member of staff’s principal development target focussing on mental health and wellbeing."
        },
        {
            "text": "We’ve invested in a long-term staff training programme with two senior members of staff trained as Mental Health First Aid Instructors. To date, we have trained over 130 members of staff and 40 colleagues from other institutions. We also recently completed senior mental health lead training. Pooling our learning from this helped us audit provision and develop a strategic whole school mental health and wellbeing action plan."
        },
        {
            "text": "Wadebridge was also an early adopter of the statutory Relationship Sex and Health Education (RSHE). We took this as an opportunity appoint a subject leader, reviewed the curriculum so that every student’s timetable included RSHE lessons, with teaching about mental health. We also ensured the RSHE team consisted of specialist teachers who all receive up to date and ongoing training."
        },
        {
            "text": "In 2020, we received a Gold Award from Carnegie Centre for Mental Health in Schools. Working on this award provided an excellent audit tool that fed into effective action planning and served as a springboard for launching other initiatives to further improve our provision. Plans for next year include:"
        },
        {
            "text": "Developing a whole school approach to mental health and wellbeing has genuinely helped improve staff and student wellbeing, the learning environment and the quality of teaching and learning."
        },
        {
            "heading": 3,
            "text": "Implementing learning from mental health training "
        },
        {
            "heading": 4,
            "text": "Hannah Woodhouse is Assistant Head, Wellbeing lead and part-time class teacher at Moorlands Primary School in Huddersfield"
        },
        {
            "text": "Taking part in the senior mental health lead training felt a little daunting at first but now, having completed the course, I know we are on track with our whole school mental health approach. The training helped us recognise where we are getting things right for our children, families, staff and Moorlands community."
        },
        {
            "text": "The training helped us make decisions about mental health support that are tailored to our school’s needs and there was time to clarify ideas through the support of a dedicated coach, and deep dive into our provision and support."
        },
        {
            "text": "Webinars with other schools meant ideas could be shared in a safe, non-judgemental environment, with everybody working towards providing a universal approach to wellbeing for young people and those that work with them."
        },
        {
            "text": "The trainer provided good practice examples from other schools which helped us to more clearly define our intention for universal and targeted wellbeing support and how we would implement this to meet the needs of all our children and families. We are also lucky to be part of a Mental Health Support Team, who have supported us in developing our dedicated pastoral team and upskilled us immensely."
        },
        {
            "text": "Our biggest challenge though has always been assessing impact and ensuring we meet the needs of all pupils. To help with this, we created a pupil voice exercise to establish, ‘‘what does or doesn’t make you feel good?’ and ‘what can school do to make you feel good?’. Children, from a range of year groups, told us playtime and lunchtimes are not always enjoyable. They aren’t restful for everyone, and there is no time to ‘chill’ after a busy morning."
        },
        {
            "text": "This insight led us to apply for a grant through our Mental Health Support Team which enabled us to develop a ‘Quiet Pod’ in our outdoor ‘Summersville’, designed by the children, for children."
        },
        {
            "text": "Our next step is to ensure the universal approach of resilience and self-care. Children are currently working on their own personal ‘zones of regulation’ for their new classrooms and will be encouraged to use these as ‘work in progress’ – which essentially, sums well-being up!"
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Further information "
        },
        {
            "text": "Head over to gov.uk for more mental health and wellbeing support and resources and to get more info on the Education Staff Wellbeing Charter which sets out shared commitments to promote, protect and enhance the wellbeing of staff. "
        }
    ]
}