{
    "url": "https://space.blog.gov.uk/2022/10/10/taking-action-on-space-sustainability/",
    "title": "Taking action on space sustainability!",
    "authors": [
        "Robyn Haigh"
    ],
    "categories": [
        "Space sustainability"
    ],
    "pub_date": "2022-10-10T16:54:40+01:00",
    "content": [
        {
            "text": "This week (4-10 October) we’ve been celebrating World Space Week, with the theme of Space and Sustainability."
        },
        {
            "text": "Space sustainability has become an increasingly important issue as more satellites are launched into space. Satellites provide us with vital services on Earth, such as GPS, disaster management and carbon emission data, maritime navigation systems and much more."
        },
        {
            "text": "Without a more sustainable space environment, the services we rely on in our daily lives are at risk."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why isn’t the space environment sustainable? "
        },
        {
            "text": "On average, 990 satellites will be launched annually by 2028. There are already 5,800 functional satellites and 2,600 defunct satellites in orbit - our orbital highways are getting congested!"
        },
        {
            "text": "Other pieces of space debris are also causing issues. They can vary in size, from large rocket bodies to tiny flecks of material smaller than 1 cm."
        },
        {
            "text": "In the graphic below you can see the different size and estimations of space debris up in space. Small pieces of debris can cause a real threat to our human endeavours in space, like when the International Space Station was hit and its robotic arm was damaged."
        },
        {
            "heading": 3,
            "text": "What is Astroscale doing to develop a sustainable space economy? "
        },
        {
            "text": "If your car was broken down, you would not leave it on the motorway: you would arrange for someone to move the car. Abandoned vehicles lead to congested roads, frantic collision avoidance and ultimately crashes that spread dangerous debris all over the road."
        },
        {
            "text": "For the same reason cars are removed from the roads, satellites should be also – what goes up, should come down."
        },
        {
            "text": "At Astroscale we are the leading company developing in-orbiting servicing across all orbits, from Low Earth Orbit (LEO) to Geostationary Orbit (GEO). We believe removing debris and servicing satellites will secure services on Earth and economic gain that will benefit us all now and in the future."
        },
        {
            "heading": 3,
            "text": "Our servicers"
        },
        {
            "text": "We recently performed a number of successful operations for our ELSA-d mission (End-of-Life Services by Astroscale – demonstration)."
        },
        {
            "text": "This demonstration tested some of the technologies and capabilities necessary to launch a full-service debris removal business."
        },
        {
            "text": " "
        },
        {
            "text": "To build on the learning from ELSA-d, the UK team is partnering with the European Space Agency (ESA) and the UK Space Agency to develop ELSA-M - M standing for Multiple, our state-of-the-art servicer that is designed to capture and de-orbit three or four satellites in a single mission."
        },
        {
            "text": "ELSA-M is set to launch by the end of 2024, with plans to launch an end-to-end removal service for constellation operators thereafter - keep an eye out for more news!"
        },
        {
            "heading": 3,
            "text": "Active Debris Removal"
        },
        {
            "text": "We were also very excited to recently announce working on a UK Active Debris Removal (ADR) mission in partnership with the UK Space Agency."
        },
        {
            "text": "COSMIC - which stands for the Cleaning Outer Space Mission through Innovative Capture - is developing plans to remove two UK-registered defunct satellites from space by 2026."
        },
        {
            "text": " "
        },
        {
            "text": "The Japanese Space Agency (JAXA) is also championing space sustainability technology programmes and last year renewed a Memorandum of Cooperation with the UK Space Agency."
        },
        {
            "text": "JAXA is investing in an Active Debris Removal inspection mission, ADRAS-J, which Astroscale’s team based in Tokyo will launch in 2023 to characterise an upper rocket body, acquire and deliver movement observational data to better understand the debris environment."
        },
        {
            "heading": 3,
            "text": "Astroscale Docking Plate – a toe hook for satellites"
        },
        {
            "text": "Another way we’re creating a safer space environment is through our docking plate (DP)."
        },
        {
            "text": "The DP can be integrated onto satellites to prepare them for future removal or servicing, such as refuelling, refurbishments and relocation."
        },
        {
            "text": "This lightweight, universal fitment is low in cost and designed to support satellite operators to demonstrate responsible space practice and alignment with international best practice."
        },
        {
            "text": "There is an opportunity for satellite servicing and debris removal to catalyse future innovations in the assembly of very large structures, and manufacturing products such as generating renewable energy in space."
        },
        {
            "text": "The space community must rapidly develop the technology, enhance and implement the policy and regulatory norms, and invest in the in-orbit servicing economy in the UK, together with our international partners."
        },
        {
            "text": "In-orbit servicing will need to become part of routine satellite operations by 2030 for us to effectively safeguard our orbital environment.  Actions must be taken now: for the benefit of future generations."
        },
        {
            "text": "Find out more about Astroscale."
        },
        {
            "text": "Robyn Haigh is the Marketing and Communications Executive at Astroscale."
        }
    ]
}