{
    "url": "https://nationalscreening.blog.gov.uk/2022/10/10/uk-nsc-screening-manual-describes-best-practice-for-national-screening-programmes/",
    "title": "UK NSC screening manual describes best practice for national screening programmes",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-10-10T10:05:40+01:00",
    "content": [
        {
            "text": "Today we have published an online manual that gives an overview of best practice for implementing health screening programmes anywhere."
        },
        {
            "text": "The UK National Screening Committee screening in healthcare manual sets out the evidence base, policy requirements, implementation processes, quality assurance requirements and core pathway components needed for national screening programmes."
        },
        {
            "text": "We have based the information and resources on decades of world-class screening provision in the UK but they should be transferable to any country."
        },
        {
            "text": "The UK NSC screening manual is aimed at policy makers, public health leaders and screening stakeholders, including:"
        },
        {
            "text": "New screening programmes recommended by the UK NSC should be developed, implemented and evaluated in line with the information in the manual, which includes sections on:"
        },
        {
            "text": "We will publish additional chapters soon covering standards and thresholds and quality assurance. And we will expand the manual over time to provide guidance on best practice for condition-specific screening programmes."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}