{
    "url": "https://defradigital.blog.gov.uk/2022/10/10/why-i-keep-talking-about-mental-health/",
    "title": "Why I keep talking about mental health",
    "authors": [
        "Kata Papunen"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-10-10T07:30:18+01:00",
    "content": [
        {
            "text": "On World Mental Health Day, Kata Papunen reflects on the value of such initiatives and considers her own journey, including personal struggles which have been helped through having access to a range of workplace assistance and resources."
        },
        {
            "text": "With telly channels, social media sites and even workplace noticeboards filled with supportive slogans and self-care tips, celebrities opening up about their own experiences, and more and more workplaces offering dedicated support for mental wellbeing, what’s the value of awareness days like World Mental Health Day"
        },
        {
            "text": "There’s also an awareness week in May, and earmarked dates like Schizophrenia Awareness Day (always in July). Have we not exhausted the topic of mental health and ticked all the right boxes? Or opened up and offered a listening ear that solves all the emotional problems?"
        },
        {
            "text": "The answer is ‘no’, we haven’t yet reached a point where we can afford to stop talking about mental health. Some of us might be familiar with the phrase ‘one in four adults experience mental ill-health in any given year’. However, that household survey was conducted in 2009, and personally I believe it to be higher now, given the uncertainty and challenges we have faced since."
        },
        {
            "text": "Covid certainly didn’t help reduce that ratio, with some organisations now referring to mental health as the other, second or hidden pandemic. For example, the text support service ‘Shout 85258’ saw the need for their service doubling from early 2020 to early 2021."
        },
        {
            "text": "Covid also put a further strain on waiting times for support services, with research by the Royal College of Psychiatrists discovering that almost a quarter on waiting lists end up waiting for more than three months. The same research found that unsurprisingly, as a consequence, more people in need now end up contacting emergency or crisis services for support."
        },
        {
            "heading": 2,
            "text": "Workplace wellbeing, and what we do in Defra to support each other"
        },
        {
            "text": "According to the charity Mind at least one in six workers experience mental ill-health, with approximately 300,000 people ending up leaving the workplace every year due to it. These are astonishing numbers – and I’m one of those.\nI don’t actually think it’s any different to my chronic neck pain, or the time in my life when my tonsils caused me a lot of grief. I too have mental health as part of the package that makes up me. Sometimes, like this summer and autumn, I experience pain and problems."
        },
        {
            "text": "I’m very lucky that in our Digital, Data and Technology Services (DDTS) function we have a culture of respect, inclusion, and of championing wellbeing. I’ve felt safe from stigma or discrimination and able to say when I’m not feeling OK to colleagues, including senior ones, and actually been supported by many of them, which I’m very grateful for."
        },
        {
            "text": "As my colleague Jo reflected in her recent blog post, we also benefit from flexible working, and for me this means I can attend my counselling sessions on a Friday afternoon, without having to book it off as annual leave or be signed off sick. The supportive culture we have means I can also have that appointment open in my diary without having to fear judgement or ‘jokes’."
        },
        {
            "text": "Other things that we have in place include our regular ‘Air & Share’ calls, run jointly with one of our suppliers to create a safe space to share self-care tips and be heard and supported, which I’ve enjoyed joining."
        },
        {
            "text": "We get access to a wealth of wellbeing resources too, including free access to the Headspace App, and an Employee Assistance Programme. While I was waiting to access counselling, I benefitted greatly from having a free, confidential, 24/7 support line available to me through this route."
        },
        {
            "text": "Whilst it couldn’t solve my problems, it offered a safe space to be heard when I really needed it. With Headspace, again we have explored this resource together in my own team, sharing tips, and doing some meditation exercises together on team calls."
        },
        {
            "text": "We’ve also organised our own wellbeing campaigns and are planning on having the next one soon. It’s great to be part of a workplace where we are actively encouraged to do these things, recognising the value of mental health and how it impacts both individuals and the workplace."
        },
        {
            "text": "There certainly are benefits for employers to support mental health at work beyond it being the right thing to do. The charity Mind, citing analysis done by Deloitte, also highlights the economic consequences of poor mental health for employers with the price tag somewhere between £74 and £99 billion a year for the UK economy."
        },
        {
            "text": "Against those figures, investing in people – whether it be assistance programmes for support, or manageable workloads – certainly seems a sustainable and efficient way to make some financial savings."
        },
        {
            "heading": 2,
            "text": "Campaigns, awareness raising and a LOT of talking"
        },
        {
            "text": "Not that I’ve ever struggled to understand the importance of mental wellbeing or been against championing the cause, but it wasn’t until my time at university that I became more active and wanted to do ‘something’ myself."
        },
        {
            "text": "That ‘something’ turned into co-founding a student mental health campaign group, and after graduation becoming a ‘Time to Change’ champion. Time to Change was a national campaign run by Mind and Rethink Mental Illness that focused on tackling stigma and raising awareness through local hubs and champions."
        },
        {
            "text": "Being a champion got me involved in public events, as well as organising our own at shopping centres and even bus stations, starting conversations about mental health and signposting information and support."
        },
        {
            "heading": 2,
            "text": "Join me in making a pledge"
        },
        {
            "text": "Quite often we would ask people to make a pledge; a short commitment to what they would do to not only take part in our campaign, but to support their own or someone else’s wellbeing."
        },
        {
            "text": "To mark this year’s World Mental Health Day, I would like to ask you to make a pledge; why not share it below in the comments section."
        },
        {
            "text": "So, for this year’s World Mental Health Day, which carries the slogan to ‘Make mental health and wellbeing for all a global priority’, my first pledge is going to be continuing to do my part to support it. . And the second one? To make this an autumn of guilt-free time to rest and recharge!"
        }
    ]
}