{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/10/10/world-mental-health-day-reassurance-in-trying-times/",
    "title": "World Mental Health Day - reassurance in trying times",
    "authors": [
        "Jason Brandon"
    ],
    "categories": [
        "Coronavirus",
        "Mental health"
    ],
    "pub_date": "2022-10-10T11:36:47+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Just when you thought it was safe..."
        },
        {
            "text": "I’m sure it’s not just me who is struggling to keep up with pace of national and international developments in the world at the moment. I know I would feel a little more at ease if some of the news items appearing in my social media feed were foreseeable although, unfortunately, much of what I read or hear is thoroughly unpredictable and often quite disturbing."
        },
        {
            "text": "As someone who is now carefully more active on Twitter, I have come to realise what it means to ‘doom-scroll’, especially during any downtime. New research commissioned by the Office for Health Improvement and Disparities (OHID) reveals almost seven in 10 people in the UK report regularly experiencing the ‘Sunday Scaries’."
        },
        {
            "text": "That’s partly why they have launched the latest phase of their Better Health – Every Mind Matters campaign. By answering five simple questions on the dedicated website, personalised ‘Mind Plans’ are created, providing pointers on dealing better with stress, anxiety, mood swings and how to feel more in control."
        },
        {
            "text": "It’s well timed. I am readily informed about the impacts of the cost-of-living crisis, the ‘real time’ debates in our political environment, minute by minute updates on succession arrangements for the monarchy, the conflict in Ukraine and the many not so existential threats to our existence, like spaceships smashing into asteroids to prevent them becoming ELEs (extinction level events).  As I mentioned earlier, unpredictable, and not ideal for my emotional wellbeing."
        },
        {
            "heading": 2,
            "text": "World Mental Health Day is here"
        },
        {
            "text": "So, in the midst of all this uncertainty, I feel some reassurance when I see the calendar flip to October 10 2022 and another World Mental Health Day begins. This annual opportunity to prioritise our psychological wellbeing feels more essential than ever."
        },
        {
            "text": "This year’s theme is a simple but pertinent one: 'Make mental health and wellbeing for all a global priority'. Our shared experiences of the last two and a half years make the reason for this focus blisteringly self-evident."
        },
        {
            "text": "For many years, as a social work professional, I witnessed and experienced the struggle to achieve an equal level of recognition and social justice for people needing mental health support, in comparison to those with a physical need."
        },
        {
            "text": "And yet, during the recent trauma of a global pandemic, we were awakened to the collective ‘new normal’ of looking out for each other in our respective communities and became even more expert in managing own emotional wellbeing and that of others."
        },
        {
            "text": "Of course, we also witnessed the tragedy of people who weren’t able to access necessary care and support when living in isolation. Pandemic emergency planning caused us to take a fresh approach to social inclusion and the impact on both physical and mental health."
        },
        {
            "text": "The excellent Centre for Mental Health recently published Honouring our stories of the Pandemic, providing a powerful insight into the everyday lives of people coping with difficult times. A variety of experiences and concerns are referred to including anxiety, loneliness, racism, resilience, addiction, relationships, discrimination, grief and loss to name but a few."
        },
        {
            "heading": 2,
            "text": "Support in and out of the workplace"
        },
        {
            "text": "Of course the impact on people’s careers and employment potential took a hit too, so it is gratifying to see the Department for Work and Pensions announce £122 million of NHS funding to provide mental health support alongside employment advice to help more people stay in work or return to the job market quicker."
        },
        {
            "text": "I’m sure we will gain many more insights from the COVID enquiry, which got underway this month, but there is already much we have learned, which we can carry forward when considering the wellbeing of our communities on a local, national and international scale in the future."
        },
        {
            "text": "Social work remains critical to supporting people with their mental health. It no longer remains the perceived exclusive specialism of clinical professionals. All social workers need to be equipped to identify and understand the social determinants of mental health and emotional wellbeing in whichever area of practice they operate. World Mental Health Day is another chance to demonstrate what we have to offer and what we can do to help others live fuller, happier and heathier lives – in  mind as well as body."
        }
    ]
}