{
    "url": "https://ukhsa.blog.gov.uk/2018/09/13/flu-vaccination-what-you-need-to-know-about-this-years-programme/",
    "title": "Flu vaccination: What you need to know about the 2018 programme",
    "authors": [
        "Paul Cosford"
    ],
    "categories": [
        "Health Protection",
        "Immunisation and vaccination"
    ],
    "pub_date": "2018-09-13T12:20:42+01:00",
    "content": [
        {
            "text": "With another flu season almost upon us our Medical Director Professor Paul Cosford has answered some key questions about flu and flu vaccination."
        },
        {
            "text": "This blog is about the 2018/2019 flu season. For the most up-to-date information, read our blog about the 2019 programme."
        },
        {
            "text": "Please note we cannot answer any questions that relate to individual health concerns. You should consult your GP or specialist consultant."
        },
        {
            "heading": 2,
            "text": "What is flu?"
        },
        {
            "text": "Influenza, or flu, is a viral infection that mainly affects the respiratory system. It is usually characterised by fever, chills, headache, aching muscles, joint pain and fatigue."
        },
        {
            "heading": 2,
            "text": "When should I get vaccinated?"
        },
        {
            "text": "We encourage those who are eligible to get their flu vaccine when they are called for immunisation, so they are protected for the peak of the season which is usually around January and February, although this can change every year."
        },
        {
            "text": "This year there has been a phased roll out of the new vaccine for those aged 65 and over. This means GPs and pharmacies have received their order later than usual this season mostly in late October or November. All deliveries have now been received and adults aged 65 and over adults aged 65 and over who have not yet been vaccinated should contact their GP or pharmacist to make an appointment."
        },
        {
            "text": "The flu season can last into spring depending on which strain is circulating and how fast it spreads, but activity usually dies down from March onwards."
        },
        {
            "heading": 2,
            "text": "Why is flu a problem?"
        },
        {
            "text": "Flu is contagious meaning it can easily be spread to others. Some people with flu do not have any symptoms however they may still be able to pass the virus to others ."
        },
        {
            "text": "In most people, flu is a self-limiting illness, however for some people, particularly those in what we call ‘at-risk’ groups, flu can results in a  serious infection."
        },
        {
            "heading": 2,
            "text": "Who is most at risk from flu?"
        },
        {
            "text": "There are certain groups who are at higher risk from flu; these include pregnant women, those over the age of 65 and those with serious health conditions. We offer the flu vaccine to people in all of these groups, as well as some children, to help protect them from catching and spreading flu. Eligible people can have their flu vaccine at their GP surgery or a local pharmacy offering the service. Some midwifery services can offer the vaccine to pregnant women each winter."
        },
        {
            "text": "This year we are introducing a more effective flu vaccine for those aged 65 and over as well as offering all eligible adults under 65 the ‘quadrivalent’ vaccine, which protects against a total of four strains of flu."
        },
        {
            "heading": 2,
            "text": "What’s new for the 2018/19 flu season?"
        },
        {
            "text": "The newly available ‘adjuvanted’ vaccine for those aged 65 and over is expected to significantly boost effectiveness by improving the body’s immune response to the vaccine. This is important because typically, older adults’ bodies do not respond as well to the flu vaccine due to their naturally weaker immune systems. Older adults are also more likely to suffer complications from flu."
        },
        {
            "text": "This enhanced vaccine has the potential to lead to:"
        },
        {
            "text": "The broader flu vaccination programme will also be improved by offering all eligible adults under 65, including pregnant women, health care workers and those with serious health conditions, the ‘quadrivalent’ vaccine in injected form. This protects against a total of four strains of flu; two strains of flu A and two strains of flu B."
        },
        {
            "text": "We will also extend the nasal spray vaccine to primary school children in year 5 (650,000 extra children), meaning the vaccine will be offered in schools to children in reception and in years 1, 2, 3, 4 and 5 and to two and three year olds through general practice. The programme will eventually roll out to all primary school children. Due to having typically poorer hand and respiratory hygiene than adults, children tend to spread flu more easily, so protecting them is also important for protecting the rest of the population."
        },
        {
            "text": "National clinical leaders have sent a letter to all chief executives of NHS trusts highlighting the importance of frontline healthcare workers protecting their patients, colleagues and families by getting vaccinated against flu. NHS England has also offered the vaccine to social care workers free of charge again this year that are often in close contact with some of the most vulnerable groups."
        },
        {
            "heading": 2,
            "text": "How can I protect myself, my family and those around me from the flu?"
        },
        {
            "text": "Flu is very infectious and the virus can live on hands and hard surfaces for up to 24 hours. This is why it is important to “Catch it, Bin it, Kill it” - “Catch” any sneezes in a tissue, “Bin” any tissues immediately and “Kill” the virus by washing your hands with soap and warm water. Avoid contact with sick people and wash your hands often with soap and water or use an alcohol-based hand rub. If you are unwell, look after yourself, drink plenty of fluids and stay at home so you don’t spread flu to others."
        },
        {
            "text": "The vaccine remains the best defence we have to protect against the spread of flu and we encourage everyone eligible to get it each year."
        },
        {
            "heading": 2,
            "text": "What types of vaccine should I get?"
        },
        {
            "text": "Adults under 65 in at risk groups and pregnant women are being offered the quadrivalent vaccine this year which protects against four strains of flu."
        },
        {
            "text": "Those aged 65 and over are being offered the newly introduced enhanced ‘adjuvanted’ version of the trivalent vaccine, which boosts their immune response. As this vaccine has been delivered to GP practices and pharmacies between September and the end of November, appointments for flu vaccination are more spread out than in previous years. It is important that anyone aged 65 or over receives the vaccine that is most effective for their age group. If in doubt you should contact your GP to make an appointment."
        },
        {
            "text": "Children receiving the flu vaccine as part of the childhood flu vaccination programme will receive a quadrivalent vaccine as a nasal spray – or by injection if they are not eligible to receive the spray."
        },
        {
            "heading": 2,
            "text": "Will the vaccine work?"
        },
        {
            "text": "How well the vaccine will work varies year on year as we can never fully predict how flu will affect the population. Overall, our data found that the vaccine was not as effective last year as we usually see, particularly for those aged 65 and over. This is why we are bringing in the enhanced vaccine for this group this season. In addition, we are offering the quadrivalent vaccine to all under 65s in at risk groups which will protect against 4 strains of flu."
        },
        {
            "heading": 2,
            "text": "How are flu vaccine strains decided?"
        },
        {
            "text": "The World Health Organization (WHO) monitors influenza globally and each year convenes a vaccine composition group that recommends the strains of flu virus that should be included in the flu vaccine for the next flu season based on a review of data from around the world.  It then takes 6-8 months for the vaccine manufacturers to produce sufficient quantities of the flu vaccine for the annual campaign."
        },
        {
            "text": "Flu is unpredictable. If a change in the virus is detected once production has started there isn’t time to change it ahead of the flu campaign."
        },
        {
            "heading": 2,
            "text": "What about reports of swine flu circulating?"
        },
        {
            "text": "We have reached the point in the season where flu is now circulating, and there have been a number of national media articles recently about ‘swine flu’ cases in the UK."
        },
        {
            "text": "Swine flu was the unofficial name given almost a decade ago to the then new strain of influenza (flu) that was responsible for the flu pandemic in 2009-2010 (technical name A(H1N1)pdm09). With memories stretching back to that time, it’s perhaps not surprising that there are some concerns when we hear about swine flu."
        },
        {
            "text": "The reality is that today, ‘swine flu’ is considered one –amongst many– regular types of seasonal flu and we see it circulating most years, with this year being no exception. Given the regularity of the circulation of A(H1N1)pdm09 it is covered by the annual seasonal flu vaccine this, and most, years. Our blog explains further."
        },
        {
            "heading": 2,
            "text": "What were the uptake rates for 2017/18?"
        },
        {
            "text": "Last year we saw improved uptake rates in all categories:"
        },
        {
            "text": "There is clearly still room for improvement within the vaccination programme and we urge everyone who is eligible or responsible for an eligible person to think about protecting their health with the vaccine this winter."
        },
        {
            "heading": 2,
            "text": "Should all healthcare workers be vaccinated?"
        },
        {
            "text": "Unless contraindicated, healthcare professionals have a responsibility to be vaccinated to protect their patients from flu. Their NHS employers have a responsibility to make it easy for staff to get the vaccine."
        }
    ]
}