{
    "url": "https://defrafarming.blog.gov.uk/2021/08/10/a-view-from-the-farm/",
    "title": "A view from the farm",
    "authors": [
        "Harry Baker Cresswell"
    ],
    "categories": [
        "A view from the farm",
        "environmental land management schemes"
    ],
    "pub_date": "2021-08-10T13:01:58+01:00",
    "content": [
        {
            "text": "My name is Harry Baker Cresswell. I farm Preston Mains Farm in Northumberland."
        },
        {
            "text": "I have been involved in tests and trials since 2018. It has been a great opportunity for myself and the 52 other farmers in the 23 Burns Collective to help Defra co-design the new environmental land management schemes."
        },
        {
            "text": "We got together as a group of farmers to develop land management plans for the farm holdings within the 23 Burns Group’s area."
        },
        {
            "text": "From the plans we developed, we came together to identify opportunities for us to collaborate to deliver bigger, more joined-up environmental outcomes."
        },
        {
            "text": "We found that a local trusted adviser was really important to help us develop the holding plans and identify outcomes we could deliver together."
        },
        {
            "text": "The independent advisers we used in our trial had a wonderful local knowledge of our landscape, which made it easier for us to spot opportunities to deliver together. Most of our farmers would be willing to pay for high quality local advice."
        },
        {
            "text": "We thought that one of the ways in which the new schemes could help pay for advice is through an uplift or bonus for collaboration."
        },
        {
            "text": "We really liked the idea of the land management plan and found it a useful way to help us see the potential our farms can deliver for the environment. We found that we didn’t need a structured template for the plan – each of our farms is different so it’s not a one-size-fits-all approach."
        },
        {
            "text": "Rather than a template, we used a set of questions that helped stimulate discussion. These questions opened a range of different possibilities on our farms to deliver environmental outcomes."
        },
        {
            "text": "We then set out the outcomes we felt we could deliver in our plans, this included targets."
        },
        {
            "text": "I was lucky enough to make a video showing how my farm could deliver some of the outcomes in the land Management plan I developed.  I’ll share it at the bottom of this post."
        },
        {
            "text": "I’ve included a few photos below of Howick Scar Farm that show the area of whinsill grassland in between the farm steading and the sea.This is a habitat unique to Howick Scar amongst the 23 Burns Farmer Group but it is still part of the collaborative approach as the pastures act as a fine corridor from scrubby woodland towards farmland."
        },
        {
            "text": "By coordinating management of the fields on this area and across surrounding farms more value will be delivered. The species-rich nature of the fields is illustrated in the close-up shot below – lots of hay rattle and hawkbit which thrive in a minimal input management approach. It’s looking good at this time of year."
        },
        {
            "text": "Some of our farmers are preparing to take part in the Sustainable Farming Incentive pilot which we are looking forward to being part of, as well as continuing with tests and trials. I’d encourage everyone to get involved in tests and trials and the environmental land management pilots to help Defra co-design the new schemes."
        },
        {
            "text": "If you have any questions about test and trials, email ELMtestingandtrials@defra.gov.uk. You can read the latest evidence report on the blog."
        },
        {
            "text": "If you'd like to get involved in our co-design work, send an email to ffcpcodesign@defra.gov.uk."
        },
        {
            "text": " "
        },
        {
            "text": "Read the transcript."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}