{
    "url": "https://companieshouse.blog.gov.uk/2021/08/10/closing-your-company-and-applying-for-voluntary-strike-off/",
    "title": "Closing your company and applying for voluntary strike off",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-08-10T13:11:06+01:00",
    "content": [
        {
            "text": "The process for starting a limited company is relatively straightforward and our guidance will take you through everything you need to set up. Once registered with Companies House, people often overlook that having a company brings legal responsibilities and information that must be filed every year, even if the company is dormant or not trading."
        },
        {
            "text": "Some people will register a limited company with a well-intentioned desire to trade at a future date, or simply because they want to protect the business name. Even though there are good intentions to run the business, things do not always go to plan and sometimes you might have a registered company you no longer want or intend to use."
        },
        {
            "text": "For others there may come a day when your company is no longer economically viable or there is no one to take over or to pass the company on to when you decide to retire. Having a plan to help you to wind things up will make the process go smoothly."
        },
        {
            "heading": 2,
            "text": "How to remove your company from the Companies House register"
        },
        {
            "text": "The legal term for this process is dissolution or striking off. By doing this, the company ceases to exist, and you will not need to send us any further information like your annual accounts and confirmation statement."
        },
        {
            "text": "For a voluntary dissolution to begin, the company must meet certain conditions. You can apply to strike off your company, but only if it:"
        },
        {
            "text": "If your company does not meet these conditions, you’ll have to voluntarily liquidate your company instead."
        },
        {
            "heading": 2,
            "text": "Before you apply"
        },
        {
            "text": "Before applying for strike off, you have certain responsibilities to close down your company properly."
        },
        {
            "text": "You must announce your plans to all interested parties and HM Revenue and Customs (HMRC). Employees (if any) must be treated according to the company rules, business assets disposed of, and accounts emptied. If you do not do this, any assets of a dissolved company will be become property of the Crown because it does not have a legal owner."
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "You can apply to strike off your company online, using your Companies House account and authorisation code. Form DS01 can also be filed on paper – this usually takes longer to process."
        },
        {
            "text": "For companies with multiple directors, more than half of the directors need to sign the application before it can be submitted. A copy of the application must be sent within 7 days to anyone who could be affected. This includes members (shareholders), creditors, employees and directors who did not sign the application."
        },
        {
            "text": "If your company has never traded, the process is quite simple. Once you’ve applied for strike off, you must inform HMRC that the company has never traded and will shortly be struck off the Companies House register."
        },
        {
            "text": "If your company has traded, but meets the conditions, you must send your final statutory accounts and a Company Tax Return to HMRC, stating that these are the final trading accounts and that the company will soon be dissolved."
        },
        {
            "text": "When we receive your application, we will confirm that it has been completed correctly and publish it in the Gazette. There are 3 Gazettes:"
        },
        {
            "text": "If there are no objections to strike off, the company will be struck off the register once the 2 months mentioned in the notice has passed. A second notice will be published in the Gazette, which means the company will not legally exist anymore (it will have been ‘dissolved’). If you owe late filing penalties to Companies House, we will usually accept the dissolution and allow the company to close without paying the fine."
        },
        {
            "heading": 2,
            "text": "Withdrawing your application for strike off"
        },
        {
            "text": "You must withdraw your application if your company is no longer eligible to be struck off, for example if it is trading or becomes insolvent. You can also withdraw your application if you change your mind and want to keep your company."
        },
        {
            "text": "You should do this immediately using the Companies House online service or by sending a paper form DS02."
        },
        {
            "heading": 2,
            "text": "After your company is dissolved"
        },
        {
            "text": "Although the company will not exist, information for dissolved companies is kept for 20 years after they are dissolved. This dissolved information can still be requested from Companies House or the National Archives. Also, it's worth noting that the company name can be reused by someone else with a new unique company number."
        },
        {
            "text": "As with any legal process it's best to seek professional advice before you make any decisions."
        }
    ]
}