{
    "url": "https://insideDIO.blog.gov.uk/2021/08/10/dio-helps-to-create-uk-space-commands-first-home/",
    "title": "DIO helps to create UK Space Command’s first home",
    "authors": [
        "Chris Colley"
    ],
    "categories": [
        "Armed Forces",
        "Space Command"
    ],
    "pub_date": "2021-08-10T13:21:52+00:00",
    "content": [
        {
            "text": "A special ceremony at Space Command Headquarters at RAF High Wycombe marked the official opening of UK Space Command, with the first 'Space Operator' badges presented to personnel. [Crown Copyright, MOD 2021]DIO has helped to create the first home for UK Space Command’s Headquarters at RAF High Wycombe in Buckinghamshire. The establishment of UK Space Command is a crucial step in the development of a coherent strategy for military space operations to advance UK interests."
        },
        {
            "heading": 2,
            "text": "Delivering the new Space Command headquarters quickly"
        },
        {
            "text": "The DIO team worked collaboratively with AECOM to set out a fast-paced renovation project which went from initial concept to phase one completion within 6 months – a fantastic achievement."
        },
        {
            "text": "Despite the ongoing challenges caused by COVID-19, DIO worked with Air Infrastructure and Kier to set a flexible contract route for delivery. Early on-site engagement ensured that the scope and nature of the refurbishment work required could be determined, and close collaboration allowed DIO and Kier to progress into contract quickly."
        },
        {
            "text": "Following contract award, DIO and Kier worked proactively with Air Infra and UK Space Command to agree finishes and furnishings that would suit the new UK Space Command Headquarters with MOD specialists advising on decisions around internal branding and design and Smarter Working features."
        },
        {
            "text": "The agreed scope of works included the refurbishment and refurnishing of two floors of internal offices with supporting kitchen, toilet and service facilities and decorated with LED lighting – a sustainable and modern cost saving measure resulting in lower utility costs – and modern colours in paint and flooring."
        },
        {
            "text": "The new headquarters of UK Space Command [Crown Copyright, MOD 2021]An external refurbishment of the 70-year-old building was also required, including cleaning of water-stained brick work, replacement and refurbishment of rainwater pipes, new lighting and building furniture, resurfacing of original concrete paths and car parks, and new modern  cladding. The hand railings at the building’s entrance were reconfigured to conform to modern standards, and the installation of a simple yet modern backlit sign has brought the façade into the 21st Century."
        },
        {
            "heading": 2,
            "text": "Protecting UK interests and capabilities in Space"
        },
        {
            "text": "The stand-up of UK Space Command is a crucial step to ensure we protect UK interests in space and builds on the commitments outlined in the Defence Command Paper, to invest an additional £1.4 billion on space over the next 10 years. The ability to operate in space is further enhanced by an increase in Defence funding of £24 billion over the next four years, as announced by the Prime Minister last year."
        },
        {
            "text": "When at full operating capability, UK Space Command will provide command and control of all of Defence’s space capabilities, including the UK’s Space Operations Centre, RAF Fylingdales, SKYNET and other enabling capabilities."
        },
        {
            "text": "Vice-Chief of the Defence Staff Admiral Sir Tim Fraser KCB ADC, Air Vice Marshall Paul Godfrey OBE, MP Jeremy Quin, Commander, UK Strategic Command General Sir Patrick Sanders KCB CBE DSO ADC Gen and Air Chief Marshal Sir Mike Wigston KCB CBE ADC stand outside the Headquarters to mark the official stand up outside of UK Space Command at RAF High Wycombe. [Crown Copyright, MOD 2021]DIO is proud to have worked with our industry partners AECOM and Kier, alongside Air Infra, to complete the first phase of a providing a fitting headquarters. The second phase will commence shortly and be completed later in the year, providing a building which will enable UK Space Command personnel to deliver space operations, space workforce training, and space capability development on behalf of Defence."
        }
    ]
}