{
    "url": "https://gdsgeospatial.blog.gov.uk/2021/08/10/hey-wheres-my-data/",
    "title": "Hey! Where's my data?",
    "authors": [
        "Howard Askew, Data Management Specialist, Ordnance Survey"
    ],
    "categories": [
        "Data",
        "Data Standards"
    ],
    "pub_date": "2021-08-10T13:59:33+01:00",
    "content": [
        {
            "text": "Data Management Specialist at Ordnance Survey, Howard Askew, describes his recent work on Data Improvement for the Geospatial Commission, and how this new tool will help to tackle, two of the big challenges faced by users of geospatial data today: "
        },
        {
            "text": "The COVID-19 pandemic response brought the power of geospatial data analysis into sharp focus. Now more than ever, we need to maximise the smart use of location data, analysis and insight to make good decisions to drive economic, social and environmental recovery."
        },
        {
            "heading": 2,
            "text": "Where do you start and how do people find data they can trust?"
        },
        {
            "text": "To start to answer this question we gathered colleagues from around 30 public bodies from England, Scotland, Wales and Northern Ireland. We stuck them in a virtual room and together we explored how to signpost new data users to relevant organisations. "
        },
        {
            "text": "It’s little surprise, that for most an internet search engine is usually the first port of call, experienced users might visit individual organisations or departmental websites directly, whilst others find themselves on data portals such as data.gov.uk."
        },
        {
            "text": "Whatever route users take, our research shows they encounter significant challenges:"
        },
        {
            "text": "This ‘Data Discovery’ is the first stumbling block on the road to improved access to better location data and data-driven decision making.   The challenge faced is not insignificant, however, this is where discovery metadata really demonstrates its value. "
        },
        {
            "heading": 2,
            "text": "What is Metadata? "
        },
        {
            "text": "Think of the labels on all the cans in a supermarket. If the labels were missing, how would you know if you were buying baked beans, mushy peas or dog food?  Moreover, imagine you are directed to the area where the beans are kept and are confronted with the no label scenario! You know you're getting beans as you're in the bean aisle, but the disappointment, wasted effort and frustration you feel when you bring home salad beans instead of baked beans, effectively ruins date night! These metadata labels help organise, share and discover data assets. Metadata is not a new concept. There are many documented metadata standards all describing roughly the same intent, one such standard recommended by Government for geospatial data is UK Gemini.  "
        },
        {
            "text": "What may come as a surprise is that many of our publicly held data have missing, incomplete or incorrect metadata.  We found huge variation in approaches to data discovery among UK data publishers. Often this work is seen as secondary to an organisation’s public task and deprioritised in favour of frontline services.  "
        },
        {
            "heading": 2,
            "text": "Mapping data publishers to themes and keywords "
        },
        {
            "text": "I started with data.gov.uk – envisaged as a single portal for all public sector datasets. I wanted to explore a data-driven approach to the challenge and used the Application Programmer Interface (API) to retrieve information on all the resources listed there. What can we learn from this?"
        },
        {
            "heading": 2,
            "text": "Digging Deeper…....."
        },
        {
            "text": "This hints at two of the wider challenges around improving discovery – incentivising organisations to use metadata labels, and managing reference data across sectors. Is there a consistent language that can be used across organisations? "
        },
        {
            "text": "Digging deeper, focusing on the 22,000 geospatial datasets from central government bodies and agencies, I collected metadata labels and potential keywords by text mining the titles and abstracts. For example, from the abstract…"
        },
        {
            "text": "“With Code-Point Open, you can display on a map any information that contains a postcode; for example, customer records. For basic route planning, Code-Point Open will locate your starting and destination postcode.”"
        },
        {
            "text": "… potential keywords could include ‘postcode’ and ‘route planning’. "
        },
        {
            "text": "I ranked 5,000 such words and phrases based on their popularity in search engines and shared the highest-ranking terms for discussion with publishing bodies. We worked together to refine the list and manage similar and overlapping terms. For example, ‘aerial photography’ from the Environment Agency relates to the same topic as ‘imagery’ from Ordnance Survey. "
        },
        {
            "heading": 2,
            "text": "Signposting authoritative data publishers"
        },
        {
            "text": "Another challenge for new data users is around ‘trust’. Where there are many sources of data on a topic, how do you know which to choose? Ordnance Survey led a project on this subject for the Geospatial Commission last year and created the Authoritative Data Assessment tool for data publishers. By ‘authoritative data’, we mean: "
        },
        {
            "text": "Officially recognised data of appropriate quality provided by trustworthy organisations. "
        },
        {
            "text": "This is often related to the authority, remit or public task of the organisation. It is also related to confidence in the data, for example, the capture, maintenance and quality management processes. The Authoritative Data Assessment tool looks at both aspects to produce a Bronze, Silver or Gold ranking at a dataset level. "
        },
        {
            "text": "In this new tool, the Geospatial Themes and Related Data Publishers we created, we included a column to indicate where an organisation may be considered an ‘Authoritative Provider’ at a theme or topic level. "
        },
        {
            "text": "This can be informative, for example:"
        },
        {
            "text": "The ‘Authoritative Provider’ flag does not imply the organisation is the only provider for a topic, or that the organisation is authoritative in all aspects of a topic. "
        },
        {
            "heading": 2,
            "text": "Where next?"
        },
        {
            "text": "The Data Improvement Programme is just one step in the longer journey towards Mission 2 of the UK’s Geospatial Strategy – Improve access to better location data. The work has highlighted the challenges ahead and given us many valuable lessons which are informing our next steps. "
        },
        {
            "text": "We are working with the Geospatial Commission, its Partner Bodies and the broader data publishing community to tackle the challenges highlighted by the programme, for example:"
        },
        {
            "text": "We hope the list of data publishers by topic will be a useful resource for new data users while we tackle some of these challenges. We welcome feedback from users and from other data publishers who wish to be included."
        },
        {
            "text": "Sign up to this blog to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        },
        {
            "text": " "
        }
    ]
}