{
    "url": "https://environmentagency.blog.gov.uk/2021/08/10/using-dna-to-identify-sources-of-pollution-in-the-environment/",
    "title": "Using DNA to identify sources of pollution in the environment",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-08-10T11:28:27+00:00",
    "content": [
        {
            "text": "By Kerry, Research Scientist, Chief Scientist's Group"
        },
        {
            "text": "Swimming, paddling, boating or just being near water bring a host of benefits to people’s health and wellbeing. But faecal pollution – including from dogs - can pose health risks to water users. Dog poo contains harmful bacteria, viruses and parasites and even if your dog poops on land it can end up in the water after heavy rainfall. So remember to always bag it and bin it – any bin will do!"
        },
        {
            "text": "Science is a vital tool for understanding sources of poo and pathogens in the environment, so the right steps can be taken to improve the health of waters. We’ve developed cutting edge DNA technology to help us understand where the bacteria in water has come from. For example, if the bacteria identified are typically found in cows or sheep, then agriculture is likely to be the source of pollution. Being able to trace the source of poo helps us, in partnership with others, reduce or eliminate the risk of pollution finding its way into water."
        },
        {
            "text": "Analysing poo can also help us trace certain viruses in the environment. During the pandemic, our scientists have been using sewage samples to tell us where COVID-19 outbreaks are emerging, days before they appear in the community. You can find out more about this important work."
        },
        {
            "text": "All animals leave traces of their DNA in the environment in which they live. Analysing the DNA found in water samples is a quick and very effective way of identifying what creatures are in the water. This information can in turn give an indication of the quality of that water. Certain fish and aquatic species are only found in good or poor water quality environments. Identifying the presence, or absence, of these so-called ‘indicator species’ is a really good way of telling if water quality is good or poor."
        },
        {
            "text": "DNA can also tell us when there are creatures in the water that we don’t want to have, otherwise known as invasive species. Find out how DNA technology works from this short, fun video, and read our research report to learn how DNA technology can improve our understanding of ecosystem function."
        },
        {
            "text": "Follow the Environment Agency on Twitter. Be a #WaterWarrior and always bag and bin your dog’s poo – any bin will do."
        }
    ]
}