{
    "url": "https://socialcare.blog.gov.uk/2021/08/26/co-production-isnt-just-for-co-production-week/",
    "title": "Co-production isn’t just for Co-production Week",
    "authors": [
        "Gerard Crofton-Martin"
    ],
    "categories": [
        "Care and support"
    ],
    "pub_date": "2021-08-26T16:19:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is co-production?"
        },
        {
            "text": "When you have a ‘week’ or ‘month’ concentrating on a theme or a campaign, it can really focus minds. But there’s also the danger that, once the week or month has passed, the issue gets sidelined."
        },
        {
            "text": "Co-production Week, which we ran in early July, got a good conversation going. That's why I want to say \"co-production isn’t just for Co-Production Week\"."
        },
        {
            "text": "During the week, we spoke to a care provider who was doing some great co-production, but hadn’t even heard of the term. This is quite common. There are people providing care and support all over the country, but at the same time the people they’re supporting and caring for are having their views heard and jointly making decisions about what’s being provided. Co-production is about working in equal partnership with people, using services, carers, families and citizens."
        },
        {
            "text": "The sixth annual Co-production Week celebrated that fact. But this year seemed different. On the Monday, the campaign suddenly started getting amazing traction on Twitter. Amazing meaning about 150 organisations tweeted about the week. One marker of success is that people didn’t see this as something SCIE had organised: it just exists in its own right, every July. It was like Co-production Week had made it onto the map."
        },
        {
            "heading": 2,
            "text": "Complex issues dealt with"
        },
        {
            "text": "That means many more people want to know about co-production. We held a webinar and workshop and the questions flying around were staggering: for instance, we were asked how co-production is possible when English isn’t someone’s first language. This sort of challenging question told us we were dealing with advanced co-production."
        },
        {
            "text": "The workshop underlined this realisation, as even more members of the social care workforce asked, and often answered, questions about subjects, including the need to build trust before and after a project takes place, so that co-production works properly. The discussions were complex at times, but there were also practical suggestions for the workforce."
        },
        {
            "text": "For several years at SCIE, we’ve been encouraging the use of cards in meetings, which show things like ‘I want to talk’ and ‘Can you explain’, so that participants are fully heard. It was like raising a hand in a Teams of Zoom call well before it became fashionable. Delegates in the workshop thought this was a great idea for making people central to what’s going on in their lives."
        },
        {
            "heading": 2,
            "text": "Different examples of co-production"
        },
        {
            "text": "We heard how co-production can be used to promote anti-racism, from the organisation Migrant Help. We were tweeted by Age Better Sheffield about their new, free co-production toolkit. Meanwhile, our chief executive, Kathryn Smith, took The Pledge to support the full and equal contribution at events from people who draw on or access social care and support."
        },
        {
            "text": "We also ran polls during Co-production Week. Those who took part were more likely to be enthusiastic about co-production happening than not. That’s great news when we’ve had the pandemic to deal with. So, let’s all keep the issues raised in Co-production Week alive."
        }
    ]
}