{
    "url": "https://publicguardian.blog.gov.uk/2021/08/26/creating-an-lpa-frequently-asked-questions/",
    "title": "Creating an LPA - Frequently asked questions",
    "authors": [
        "Laura Crouch"
    ],
    "categories": [
        "Attorneys",
        "FAQs",
        "Future planning",
        "health and welfare",
        "lasting power of attorney",
        "LPA"
    ],
    "pub_date": "2021-08-26T12:00:22+01:00",
    "content": [
        {
            "text": "We receive hundreds of phone calls each week of people looking for help and information on a number of different things, a lot of which are around creating a lasting power of attorney (LPA).  Here are a few of our most frequently asked questions to make your life a little easier when creating an LPA."
        },
        {
            "heading": 3,
            "text": "Q1. How do I apply for a remission or exemption?"
        },
        {
            "text": "A remission or exemption is where you’re able to make an LPA for half the price, or free of charge. You’re able to apply for a remission or exemption if you earn less than £12,000 per year, or are on means-tested benefits."
        },
        {
            "text": "You’ll need to apply at the same time as sending in your LPA application to us. To find out if you’re eligible and find the forms to fill in, visit our website."
        },
        {
            "heading": 3,
            "text": "Q2. Can anyone be an attorney?"
        },
        {
            "text": "Yes as long as the person is over the age of 18 and able to understand the responsibility of becoming an attorney."
        },
        {
            "text": "We suggest, if you’re looking for someone to help with your finances, you choose someone with a good history of managing money. If that person has been declared bankrupt, they won’t be able to act as a property and finance attorney, but can still act as a health and welfare attorney."
        },
        {
            "text": "You should always choose people you trust and it can be anyone such as a friend, neighbour, partner or child."
        },
        {
            "text": "Some people may not want to appoint a friend or family member, you can also appoint a professional, such as a solicitor, to be your attorney, however they will charge you for their time acting on your behalf."
        },
        {
            "heading": 3,
            "text": "Q3. I want to appoint a family member as an attorney, but they live abroad. Can I still appoint them?"
        },
        {
            "text": "In order to create the LPA document all attorneys must sign the LPA in person, in black pen and then have a witness sign the document too."
        },
        {
            "text": "If your attorney lives abroad you’ll need to post the forms to them to sign and have them posted back to you."
        },
        {
            "text": "Once they’ve been signed and registered your attorney can act from anywhere in the world. When appointing your attorneys, make sure you check how you want them to act, especially if one lives in a different country, as it could cause issues later."
        },
        {
            "text": "If you want to know more about delegating tasks and what you need to do as an attorney, you can check out our ‘Things to know as an attorney or deputy podcast’ or blog post."
        },
        {
            "heading": 3,
            "text": "Q4. Who can witness an LPA?"
        },
        {
            "text": "If you’re a donor, the person the LPA is for, your witness must be anyone aged 18 or older, and not a named attorney or replacement attorney."
        },
        {
            "text": "An attorney’s signature must also be witnessed by someone aged 18 or older but can’t be the donor. Attorney’s can witness each other’s signature, and your certificate provider can be a witness for the donor and attorneys."
        },
        {
            "text": "Signatures can’t be witnessed online and must be done in person."
        },
        {
            "heading": 3,
            "text": "Q5. Who can be a certificate provider for my LPA?"
        },
        {
            "text": "A Certificate Provider must be independent of the application, not related to the donor or attorney(s), over the age of 18 and have known you well for at least two years."
        },
        {
            "text": "Their role is to make sure you are able to understand what you are signing and are not being forced into doing it. Ideally they will speak to the donor separately and privately before signing and witnessing the document."
        },
        {
            "text": "You can also ask a professional, someone with the skills to know if you’re able to make the decision on signing an LPA such as:"
        },
        {
            "text": "However, a professional might charge for their time."
        },
        {
            "heading": 3,
            "text": "Q6. What is the order of signing the document?"
        },
        {
            "text": "Put very simply, the order is:\n1. The donor must sign first, followed by the witness\n2. Once they have signed the Certificate provider will sign their section\n3. Attorneys and replacement attorneys sign after which is then witnessed"
        },
        {
            "text": "When filling out an LPA the order of signatures appears in  the document in the order they need signing You can sign it all on the same day if everyone is available."
        },
        {
            "text": "If you’re unable to sign your name, due to an illness or injury , you can make a mark ."
        },
        {
            "text": "If it is an LPA for health and welfare decisions they must also witness you signing section 5, about life-sustaining treatment.  \nThe documents will state where to sign such as:  \nThe certificate provider signs LPA section 10 named ‘Signature: certificate provider’ and all the attorneys and replacement attorneys sign LPA section 11 named ‘Signature: attorney or replacement attorney’. "
        },
        {
            "text": "You can find more detail on the order of signing and how to fill in the LPA on our gov.uk page."
        },
        {
            "heading": 3,
            "text": "Q7. When can my attorneys act for me?"
        },
        {
            "text": "For a health and welfare LPA, your attorney can only act for you once you’ve lost the ability to make your own decisions."
        },
        {
            "text": "For a financial LPA, with your permission as stated in the document, your attorney can step in and help you with decision making before you lose mental capacity."
        },
        {
            "text": "When your attorneys do act on your behalf, they’re bound by the principles of the Mental Capacity Act ."
        },
        {
            "heading": 3,
            "text": "Q8. When should I register my LPA?"
        },
        {
            "text": "As soon as possible. Whether you’re thinking about making one, or have one ready and signed but don’t want to register it yet, just in case, we suggest you send it in."
        },
        {
            "text": "If there are any issues with the applications or any corrections need to be made, we may need to send the application back to you which can delay your registration process."
        },
        {
            "text": "If you wait until the LPA is needed, the person the LPA is for, may no longer have mental capacity to make the changes needed and we won’t be able to process the application."
        },
        {
            "text": "If you’d like more information go online at gov.uk/opg,  you can use our online tool which gives you step by step guidance at each stage of your application. If you have further questions you can contact us at customerservices@publicguardian.gov.uk or call us on 0300 456 0300."
        }
    ]
}