{
    "url": "https://marinescience.blog.gov.uk/2021/08/26/fish-health-inspectorate-protecting-wild-and-farmed-aquatic-animals/",
    "title": "Fish Health Inspectorate: protecting wild and farmed aquatic animals",
    "authors": [
        "Angela Trent"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "Seafood Hazards"
    ],
    "pub_date": "2021-08-26T13:00:18+01:00",
    "content": [
        {
            "text": "Serious diseases pose a threat to aquatic animal health both in aquaculture and in the wild. Many of these diseases have no effective treatment and have the potential to cause high numbers of mortalities in aquatic animals, with the consequent large economic loss and threat to biodiversity. Official control of diseases through policy and legislation is necessary to ensure a sustainable aquaculture industry that meets international standards and ensures safe trade. To be effective, disease controls must use applied science and research to inform Government policy and direct the appropriate legislation. This requires strong links between industry, science, and government. The Fish Health Inspectorate (FHI) at Cefas facilitates these vital connections. The resulting specialist relationships that exist between the FHI and the diagnosticians, epidemiologists, and research scientists at Cefas, and with Government and other agencies, contributes to the high standard of aquatic animal health controls for diseases of national importance, to support sustainable aquaculture and food from water."
        },
        {
            "text": "The UK has a high aquatic animal health status, being free of most of the serious diseases of fish and shellfish that are subject to control (known as listed diseases). The FHI at Cefas is the regulatory body responsible for the official control of these diseases in England and Wales and work hard to maintain this high health status, protecting fish stocks and industry. Their work is delivered on behalf of Defra and Welsh Government through industry authorisation and registration, compliance and disease surveillance inspection programmes, trade controls and disease investigation, and where necessary the application of statutory disease controls and enforcement measures. Collectively, the FHI have extensive experience in the aquaculture industry and related sectors for aquatic animal health and husbandry, regulation and disease control, fieldwork, biosecurity, and policy advice to Government. The FHI operate a paperless inspection, sample and data collection system which provides a large industry dataset extending back over 20 years, an invaluable tool for epidemiological modelling. A close collaborative working relationship between the FHI and Cefas research scientists also supports investigations into new and emerging diseases, an area of growing importance for the expansion of aquaculture to support sustainable food production."
        },
        {
            "text": "You can follow the FHI on Facebook."
        },
        {
            "text": "Policy, Advice & Enforcement "
        },
        {
            "text": "The FHI is responsible for delivery of scientific and policy advice to Defra, the Animal and Plant Health Agency (APHA), overseas Competent Authorities and relevant UK industries. We also ensure aquatic animal health and alien species controls are in line with legislative and policy standards, including implementing the Aquatic Animal Health Regulations and associated legislation to protect the health of aquatic animals in England and Wales, which includes an import sampling programme. We provide expert advice on science and policy to Defra, APHA and the industry. We deliver the responsibilities of the National Focal Point for Aquatic Animals coordinating the UK responses to the World Organisation for Animal Health (OIE).  "
        },
        {
            "text": "Field Team"
        },
        {
            "text": "Fish Health Inspectors spend many hours and days out on the road, carrying out approximately 1,300 inspections annually at a diverse array of sites from fish and shellfish farms to ornamental importers, fishery lakes and rivers, all to deliver the Aquatic Animal Health Regulations and protect the health of aquatic animals in England and Wales.  The team undertake stock health inspections of the 850+ authorised Aquaculture Production Businesses (APBs), such as farms, importers, dealers, purification facilities, as part of an ongoing disease surveillance and sampling programme to monitor for listed diseases in fish and shellfish. The inspection programme also includes compliance audits of APBs to ensure they meet regulations and implement agreed biosecurity practices. Inspectors carry out aquatic animal disease investigations, which may include putting movement restrictions on animals at affected sites. Inspectors also conduct import and export inspections and sampling, at key locations such as ports and airports to facilitate safe trade in live aquatic animals. They also deliver work for the Veterinary Medicines Directorate on residue sampling and licencing audits."
        },
        {
            "text": "Aquatic Trade and Technical Advice Team"
        },
        {
            "text": "Supporting all the activities of the Inspectors is the Aquatic Technical Trade Advice team who also provide advice to industry, UK government, competent authorities and the FHI and deliver essential technical authorisation, licensing and certification duties. Their range of responsibilities is wide and includes live aquatic animal import and export certification and checks, APB authorisations for farms, dealers and purification centres, the registration of recreational fisheries, co-ordination of disease investigations, management of the field inspection schedule and veterinary medicine surveillance sampling plan, and the licensing and permitting of non-native species."
        },
        {
            "text": "By providing guidance and support and essential services they help maintain the health of the fish and shellfish in England and Wales, improve businesses’ ability to trade openly outside the UK, reduce losses from disease and help protect a valuable natural resource."
        },
        {
            "text": " "
        },
        {
            "text": "International focus"
        },
        {
            "text": "In addition, the FHI work internationally including supporting Oman developing their Aquatic Animal Health approaches, working in Ghana on fish disease investigations and on International Wildlife Trade projects in Indonesia, building capacity to prevent illegal trade in shark and shark products. You can find out more about the work in Indonesia in another Cefas blog. "
        },
        {
            "text": "Case study: illegal wildlife trade"
        },
        {
            "text": "The FHI has an ongoing programme to tackle illegal activity as demonstrated when they played a critical role in the uncovering and subsequent prosecution of a seafood trader who had smuggled around 5.3 million critically endangered European eels from Spain, through the UK and on to East Asia over a 2 year period. The 3-year investigation saw the FHI working closely with the UK Border Force and National Crime Agency (NCA), which led to the conviction. Illegally traded eels were recovered and then repatriated back into the wild in Spain."
        }
    ]
}