{
    "url": "https://ukhsa.blog.gov.uk/2021/08/26/five-reasons-to-get-the-covid-19-vaccine-if-youre-pregnant/",
    "title": "Five reasons to get the COVID-19 vaccine if you're pregnant",
    "authors": [
        "Julie Yates"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-08-26T09:38:47+01:00",
    "content": [
        {
            "text": "The COVID-19 vaccine is available to pregnant women at any point during their pregnancy. To date at least 62,000 women in the UK have received at least one dose. If you’re expecting, here are five key reasons why you should get the jab."
        },
        {
            "text": "1) Getting two doses is the best way to protect yourself from COVID-19 "
        },
        {
            "text": "If you’re pregnant, getting both doses of your vaccine is the best way to protect yourself – and those around you – against COVID-19. Although the overall risk from COVID-19 for pregnant women and their unborn babies is low, some women may become seriously unwell and need hospital treatment in later pregnancy. The vast majority of pregnant women who become seriously ill with COVID-19 are unvaccinated."
        },
        {
            "text": "2) COVID-19 disease can be serious in pregnancy "
        },
        {
            "text": "While overall the risk remains low, pregnant women with COVID-19 have a higher risk of intensive care admission than women of the same age who are not pregnant. Women with COVID-19 disease are also 2 to 3 times more likely to have their babies early than women without COVID-19. Pregnant women with underlying clinical conditions are at even higher risk of suffering serious complications from COVID-19."
        },
        {
            "text": "3) The COVID-19 vaccines used in the UK are safe and effective for pregnant women"
        },
        {
            "text": "The Joint Committee on Vaccination and Immunisation (JCVI), which advised the UK government that pregnant women should be offered the vaccines, looks at all the available evidence on the safety and effectiveness of the vaccines before making recommendations about who should have them."
        },
        {
            "text": "The Pfizer-BioNTech and Moderna vaccines are recommended for pregnant women in the UK because these vaccines have been given to over 140,000 pregnant women in the US and the data has not raised any safety concerns. At least 62,000 thousand pregnant women in the UK have had at least one dose of the vaccine, also without any immediate safety concerns."
        },
        {
            "text": "Pregnant women who have already had the AstraZeneca vaccine however are advised to complete with the same vaccine. If you have any questions or concerns, please don’t hesitate to discuss these with a healthcare professional looking after you in your pregnancy."
        },
        {
            "text": "4) The vaccines might offer your unborn child some protection against COVID-19"
        },
        {
            "text": "Research suggests that protective antibodies in response to the vaccines can be passed from mother to newborn during pregnancy and through breast milk after birth. While it’s likely these would help protect newborns from COVID-19, more research is needed to determine how much protection these antibodies would give or how long that protection would last."
        },
        {
            "text": "5) There is no current evidence of any serious side effects for pregnant women"
        },
        {
            "text": "The Medicines and Healthcare Regulatory Agency (MHRA) thoroughly monitors any suspected side effects involving pregnancy and COVID-19 vaccination."
        },
        {
            "text": "The current evidence does not show an increased risk of miscarriage or stillbirth following vaccination against COVID-19. There is also no pattern from the reports to suggest that any of the COVID-19 vaccines used in the UK increase the risk of congenital anomalies or birth complications."
        },
        {
            "text": "The vaccines do not contain living organisms that can multiply in the body, so they cannot infect an unborn baby in the womb."
        },
        {
            "text": " For further advice, speak to a healthcare professional looking after you in your pregnancy."
        },
        {
            "text": "You can also find more information below:"
        },
        {
            "text": " "
        }
    ]
}