{
    "url": "https://videosurveillance.blog.gov.uk/2021/08/26/government-launches-consultation-on-proposed-revisions-to-the-surveillance-camera-code-of-practice/",
    "title": "Government launches consultation on proposed revisions to the Surveillance Camera Code of Practice",
    "authors": [
        "katiescotton"
    ],
    "categories": [
        "ANPR",
        "Biometrics and Surveillance Camera Commissioner",
        "Body worn video",
        "CCTV",
        "Drones",
        "Facial Recognition Technology",
        "Local authorities",
        "Policing",
        "Surveillance camera code of practice",
        "Surveillance cameras"
    ],
    "pub_date": "2021-08-26T22:41:40+01:00",
    "content": [
        {
            "text": "The government has launched a consultation on proposed alterations to the Surveillance Camera Code of Practice. This is the first revision to the Code since its introduction in June 2013."
        },
        {
            "text": "The Code, issued under section 30 of the Protection of Freedoms Act 2012 (PoFA), provides guidance on the appropriate use of surveillance camera systems by relevant authorities (generally local authorities and the police) in England and Wales, who have a legal duty to pay regard to the principles of the Code when operating overt surveillance camera systems in public places. All other operators of surveillance camera systems are encouraged to adopt the principles of the Code on a voluntary basis."
        },
        {
            "text": "The proposed draft updates reference to subsequent legislation, in particular Data Protection legislation, and the Bridges v South Wales Police Court of Appeal judgment. There is also some rationalising of the text to make it easier for the user to follow. The amended code does not place any additional burden on those authorities who should have regard to it, and the list of relevant authorities defined under section 33(5) PoFA is not being extended at present. Subject to the comments received, the government’s intention is to lay the draft code before parliament in late autumn."
        },
        {
            "text": "The Biometrics and Surveillance Camera Commissioner's responsibilities under section 34(2) PoFA are to encourage compliance with the Code, review the operation of the Code, and provide advice about the Code (including changes to it or breaches of it). As a statutory consultee, the Commissioner has been invited by the Home Office to make formal comments on the proposed revisions to the Code, which will be submitted and made available on his website shortly."
        },
        {
            "text": "The Commissioner would like to encourage contributions to this consultation from a wide range of stakeholders. For more information about the consultation, including further details of the proposed changes, please visit his website at Surveillance camera code of practice - GOV.UK (www.gov.uk)."
        },
        {
            "text": "The consultation closes on 8 September. All responses should be sent to our office at scc@sccommisisoner.gov.uk"
        }
    ]
}