{
    "url": "https://civilservice.blog.gov.uk/2021/08/26/government-grand-designs/",
    "title": "Government Grand Designs",
    "authors": [
        "Dr Janet Young, interim DG, Government Property"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-08-26T08:24:46+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Managing the UK's biggest property portfolio of 300,000 public buildings is undeniably a tall order. Now the Civil Service has launched the Government School of Property to help staff deliver the best possible public services."
        },
        {
            "text": "Government property is a brilliant place to work. Members of our profession work on the UK’s biggest, most diverse property portfolio spanning every public building from historic government buildings, to hospitals, art galleries, nuclear power plants, embassies, job centres, and many thousands more. "
        },
        {
            "text": "It is our job to make sure these 300,000 public buildings across the UK are managed, maintained, and designed in a way which allows the best support possible for the services being provided there. And with Civil Service modernisation and reform accelerated by the pandemic, there has never been a more exciting time to work in government property. "
        },
        {
            "text": "Our professionals - comprising engineers, surveyors, asset managers, facilities managers, and many more besides - make daily decisions that have a huge impact on citizens through the location, design and management of the built environment and public realm. "
        },
        {
            "text": "As interim Director General of Government Property, my role is to ensure our people – an over 5,000-strong network of property professionals – have the capabilities and skills to deliver the priorities at the top of our agenda."
        },
        {
            "text": "That’s why I am so delighted we have been able to introduce our new, flagship, learning and development offer - the Government School of Property. "
        },
        {
            "text": "Government School of Property"
        },
        {
            "text": "The Government School of Property brings together all of the existing Government Property Profession learning options into one place, so you can easily find the right development option for you. Built around four core learning products, the Government School of Property will be the flagship development offer for every Government Property Professional. "
        },
        {
            "text": "The Government School of Property will become part of the Government Campus, which promotes a culture of learning and development to improve the skills and capabilities of civil servants. "
        },
        {
            "text": "We have to make sure our people are well-placed to deliver the transformation we will need to manage and run a modern public estate. This means understanding whole-life asset management and making every property decision with sustainability considerations front and centre."
        },
        {
            "text": "It also means a relentless focus on asset management strategy and releasing property that is no longer needed. "
        },
        {
            "text": "Disposing of surplus or unwanted government property and land can help boost local economic growth, release land for housing, cut running costs and create the local prosperity we need to help the economy recover from the pandemic."
        },
        {
            "text": "It is building capability in these areas and more which has driven us to create this new service, which will help every Government Property Professional find the development options right for them, their careers, and the work of their departments."
        }
    ]
}