{
    "url": "https://phescreening.blog.gov.uk/2021/08/26/nipe-screening-team-celebrates-full-roll-out-of-smart4nipe-s4n-it-system-and-national-standards/",
    "title": "NIPE screening team celebrates full roll out of SMaRT4NIPE (S4N) IT system and national standards",
    "authors": [
        "Jill Walker"
    ],
    "categories": [
        "NHS Newborn and Infant Physical Examination"
    ],
    "pub_date": "2021-08-26T11:15:53+01:00",
    "content": [
        {
            "text": "The SMaRT4NIPE (S4N) IT system has now been fully rolled out across the NHS Newborn and Infant Physical Examination (NIPE) Screening Programme in England."
        },
        {
            "text": "We started with just 17 Trusts using S4N in April 2014. Now all 136 Trusts are ‘live’, as Sandwell and West Birmingham NHS Trust was the last service to implement the system on 1 June 2021."
        },
        {
            "heading": 2,
            "text": "S4N system"
        },
        {
            "text": "The S4N system:"
        },
        {
            "text": "The full roll out means that, if the system is used correctly and all data is entered in line with national guidance, all newborn babies can be tracked along the screening and referral pathway. This includes if they are born in or move to or from other maternity providers within England, providing a robust failsafe process."
        },
        {
            "text": "So, we’re very pleased that the system is now used nationally."
        },
        {
            "text": "We have also started implementing S4N in children’s hospitals to ensure newborn babies who require specialist care can still be tracked and followed up. It’s already used in Sheffield and Birmingham, and we hope further hospitals will follow soon."
        },
        {
            "heading": 2,
            "text": "New national NIPE standards"
        },
        {
            "text": "We’re also looking back at our other achievements from the last year."
        },
        {
            "text": "The new and amended NIPE national standards were published on 1 April 2021. Launching these involved a considerable amount of planning and preparation work from the NIPE screening team at PHE, including:"
        },
        {
            "text": "This work involved extensive stakeholder engagement, including with users of S4N, SQAS, commissioners and expert clinicians, such as NIPE practitioners, neonatologists, paediatricians, orthopaedic surgeons and professional bodies."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "These achievements are, in my view, testament to the many hours of hard work, solid commitment and attention to detail of the NIPE screening team, our stakeholders and other PHE colleagues. It is thanks to you all that we have achieved national coverage of S4N."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}