{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/08/23/innovation-quality-transparency-a-compliance-team-1-perspective/",
    "title": "Innovation, Quality & Transparency – a Compliance Team 1 Perspective",
    "authors": [
        "amirahhussain"
    ],
    "categories": [
        "Compliance matters"
    ],
    "pub_date": "2022-08-23T13:39:09+01:00",
    "content": [
        {
            "text": "There has been much discussion of late between regulators and industry on how we can ensure that patients and the public get new medicines as quickly as possible - all the way from development to regulatory approval - while still ensuring they are safe, effective and of the required quality."
        },
        {
            "text": "There has also been a focus on innovation, and where the traditional ‘Quality’ activities and professionals fit within this space.  Jason and I have been continuing this conversation within the MHRA following recent global conferences focused on the clinical/ GCP side of things. This blog relays some of our reflections."
        },
        {
            "text": "Traditional Quality Assurance has had a long-standing approach of planning an annual audit schedule across the product lifecycle to ensure regulatory compliance.  Just as inspections are a part of our regulator’s toolkit, audits are a tool in a sponsor’s toolkit; both are a snapshot in time of the things that were reviewed, and issues noted at that point."
        },
        {
            "text": "While this still of course adds quality value, moving forwards, quality professionals are the enablers of product development from the outset, and have a key role to play within organisations aiming to innovate.  The quality function cannot do this alone however, it can only work effectively with a full team approach across the organisation, with quality built in from the start.  This includes working across pre-clinical, clinical, regulatory, post-authorisation, strategy and policy groups to enable a joined-up approach, with patients at the centre of risk assessments and the resulting decisions made."
        },
        {
            "text": "There has been much focus on transparency, both from regulators and also between regulators and industry, which ties in directly to the risk-based approach that the MHRA has been championing since 2011.  Uptake in the right direction, with industry and academia reviewing how they can be as transparent as possible with regulators on their risk assessments for trials; what the most important risks are, how they are mitigated, and what the issues were.  Some have already moved to submitting this information directly either through marketing authorisation applications internationally, or through our Innovative Licensing & Access Pathway (ILAP) in the UK:  Future updates to the Medicines for Human Use (Clinical Trials) Regulations and look to push risk adaptation into the forefront of planning and managing clinical trials. This can only be a good thing."
        },
        {
            "text": "We are in the early stages of seeing this type of activity, but from the MHRA perspective - quality input built into these risk assessments and transparent release of this detail to regulators is exactly what is required to support innovation.  As trial designs become more complex and we see an increasing level of decentralised ways-of-working, issues are bound to occur – we should embrace these setbacks and learn from them for the good of public health.  Innovation will never come without some risks; the challenge is to ensure those risks are managed and mitigated to ensure they do not become too large or irreversible where this is possible; but where it is not then we need to be looking for where issues may arise and be ready to act."
        },
        {
            "text": "We now have our Innovation Accelerator at the MHRA where the more traditional regulatory or scientific advice can be sought from the outset, or indeed a longer-term target development pathway set up with a roadmap through the regulatory network as part of ILAP: Innovation Accelerator - GOV.UK (www.gov.uk)."
        },
        {
            "text": "We would encourage you to take these opportunities to risk adapt where appropriate, to risk assess, manage the risks and transparently discuss them.  We have heard from patient representatives recently that ‘time is life’ and that we need to move to ‘how soon can we make this available to my child to improve their quality of life’ when we think about getting new medicines to patients in need.  We are all working towards that same goal. Working across boundaries to reach that aim is an exciting prospect."
        },
        {
            "text": "Paula Walker, Head of Compliance (1), GCP/GPvP/GLP & GxP Expert Circle"
        },
        {
            "text": "Jason Wakelin-Smith, Expert GCP Inspector & Head of GxP Expert Circle"
        }
    ]
}