{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/08/23/stem-challenge-2022-review/",
    "title": "STEM Challenge 2022 Review",
    "authors": [
        "Zoe Constable"
    ],
    "categories": [
        "Guest Blog",
        "Latest Stories",
        "Our People & Deep Dives",
        "Outreach",
        "Talent & Leadership"
    ],
    "pub_date": "2022-08-23T14:54:42+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Background"
        },
        {
            "text": "The STEM Challenge was an outreach competition run by Science & Engineering Fast Streamers for UK schools, with the aim to encourage students to consider Science, Technology, Engineering & Maths (STEM) careers or education in the future. We also used it as an opportunity to explain what the Civil Service does, some of the STEM work being done in the government, and some of the key issues we face as policymakers."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Challenge"
        },
        {
            "text": "Students were given three ‘problem statements’ - real issues facing scientists and policymakers today - on their vision for ‘A Carbon Neutral Day in 2050’. These included ‘Sustainable Transport’, ‘Sustainable Food Production’ and ‘Humans in Space’."
        },
        {
            "text": "They were asked to present their three top solutions to one of the problem statements, considering how realistic their options were, the budget and resources they might require, and any risks or opportunities."
        },
        {
            "text": "We received some really interesting responses, and it was clear the students actively engaged with the problems, both creatively and with a scientific approach. We really enjoyed hearing their ideas, which were varied and considered, and ranged from genetic modification to hyperloops!"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Judging the Challenge"
        },
        {
            "text": "The entries were judged by civil servants, many with STEM-backgrounds, who volunteered their time to rate each entry based on established criteria."
        },
        {
            "text": "We are grateful for the hard work and effort that each student put into this project. There was close competition for the top three places, with some very worthy winners. All participants received a certificate marking their involvement, and we hope the skills they have developed during the Challenge will help them with further STEM education."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "And the winner is…"
        },
        {
            "text": "Team 1 from Callington Community College in Cornwall!"
        },
        {
            "text": "A big congratulations also to teams 10 and 11 from Louth Academy who came in second and third place respectively!"
        },
        {
            "text": "The winning teams received a signed certificate from the Chief Scientific Advisor, Sir Patrick Vallance, and vouchers to spend at Amazon, funded by the Society for Experimental Biology."
        },
        {
            "text": "We visited Louth Academy on 5 July 2022 to hear the students explain their solutions and to present the second and third prizes to the teams. We will be running a session with the winning team at Collington Academy to present the first-place prize."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Acknowledgements"
        },
        {
            "text": "We would love to thank the schools who took part, particularly the science teachers who supported their students and helped us to organise the competition."
        },
        {
            "text": "We would like to express our gratitude to all the judges for volunteering their time and STEM expertise to judge the challenges; it was important to us that the students would be heard by the people who work on the issues."
        },
        {
            "text": "We were immensely privileged to have the backing and support of Sir Patrick Vallance and the learned societies, who gave us the opportunity to provide exciting prizes for the winners"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "We would also like to thank Gideon Henderson, DEFRA Chief Scientific Adviser, for talking to students and answering their questions on government science and technology. We also want to thank Trudy Harrison MP and Joanna Bird from the UK Space Agency for producing videos for the launch event and talking about the work their organisations are doing in STEM."
        },
        {
            "text": "We are grateful for all the support that the STEM Challenge received – including but not limited to the Fast Stream, Chief Scientific Advisors, Civil Service Outreach and Government Office for Science. The help and resources that they provided made this such a valuable experience for so many students."
        },
        {
            "text": "Last but not least, we would like to say a big thank you to the students who took part; they rose to the challenge and should be proud of what they’ve accomplished. Their hard work and intellect really shone through, and we hope the transferable skills they developed from this will serve them well in the future."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "We are working closely with learned societies to offer future interactive sessions with schools later in the year. We hope this collaboration will enable us to provide more engagement with schools next year.  We hope to run the challenge again next year with even more teams from even more schools."
        },
        {
            "text": "If you would like your school to take part in the Challenge next year, please complete this form."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}