{
    "url": "https://prisonjobs.blog.gov.uk/2022/08/23/working-with-offenders/",
    "title": "Working with offenders",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "PQiP",
        "Probation"
    ],
    "pub_date": "2022-08-23T17:13:31+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Thinking about becoming a probation officer but want to know more about what it’s like working with offenders? Bethan takes us along her journey as she describes how the trainee probation programme (PQiP) prepared her to work with offenders and what her day-to-day looks like. "
        },
        {
            "text": "What is involved in the role in terms of working with offenders? "
        },
        {
            "text": "As a probation officer, I have daily contact with the caseload I work with. This can be completing supervision sessions, looking at specific risk reduction/ offence focused work, as well as completing referrals to services or interviewing for reports I need to complete."
        },
        {
            "text": "Completing reports and assessments is a significant part of the job. Working to the deadlines for these reports means that I need to organise my time accordingly. Linking in with others who are working with the Person on Probation is an important part of the role, ensuring the person is complying with the requirements of their licence/ community order and addressing their risk factors."
        },
        {
            "text": "Please can you tell us about the enforcement aspect of the role? What forms this can take and how you approach it "
        },
        {
            "text": "Protecting the public is at the heart of what we do and forms a big part of the role, therefore, timely and appropriate enforcement of any breaches or non-compliance is vital. This can be in a variety of different forms, including compiling breach reports for court, sending out warning letters, setting out behavioural contracts, looking at alternatives to recall to custody such as directing someone to reside in an Approved Premises and completing recall reports if the risk is not manageable in the community."
        },
        {
            "text": "In custody, I am involved in communication monitoring, ensuring people are not breaching condition such as Restraining Orders, and managing the consequences if they do. This involves reporting breaches to the police for investigation. Challenging any breaches of rules is vital, as well as outlining the expectations and consequences of non-compliance at the earliest stage."
        },
        {
            "text": "How often do you meet/engage with offenders as part of your role? "
        },
        {
            "text": "I am in pretty much daily contact with people on my caseload. The frequency of the contact with individuals is determined based on their risk and need. In the early stages following release, contact could be regular so I could provide support to help someone resettle back into community life. This included completing home visits and I would sometimes go along to external appointments, such as required appointments with the drug service."
        },
        {
            "text": "Completing necessary assessments and reports is a big part of the job, so I will have admin days devoted to this. I will however often be taking calls, responding to applications and having phone contact with people during this time."
        },
        {
            "text": "What risk management is in place? (I think this question could do with rewording a bit to be honest, even if it is just – what examples of risk management are in place for offenders?) "
        },
        {
            "text": "The assessments that we complete focus on assessing and identifying a person’s risk factors and looking at what strategies need to be in place to manage this risk. The risk management plans in place can include external controls such as curfews, GPS monitoring and enforceable appointments to address risk factors such as alcohol misuse. We also work closely with partner agencies such as the police, helping to ensure compliance on external controls, like sexual harm prevention orders."
        },
        {
            "text": "How we manage someone’s risk is also dependent on the reason they are with us. If someone is out on licence after serving a custodial sentence, they will be subject to licence conditions and chosen to manage the identified risk factors, being proportionate to their assessed level of risk. If someone is on a community order, whilst the risk factors may be similar, the conditions of this order will differ and change how we manage the risk."
        },
        {
            "text": "How was your experience of your first time working with offenders? "
        },
        {
            "text": "My first experience of working with a Person on Probation when I started PQiP was completing an induction appointment with someone who had just left prison. There was a lot of paperwork to complete, but it helped me to structure the appointment. The Person on Probation was keen to go home as soon as possible as he came to the office straight from prison, so I had to be boundaried and firm in order to cover all the relevant information with him."
        },
        {
            "text": "Do you have any particular success stories? Individuals who really benefited/changed their lifestyle as part of your work "
        },
        {
            "text": "I have recently worked with a person in custody during their last year in prison before they were released on licence. By the time they had come on to my caseload, it was clear they had used their time in prison wisely and had taken a lot from completing an accredited programme at a previous prison."
        },
        {
            "text": "This person spoke of a desire to give back and help others who were in a similar situation to him before he came to prison. He had assumed that due to his criminal record, which included various violent offences, that he would never be able to achieve his goal."
        },
        {
            "text": "I was able to refer him to a peer support programme, where he was able to train and achieve a qualification in peer mentoring whilst in custody. The charity that ran this course continued to work with him on release and he is now volunteering for them, alongside working. His long-term aim is to become a youth support worker and it was really rewarding to see him realise this was not out of his reach and he could achieve this goal."
        },
        {
            "text": "All in all, as Sam puts it “no two days are the same.” As a probation officer, you will get to utilise lots of different skills to communicate with lots of different people on a daily basis."
        },
        {
            "text": " "
        }
    ]
}