{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/18/coverage-of-our-strategy-for-modern-and-secure-elections/",
    "title": "Coverage of our strategy for modern and secure elections",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2025-07-18T16:16:16+01:00",
    "content": [
        {
            "text": "Following the publication of our strategy for modern and secure elections yesterday, there has been widespread national coverage.  "
        },
        {
            "text": "Today’s newspapers report prominently on the confirmation that 16 and 17-year-olds will be given the right to vote in the next general election. The story splashed on the front page of the I paper, the Daily Telegraph, Metro and the Daily Express, and was reported in the Times, Financial Times, Daily Mail, Daily Telegraph, the Sun and the Independent.  "
        },
        {
            "text": "The reforms alsoreceived prominent coverage yesterday’s broadcast bulletins - with many running their own news packages on the announcement on the evening’s news programmes, including BBC News and Sky News. "
        },
        {
            "text": "The Daily Mirror supported the change on their front page, outlining that reforms will add over a million more people to the electorate and featured positive comments from opposition parties. The Mirror further ran an opinion piece online by Darren Hughes, chief executive of the Electoral Reform Society, who said the change ‘will correct a gross unfairness and boost democracy'. BBC News also reported on positive comments made by the Children’s Commissioner, who said that \"lowering the voting age to 16 sends the message that their voices and ideas do matter”."
        },
        {
            "text": "Elsewhere, the Guardian’s front page reports on votes at 16, as well as outlining other changes within the strategy - including extending voter ID and tougher new rules to guard against foreign political interference and abuse of candidates. The Guardian further carry an opinion piece online, which argues that ‘nothing bad happens when the voting age is lowered to 16’, and can lead to a stronger democracy.  "
        },
        {
            "text": "There has been some inaccurate coverage of the reforms, with the Telegraph reporting on comments made by former Home Secretary James Cleverly, who said that votes at 16 was ‘dropped from the King’s Speech’. This is not the case, as yesterday saw the publication of a strategy paper, and not the Bill itself, this would not have been in the King’s Speech.  "
        },
        {
            "text": "Across the coverage, quotes from the Deputy Prime Minister and Minister for Democracy are carried.   "
        },
        {
            "text": "Deputy Prime Minister, Angela Rayner said:    "
        },
        {
            "text": "“For too long public trust in our democracy has been damaged and faith in our institutions has been allowed to decline.        "
        },
        {
            "text": "“We are taking action to break down barriers to participation that will ensure more people have the opportunity to engage in UK democracy, supporting our Plan for Change, and delivering on our manifesto commitment to give sixteen year olds the right to vote."
        },
        {
            "text": "“We cannot take our democracy for granted, and by protecting our elections from abuse and boosting participation we will strengthen the foundations of our society for the future.”       "
        },
        {
            "text": "Minister for Democracy, Rushanara Ali, said:     "
        },
        {
            "text": "“We are modernising our democracy, so that it is fit for the 21st century. By delivering our manifesto commitment to extend the vote to 16 and 17 year olds, we are taking a generational step forward in restoring public trust and boosting engagement in UK democracy, supporting our Plan for Change.  "
        },
        {
            "text": "“By reinforcing safeguards against foreign interference, we will strengthen our democratic institutions and protect them for future generations.”      "
        }
    ]
}