{
    "url": "https://nationalscreening.blog.gov.uk/2025/07/18/feedback-invited-on-uk-nscs-work-on-additional-breast-screening-for-women-with-dense-breasts/",
    "title": "Feedback invited on UK NSC’s work on additional breast screening for women with dense breasts",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "Breast Screening"
    ],
    "pub_date": "2025-07-18T09:17:32+01:00",
    "content": [
        {
            "text": "As we blogged recently, the UK National Screening Committee (UK NSC) has been reviewing evidence relating to the provision of additional breast screening for women who have dense breast tissue."
        },
        {
            "text": "About 10% of women have very dense tissue in their breasts, and up to 50% have some dense tissue. Dense tissue shows as white or opaque on mammogram images, which makes it harder to see a tumour. "
        },
        {
            "text": "We are now offering stakeholders the chance to provide feedback on 3 systematic reviews we commissioned via the National Institute for Health Research (NIHR). "
        },
        {
            "text": "Stakeholder feedback will help inform a future consultation on a formal recommendation to modify the breast screening programme."
        },
        {
            "text": "We are particularly interested in hearing your views on:"
        },
        {
            "text": "We would also be interested to hear about any other important questions which may not have been considered in the reviews, but which may help the UK NSC in its ongoing work in this area."
        },
        {
            "text": "In the meantime, the UK NSC Secretariat will work to commission a cost effectiveness evaluation to explore the clinical and cost effectiveness of different pathways using breast density in the screening pathway."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}