{
    "url": "https://naturalengland.blog.gov.uk/2025/07/18/nature-towns-and-cities-programme-transforming-urban-landscapes-for-people-and-planet/",
    "title": "Nature Towns and Cities Programme: Transforming Urban Landscapes for People and Planet ",
    "authors": [
        "Oliver Harmar"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Green Infrastructure",
        "Growth",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Nature-based solutions"
    ],
    "pub_date": "2025-07-18T16:00:16+01:00",
    "content": [
        {
            "text": "By Oliver Harmar, Chief Strategy Officer"
        },
        {
            "heading": 4,
            "text": "Creating a Legacy of Thriving Urban Nature "
        },
        {
            "text": "With today’s start of the Nature Towns and Cities programme, I'm filled with optimism.  This isn’t just another initiative, it’s a game-changer for how we think about nature in our towns and cities.  "
        },
        {
            "text": "Over 85% of us live in urban areas, and that number is climbing. Yet too many communities still aren’t able to access or fully benefit from green and blue spaces. The sad truth is, many people have lost that vital connection with nature, especially in our towns and cities where it's needed more than ever.  "
        },
        {
            "heading": 4,
            "text": "£15.5 million plants seed of change across 40 towns and cities "
        },
        {
            "text": "This new programme is the first of its kind, launched through a partnership between Natural England, National Trust and The National Lottery Heritage Fund. It aims to help at least 100 places across the UK to become greener, healthier, happier places for people to live and work."
        },
        {
            "text": "Check out the successful grants here. "
        },
        {
            "text": "This vital funding from The National Lottery Heritage Fund means local councils and communities can partner together on some very exciting projects. This includes Bradford's groundbreaking research into how green spaces boost our wellbeing, Bristol's clever community-led Greening Permit scheme, and so much more."
        },
        {
            "text": "These brilliant initiatives will create bustling wildlife corridors, flourishing community gardens, nature-based health hubs, and fantastic education programmes that'll make a real difference to millions of people's lives."
        },
        {
            "text": "It's all about equipping communities with the tools and connections to build thriving neighbourhoods – places that are fantastic to live in now and far more resilient for future generations."
        },
        {
            "heading": 4,
            "text": "Why this really matters"
        },
        {
            "text": "Nature Towns and Cities sits right at the heart of our new strategy, \"Recovering Nature for Growth, Health and Security.” Connection with nature isn't just nice to have, it genuinely improves our mental and physical health. "
        },
        {
            "text": "We're talking about seeing nature as part of our healthcare and wellbeing and boosting local economies. When we support urban transformation like this, we're investing in preventative healthcare where most of us live. "
        },
        {
            "heading": 4,
            "text": "By 2035, we've got some pretty ambitious goals"
        },
        {
            "text": "We want to: "
        },
        {
            "heading": 4,
            "text": "Celebrating our first Nature Towns and Cities "
        },
        {
            "text": "We're at a turning point for nature recovery in the UK and Natural England is proud to have led on the development of the Nature Towns and Cities Accreditation. Today, we’re also announcing the UK's first accredited Nature Cities.  "
        },
        {
            "text": "Birmingham has earned Nature City status for its ambitious 25-year plan, focusing on communities with the least access to green space. They're creating up to 400 new green spaces, including pocket parks designed with local communities. Click here to find out more."
        },
        {
            "text": "Bournemouth, Christchurch, and Poole have collectively become official Nature Towns, recognising their commitment to bringing nature's benefits to all residents through innovative multi-functional green spaces that serve as community hubs. "
        },
        {
            "text": "Both places will receive ongoing support from the Nature Towns and Cities partnership. Click here to find out more."
        },
        {
            "heading": 4,
            "text": "We're here to help you succeed"
        },
        {
            "text": "Natural England’s Green Infrastructure Framework provides practical tools, mapping data and guidance to help bring this vision to life. We've recently made the website much more user-friendly based on your feedback. Let us know what you think by completing our 10-minute user feedback survey. "
        },
        {
            "text": "Nature Towns and Cities sits at the heart of our vision that \"people and nature thrive together.\" Urban greening isn't a luxury – it's essential infrastructure. It cleans our air, protects us from heat and flooding, restores nature, and improves lives. That's a win-win-win. This is just the beginning. Together, we hope to build a legacy that will benefit people for decades to come. "
        }
    ]
}