{
    "url": "https://space.blog.gov.uk/2025/07/18/uk-space-agency-catalysed-2-2-billion-investment-in-2024-25/",
    "title": "UK Space Agency catalysed £2.2 billion investment in 2024/25 ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Business",
        "Catalysing Investment"
    ],
    "pub_date": "2025-07-18T12:37:08+01:00",
    "content": [
        {
            "text": "The UK Space Agency’s Annual Report and Accounts, published this week, contains an important update on our work to catalyse investment into the UK’s growing space sector.  "
        },
        {
            "text": "In 2024/25, our activity generated £2.2 billion in investment and revenue, from the £581 million we distributed to the space sector. "
        },
        {
            "text": "The Agency's North Star Metric was introduced in 2022 to quantify the investment and revenue catalysed by our activities within the UK space sector. This demonstrates the wider impact of how we spend our money. "
        },
        {
            "text": "This positive result reflects an increasingly focused approach to supporting the space economy across the UK. Our Space Clusters Infrastructure Fund alone has catalysed over £700 million in projected private investment, with £30 million raised in follow-up funding. These regional investments are expected to generate between £0.5 billion and £1 billion in revenue over the next decade, reinforcing the space sector's role as a key economic driver. "
        },
        {
            "text": "Supporting entrepreneurship and business growth is central to our strategy. The UK Space Agency Accelerator, now in its fifth year, has supported 158 businesses in raising £15 million in both private and grant funding. These companies have created jobs and driven innovation in a sector traditionally dominated by larger firms. Additionally, the Fusion: Connect with Capital programme has already enabled 12 early-stage companies to raise £2.7 million in investment funding. Following the success of these programmes, we recently launched Shuttle to support revenue-generating UK SMEs. "
        },
        {
            "text": "Another great example is our partnership with Space North, which brings together more than 280 space-related organisations across Yorkshire, the North East, and North West. With £500,000 invested in 2024, this partnership is positioning itself as a hub for cutting-edge research and development in secure space communications, driving both regional growth and international recognition. "
        },
        {
            "text": "Financial discipline underpins all our achievements, and we met our ambitious financial management targets for the second consecutive year. Notable successes include securing an additional €134 million in contracts for the UK space sector from the European Space Agency (ESA), while maintaining budget forecasts within target. "
        },
        {
            "text": "Beyond the headline investment figures, we’ve been working hard to deliver tangible technological advances that position the UK at the forefront of space innovation. The National Space Propulsion Test Facility, fully booked since opening in 2021, actively supported the Firefly Blue Ghost mission, which launched in January and landed successfully on the Moon in March, this year. The main engine for the lander was designed, built, and tested at this facility by Nammo UK. "
        },
        {
            "text": "We are also committed to making the UK Space Agency a great place to work. Employee engagement reached new heights, rising by 10 percentage points over three years to 71% in 2024, now standing 7 percentage points above the Civil Service average."
        },
        {
            "text": "As the Agency prepares for the next phase of delivery, we have built strong foundations on which to support the future growth of the UK space sector, deliver significant returns on public investment, and drive forward the government’s high ambitions for space."
        }
    ]
}