{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/11/17/driving-better-road-fuel-prices-for-consumers/",
    "title": "Driving better road fuel prices for consumers",
    "authors": [
        "Daniel Turnbull"
    ],
    "categories": [
        "Markets"
    ],
    "pub_date": "2025-11-17T12:00:33+00:00",
    "content": [
        {
            "text": "In our 2023 road fuel market study we found that competition in the UK road fuel market was not working as well as it should be, and that, by making it easier for drivers to compare up-to-date prices, they could more easily find the cheapest prices in their area, and retailers would have to compete harder for their business."
        },
        {
            "text": "To achieve this, we recommended to government that it should introduce a statutory open-data fuel finder scheme, to give drivers access to live fuel prices at forecourts. The government accepted our recommendation and is implementing ‘Fuel Finder’. From early next year, drivers will benefit from access to near-real time pricing data through third-party apps, sat navs and other tools signed up to Fuel Finder."
        },
        {
            "text": "The government has given the Competition and Markets Authority (CMA) the role of enforcing compliance with Fuel Finder. We will decide whether the Fuel Finder requirements have been breached and if so, we will take action to tackle these breaches – this includes fines. "
        },
        {
            "text": "We are committed to taking effective and proportionate enforcement action to enable consumers across the UK to shop with confidence and find the best deal for them, and to reinvigorate price competition in the UK road fuel market. "
        },
        {
            "text": "In October, we consulted on draft guidance setting out how we would enforce compliance with Fuel Finder. We are now finalising the guidance for publication in December. "
        },
        {
            "text": "In preparation for this, we are today providing an update to support businesses as they prepare to comply with the new regime. "
        },
        {
            "heading": 2,
            "text": "Update on our consultation and next steps "
        },
        {
            "text": "In response to our consultation, we have received helpful and constructive feedback from a range of stakeholders. "
        },
        {
            "text": "Recognising that the requirements are new and that the consequences of getting it wrong could be severe, businesses – large and small – have said that they would welcome greater clarity on how our enforcement processes will work, in particular: "
        },
        {
            "text": "We intend to make this clearer in our guidance."
        },
        {
            "heading": 2,
            "text": "Enforcement priorities "
        },
        {
            "text": "Businesses have told us that they would also welcome clarity on our approach to enforcement."
        },
        {
            "text": "Most businesses work hard to serve their customers and do the right thing, but they may need help to understand their new legal obligations, particularly in the early days of the new regime. We also recognise that – especially for small businesses – following the rules will also have ongoing resource implications. However, it is also important for businesses that follow the rules that action is taken to ensure their competitors cannot gain an unfair advantage by failing to meet their obligations under the law."
        },
        {
            "text": "Recognising that the new provisions may require changes to systems and compliance functions, for at least 3 months from the date forecourts must be registered with Fuel Finder and must start reporting price changes (from 2 February 2026 until beginning May 2026), our focus will be on supporting businesses to comply with the new regime rather than enforcement action. "
        },
        {
            "text": "Looking further ahead, once the regime is established, we expect to target enforcement action against the conduct which is most likely to undermine the effectiveness of Fuel Finder, and which is likely to be more harmful to consumers and competition. Our focus will therefore be on ensuring businesses register with Fuel Finder and that pricing information is accurately provided, rather than on amenities and facilities, which are unlikely to be priorities for enforcement except where significant harm has been identified. "
        },
        {
            "heading": 2,
            "text": "Find out what else we’re doing to help motorists "
        },
        {
            "text": "The CMA also has a statutory monitoring function in relation to road fuel, and publishes regular reports on fuel prices, retail spreads and fuel margins. You can read more about the CMA’s monitoring role on our road fuel price data scheme page. "
        }
    ]
}