{
    "url": "https://hmlandregistry.blog.gov.uk/2025/11/17/how-hm-land-registry-works-to-protect-property-owners/",
    "title": "How HM Land Registry works to protect property owners ",
    "authors": [
        "Chloe Evans, Deputy Head of Counter Fraud"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2025-11-17T12:31:25+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Sharing tips and guidance during International Fraud Awareness Week  "
        },
        {
            "text": "Each year, HM Land Registry undertakes an internal and external fraud awareness campaign to highlight the fraud threats being faced by the organisation and our staff members as individuals.  "
        },
        {
            "text": "While I’m taking the opportunity presented by International Fraud Awareness Week to share some tips on how to avoid property fraud, HM Land Registry works diligently all year round to help protect owners of property in England and Wales from fraud. "
        },
        {
            "text": "We work closely with the property sector and government partners to: "
        },
        {
            "text": "In September, we published a blog on GOV.UK explaining the scale of property fraud and what we are doing about it. During International Fraud Awareness Week, we are looking at some of these trends and explaining how HM Land Registry can help protect your property. "
        },
        {
            "text": "As part of our due diligence, our dedicated counter fraud team works hard to spread fraud awareness throughout HM Land Registry and train up our caseworkers on spotting potentially fraudulent applications and flagging up their concerns when an application doesn’t seem quite right. "
        },
        {
            "heading": 3,
            "text": "Our focus on counter-fraud "
        },
        {
            "text": "Our main counter-fraud focus is helping people in England and Wales guard against all types of property fraud. "
        },
        {
            "text": "We continually review and update our fraud-detection methods. This includes: "
        },
        {
            "text": "Property Alert lets subscribers know when there is certain activity on the properties they are monitoring such as if a new mortgage is taken out against it.  "
        },
        {
            "heading": 3,
            "text": "How criminals steal your money "
        },
        {
            "text": "Criminals use many different methods and tactics to steal your money. This includes getting your personal information to use later for fraud. "
        },
        {
            "text": "They will use every possible way to find, reach and defraud people. This includes websites and apps, email, text, phone, post and in person, including on your own doorstep. "
        },
        {
            "text": "International Fraud Awareness Week is an excellent opportunity for us and other organisations to share tips and guidance with people in the public, private and professional sectors."
        },
        {
            "heading": 3,
            "text": "Payment diversion fraud in property transactions "
        },
        {
            "text": "Recently, the National Crime Agency and the Law Society highlighted the issue of 'payment diversion fraud' in property transactions. "
        },
        {
            "text": "Payment diversion fraud (also called 'mandate fraud' or 'conveyancing fraud') involves criminals tricking victims into transferring house deposits or purchase money to fraudsters instead of the correct place. "
        },
        {
            "text": "Criminals do this by pretending to be solicitors, estate agents or buyers. They use fake email addresses or invoices. "
        },
        {
            "heading": 3,
            "text": "The scale of the problem "
        },
        {
            "text": "Between April 2024 and March 2025: "
        },
        {
            "heading": 3,
            "text": "Property and title fraud – what are they? "
        },
        {
            "text": "Property fraud is our main concern, and it can be hard to spot. "
        },
        {
            "text": "Property fraud includes: "
        },
        {
            "text": "When false documents are used to transfer or mortgage property illegally, we call it registered title fraud. "
        },
        {
            "heading": 3,
            "text": "Who is most at risk? "
        },
        {
            "text": "People who do not live in their property are particularly vulnerable. This includes: "
        },
        {
            "heading": 3,
            "text": "Guarding against tenancy fraud "
        },
        {
            "text": "We’re also reminding prospective tenants to guard against fraud. Before paying any deposit or rent, check property title registers to make sure the person claiming to own the property really does so.  "
        },
        {
            "heading": 3,
            "text": "Our record in preventing fraud "
        },
        {
            "text": "HM Land Registry prevented the registration of fraudulent applications against more than £59 million worth of property during 2024 to 2025. And between 2020 and 2025, we prevented fraudulent applications against more than 300 properties worth over £194 million. "
        },
        {
            "heading": 3,
            "text": "How rare is property fraud? "
        },
        {
            "text": "In 2024 to 2025, we received 4,429,092 applications to create or update the Land Register; only 86 were identified as fraudulent (just over 0.0019%) "
        },
        {
            "text": "However, while it remains relatively rare, we know the impact of property fraud on individuals can be devastating. "
        },
        {
            "heading": 3,
            "text": "Sign up for Property Alert – how it works "
        },
        {
            "text": "We encourage all property owners to sign up for our free Property Alert service. "
        },
        {
            "text": "You will receive an email each time there is significant activity on the property you are monitoring. For example, if a new mortgage is taken out against it. "
        },
        {
            "text": "If the activity looks suspicious, you should take action immediately. "
        },
        {
            "text": "Not all alert emails will mean fraudulent activity. If you do not think the alert email is about any suspicious activity, you do not need to do anything. "
        },
        {
            "heading": 3,
            "text": "Support for victims of title fraud "
        },
        {
            "text": "Government-backed support is available for people who have suffered a loss as a result of title fraud. "
        },
        {
            "text": "If fraud has been committed, the Land Registration Act 2002 sets out when a mistake in the register can and cannot be put right. See our practice guide 39 for more information. "
        },
        {
            "heading": 3,
            "text": "Other measures to safeguard your property "
        },
        {
            "text": "A whole range of measures to safeguard your property is available, so we encourage people to keep a close eye on the advice and guidance available. Find out more at The true picture of property fraud in England and Wales – HM Land Registry "
        }
    ]
}