{
    "url": "https://naturalengland.blog.gov.uk/2025/11/17/how-nature-and-nuclear-can-co-exist/",
    "title": "How nature and nuclear can co-exist",
    "authors": [
        "Sean Mahoney"
    ],
    "categories": [
        "Climate change",
        "Development",
        "Green Infrastructure",
        "Growth",
        "Natural England",
        "Nature",
        "Science and evidence"
    ],
    "pub_date": "2025-11-17T08:00:00+00:00",
    "content": [
        {
            "text": "By Sean Mahoney, Sizewell C Project Manager and Senior Officer, Major Planning Casework"
        },
        {
            "text": "A collaborative approach has delivered environmental protections alongside energy security at Sizewell C nuclear power station."
        },
        {
            "text": "Natural England has worked closely with Sizewell C and environmental stakeholders for 15 years. The Nationally Significant Infrastructure Project, (NSIP), supports the government's Plan for Change mission to make Britain a clean energy superpower while delivering environmental benefits for the region. When complete, it is hoped that Sizewell C will power up to 6 million homes."
        },
        {
            "text": "The East Suffolk Trust, EaST, a new environmental charity established by Sizewell C, East Suffolk Council and Suffolk County Council, will provide £78m over 70 years for environmental improvements across the region. EaST will support projects for the conservation, protection and improvement of the natural environment, including the coastal marine environment, in and around Suffolk."
        },
        {
            "text": "Additionally, a £12 million Natural Environment Improvement Fund will support projects that will benefit Suffolk’s wildlife, such as hedge and woodland creation, pond and wetland restoration and the creation of green corridors to connect habitats. Natural England is a voting member of the group which administers the Natural Environment Improvement Fund and will sit on the East Suffolk Trust advisory board to ensure environmental priorities are met to secure a positive legacy for nature."
        },
        {
            "text": "Natural England’s Chair, Tony Juniper, members of the Natural England Executive Committee, and other stakeholders visited Sizewell C during the summer to celebrate the establishment of EaST, marking 15 years of constructive engagement with Sizewell C."
        },
        {
            "text": "By working collaboratively with Sizewell C from the outset, Natural England has been able to support the developer in its aspirations to deliver energy security at the same time as securing a positive legacy for nature."
        },
        {
            "text": "During the visit Tony commented that:"
        },
        {
            "text": "“Early collaboration between Sizewell C, Natural England and other environmental regulators has meant that compensatory habitat was able to be secured before development began. This joint approach to finding strategic solutions for nature has enabled this complex, major infrastructure project to proceed on schedule. When we take this kind of action up front, we can secure big wins for Britain’s energy security, whilst restoring nature.”"
        },
        {
            "text": "Sizewell C's Environment lead and Development Consent Order Manager, Dr Mannings added:"
        },
        {
            "text": "“This joint approach has created compensatory wildlife habitats at locations nearby including Benhall, Halesworth, and Pakenham, establishing 170 hectares of nature reserves from low grade arable land that will provide long-term benefits beyond the construction period. In total approximately 500ha of Suffolk Sandlings habitat will be created. Sizewell C are very pleased to be working with Natural England to deliver truly landscape scale strategic habitat creation.”"
        },
        {
            "text": "Environmental advice on this huge and complex project has not been a simple case of replacing one tree for another; the habitats and species that make up this site are a complex mosaic of biodiversity. Natural England's, and local eNGOs' expertise has been instrumental in ensuring local communities will continue to benefit from nature in this special area."
        },
        {
            "text": "Wild Aldhurst Nature Reserve, a former onion farm, was created before construction work started. Its ongoing establishment will be closely monitored by the Sizewell C Ecology Working Group, one of several environmental governance groups on which Natural England is a voting member."
        },
        {
            "text": "Natural England’s collaboration with Sizewell C supports the government's clean power targets whilst demonstrating how environmental considerations can be integrated into major developments from the earliest stages.  This partnership approach reduces delays, provides certainty for developers, and ensures environmental protections are built into project designs from the outset."
        },
        {
            "text": "Sizewell C is a clear example of what can be achieved when developers and environmental regulators work closely together to combine economic growth with nature recovery. Development and nature are not mutually exclusive. Through constructive early engagement and by maintaining a positive dialogue, development and nature can go hand in hand."
        }
    ]
}