{
    "url": "https://civilservice.blog.gov.uk/2025/11/17/mission-moment-from-1-jabs-and-50m-breakthrough-how-were-delivering-mission-led-innovation/",
    "title": "Mission Moment: From £1 jabs and £50m breakthrough – how we’re delivering mission-led innovation",
    "authors": [
        "Alex McLaughlin"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-11-17T14:12:43+00:00",
    "content": [
        {
            "text": "A Deputy Director at the Office for Life Sciences explains why getting proven treatments to patients can matter just as much as funding cutting-edge research, and how both approaches are delivering on the government's missions to grow the economy and fix the NHS."
        },
        {
            "text": "I’ll be honest, when I started as Deputy Director for Innovation and Growth at Office for Life Sciences four years ago, I didn’t fully grasp the breadth of what we could achieve. We’ve taken areas like mental health and maternity,often overlooked, and partnered with industry, the NHS and UK scientists to make real, tangible progress."
        },
        {
            "text": "I lead a brilliant team of 25 Civil Servants across Health, Science and Business Departments. Our mission is twofold: grow the sector and get NHS patients access to innovations faster. I oversee programmes worth £750m, talking daily to NHS partners, industry and big charities about how we can improve lives. "
        },
        {
            "text": "When the stakes are real"
        },
        {
            "text": "Our Goals Programme is a great example. It tackles five disease areas where patients need us most: dementia, mental health, cancer, obesity and addiction. Each area has an expert external chair, bringing together the NHS, UK science and global industry to drive progress on specific clinical challenges."
        },
        {
            "text": "My role was establishing the programme, overseeing chair appointments and working with partners to deliver results. What makes this so satisfying? Identifying “sweet spots” where NHS needs align with emerging technologies."
        },
        {
            "text": "Take our recent £50m investment in Mental Health research. One in four of us will face acute mental health issues. Everyone knows someone affected. Yet research has lagged desperately behind. I oversaw development of the business case, and my team aligned scientists, doctors, patients and companies across the UK to improve diagnosis and treatment for those facing mental health problems."
        },
        {
            "text": "But here’s what surprised me most:"
        },
        {
            "text": "The biggest impact doesn’t come from flashy high-tech science. Sometimes it’s about getting proven innovation to the NHS clinicians and patients who need it."
        },
        {
            "text": "Here’s a perfect example: a £1 jab of magnesium sulphate given when a woman enters pre-term labour cuts the risk of the baby being born with cerebral palsy by over 30%. The evidence was brilliant, but uptake across the NHS was patchy. "
        },
        {
            "text": "So whilst we were investing £50m in breakthrough mental health research, we also funded our Health Innovation Networks to work with every maternity unit in England - training midwives and doctors, working out practical details like changing workflows and where to store syringes. We helped clinicians explain to anxious mothers why they need another injection and the good it would bring. "
        },
        {
            "text": "This has prevented hundreds of cerebral palsy cases and will save the NHS billions. It wasn’t groundbreaking research. It was practical, systemic implementation."
        },
        {
            "text": "Why it matters"
        },
        {
            "text": "This is how we deliver on the government’s missions of growing the economy and making the NHS fit for the future. We fuse world-class science with boots-on-the-ground delivery, ensuring British innovation reaches those who most need it.  "
        },
        {
            "text": "Public service is ultimately about one thing: impact. I truly believe we make the most impact when we embrace science, innovation and technology to improve treatment for people in their time of need. "
        }
    ]
}