{
    "url": "https://aphascience.blog.gov.uk/2025/11/17/protecting-the-future-aphas-fight-against-antimicrobial-resistance/",
    "title": "Protecting the future: APHA’s fight against antimicrobial resistance",
    "authors": [
        "Francesca Martelli",
        "Rod Card"
    ],
    "categories": [
        "Antimicrobial Resistance",
        "International"
    ],
    "pub_date": "2025-11-17T09:25:53+00:00",
    "content": [
        {
            "text": "When medicines stop working, infections become harder, sometimes impossible, to treat. This is the stark reality of antimicrobial resistance (AMR), a growing threat to both human and animal health. At the Animal and Plant Health Agency (APHA), we are on the front lines of the UK’s fight against AMR, and we are proud to play a key role in protecting the effectiveness of life-saving drugs."
        },
        {
            "heading": 2,
            "text": "The UK’s roadmap: National Action Plan 2024–2029"
        },
        {
            "text": "The UK, and many countries worldwide, has a National Action Plan (NAP) to tackle AMR. The UK was one of the first countries to have such a plan. The current plan spans 2024 to 2029 and outlines nine strategic outcomes supported by 30 specific commitments. APHA contributes directly to many of these, helping turn ambition into action."
        },
        {
            "heading": 2,
            "text": "Surveillance, diagnostics, and smarter use of antimicrobials"
        },
        {
            "text": "One of our core responsibilities is running a scanning surveillance programme interlinked with our diagnostic services. This allows us to detect and identify pathogens of clinical significance in livestock and wildlife and test the sensitivity of bacteria to commonly used antibiotics. By working closely with vets and farmers, we raise awareness of endemic diseases and promote better biosecurity and infection control. The result? More targeted interventions and more responsible use of antimicrobials."
        },
        {
            "heading": 2,
            "text": "Keeping Salmonella and AMR out of the food chain"
        },
        {
            "text": "Salmonella is an important example of a bacterium that can develop resistance to antimicrobials. It is also a zoonotic threat, meaning it can spread between animals and humans, often through contaminated food. APHA leads national control programmes for Salmonella in livestock, advising farmers and policymakers on how to keep it off farms and out of our food. When critically resistant strains (strains which are resistant to critically important antimicrobials for human medicine) appear, we act fast to stop them from gaining a foothold in the UK."
        },
        {
            "heading": 2,
            "text": "Researching new frontiers in AMR"
        },
        {
            "text": "Our scientists are constantly exploring new ways to understand and combat AMR. From studying how resistant bacteria spread to testing the effectiveness of disinfectants and bacteriophages (viruses that target bacteria), our research is helping shape the future of AMR control. We also develop rapid detection and characterisation tools to identify AMR bacteria: tools that are designed to work across human, animal, and environmental health sectors in a true One Health approach."
        },
        {
            "heading": 2,
            "text": "A global voice in the fight against AMR"
        },
        {
            "text": "APHA’s impact does not stop at the UK border. We are proud to be the only laboratory in the world accredited by the World Organization for Animal Health (WOAH) for AMR. This global recognition allows us to advocate for better AMR control worldwide."
        },
        {
            "text": "We are also part of an International Reference Centre for AMR, designated by the Food and Agriculture Organization of the United Nations, together with the Centre for Environment, Fisheries and Aquaculture Science (CEFAS) and the Veterinary Medicines Directorate (VMD). We support international collaboration, share best practices, and build a global community of experts committed to tackling AMR."
        },
        {
            "heading": 2,
            "text": "Supporting One Health in low- and middle-income countries"
        },
        {
            "text": "Through partnerships with other UK government departments and our international network, we help strengthen One Health action on AMR in low- and middle-income countries. This work is vital to ensuring that progress against AMR is truly global."
        },
        {
            "heading": 2,
            "text": "Our commitment"
        },
        {
            "text": "At APHA, we are proud of the unique role we play in the UK’s AMR strategy. Whether it is protecting animals from disease, preserving the effectiveness of vital medicines, or collaborating across sectors and borders, we are committed to making a difference. Together with our partners in public health and environmental protection, we are working to ensure a healthier future for all."
        }
    ]
}