{
    "url": "https://technology.blog.gov.uk/2025/11/17/shaping-the-future-of-public-sector-technology-with-the-new-enterprise-architecture-team/",
    "title": "Shaping the future of public sector technology with the new Enterprise Architecture team",
    "authors": [
        "Jennie Vinnac, Service Owner for Enterprise Architecture, OCTO, GDS"
    ],
    "categories": [
        "Technology"
    ],
    "pub_date": "2025-11-17T14:01:32+00:00",
    "content": [
        {
            "text": "Public services are increasingly digital, interconnected, and reliant on complex systems, so the need for coherent, joined-up architecture has never been greater. That’s where we come in. As the re-established Enterprise Architecture team in Government Digital Service (GDS), our purpose is clear - to help implement solid digital foundations that enable transformation across government. We’re here to work with and through existing teams to unlock greater value, together.We want to start a conversation, to share our purpose and priorities, and to build an integral community of leading architects who will help shape the future of public sector services. Our plans are ambitious, but with the strength of the digital community behind us, we’re confident in our ability to deliver lasting impact."
        },
        {
            "heading": 2,
            "text": "What is enterprise architecture?"
        },
        {
            "text": "Enterprise architecture is the link between strategy and execution. It’s the framework that orchestrates business processes, systems, and infrastructure. Enterprise architecture ensures that organisational infrastructure is aligned, interoperable, and future-ready. It’s not just about technology, it’s about enabling smarter decisions, seamless collaboration, and sustainable transformation right across government."
        },
        {
            "text": "So, how do we fit in? Our role is to elevate harmonisation, interoperability and reuse across the entire public sector. We provide strategic direction, expert guidance, and architectural coherence. By helping teams across government to design and deliver services, we can ensure that services are joined-up, scalable, and user-centred. We’re here to supercharge innovation, not stifle it."
        },
        {
            "text": "Our headline mission is to design, govern, and enable shared digital architecture that unlocks interoperability, accelerates scalable solutions, and empowers public sector organisations to deliver connected, efficient, and user-focused services. "
        },
        {
            "heading": 2,
            "text": "Our initial priorities"
        },
        {
            "text": "In our first few months, we’ve focused on delivering tangible progress aligned with our mission. Here’s what we’ve achieved so far:"
        },
        {
            "text": "Established the Technical Design Council"
        },
        {
            "text": "In line with the blueprint for modern digital government, we’ve launched a cross-government Technical Design Council, bringing together technical leaders and experts to shape architectural direction and set shared principles on behalf of the public sector. "
        },
        {
            "text": "We’ve already held 6 successful council sessions, and are well on our way to establishing a powerful decision making community."
        },
        {
            "text": "Supported the spending review "
        },
        {
            "text": "We supported the review of digital zero-based reviews (ZBR) and business cases as part of the spending review to drive deduplication, encourage collaboration, and promote the use of common components across government spending."
        },
        {
            "text": "Partnered with priority initiatives"
        },
        {
            "text": "We’ve supported key GDS priorities by offering architectural insight and practical guidance. This includes streamlining end user device procurement to exploring the technical implementation of the once-only principle."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Over the coming months, our priorities are to:"
        },
        {
            "heading": 2,
            "text": "Let’s shape the future together"
        },
        {
            "text": "We’re inviting architects across government to join the conversation on what the enterprise architecture’s function for government should prioritise. We want to know what challenges you’re facing and what support would make the biggest difference."
        },
        {
            "text": "We’re also looking for nominations for rotation at the Technical Design Council, so if you’re in a public sector organisation and would like to put your name forward for a 6 month rotation on the council, we’d love to hear from you. We’re looking for diverse voices and experience."
        },
        {
            "text": "To contact us, please email publicsector.architecture@dsit.gov.uk"
        },
        {
            "text": "This is just the beginning. With your input, we can build an enterprise architecture capability for the public sector that truly supports better outcomes for people, services, and systems."
        }
    ]
}