{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/17/uk-nsc-consults-on-bladder-cancer-screening-evidence/",
    "title": "UK NSC consults on bladder cancer screening evidence",
    "authors": [
        "Omaer Syed"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-17T08:47:56+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a public consultation on evidence relating to population screening for bladder cancer."
        },
        {
            "text": "The UK NSC does not currently recommend screening for this condition."
        },
        {
            "text": "We are asking individuals and organisations to provide feedback on the findings and conclusions of a 2025 evidence map, which was commissioned to review literature on the topic published since the previous review in 2020, including any evidence on new tests and interventions. Evidence maps are typically the first step in the UK NSC evidence review process. "
        },
        {
            "text": "The 2025 evidence map has concluded that the overall volume of new evidence on bladder cancer screening published since 2020 is insufficient to recommend more in-depth work."
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "text": "To take part in the consultation, click on the grey ‘View documents’ button on the UK NSC’s bladder cancer recommendation page. Then submit your response by clicking on the green ‘Submit comments’ button."
        },
        {
            "text": "The deadline for responses is 11.59pm on 9 February 2026."
        },
        {
            "text": "The consultation responses will be considered by the UK NSC when it updates its recommendation on this topic."
        },
        {
            "heading": 2,
            "text": "About bladder cancer"
        },
        {
            "text": "Bladder cancer is cancer found anywhere in the bladder. It is a complex disease that requires effective diagnostic and monitoring strategies. Early detection plays a crucial role in the prognosis and treatment of the disease."
        },
        {
            "text": "Treatments include surgery, chemotherapy, radiotherapy and targeted medicines."
        },
        {
            "text": "There are around 10,500 new cases of bladder cancer in the UK each year and nearly half of those survive for 10 or more years. In around 20% of cases, bladder cancer has invaded the muscle wall by the time it is detected. In these cases, the cancer can spread rapidly and, even with optimal treatment, 5-year survival is only 50%."
        },
        {
            "text": "A 2015 evidence review did not recommend screening because there was no safe, precise and valid screening test. It also noted that, to be effective, a screening test must be able to detect cancers that are destined to become muscle-invading, but before they have done so."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The 2025 evidence map found that the overall volume of new evidence on bladder cancer screening published since 2020 was insufficient to recommend further evidence synthesis work."
        },
        {
            "text": "The identified evidence included some biomarkers that might be suitable for confirming or ruling out suspected cases of bladder cancer. However, there was insufficient evidence of a test suitable for a population screening programme."
        },
        {
            "text": "The evidence map also found updates to 5 international clinical guidelines for population screening for bladder cancer, 3 additional guidelines and 2 overviews of guidelines. However, none of these recommend population screening of asymptomatic adults for bladder cancer."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}