{
    "url": "https://marinescience.blog.gov.uk/2025/11/17/unlocking-coastal-carbon-potential-collaborative-research-on-saltmarsh-kelp-and-seabed-carbon-under-the-uk-blue-carbon-evidence-partnership/",
    "title": "Unlocking Coastal Carbon Potential: Collaborative Research on Saltmarsh, Kelp, and Seabed Carbon under the UK Blue Carbon Evidence Partnership",
    "authors": [
        "mosscatriona"
    ],
    "categories": [
        "blue carbon",
        "Climate Change",
        "Deep-sea",
        "marine protected areas",
        "Monitoring",
        "natural capital",
        "Science"
    ],
    "pub_date": "2025-11-17T10:26:00+00:00",
    "content": [
        {
            "text": "By Ruth Parker, Principal Biochemistry Scientist, Elisa Capuzzo, Marine Ecosystems Scientists, and David Hughes, Biogeochemistry Scientist at Cefas; "
        },
        {
            "text": "Jessica Elias, Climate Change Senior Specialist  and Maija Marsh, Principal Specialist in Marine Ecology at Natural England;"
        },
        {
            "text": "Lucy Stainthorpe, Estuaries and Coasts Advisor, and Africa Gomez Castilo, Estuaries and Coasts Advisor at the Environment Agency. "
        },
        {
            "text": "As world leaders gather in Belém, Brazil, this week for the UN Climate Change Conference COP30, the role of nature-based solutions in addressing climate change is once again under the spotlight. Among the most promising — yet still poorly understood — are our coastal and marine ecosystems. Saltmarshes, seagrass meadows and other coastal marine habitats not only support biodiversity and protect our shorelines — they also act as natural carbon stores, capturing and locking away carbon dioxide from the atmosphere. These “blue carbon” ecosystems play an important role in both tackling and adapting to climate change."
        },
        {
            "text": "Under the Paris Agreement, countries are expected to submit more ambitious nationally determined contributions (known as NDCs) that reflect the latest evidence on nature-based solutions. Yet, despite this policy progress, major data gaps remain. We still lack robust evidence to quantify how much carbon is stored in different coastal habitats — particularly seagrass, saltmarshes, and seabed sediments — and how these stores are changing under human and climate pressures. Filling these gaps is essential if we are to manage, protect, and restore blue carbon ecosystems effectively and ensure that policy is grounded in robust, place-based evidence."
        },
        {
            "text": "UK Blue Carbon Evidence Partnership"
        },
        {
            "text": "In the UK, our saltmarshes, kelp forests and seabed play an important role in carbon sequestration, whilst providing numerous other benefits for people and nature, including flood defence, climate regulation, and tourism opportunities. Like many blue carbon ecosystems globally, they face growing threats from pollution, unsustainable human activities, and sea-level rise driven by climate change. "
        },
        {
            "text": "Since 2022, Cefas has been working through the UK Blue Carbon Evidence Partnership (UKBCEP) to bring together science and policy experts from across Defra (Department for Environment, Food and Rural Affairs), the Department for Energy Security and Net Zero, the Scottish Government, the Welsh Government and the Department of Agriculture, Environment and Rural Affairs (DAERA- Northern Ireland) to tackle the barriers in managing, protecting, and enhancing blue carbon habitats in the UK. A recent UKBCEP evidence needs report identified several priority areas of focus:"
        },
        {
            "text": "Over the past three years, several programmes supported by a range of partners have been driving forward progress in addressing these evidence gaps."
        },
        {
            "text": "Saltmarshes"
        },
        {
            "text": "Saltmarshes are excellent carbon stores that also provide vital habitat for wildlife and protect people and property from flooding. Despite these benefits, saltmarshes in England have experienced significant decline, with up to 85% lost since the mid-19th century. Working with partners including the Environment Agency, Natural England and UK Centre for Ecology & Hydrology (UKCEH), the UKBCEP is investigating the contribution of UK saltmarshes to climate change mitigation for inclusion in the UK's greenhouse gas inventory (a framework for monitoring and reporting on greenhouse gas emissions and storage). This work package aims to deliver UK-specific estimates of emissions from saltmarshes, enabling a more accurate assessment of progress towards the UK's net zero goals."
        },
        {
            "text": "To achieve this, the Environment Agency, Natural England and the WWF have been working in partnership with UKCEH to build a world first network of flux towers on saltmarsh, including sites managed by the RSPB and Essex Wildlife Trust. Six flux towers (four led by the Environment Agency, two led by Natural England) have been installed by UKCEH and have been collecting real time evidence on carbon dioxide as well as other site variables.  Initial results are promising and suggest that these saltmarshes are acting as overall net carbon sinks. Longer term funding of this network is key; evidence gathered over multiple years will aid comparison across different saltmarshes, help identify regional changes in climate over time and will provide a detailed assessment of the role of saltmarsh in achieving the UK’s Net Zero targets. "
        },
        {
            "text": "The UKCEH is also creating a baseline map of saltmarshes across the UK, addressing key questions about the definition of saltmarsh extent (where does a saltmarsh start and end?’) and the condition of saltmarsh habitats in the UK (are they natural or restored, and how might that affect carbon storage’). This work could provide a blueprint for other countries seeking to accurately measure emissions from saltmarsh carbon sinks. Currently, only the United States and Australia include saltmarshes in their greenhouse gas inventories. It is hoped that results from the work will provide the evidence needed to unlock funding, which can be used to restore and create these important habitats."
        },
        {
            "text": "Seabed carbon"
        },
        {
            "text": "Cefas is advancing blue carbon research by deepening our understanding of how the shelf seabed processes and stores carbon over the long term. Although offshore shelf sediments cover 9% of our oceans and store large amounts of carbon, they are not yet recognised or protected under international climate agreements. In English waters alone, the seabed stores between 81–104 million tonnes of carbon in the top 10 cm of soil—equivalent to about one year’s worth of UK emissions (297–382 million tonnes of carbon dioxide). Notably, 19–33% of this carbon is found within the existing Marine Protected Area (MPA) network."
        },
        {
            "text": "Under the UKBCEP, Cefas, through several Defra funded carbon management research projects and the marine Natural Capital Economic Assessment Programme (mNCEA)  are building a robust evidence base on seabed carbon processes. This includes collecting new observations in the North Sea shelf sediments  (raw data on seabed carbon stock, sequestration, and composition), and developing and testing a blue carbon ‘toolbox’ of methods to help scientists understand where carbon stocks may be more susceptible to degradation. In addition, Cefas is producing a new UK and international community technical briefing summarising the latest evidence on trawling fleet distribution, gear types, and carbon reactivity, to estimate the scale and location of carbon disturbance and resuspension each year."
        },
        {
            "text": "Ongoing work is also exploring the relationship between biodiversity and seabed carbon storage (trade-off or win-win), using predictive models to explore how different marine management approaches could impact the potential of the seabed to store or release carbon. Cefas is also investigating how carbon sequestration supports climate regulation as an ecosystem service, including the potential economic and societal costs if this service were degraded. For example, recent research estimates that damage to seabed carbon storage from human activities and climate change could cost the UK economy up to £10 billion over 25 years through increased coastal erosion and loss of ecosystem services. A follow up paper highlights the need for new accounting guidance and governance frameworks for managing carbon in shelf seas."
        },
        {
            "text": "Going forward, Cefas and its partners aim to develop a nationally standardised approach to measuring, monitoring, and valuing seabed carbon. This will provide consistent technical guidance and an evidence base to support policymakers in designing strategies—such as enhanced MPA management—to protect and restore the UK’s valuable blue carbon habitats."
        },
        {
            "text": "Kelp"
        },
        {
            "text": "Kelp forests are highly productive ecosystems and support diverse marine life, by providing food, shelter, and habitat for a variety of organisms. Over 80% of kelp production becomes detritus —fragments of decaying algae matter—which is dispersed by currents and tides, making it a significant source of organic carbon for the coastal and marine environment. However, the extent of kelp beds, and associated carbon biomass, and how kelp fragments move through and settle in the marine environment (‘detritus pathways’) remain uncertain. "
        },
        {
            "text": "As part of the UKBCEP, Cefas has carried out a literature review on kelp habitats to understand their extent, carbon storage/sequestration potential, kelp detritus pathways and key evidence gaps. The project has also used eDNA to assess the presence of kelp matter in sediments collected along an inshore-offshore transect (approximately 50 km in length) along the North-East English coast. Results from the analysis showed that macroalgal (seaweed) detritus was present in all the sediment samples, showing the widespread dispersal of seaweed across the seabed."
        },
        {
            "text": "To better understand kelp detritus pathways and its presence in marine sediments, Cefas has used a particle-tracking model to map their movement off the North-East English coast. This showed that detritus particles tend to settle on the seafloor within a short distance (few kilometres) from the coast, with inshore sites — closer to kelp beds — having the most amount detritus."
        },
        {
            "text": "Building on these finding, the next phase of the work package will apply the particle tracking model to other locations, such as the South-West, to further develop our understanding of kelp detritus pathways and its potential contribution towards carbon storage/removal in marine sediments."
        }
    ]
}