{
    "url": "https://teaching.blog.gov.uk/2025/11/17/writing-framework-transforms-primary-school-teaching/",
    "title": "How the new Writing Framework can transform primary school teaching",
    "authors": [
        "Sam Creighton"
    ],
    "categories": [
        "Writing and reading"
    ],
    "pub_date": "2025-11-17T09:59:56+00:00",
    "content": [
        {
            "text": "Writing is one of the most magnificent and most challenging skills children attempt at school. It unites imagination, composition, transcription, and motor skills, demanding immense effort from pupils and equally, careful teaching that never compromises on the empowering and enjoyable aspects of writing."
        },
        {
            "heading": 2,
            "text": "What writing for pleasure brings to primary schools"
        },
        {
            "text": "At Elmhurst Primary, we have spent years building a curriculum rooted in Writing for Pleasure principles, nurturing young writers through meaningful projects, explicit craft teaching, and authentic publishing opportunities that foster pride and joy in writing.This commitment to recognising children as apprentice writers made the new Writing Framework welcome. Its principles affirm much of the research-informed practice in our classrooms while providing valuable tools for reflection."
        },
        {
            "heading": 2,
            "text": "Benefits of dedicated writing lessons"
        },
        {
            "text": "One of its most significant statements is that “writing must be taught separately from reading.” Focused lessons in both subjects have been transformative. In reading lessons, children write about what they’ve read, while in writing lessons we study rich mentor texts. Writing in response to books has value but belongs in the reading curriculum. If children only write in response to texts, they risk being confined to others’ ideas. A genre-based writing approach, with support and freedom to choose own ideas, builds both confidence and competence."
        },
        {
            "heading": 2,
            "text": "How student choice transforms writing quality"
        },
        {
            "text": "There is joy when a class produces 30 different explanation text or stories, each applying taught skills but reflecting individual imagination. As one teacher said: “Every piece of writing is as unique as the child who created it. I really get to know each child as a writer and person.”"
        },
        {
            "heading": 2,
            "text": "Using framework audits to enhance practice"
        },
        {
            "text": "The Framework also provides a lens for reflection. The audits for each section helped us refine our offering, particularly around handwriting and spelling. Daily handwriting now continues through to Year 6, and spelling is taught in short, frequent bursts. Spelling in context is already improving — vital in a school where over 90% of pupils are EAL.For many schools, the Framework represents change. For us, it affirms and energises: a resource that helps balance explicit skill teaching with nurturing children’s will. It reminds us that every child can take pleasure and pride in their writing."
        },
        {
            "heading": 2,
            "text": "Further information"
        }
    ]
}