{
    "url": "https://defradigital.blog.gov.uk/2021/06/28/a-decade-of-progress-for-the-government-sustainable-ict-project/",
    "title": "A decade of progress for the Government Sustainable ICT Project",
    "authors": [
        "Chris Howes, Chief Digital and Information Officer"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation",
        "ICT sustainability"
    ],
    "pub_date": "2021-06-28T11:16:15+01:00",
    "content": [
        {
            "text": "In April each year Defra’s Digital Data and Technology Services (DDTS) function, through our cross-government forum, the STAR (Sustainable Technology Advice and Reporting), commission sustainable ICT reporting across all government departments, agencies and bodies. But of course, April 2020 was a year like no other and as such we postponed the launch until September. I am proud to announce the results in the 2020 Annual Report."
        },
        {
            "text": "In terms of Sustainable ICT, the pandemic has helped shift long held and firm cultural beliefs that have resisted some of the best practices we have been promoting and advocating for the last decade. The two biggest shifts we have seen across government are an increase in the rollout of mobile devices and a move to online working. Both changes have resulted in a large reduction in travel, estates use and the associated carbon."
        },
        {
            "text": "A list of ICT best practices to enable greener government can be found in Annex A of the 2020 Strategy. The results of this change will be reflected in next year’s annual report."
        },
        {
            "heading": 2,
            "text": "ICT enables greener, more sustainable way of working"
        },
        {
            "text": "Highlighting the role of ICT as a key enabler to a greener, more sustainable way of working is of paramount importance. Therefore, for the first time, we have been working to ensure sustainable ICT will be included within the update of the Greening Government Commitments 2021-2025 (GGC), and the annual reports and accounting process (ARA), essentially departments wider sustainability and financial reporting. In addition, all ICT and digital projects and programmes, subject to the spend controls process, will be obligated to include sustainable ICT, as part of an updated Technology Code of Conduct measured in order to progress with the new Chief Digital and Data Office process."
        },
        {
            "text": "It is worth reflecting on our achievements, what we’ve discovered and information gaps across government."
        },
        {
            "text": "Our successes since our first report in 2012 are many:"
        },
        {
            "text": "With the support of the cloud industry, we have been able to collect service-based cloud carbon data for the first time from public cloud providers. This builds on our knowledge from private cloud and existing hosting data. The opportunities are huge for further improvements and efficiencies across the government hosting estate, but we must ensure our move to more efficient operations is coupled with the data and KPI’s to support our sustainability objectives and wider government policy."
        },
        {
            "heading": 2,
            "text": "Building back better"
        },
        {
            "text": "The role of Data and Digital to build back better will be developed through the work of the two new National Data and Digital Strategies led by DCMS. Through the STAR we will ensure that both Data and Digital help us understand and hopefully mitigate the climate crisis. This will be especially apparent in the 2020/21 annual report as it will capture the year that digital services replaced office working, commuting and business travel."
        },
        {
            "text": "My thanks must go to many industrious thought leaders on sustainable ICT that formed and pushed this group and its work into the mainstream. We have been proud to be at the vanguard of this increasingly crucial topic and look forward to engaging internationally to ensure that ICT and Digital services are part of the solution, and not part of the problem."
        },
        {
            "text": " "
        }
    ]
}