{
    "url": "https://socialcare.blog.gov.uk/2021/06/28/a-safe-place-to-be-yourself/",
    "title": "A safe place to be yourself",
    "authors": [
        "Andrew Seed"
    ],
    "categories": [
        "Communities",
        "LGBT+ awareness",
        "LGBTQ+",
        "social work"
    ],
    "pub_date": "2021-06-28T15:28:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Evolving our response to identity"
        },
        {
            "text": "The world is changing. How we understand ourselves, our identities and our communities is changing, which means social work and mental health practices need to keep up."
        },
        {
            "text": "Society is moving towards accepting people of diverse gender and sexual identities, but still has a long way to go. There is a stigma which means many people from the LGBTQ+ community suffer invalidation, rejection, bullying or violence which targets individuals with diverse gender and sexual identity."
        },
        {
            "text": "Although anyone can experience mental health issues, those of us who identify as LGBTQ+ are more likely to develop problems including low self-esteem, depression and anxiety."
        },
        {
            "text": "As this month marks Pride Month, I would like to reflect on how Cygnet Hospital Ealing is creating a safe space for service users and staff to celebrate their gender and sexual identity."
        },
        {
            "text": "The hospital provides specialist eating disorder and personality disorder services for women over two separate wards. Our team works hard to create a cheerful, non-institutional environment, and to support individuals in their recovery and personal transformation."
        },
        {
            "heading": 2,
            "text": "Identifying need"
        },
        {
            "text": "Social worker Natalia Masternak and I saw there was a need on the ward to create a safe space for individuals who are trans, non-binary, queer, lesbian and gay to express and celebrate their identity, as well as talk through their struggles."
        },
        {
            "text": "The LGBTQ+ group consists of semi-structured weekly meetings, where group members can discuss their gender and sexual identity and consider common difficulties that they face. It is an opportunity for the residents to hear each other’s stories, developing what already seems to be a strong sense of empathy."
        },
        {
            "text": "We make a point of not making these sessions too structured. Many of the residents have a greater awareness and understanding of gender and identity. Younger generations have grown up at a time where identity is understood differently and often more inclusively. It is also a place for staff members to reflect on these themes and for staff, who identify as LGBTQ+, to therapeutically share some details of their struggle. Non-LGBTQ+ residents go along to hear people’s stories as allies."
        },
        {
            "text": "To learn more and offer an external perspective, we reached out for help from The Clare Project, a charity which supports transgender, non-binary and intersex people. Residents then had the chance to attend a session led by transgender community member, activist and LGBTQ+ awareness trainer Luka White (pronouns: they/them)."
        },
        {
            "text": "Luka shared details of their journey, specifically the experience of being LGBTQ+ and also being a mental health inpatient, and talked about the work The Clare Project does with people in Brighton and Hove. There was also an opportunity for people to ask questions and discuss difficulties they have had."
        },
        {
            "heading": 2,
            "text": "Feeling safe, supported, accepted"
        },
        {
            "text": "An important part of the group is supporting the development of a supportive and safe community. The Clare Project provided details of community groups some residents might wish to link up to upon discharge, so that they can, as Luka puts it, “find their tribe”."
        },
        {
            "text": "The group culminated in both wards coming together for a Pride event to celebrate and strengthen the community in the hospital. Residents and staff socialised, sang LGBTQ+ karaoke songs, ate rainbow cake baked by a resident and had a chance to unwind a little."
        },
        {
            "text": "Residents shared their journey and created art to express their journey and have their voice heard in ways that haven’t always been possible in their life."
        },
        {
            "text": "Co-facilitating the LGBTQ+ group with Natalia has been a humbling experience. I have reflected and learned from the resident’s stories. To hold a space where residents can express themselves in whatever way is meaningful for them can be healing and has been a great honour to experience."
        }
    ]
}