{
    "url": "https://dwpdigital.blog.gov.uk/2021/06/28/am-i-proud-of-lgbtq-pride-my-personal-thoughts-on-pride-month/",
    "title": "Am I proud of LGBTQ+ Pride? My personal thoughts on Pride month",
    "authors": [
        "Paul Graham, content designer"
    ],
    "categories": [
        "LGBT*"
    ],
    "pub_date": "2021-06-28T11:57:29+01:00",
    "content": [
        {
            "text": "June is Pride month – a time to recognise and celebrate the LGBTQ+ communities around the world - but what does it really mean? As someone that has experienced times that were a lot less tolerant than today, it’s something I consider every year at this time."
        },
        {
            "text": "Usually we see parades and rainbows, parties and happy smiling faces, although both this year and in 2020 many of those events have understandably had to move online. However, we mustn't forget that all this freedom, this living our lives without prejudice and discrimination has not come easy."
        },
        {
            "text": "Before the late 1960s, male homosexuality was illegal in the UK. Men, like me, could have been arrested, and many gay men often were. ‘Coming out’ was not a safe option and walking hand in hand with a partner of the same gender was seen as abhorrent. Strangely enough, lesbian acts have never been illegal, partly due to the fact that ‘it didn't exist’ according to those in charge!"
        },
        {
            "text": "The creator of Coronation Street, Tony Warren, described in his book ‘Behind Closed Doors’ how Manchester's Gay Village in the 1950s was just a dark, dank area of the city centre, \"full of ne'er do wells and vagabonds, out to rob and blackmail the gay men who frequented that area\"."
        },
        {
            "text": "Any bars and clubs within that familiar area, which is now a tourist attraction (oh, the irony!), had locked doors and covered windows. Admission was a furtive knock on the door and a nervous wait for a small window to slide open. A face would check you out - what for, I have no idea! - and maybe you'd be let in. Police raids were common in this area and arrests were devastating to the man and his family. He would certainly lose his job. Many committed suicide."
        },
        {
            "heading": 2,
            "text": "How life has changed"
        },
        {
            "text": "I’m lucky that I didn’t have to live through those times. In the UK I am free to express myself as a gay man, to be open and not have to hide a part of me that is so important. I can openly and happily discuss my sexuality at work and know that my friendly, amazing, kind, generous and loving team, just accept me for who I am. I can be proud of me and that LGBTQ+ bit of me. I am eternally grateful for those who have fought for my freedom, whether they’re part of the LGBTQ+ community or an ally supporting our cause."
        },
        {
            "heading": 2,
            "text": "Fighting back"
        },
        {
            "text": "The Sexual Offences Bill (1967) paved the way for change, but Pride marches and parades like we have today were still far off. One of the first UK Pride marches that I know of, happened in London in the early 1970s with around 150 attendees. They were stared at, bottles were thrown at them and they did fear for their lives. A good friend of mine still has the imprint on his forehead where an iron bar was thrashed down on him by a group of three ‘men’ after a march."
        },
        {
            "text": "We still had to stand up and insist that we were taken seriously. Back in the 1980s, the infamous Clause 28 legislation was passed which ruled that homosexuality should never be 'promoted', discussed or mentioned in schools. I vividly remember marching on the Clause 28 march in Manchester on 20 February 1988 - the biggest march that the city had ever seen - to show that we were 'Never Going Underground'. Albert Square was heaving, drag queens were hanging off the Town Hall parapets, the world's press was all over the place."
        },
        {
            "text": "Back then, I was a writer for a gay newspaper, so I was crowded in the stage area looking out at the most wondrous sight of all these passionate people saying 'NO'. I turned to casually kiss my boyfriend and suddenly we were aware of the media's camera lenses pointing our way. A thousand clicks, a thousand shouts to repeat the kiss. As if it was somehow something weird or unusual or wrong. \"What does it feel like to be gay?\" shouted one TV reporter. \"I feel patronised by your inane question\" I replied."
        },
        {
            "heading": 2,
            "text": "Looking forward..."
        },
        {
            "text": "The other day I happily filled out the application form for my community group to be part of Manchester Pride Parade. It's a hedonistic and mentally overpowering walk with a thousand others, watched by thousands of allies. And, usually, the occasional little group of chanters, to one side, who attempt to shout away our love. They never seem to learn that we sing louder - and prouder."
        },
        {
            "text": "Every time I walk on the parade, I have always been mindful of those that fought, and shouted, and cried, and died to make that all possible. And I think of those countries in our world, in 2021, where homosexuality is still a criminal offence. Where you can be hanged for being gay. Where you can be legally murdered for being transsexual. Where I could not write all these words in this blog."
        },
        {
            "text": "I'm proud of Pride and, yes, we should party and blow whistles and cover ourselves with glitter - all of us! Whether you are part of the LGBTQ+ community or if you are an important ally, it is a time to equally remember and celebrate. Wear a rainbow ribbon if you like. Change your MS Teams background! Just never forget."
        }
    ]
}