{
    "url": "https://insidehmcts.blog.gov.uk/2021/06/28/beyond-the-numbers-how-our-service-centres-are-making-a-real-difference/",
    "title": "Beyond the numbers – how our Service Centres are making a real difference",
    "authors": [
        "Zoe Blake"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2021-06-28T15:31:07+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 3,
            "text": "What makes you proud of your work?"
        },
        {
            "text": "I’ve thought a lot about this question recently, especially when hearing the various stories from NHS workers to teachers and shop staff, and how they’ve supported us during the pandemic."
        },
        {
            "text": "I’m a Delivery Director at HMCTS and feel very strongly about delivering a justice system that is fair, efficient, and accessible to all. As part of my role, I help set up Courts and Tribunals Service Centres (Service Centre). We established our first Service Centre in 2019, and we’ll shortly be opening a fourth."
        },
        {
            "text": "Ahead of that, I’ve been looking at some of the ways our Service Centres have helped people to access justice. They’ve now handled more than a million queries. And while that’s a very impressive figure, it’s the stories from real people that make me feel most proud. When people write in to say, \"You really, really listened and understood the stress and frustration that we were going through. This really helped\" – it’s clear that we’ve often supported people in a time of need."
        },
        {
            "heading": 3,
            "text": "What are Courts and Tribunals Service Centres?"
        },
        {
            "text": "Our Service Centres are central to HMCTS’ ambitious reform programme. The programme has been modernising our services since 2016 - providing new, user-friendly digital services and improving efficiency at the same time."
        },
        {
            "text": "We set up our first Service Centres in Birmingham and Stoke in 2019. A third opened in Loughborough last year. Each centre brings trained expertise together under one roof to provide support and guidance about cases. As such, they are the first port of call for anyone from legal professionals to public court users, who want more information on their case."
        },
        {
            "text": "The queries our staff deal with can range from questions on social security and child support, to calls and emails on probate and divorce."
        },
        {
            "heading": 3,
            "text": "How has this helped the justice system?"
        },
        {
            "text": "I think the biggest impact our Service Centres have had is in allowing us to respond to queries more quickly and reliably. Through setting up these centres we now have a centralised, trained team of staff dedicated to handling queries."
        },
        {
            "text": "This means we can offer a system that is more efficient and consistent than it was before. It also means that staff at courts and tribunals, who were previously handling these queries, are freed up to support the public and legal professionals during physical hearings. In terms of improvements, this has helped lead a notable reduction in digital case times. For example, a divorce carried out digitally can now be completed by 20 weeks on average from start to finish. If carried out on paper this would take around 75 weeks."
        },
        {
            "text": "We’re continuing to improve how our Service Centres work. A recent development is our webchat service as a further way that people can get in touch with us. This has proved to be immensely popular, with 90% of users rating it as ‘good’ or ‘very good’."
        },
        {
            "heading": 3,
            "text": "New systems, longer opening hours, future openings"
        },
        {
            "text": "Just last month we rolled out a new technology solution called Antenna. This system collects emails, webchats and calls on queries, and connects them together. The technology allows us to respond more effectively to demand, and will make our services more efficient. It provides better tools for our staff to handle queries, ensuring they always have the information they need at their fingertips, helping them provide a useful response as soon as a query comes in."
        },
        {
            "text": "Given the success of our centres, we’re expanding the services they offer and making sure they open for longer. Anyone who has a query about divorce, probate or social security and child support appeals, can now receive help from dedicated staff between 8am and 6pm Monday to Friday and from 8am to 2pm on Saturdays. Previously, the service centres were only open on weekdays between 9am and 5pm."
        },
        {
            "text": "We’re also opening a new Service Centre in Salford Quays, supporting the roll out of Common Platform - a digital case management system providing access to relevant information for all parties involved in criminal cases."
        },
        {
            "heading": 3,
            "text": "\"You made me feel that HMCTS was the best organisation around\""
        },
        {
            "text": "Perhaps the most impressive figure I’ve come across, is that in two years, our Service Centres have handled more than a million queries. That’s a huge number of people who we’ve helped at a time when they’ve needed it most."
        },
        {
            "text": "But for me, the numbers only tell half the story. It’s the real-world comments from people we’ve helped, which complete the picture. Here’s a few examples:"
        },
        {
            "text": "Of course, we don’t always get it right and there’s more to do. But from reductions in digital case times, to the percentage of people happy with our service, and the total number of queries we’ve handled – there’s no doubt that we’ve made a significant, positive difference."
        },
        {
            "text": "And to come back to my original question about pride in your work: I think it’s messages like these, from people we have helped that are in difficult situations, which show the real impact and importance of the work we do."
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Y darlun y tu ôl i’r ffigurau - sut mae ein Canolfannau Gwasanaethau yn gwneud gwahaniaeth"
        },
        {
            "text": "Gan Zoe Blake"
        },
        {
            "heading": 3,
            "text": "Beth sy’n eich gwneud chi’n falch o’ch gwaith?"
        },
        {
            "text": "Dwi wedi bod yn meddwl llawer am y cwestiwn hwn yn ddiweddar, yn enwedig ar ôl clywed straeon amrywiol gan weithwyr GIG, athrawon a staff siopau, a sut maent wedi ein cefnogi yn ystod y pandemig."
        },
        {
            "text": "Rwyf yn Gyfarwyddwr Cyflawni yn GLlTEM a chredaf yn gryf mewn system gyfiawnder sy’n deg, yn effeithlon ac yn hygyrch i bawb. Fel rhan o’m rôl rwy’n helpu i sefydlu Canolfannau Gwasanaethau y Llysoedd a’r Tribiwnlysoedd (Canolfannau Gwasanaethau). Mi wnaethom agor ein Canolfan Gwasanaethau gyntaf yn 2019, a byddwn yn agor y bedwaredd Ganolfan yn fuan."
        },
        {
            "text": "Rwyf wedi bod yn edrych ar rai o’r ffyrdd y mae ein Canolfannau Gwasanaethau wedi helpu pobl i gael mynediad at gyfiawnder. Maent bellach wedi delio â dros filiwn o ymholiadau. Tra bo hwn yn ffigur sylweddol, y straeon rwy’n eu clywed gan bobl sy’n gwneud i mi deimlo mwyaf balch. Pan fydd pobl yn ysgrifennu atom yn dweud - Mi wnaethoch wrando yn astud a deall y straen a’r rhwystredigaeth roeddem yn wynebu. Roedd hyn yn help mawr - mae’n glir ein bod wedi helpu pobl pan roeddent ein hangen ni."
        },
        {
            "heading": 3,
            "text": "Beth yw Canolfan Gwasanaethau y Llysoedd a’r Tribiwnlysoedd?"
        },
        {
            "text": "Mae ein Canolfannau Gwasanaethau yn ganolog i raglen ddiwygio uchelgeisiol GLlTEM. Mae’r rhaglen wedi bod yn moderneiddio ein gwasanaethau ers 2016 - gan ddatblygu gwasanaethau digidol sy’n hawdd i’w defnyddio ar yr un pryd â gwella effeithlonrwydd."
        },
        {
            "text": "Cafodd y Canolfannau Gwasanaethau cyntaf eu hagor ym Mirmingham a Stoke yn 2019. Yna agorodd y drydedd yn Loughborough flwyddyn diwethaf. Mae pob canolfan yn dod â staff hyfforddedig ac arbenigol at ei gilydd o dan un to er mwyn darparu cefnogaeth ac arweiniad wrth ddelio ag achosion. Yn hynny o beth, y canolfannau yw’r man galw cyntaf i unrhyw un, o weithwyr proffesiynol cyfreithiol i ddefnyddwyr llys cyhoeddus, sydd eisiau mwy o wybodaeth am eu hachos."
        },
        {
            "text": "Mae ein staff yn delio ag ymholiadau sy’n gallu amrywio o gwestiynau ynglŷn â nawdd cymdeithasol a chynnal plant, i alwadau ffôn neu negeseuon e-bost am brofiant ac ysgariad."
        },
        {
            "heading": 3,
            "text": "Sut mae hyn wedi helpu'r system gyfiawnder?"
        },
        {
            "text": "Credaf mai’r effaith fwyaf y mae’r Canolfannau Gwasanaethau wedi’i gael yw ein galluogi i ymateb i ymholiadau yn gyflymach ac yn fwy dibynadwy. Trwy sefydlu'r canolfannau hyn mae gennym dîm o staff canolog hyfforddedig sy’n ymrwymedig i ddelio ag ymholiadau."
        },
        {
            "text": "Golyga hyn ein bod yn gallu cynnig gwasanaethau sy’n fwy effeithlon a chyson. Golyga hyn hefyd bod gan staff y llysoedd a’r tribiwnlysoedd, a oedd yn y gorffennol yn delio â’r ymholiadau hyn, nawr amser i roi cymorth i’r cyhoedd a gweithwyr proffesiynol cyfreithiol yn ystod gwrandawiadau. O ran gwelliannau, mae hyn wedi helpu i arwain at ostyngiad nodedig yn yr amser a gymerir i ymdrin ag achosion a brosesir yn ddigidol. Er enghraifft, ar gyfartaledd gellir cwblhau ysgariad yn ddigidol o’r dechrau i’r diwedd o fewn 20 wythnos. Pe bai hyn yn cael ei wneud ar bapur byddai’r broses yn cymryd oddeutu 75 wythnos."
        },
        {
            "text": "Rydym yn parhau i wella sut mae ein Canolfannau Gwasanaethau yn gweithio. Un datblygiad diweddar ydi ein gwasanaeth ‘sgwrsio dros y we’ sy’n ffordd arall i bobl gysylltu â ni. Mae’r gwasanaeth hwn wedi bod yn hynod o boblogaidd, gyda 90% o ddefnyddwyr yn ei ystyried yn wasanaeth ‘da’ neu ‘da iawn’."
        },
        {
            "heading": 3,
            "text": "Systemau newydd, oriau agor hirach, datblygiadau pellach"
        },
        {
            "text": "Dim ond mis diwethaf mi wnaethom gyflwyno system dechnolegol newydd o’r enw Antenna. Mae’r system hon yn casglu negeseuon e-bost, sgyrsiau dros y we a galwadau ffôn am ymholiadau ac yna’n cysylltu nhw â’i gilydd. Mae’r dechnoleg yn caniatáu inni ymateb yn fwy effeithiol i’r galw, ac yn sicrhau bod ein gwasanaeth yn fwy effeithlon. Mae’n darparu offer gwell i’n staff ar gyfer delio ag ymholiadau, sicrhau bod yr wybodaeth sydd ei hangen arnynt wrth law bob amser gan eu helpu i ddarparu ymateb defnyddiol cyn gynted ag y daw ymholiad i mewn."
        },
        {
            "text": "O ganlyniad i lwyddiant ein canolfannau, rydym yn ehangu'r gwasanaethau maent yn eu darparu ac yn sicrhau bod eu horiau agor yn cael eu hymestyn. Gall unrhyw un sydd gydag ymholiad ynglŷn ag ysgariad, profiant neu apeliadau nawdd cymdeithasol a chynnal plant bellach gael cymorth gan staff ymroddedig rhwng 8am a 6pm dydd Llun - Gwener, a rhwng 8am a 2pm ar ddydd Sadwrn. Yn flaenorol, roedd y canolfannau ond ar agor yn ystod yr wythnos rhwng 9am – 5pm."
        },
        {
            "text": "Rydym hefyd yn agor Canolfan Gwasanaethau newydd yn Salford Quays, gan gefnogi’r platfform cyffredin (common platform) - system rheoli achosion digidol sy’n caniatáu mynediad at wybodaeth berthnasol i bob parti sy’n ymwneud ag achosion troseddol."
        },
        {
            "heading": 3,
            "text": "‘Gwnaethoch i mi deimlo mai GLlTEM oedd y sefydliad gorau’"
        },
        {
            "text": "Efallai mai’r ystadegyn mwyaf trawiadol dwi wedi dod ar ei draws ydi bod ein Canolfannau Gwasanaethau, mewn 2 flynedd, wedi delio â mwy na miliwn o ymholiadau. Mae hynny yn llawer iawn o bobl rydym wedi eu helpu ar adeg pan roeddent angen help fwyaf."
        },
        {
            "text": "Ond i mi, dim ond hanner y stori yw’r ystadegau. Y sylwadau go iawn rydym yn eu cael gan bobl rydym wedi’u helpu sy’n cwblhau’r darlun."
        },
        {
            "text": "Dyma rai enghreifftiau:"
        },
        {
            "text": "Wrth gwrs, nid ydym bob tro yn cael pethau’n iawn ac mae llawer mwy i’w wneud. Ond o ystyried y gostyngiad mewn amser wrth ddelio ag achosion yn ddigidol, i’r ganran o bobl sy’n hapus gyda’n gwasanaeth, a chyfanswm yr ymholiadau rydym wedi delio â nhw - nid oes amheuaeth nad ydym wedi gwneud newid sylweddol a chadarnhaol."
        },
        {
            "text": "I gyfeirio’n ôl at fy nghwestiwn cychwynnol am fod yn falch o’ch gwaith; credaf mai negeseuon fel y rhain gan bobl sydd mewn sefyllfaoedd anodd rydym wedi’u helpu, sy’n dangos gwir effaith a phwysigrwydd y gwaith rydym yn ei wneud."
        }
    ]
}