{
    "url": "https://phescreening.blog.gov.uk/2021/06/28/celebrate-the-first-international-neonatal-screening-day-today-28-june-2021/",
    "title": "Celebrate the first International Neonatal Screening Day today, 28 June 2021",
    "authors": [
        "Prof Jim Bonham"
    ],
    "categories": [
        "NHS Newborn and Infant Physical Examination",
        "NHS Newborn Blood Spot Screening Programme",
        "NHS Newborn Hearing Screening Programme"
    ],
    "pub_date": "2021-06-28T10:27:02+01:00",
    "content": [
        {
            "text": "It is more than 50 years since population newborn screening began. The NHS newborn screening programmes have provided life changing benefits for children who are identified and treated before the devastating effects of serious conditions such as phenylketonuria (PKU) can cause irreversible damage."
        },
        {
            "text": "During these 50 years, additional disorders which benefit from early detection and treatment have been added to the list of conditions screened for. Today, even more babies are identified in this way and go on to be treated successfully, reducing serious long-term health consequences and even premature death."
        },
        {
            "text": "Newborn screening has been a truly revolutionary milestone in public health."
        },
        {
            "heading": 2,
            "text": "Birthday of pioneering scientist Dr Robert Guthrie"
        },
        {
            "text": "Professional and patient organisations and health systems around the world are celebrating International Neonatal Screening Day for this first time today."
        },
        {
            "text": "The date of 28 June was chosen as it is the birthday of Dr Robert Guthrie – perhaps the most significant figure in the development of newborn screening as we know it today. He designed not just a test to identify PKU in asymptomatic babies, but also a means by which samples could be collected and transported safely and cheaply to laboratories for testing. This marked the dawn of the screening programmes that we still operate today."
        },
        {
            "text": "While much has been achieved, there is still much left to do. Many children born today still do not benefit from even basic newborn screening. In some other countries, while some testing does take place, the conditions covered remain limited to one or 2 disorders."
        },
        {
            "heading": 2,
            "text": "Spread the word"
        },
        {
            "text": "We hope International Neonatal Screening Day will:"
        },
        {
            "text": "Do join in spreading the news about newborn screening in your neighbourhood, region and country – there is so much to say and so much to celebrate!"
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}