{
    "url": "https://civilservicelocal.blog.gov.uk/2021/06/28/discover-opportunities-within-the-counter-fraud-profession/",
    "title": "Discover opportunities within the Counter Fraud Profession",
    "authors": [
        "jonathanagard"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-06-28T11:34:18+00:00",
    "content": [
        {
            "text": "The Government Counter Fraud Profession, in partnership with Civil Service Local, are delighted to provide you with the opportunity to participate in an interactive 2 day online event running on 13 and 14 July from 10:30 to 12 midday on both days."
        },
        {
            "text": "Please join us to hear our specialist speakers from across several Government departments speak on a range of topics covering counter fraud.  We encourage you to join both event days in order to capture the full advantages the sessions have to offer.  This event is open to all UK civil servants"
        },
        {
            "heading": 3,
            "text": "Background to Fraud"
        },
        {
            "text": "The Counter Fraud Profession was founded on 9 October 2018 and was developed to create counter fraud specialists to lead the way on how we deal with fraud."
        },
        {
            "text": "Fraud is a peculiar crime.  By its very nature, it is hidden and always evolving in response to changes in society, such as advances in technology.  It is also a constant threat to both individuals and organisations in all sectors.  In the public sector, fraud damages the services we provide that people rely on, and it can quite often ruin lives.  To fight it, we’ve got to find it; and to find it, we’ve got to build the right counter fraud capability across the Civil Service."
        },
        {
            "text": "The focus of this event will showcase a mixture of expert speakers who will raise awareness of some of the key elements of reducing fraud, protecting the public purse and its services, fighting economic crime, raising awareness of the counter fraud function, the professionalisation agenda and how these are implemented across government and beyond."
        },
        {
            "heading": 3,
            "text": "Day one:"
        },
        {
            "text": "Our speakers will be presenting sessions on:"
        },
        {
            "text": "You should book your place at this event if you are:"
        },
        {
            "heading": 3,
            "text": "Day two"
        },
        {
            "text": "We will look more closely at counter fraud work, with speakers from the frontline fight against fraud at Companies House and the Eastern Region Special Operations Unit (ERSOU)."
        },
        {
            "text": "You should book your place at this event if you:"
        },
        {
            "heading": 3,
            "text": "Online access requirements"
        },
        {
            "text": "Please read carefully before booking your tickets. Information provided is designed to ensure you are able to access the event successfully."
        },
        {
            "text": "Please register on Eventbrite with your departmental email address for security purposes and ensure you have permission from your line manager to attend. Please note that you must be able to access Microsoft Teams via the app or browser to join this online event. If you are unable to access this system on your work device you may wish to join using a personal device. All links will be sent at least 24 hours prior to the event. Please join the session at least 5 minutes before it is due to start."
        },
        {
            "text": "If your link does not arrive 24 hours before the event please email the contact on Eventbrite. Unfortunately, we will not be able to action any requests to provide links on the day of the event."
        },
        {
            "heading": 3,
            "text": "Remember, fighting fraud is everyone’s responsibility."
        },
        {
            "text": " "
        }
    ]
}