{
    "url": "https://civilservice.blog.gov.uk/2021/06/28/innovating-to-tackle-reoffending/",
    "title": "Innovating to tackle reoffending",
    "authors": [
        "Prison Leavers Project"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Civil Service Learning"
    ],
    "pub_date": "2021-06-28T14:28:29+00:00",
    "content": [
        {
            "text": "Reducing reoffending is the key to cutting crime. But what role can innovation play in tackling this issue? The Prison Leavers Project on how it’s trying new approaches."
        },
        {
            "text": "At the Ministry of Justice, we’re committed to cutting crime and the harm it causes to society by focusing on reducing reoffending. It’s a real problem. The most recent proven reoffending rate for adult offenders was 26.1%.  Although there’ has been a slight reduction in reoffending in 2020, every new instance crime has an unacceptable cost to society, totalling £18bn a year and creating more victims of crime. "
        },
        {
            "text": "Reoffending is a complex issue, driven by a combination of factors that can interact in different ways. These can include unemployment, homelessness, unstable family and community relationships, and addictions – among others. "
        },
        {
            "text": "To effectively tackle this challenge, we must consider and come up with new solutions. "
        },
        {
            "text": "£20m project"
        },
        {
            "text": "We know that reintegration into society plays a big part in a former prisoner turning their back on crime. The Prison Leavers Project is a £20m cross government project that aims to test new and innovative ways to support people leaving prison to turn away from crime and build productive lives. "
        },
        {
            "text": "The project seeks to bring in innovation at every point and build robust evidence on what really works well. So how are we embedding innovation?"
        },
        {
            "text": "Agile working"
        },
        {
            "text": "For us, this means having the flexibility to respond to new information and changing contexts. As we develop our interventions, we’ll be starting small, testing them rapidly and repeatedly, and adapting things where improvements can be made. "
        },
        {
            "text": "We will develop solutions around four four key areas: employability and skills; health and wellbeing; community and relationships; and the day of release from prison. These will then be tested on a small scale, through 'throw away' prototypes – so if they don't work, we either change them or try something else! The most promising solutions will gradually be scaled up, and as we learn we will continue to refine them."
        },
        {
            "text": "This means that we don’t yet know what the project’s final pilots will look like, because we’re going to be refining over the lifespan of the project, based on our own observations and ongoing evaluation findings.  "
        },
        {
            "text": "This makes sure we use our resources wisely by changing course and pivoting rapidly if something’s not working. By taking an agile approach which focuses on continuous learning and improvements, we will be able to build better interventions and develop more comprehensive evidence about what works - as well as what doesn’t! "
        },
        {
            "text": "Working with tech"
        },
        {
            "text": "We know that start-ups and SMEs bring huge potential for innovative thinking by creatively using new technology to address old problems. So we’re asking these smaller suppliers to apply dynamic thinking to key challenges in reoffending through the Prison Leavers Innovation Challenge. "
        },
        {
            "text": "We published six challenge statements (specific problems we know we want to address) and, through a SBRI (Small Business Research Initiative) competition, we called on start-ups and technology companies to suggest potential solutions. "
        },
        {
            "text": "For example, not having access to key things like ID and birth certificates prevents prison leavers from accessing jobs, housing and banking, increasing their likelihood of committing crime. So, one of the problems we want to solve is: how can we enable prison leavers to collect and share their data with the people that they need to?"
        },
        {
            "text": "The benefits"
        },
        {
            "text": "This kind of competition means we’re not funding ‘off the shelf’ products or services – we’re investing in the development of innovative ideas that have been custom-made to address our challenges. "
        },
        {
            "text": "Through the competition, we will seed-fund 10 start-ups to build a prototype before selecting the most promising solutions to run a pilot. Applications for the Prison Leavers Innovation Challenge closed on 16 June, and the 10 SMEs selected to build prototypes will be funded later this year!"
        },
        {
            "text": "Hybrid teams"
        },
        {
            "text": "Prison leavers interact with lots of government departments, third sector and local organisations. We’ have built in the valuable and diverse perspectives that these kinds of organisations can bring to the challenge of reoffending. "
        },
        {
            "text": "How? With dedicated secondments into our team. Our colleagues come from a wide range of organisations, from the Department for Work and Pensions to NHS England!"
        },
        {
            "text": "As well as diverse expertise and views, our teams also incorporate factor in a range of professional skills – such as policy, user research and service design. By curating hybrid teams with broad expertise, we’re creating a fertile rich environment for sharing learning from across the entire system, and developing new ideas to address the challenges faced by prison leavers which drive reoffending. "
        },
        {
            "text": "Evaluation techniques"
        },
        {
            "text": "Learning as we go is at the heart of our approach. We’ve contracted a consortium of TONIC Consultants and the University of Kent to conduct our evaluation of the project. "
        },
        {
            "text": "They will regularly feed findings back to the team, and work with us to determine if the project and its interventions are effective in improving outcomes for prison leavers. "
        },
        {
            "text": "The evaluation will use a toolkit of innovative methodologies to evaluate the project and capture the diverse experiences of prison leavers in a variety of ways. "
        },
        {
            "text": "Get involved"
        },
        {
            "text": "Our focus on learning runs both ways. Ultimately, we want to be able to add to the existing evidence base of ‘what works’ to cut reoffending and share learnings about our journey that other people can apply to their own work. But, equally, we’re keen to hear from as many people and perspectives as possible to help build our understanding.  "
        },
        {
            "text": "We’re working openly to learn as much as we can from other people and projects. We are always on the lookout for opportunities to collaborate and share knowledge, so if you or any of your colleagues have worked in similar ways or on similarly complex problems, then we’d like to hear from you."
        },
        {
            "text": "Get in touch by emailing: prisonleaversproject@justice.gov.uk."
        }
    ]
}