{
    "url": "https://naturalengland.blog.gov.uk/2021/06/28/natural-england-licensing-statistics-for-2020/",
    "title": "Natural England licensing statistics for 2020",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Licensing"
    ],
    "pub_date": "2021-06-28T13:28:08+01:00",
    "content": [
        {
            "text": "As explained in my blog in January 2020, Natural England remains committed to making our wildlife licensing statistics publicly available. We published our 2018 and 2019 stats last year."
        },
        {
            "text": "We get a lot of correspondence and public reaction around our licensing role, and our role is often misunderstood.  It is our job to issue licences for things that would otherwise be against the law.  Members of the public or organisations apply to us and we apply rigorous criteria to these applications. More information on our licensing role can be found in my 2020 blog."
        },
        {
            "text": "Unfortunately, we are a little later publishing our statistics for 2020. It’s been a very busy time for licensing applications as we emerge from lockdown and local elections delayed our original publication plan. However, we are now very pleased to be able to publish our annual licensing statistics for 2020 and share these publicly."
        },
        {
            "text": "We have also provided an updated summary table of bird licences issued between 2014 and 2020. This contains numbers of individuals that would be the maximum allowed under those licences."
        },
        {
            "text": "The 2014-2020 summary table does include multiple licence numbers for some sites. However, it is important to explain that only one licence can be used per site. In the summary table, you will find licences that have been modified or amended includes a prefix such as -1. All previous versions of that licence will therefore be superseded, and it does not result in a doubling of licensed numbers."
        },
        {
            "text": "In our 2020 summary, the licences again fall into four main categories:"
        },
        {
            "text": "The summary does not include licences issued under the Protection of Badgers Act 1992 for the purpose of the prevention of the spread of disease as these are covered in detail elsewhere."
        },
        {
            "text": "In our licensing summary, you will note again that we have issued licences for a wide range of species and licensing purposes. We do acknowledge that some of the licences we issue are for the lethal control of bird species which are of conservation focus in England."
        },
        {
            "text": "However, we do not take these instances lightly and our staff apply rigour and expertise when assessing applications of this nature. A successful applicant must clearly demonstrate – with supporting evidence – that these five tests can be met:"
        },
        {
            "text": "In 2020, we have authorised the removal of individual birds (or their nests) for some of the following instances. Where they are a risk to transport or power supply infrastructure; the protection of food production premises from bird faeces when other measures are not possible, the shooting of cormorants alongside scaring to protect inland fisheries; and the removal of birds that are presenting a risk to aircraft safety at an airport."
        },
        {
            "text": "We acknowledge there is a lot of information within our summary table and this blog. For further information please contact us enquiries@naturalengland.org.uk"
        }
    ]
}