{
    "url": "https://insideDIO.blog.gov.uk/2021/06/28/nominate-a-project-for-the-sanctuary-awards/",
    "title": "Nominate a project for the Sanctuary Awards!",
    "authors": [
        "Richard Brooks"
    ],
    "categories": [
        "Accommodation",
        "Climate Change",
        "Sanctuary Awards"
    ],
    "pub_date": "2021-06-28T10:22:44+00:00",
    "content": [
        {
            "text": "The Silver Otter, given to the overall winner. [Crown Copyright/MOD2017]Nominations for the MOD Sanctuary Awards close on 31 July and we’re looking for entries in the Net Zero and Resource Efficiency Award as well as the Sustainable Procurement and Construction Award."
        },
        {
            "text": "The Sanctuary Awards showcases MOD’s commitment to a sustainable estate and recognises groups and individual commitments to sustainability, energy saving measures, wildlife, archaeology, conservation, and environmental protection throughout the Defence estate."
        },
        {
            "text": "The award categories reflect the MOD’s sustainability agenda and demonstrate MOD’s commitment to its climate change, environmental and sustainability goals. We’re looking for nominations in the following specific categories."
        },
        {
            "heading": 2,
            "text": "Net Zero and Resource Efficiency Award "
        },
        {
            "text": "These are projects that contribute to the MOD’s Net Zero Carbon ambition, reduce energy, water or resource consumption, renewable energy, or recycling. Here are some examples of winning projects that would fit into this category."
        },
        {
            "heading": 4,
            "text": "Combined Heat and Power Plant Project "
        },
        {
            "text": "The combined heat and power plant was vital to accommodating the arrival of the Queen Elizabeth Class Carriers without driving energy demand to an unsustainable level. A new power management system was developed, and since going live in October 2019, the plant has reduced energy bills by more than £4 million in its first year."
        },
        {
            "heading": 4,
            "text": "Defence innovation Software Defined Electricity Project"
        },
        {
            "text": "Software Defined Electricity is a technology that corrects the electrical supply using artificial intelligence. The MOD were the first organisation to take part in test trials to use the system last February."
        },
        {
            "text": "Results showed that it could reduce the usage of electricity by 25% across a site and result in £44m of energy savings for the MOD per year. This would also result in the reduction of greenhouse gas emissions by 112,107 tonnes."
        },
        {
            "heading": 2,
            "text": "Sustainable Procurement and Construction Award"
        },
        {
            "text": "These are projects that improve sustainability of equipment or services, management of supply chains or product life cycles or new build construction and refurbishment projects that innovate in fields such as new materials or design."
        },
        {
            "heading": 4,
            "text": "Princess Royal and Victory Jetties Project"
        },
        {
            "text": "Last year the Princess Royal and Victory Jetties project at her Majesty’s Naval Base (HMNB) Portsmouth won the Sustainable Construction Award for the reconstruction work to accommodate the Royal Navy’s two new aircraft carriers."
        },
        {
            "text": "Sections of the existing jetties were demolished and replaced with modern structures. New infrastructure was installed, including navigational aids and high voltage power supplies to power the carriers when they are berthed."
        },
        {
            "heading": 4,
            "text": "Corrugated Board for use in Military Level Packaging Project"
        },
        {
            "text": "This project sought to update the Defence standard, which sets the policy for corrugated materials used in military level packaging which had become outdated. The project originally used virgin cardboard grades that were unique to the MOD risking a pricing premium for the materials, alongside lead-time issues for supply. The new modernised approach gives greater scope for the use of commercially available materials in corrugated Defence packaging, maximising the utilisation of recycled cardboard to help support MOD’s Greening Government Commitments."
        },
        {
            "heading": 4,
            "text": "Modular Build Project "
        },
        {
            "text": "Air source heat pumps provide part of the building's heating and energy requirements. [Copyright: Landmarc Support Services]Our industry partner Landmarc and contractor Reds10 worked in partnership with us to"
        },
        {
            "text": "deliver carbon efficient accommodation blocks at Westdown Camp on Salisbury Plain as part of the MOD’s £45m Net Carbon Accommodation Programme."
        },
        {
            "text": "The new accommodation blocks are fitted with high-tech features such as air source heat pumps and rooftop solar panels, providing the building’s heating and energy requirements. The project scored only 12 on the A-rated Energy Performance Certificate, making it a nearly zero emissions building. Using SMART technology, three new accommodation blocks at Nesscliff Training Area, also received a score of -5, meaning the building can generate power for the site, reducing electricity costs. This technology will continue to drive improvements to the design to ensure all future buildings are carbon neutral."
        },
        {
            "text": "You can find more examples of award winners in the Sanctuary Magazines. Find out more about the award categories and how to nominate on the Sanctuary Awards GOV.UK page."
        }
    ]
}