{
    "url": "https://aphascience.blog.gov.uk/2021/06/28/scientific-input-for-key-defra-publication/",
    "title": "Scientific input from APHA in key Defra publication",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2021-06-28T14:16:04+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Defra Group Research and Innovation Interests published"
        },
        {
            "text": "On the 22 June, with scientific input from APHA and the seven other Defra Group Public Sector Research Establishments (PSREs), Defra published the refreshed Defra Group Research and Innovation Interests (DGRIIs), previously named Departmental Areas of Research Interest (ARIs) which was first published in 2017."
        },
        {
            "text": "The DGRIIs incorporate the breadth of Defra Group’s high-level research and innovation interests which are needed to inform its programmes and policies. These policies rely on the extensive specialist research expertise provided by APHA and the other PSREs to ensure they are current and relevant. This publication will help realise the goals set out in important government strategies and help Defra take account of EU Exit, international engagement, innovation opportunities and be prepared for future pandemics."
        },
        {
            "text": "Research to address these Defra Group research interests is delivered by a range of organisations and people. Some of which is undertaken in PSREs, such as APHA, but also a broad range of universities, research institutes, industries and industry bodies, charities and volunteer organisations, and with other Government departments. At APHA, we routinely work in collaboration with a number of these sectors across our many scientific portfolios to deliver our world-renowned scientific outputs."
        },
        {
            "text": "Defra benefits from the excellence of APHA science and research and many integral aspects of APHA work are highlighted within this document. Notably, areas such as: One Health including: work on a range of zoonotic diseases; minimising the risk of plant and animal disease import to the UK; antimicrobial resistance; surveillance to ensure the risk of large-scale epidemics or pandemics in animals, plants and humans are minimised; and endemic disease research such as in bovine TB."
        },
        {
            "text": "The DGRII publication is not a statement of the specific research that Defra will commission itself but is a broader outlook; aiming to motivate research and innovation investment across the UK research and development landscape in areas of importance to the Department."
        },
        {
            "text": "This publication has also been influenced by the substantial unrest of the COVID-19 outbreak and includes early consideration of the new and altered research needs that will arise. You may like to read more about APHA’s involvement in the COVID-19 pandemic and how our staff adapted and transferred their skills to assist in the national testing response in a series of blogs written over the past year."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Want to know more?"
        },
        {
            "text": "If you would like to know more, all enquiries related to this document should be directed to research.interests@defra.gov.uk."
        }
    ]
}