{
    "url": "https://nationalscreening.blog.gov.uk/2022/02/10/child-family-cascade-screening-for-familial-hypercholesterolemia/",
    "title": "Child-family cascade screening for familial hypercholesterolemia",
    "authors": [
        "Catherine Joynson",
        "Prof Roger Brownsword",
        "Prof Anne Slowther"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-02-10T14:10:37+00:00",
    "content": [
        {
            "text": "As part of our work to develop a new approach to ethics to help guide the work of the UK National Screening Committee (UK NSC), we tested the proposals by looking at family cascade screening for familial hypercholesterolemia (FH)."
        },
        {
            "text": "FH is a condition where the body has a high amount of cholesterol. This causes cardiovascular problems which can lead to serious illness and death."
        },
        {
            "heading": 2,
            "text": "Childhood screening for familial hypercholesterolemia"
        },
        {
            "text": "Childhood screening for FH is a potential strategy for identifying and offering early treatment to more people with FH. To date, the UK NSC has not recommended this due to uncertainties about the optimal age for screening and the potential benefits and harms."
        },
        {
            "text": "The last UK NSC evidence review on childhood screening for FH highlighted that there had been little consideration of the ethical issues it raises. To address this gap, the UK NSC set up an ethics task group to carry out and trial our ethical analysis process. The task group included people with expertise in paediatrics, genetics, public health, ethics and social science, and a patient representative."
        },
        {
            "text": "The purpose of the ethics task group was to:"
        },
        {
            "text": "The findings are also intended to inform the direction of a planned NHS England & Improvement (NHSEI) service evaluation of child-family cascade screening for FH in 1 to 2 year olds, to be delivered through Academic Health Science Networks."
        },
        {
            "heading": 2,
            "text": "Ethical questions"
        },
        {
            "text": "The ethics task group identified a number of ethical questions raised by this screening strategy, many of which apply to childhood screening programmes that involve genomic testing more broadly."
        },
        {
            "text": "These include questions about how the benefits of screening for the wider family should be taken into consideration in decisions about childhood genomic screening and whether it is acceptable to have a significant time delay between a childhood screening test and the age of eligibility for effective interventions."
        },
        {
            "text": "To inform the group’s discussions, we reviewed international guidance on childhood genomic screening and held a series of meetings with people with a professional and personal interest in FH screening."
        },
        {
            "text": "The findings of a public dialogue on the implications of whole genome sequencing for newborn screening were also considered by the group. The public dialogue was commissioned by the UK NSC, Genomics England and UKRI’s Sciencewise programme."
        },
        {
            "text": "The ethics task group has published its findings in a report. The report presents a discussion of the ethical questions with reference to the UK NSC’s ethical principles for screening, and considerations to inform future UK NSC recommendations. These include:"
        },
        {
            "text": "The work also highlighted important gaps in the evidence, such as the benefits and harms arising from dietary interventions in 1 to 2 year olds with FH."
        },
        {
            "text": "The ethics task group report will inform future UK NSC recommendations on childhood or child-family cascade screening for FH. The next review of this topic is due in 2023 to 2024. NHSEI is also reviewing the findings."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}