{
    "url": "https://deframedia.blog.gov.uk/2022/02/10/consultations-launched-on-bathing-water-status-for-isle-of-wight-and-oxford-sites/",
    "title": "Consultations launched on bathing water status for Isle of Wight and Oxford sites",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-02-10T11:43:03+00:00",
    "content": [
        {
            "text": "There has been coverage today in The Telegraph, Guardian, Sky News and ENDS Report about plans announced yesterday (9 February) for two popular swimming areas in the Isle of Wight and the River Thames in Oxford to be designated bathing waters."
        },
        {
            "text": "The area in the Isle of Wight under consideration is East Cowes Esplanade on the north coast of the island, and the area in Oxford under consideration is Wolvercote Mill Stream on the River Thames at Port Meadow."
        },
        {
            "text": "If the applications are successful, it means the sites would be monitored regularly during the bathing season, which in England runs from 15 May to 30 September, for bacteria detrimental to human health."
        },
        {
            "text": "Local residents are invited to give their views on the respective sites until 2 March before the responses are reviewed and a final decision is made by the Environment Secretary."
        },
        {
            "text": "Any surface water can be designated as a bathing water if it is used by a large number of people and meets the requirements for designation. Designation does not indicate that the water quality is of bathing water standard as that is not considered in the assessment. There are currently 419 designated bathing waters in England."
        },
        {
            "text": "If designated, the Wolvercote Mill Stream in Oxford would become the second river with bathing water status in England after part of the River Wharfe at Ilkley was designated in December 2020."
        },
        {
            "heading": 4,
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "The consultations to designate Wolvercote Mill Stream and the East Cowes Esplanade as bathing waters are open to the public until 2 March 2022."
        }
    ]
}