{
    "url": "https://dragonsden.blog.gov.uk/2022/02/10/dragons-den-episode-6-series-19/",
    "title": "Dragons' Den, Episode 6, Series 19",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Confidentiality",
        "IP",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2022-02-10T21:03:01+00:00",
    "content": [
        {
            "text": "Tensions ran high this evening as the Dragons clashed horns and entrepreneurs fought fiercely to sell their business concepts and secure investment. But with high tension comes great products, and the first entrepreneurs to enter the Den certainly had something unique to offer."
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "heading": 3,
            "text": "Not money down the drain"
        },
        {
            "text": "Globetrotting duo Giorgia and Eli pitched their product, Wype, a gel which turns ordinary toilet paper into a wet wipe, whilst ensuring that the paper is still biodegradable. They were asking for £50,000 for 2% of their business."
        },
        {
            "text": "Giorgia stated the shocking fact that in the UK, 11 billion wet wipes are flushed away each year, which leads to blockages throughout our sewers. Like the Dragons, I was horrified by the ‘fatberg’ they brought into the Den. If there’s a solution to this issue, then my ears are open."
        },
        {
            "text": "Green queen Deborah Meaden was quick to ask the entrepreneurs how they fared against their competitors. Despite their strong argument that their product was unique, Deborah wasn’t so sure."
        },
        {
            "text": "If their product is unique, how can Giorgia and Eli ensure it is protected against any copycats?"
        },
        {
            "text": "Our blog about trade secrets explains what they are and how to keep your trade secrets safe."
        },
        {
            "text": "Keen to add to his baby business portfolio, Touker Suleyman made Wype an offer. But the early promise of a good relationship was soon wiped away, as the duo weren’t keen on taking the business in that direction."
        },
        {
            "text": "It wasn’t long until Touker had another opportunity to expand his baby business portfolio, though."
        },
        {
            "text": "Businesswoman and mother Sofie Hepworth pitched her business ‘BySofie’, and her invention, Little Hoppa. She asked for an investment of £75,000 for 5% of her business."
        },
        {
            "heading": 3,
            "text": "A wobbly start"
        },
        {
            "text": "After demonstrating her high-quality, eco-friendly baby bouncers, the Dragons wanted to know more about her business. They didn’t hold back when asking Sofie to break down all her business expenses."
        },
        {
            "text": "Sofie mentioned that some of her expenses had been invested on intellectual property. A quick search on our trade mark register shows that she registered trade marks for the Little Hoppa and By Sofie brands."
        },
        {
            "text": "A trade mark costs £170 online with a £50 extra charge for each additional class."
        },
        {
            "text": "Back to the Den, the Dragons had a whale of a time testing out the baby bouncer, luckily there were no breakages! After Sara Davies and Deborah Meaden expressed concern about the price of the product, Touker Suleyman made her a fierce offer, asking for 45% of the business which Sofie accepted. Happy faces all round!"
        },
        {
            "text": "Find out more about how to apply for a trade mark in our quick video."
        },
        {
            "heading": 3,
            "text": "The perfect blend for an offer?"
        },
        {
            "text": "I spend my working days alternating between coffee and various teas, so a product which could combine the two in a healthy way would be perfect for me."
        },
        {
            "text": "The final entrepreneurs to face the Dragons were Zain Peer and Shez Shaikh. They were pitching their business London Nootropics, selling adaptogenic coffee blends. With the promise to give you the caffeine buzz without the crash and jitters, they had both the Dragons and viewers on the edge of their seats."
        },
        {
            "text": "Deborah Meaden asked just the question I was asking-what is an adaptogen?"
        },
        {
            "text": "After looking it up, I’ve found that they are a herb or mushroom which are thought to have many health benefits. After doing a search on patent search service, Espacenet, I found that there are many patents for adaptogens, most have been filed at the Federal Service for Intellectual Property in Russia."
        },
        {
            "text": "The Dragons weren’t easily convinced and started to drop out. But keen to not let this opportunity pass, the pair made a persuasive case about their alternative marketplaces. Their ambition convinced both Deborah Meaden and Sara Davies, securing London Nootropics a deal. Congratulations!"
        }
    ]
}