{
    "url": "https://taxagents.blog.gov.uk/2022/02/10/hmrc-performance-update-solid-progress-in-a-year-of-recovery/",
    "title": "HMRC performance update: solid progress in a year of recovery",
    "authors": [
        "geoffgreensmith"
    ],
    "categories": [
        "News and Updates"
    ],
    "pub_date": "2022-02-10T11:58:51+00:00",
    "content": [
        {
            "text": "Today we have published our quarter 3 performance update, covering October to December 2021, and our monthly performance data for December 2021."
        },
        {
            "text": "Our latest figures show us making solid progress during a year of recovery, as the UK economy emerges from the impact of the COVID-19 pandemic."
        },
        {
            "text": "Over the course of the pandemic, we made choices about the work we prioritised in order to protect our essential services and the livelihoods of our customer groups who need it the most. We prioritised the COVID-19 support schemes, the UK’s smooth transition from the European Union and the essential services that keep the tax system running."
        },
        {
            "text": "These urgent priorities meant that some of our customer service levels weren’t where we would normally expect them to be – although we’ve also seen some of the highest-ever levels of customer satisfaction with our services, particularly our digital services (82.6% so far this financial year, as of December 2021)."
        },
        {
            "text": "In the first half of the financial year, we stabilised our phone service and our tax credits and Child Benefit services, while we maintained our Customs services well within targets and supported the smooth running of the COVID-19 support schemes until they closed in October 2021."
        },
        {
            "text": "Now that the bulk of COVID-19 schemes activity has been delivered, we’ve been able to move more resources back into our core tax activities, and we’ve added further capacity through temporary recruitment."
        },
        {
            "text": "We’re working through the stocks of post that built up over the past year and keeping our helpline service levels stable. We’ve also successfully handled the introduction of EU full customs controls on 1 January 2022 and supported more than 10.2 million people to meet this year’s Self Assessment return deadline on 31 January 2022."
        },
        {
            "text": "We’re still supporting customers who are experiencing financial difficulty as a result of the pandemic. For the second year running, we announced the waiving of late filing and payment penalties for Self Assessment customers for one month. We also provided Time to Pay allowances for the hospitality and leisure sectors. Since 5 April 2021, more than 30,000 taxpayers have used the self-serve Time to Pay service online to manage their Self Assessment liabilities, totalling around £75 million."
        },
        {
            "text": "We understand the frustrations of customers and agents who have been waiting longer than normal for us to deal with their individual enquiry. We are genuinely sorry that we haven’t got to everyone more quickly – and thank you for bearing with us during this period."
        },
        {
            "text": "Managing customer correspondence and phone calls"
        },
        {
            "text": "We expect to be delivering normal (pre-pandemic) performance across our core service lines by the start of the new financial year."
        },
        {
            "text": "We’re on track to reduce our post stock to around 2 million by the end of the quarter 4, which would be back to pre-pandemic levels. To put that into context, it’s around 4 weeks’ work. Given the volume of post we receive (1.8 million items in a typical month and well over 2 million in peak months), it’s normal for us to have large volumes on hand at any given time."
        },
        {
            "text": "In December, we ran a successful trial reducing the hours on some of our telephony services so we could dedicate the time to working through customer correspondence that has built up over the past year. We closed our Value Added Tax (VAT) (with the exception of the bereavement line), and Corporation Tax phone lines on 3,10 and 17 December."
        },
        {
            "text": "By dedicating colleagues to post queues, we were able to focus on processing Corporation Tax repayments and VAT post which have been particular areas of concern for customers and agents. We made solid progress and worked through 14,000 post items, while maintaining our overall telephony performance."
        },
        {
            "text": "We have also paused most of our webchat for 3 months from Tuesday 4 January 2022 to allow us to fully review these services. We know that webchat is most effective when we use it to educate and coach customers in using our digital tools but less efficient when supporting customers with complex queries, so we are reviewing how we use it to make sure we are helping our customers in the most effective way possible."
        },
        {
            "text": "We have also improved and stabilised our post turnaround times compared to the beginning of the financial year, by focusing on priority areas. For PAYE customers, we cleared 512,000 outstanding repayment cases between April and December to repay customers any tax they’d overpaid the previous year, reducing online turnaround times from 35 days in April to three days by August. The service is now being maintained at pre-pandemic levels. We’ve also cleared work queues relating to issuing Unique Tax References and restored online turnaround times to 10 working days or fewer."
        },
        {
            "text": "We are on track to have cleared our existing stock of claims for tax relief on work expenses in March, by which time we expect to be delivering normal turnaround times of around 15 working days. We are already back within expected turnaround times for P87s submitted online."
        },
        {
            "text": "For Corporation Tax, we expect to have returned to normal turnaround times of 15 working days (3 weeks) by the end of March - down from 24 weeks at its peak."
        },
        {
            "text": "We reduced the wait time for VAT registration service from 14 weeks in June to the normal 6 weeks in November (around 15 days for us to process each case and 15 days in which the customer can respond)."
        },
        {
            "text": "Our focus on working through post that had built up over the course of the pandemic, means that during quarter 3 we were still taking longer than normal to turn around newly received post. Overall, the amount of customer post we turned around within 15 working days in quarter 3 was 43.4%. As we bring our stocks of post on hand back to normal levels, our turnaround times will improve."
        },
        {
            "text": "We’re making good progress in stabilising our phone services. The percentage of calls answered has gone up to 82.3% in quarter three from an average of 74.2% in quarter one."
        },
        {
            "text": "We’ve also reduced the average speed of answer on our phone lines from a high of around 15 minutes in the final quarter of last year down to around 10 minutes in quarter 3. In December, average waiting times dropped to 9 minutes – and within this, customers on many of our helplines were experiencing shorter wait times. For example, average wait times on our personal tax and debt management lines were between 7 and 8 minutes in December – and in the same month we took around 6 minutes and 5 minutes respectively to answer National Insurance and PAYE customers."
        },
        {
            "text": "Collecting tax revenue"
        },
        {
            "text": "The pandemic had a significant impact on our debt balance, much of which was due to the choices the government made to support customers by temporarily deferring payments. We know that some customers remain in uncertain financial circumstances, and we take a compassionate and common-sense approach to dealing with tax debts."
        },
        {
            "text": "Despite these circumstances, the debt balance has dropped from its peak as customers have started to pay these deferred liabilities. We have succeeded in reducing our overall debt balance from a peak of £72 billion at the height of the pandemic to under £40 billion now."
        },
        {
            "text": "We’re continuing to support people to pay where they can, including through affordable instalment plans - nine out of ten of which complete successfully. But we are also using enforcement powers if customers are unwilling to discuss a payment plan, or they ignore our attempts to contact them – and will consider taking insolvency action where appropriate, but only as a last resort."
        },
        {
            "text": "The economic impact of the pandemic has inevitably affected compliance yield (the additional revenue we collect from our compliance activity). It dropped to £30.4 billion in 2020 to 2021, compared to £36.9 billion in the previous year – partly due to there being two large litigation wins in 2019 to 2020, but also due to the unprecedented economic circumstances and decisions we took to defer some compliance activity and redeploy staff to customer service work on COVID-19 schemes."
        },
        {
            "text": "Our latest figures show that by the end of quarter 3 we had secured £17.4 billion in compliance yield - still lower than its usual pre-pandemic level but higher than the £17 billion secured by the same point last year and keeping us on track for a similar compliance yield total as last year."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "Looking ahead to quarter 4 and the next financial year, we will continue investing in improvements to our customer service."
        },
        {
            "text": "As the UK recovers from the pandemic, we’ll be using the funding we received in the latest government Spending Review to focus on supporting businesses and individuals to adapt to a changing economy, while continuing to bring in vital tax revenue for our public services."
        },
        {
            "text": "Our plans and investment will be about building a trusted, modern tax and customs department. We want to build a digital tax system that operates in real time: for example,"
        },
        {
            "text": "• developing Single Customer Accounts that allow taxpayers to view all their tax affairs in one place,\n• making it quicker and easier to process payments,\n• delivering sustainable improvements to our core IT systems and infrastructure, and\n• making smarter use of data - safely, and securely - to improve customer service and protect tax revenue."
        },
        {
            "text": "Above all, we’ll continue to be on the side of our customers when they’re trying their best to get things right, while tackling the small minority who set out to cheat the system."
        }
    ]
}