{
    "url": "https://vmd.blog.gov.uk/2022/02/10/how-well-do-you-treat-your-bees/",
    "title": "How well do you treat your bees?",
    "authors": [
        "Helen Swift"
    ],
    "categories": [
        "Bees"
    ],
    "pub_date": "2022-02-10T15:11:20+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Six things all beekeepers need to know about medicines"
        },
        {
            "text": "Helen Swift, Veterinary Assessor, talks about 6 things all beekeepers need to know about medicines."
        },
        {
            "heading": 2,
            "text": "Effectively managing disease and parasites in your hives"
        },
        {
            "text": "Using a combination of management methods and medicines in the right proportions is crucial. It is also important to follow label instructions of medicines carefully. Parasites can become resistant to treatments following repeated or improper use."
        },
        {
            "heading": 2,
            "text": "Vets and Bee Inspectors: how can they help you"
        },
        {
            "text": "Bee Inspectors are experienced beekeepers trained in the recognition and control of pests and disease. They can help you identify issues and a course of action as well as provide training and advice on apiary management and good husbandry practice."
        },
        {
            "text": "The British Bee Veterinary Association (BBVA) can help you find a vet who can help. In addition to the services Bee Inspectors offer, vets can prescribe medicines or import them for you if there is no authorised bee medicine available."
        },
        {
            "heading": 2,
            "text": "It’s illegal to use medicines not specifically approved for bees, unless prescribed by a vet"
        },
        {
            "text": "If there is an authorised medicine available in the UK, you must use it. You can find them via the Product Information Database (PID) by searching for bees under species. If there is no suitable medicine, you could get a vet to import or prescribe a product for you."
        },
        {
            "text": "You cannot buy medicines or substances from outside of the UK yourself."
        },
        {
            "text": "It could harm you or your bees to use homemade or unauthorised medicines because we do not know if they are safe. Speak to a vet or a Bee Inspector if you are unsure."
        },
        {
            "heading": 2,
            "text": "Food safety and the potential for medicines residues in your honey"
        },
        {
            "text": "As a food producer, you are responsible for the quality and safety of your honey.  You must use medicines properly and keep good records to help you identify treated bees and recall batches if necessary, to prevent harmful residues from being eaten."
        },
        {
            "text": "You can download a Veterinary Medicines Administration Record template, under ‘Fact Sheets’ from the National Bee Unit."
        },
        {
            "heading": 2,
            "text": "Reporting reactions or when medicines don’t work"
        },
        {
            "text": "If you experience or see a side effect from using a medicine, or if you think it didn’t work, you should report this to the company that makes the product (Marketing Authorisation Holder) or to the Veterinary Medicines Directorate, even if it is already mentioned in the medicine leaflet. You can also report problems using medicines, for example if it was difficult to follow dosing instructions."
        },
        {
            "text": "The VMD uses this information to continually assess the safety and effectiveness of products authorised in or imported to the UK. Action can be taken, such as adding warnings or safety advice to packaging or suspending products until the problem is resolved."
        },
        {
            "heading": 2,
            "text": "Why use authorised medicines"
        },
        {
            "text": "Medicines authorised for use in bees have been assessed to make sure they are safe for you and your bees, are quality products, and are proven to work. They also come with instructions so that you know you are getting the timing, application, and dosing right."
        },
        {
            "text": "Using products not authorised or prescribed for the purpose you are using them is illegal and may be unsafe. This includes buying tubs of active ingredients on the internet."
        },
        {
            "text": "Buying authorised medicines will support the continued investment in bee medicines research and production  Use our Product Information Database to search for details about authorised medicines."
        },
        {
            "text": " "
        }
    ]
}