{
    "url": "https://mhclgdigital.blog.gov.uk/2022/02/10/how-we-put-our-users-at-the-heart-of-our-vision/",
    "title": "How we put our users at the heart of our vision",
    "authors": [
        "Sarah Clive"
    ],
    "categories": [
        "Funding Service"
    ],
    "pub_date": "2022-02-10T09:02:45+00:00",
    "content": [
        {
            "text": "At the Department for Levelling Up, Housing and Communities (DLUHC) one of our core roles is to award funding to organisations who do the detailed delivery work to achieve policy objectives. For example, the Towns fund delivers £3.6 billion to 100 towns to drive regeneration."
        },
        {
            "text": "There are many separate funds and at the moment each fund has its own process and application form. The process is designed to make sure that funds are properly accounted for, but historically it hasn’t been designed to meet other needs of applicants or those administering the system. As a result, the funding prospectuses and application forms can:"
        },
        {
            "text": "The funding service design team has a big vision: to transform the way DLUHC delivers funding. The aim of this is not only to improve the user experience, but also to:"
        },
        {
            "text": "One of the unintended consequences of a big vision can be that it feels abstract. The very people we’re trying to help can hear it and still think “what does that mean for me?”"
        },
        {
            "text": "Digital transformation is intangible: you cannot hold the internet in the palm of your hand. It can be difficult to explain to someone what that signifies in a way that they can imagine."
        },
        {
            "text": "We needed to:"
        },
        {
            "heading": 2,
            "text": "A user centred vision"
        },
        {
            "text": "Within DLUHC, we work as a digital team to apply the service standard to funding design and delivery. We’re designers working in a digital world: when we see a problem, our mind turns immediately to how to solve it."
        },
        {
            "text": "It’s easy to think that a solution means a product or tool, but this can limit our thinking. Solving big problems means that your approach needs to reflect the scale of the problem. That led to approaching our vision in a way that put our users at the centre."
        },
        {
            "text": "Building around the user’s experience creates a standard. It's something for us all to work towards, no matter what we do."
        },
        {
            "heading": 2,
            "text": "What did we do?"
        },
        {
            "text": "As we moved from alpha to beta, the team grew. With so many new faces, it was important that all the members of our team could understand what we were trying to do in a tangible way."
        },
        {
            "text": "We learnt a lot about our users and their needs during our alpha. This gave us a good place to start. We ran a workshop to get everyone in the team to think about:"
        },
        {
            "text": "During the workshop, we built up a picture of our users' current experience. The team began to empathise with the users in a way they had not been able to before."
        },
        {
            "text": "Next, we focused on what that experience could be if the obstacles disappeared. The story began to tell itself, and with a little content design, we had a collection of stories. Each of those stories centres around the experience one of our users will have."
        },
        {
            "heading": 2,
            "text": "How are we using it?"
        },
        {
            "text": "A single tool or product is not going to achieve this vision. The vision is what unites all the different activities we undertake as a team. It gives us the opportunity to solve problems holistically. It may take time to realise, but now the team is clear on what we’re aiming for."
        },
        {
            "text": "The stories we've created give us something to measure against. We can measure every solution we design by how much closer it gets us to our ideal. This is the same user experience strategy Apple used in 1987 when they created the knowledge navigator. They realised this more than two decades later when they launched the iPad. We can use our vision to decide value and prioritise tasks."
        },
        {
            "text": "Our user-centred vision is not a one-off workshop for us to do and forget about. It’s a living artefact that evolves with us as a team as our understanding of funding service design grows. The team has already begun to see the impact of user centred design in practice. Over the last few months, the team have already:"
        }
    ]
}