{
    "url": "https://educationhub.blog.gov.uk/2022/02/10/how-we-are-making-apprenticeships-more-accessible/",
    "title": "How we are making apprenticeships more accessible",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2022-02-10T13:28:56+00:00",
    "content": [
        {
            "text": "Apprenticeships help young people secure great careers. But at the moment they don’t suit all industries in the same way."
        },
        {
            "text": "That’s why, during National Apprenticeship week, we have set out next steps for a new flexible apprenticeship scheme that will help more employers take on apprentices."
        },
        {
            "text": "Here’s what you need to know about flexi-job apprenticeships."
        },
        {
            "heading": 3,
            "text": "What are flexi-job apprenticeships?"
        },
        {
            "text": "Apprenticeships are at least 12 months long, so some sectors with flexible employment patterns and short-term roles – such as in construction and creative industries –have found it challenging to take full advantage of them in the past."
        },
        {
            "text": "The government’s new flexi-job apprenticeship scheme will put an end to this by allowing people to complete short placements across several businesses during their apprenticeship, opening up a new training route to a career in these industries."
        },
        {
            "text": "Now an apprentice working at the BBC in film or TV will be able to work with several production companies in short term roles during their apprenticeship, while an apprentice working in construction could fulfil several contracts – such as working on both home refurbishments and bigger infrastructural projects."
        },
        {
            "text": "The government has also awarded almost £5 million to support employers including the BBC and NHS to offer the flexi-job apprenticeship scheme and support recruitment."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "Up to 2,000 apprentices are to be recruited on new flexible apprenticeships by 2023, creating opportunities for more people to earn while they learn in industries that boost the economy."
        },
        {
            "text": "These include apprenticeships in creative, digital, construction and healthcare industries."
        },
        {
            "heading": 3,
            "text": "What companies will be offering the flexi apprenticeships? "
        },
        {
            "text": "Following a rigorous application process, a total of 16 organisations have been approved by the government to establish Flexi-Job Apprenticeship Agencies."
        },
        {
            "text": "The agencies will recruit and employ apprentices and place them with host businesses to work on range of exciting projects, so they gain the skills and experience in previously untapped industries including film and television, healthcare, construction, and engineering."
        },
        {
            "text": "Successful organisations include the BBC, ScreenSkills, which works with Netflix and Warner Bros, the NHS and civil engineering specialists McGinley Ltd - all offering people a unique opportunity to build experience across a range of sectors in the coming months."
        },
        {
            "heading": 3,
            "text": "When will the new scheme start?"
        },
        {
            "text": "The first apprentices are expected to start their flexi-job apprenticeship placements from late February."
        },
        {
            "text": "Successful applicants met a robust set of criteria and provided details of how they will boost apprenticeship starts in their chosen sector or region and ensure apprentices and host businesses receive a high-quality experience."
        },
        {
            "heading": 3,
            "text": "What else are you doing to increase the numbers of people taking up apprenticeships? "
        },
        {
            "text": "The flexible apprenticeship scheme is just one of several steps the Government has taken to support employers to offer more apprenticeship opportunities."
        },
        {
            "text": "These have included offering cash incentives for employers hiring new apprentices and making it easier than ever for large employers to transfer unused levy funds to smaller businesses – allowing more employers to benefit from the skills and productivity apprentices can bring to their business."
        },
        {
            "heading": 3,
            "text": "Where can I find out more? "
        },
        {
            "text": "For more information and resources for National Apprenticeship Week you can visit NAW 2022 Toolkit (apprenticeships.gov.uk)."
        }
    ]
}