{
    "url": "https://ukhsa.blog.gov.uk/2022/02/10/how-well-do-vaccines-protect-against-omicron-what-the-data-shows/",
    "title": "How well do vaccines protect against Omicron? What the data shows",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-02-10T16:46:58+01:00",
    "content": [
        {
            "heading": 5,
            "text": "*Data presented in this blog is accurate as of Thursday, February 10, but is subject to change over time. For the latest data on vaccine effectiveness, read the UKHSA’s Vaccine Surveillance Reports, published weekly."
        },
        {
            "text": "Since the rollout of COVID-19 vaccines began, the UK Health Security Agency (UKHSA) has been monitoring their effectiveness by looking at health outcomes for the millions of people vaccinated compared to those unvaccinated."
        },
        {
            "text": "To assess effectiveness, studies look at how well the vaccines protect against severe disease and death, which are the main prevention aims of the vaccination programme."
        },
        {
            "text": "They also look at levels of protection against symptomatic disease (mainly mild infections), asymptomatic infection (infection with no symptoms) and transmission (the ability of the virus to pass from person to person), all of which are additional benefits."
        },
        {
            "text": "Since the emergence of Omicron, we have been conducting regular studies to understand how well the vaccines protect against this particular variant, now the dominant strain in the UK."
        },
        {
            "text": "So what do the latest results show?"
        },
        {
            "heading": 2,
            "text": "Protection against death (mortality)"
        },
        {
            "text": "Daily statistics show the vaccines have been limiting the number of deaths from COVID-19 since their introduction. But because Omicron is relatively new, we have only recently been able to establish early figures on what level of protection the vaccines provide against this variant."
        },
        {
            "text": "Although this data is new and likely to change over time, it provides good evidence that three doses of the vaccine are highly effective at preventing death from the virus."
        },
        {
            "text": "What does the data show?"
        },
        {
            "text": "Vaccine effectiveness against death (mortality) from Omicron in those aged over 50 (it is too early to produce accurate data for those aged under 50):"
        },
        {
            "text": "After two doses: 59% after twenty-five weeks"
        },
        {
            "text": "After a booster dose: 95% after two weeks*"
        },
        {
            "heading": 5,
            "text": "Note: With the booster rollout and emergence of Omicron occurring relatively recently, it is not possible to make like-for-like timeframe comparisons between the different doses. Data presented throughout this blog represents the most recent UKHSA studies and the longest available timeframes that contain sufficient data for analysis."
        },
        {
            "heading": 2,
            "text": "Protection against severe disease"
        },
        {
            "text": "What is severe disease? "
        },
        {
            "text": "When we talk about severe disease, we are referring to more serious symptoms from COVID-19. People who develop severe disease generally require hospital treatment and may require specialist medical intervention, for example, breathing assistance from equipment such as a ventilator. Severe disease can also lead to death."
        },
        {
            "text": "How well do the vaccines protect against severe disease?"
        },
        {
            "text": "Since Omicron emerged, we have seen that two vaccines are less effective against the new variant than they were against previous variants, and this protection declines with time. But latest UKHSA data shows a booster reinstates high levels of protection against hospitalisation from Omicron in those aged 18 and over. It also shows that good protection is maintained for at least two or three months after the booster is administered, despite some waning."
        },
        {
            "text": "It means the vaccine is stopping large numbers of people from falling seriously unwell during the current Omicron wave, in which we have seen record numbers of infections, and preventing our NHS services from being overwhelmed."
        },
        {
            "text": "What does the data show?"
        },
        {
            "text": "Protection against hospitalisation from Omicron:"
        },
        {
            "text": "After two doses of any vaccine: 25-35% protection after twenty-five weeks"
        },
        {
            "text": "After a Pfizer booster: around 90%, dropping to around 75% after ten to fourteen weeks"
        },
        {
            "text": "After a Moderna booster: 90-95% up to nine weeks after vaccination"
        },
        {
            "text": "Hospitalisations prevented: Latest analysis estimates the boosters alone prevented 105,600 hospitalisations in those aged 25 and over in England between December 13 2021 and February 6 2022."
        },
        {
            "heading": 2,
            "text": "Protection against symptomatic disease (mild infection)"
        },
        {
            "text": "What is symptomatic disease?"
        },
        {
            "text": "Most symptomatic disease involves a mild infection from the virus. People who develop symptomatic disease will experience some or all of the main COVID-19 symptoms - a high temperature, a new continuous cough or a loss or change to their smell or taste. If you do not develop symptomatic disease, you cannot go on to develop severe disease so protection against mild infection is also important."
        },
        {
            "text": "How well do the vaccines protect against symptomatic disease?"
        },
        {
            "text": "We have seen there is strong evidence that protection against severe disease and death is maintained at high levels for several months after booster vaccination. Against milder, symptomatic infection however, protection does wane more quickly."
        },
        {
            "text": "Despite this, latest studies have shown the vaccines do provide adequate levels of protection against symptomatic disease from Omicron, at least in the early weeks after the jab."
        },
        {
            "text": "What does the data show?"
        },
        {
            "text": "Vaccine effectiveness against symptomatic disease:"
        },
        {
            "text": "After two doses of AstraZeneca: around 50% protection, waning to almost 0% from twenty weeks"
        },
        {
            "text": "After two doses of Pfizer or Moderna: 65-75% protection, waning to around 10% by twenty-five weeks after the second dose"
        },
        {
            "text": "After a booster dose: 65-75% protection after two to four weeks, waning to 30-40% after fifteen weeks"
        },
        {
            "heading": 2,
            "text": "Protection against infection (including asymptomatic infection)"
        },
        {
            "text": "What is infection?"
        },
        {
            "text": "When we refer to protection against infection, we are describing how effective the vaccines are at preventing someone from catching the virus at all, even asymptomatically (this means people have no symptoms when infected)."
        },
        {
            "text": "How effective are the vaccines at preventing infection?"
        },
        {
            "text": "The latest analysis from the SIREN study, which looked at the Delta variant, found that two doses of the COVID-19 vaccine provided high levels of protection in the first few months after the second jab was administered, but that protection waned over six months after the second jab. This highlights the importance of getting a booster dose to reinstate protection against the virus."
        },
        {
            "text": "What did the data show for Delta?"
        },
        {
            "text": "Vaccine effectiveness against infection from Delta (including asymptomatic infection):"
        },
        {
            "text": "After two doses of AstraZeneca: Estimated at around 50%* after two months"
        },
        {
            "text": "After two doses of Pfizer: Estimated at around 81%* after two months, waning to around 46%* after six months"
        },
        {
            "heading": 5,
            "text": "*True figure sits within a wider range and is dependent on factors detailed in the report"
        },
        {
            "text": "Studies into how well the vaccines prevent both symptomatic and asymptomatic infection from the Omicron variant are still underway."
        },
        {
            "text": "A rapid analysis from the SIREN study showed lower protection from both vaccination and previous infection to Omicron compared to Delta, but indicated higher protection among those who had received booster vaccination."
        },
        {
            "heading": 2,
            "text": "Prevention of transmission"
        },
        {
            "text": "What is transmission?"
        },
        {
            "text": "The level of transmission is the ability of the virus to pass from person to person. When we look at how well the vaccines prevent transmission, we are looking to see if someone who is vaccinated is less likely to pass the virus on to someone else."
        },
        {
            "text": "How effective are the vaccines at preventing transmission?"
        },
        {
            "text": "A UKHSA study which looked at the Delta variant showed the COVID-19 vaccines prevent some transmission in the weeks after a jab is administered. A more recent rapid review by UKHSA of a number of other studies also concluded the vaccines provide some protection against transmission, and that for Delta this wanes substantially over time."
        },
        {
            "text": "What did the UKHSA study show for Delta?"
        },
        {
            "text": "Effectiveness of the vaccines against transmission of the Delta variant:"
        },
        {
            "text": "After two doses of AstraZeneca: Estimated at 42%"
        },
        {
            "text": "After two doses of Pfizer: Estimated at 31%"
        },
        {
            "heading": 5,
            "text": "Note: This study did not assess levels of waning over time. Studies into how well the vaccines prevent transmission of the Omicron variant are still underway."
        },
        {
            "heading": 2,
            "text": "Additional vaccine protection for those with prior infection (infection-derived immunity)"
        },
        {
            "text": "What is infection-derived immunity?"
        },
        {
            "text": "When someone catches COVID-19, their immune system produces antibodies to fight off the infection. These antibodies remain part of the immune system for some time, providing some level of protection against reinfection from the virus. This is known as infection-derived immunity."
        },
        {
            "text": "Do these people still need to get a vaccine?"
        },
        {
            "text": "Early evidence shows that getting vaccinated after infection provides significantly higher levels of protection against reinfection."
        },
        {
            "text": "Comprehensive analysis is ongoing into exactly how much additional protection the vaccines provide against Omicron infections, but a rapid unadjusted analysis from the SIREN study indicated an increasing benefit of each vaccine dose in those with prior infection."
        },
        {
            "text": "The SIREN analysis found participants with the strongest protection against infection were those who were vaccinated after having a previous infection, with each vaccine providing greater protection. Therefore, the best protection, whether you have been infected previously or not, is to get all three vaccine doses."
        },
        {
            "text": "What does the data show?"
        },
        {
            "text": "Protection against reinfection from Omicron:"
        },
        {
            "text": "No vaccination and prior infection: Estimated at 44%*"
        },
        {
            "text": "Prior infection and three vaccine doses: Estimated at 71%*"
        },
        {
            "heading": 5,
            "text": "*True figure sits within a wider range and is dependent on factors detailed in the report"
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "The vaccine has and continues to provide high levels of protection against hospitalisation and death from COVID-19, which is the primary aim of the UK vaccination programme."
        },
        {
            "text": "We know that protection against Omicron from the first two doses of vaccine declines over time, which is why getting the booster is so important to obtain the maximum protection against this virus."
        },
        {
            "text": "This is important even if you have previously caught COVID-19, as we know infection-derived immunity is boosted significantly by the vaccine."
        },
        {
            "text": "For those who are unvaccinated and have not been infected, the vaccine is the safest way to obtain high levels of protection and avoid the risk of serious illness from the virus."
        },
        {
            "text": "The UKHSA will continue monitoring the virus and its relationship with the COVID-19 vaccines. This information will help inform the development of future vaccines, helping us to better adapt our response as we learn to live with COVID-19."
        },
        {
            "text": " "
        }
    ]
}