{
    "url": "https://vmd.blog.gov.uk/2022/02/10/new-e-learning-resources-from-the-vmd/",
    "title": "New e-learning resources from the VMD",
    "authors": [
        "Rachel Dalton",
        "Ruth Pearson"
    ],
    "categories": [
        "Training"
    ],
    "pub_date": "2022-02-10T15:10:02+00:00",
    "content": [
        {
            "text": "The International Office has been busy over the past year, creating e-learning resources to enhance our training offer, primarily aimed at lower- and middle-income countries."
        },
        {
            "text": "Our first e-learning course on the surveillance of residues of veterinary medicines in foods of animal origin is aimed at policy makers in those countries. We provide participants with knowledge on the core principles to set up, develop and maintain an effective national residues surveillance programme."
        },
        {
            "text": "Developed in collaboration with technical experts and a variety of stakeholders across the UK, Ethiopia, Ghana, and the Philippines, the course is a combination of self-directed learning and taught sessions. Learners can complete the e-learning modules at their own pace and check their understanding via reflective questions set throughout the content."
        },
        {
            "text": "The modules are interspersed with trainer- led virtual sessions where participants can ask questions to confirm understanding. In addition, 2 interactive workshops are offered; in the first, attendees take part in a ‘Dragons Den’ session to gain experience in weighing up important investment decisions, whereas the second involves developing a draft national residues surveillance plan with a panel of experts."
        },
        {
            "text": "We are developing supplementary resources to provide support and guidance on technical aspects of implementing a successful residues surveillance programme. These include videos on how to take and process samples for testing.  We are also in the process of developing our second course, which will focus on assessment and authorisation of generic veterinary medicinal products."
        }
    ]
}