{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/02/10/new-year-new-standards-for-investigational-medicines/",
    "title": "New year, new standards for investigational medicines",
    "authors": [
        "Alan Moon"
    ],
    "categories": [
        "Compliance matters",
        "Good clinical practice",
        "Good manufacturing practice"
    ],
    "pub_date": "2022-02-10T17:12:27+00:00",
    "content": [
        {
            "text": "New GMP requirements from 31 January 2022"
        },
        {
            "text": "Monday 31 January 2022 saw the Clinical Trial regulation (CTR) come into force in the European Union, and with it, the Commission guidelines on good manufacturing practice for investigational medicinal products for human use (more commonly known as the revised Annex 13 of EU GMP)."
        },
        {
            "text": "Having left the European Union, the new EU CTR will not be applicable in the UK. UK requirements will remain unchanged pending completion of the consultation on new proposals for the future of UK clinical trial legislation. The changes in GMP guidance will however still impact manufacturers and importers of investigational medicinal products (IMPs) in the UK. We will remain aligned with the internationally harmonised standards of PIC/S and the EU, including requirements for the Qualified Person."
        },
        {
            "text": "Background to the changes"
        },
        {
            "text": "The revised Annex 13 changes the EU’s approach to the management of issues that sit at the boundary between GMP and GCP. These include the two-step release procedure, handling and shipping of investigational medicinal products and contractual arrangements between the trial Sponsor and IMP manufacturer."
        },
        {
            "text": "In the January 2010 version of Annex 13, these issues were all included in the text. They have been removed from the new document because they are not unique to manufacturers of IMPs. Instead, a separate guideline on responsibilities of the sponsor with regard to handling and shipping of investigational medicinal products is likely to be published in future as a standalone document in Eudralex volume 10."
        },
        {
            "text": "There are also changes to the EU’s approach to labelling of IMPs that in addition to changing the approach to providing expiry information, also move labelling requirements from GMP guidance into the legislative text of the CTR."
        },
        {
            "text": "Implementation in the UK"
        },
        {
            "text": "The revised Annex 13 is now effective (from 31 January 2022), however pending completion of the UK’s future clinical trial legislation, we will also continue to apply the January 2010 version of Annex 13 with respect to:"
        }
    ]
}