{
    "url": "https://socialcareinspection.blog.gov.uk/2022/02/10/reflecting-on-early-help/",
    "title": "Reflecting on early help",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "Care Review",
        "early intervention",
        "multi-agency",
        "partnership working"
    ],
    "pub_date": "2022-02-10T09:30:25+00:00",
    "content": [
        {
            "text": "Yvette Stanley, Ofsted’s National Director for Regulation and Social Care, discusses findings from a recently published report by Research in Practice, commissioned by Ofsted."
        },
        {
            "text": "The term ‘early help’ is used to describe different kinds of activities, from support for parents with young children, to crisis intervention for older children who are on the cusp of entering care. We commissioned Research in Practice to produce a ‘compendium-style’ report, bringing together what we know about current early help provision in England, what the policy debates are, and the different ways agencies work together to meet children’s needs and prevent more intrusive, longer-term intervention."
        },
        {
            "text": "The report is especially timely as, in our joint targeted area inspections (JTAIs) in autumn 2022, we will be looking at the effectiveness of local areas in reducing risks to children and meeting their needs at the earliest point."
        },
        {
            "text": "Through our thematic JTAIs, we want to establish a shared understanding of how different agencies can work together effectively to reduce risks to children. A whole-system approach is critical to protecting children, and early help needs to be part of a continuum of response to children’s changing needs."
        },
        {
            "text": "Research in Practice’s report also touches on wider issues and challenges that local areas are facing, such as child poverty, funding cuts to early help provision and increasing levels of need. It’s clear that additional investment for early help is needed, but it has to be targeted where children and families will benefit from it most."
        },
        {
            "text": "We hope those involved in thinking about, and commissioning, early help services, including the independent Care Review, will find the report a useful contribution to discussion and debate. As we have said before, no one agency can deliver an effective early help response; a multi-agency approach is essential."
        },
        {
            "text": "With the outcomes of the Care Review approaching, this is a fitting time to reflect on what works – and what doesn’t work – when it comes to effective early help. I suggested the following to the review."
        },
        {
            "text": "Getting the right response to children at the right time is critical to meeting children’s and their families’ needs before things escalate. This is the right time to consider the best way to deliver and prioritise early help."
        }
    ]
}