{
    "url": "https://mojdigital.blog.gov.uk/2022/02/10/remote-working-and-opportunities-an-apprentices-journey/",
    "title": "Remote Working and Opportunities: An Apprentices Journey",
    "authors": [
        "Teagan Beale"
    ],
    "categories": [
        "National Apprenticeship Week"
    ],
    "pub_date": "2022-02-10T13:04:04+01:00",
    "content": [
        {
            "text": "In November 2020, I joined the Ministry of Justice as a Level 4 Cyber Security Apprentice, and now over a year later, I am reaching the final stages of my apprenticeship. "
        },
        {
            "text": "It’s been a journey, I didn’t have any formal education or training in technology, let alone Cyber Security when I began my apprenticeship. I have a degree in English Literature and Film Studies, however, decided to pursue something I have been interested in for years, technology, and ended up trying to teach myself a lot before this apprenticeship. After teaching myself some coding basics and getting hands-on with Kali Linux, I decided to look at apprenticeships in Cyber Security, to not only learn as much as possible from those around me but also to gain experience in an actual job role. "
        },
        {
            "text": "Applying for the apprenticeship, and beginning it, was a bit different than expected due to the pandemic and lockdown. Even a year on I still have yet to meet many of my colleagues in person but, that hasn’t hindered both my professional progression or my apprenticeship! I feel I have still been able to meaningfully contribute - even if it is all through a webcam! I have had the fortunate opportunity of working with numerous people in various specialities, learning a wealth of knowledge at the same time. "
        },
        {
            "text": "The best opportunity that this apprenticeship has offered is the ability to have hands-on experience in so many different areas within the Cyber Security teams. Not only does it prove extremely useful when it comes to the formalities of my exams and coursework but no one day ever seems alike, one moment I am assessing new applications for cyber risks and the next I am investigating the latest vulnerability and ensuring we are protected! "
        },
        {
            "text": "Looking back at what I knew when I started compared to now I am amazed at how learning whilst working has strengthened my knowledge. With the end of my apprenticeship approaching in the next few months, I am concentrating on ensuring all my work this past year is to the best of my standards, and that I’m fully prepared for my EPA (End Point Assessment). Looking to the future I am hopeful that with the successful completion of my Level 4 (fingers crossed!) I will be able to start the Level Six Cyber Security Apprenticeship, furthering my knowledge even more and allowing me to stay and grow within my department and teams. "
        }
    ]
}