{
    "url": "https://defradigital.blog.gov.uk/2022/02/10/scanning-the-horizon-for-the-innovations-of-the-future/",
    "title": "Scanning the horizon for the innovations of the future",
    "authors": [
        "Jan Murdoch"
    ],
    "categories": [
        "Data Transformation",
        "Defra digital",
        "Defra Science and Innovation",
        "Defra services",
        "Digital transformation"
    ],
    "pub_date": "2022-02-10T09:13:40+00:00",
    "content": [
        {
            "text": "I recently joined the Defra Technology Innovation team on a permanent basis after taking the opportunity to complete a six-month loan at Defra from the Office for National Statistics."
        },
        {
            "text": "Previously I held technical and project delivery roles, so I feel lucky to have found a role that allows me to combine my nerdy inquisitiveness, with new technology. I work on projects which explore the potential of emerging technology, and the cherry on top is the chance to do it with such an impressive set of team members."
        },
        {
            "text": "I head up the horizon scanning for technology innovation across the Defra group. One of my main responsibilities is the production of the Emerging Technology Radar and the Top 10 Emerging Technologies for Defra report. These reports highlight what I, the team, and the wider virtual innovation community, which includes colleagues across the Defra group, across government, and external suppliers, believe are the most important emerging technologies which could support and enhance Defra group objectives."
        },
        {
            "heading": 2,
            "text": "How we produce the report"
        },
        {
            "text": "We use many diverse sources of information to inform our thinking. These include specialist consultancies and news source aggregator tools, which collect information right across the web, including from national newspapers, academic journals, and trade publications."
        },
        {
            "text": "The first step is to produce the Emerging Technologies Radar by mapping a longlist of emerging technologies to Defra group’s priority objectives and strategic enablers which are published in the Defra group Outcome Delivery Plan. This mapping then creates a golden thread from objective to potential solution or combination of solutions."
        },
        {
            "text": " "
        },
        {
            "text": "Challenge sessions of the top ranked technologies are run with colleagues to ensure we gather as many different opinions and perspectives as possible. Engaging with a wider stakeholder community, within Defra group and across government, gives us further assurance that we have not missed anything emerging that may have potential and that should be explored."
        },
        {
            "text": "Once the Top 10 report is published it becomes a key resource for our annual exploration planning, helping us to decide which technologies we should practically explore."
        },
        {
            "heading": 2,
            "text": "What’s new about this year’s report?"
        },
        {
            "text": "As a team, we are always striving to share our technology innovation thoughts and ideas to as many different colleagues across the Defra group as possible and regularly test different ways to improve our content for our colleagues across Defra. For this year’s report we have trialled a new ‘glossy’ report and content format."
        },
        {
            "text": "With the help of our Business Relationship Management team, we ran some sessions to explore what good looked like, and how to increase engagement. We also reached out to different communities on Yammer to find out how they are using some of these innovative technologies and are really pleased that they have allowed us to include their work in the report."
        },
        {
            "heading": 2,
            "text": "What to look out for this year"
        },
        {
            "text": "The top 10 technologies list is full of exciting potential solutions for Defra and a few of the emerging technologies are already being explored across the department. One of the key technologies is the ‘Internet of Things’ (IoT) which describes the sensing, processing, and exchanging of data between groups of physical objects. IoT is important to Defra because it could revolutionise how we remotely monitor the environment, enabling us to create UK-wide real-time monitoring networks combing data from rivers, land, and air - creating an accurate digital overview of our whole environment."
        },
        {
            "text": "IoT is just one of the ten emerging technologies spotlighted in the report and you can find more information on both IoT and the other nine technologies through reading report and watching the video."
        },
        {
            "text": "Read the latest Top 10 Emerging Technologies for Defra report and watch the accompanying video."
        }
    ]
}