{
    "url": "https://teaching.blog.gov.uk/2022/02/10/supporting-the-mental-health-of-our-send-pupils-as-they-enrol-with-us/",
    "title": "Supporting the mental health of our SEND pupils as they enrol with us",
    "authors": [
        "Melissa Sellers",
        "Simmone Appleton"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "SEND"
    ],
    "pub_date": "2022-02-10T14:24:03+00:00",
    "content": [
        {
            "text": "Melissa Sellers, Trust Inclusion Manager and Simmone Appleton, Resourced Provision Lead from Pennine Academies Yorkshire talk us through how they support their pupil’s mental health during enrolments to their specialist provisions. "
        },
        {
            "text": "Alongside five primary schools, Pennine Academies Yorkshire resources three additional SEND provisions. Students become enrolled in these provisions from mainstream schools, and all have an Education Health and Care Plan."
        },
        {
            "text": "Simmone and Melissa focus their resourced provision on children with communication and interaction needs."
        },
        {
            "text": "There are many ways to ease anxieties and help pupils adapt to their new environment. However, it is most important to work closely with parents, other agencies, and their previous school to ensure that pupils are foremost being placed in the best setting for them."
        },
        {
            "text": "First steps to a smooth transition "
        },
        {
            "text": "During enrolments we find it paramount that the communication channels between us, parents/ carers and (where relevant) the previous schools, are open, transparent, and supportive. This leads to a teamwork mind frame, with everyone working towards a successful outcome for the child."
        },
        {
            "text": "Making the move successfully relies heavily on the planning and preparation that happens before the pupil even enters the building."
        },
        {
            "text": "Here are some activities that we find consistently helpful when ensuring a positive start to a pupil’s journey with us:"
        },
        {
            "text": "Impact over time "
        },
        {
            "text": "The change in a child when a provision is right for them can be huge, however patience is key when giving a pupil the time they need to adjust to a new setting."
        },
        {
            "text": "New pupils may have previously found school very difficult, and the anxiety only begins to reduce when they have started to feel properly safe with us. For example, a pupil with autism and struggling with OCD, was initially only able to be educated for 1 hour a day."
        },
        {
            "text": "Due to our efforts over a consistent period, he eventually developed confidence and was able to communicate with his mainstream classroom via virtual assemblies, and then slowly, in person. He also was encouraged to write letters and emails to our Head Teacher with his concerns, and she would respond to encourage communication."
        },
        {
            "text": "These small steps all helped contribute to a slow but successful integration to on-site learning, and the child began to feel safe and valued. He would convey this through touching the logo on his school t shirt and saying he felt proud to wear it, which was lovely."
        },
        {
            "text": "By the time the boy left he could be heard saying to staff \"I'm a legend\", \"I'm an inspirational boy\", and in fact he was. He had started to see himself more positively and believe that he could achieve."
        },
        {
            "text": "For any child with SEND, getting the provision right and planning a patient, supportive transition is vital for their mental health. It’s also incredibly valuable to that of their wider family, who have no doubt have been by their side on the journey."
        },
        {
            "text": " "
        },
        {
            "text": "Wider support on SEND and Mental Health "
        },
        {
            "text": "The Whole School SEND consortium regularly publishes resources to support school and college staff with all aspects of SEND in educational settings. "
        },
        {
            "text": "You can also visit the Council for Disabled Children resources page for the latest insight and advise on how to support the mental health and wellbeing of your students with special educational needs. "
        },
        {
            "text": "Visit our guidance for wider information on Mental Health and Wellbeing Resources for teachers, teaching staff, children and young people. "
        },
        {
            "text": "You can also visit the NHS Every Mind Matters website to find advice on how to spot and support children’s mental health issues."
        }
    ]
}