{
    "url": "https://defrafarming.blog.gov.uk/2022/02/10/watch-episode-1-land-management-plans-and-the-sustainable-farming-incentive-pilot/",
    "title": "Watch Episode 1: Land Management Plans and the Sustainable Farming Incentive pilot",
    "authors": [
        "The Team"
    ],
    "categories": [
        "A view from the farm",
        "Sustainable Farming Incentive pilot"
    ],
    "pub_date": "2022-02-10T12:16:55+00:00",
    "content": [
        {
            "text": "A land management plan brings together various pieces of information including maps, field records and details of how the land is being managed.  "
        },
        {
            "text": "Farmers and land managers can use them to record environmental changes on their land.  "
        },
        {
            "text": "Through tests and trials, we wanted to understand the role they could play in our future schemes.  In the Sustainable Farming Incentive pilot, we provided farmers with 3 different land management plan templates. Each template was developed through tests and trials. "
        },
        {
            "text": "One of the templates was developed by the North Devon Pioneer  group. In this video, find out how participants Liz and Bryan, used land management planning to prepare their farm business for the future.  "
        },
        {
            "text": "The North Devon Pioneer template is a land management plan which links farm business finance to natural capital assessments. "
        },
        {
            "text": "It identifies opportunities to reduce environmental pressures and increase the quantity and/or quality of those assets."
        },
        {
            "text": "The North Devon Pioneer group liked the structure of this template and found the financial aspects to be particularly useful, because they help with decision making such as working out what standards to apply for. "
        },
        {
            "text": "Our learning from Test and Trials is helping to inform the design of future schemes. We’re looking forward to building on our findings about land management plans through the pilot and exploring how we can make the most of them as part of environmental land management."
        },
        {
            "text": "This is the first in a series of 3 videos about land management planning in the Sustainable Farming Incentive pilot. Subscribe to the Future Farming blog so you don’t miss the next one. "
        },
        {
            "text": "With thanks to Bryan, Liz and Clare."
        },
        {
            "text": "Read the transcript of the video. "
        }
    ]
}