{
    "url": "https://ofqual.blog.gov.uk/2022/02/10/what-sorts-of-things-might-help-you-prepare-for-exams/",
    "title": "What sorts of things might help you prepare for exams?",
    "authors": [
        "Prof. Kevin Woods",
        "Dr. Tee McCaldin"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams"
    ],
    "pub_date": "2022-02-10T12:27:58+00:00",
    "content": [
        {
            "text": "Exams can cause a mixture of feelings – hope, excitement, pressure – but the experience we tend to associate most with exams is worry or stress. Feeling some level of apprehension around exams is normal. When something feels important to us, especially when it is also new and unfamiliar, this worry is a natural response that is designed to help us deal with the situation. Research shows that small and manageable amounts of apprehension can actually be helpful, giving some students the focus they need to prepare and do their best."
        },
        {
            "text": "Our research during lockdown showed that some students were pleased when exams were cancelled, but just as many felt that they had missed out on an opportunity to prove what they could do. Preparing for exams this year, after Covid and school closures, might feel a bit different to “normal”, and you might feel excited or hopeful, or worried or pressured, or a mixture of things."
        },
        {
            "text": "If you are feeling worried, there are strategies you can try to help reduce your worry. Students with manageable amounts of worry can see exams as a challenge they can cope with."
        },
        {
            "text": "Find ways to take control"
        },
        {
            "text": "With any assessment, like a job interview, or a driving test or an exam, it can feel like someone else is taking control of your future. Disruption and uncertainty over the last two years might make this feel even more true this year. Schools and exam boards know this too. They have found out about student and teacher experiences and are making changes to the way exams will take place this year to ensure that you are not disadvantaged."
        },
        {
            "text": "It's important to remember you are being assessed on your work and that you do have control over this. Focus on what you can do now to show the best of your learning. Your class work, homework assignments, class tests, and exam revision will all directly support your preparation for final exams, and knowing you are doing this will help keep anxiety at bay."
        },
        {
            "text": "Actively managing your well-being. "
        },
        {
            "text": "Looking after your physical, mental and social well-being will help you manage during your examination preparation. Try to establish routines in things like:"
        },
        {
            "text": "We know all these things can help keep you healthy, but you will know which are the most important for you, the main thing is to be aware of what is important for your well-being and to actively protect that during your exam preparations."
        },
        {
            "text": "Remember you aren’t on your own"
        },
        {
            "text": "You are one of many thousands of students preparing for examinations. People often feel reassured when they can talk to each other about their experiences and hear how others are finding ways to cope. Talking to other people in your year group and hearing about how they are preparing for and thinking about their exams can feel supportive. And sometimes you find out about personal or practical strategies that might work for you. In some schools, a form tutor might arrange for some time to talk as a class about how exam preparation is going and feeling."
        },
        {
            "text": "For some students, worries about exams do become too difficult to cope with on their own and persistent anxiety can negatively affect your well-being and exam preparation. If your worries feel overwhelming you can get help to cope. Speak to a trusted adult, or to one of the professional services/ organisations below:"
        },
        {
            "text": "Professor Kevin Woods and Dr Tee McCaldin"
        },
        {
            "text": " "
        }
    ]
}