{
    "url": "https://dcmslibraries.blog.gov.uk/2022/02/10/why-libraries-are-so-keen-on-apprenticeships-and-the-kickstart-scheme/",
    "title": "Why libraries are so keen on apprenticeships and the Kickstart scheme.",
    "authors": [
        "Isobel Hunter"
    ],
    "categories": [
        "Case study",
        "Library workforce"
    ],
    "pub_date": "2022-02-10T10:31:56+00:00",
    "content": [
        {
            "text": "To mark National Apprenticeship Week, Isobel Hunter, CEO of Libraries Connected writes about how important apprentices are to libraries."
        },
        {
            "text": "These words of Ambreen Aziz, library apprentice in Kirklees, sums up so well the experience of many apprentices and Kickstart trainees working in libraries across the country. "
        },
        {
            "text": "Libraries have been offering apprenticeships for several years, often in customer service, digital or marketing roles. In December 2018 the choices for libraries expanded with the approval of a new Level 3 apprenticeship for Library, Information and Archives Services. The standard had been developed by a trailblazer group, convened by CILIP, and supports people to develop on a professional pathway. CILIP is now working on development of a Level 7 apprenticeship."
        },
        {
            "text": "In addition to apprenticeships, libraries have also embraced the Kickstart Scheme, offering paid employment and work-based training to young people aged 16-24, who would otherwise be at risk of long-term unemployment. "
        },
        {
            "heading": 2,
            "text": "So, why are libraries so keen on apprenticeships and the Kickstart scheme? "
        },
        {
            "text": "Public libraries serve a diverse audience – with users drawn from every part of their communities. They recognise that to do their job effectively, the libraries workforce must also be diverse – both in terms of personal characteristics and in their skills and attributes. They need people passionate about books and reading, who love interacting with people, running marketing campaigns, organising events, keen to exploit all the opportunities digital presents and focusing on the needs of the more vulnerable and excluded"
        },
        {
            "text": "In a competitive jobs market it is hard to attract multi-talented and ambitious people – and relying on traditional recruitment channels won’t help to broaden the intake. Apprenticeships can reach out deeper into communities – attracting people keen to develop skills and advance their careers, including those who would never have imagined working in a library. Many apprentices find once they start work in the library, they get the bug and want to build a library career. Lucy Neill, apprentice in Suffolk Libraries explained; "
        },
        {
            "text": "Public libraries are built on a mission to empower and educate individuals, so offering work-based training and career development fits really comfortably. Julie Kisby in Cambridgeshire Libraries explained;"
        },
        {
            "text": "Ambreen Aziz and Hannah Armitage felt they really benefited from the empowering ethos of libraries; "
        },
        {
            "text": "Lucy Neill was amazed by the outlook at Suffolk Libraries and the way she was respected and involved as a core team member;"
        },
        {
            "text": "Apprentices talk about how they enjoyed the sheer variety of library work: shelving and sorting books, organising exhibitions, promotional displays, events for children and adults, music and art sessions, social media, digital inclusion work … no two days are the same. The supportive management style helped them to grow in confidence to try new things, and to take lead on projects – being encouraged to bring their own ideas and creativity. This often bore fruit in really exciting ways. "
        },
        {
            "heading": 2,
            "text": "'Ripple effect'"
        },
        {
            "text": "Many managers have talked about the ‘ripple effect’ of hosting apprentices and Kickstarters. In Cheshire, one of the managers said, “We have been delighted by the apprentices’ enthusiasm for libraries, their incredible ideas and their work ethic.” "
        },
        {
            "text": "Julie Kisby in Cambridgeshire said having an apprentice in the team “has made other colleagues feel empowered to try new initiatives as they know they will have her support. Her positivity has an infectious impact on the team.” And, it doesn’t stop there as, “Other members of the team have seen the value of the qualification and have now come forward wanting to pursue the qualification themselves. This is a huge bonus to professional development in the service and indeed the morale of the team.” "
        },
        {
            "text": "So apprenticeships are not only attracting new people into libraries, they are also upskilling existing staff and setting them on a path where they can feel valued as professionals. "
        },
        {
            "heading": 2,
            "text": "Progression"
        },
        {
            "text": "It has been exciting to see the onward trajectory of apprentices. Many of them are staying within the library service at the end of their apprenticeship and are already on track to being leaders of the future. Laura at the City of London is a great example of this. She secured a permanent library role at the end of her apprenticeship, and now has a place on the Libraries Connected short leadership course. Without the apprenticeship pathway, we may never have benefitted from the drive and talent of so many like Laura."
        },
        {
            "text": "Some apprentices chose to move on to other spheres, but remain immensely appreciative of their experience and the support they were given. An apprentice in Kent Libraries has now secured a role with the Police and was keen to point out;"
        },
        {
            "text": "To echo CS Lewis and his famous quote that “Once a King or Queen of Narnia, always a King or Queen of Narnia”, it’s clear that the apprentices will carry a love of libraries with them throughout their lives, even if their careers move in a different direction. Libraries work with so many different partners across their communities, so having widespread “Kings and Queens of Narnia” can only be a good thing. "
        }
    ]
}