{
    "url": "https://stratcommand.blog.gov.uk/2022/02/13/have-we-lost-connection/",
    "title": "Have we lost connection?",
    "authors": [
        "Conrad Beckett"
    ],
    "categories": [
        "Cyber",
        "Personnel",
        "Technology"
    ],
    "pub_date": "2022-02-13T06:00:15+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Who was the last person you felt really close to? The two of you just clicked. You got one another immediately, and it was all just so easy.  A real connection is a wonderful thing, it’s precious, and it’s something that we humans value immensely."
        },
        {
            "heading": 4,
            "text": "February is the month in which many of us celebrate the more intimate connections in our lives, but put down the pink paper and glittery hearts, because we aren’t here to talk about valentines.  Instead, we want to focus on one of the most important parts of a relationship – that connection between people."
        },
        {
            "text": "For those of us in the Armed Forces these personal connections are massively important. You need to be able to quickly trust someone you don’t know that well implicitly – often with your life. But even outside of a life-threatening situation, we need to trust that everyone around us is working in a common interest and that we’re all pulling together."
        },
        {
            "text": "If the aircraft engineer forgets to maintain a single part, then they put the lives of everyone on the aircraft at risk. If the sonar technician doesn’t identify a sound correctly, then everyone on the ship could be in danger. And if the soldier on watch in the middle of the night isn’t fully alert, then they could risk the lives of all their comrades."
        },
        {
            "text": "Needless to say, trust is an essential commodity in Defence and it’s one that we train to gain and maintain quickly. But the digital world is making this increasingly difficult, because a remote connection cannot always be trusted."
        },
        {
            "text": "The last two years have massively changed the way we connect with each other. Face-to-face became the exception, rather than the norm, and we all lived a huge part of our lives online, interacting with others through an endless stream of zoom chats or virtual conferences."
        },
        {
            "text": "Now, many people talk about the ‘new normal’ wherein everything that can be done online, should be. But what is the cost of moving more of our lives online? What are the risks inherent in online interactions?"
        },
        {
            "text": "Connecting two computers isn’t too dissimilar to connecting two people – it requires trust, allows information to be exchanged, and through that connection enables you to do a lot more than any one party could do alone. But it also brings risks."
        },
        {
            "text": "Once you make that connection you open up the risk of malicious software being downloaded onto your device, or your data could be stolen or changed without your knowledge. Nowadays we have lots of software safeguards in place to prevent this such as firewalls, antivirus programmes, and data encryption. But all these safeguards can fail with the weak link in the chain:"
        },
        {
            "text": "That weak link is you."
        },
        {
            "text": "The vast majority of security compromises on digital systems happened as a result of human intervention. Maybe they clicked a dodgy link and downloaded a virus to their system. Maybe they gave out security details to their system, or maybe they didn’t bother to secure their system at all."
        },
        {
            "text": "Cyber criminals prey on our need to create connections. They exploit our desire to want to trust others and use it as a way to steal secrets and money. But they don’t always have to ‘hack in’ to your systems to obtain details about you. In fact, you might be amazed what you can find out about people from their social media accounts. You might be even more surprised how many people actively share that information with other people, including those that they actually don’t know and have never met."
        },
        {
            "text": "So, this February perhaps you should take some time to work on the real-world connections in your life, or maybe cultivate some new ones. Either way, make sure that you use online interactions in a responsible manner, and don’t neglect those opportunities to spend some time together in person too."
        },
        {
            "heading": 4,
            "text": "Okay, you can go back to the glittery hearts now."
        }
    ]
}