{
    "url": "https://vets.blog.gov.uk/2022/02/13/the-food-standards-agency-fsa-announces-winner-of-vet-of-the-year-award/",
    "title": "The Food Standards Agency (FSA) announces winner of Vet of the Year Award",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2022-02-13T17:24:09+00:00",
    "content": [
        {
            "text": "Collin Willson, who is the current British Veterinary Association (BVA) Welsh Branch President and has been in the profession for 49 years has been named as the FSA’s Vet of the Year for 2022."
        },
        {
            "text": "The accolade recognises the hard work and dedication of veterinary colleagues within the FSA, who ensure that food is safe and what it says it is and that the highest standards of animal welfare are upheld."
        },
        {
            "text": "Jane Clark, Director of Veterinary Services said:"
        },
        {
            "text": "“I am delighted to announce Collin Willson as our Vet of the Year. Collin is a well-deserved winner and has been a driving force in our organisation, and across government, to improve animal welfare standards for many years."
        },
        {
            "text": "\"He has an extensive and impressive veterinary network, within government and across the wider profession, and colleagues from across the agency commented on how generously he shares his expertise."
        },
        {
            "text": "\"Collin is a real asset to the FSA and the Vet of the Year award is a testament to Collin’s success.”"
        },
        {
            "text": "Collin, Vet of the Year comments, “I feel incredibly proud to have been nominated by my colleagues and recognised for my role in improving and promoting animal welfare standards."
        },
        {
            "text": "\"I’ve been a part of the veterinary profession for 49 years and a career highlight has been working for the FSA and in partnership with colleagues and stakeholders to get ministerial clearance for the Demonstration of Life work, early in 2021. I’m looking forward to continuing this work and promoting the role of our Vets who work tirelessly behind the scenes right across the organisation.”"
        }
    ]
}