{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/12/01/an-important-moment-for-social-work-and-social-care/",
    "title": "An important moment for social work and social care",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Consultation and engagement",
        "Personalisation",
        "Viewpoint"
    ],
    "pub_date": "2021-12-01T16:15:50+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Reform has social work values built in"
        },
        {
            "text": "I am so pleased to be writing this blog, celebrating the publication of ‘People at the heart of care’, the Government's adult social care reform White Paper."
        },
        {
            "text": "Social work and social care values are at its core. This is about valuing people and what matters to them, appreciating those who care for and support them, supported by a vision reminding us of our commitment to personalising care and support. This is about working alongside and with people with lived experience and a relentless ambition to ensure inclusion, better quality care and for people to live the lives they want to lead."
        },
        {
            "text": "The 10-year vision is underpinned by three key objectives, to make sure people:"
        },
        {
            "text": "Most importantly, it is worth acknowledging the significant investment announced for the next three years, funds intended to transform social care to make it work for all of us."
        },
        {
            "heading": 2,
            "text": "Funding the vision"
        },
        {
            "text": "'People at the heart of care' sets out priorities for the £1.7 billion investment and includes:"
        },
        {
            "text": "I have been so impressed with the huge amount of great policy work undertaken by Department of Health and Social Care colleagues, and the broad and comprehensive engagement with the sector – with over 200 organisations engaged in developing the vision and proposals, including the Principal Social Workers Network, British Association of Social Workers, social workers and occupational therapists in local authorities. Please do take the time to read it!  This is the next big step in the reform journey, one in which social care practitioners will have such a key and important role to play."
        }
    ]
}