{
    "url": "https://ukhsa.blog.gov.uk/2021/12/01/charting-a-course-to-end-hiv-transmission-in-england-by-2030/",
    "title": "Charting a course to end HIV transmission in England by 2030",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-01T15:11:25+01:00",
    "content": [
        {
            "text": "On World Aids Day 2021, a new Action Plan has been published to move towards ending HIV transmission, AIDS and HIV-related deaths in England by 2030. In January 2019 the government committed to this bold ambition and the four-year plan, developed by the Office for Health Improvement and Disparities (OHID) and the UK Health Security Agency (UKHSA), is designed to move us towards that goal."
        },
        {
            "text": "HIV stands for Human Immunodeficiency Virus. ‘Immunodeficiency’ refers to the weakening of the immune system by the virus. The virus has been passed on between humans for many decades and was identified in the early 1980s. In the 1980s and early 1990s, most people with HIV were eventually diagnosed with AIDS."
        },
        {
            "text": "Now, thanks to modern antiretroviral treatment, people with HIV can expect to live long healthy lives.  However, too many people are diagnosed with late stage HIV infection which means they have been living with undiagnosed HIV infection for around three to five years.  These people have a tenfold risk of death within a year of diagnosis compared to people diagnosed promptly. Due to advances in prevention, testing, treatment and care of those living with HIV, transmission in England has steadily reduced since 2014."
        },
        {
            "text": "There was a 34% reduction in new HIV diagnoses in England between 2014 and 2019. In 2019, an estimated 94% of people living with HIV had been diagnosed, 98% of those diagnosed being on treatment and 97% of those on treatment having an undetectable viral load – meaning they cannot pass the infection on even if having sex without condoms or PrEP (pre-Exposure Prophylaxis)."
        },
        {
            "text": "The Action Plan is benchmarking its objectives against 2019 statistics despite diagnoses falling again in 2020. This is because we are still understanding the impact that societal restrictions, less testing and limited access to sexual health services had on overall HIV transmission during the pandemic. We are also measuring how this unprecedented time in our history affected the overall health of people living with HIV."
        },
        {
            "text": "Last year on World Aids Day 2020, the HIV Commission, comprised of national charities including Terrence Higgins Trust, National AIDS Trust and Elton John AIDS Foundation called for an interim ambition that would chart the course towards 2020’s ultimate goal of ending transmission. An 80% reduction across new infections, AIDS diagnoses and deaths by 2025 was endorsed by government and the new Action Plan aims to:"
        },
        {
            "text": "The framework has been established and the focus, determination and investment across the health system is in place. Working with OHID and partners, UKHSA is committed to reaching everyone at risk of acquiring and transmitting HIV and to delivering effective combination prevention, testing, treatment and care. As numbers decrease, the approach will be refined to ensure everyone who needs support receives it."
        },
        {
            "text": "The plan includes four key objectives: prevent, test, treat and retain. It will ensure fair access to and uptake of HIV prevention programmes. HIV testing, in line with national guidelines will be scaled up. Those testing positive must receive rapid access to care and treatment. They must also receive all the support needed to remain in care. This includes improving the quality of life for people living with HIV and addressing the stigma through awareness raising and education."
        },
        {
            "text": "A national HIV Action Plan Implementation Steering Group comprised of all key partners, including the voluntary sector, will ensure progress is made in line with the plan’s aims."
        }
    ]
}