{
    "url": "https://civilservice.blog.gov.uk/2021/12/01/grief-awareness-week-2021/",
    "title": "Grief Awareness Week 2021",
    "authors": [
        "Linda Eades"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-01T10:05:43+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To mark Grief Awareness Week from 2 to 8 December, we want to signpost channels of support available from the Charity for Civil Servants. Linda Eades shares a new app designed to support staff  experiencing grief and loss. This post is part of our bereavement series from Adam Land. "
        },
        {
            "text": "Supporting those who experience bereavement and loss continues to be a Civil Service HR priority. As A Modern Civil Service, we recognise that colleagues will, at times, experience deep grief that’s part and parcel of life - and as an employer, we need to be flexible and empathetic to help you through it."
        },
        {
            "text": "Now, working with Civil Service HR and Civil Service Local Wales, staff at the Charity for Civil Servants have explored how they can best support civil servants struggling to cope."
        },
        {
            "text": "New app - Griefworks"
        },
        {
            "text": "One of the ways they believe they can help people experiencing bereavement and loss, or those with a terminal illness themselves, is through the provision of the Griefworks app developed by Julia Samuel MBE, Vice President of the British Association for Counselling and Psychotherapy."
        },
        {
            "text": "A leading grief psychotherapist, Julia [pictured left] has devoted the last 30 years to supporting bereaved families, and is the Founder Patron of Child Bereavement UK, with Prince William as royal patron."
        },
        {
            "text": "The app will be free to use for all civil servants, with subscription fees funded by the charity. It was recently launched onto the market and is currently available on iPhone. It will be available for use on Android devices early next year."
        },
        {
            "text": "Much needed Support"
        },
        {
            "text": "The app provides people with much needed support to process their emotions and navigate a path through their grief. During the pandemic, more than 3 million people passed away around the world and for each of these, at least nine people were affected. Many have lost loved ones, and whether it’s through the pandemic or not, grief is a life passage that inevitably touches us all at some stage.  "
        },
        {
            "text": "There are many different types of grief and the app supports all of these, including anticipatory grief, which is common among people with family or friends who are facing progressive or terminal conditions - but it’s also experienced by the person who is dying.  "
        },
        {
            "text": "Unresolved grief impacts our physical health. There are higher mortality rates, we are more vulnerable to infectious diseases, have higher blood pressure, sleeplessness and are at higher risk of suffering a heart attack or stroke.  "
        },
        {
            "text": "Unresolved grief"
        },
        {
            "text": "Nationally, 15% of mental health disorders stem from unresolved grief and pain leading to depression, anxiety, anger problems and substance misuse when people fail to receive the support they need. Counselling support is available through both the NHS and the Employee Assistance Programme, but sometimes this can take time to put in place after a bereavement. Some people feel that a stigma exists or that “therapy isn’t for them”. "
        },
        {
            "text": "Tools to help"
        },
        {
            "text": "The app contains course material (28 sessions, 15 minutes each) to help people work through their grief. There’s also a toolkit containing more than 30 tools to help people in the moment they need them and a journal so you can record your thoughts and emotions."
        },
        {
            "text": "In addition to the app, the Charity for Civil Servants is able to support those in need with a range of information from what to do when someone dies to supporting others through bereavement. They may be able to help with wellbeing advice and funeral costs too, depending on eligibility and circumstances."
        },
        {
            "text": "Adam Land: I want to thank Linda for sharing this information. The Charity does some amazing work to support colleagues and the app is a fantastic tool. "
        },
        {
            "text": "Civil Service HR hosted this year's Civil Service Mental Health and Wellbeing Conference, in partnership with the Charity for Civil Servants and Civil Service Sports Council (CSSC) from 4 to 15 October. "
        },
        {
            "text": "To access on-demand sessions with civil servants sharing their experiences and webinars with practical tips and tools from the Charity and CSSC, visit the Charity for Civil Servants’ website. "
        }
    ]
}