{
    "url": "https://deframedia.blog.gov.uk/2021/12/01/nuffield-report-on-gene-editing/",
    "title": "Nuffield Report on Gene Editing",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-01T15:35:53+00:00",
    "content": [
        {
            "text": "This morning, there was extensive coverage in The Daily Telegraph, The Guardian, BBC News, BBC Radio 4 Today Programme, Farming Today and others, of a new Nuffield Council on Bioethics report, urging the Government to ensure that animal welfare is at the heart of plans to introduce genome editing into farmed animal breeding."
        },
        {
            "text": "Following the Government’s recent response to the gene editing consultation, we have announced that we would be taking a step-by-step approach. This will start with plants only – following that, we will review the application to animals and microorganisms."
        },
        {
            "text": "We are strongly committed to science-based and proportionate regulation – and we will not reduce animal welfare standards."
        },
        {
            "text": "Leaving the EU has provided us with the opportunity to adopt a more scientific and proportionate approach to the regulation of organisms produced by genetic technologies such as gene editing."
        },
        {
            "text": "We recognise that there is strong public interest in how we regulate genetic technologies and that we need to proceed cautiously. That is why we are taking a step-by-step approach, and we will continue to engage with experts, businesses, NGOs, and the public throughout the process."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“We are taking a step-by-step approach to enable gene editing, starting with plants only and then reviewing the application to animals and microorganisms later."
        },
        {
            "text": "“We are committed to proportionate, science-based regulation and we will not reduce safety or animal welfare standards.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}