{
    "url": "https://socialcare.blog.gov.uk/2021/12/01/people-at-the-heart-of-care/",
    "title": "People at the heart of care",
    "authors": [
        "Michelle Dyson"
    ],
    "categories": [
        "Care and support",
        "Information sharing",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2021-12-01T13:39:04+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Clear objectives, complex challenges"
        },
        {
            "text": "The desire to reform, rebuild and strengthen social care has been a longstanding ambition of successive governments and, while these objectives may be simply put, achieving them has often been anything but."
        },
        {
            "text": "This week, we took another big step forward with the publication of People at the Heart of Care, our adult social care system reform white paper. In developing this landmark document, we have engaged with hundreds of diverse organisations and individuals from across the social care sector, including those with lived experience of providing and drawing upon care and support."
        },
        {
            "text": "It’s been great to debate, discuss and fine tune reform proposals in the white paper with people and organisations who deeply understand the challenges faced on the frontline, and how we can overcome them to deliver a social care system that works for everyone."
        },
        {
            "text": "Elsewhere on this site, you’ll find blogs from members of our white paper working groups, including the Association of Mental Health Providers and Mencap, on the collaborative work we’ve been doing."
        },
        {
            "text": "Together, we’ve been building our vision for a reformed system around three principles, as set out by our Secretary of State for Health and Social Care, Sajid Javid:"
        },
        {
            "text": "You can read in detail here how new funding will better connect housing with health and care, drive the uptake of new assistive technologies, and advance the digitisation of health and social care records."
        },
        {
            "heading": 2,
            "text": "Workforce investment"
        },
        {
            "text": "This is all really exciting, but for any reform plan to succeed, it needs a dedicated, supported and truly valued care workforce at its heart. When I’ve attended visits, I’ve seen the amazing work of care colleagues first hand – and I am always bowled over by their compassion, skills and dedication to caring for others."
        },
        {
            "text": "That’s why at least £500 million of the £1.7 billion we’re investing has been allocated to make sure the social care workforce has the right skills, training and qualifications it needs to support the complex and ever changing care needs of our growing and ageing population. Government is also funding initiatives to provide more wellbeing and mental health support and to improve access to occupational health."
        },
        {
            "text": "It’s the same ethos driving the £25 million allocated to kick start further improvements to support for unpaid carers. See also the £70 million to improve the delivery of care and support services, including assisting local authorities to better plan and develop support in their regions."
        },
        {
            "heading": 2,
            "text": "The long game"
        },
        {
            "text": "None of this is a quick fix, but aside from the obvious desire to improve access, provision and service quality for our communities, this is about creating and sustaining a care sector with the widest and most rewarding careers possible."
        },
        {
            "text": "Our Made with Care campaign has shown how transformative, empowering and varied careers in care can be. From care homes, to domiciliary care, to personal assistants, there are so many ways to make a positive difference in people’s lives."
        },
        {
            "text": "The White Paper does not mark the end of the reform conversation, but the beginning of the next phase of positive engagement with sector partners, charities, communities and people with lived experience."
        },
        {
            "text": "We know lasting reform cannot be achieved in isolation. If we continue to collaborate, innovate and roll out new person centred care systems, we can help build communities where no one is alone and everyone is supported to live long, healthy and happy lives in the place they call home."
        }
    ]
}