{
    "url": "https://socialcare.blog.gov.uk/2021/12/01/reform-will-be-driven-by-an-empowered-workforce/",
    "title": "Reform will be driven by an empowered workforce",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2021-12-01T13:46:31+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making the most of our people"
        },
        {
            "text": "With or without reform, the quality, reliability and effectiveness of our adult social care system depends on a workforce that feels valued, supported and encouraged to be the best."
        },
        {
            "text": "It is no accident this White Paper is called ‘People at the Heart of Care’. It is about people delivering services and also those receiving them. That’s why I’m delighted at least £500 million of the £1.7 billion announced will be used to transform the way we support, sustain and develop the workforce. Much of this support will be focused on levelling up the knowledge, skills and experience of care colleagues across the sector."
        },
        {
            "text": "By establishing a new knowledge and skills framework (KSF), promoting varied careers pathways and making the most of additional investment in learning and development, alongside support for careworkers and other staff, we can provide the professional progression our registered workforce, including registered managers (RMs) need and deserve."
        },
        {
            "text": "Indeed, RMs are arguably the backbone of the social care system and undoubtedly proved their worth during the pandemic. The more we can do to support them with the best training and workplace resources, especially during their first year in post, the more they can do for the teams they lead. In this respect, they are critical to mobilising and leading the reform agenda in the workforce."
        },
        {
            "heading": 2,
            "text": "Demonstrating high standards"
        },
        {
            "text": "Care certificates, for example, will create a new delivery standard recognised across the sector, which will facilitate more rewarding career paths for all colleagues and make sure there is a knowledge baseline for every care role. The new delivery standards will also mean these certificates are portable, allowing new and existing staff to move roles with greater ease without the need to repeat training. These changes will mean care certificates will form part of a robust induction programme for those new to social care and offer a clear demonstration they have the skills needed to deliver great care."
        },
        {
            "text": "I’m also pleased to see continuous professional development (CPD) budgets boosted for registered nurses, nursing associates, occupational therapists, and other allied health professionals. Social care is such a broad church of talents, it is essential we level up with NHS colleagues and ensure equal access to learning and development."
        },
        {
            "text": "This includes additional investment in social worker training routes at a time when adult social work increasingly intersects with other care and clinical professions, especially in respect of the Mental Health and Mental Capacity Acts. You can read more about this aspect of reform in the Chief Social Worker for Adults, Lyn Romeo’s latest blog."
        },
        {
            "heading": 2,
            "text": "Future proofing the care sector"
        },
        {
            "text": "All of this is in service to building professionalism, workforce confidence, and taking the exemplary practice we have seen during the pandemic and embedding it in a care sector fit for the future."
        },
        {
            "text": "And ‘fit for the future’ also means supporting the mental health and general wellbeing of care colleagues performing increasingly complex roles. As a result of these reforms, we want many more of them to know and feel social care is a rewarding career with clear opportunities to develop, progress and feel valued for the positive changes they bring to those they care for."
        },
        {
            "text": "Social care is not a concept - it is about real life and making a difference. These reforms, we hope, will help make it a better life for all of us."
        }
    ]
}