{
    "url": "https://environmentagency.blog.gov.uk/2021/12/01/regulating-a-geological-disposal-facility-to-protect-the-environment/",
    "title": "Regulating a geological disposal facility to protect the environment",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2021-12-01T14:53:59+00:00",
    "content": [
        {
            "text": "Dr Candida Lean, a Nuclear Waste Assessor at the Environment Agency, reports on our work in West Cumbria and Lincolnshire to share information with communities about the regulation of a geological disposal facility."
        },
        {
            "text": "I’ve worked at the Environment Agency for 9 years. My background is in earth sciences and I specialise in the management and disposal of radioactive waste and contaminated land. I’m leading our work to provide regulatory support and advice about Radioactive Waste Management’s (RWM) project to find a site for a geological disposal facility."
        },
        {
            "text": "The UK's radioactive waste"
        },
        {
            "text": "The UK’s radioactive waste comes from nuclear power, research and defence programmes, as well as from industries, hospitals and universities that use radioactive material."
        },
        {
            "text": "Some of this waste, known as ‘higher activity waste’, is unsuitable for disposal in the UK’s existing disposal facilities for radioactive waste. Government policy is that geological disposal is the best available approach for managing higher activity waste in the long term. A consent-based process to find a location for a Geological Disposal Facility (GDF) in England and Wales has started. The process is initially community-led, with a partnership approach between local communities and the developer, Radioactive Waste Management. Support from a host community is required before construction starts."
        },
        {
            "text": "Reviewing RWM's work"
        },
        {
            "text": "You can read about our ongoing reviews of RWM’s work in our latest annual report. We’ve highlighted that RWM continues to make progress in a number of areas, including improving its approach to modelling the impacts of non-radiological contaminants. However, further work is required for RWM to establish itself as an organisation suitable to hold an environmental permit."
        },
        {
            "text": "Our work to support communities"
        },
        {
            "text": "Finding a safe solution for the long-term management of the most hazardous radioactive waste is a challenge and we’ve got an important part to play in regulating to protect the environment and supporting community involvement."
        },
        {
            "text": "Two GDF Working Groups formed in West Cumbria during 2020-21 (Copeland GDF Working Group and Allerdale GDF Working Group). And in October another Working Group launched in Theddlethorpe (Lincolnshire)."
        },
        {
            "text": "The role of a working group is to engage and understand views on hosting a GDF, identify and propose a search area(s) and recruit members for a Community Partnership. A Community Partnership has formed in Mid Copeland and the second – in South Copeland – will be launched in a few weeks. Other areas may follow."
        },
        {
            "text": "The Environment Agency, along with the Office for Nuclear Regulation, will regulate a GDF in England. As independent regulators, we are not involved decisions about a site and our formal regulation will start after a site (or sites) has been selected for site investigation."
        },
        {
            "text": "We’re keen to encourage and enable people’s input into this process. It’s really important to us that people are involved in decisions that affect their community."
        },
        {
            "text": "During September we attended exhibitions organised by Copeland GDF Working Group to talk with members of the community about geological disposal. It provided us with an excellent opportunity to meet people. We’ve also shared information about regulation in the Allerdale GDF Working Group newsletter and information about regulation has been made available at community events around Theddlethorpe."
        },
        {
            "text": "We heard mixed views and listened to concerns about the impact on the environment. We also discussed how we will regulate a geological disposal facility, and how our work will help protect people and the environment now and in the future."
        },
        {
            "text": "We hope to get out and meet communities in Copeland, Allerdale and Theddlethorpe in the months ahead."
        },
        {
            "text": "You can watch a short animation about our role regulating a future GDF. YouTube."
        },
        {
            "text": "We’ve also posted information on our website and the Office for Nuclear Regulation’s website."
        },
        {
            "text": "Email us to join our e-bulletin list for news about regulation of nuclear sites across England. nuclear@environment-agency.gov.uk"
        }
    ]
}