{
    "url": "https://marinedevelopments.blog.gov.uk/2021/12/01/working-together-to-protect-important-marine-habitats-in-studland-bay/",
    "title": "Working together to protect important marine habitats in Studland Bay",
    "authors": [
        "MMO Marine Conservation Team"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2021-12-01T10:15:31+00:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) recently announced the introduction of a voluntary no-anchor zone in Studland Bay Marine Conservation Zone (MCZ)"
        },
        {
            "text": " "
        },
        {
            "text": "In this blog, Chris Graham from MMO’s Marine Conservation Team answers questions that came up during the consultation."
        },
        {
            "text": "Why is management needed? "
        },
        {
            "text": "Studland Bay is popular for recreational activities but anchoring activity within the seagrass beds in the MCZ is causing issues. Anchors from recreational boats can damage seagrass fronds and roots when they embed into the seabed. Dragging an anchor can uproot seagrass and anchor chains can scrape the seabed. The seagrass beds in the area are home to a protected species of seahorse and other wildlife as well as important fish stocks. Seagrass beds also provide a number of vital ecological functions. Most notably, seagrass beds stabilise sediments, provide habitat for many species including commercially important fish and act as a sink for atmospheric carbon. "
        },
        {
            "text": "What is MMO introducing? "
        },
        {
            "text": "A voluntary no-anchor zone is being implemented on the 17 December 2021 in Studland Bay MCZ. The first six-month phase covers the smaller core area of seagrass from 17 December 2021 followed by a larger voluntary area from 1 June 2022. This voluntary approach, with everyone working together, will lead to better protection for the site and the important habitats and species which call Studland Bay MCZ home, while still recognising the importance of the bay for recreational activities.  "
        },
        {
            "text": "A voluntary approach will put the future of the bay in the hands of those who use it. It allows ‘participatory management’, meaning users of the bay can work together with MMO and other organisations towards a shared aim to protect the site. The consultation and feedback suggest there is a will to work collectively to make this happen.  "
        },
        {
            "text": "If the voluntary approach doesn’t work, MMO could consider a statutory byelaw to prevent anchoring and, if an urgent need to protect the site arises, could introduce an emergency byelaw. "
        },
        {
            "text": "How will I know where I can and can’t anchor? "
        },
        {
            "text": "We will have all the relevant information for recreational boaters on our website. We have notified the UK Hydrographic office so navigational charts can be updated, we are producing leaflets and we have spoken with owners of maps and signage in Studland Bay to include the details of the no anchor zone.  "
        },
        {
            "text": "Who is going to monitor this? "
        },
        {
            "text": "MMO will monitor anchoring activity in Studland Bay, through its coastal marine officers based in the area. "
        },
        {
            "text": "Where is best to moor my boat from 17 December?"
        },
        {
            "text": "There are a number of moorings in Studland Bay MCZ including 10 advanced mooring systems within the seagrass bed which have been installed by Boatfolk and The Seahorse Trust. These are available for public use free of charge.   "
        },
        {
            "text": "It is at the discretion of boat users to decide whether moorings are suitable for their boat and that they have sought permission where required to use moorings."
        },
        {
            "text": "What is an advanced mooring system? "
        },
        {
            "text": "These are also known as eco-moorings, or eco-friendly moorings. They avoid the characteristics of a traditional swing mooring, which involve placing large mooring blocks on the seabed and a chain attachment that can cause abrasion. There are different fixing methods available as well as the use of floats or elastic lines to avoid chain abrasion. There is more useful information on the RYA website. "
        },
        {
            "text": "Why is the larger no-anchor zone not coming into full effect until June 2022? "
        },
        {
            "text": "Stakeholders highlighted the importance of bringing in measures gradually to give users of the bay time to adapt. In June 2022, the voluntary no-anchor zone will extend to the majority of the seagrass beds by which time boaters will have had time to explore alternatives to anchoring in sensitive areas of the MCZ. "
        },
        {
            "text": "Why is the focus on anchoring and not other activities? "
        },
        {
            "text": "MMO recognise that a range of potential impacts on seagrass exist, from pollution, ocean acidification and sea level rise, to agricultural and urban run-off and invasive species. MMO is responsible for managing pressures caused by marine non-licensable activities, which are generally recreational activities. Impacts caused by boating activity therefore fall within the duties of MMO to manage. Impacts caused by other activities may be managed by other agencies. "
        },
        {
            "text": "How can I install an advanced mooring system? "
        },
        {
            "text": "We are working with local stakeholders to facilitate the installation of additional advanced mooring systems. There is guidance for anyone planning to install moorings in the Studland Bay MCZ Habitat Protection Strategy (available online), including how to apply for the required marine licence from MMO.  "
        },
        {
            "text": "Our leaflet for boaters explains the no anchor zone and how to find more information."
        },
        {
            "text": "For more information on MMO’s work in Studland Bay MCZ, please visit the dedicated page on GOV.UK.  If you have any questions, please contact us on Conservation@marinemanagement.org.uk. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}