{
    "url": "https://deframedia.blog.gov.uk/2023/10/31/guardian-article-on-english-flood-defences/",
    "title": "Guardian article on English flood defences",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2023-10-31T12:11:51+00:00",
    "content": [
        {
            "text": "An article published in the Guardian yesterday covered England’s flood defences with analysis of Environment Agency data."
        },
        {
            "text": "At the end of 2022/23, 95% of Environment Agency-maintained flood assets in high consequence systems – those located where there is a high concentration of properties – were in fair condition or above, which means we would expect these assets to function as designed during a flood. This is an increase from 92% in March 2022."
        },
        {
            "text": "There are around 256,000 assets with a flood or coastal risk management purpose in England. More than 165,000 of these are maintained by riparian owners, third parties who own the land next to the river. The Environment Agency works with third party asset owners to ensure the condition of their assets is understood and repairs are undertaken as necessary."
        },
        {
            "text": "On average, the Environment Agency carries out more than 165,000 inspections of flood risk management assets each year. This includes a planned annual programme of 147,000 inspections, plus further inspections where needed. We inspect both our own assets and the third-party assets that form part of a system."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "You can find out if you are at risk of flooding by checking your postcode on the government’s website and you can also sign up for flood warnings. You will be alerted by phone, email or text when flooding is expected."
        },
        {
            "text": "Follow Defra on Twitter and sign up for email alerts here"
        }
    ]
}