{
    "url": "https://teaching.blog.gov.uk/2023/10/31/how-the-early-career-framework-ecf-is-supporting-teachers-in-my-school/",
    "title": "How the Early Career Framework (ECF) is supporting teachers in my school",
    "authors": [
        "Emily Clark"
    ],
    "categories": [
        "Support for ECTs"
    ],
    "pub_date": "2023-10-31T11:28:51+00:00",
    "content": [
        {
            "text": "Emily Clark is the Principal of Edington Victoria Academy in Doncaster. In this blog, she shares her school’s experience of implementing ECF-based induction and how Early Career Teachers (ECTs) have responded to the reforms."
        },
        {
            "text": "The ECF reforms have had a big impact on ECTs experiences"
        },
        {
            "text": "Our ECTs feel valued as time is given to their development; the programme is carefully structured, and sessions are tailored to their needs which enables them to focus on their professional growth. All the training is underpinned by a huge range of resources and research that new teachers might have struggled to access previously."
        },
        {
            "text": "The new 2-year induction programme is very research driven and really useful for ECTs. The increase in length of the induction programme is allowing ECTs to develop their skills further and I can see ECTs in our school becoming more  independent, and better prepared for the future."
        },
        {
            "text": "Mentors and induction tutors"
        },
        {
            "text": "The training available for mentors is fantastic, it enables them to give valuable support to ECTs."
        },
        {
            "text": "The protected time off timetable is really useful for observations, coaching, mentoring sessions and helps the teachers feel supported."
        },
        {
            "text": "It’s important that schools are clear about the induction tutor role so that it is not blurred or mixed in with the work of the mentor. It is not about coaching, mentoring or providing the on the ground support for ECTs, instead the induction tutor has oversight of ECTs progress and makes formal evaluations. The induction tutor should ideally be separate to the mentor to enable both roles to function effectively. This way, the ECT has someone to go to on a day to day basis as well as someone who’s there to offer support and troubleshoot any wider issues. The induction tutor in our academy has made a massively positive impact and I’ve been able to see a visible shift in confidence and personal growth for both mentors and ECTs."
        },
        {
            "text": "Developing ECTs skills and confidence "
        },
        {
            "text": "The programme ECTs are following is relevant and enables them to apply this directly to their classrooms. For example, the first module on pupil learning, routines and behaviour systems is having a massive impact. This is so important in the first stages of teaching, and I have seen ECTs implementing their learning in the classrooms. They also share their learnings and success stories with their peers."
        },
        {
            "text": "ECT modules are well tailored to what ECTs need and follow on from prior learning. The initial audits are useful and allow ECTs to reflect on where they are as a practitioner. The audits also support both the ECT and mentor to decide how much time needs to be given to each area. A lot of our ECTs  already had strengths in fulfilling wider professional responsibilities so mentors spent more time focusing on weaker areas such as making productive use of assessments."
        },
        {
            "text": "The programme has a very collaborative approach where ECTs share advise, and this networking is vital for building confidence."
        },
        {
            "text": "My ‘top tips’ to support mentors and ECTs to access their time off the teaching timetable"
        }
    ]
}