{
    "url": "https://defraenvironment.blog.gov.uk/2023/10/31/local-nature-recovery-strategies-coordinating-and-collaborating-on-action-for-nature/",
    "title": "Local Nature Recovery Strategies: coordinating and collaborating on action for nature",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Land use",
        "Local Nature Recovery Strategies"
    ],
    "pub_date": "2023-10-31T09:53:10+00:00",
    "content": [
        {
            "text": "It is widely recognised that England is one of the most nature-depleted countries in the world, ranking in the bottom 10% globally for biodiversity. It has become increasingly clear in recent years that if we are to deliver our target to halt, and then reverse, the decline of nature, it is not enough to protect only the best habitats and rarest species. We need to recreate habitats we have lost, too. "
        },
        {
            "text": "Government has committed to achieving this goal in the Environmental Improvement Plan 2023, backed up by the Environment Act 2021. Local Nature Recovery Strategies (LNRS) are a key new tool to help make this possible. Read on to find out more about them!"
        },
        {
            "text": "Going local "
        },
        {
            "text": "Underpinning LNRSs is the knowledge that we will achieve more for nature by working together and by targeting our collective efforts where it will have most impact. Doing this means working locally so that we can involve people who know and understand the land, and who have much of the control over how it is used and managed. "
        },
        {
            "text": "In June, Defra announced the 48 local authorities who have been appointed as LNRS “responsible authorities”. Covering the whole of England with no gaps or overlaps, these responsible authorities will lead the preparation of the LNRS for their area. All 48 areas will need to follow requirements set out in the Environment Act and the LNRS regulations and guidance when preparing their strategies. Together these rules will make sure that each LNRS contains broadly the same things and follows a similar process in preparing the strategy, ensuring national consistency whilst reflecting the unique local circumstances of each area. "
        },
        {
            "text": "For LNRSs to deliver the best outcomes for nature, it is critical that they build-in strong local support throughout the preparation process. Responsible authorities must work closely with other local authorities and National Parks within their strategy area. Natural England – Government’s adviser on nature – should ensure consistency and ambition across the country.  "
        },
        {
            "text": "Responsible authorities must also think about which other local groups and organisations they need to involve and carry out a public consultation as part of strategy preparation. We are especially keen for landowners, managers and farmers to participate early and extensively in LNRS development and subsequent delivery.  "
        },
        {
            "text": "What’s in a Local Nature Recovery Strategy? "
        },
        {
            "text": "All LNRSs will contain a local habitat map and a written “statement of biodiversity priorities”. The written part of each LNRS will summarise the current state of nature in the strategy area, set priorities for nature’s recovery and identify the practical actions for achieving those priorities.  "
        },
        {
            "text": "Although the central purpose of LNRSs is to restore and enhance nature, the strategies won’t just focus on nature in isolation. LNRSs recognise the fact that recovering nature has the power to address wider environmental issues including climate change, flooding and poor water quality. These issues can be included as LNRS priorities, and the nature-based solutions for addressing them are expected to be proposed as practical actions in every strategy.  "
        },
        {
            "text": "The real heart of each LNRS is the local habitat map. Each map will identify areas recognised for their existing importance for nature, and crucially, areas that could become important for nature recovery with the right actions. These potential areas for nature recovery will be identified based on their suitability for delivering the strategies’ priorities; they will also be targeted as areas to expand or join-up existing areas of habitat so that they are more robust and better connected.  "
        },
        {
            "text": "How will LNRSs make change on the ground? "
        },
        {
            "text": "LNRSs will identify where action for nature would be particularly beneficial, not dictate what actions must take place where. This is to encourage ambition and broad, positive engagement with the actions that are needed to help nature recover.  "
        },
        {
            "text": "To make sure LNRSs aren’t just positive intentions, Government has designed them to work with a suite of different policies which together will encourage and enable people to carry out actions that the LNRS proposes.  "
        },
        {
            "text": "One of the key policies that will drive LNRS delivery is Biodiversity Net Gain (BNG), which will require developers to create or improve habitat to get permission for their development. Crucially, habitat restored in areas identified in the local nature recovery strategy is given a higher value in the biodiversity metric, since targeted action in these areas will have a greater benefit for nature. This will reward developers who align their net gain plans with the relevant local nature recovery strategy.  "
        },
        {
            "text": "More information on how LNRS will join-up with other policies can be found in the LNRS policy paper. "
        },
        {
            "text": "What’s the latest with LNRS? "
        },
        {
            "text": "Responsible authorities across England are now making progress on the preparation of their LNRS. There is no fixed legal deadline for responsible authorities to complete and publish their LNRS, but Government expects preparation to take 12-18 months, based on the experience of five LNRS pilots.  "
        },
        {
            "text": "Front-runners are beginning the first LNRS step: mapping areas that are already of particular importance for biodiversity. Many are also finalising governance structures and engaging key local stakeholders. "
        },
        {
            "text": "Defra, Natural England, the Environment Agency and the Forestry Commission are all providing support to responsible authorities and keeping track of their progress. We have provided them with an online data viewer, including a national habitat map, to make it easier to access relevant Government held data that can inform the preparation of their strategies. "
        },
        {
            "text": "We are also continuing to work on joining-up LNRS with other policies to help with their delivery. Just last month, Government amended the Levelling Up and Regeneration Bill to further encourage the delivery of LNRSs, which will also help the planning system play a more proactive role in nature recovery. "
        },
        {
            "text": "To find out more about the LNRS for your area and how you can get involved, head to our guide to responsible authority areas and contacts. Each responsible authority is currently preparing a dedicated LNRS webpage where you will be able to track the progress of your local LNRS and find out about upcoming engagement events. LNRSs are designed to be collaborative at their core, so get involved to make your voice heard. "
        },
        {
            "text": " "
        }
    ]
}