{
    "url": "https://nationalscreening.blog.gov.uk/2023/10/31/progress-update-on-uk-nscs-recommendation-to-screen-for-tyrosinaemia/",
    "title": "Progress update on UK NSC’s recommendation to screen for tyrosinaemia",
    "authors": [
        "Miranda Lawton"
    ],
    "categories": [
        "General",
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2023-10-31T20:47:27+00:00",
    "content": [
        {
            "text": "In February, we blogged about the UK National Screening Committee’s (UK NSC’s) recommendation to introduce screening for Hereditary Tyrosinaemia Type 1 (HT1) in newborns."
        },
        {
            "text": "Screening for the very rare genetic condition could increase the number of babies with HT1 who are detected before the onset of symptoms. These babies could then be offered drug treatment and a special diet, avoiding liver disease and the need for liver transplantation."
        },
        {
            "text": "When making its recommendation, the UK NSC identified preparatory work that would need to be done before approval was sought from the 4 UK governments for screening to be implemented."
        },
        {
            "text": "These preparatory tasks included:"
        },
        {
            "text": "An HT1 oversight group has been set up to oversee this work and has met 3 times to date. It has also established 2 sub-groups to plan work and develop products that could be used by all 4 UK nations. The laboratory expert sub-group has met 3 times and the clinical and information sub-group has met 4 times."
        },
        {
            "text": "These groups include representation from each of the 4 UK nations, Metabolic Support UK, NHS clinicians, newborn blood spot programme and lab managers, and other screening experts."
        },
        {
            "text": "The oversight group also includes Prof Ute Spiekerkötter, from the University of Freiburg in Germany, who has shared the German screening experience, guidance and detailed protocols. In addition, the group is learning from other international colleagues in Quebec and the Netherlands."
        },
        {
            "text": "We will keep you updated via the blog as this work progresses."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}