{
    "url": "https://openpolicy.blog.gov.uk/2023/10/31/shifting-policy-systems-a-framework-for-what-to-do-and-how-to-do-it/",
    "title": "Shifting policy systems – a framework for what to do and how to do it.",
    "authors": [
        "vanessalefton",
        "alexfleming"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2023-10-31T13:14:28+01:00",
    "content": [
        {
            "text": "Systems change is hard work, and it takes time. The reality is that no single system map or tool is enough to get you from point A to point B, from system now to system next. Over the last year, we have explored the latest in systems change theory and applied it to policymaking. In this four part blog series, we share our reflections on the wealth of knowledge we’ve gained working on intractable issues surrounding how support is delivered for people experiencing multiple disadvantage. Along the way, we realised that we need to make new tools to support policy teams to do this deep work in the future, and to see afresh the limitations of existing mental models for change and transformation."
        },
        {
            "text": "Policy Lab has previously written about systems mapping as a useful process for understanding the interconnected nature of factors and actors that make up policy ecosystems. Here, we share our latest experimentation on how we can generate practical ideas for long-lasting and systemic change."
        },
        {
            "text": "This blog includes:"
        },
        {
            "text": "Multiple disadvantage - a policy area that requires a systemic approach"
        },
        {
            "text": "There are over 363,000 adults across England experiencing multiple disadvantage – including combinations of homelessness, substance misuse, mental health issues, domestic abuse and contact with the criminal justice system."
        },
        {
            "text": "People facing multiple disadvantage are likely to interact with multiple services and professionals at the same time: probation, the drugs service, charities, the housing office, the job centre, local health centre and so on. Without better coordination around the person, there is a risk that the third sector and different tiers of government deliver overlapping, and sometimes diverging, policies and services to the same individual."
        },
        {
            "text": "– Sophie, Greater London "
        },
        {
            "text": "In 2019 the Shared Outcomes Fund (SOF) announced £200 million to fund pilot projects testing innovative ways of working across the public sector. One focus of the SOF was to take steps to break down silos. The SOF funded the Changing Futures Programme team in the Department for Levelling Up, Housing and Communities (DLUHC) to improve outcomes for people facing multiple disadvantage. To approach this complex policy area, the programme partnered with Policy Lab, creating a multi-disciplinary team including ethnographers, designers and systems thinkers, which focussed on addressing the following challenge question: How can we ensure that central government enables flexible and person-centred frontline delivery models on an ongoing basis for people facing multiple disadvantage?"
        },
        {
            "text": "A network of 126 people worked towards shifting the system and codesign interventions for change. Participants included people with lived experience of multiple disadvantage, policymakers from across DLUHC, the Department for Work and Pensions (DWP) Home Office, Ministry of Justice (MoJ) and Department for Health and Social Care (DHSC), NHS, local government, third sector, and academics."
        },
        {
            "text": " "
        },
        {
            "text": "– National government policymaker"
        },
        {
            "text": "A mixed method approach  "
        },
        {
            "text": "We combined several methodologies to address the systemic policy challenges relating to multiple disadvantage. The project included co-design, systems change, ethnography and art in policy, all playing different roles at different points through the 9-month project.  "
        },
        {
            "text": " For our systems change practice, we largely drew on two frameworks: Building Better Systems by Jennie Winhall and Charles Leadbeater and the Three Horizons framework created by Bill Sharpe. The former, provides a way to understand the systems that we operate within, and why and how they might need to change. The latter offers an approach for understanding the current landscape (Horizon One), the future desired landscape (Horizon Three), and steps towards that future over time (Horizon Two).  "
        },
        {
            "text": " The project went through three phases. Below we set out how we applied our mix of tools and methods during each phase:  "
        },
        {
            "text": "  1. Understanding the current system "
        },
        {
            "text": "Our first phase was to learn about the current policy system. We took a systemic lens by listening to people facing multiple disadvantage, their support networks, and local and national policymakers working on related services. We created a participatory evidence discovery to bring together information about multiple disadvantage - including the existing policy infrastructure - by engaging people with lived experience, academics, and sector professionals. We carried out film ethnography, involving 29 participants in three areas across England (Greater London, East Midlands and the Northeast). We analysed our research insights around the ‘four keys’: exploring how power, purpose, resource flows and relationships are currently operating. "
        },
        {
            "text": "– Head of Public Health, Local Authority "
        },
        {
            "text": "2. Creating a future vision "
        },
        {
            "text": "In our second phase, we drew on people’s lived experience to co-design a future vision and future values. During five workshops with our cross-system group of 126 people, we used design methodology and collective imagining tools to think about the future. Our methods were informed by frameworks from a global movement of systems change experts and future thinkers, calling for a creative re-imagining of current social infrastructures. This co-created future vision enabled the group to articulate future values and draw on the four keys: power, purpose, relationships and resource flows, to articulate what the future system should look and feel like."
        },
        {
            "text": "– Jane, North East England"
        },
        {
            "text": "3. Building steps towards that vision "
        },
        {
            "text": "In our third phase of work, we identified ideas to move towards our co-created vision. This involved extensive design research with around 50 policymakers and sector experts. We then brought together the cross-system group to generate hundreds of ideas for change. Together we prioritised five ideas to develop into ‘interventions’. We iterated the interventions through one off interviews, roundtable discussions and regular co-design with the Changing Futures team at DLUHC. We tested them through workshops and in local areas, mapped them together and facilitated the Changing Futures team to roadmap possible next steps.  "
        },
        {
            "text": "– Deputy CEO, multiple disadvantage charity"
        },
        {
            "text": "Early signs of change "
        },
        {
            "text": "This project aimed to shift systems around multiple disadvantage. Rather than short term fixes, we focused on fundamental structures and relationships in local and national government work. This quote is an indication of the impact on the DLUHC Changing Futures policy team’s long-term thinking:"
        },
        {
            "text": "– Commissioning team, DLUHC"
        },
        {
            "text": "Systemic values enrich systemic methods"
        },
        {
            "text": "So far, we have described a very practical, chronological, methodology for applying systems change frameworks to a real-life policy challenge. From our work in the multiple disadvantage policy system, we have learnt that it is not just what you do, but how you do it. Our approach was underpinned by these ‘hows’:"
        },
        {
            "text": "Start by modelling in your work the new system values and the ways of working that you would expect to see in the ideal long term. This will reveal the constraints and circumstances that need to change to enable new ways of being. Putting in place the new system values will also help to influence culture norms, giving others confidence to do the same. In systems innovation, this is called moving from ‘“system now” to “system next”, or the system as it is, to the system as it could be.’ (Charles Leadbeater, Systems Innovation Initiative, 2023)."
        },
        {
            "text": "There is no silver bullet, model, pilot or innovation that can fix systemic challenges. Shifting systems requires multiple transformative innovations at different times and levels in the system – many of which can only be maximised by being interdependent. It requires continuous observing, learning, investing-in and enabling of the things that are working. Work with people in your system to co-design a set of future values. These can be used as a lens to measure if the interventions are working. Invest in and enable interventions that move towards your collective vision."
        },
        {
            "text": "People across your systems will play crucial roles in moving forward towards your shared vision. Build a coalition of changemakers, who are open, and hold some power to influence others and make change. Diverse and strong relationships are also crucial to the quality of ideas that emerge. Relationships with people across the system will keep you on course towards a shared goal and purpose. The importance of facilitation or convening this coalition of changemakers cannot be underestimated to maintain momentum. From the outset of the multiple disadvantage project, we launched a large cross-system group of experts, centring people with lived experience, to share their insights with us through five workshops involving 126 number of participants over nine months. We built close relationships with the National Expert Citizen Group (NECG) to understand a range of lived experiences and sought advice from sector experts through the Expert Stakeholder Group (ESG)."
        },
        {
            "text": "– Commissioning team, DLUHC"
        },
        {
            "text": "A matrix for practical policy change"
        },
        {
            "text": "Based on our own journey, we have created a practical guide for taking a multi-disciplinary approach to systems change in policy."
        },
        {
            "text": "From services to systems - how to improve policy"
        },
        {
            "text": "This work reflects a transition from co-designing services to co-designing shifts in systems. There is a deepening movement of change makers who are using creativity and the imagination as practical tools for systems change. We’ve been inspired by the global community of organisations and individuals carrying out this work."
        },
        {
            "text": "In our next blog, we launch “Systemic”; a game designed to build capacity in the systems change frameworks and support critical reflection. If you’d like to discuss working with Policy Lab on your own systemic issue, get in touch."
        }
    ]
}