{
    "url": "https://deframedia.blog.gov.uk/2023/02/22/coverage-of-sir-james-bevans-speech-reflections-on-water-the-good-the-bad-and-the-future/",
    "title": "Coverage of Sir James Bevan’s speech: ‘Reflections on water: the good, the bad and the future’",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-02-22T15:30:18+00:00",
    "content": [
        {
            "text": "On Tuesday 21 February, Environment Agency Chief Executive Sir James Bevan delivered a keynote speech at the World Water-Tech Innovation Summit entitled ‘Reflections on water: the good, the bad and the future’."
        },
        {
            "text": "In what was his final speech on water, Sir James Bevan reflected on the debate around water quality over his seven years as Environment Agency Chief Executive. ‘More facts not assertions’ are needed, according to Sir James, who went on to say that achieving clean and plentiful water is “easy to say but hard to do”."
        },
        {
            "text": "There has been coverage in The Telegraph, The Times, ENDS Report, Utility Week, Water Magazine and on the Sky News Climate Show of the speech, focusing on Sir James’ call for everyone to “play their part” when it comes to improving water quality. Coverage notes that while improvements have been made in areas such as bathing water standards and storm overflow monitoring, Sir James acknowledged water quality has “flatlined”."
        },
        {
            "text": "He urged farmers and water companies to “clean up their act” and outlined how the Environment Agency is playing its part through enforcement, monitoring and action on the ground."
        },
        {
            "text": "Concluding his speech, Sir James said:"
        },
        {
            "text": "For the speech in full: Reflections on water: the good, the bad and the future"
        },
        {
            "text": "Follow the Environment Agency on Twitter."
        }
    ]
}