{
    "url": "https://socialcare.blog.gov.uk/2023/02/22/data-and-the-drive-to-transform-social-care/",
    "title": "Data and the drive to transform social care",
    "authors": [
        "Michelle Dyson"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Consultations and surveys",
        "Information sharing",
        "Innovation",
        "Integrated care",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-02-22T13:59:17+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Building the evidence base"
        },
        {
            "text": "We all share the same goal – to make sure our friends, families and loved ones live life to the full and, in times of need, receive good quality care and support. On visits to care settings and local authorities, most recently in Greater Manchester, I have seen the amazing work of those in the care sector and the impact they have on people’s lives."
        },
        {
            "text": "Compared to other sectors, however, the care sector lacks strong analytical underpinnings, both in terms of an evidence base of what works and in terms of data and appropriate access to it for those who could benefit."
        },
        {
            "text": "Data is fundamental to achieving good quality, person-centred care and has the power to transform its delivery. For example, gathering relevant and timely information - and making it readily available - makes it easier for carers to understand and respond to the needs of those they support. At a more systemic level, it helps local authorities make sure there are sufficient and appropriate services to meet local population needs."
        },
        {
            "text": "The COVID-19 pandemic demonstrated just how much having access to the right data in a timely manner can make a real difference. Yet, there is still much more we can do together to harness the full potential of data and drive innovation across health and care."
        },
        {
            "heading": 2,
            "text": "Our roadmap to better care data"
        },
        {
            "text": "Much of this work is already underway. In 2021, we published ‘People at the Heart of Care’, setting out our ambitions for social care over the next 10 years, and in June 2022, we published the Health and Care Data Strategy ‘Data Saves Lives’, setting out our commitment to improving how social care data is collected, shared and used."
        },
        {
            "text": "Building on these commitments, we have published ‘Care data matters’, which sets out our roadmap for transforming social care data nationally. We have released it as a first draft, as we want it to be shaped by everyone touched by social care. To make sure the right data is collected, held, and shared, we are seeking views from you via a feedback form (see the link at the end of this blog), with a finalised publication by the end of 2023."
        },
        {
            "text": "Launching the ‘Care data matters’ is an important step in addressing transformation. We can achieve great progress through streamlining and improving data collections, access and driving digitisation. For example, we will undertake a feasibility study to provide recommendations on a new survey of unpaid carers."
        },
        {
            "text": "Through this, we will consider how a new survey can fill gaps identified in the evidence base by government departments and the sector. It will provide more insight into the wide variety of circumstances, experiences and needs amongst unpaid carers. This is just one example of the many initiatives underway."
        },
        {
            "heading": 2,
            "text": "Local interactions enhancing analysis"
        },
        {
            "text": "Central to this are local initiatives, led by many partners - whether that be providers providing frontline care or those working in local authorities responsible for commissioning care - working together to find better and more innovative solutions to how care is delivered. I have seen excellent examples of local and regional interactive analysis tools that have transformed how areas monitor performance of services and people’s outcomes, and it is vital that this local data transformation continues."
        },
        {
            "text": "We have also launched updates to the Adult Social Care Outcomes Framework (ASCOF), to make sure it better captures how social care is achieving the outcomes that matter most to people. These updates better reflect local authorities’ responsibilities for care and the Government’s priorities to monitor whether people are achieving good outcomes – and ultimately, a good quality of life."
        },
        {
            "text": "This is an exciting time for adult social care, a chance to improve how we use data to refine practice and provision and make sure health and care services are truly joined up. This will help make person-centred care a reality for all."
        }
    ]
}