{
    "url": "https://deframedia.blog.gov.uk/2023/02/22/defra-announces-further-support-for-farmers-at-nfu-conference/",
    "title": "Defra announces further support for farmers at NFU conference",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-02-22T15:40:41+00:00",
    "content": [
        {
            "text": "Both Defra Secretary of State Thérèse Coffey and Farming Minister Mark Spencer have addressed the National Farmers Union’s conference this week, during which they made a number of announcements to support farmers with sustainable food production."
        },
        {
            "text": "On Tuesday 21 February, Mark Spencer addressed the conference and highlighted how more than £168 million in grants will be available to farmers this year to drive innovation, support food production, improve animal health and welfare and protect the environment. BBC Online, the Independent, and the Daily Express, alongside farming media such as Farmers Weekly, Farmers Guardian, Farming UK, Pig World and Horticulture Week, were amongst those covering the announcement."
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        },
        {
            "text": "“The role farmers play in putting food on our tables as well as looking after our countryside is crucial. Helping farms invest in new technology as well as bringing in nature-friendly schemes will support the future of farming.”"
        },
        {
            "text": "Alongside this funding, the Minister highlighted the reduction in the number of smaller abattoirs in the last decade and how crucial they are to supporting the rural economy, enabling farmers to sell their own meat in farm shops and maintaining good animal health and welfare by reducing journey times. He confirmed that new funding will be made available to help with “the cost of the new machinery, facilities, and infrastructure” – details to be announced in full later this year."
        },
        {
            "text": "Farming Minister Mark Spencer said:“If farming is to flourish then we need to get the fundamentals right - abattoirs are key to the food supply chain and there is clearly a need to support smaller providers in this area.”"
        },
        {
            "text": "On Wednesday 22 February, it was Defra Secretary of State Thérèse Coffey’s turn to address the conference where she reaffirmed the Government’s commitment to the vital role farmers play in guaranteeing the UK’s food security. She praised farmers for their efforts to feed the nation against the backdrop of the war in Ukraine, extreme weather like droughts and floods and high fuel, feed and fertiliser costs. She also highlighted the importance of protecting the environment alongside sustainable food production."
        },
        {
            "text": "Secretary of State Thérèse Coffey said: "
        },
        {
            "text": "“Keeping the country fed is what farming is for. Farmers’ primary purpose is to produce the fine food we enjoy; we want you to keep doing that; we want you to get a good reward for that and we also need your help to protect and enhance the environment.”"
        },
        {
            "text": "Recognising the challenging times farmers have faced, Defra has taken a number of steps to support the agriculture industry, including removing tariffs on maize imports from the United States which is a key ingredient in animal feed, improving the compensation scheme for farmers affected by Avian Influenza and expanding the seasonal workers visa scheme for the horticulture sector to 45,000 to ensure they have the labour they need. This is alongside wider government support on energy bills through the Energy Bills Relief Scheme."
        }
    ]
}