{
    "url": "https://deframedia.blog.gov.uk/2023/02/22/fruit-and-vegetable-supply/",
    "title": "Fruit and vegetable supply",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-02-22T15:50:37+00:00",
    "content": [
        {
            "text": "There have been media reports on shortages of some fresh fruit and vegetables, including tomatoes, peppers and salads, with some supermarkets limiting the amounts of each product that customers can buy."
        },
        {
            "text": "We are aware of the issues relating to the availability of certain fruits and vegetables. As retailers and industry bodies have highlighted, this is following poor weather in Spain and North Africa which has impacted production for imported vegetables which are currently out of season in the UK. Similar disruption is also being seen in other countries."
        },
        {
            "text": "Our supermarkets have been clear they are adept at managing supply chain issues and are working with farmers to ensure that customers are able to access a wide range of fresh produce."
        },
        {
            "text": "The UK continues to have a highly resilient food supply chain and is well equipped to deal with disruption. Our high degree of food security is built on supply from diverse sources; strong domestic production as well as imports through stable trade routes."
        },
        {
            "text": "A Defra spokesperson said: "
        },
        {
            "text": "“We understand public concerns around the supply of fresh vegetables, however the UK has a highly resilient food supply chain and is well equipped to deal with disruption."
        },
        {
            "text": "“We remain in close contact with suppliers, who are clear that current issues relating to the availability of certain fruits and vegetables were predominately caused by poor weather in Spain and North Africa where they are produced.”"
        },
        {
            "text": "We recognise the challenges farmers are facing due to global pressures on input costs, such as feed, fuel and fertiliser, and Defra has taken a number of steps to support the agriculture industry. This includes removing tariffs on maize imports from the United States which is a key ingredient in animal feed, improved the compensation scheme for farmers affected by Avian Influenza and expanded the seasonal workers visas for the horticulture sector to 45,000 to ensure they have the labour they need. This is alongside wider government support on energy bills through the Energy Bills Relief Scheme."
        },
        {
            "text": "Elsewhere, we also understand the difficulties facing the egg industry and we are continuing to work with industry to monitor the egg market. We want all farmers to receive a fair price for their products, and are committed to tackling any contractual unfairness that might exist in the agri-food supply chain."
        },
        {
            "text": "In 2020, the Government carried out a consultation seeking views from farmers and processors in the dairy sector on whether future regulation could be used to strengthen fairness and transparency in the supply chain to ensure farmers are treated fairly. As the consultation responses indicated widespread support for these proposals, we are working closely with stakeholders to develop regulations and intend to introduce legislation later this year. A subsequent consultation was conducted between July and October 2022 exploring issues in the pig sector. We are analysing the responses and considering appropriate next steps. A Summary of Responses will be published in the coming months."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}