{
    "url": "https://gott.blog.gov.uk/2023/02/22/how-to-write-a-strong-knowledge-asset-grant-fund-application/",
    "title": "How to write a strong Knowledge Asset Grant Fund application",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "Knowledge Asset Grant Fund"
    ],
    "pub_date": "2023-02-22T16:40:54+00:00",
    "content": [
        {
            "text": "On 20 February we launched the latest round of the Knowledge Asset Grant Fund (KAGF). The fund has been set up by the Government Office for Technology Transfer (GOTT) to help the UK civil service make the most of is valuable knowledge assets."
        },
        {
            "text": "Whether you’re applying for an Explore, Expand or Extend  grant, you’ll want to make sure you’re giving us the information we need to help us make a decision about supporting your project."
        },
        {
            "text": "We spoke with Sarah Staniland, Head of Funding and Communities at GOTT, who said this about the fund:"
        },
        {
            "text": "Keep reading for Sarah's top tips when it comes to writing a strong KAGF application."
        },
        {
            "heading": 2,
            "text": "Be concise"
        },
        {
            "text": "We have given the word count on each section of the application form - make sure you pay close attention to it."
        },
        {
            "text": "We recommend planning your answers in advance, using bulleted lists where possible, and keeping language simple: imagine you’re explaining your project to a general audience as opposed to a group of specialists."
        },
        {
            "text": "When adding detail, try to avoid becoming overly technical. Instead, focus on key moments in your project’s development that demonstrate its progress from conception to realisation and towards exploitation, highlighting any modifications you’ll make to turn the original asset into something others can use and benefit from."
        },
        {
            "heading": 2,
            "text": "Include the basic facts"
        },
        {
            "text": "Be clear when providing information that confirms your project’s eligibility for funding. It’s important that we understand who’s involved, how parties are connected and who owns and has control of all assets involved in the project."
        },
        {
            "heading": 2,
            "text": "Focus on the impact"
        },
        {
            "text": "Tell us who your end user is, and how your asset could help them. We want to support projects that come with financial, social and economic benefits for the UK, so use this opportunity to explore a diversity of applications for your project."
        },
        {
            "heading": 2,
            "text": "Need help? "
        },
        {
            "text": "The Knowledge Asset Grant Fund is unique in that it encourages applications from those who don’t usually apply for grant funding. We’re on hand to support all applicants throughout the process – contact us with any questions."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}