{
    "url": "https://naturalengland.blog.gov.uk/2023/02/22/what-landowners-can-do-now-to-gear-up-for-the-biodiversity-net-gain-market/",
    "title": "What landowners can do now to gear up for the biodiversity net gain market",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2023-02-22T10:37:30+00:00",
    "content": [
        {
            "text": "By Mike Burke, Programme Director – Sustainable Development"
        },
        {
            "text": "If you’re a landowner, biodiversity net gain might be a new concept or a familiar one you’ve read about. It’s both an opportunity to move towards nature positive outcomes and contribute to nature’s recovery as well as providing you with an alternative, long-term source of income. It’s a truly exciting time to get involved in the emerging biodiversity net gain market and I’m pleased to share a BNG advice note for landowners, recently issued by the Department for Environment, Food and Rural Affairs (Defra) which we recommend that you read."
        },
        {
            "text": "What is biodiversity net gain?\nBiodiversity net gain (BNG) is an approach to new development, but also land management, that aims to leave the natural environment in a measurably better state than before.\nIn these uncertain times we know that landowners, landholders and managers are scanning the horizon to make decisions on how best to manage landholdings or estates and explore alternative sources of income. BNG is one way that land can be managed to better our natural environment and generate an income from doing so. Whether on a large estate, a smaller piece of land or a network of sites across the country, BNG provides an opportunity to enter a market where ‘biodiversity units’ are bought and sold with the aim of delivering outcomes for nature that can also support economic growth."
        },
        {
            "text": "How BNG will work\nCommencing in late 2023, most developments in England will need to achieve a minimum 10% net gain in order for their development to receive planning permission. They will use the biodiversity metric, expected to be version 4.0, to calculate how many biodiversity units they need, in order to achieve this. When they cannot fully deliver BNG on site, they can deliver gains off site."
        },
        {
            "text": "What BNG as an opportunity can mean for you\nThe new off-site market in biodiversity units is where you as landowners (of any type, including local authorities) come in. Creating or enhancing habitats on your land generates these biodiversity units which you can, in turn, sell to developers. The market represents a potential chance to diversify your income. Indeed, it is expected to be worth £135m - £274m annually.\nFurther guidance is still anticipated on how BNG will operate and Natural England will continue to support government in its development. To help kick-start this activity, Defra has put together some advice to support anyone looking to sell biodiversity units: Sell biodiversity units as a land manager."
        },
        {
            "text": "If you’re considering delivering habitats for biodiversity net gain then we’d encourage you to think about the actions that can be done now or ahead of it becoming mandatory. For example, habitats created or improved in advance of sale generate more ‘biodiversity units’, therefore starting habitat works early could benefit you longer term. If you’re not yet in a position to start creating or enhancing habitats, then there are still things that can be done. This might be starting to establish baselines for your land, using the Biodiversity Metric to explore the possibilities and what might be appropriate.\nWe’d also recommend starting the conversation in your local area, whether this is with your Local Planning Authority, environmental organisations, land agents and others, to understand what the local priorities for nature recovery might be and what types of habitats developers might need to achieve net gain.\nKeep up to date with the latest information here."
        },
        {
            "text": "To make biodiversity net gains a success for wider nature recovery, collaboration and cooperation are an important part of the process. For more details and other suggestions, we’d strongly recommend reading Defra’s advice note and keeping your eye out for upcoming guidance."
        },
        {
            "text": "Biodiversity net gain will be a key moment on our way to becoming a nature positive nation, whilst also providing a great finance opportunity for landowners. Will you be joining us for the journey?\nIf you would like some more information on the wider benefits of biodiversity net gain, have a read of our last blog Counting Down to Biodiversity Net Gain and our biodiversity net gain brochure."
        }
    ]
}