{
    "url": "https://defradigital.blog.gov.uk/2023/02/22/what-sustainability-means-to-me/",
    "title": "What sustainability means to me",
    "authors": [
        "Simone Burke"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-02-22T12:49:05+00:00",
    "content": [
        {
            "text": "In the first instalment of our new Sustainability Heroes series, Simone Burke shares her motivations for trying to enjoy a more sustainable life, along with insights into some of the changes she’s made on her journey."
        },
        {
            "text": "Sustainability, in all its forms, matters to me - a lot. In recent years I’ve gradually made more adjustments to my lifestyle, to reduce my carbon footprint and improve my nature positivity."
        },
        {
            "text": "I blogged last year about my volunteering work and how I combine that with my love of cycling. But that blog only really scratched the surface of how I look at sustainability and how I try to be more mindful of the environment."
        },
        {
            "text": "The dictionary definition of sustainability is ‘the ability to be maintained at a certain rate or level’. How often do we think of it in these terms though?"
        },
        {
            "text": "Sustainability is a heavily used phrase, but I’m not sure we always stop and consider just exactly what it means, what the implications are for the way we live our lives, and how we then make the adjustments (aka sacrifices, to many people) that we each feel we want, and are able, to make."
        },
        {
            "heading": 2,
            "text": "The power of five"
        },
        {
            "text": "I suppose one of the ways I do this, possibly subconsciously, is by breaking down and splitting my sustainability ‘changes’ into five distinct categories:"
        },
        {
            "heading": 2,
            "text": "What does this mean, in reality, though?"
        },
        {
            "text": "Let’s take a look shall we. If we consider travel, for example. I used to fly a lot for holidays, sports competitions, and for work. I’ve reduced my flights to one a year since 2016, and I haven’t flown at all since 2019. I take trains and drive where I can or have staycations. I’ve reduced my car usage too. I cycle everywhere I can. I got a cargo bike to try and cut out shorter car trips where I was using the car, to take my dogs with me or to pick up heavier things."
        },
        {
            "text": "When supporting charities and the like I do a lot of research. I use the WWF Footprint Calculator and follow the advice on how to reduce it. Through Home | Collective for Climate Action I learned about and followed the advice on Giki zero. I’ve also done the couch to carbon zero sprint by every one of us"
        },
        {
            "text": "Last year I bought a subscription to ethical consumer and try to look there instead of other comparison sites. I‘ve joined my local wildlife trust and participated in wild challenges, and I follow their gardening advice. I also joined the RSPB. I TerraCycle too, and this month I’m joining an Eco Together, which brings together small groups of friends, neighbours or colleagues to find their own best way to make a difference."
        },
        {
            "text": "Then there are the things I’m trying to do around the home. I’m with Ecotricity, for my energy supply, and I’ve draught proofed and set my thermostat to 17, and replaced my main wood burning stove with a more efficient one. I’m going to close the other one up. I’m careful about where the wood comes from too, and I use it conservatively. I am retrofitting and insulating where I can, and I’ve reduced my energy usage where possible"
        },
        {
            "text": "With regards to technology, there are plenty of ‘wins’ to be had here too. I’ve held on to my iPhone 7, and I got a pay as you go contract with Ecotalk that supports Bees and the RSPB, and it is as good value as Smarty / Giff Gaff. I changed my broadband provider to Zen internet and have joined Bcorp, the non-profit network.  Nowadays, I’m also using Ecosia - the search engine that plants trees instead of other search engines"
        },
        {
            "text": "I recycled my old Mac that lasted me 10 years and invested in a new one that I’ll hopefully get as long out of with a larger memory (to not use cloud storage). And I don’t have a TV; I listen to the radio and podcasts and stream consciously at lower resolutions 720p where possible."
        },
        {
            "text": "Finally, there’s food and shopping. I shop at my local greengrocer and try to buy in season locally sourced fresh produce. I have an allotment and look after a community orchard. I’ve cut down on meat and dairy, and I buy non-perishables and ethical, environmentally sustainable cleaning products and cosmetics from a zero-waste refillable scoop shop. I also use soap, toothpaste tabs and creams from Lush. I highly recommend Who Gives A Crap toilet paper and I’m using SMOL for laundry and hang dry."
        },
        {
            "text": "I have two dogs and have tried to reduce their impact too by buying pet food locally which comes in paper bags and opting for natural dog treats with refillable/ recyclable packaging."
        },
        {
            "heading": 2,
            "text": "Final reflections"
        },
        {
            "text": "A few additional principles I try to live by include; borrow rather than buy where I can, repair rather than replace, and I try to ask myself if I really need it, and encourage myself to buy second hand where possible.\nAll the things I’ve done have either saved me money, or improved my health and wellbeing, or both. I try not to see anything as a sacrifice, rather as a lifestyle choice."
        },
        {
            "text": "Inevitably there is an impact to everything, and a balance to be struck, with cost and convenience trade-offs along the way. But I see it as a journey, and I’m always seeking to learn and improve. If you have any tips to share or questions or suggestions, please do leave me a comment here."
        }
    ]
}