{
    "url": "https://hmlandregistry.blog.gov.uk/2022/01/12/celebrating-geovations-start-up-successes-and-seeking-the-next-cohort/",
    "title": "Celebrating Geovation’s start-up successes – and seeking the next cohort",
    "authors": [
        "Andrew Trigg, Chief Geospatial & Data Officer, HM Land Registry"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2022-01-12T12:17:45+00:00",
    "content": [
        {
            "text": "The start-up businesses we support through the Geovation Accelerator Programme are amazing – and you could join them if you have a great idea for improving the property market."
        },
        {
            "text": "Innovators such as adoor, Sail Homes, Skyroom, SociAbility and GetGround are making a positive impact that will benefit everyone involved in buying, selling and renting property as their projects progress."
        },
        {
            "text": "It’s wonderful to see how their initial vision transforms into sustainable growth."
        },
        {
            "text": "Geovation, backed by ourselves and Ordnance Survey, is an incubator for PropTech (property technology) and GeoTech (geospatial technology) start-ups. The accelerator programme, dedicated to supporting open innovation and collaboration using property and location data, is promoting the next generation of data-led tech solutions."
        },
        {
            "text": "The programme is now in its eighth cycle. So far 137 start-ups have been supported by Geovation, with more than 1,500 jobs created and £116 million in funding raised."
        },
        {
            "text": "Applications for the programme's spring intake are now open. Successful candidates will receive 6 months' intensive and tailored support, including up to £20,000 grant funding and the equivalent to more than £100,000 in benefits."
        },
        {
            "text": "They'll be following in the footsteps of these growing businesses."
        },
        {
            "heading": 2,
            "text": "Success stories"
        },
        {
            "text": "Michael Wadsworth, founder of adoor, has been featured in the TechRound 29 under 29 list. Michael joined the Geovation Accelerator Programme with adoor in 2020. It's a platform to track house moves by keeping all those involved up to date, all in one place."
        },
        {
            "text": "Sail Homes joined the Accelerator Programme in 2020 and launched Sail Legal in October 2021 to further speed up the conveyancing process by combining the estate agency and conveyancing into one product. Sail Legal offers homeowners a stress-free sale by identifying the best buyer and quickly tying up the many legal details that can cause delays."
        },
        {
            "text": "Skyroom delivers precision-manufactured homes in the airspace above existing buildings. They developed the Key Workers Home Fund, a pot of £100 million offered to London’s local authorities and housing associations to accelerate the delivery of 10,000 affordable homes for keyworkers, furthering their commitment to make cities inclusive, safe, resilient and sustainable."
        },
        {
            "text": "SociAbility launched an app to help disabled people find accessible places and organise all the world’s accessibility information. They joined the cohort in October 2019 on the PropTech stream supported by HM Land Registry. The app has been downloaded more than 750 times and seen more than 750 venues profiled by around 250 registered users."
        },
        {
            "text": "GetGround makes forming, structuring and managing a buy-to-let company quick and cost effective. They recently appointed Marco Grossi, senior lead from Facebook and Google, to drive sales and marketing. They have also expanded their offices internationally, functioning out of 3 offices based in London, Singapore and Hong Kong as well as two new tech hubs in Lisbon and Berlin in October 2021."
        },
        {
            "heading": 2,
            "text": "Apply to join the next cohort"
        },
        {
            "text": "Carly Morris, Head of Geovation, said: \"We help start-ups get the necessary footing to grow and enhance their business model, with support and expertise from the Geovation community.\""
        },
        {
            "text": "It's easy to make your application now."
        }
    ]
}