{
    "url": "https://educationhub.blog.gov.uk/2022/01/what-international-university-students-should-know-before-travelling-to-england/",
    "title": "What international university students should know before travelling to England",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2022-01-12T16:59:13+00:00",
    "content": [
        {
            "text": "As many international students may be considering travelling back to England to their university or other higher education provider over the next few weeks, we have been working closely with the higher education sector to ensure that they are supported."
        },
        {
            "text": "We encourage students to reach out to their higher education provider if they have any concerns over travelling to England so providers are ready to support them where needed."
        },
        {
            "text": "Here’s what students need to know before travelling."
        },
        {
            "heading": 3,
            "text": "What should I do before travelling to England? "
        },
        {
            "text": "If you are intending to travel to England, we would encourage you to check the latest travel advice to ensure you are fully prepared."
        },
        {
            "text": "The higher education sector is working hard to ensure that international students are supported and feel welcomed throughout their studies whether in the UK or remotely in their home country."
        },
        {
            "text": "We expect you will be given the support you need upon arrival by your university. Universities UK has provided a check list for higher education providers to ensure you can be supported if you are required to self-isolate at any point."
        },
        {
            "text": "We have also published COVID-19 guidance for higher education here."
        },
        {
            "heading": 3,
            "text": "Am I eligible for the vaccine, including the booster? And will I have to pay? "
        },
        {
            "text": "Everybody aged 12 or over in the UK is eligible for the COVID-19 vaccination (including the booster vaccine, three months after the second dose) for free regardless of their nationality or immigration status, unless you’re medically exempt. You can do this by registering with a GP or attending a walk-in vaccine centre."
        },
        {
            "text": "If you are looking to get your booster and have been vaccinated outside the UK, we would encourage you to bring your vaccination proof with you to your GP or walk-in vaccine centre, where they will be able to advise you on the most suitable booster vaccine available."
        },
        {
            "text": "More information on the vaccine and eligibility can be found here."
        },
        {
            "heading": 3,
            "text": "How will I be able to certify my vaccination status under Plan B in England? "
        },
        {
            "text": "If you have been vaccinated overseas in line with the approved list of vaccines and countries you will be able to certify your vaccination status. You will be required to show your COVID status and photo identification (for example, a passport) matching the country in which you were vaccinated."
        },
        {
            "text": "If you are a student in England who has been vaccinated with an overseas vaccine approved by the UK’s Medicines and Healthcare products Regulatory Agency  (MHRA), you will also be able to add this to your NHS record, which can then be used to generate a NHS Covid pass."
        },
        {
            "text": "If you are not considered fully vaccinated as your vaccine is not approved or you have not had a vaccine from an approved country there is also the option to do a (negative) COVID test in order to gain access to certification, more information about this is available on the NHS site. "
        },
        {
            "heading": 3,
            "text": "When must I arrive in the UK if I am currently studying remotely? "
        },
        {
            "text": " Visa concessions for those on student (or Tier 4) visas allow for the provision of online learning for students outside the UK until 6 April 2022. These visa concessions have been implemented so that students have a greater degree of flexibility on when they travel into the UK, if required."
        },
        {
            "text": "We encourage you to speak to your higher education provider to understand your course requirements and when your higher education provider will require face-to-face learning."
        }
    ]
}