{
    "url": "https://forestrycommission.blog.gov.uk/2022/01/12/woods-into-management-forestry-innovation-funds-case-studies/",
    "title": "Woods into Management Forestry Innovation Funds - Case Studies",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2022-01-12T10:04:12+00:00",
    "content": [
        {
            "text": "During National Tree Week in 2021 it was announced that the the Woods into Management Forestry Innovation Funds would distribute almost £700,000 to 17 projects restoring biodiversity in vulnerable natural habitats, helping woodlands adapt to a changing climate and aiding their recovery from the impacts of pests and diseases."
        },
        {
            "text": "In our Woods into Management Forestry Innovation Funds projects blog post we gave a brief introduction into those 17 successful projects."
        },
        {
            "text": "Here we take a look at two of those projects in more detail. These studies were written by collaborators on the projects."
        },
        {
            "heading": 2,
            "text": "HomeGrownHouse - Grown in Britain"
        },
        {
            "text": "HomeGrownHouse is a collaboration between London Metropolitan University, Grown in Britain and the Birling Estate."
        },
        {
            "text": "Sweet Chestnut is a durable, straight growth, dimensionally stable timber well suited to use in buildings. However, very little UK grown sweet chestnut is used in construction. The majority is converted into fencing or burnt as biomass."
        },
        {
            "text": "The HomeGrownHouse (HGH) research project challenges this status quo by exploring new, value-added uses for coppiced sweet chestnut in buildings in the SE of England, where the highest number of new-start building projects sit alongside the most abundant coppiced sweet chestnut. Yet the opportunities this presents for sustainable local timber use are being missed."
        },
        {
            "text": "The UK imports 80% of its wood products and only 59% of UK woodlands are under active management. Many formerly coppiced woodlands have fallen out of regular harvest cycles, are more prone to diseases and pests, and contain a mixture of small, medium and large diameter trees with few markets."
        },
        {
            "text": "The HGH project addresses these issues by designing building components with a range of small, medium and large diameter roundwood in mind. We designed a building ‘kit of parts’ with a low-waste, high yield philosophy, leading to components that are cost-competitive with imported alternatives. To achieve milling efficiency, new radial cutting techniques were tested for repeatability on mobile sawmills, ensuring they could be reproduced elsewhere in the UK."
        },
        {
            "text": "When coppiced, sweet chestnut re-grows multiple, straight lengths of roundwood from each ‘stool’. Coppicing is also naturally regenerative and harvesting in this way encourages higher levels of biodiversity than other monoculture woodlands. Coppice forestry also creates skilled rural jobs. By linking forestry practices, ecology and construction, the HGH project has forged new connections that contribute to a holistic, sustainable and local timber supply chain."
        },
        {
            "text": "In June 2021 five building system prototypes were exhibited on the GiB certified Birling Estate, where the Sweet Chestnut was harvested. The timber structures were shown alongside the forestry machinery used for extraction, communicating the links between ecological woodland management practices, high quality locally grown timber, and sustainable building design. HGH also featured at COP26, the UN Climate Change Conference."
        },
        {
            "heading": 2,
            "text": "Woodland Management Focus Area Pilot - Reheat (renewable technologies) Ltd (re:heat)"
        },
        {
            "text": "The Woodland Management Focus Area Pilot is developing a methodology to locate currently unmanaged woodlands which have the lowest barriers to management with the aim to engage woodland owners and ultimately bring more woodlands into management."
        },
        {
            "text": "Firstly, the Focus Area Pilot is developing a methodology that uses Geographic Information Systems (GIS) to analyse hurdles (such as slope, access, and proximity to markets) to the active management of woodlands. The methodology uses the Forestry Commission’s Managed Woodland Headline Performance Indicator dataset to identify unmanaged woodlands."
        },
        {
            "text": "It then evaluates each woodland against a defined set of criteria resulting in a suitability map which presents land on a scale of ‘lowest barriers’ to ‘greater barriers’ for woodland management. This allows focus areas to be identified. The Project will try to contact the woodland owner to engage and provide support and advice to them, improving their ability to progress management."
        },
        {
            "text": "As part of this support and advice, the Focus Area Pilot is running a series of ten webinars to help woodland owners understand the benefits of managing woodland and how to progress management of their woodlands. Seven webinar titles were decided with the remaining three to be determined by attendees’ interests."
        },
        {
            "text": "Following the devastating impacts of Storm Arwen, the second webinar 'An Introduction to Management Planning' was rearranged to allow us to answer queries regarding the impacts of Storm Arwen on woodland management along with guests from the Forestry Commission and Euro Forest. Further information on the remaining webinars can be found here: FREE Woods into Management Webinars – RDI Associates (ruraldevelopment.org.uk)"
        },
        {
            "text": "Finally, further support and advice is provided to woodland owners by helping them evaluate their woodland against the UK Forestry Standard (UKFS) using the myForest Woodland Assessor developed by the Sylva Foundation with the aim to produce a UK Forestry Standard (UKFS) compliant Woodland Management Plan."
        },
        {
            "text": "The next step of the pilot project is to help woodland owners identified in the focus areas use and understand the myForest Woodland Assessor and the benefits it can bring to the woodland and woodland owner."
        },
        {
            "text": "You can find the tool in the myForest Platform, a focused GIS software allowing woodland owners and managers to map, plan, and manage their woodlands. myForest • home (sylva.org.uk)"
        },
        {
            "text": "Throughout this project, the team has engaged with the Forestry Commission and other community forest organisations to ensure that the project outcomes are as practical and relevant as possible to bring the greatest amount of unmanaged woodland into management in the North East and Wider Yorkshire Area."
        },
        {
            "text": "We are very grateful to innovation funding provided by the Forestry Commission to support these important and exciting conversations and collaborations to help bring woodlands into management."
        }
    ]
}