{
    "url": "https://codigital.blog.gov.uk/2023/07/05/digital-transformation-fixing-the-how-accelerating-the-what/",
    "title": "Digital Transformation - Fixing the How, Accelerating the What",
    "authors": [
        "Mike Hill"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-07-05T16:14:18+01:00",
    "content": [
        {
            "text": "It was a great privilege to be invited to speak at the Innovate New South Wales (NSW) https://publicsectornetwork.com/event/innovate-nsw-2023-2/ event in Sydney; arranged by the fantastic team at Public Sector Network (PSN). This event brought together public sector colleagues from across the Federal and State levels to get the latest updates, share best practice and network. I delivered the International Keynote address and then joined in a number of panel and roundtable discussions, which were fun and thought provoking. PSN also arranged for me to meet with Federal and State digital colleagues throughout the week - more of that in a later blog…"
        },
        {
            "text": "In today’s modern society, arguably change is business as usual (BAU); organisations who are not dynamic, not focused on what they do and how they do it are I feel destined to be left behind; becoming ever more irrelevant to the Customers they serve. Furthermore, as digital is intrinsic to organisational constructs and service delivery, any transformational endeavours must have a strong digital element to them. Beware though, any transformation needs to be led by the business not the digital function; as the saying goes the digital tail should not wag the business dog!"
        },
        {
            "text": "Over the years my conversations with Executives in Industry or Government when it comes to transformation have been largely focused on the more visible elements of digital transformation - Cloud, Analytics, Robotics and Generative AI (Gen AI). This is understandable and natural, as very often we need results and we need them yesterday. However I have always felt this is the wrong end of the telescope, starting with the What and not the How and my counsel as a digital leader has always been more focused on the latter than the former. I even found a Gartner slide to support this premise, apparently 15x impact delivered through focusing on the How - thanks Gartner! "
        },
        {
            "text": "The premise of my keynote was therefore:"
        },
        {
            "text": "                                                                Fixing the How, Accelerating the What"
        },
        {
            "text": "Bear with me I will come back to this - a little context first…"
        },
        {
            "text": "Becoming Cabinet Office Digital"
        },
        {
            "text": "When I joined the the Cabinet Office a little over a year ago, I was pondering the whole system challenge in front of me; how do we create an optimal digital function that is capable of providing strong digital leadership to an organisation that was structured as a loose conglomeration of Business Units (BUs) and Arms Length Bodies (ALBs); departments and functions that predominantly were self sufficient and independent; with varying degrees of digital maturity. "
        },
        {
            "text": "The organisation I inherited (Chief Digital Information Office) was (is) full of fantastically capable, experienced and motivated individuals who wanted to do a good job and in a lot of ways were. We were (and remain so) very good at providing the enabling IT products and services; EUC, mobility, productivity, GovWiFi etc; we were not though structured for sustained success in the digital domain. Across the organisational Pillars (silos!) we had smatterings of product, delivery and service; operating in isolation and attempting to deal with organisational constraints team by team - we were delivering despite the system not being enabled by it!"
        },
        {
            "text": "Over the next 6-months we embarked on a transformational endeavour, which looked at the brand, vision, mission, structure and ways of working. This was an excellent piece of work and enabled us to pivot quickly; we rebranded to Cabinet Office Digital to enable our users to engage and understand us better; our new vision Enabling and Transforming the Cabinet Office. This vision encapsulated our renewed purpose and mission - enabling through the provision of exemplary digital, data and technology products and services. Transforming through providing digital leadership to the organisation acting as a digital partner that advised and assured and a digital delivery partner doing both of those things along with addressing the problem space of the organisation through a laser focus on users and product. "
        },
        {
            "text": "This transformation has been broadly (one can never say completely!) well received and although it is early days the consensus is positive and we continue to engage, adapt and evolve - like any good transformation should do."
        },
        {
            "text": "Right that is the context, now back to the Keynote…"
        },
        {
            "text": "During my first number of months in post, I discussed the whole system challenge and transformation with Tom Read, CEO Government Digital Service (GDS). Tom is a key stakeholder for us in Cabinet Office Digital and is also a highly experienced digital leader, who is great to bounce ideas off (thanks Tom). He introduced me to the late Paul Shetler’s work “Square of Despair” which must be a good model, as it rhymes…! This model though does neatly encapsulate the multi-dimensional aspects of the challenge we were facing, as follows:"
        },
        {
            "text": "To these 4 dimensions, I added a 5th - Culture. As Peter Drucker observed, Culture eats Strategy for breakfast - indeed as Jennifer Pahlka in her excellent book “Recoding America” also observes - it also does the same to Policy!"
        },
        {
            "text": "These therefore are 5 dimensions of our transformational strategy within Cabinet Office Digital; helping us to transform the How in order to accelerate the What. The graphic below provides a pictorial representation of this. "
        },
        {
            "text": "Now, I’ve been in delivery and subsequently sales for far too long in my career to be seduced by a hockey stick, believe me - it rarely all comes right in Q4… However, I would like to take artistic licence on this, as it does outline my strong view that Culture is where you will get the biggest impact. The work we are doing is obviously not linear, rather incrementally we are transforming how we operate as an organisation and outlined below is a synopsis of our transformation strategy. "
        },
        {
            "text": "Transforming Cabinet Office Digital "
        },
        {
            "text": "The 5th dimension is Culture and clearly one cannot “fix” culture, rather influence, promote, engage, shape (pick a preferred verb!) to support the development of a highly engaged, supportive and empowered culture within an organisation. There are also multiple aspects to culture, though I will focus on 2 areas where we are specifically engaged on:"
        },
        {
            "text": "I feel strongly that if we get these 5 dimensions right, we will transform our great organisation into something truly spectacular; delivering the real pace and impact of digital transformation that the Cabinet Office requires. The How being fixed the What being accelerated…"
        },
        {
            "text": " "
        }
    ]
}