{
    "url": "https://marinescience.blog.gov.uk/2023/07/05/how-science-partnerships-and-innovation-are-key-to-tackling-illegal-trade-of-sharks-and-rays-in-indonesia/",
    "title": "How science, partnerships and innovation are key to tackling illegal trade of sharks and rays in Indonesia",
    "authors": [
        "Joanna Murray",
        "Andhika Prasetyo",
        "Efin Muttaqin",
        "Firdaus Agung"
    ],
    "categories": [
        "Fisheries",
        "Wildlife trade"
    ],
    "pub_date": "2023-07-05T11:51:11+01:00",
    "content": [
        {
            "text": "A standardised training programme for shark and ray trade inspectors, a team of 20 expert trainers increasing staff capacity nationally and a global expert in identifying shark products from DNA are just some of the highlights delivered as part of the three-year UK government funded Illegal Wildlife Trade Challenge Fund (IWTCF) project. The strong collaboration between Cefas, the Ministry of Marine Affairs and Fisheries (MMAF), Republic of Indonesia, Rekam Nusantara Foundation, and the University of Salford, UK was key to the success of this project which completed in March 2023. A few months on from completion, we look back at some of the successes of our partnership to tackle illegal trade of sharks and rays in Indonesia. "
        },
        {
            "text": "Indonesia is the largest shark fishing country in the world and a key exporter of shark products (including fins, meat, liver oil and skin). In an effort to control trade, over 150 species of sharks and rays are currently listed within the appendices of the Convention on the International Trade in Endangered Species of Wild Fauna and Flora (CITES), an international agreement which aims to regulate international trade in wildlife for its protection. But because products from sharks and rays are diverse and processed in many different ways (e.g. fins can be fresh, frozen, dried, bleached), being able to tell what species of shark a product comes from is a huge challenge for staff at fishing ports, trade hubs and international borders. "
        },
        {
            "text": "Our project set out to tackle this challenge  by equipping enforcement agencies with the resources they need to strengthen sustainable trade regulations, combining visual fin and carcass identification and state of the art DNA forensics, to build capacity for the detection and ultimately the prevention of illegal trade in sharks and ray products. "
        },
        {
            "text": "Innovative Science  "
        },
        {
            "text": "At its core, our project was about building the capacity of shark trade inspectors to better identify which species of shark products are coming from. In collaboration with MMAFs training centre, we developed an intensive five-day ‘train the trainer’ programme made up of eight modules with both taught and practical elements. Module topics include shark and ray conservation legislation, biology and ecology of sharks and rays, sampling statistics and reporting, visual identification of CITES listed sharks and rays, and DNA sampling techniques.  "
        },
        {
            "text": "After development, testing and improvements, the programme was delivered by national and international experts to 20 participants from all six of Indonesia’s regional trade offices (Padang, Pontianak, Makassar, Denpasar, Serang, Sorong) and the Ministry of Marine Affairs and Fisheries (MMAF) at a national ‘train the trainer’ workshop in Jakarta. This workshop marked the first step for standardised training for MMAF’s shark and ray training agenda and has been adopted by the MMAF Training Centre as part of the annual standardised training for new employees (including government staff from regional trade offices and quarantine, as well as participants from universities and the private sector). Since the 20 expert trainers were trained in January 2020, they have gone on to deliver the standardised programme to over 200 of their colleagues across the regional offices. The training was reinforced through post-training testing across the eight modules, with high test scores across the board evidencing the success of this approach."
        },
        {
            "text": "A shining success of our partnership has been the innovation and scientific progress achieved by PhD graduate Dr Andhika Prasetyo. Andhika and his family moved to Manchester in the UK in January 2019 to undertake his PhD at the University of Salford with molecular ecologist Dr Allan McDevitt and Professor Stefano Mariani. Whether it is a frozen fillet, a dried and processed fin or liver oil, some shark products simply cannot be visually identified.  "
        },
        {
            "text": "Andhika and team set out to develop molecular approaches to identify these processed products and to detect illegal sharks and rays in Indonesia’s trade [PhD thesis]. Over 579 tissue samples were collected from shark export hubs, processing plants, collectors, inspectors’ offices, and landing sites across Java Island, Indonesia. Field based DNA sampling techniques are urgently needed to improve our understanding of trade. We tested a recently developed method (known as FastFish-ID) and found the method worked for 25 out of 28 species, 20 of which were CITES- listed. However, the illicit trade may be hidden from inspection, and that is a challenge for testing individual tissue samples. The ‘shark-dust’ approach developed by Andhika and team, tests dust or processing residues which revealed 27 more taxa than individual tissue-based techniques and found that over 80% belonged to CITES-listed species.  "
        },
        {
            "text": "Andhika now works at the Research Centre for Conservation of Marine and Inland Water Resources, National Agency for Research and Innovation (NRIA). He also joined the task force on Bioinformatic and Sequencing Centre at Genomic and Cryo-EM Facilities, NRIA who are responsible for molecular approaches to animal specimens, including elasmobranchs products. Andhika continues to work with MMAF and Non-Governmental Organizations (NGOs) to support management and conservation of fish resources, particularly shark and ray population. "
        },
        {
            "text": "Andhika said “Getting involved in the project and being awarded PhD are an honour and privilege for me. It opens a broad network and will improve my skill in communicating and initiating collaboration. Also, I am delighted to return to Indonesia, serve my country and share my knowledge with colleagues. Moreover, studying genetics has opened my mind to the fact that the limit of genetic application to our lives is only our imagination!” "
        },
        {
            "text": "Sharing knowledge "
        },
        {
            "text": "In September 2022, project partners from Indonesia visited the UK for a week-long research and policy exchange experience, which provided an opportunity to plan future work. Eleven representatives from MMAF, regional trade offices and Rekam Nusantara Foundation attended with the aim of sharing knowledge with UK scientists and policy makers on how to best use scientific evidence when making national policies on the management of shark and ray fisheries and trade. Workshop attendees met at the Cefas Lowestoft laboratory where they shared scientific presentations and discussed how to implement evidence-based management of fisheries and trade. During their trip, they also visited Heathrow’s Animal Reception Centre to share experiences on inspection processes for animal transportation and shark products, before meeting with Defra policy teams in London to discuss how the IWTCF is supporting the implementation of CITES shark listings in Indonesia."
        },
        {
            "text": "In the second year of the project, we obtained additional UK government funding to support development of the first shark trunk visual identification guide for CITES-listed species. To increase international uptake and use of the trunk guide, we joined a global collaboration with governments, non-governmental organizations, and other partner and funding organizations (including the CITES Secretariat, the United Nations Food and Agriculture Organization (FAO), the European Union, the Pew Charitable Trusts, and Shark Conservation Fund) to include the guide in a three-volume series that covers whole animals, shark trunks and dried products such as shark fins and devil ray gill plates. The guides were officially launched in March 2022 and presented at a joint UK/Indonesia hosted side event at CITES 19th Conference of the Parties. "
        },
        {
            "text": "Future collaboration "
        },
        {
            "text": "Although we are at the end of our IWTCF project, it feels like we are just at the beginning of our collaboration to better manage our fisheries and trade to protect our sharks and rays in Indonesia. We will continue our partnership but seek to scale up our ambition; train more implementing staff and expand current training to include new species of sharks and rays that were added to CITES in November 2022, increase awareness of trade monitoring systems and regulations among fishers, processes, and traders, and increase institutional capacity to meet CITES commitments and other relevant international agreements. "
        },
        {
            "text": "Firdaus (Directorate General for Marine Spatial Management, MMAF) said “The training programme we developed during our IWTCF project has provided MMAF staff with skills and knowledge that is required to implement CITES trade regulations. Both central and field officers are now equipped with the latest techniques and tools. Considering the increasing trend to list sharks and rays in CITES Appendix II, continued improvement and application of technologies is needed. Fast and accurate but low cost and simple tools are the most procedures by our team now. We look forward to continuing our collaboration to implement CITES shark listings in Indonesia to support legal and sustainable shark fisheries and trade.”  "
        }
    ]
}