{
    "url": "https://defencedigital.blog.gov.uk/2023/07/05/mod-are-tackling-defences-challenge-culture-head-on/",
    "title": "MOD are tackling Defence’s challenge culture head on",
    "authors": [
        "D. Cottey-HIll"
    ],
    "categories": [
        "Cyber",
        "Cyber Confidence",
        "Uncategorized"
    ],
    "pub_date": "2023-07-05T11:54:31+01:00",
    "content": [
        {
            "text": "Keeping Defence safe always has been and always will be a top priority for the MOD. One of the best ways of doing this is to rely on the help of MOD personnel, along with civilians and contractors who work on MOD sites, to challenging suspicious behaviours when they see them. "
        },
        {
            "text": "This is why the ‘Challenge Me’ initiative was established in 2022. During the month of March trained teams are sent to various MOD establishments across the UK, and sometimes overseas to display low-level suspicious or risky behaviours in the hope that personnel will spot and confidently challenge the team to ensure the sites’ safety. "
        },
        {
            "text": "Using mobile phones in prohibited areas and tailgating through security entrances are just two examples of behaviours that should be challenged. No matter how harmless they may seem, these may be the types of behaviours exhibited by someone who isn’t authorised to be there, thus posing a high security risk. That is why this initiative is so important. "
        },
        {
            "text": "Through exercises such as this, the MOD hope to develop and encourage a positive, constructive challenge culture across Defence. It is key to the safety of Defence that all personnel feel comfortable in challenging and being challenged in a polite, safe, and assertive manner, regardless of seniority or rank. "
        },
        {
            "text": "Throughout the initiative, those individuals who correctly identified and delivered a constructive challenge to a member of the team received a limited edition Cyber Confident Challenge Coin in recognition of their positive action.  "
        },
        {
            "text": "The main thing to keep in mind when challenging suspicious behaviours across MOD establishments, is that the positive outcome of challenging a genuine threat will always outweigh the cost of politely challenging a simple mistake or misunderstanding. Keeping Defence safe by constructively challenging is something that must happen throughout the entire year, not just when initiatives like this are running. "
        },
        {
            "text": "The Cyber Confident Team develops and distributes a variety of materials to inform and educate Defence personnel on cyber security risk and response. If you would like to find out more, please listen to our ‘Cyber Sound Bytes’ podcast available on Spotify and Apple Podcasts."
        },
        {
            "text": "Remember, the front line is you. "
        }
    ]
}