{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/07/05/seventy-five-years-of-health-and-social-care/",
    "title": "Seventy-five years of health and social care",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Events",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2023-07-05T09:34:35+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Parallel evolution"
        },
        {
            "text": "As we mark the seventy-fifth anniversary of the NHS, it is worth remembering how Clement Attlee's 1945 government embarked on implementing William Beveridge's report recommendations which set the framework for the welfare state."
        },
        {
            "text": "The aim was to put an end to the five 'giant evils' in society: squalor, ignorance, want, idleness and disease. Alongside establishing the NHS, the Children Act 1948 established comprehensive local authority children's departments and the 1948 National Assistance Act formally abolished the Poor Law system which had existed since the reign of Elizabeth 1."
        },
        {
            "text": "It established a social safety net for all citizens, including the homeless, disabled people and older people, obliging local authorities to provide suitable accommodation for those who, through infirmity, age or any other reason, needed care and attention."
        },
        {
            "text": "It is important, therefore, to recognise how the social care system has existed alongside the NHS all this time and why it should also be celebrated for the care and support it’s dedicated workforce provides, just as we honour our equally committed NHS colleagues."
        },
        {
            "heading": 2,
            "text": "Social work embodies the values of health and care"
        },
        {
            "text": "In this spirit, social workers have been found across social care and health services, since the foundation of our health and care system. They have worked as mental welfare officers, with older people, provided childcare guidance, practiced in clinical settings, and as probation officers."
        },
        {
            "text": "For years, social workers have worked alongside health professionals in hospital settings. Their involvement brings holistic and person-centred approaches to supporting people and their families to access the resources they need to live well in their communities."
        },
        {
            "text": "In 1974, with the establishment of local authority social services departments, the medical social worker role shifted from the NHS to local authorities and over time social workers have been undertaking health related social work and social care in community settings."
        },
        {
            "text": "Where such valuable work and resource is best deployed is a constant challenge, but what is clear is the important contribution social work and social care makes to ensuring people are well supported to achieve the best possible lives and outcomes that matter to them."
        },
        {
            "text": "So, may I wish all care and NHS colleagues a happy seventy-fifth anniversary. I hope we can continue to strengthen collaboration and best practice across services and specialisms and help sustain this remarkable gift to the nation for another 75 years and beyond."
        },
        {
            "text": "#NHS75 #NHSBirthday"
        }
    ]
}