{
    "url": "https://dataingovernment.blog.gov.uk/2023/07/05/the-justice-data-lab-turns-10/",
    "title": "The Justice Data Lab turns 10!",
    "authors": [
        "John Preston – Analyst, Ministry of Justice"
    ],
    "categories": [
        "Other",
        "People and Skills",
        "Statistics"
    ],
    "pub_date": "2023-07-05T15:50:30+01:00",
    "content": [
        {
            "text": "Established in April 2013 with support from New Philanthropy Capital, the Justice Data Lab (JDL) helps third sector organisations evaluate the impact of their interventions."
        },
        {
            "text": "For organisations working to reduce reoffending, being able to evaluate the effectiveness of their interventions is paramount. This requires access to relevant data, and the expertise and time to undertake appropriate analysis. Third sector organisations cannot access central reoffending data, because it is extremely sensitive information about individuals. This, combined with the need for specialist analysis, means that for many organisations working with people across their journeys through the criminal justice system, there would be no way to evaluate their work if the Justice Data Lab did not exist."
        },
        {
            "text": "Organisations send us a list of their programme participants, and we identify these people in secure datasets such as the Police National Computer, build matched comparison groups, and produce a full impact analysis which quantifies the effect of the intervention on reoffending outcomes. This provides third sector organisations with a vital source of impartial and rigorous evidence that can be used to improve their work and secure essential funding."
        },
        {
            "text": "Alongside our work with the third sector, the Justice Data Lab also leads on the evaluation of MoJ and HMPPS led initiatives, whose large-scale programmes have significant impacts across the criminal justice system."
        },
        {
            "heading": 1,
            "text": "Our achievements to date"
        },
        {
            "text": "This year marks the 10th anniversary of the Justice Data Lab. Within that time, we have produced 179 reports and have worked with over 50 organisations across the third sector, who provide all types of interventions from education, to accommodation, to justice system reform. Previously we have worked with The Clink, a vocational training programme which gives people in prison skills, qualifications, and routes to employment in catering and restaurant work; the Greater Manchester Intensive Community Order programme, which works with young male offenders who have received community orders in place of short custodial sentences; and the CHANGES programme at Nottingham Women’s Centre, which provides individualised support to women across 9 resettlement pathways in order to prevent reoffending."
        },
        {
            "text": "This quarter, we published our latest evaluation, which looks at The Chrysalis Programme, an integrated personal leadership and effectiveness development programme that equips individuals with essential life skills, helping them to better own and drive positive personal change in their lives."
        },
        {
            "text": "We’re the proud recipients of a Royal Statistical Society award for ‘Statistical Excellence in Official Statistics’, and our work has been covered by the BBC and Civil Service World. Our track record is reflected in the positive comments we receive from our partners:"
        },
        {
            "heading": 1,
            "text": "Relaunching the JDL School"
        },
        {
            "text": "A key part of our success is our consistent methodology, which relies on a statistical method called propensity score matching (PSM). As experts in the use of PSM for evaluation, we also receive requests from other teams in the Ministry of Justice to advise them on the use of this technique. Previously we have run an initiative we call JDL School, where we walk other teams through our methodology to share our expertise and up-skill others in propensity score matching. Now, in our 10th year, we’re very pleased to announce the relaunch of our JDL School programme. "
        },
        {
            "text": "Over the next few months, we will be gearing up in preparation to be able to offer training workshops and bespoke assistance for teams within the Ministry of Justice who would like to undertake quasi-experimental impact evaluations using propensity score matching."
        },
        {
            "heading": 1,
            "text": "Get in touch"
        },
        {
            "text": "If you’d like to learn more about the Justice Data Lab, commission us for work, or participate in JDL School, please email us at justice.datalab@justice.gov.uk . Please be aware that we receive a large number of commissions and therefore we operate a waitlist for undertaking any new work. "
        }
    ]
}