{
    "url": "https://socialcare.blog.gov.uk/2023/07/05/the-nhs-is-75-and-so-is-the-social-care-system/",
    "title": "The NHS is 75 and so is the social care system",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Events",
        "Workforce"
    ],
    "pub_date": "2023-07-05T06:35:50+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Celebrating health and care system"
        },
        {
            "text": "In difficult and uncertain times, it’s important to be thankful for the constancy of institutions and organisations supporting us through good times and bad. And when landmark anniversaries come round, it’s an opportunity to reflect, not just on their continued purpose, but on the many ways they have transformed our lives for the better."
        },
        {
            "text": "It’s also a time to remind ourselves these same institutions do not exist in isolation. Their anniversaries also celebrate the beginnings of longstanding relationships with some equally important partners. The seventy-fifth anniversary of the NHS on 5 July is a case in point. At the moment of its foundation in 1948, the social care sector, as a collaboration of care providers, services and professionals, also came into being."
        },
        {
            "text": "It’s formation also coincides with the arrival from the Caribbean of the HMS Windrush in the same year. According to the Royal College of Nursing, in 1948, “there were 54,000 nursing vacancies in the NHS and many of those arriving from the Caribbean helped to fill those places. The following year, the Ministry of Health began working with the Colonial Office, as well as the RCN and General Nursing Council, to actively recruit nurses from the Caribbean.”"
        },
        {
            "text": "Many of these dedicated nurses found themselves working in midwifery and in community nursing settings. We all owe a debt of gratitude to these trailblazing arrivals, especially given the unwelcoming attitudes of some sections of society at the time."
        },
        {
            "text": "Thankfully, we live in a more progressive and inclusive age. While more progress is needed, thanks to our collective efforts to boost representation, not least through the Florence Nightingale Foundation’s work with global majority nurses, we can truly say the Windrush generation have helped inspire nurses from all backgrounds to pursue careers in care and health."
        },
        {
            "heading": 2,
            "text": "Partners in wellbeing"
        },
        {
            "text": "Social care nurses have been as much a part of the NHS success story as their clinical counterparts. We are that essential bridge between hospital and community, providing the continuance of care and support, with a person-centred holistic focus. So, it’s no accident we choose to refer to this broad and complex network of professions, services and resources as the health and care system – the two sectors are co-dependent and, in many areas, the overlap is increasing, especially in the case of social care nursing. This is a good thing."
        },
        {
            "text": "In recent years, our clinical skill sets have expanded, easing pressure on the NHS as we take on more delegated healthcare interventions. These clinical actions, including insulin supervision, wound dressing and mental health support, allow us to provide consistent, continuous, person-centred care. It’s what residents and their families want: familiar faces they can trust to deliver safe, high quality care, with the needs and wishes of the recipient at the heart of the process."
        },
        {
            "text": "More broadly, with the creation of integrated care boards (ICBs) in every NHS trust and the standing up of social care nursing advisory councils in each and every one, our knowledge, skills and expertise are now being shared with NHS nurses, just as they share the same insights with us. The accumulated wisdom of 75 years of nursing in the care and health sectors coming together in the pursuit of greater collaboration and improved health outcomes for all."
        },
        {
            "text": "And even though we come from different disciplines and backgrounds, we all love and support the NHS and the principles it stands for. The social care sector will remain a constant and essential partner in its continued existence and I applaud every care and NHS colleague for their continued dedication to this triumph of modern civilisation. The challenges it faces have never been greater, but our belief in the greater good will see the health and care system prevail for generations to come."
        },
        {
            "text": "#NHS75 #NHSBirthday"
        }
    ]
}