{
    "url": "https://nationalscreening.blog.gov.uk/2023/07/05/wales-follows-scotland-and-northern-ireland-in-implementing-low-risk-diabetic-eye-screening-pathway/",
    "title": "Wales follows Scotland and Northern Ireland in implementing low risk diabetic eye screening pathway",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-07-05T15:42:26+01:00",
    "content": [
        {
            "text": "Millions of people with diabetes in the UK receive regular invitations for diabetic eye screening, which helps to prevent sight loss caused by diabetic retinopathy."
        },
        {
            "text": "In 2016, the UK National Screening Committee (UK NSC) recommended changing the screening interval from every year to every 2 years for people at low risk of sight loss. This was because:"
        },
        {
            "text": "Public Health Wales has announced it is now implementing this change to the diabetic eye screening programme in Wales, following in the footsteps of Scotland and Northern Ireland."
        },
        {
            "text": "Dr Sharon Hillier, Director of Screening at Public Health Wales, said: “This change is in line with UK National Screening Committee and Wales Screening Committee recommendations. Evidence shows that it is safe for people with no diabetic eye disease to be screened every 2 years."
        },
        {
            "text": "“This will enable services to see people at higher risk of diabetic eye disease sooner.”"
        },
        {
            "text": "People with diabetes in Wales, Scotland and Northern Ireland are now invited for screening every 2 years only if their last 2 screening tests found no signs of diabetic eye disease."
        },
        {
            "text": "If any changes to their eyes are subsequently detected, they will be screened more often again. Everyone else will continue to be screened as before."
        },
        {
            "text": "Plans are currently being finalised for the phased implementation of this low risk screening pathway in England from October 2023."
        },
        {
            "text": "The UK NSC regularly reviews screening recommendations for more than 100 conditions. The modification to diabetic eye screening intervals is an example of the committee recommending an improvement to an existing population screening programme that reflects the latest evidence."
        },
        {
            "text": "Under its expanded remit, the UK NSC can now consider modifications to screening programmes that involve targeted or stratified screening strategies."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}