{
    "url": "https://space.blog.gov.uk/2023/07/05/x-ray-technology-from-space/",
    "title": "X-ray technology from space",
    "authors": [
        "Adaptix"
    ],
    "categories": [
        "Applications",
        "Funding"
    ],
    "pub_date": "2023-07-05T14:49:55+01:00",
    "content": [
        {
            "text": "3D X-rays can offer an improved view inside the body, giving doctors more detailed, layered scans of bone fractures or breaks that aid in diagnosis and treatment."
        },
        {
            "text": "However, these 3D images are only normally produced using large, immobile and expensive scanners."
        },
        {
            "text": "Using technology similar to that developed for analysing the composition of comets, UK company Adaptix – which started in a lab on Harwell Campus in Oxfordshire in 2014 – are developing a mobile technology that can provide these 3D X-rays at a similar cost and radiation dose to 2D X-rays."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "UK Space Agency support"
        },
        {
            "text": "In 2018, Adaptix received £1 million in funding from the UK Space Agency and European Space Agency to help develop their mobile 3D X-ray scanner technology as part of an initiative themed around the 70th anniversary of the NHS."
        },
        {
            "text": "Since then, Adaptix have made several commercial installations of mobile 3D X-ray systems around the UK for veterinary imaging (the regulatory pathway is quicker than for human imaging). Adaptix demonstrated this at ESA’s European Centre for Space Applications and Telecommunications (ECSAT) in Harwell on 8 June using a royal python (a frozen specimen)!"
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "Adaptix’s 3D X-ray scanners can be packed down into a carry-on suitcase-size case for easy transport to doctors’ surgeries or more remote locations, reducing patient travel."
        },
        {
            "text": "It should make it quicker and cheaper to diagnose patient fractures, improving patient recovery times, and potentially allowing more services to be deployed across the NHS and medical services globally through its small size and ease of movement."
        },
        {
            "text": "In January 2023, Adaptix received regulatory clearance in the USA for a human imaging device for hands, feet and elbows. These are some of the most commonly fractured bones so the ability to scroll through a stack of slices in 3D is very helpful for diagnosis."
        },
        {
            "text": "Below are some example images taken from an early test at a hospital. On the left, the 2D X-ray is hard to read as all bones are superimposed. On the centre and right are Adaptix images which are slices at two different depths through the foot giving a much better view of the bone structure and joint spaces in each layer."
        },
        {
            "text": "As well as being useful for diagnosing some of the most common medical conditions on earth (limb fractures, arthritis, cancer etc), the technology could eventually lead to a device deployed in space where currently there is no X-ray capability."
        }
    ]
}