{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2022/11/22/cyber-insiders-joint-cyber-reserve-force/",
    "title": "Cyber Insider: Joint Cyber Reserve Force",
    "authors": [
        "calumjenkins"
    ],
    "categories": [
        "Cyber",
        "Grey Zone",
        "Personnel",
        "Training"
    ],
    "pub_date": "2022-11-22T13:02:30+00:00",
    "content": [
        {
            "text": "In this edition of Cyber Insiders, we take a look inside the world of the Joint Cyber Reserve Force with Squadron Leader Rick. We talk about his role as SO2 Selection and Training, gain valuable insights on the path to joining the team, and learn about those who call the Cyber Reserve Force home."
        },
        {
            "heading": 2,
            "text": "Meet Rick"
        },
        {
            "text": "From the dot-dash-dot of morse code to the zeros and ones of the cyber domain. From training as one of the RAF’s last Morse Code Operators to a key position in Defence Cyber Reserves Recruitment, Rick has had a career which has spanned not just decades but generations of technology too."
        },
        {
            "text": "Rick’s career within the MOD started in 1980 and has taken him across the globe to places like the Falklands, the British Virgin Islands, Antigua, and Kenya."
        },
        {
            "text": "Rick became a reservist in 2014, working at the Defence Academy in Shrivenham and as OC Training with 501 (City of Gloucester) Squadron. It was in 2017 when Rick moved to Joint Forces Command prior to it becoming Strategic Command. Accolades have followed Rick throughout his service, including the awarding of an MBE and most recently receiving the Commander UKStratCom Commendation from then Commander General Sir Patrick Sanders."
        },
        {
            "heading": 2,
            "text": "Understanding the Role of Cyber Recruiter"
        },
        {
            "text": "During our chat, Rick explained to us the important difference in mindset between inducting personnel into the Cyber Reserves and training people in the regular forces. He also shared some reflections on the incredible contribution that Cyber Reservists make as part of Strategic Command."
        },
        {
            "text": "The Cyber Reserves is made up of an eclectic group of people who are in the cyber industry and can bring that experience and different way of thinking to Defence. It’s down to Rick to manage the recruitment and entry process, with a selection board of SMEs to choose candidates with the vital cyber skills that Defence requires and induct them into the military. He explains that there is a high bar set for Cyber Reserves selection:"
        },
        {
            "text": "In most regular military careers, the goal is to consistently “broaden” personal experience and skills, but Rick tells us those recruited to the Cyber Reserves are experts from the start and that changes everything about how their careers work."
        },
        {
            "text": "When defining the conditions for the Cyber Reserves, Air Chief Marshal Sir Stuart Peach, former Chief Defence Staff, commented that the team should be about talent not rank. As a result, the Cyber Reserves are able to recruit personnel with high-end cyber skills that would otherwise not pass the typical medical or fitness standards for military service."
        },
        {
            "text": "Referring to this, Rick says:"
        },
        {
            "text": "As a result, Rick provides what he describes as a “handrail” for new recruits which includes thirteen days of “basic military survival skills”. Aspects of military life that are perhaps often taken for granted such as saluting, paying appropriate compliments, diversity and inclusion training, laws of armed conflict training, and an understanding of military ranks are also covered as part of this. It is only after this that new recruits move on to what Rick calls “serving King and country.”"
        },
        {
            "text": "Although their induction is brief, there can be no doubt about the impact of Cyber Reservists. Since their formation in 2013, the team have been involved in every major cyber exercise and have supported numerous cyber operations."
        },
        {
            "heading": 2,
            "text": "An Inspirational Team"
        },
        {
            "text": "The best part of his job, Rick tells us, is seeing people who you might not expect to join Defence, making a big contribution:"
        },
        {
            "text": "Summing up his experience, Rick has nothing but praise for the invaluable work the Cyber Reserves carry out:"
        },
        {
            "text": "If you’re interested in finding out more about Cyber Reserve Force, or would be interested in becoming their newest, you can learn more by visiting the Joint Cyber Reserve Force webpage."
        }
    ]
}