{
    "url": "https://civilservice.blog.gov.uk/2022/11/22/getting-things-done-in-government/",
    "title": "Getting things done in government",
    "authors": [
        "Nick Walker"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-11-22T11:54:43+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Nick Walker writes about the particular and important skills we often undervalue, but still need in order to make it all happen."
        },
        {
            "text": "While transforming towards a more efficient Civil Service, it is even more important to remind ourselves of the great things about being a civil servant. "
        },
        {
            "text": "From designing public services to levelling up the economy, the work we do in the Civil Service is complex and critical. This is why we must make sure we’re equipped to deliver. We often undervalue the particular and important skills we need but they are hugely significant."
        },
        {
            "text": "The Civil Service has proven its ability to act in times of crisis, and having the right skills at the right time is ever more important."
        },
        {
            "text": "We need to develop our capabilities in science, data, digital, project delivery, commercial delivery, and drafting and writing advice. These are important skills because they are linked to the cross-cutting needs we have in government to deliver against our policies. Not every civil servant needs to be an expert in every area, but having some awareness of the skills that inform policy making and public service delivery will make us all better civil servants. We have these gaps because, although we have functions and professions to develop specialists, we haven’t previously placed as much emphasis on the need for these skills. "
        },
        {
            "heading": 4,
            "text": "Building universal capability"
        },
        {
            "text": "There has been some great success in improving the capability within A Modern Civil Service, including the introduction of functions, and we’ve handled some very challenging situations successfully, all helped significantly by having skilled, expert people. Now, we need to work with our experts to provide universal training for every civil servant wherever you are, whatever level you are."
        },
        {
            "heading": 4,
            "text": "Transforming training"
        },
        {
            "text": "The Government Campus transforms training and development for all civil servants. Strand 1 of the Government Campus curriculum focuses on the universal skills that we all need wherever we work, whereas Strand 2 (Working in government) focuses on the skills we need to get things done in government. The latter provides valuable training to support decision-making and manage public money. There is also training about other professions, to know when and how to work with them. Taking the time now to sharpen your skills in these areas will better help you work with your colleagues across government in the future."
        },
        {
            "heading": 4,
            "text": "Spotlight on the data"
        },
        {
            "text": "Over the last two years, we’ve been making the data collected from our central contracts more transparent, and learning from what it’s telling us, for continuous improvement. The period from April to June 2022 was the busiest quarter since these contracts and the data transparency began in October 2020. "
        },
        {
            "text": "Pleasingly, the existence of a shared curriculum appears to be influencing what people buy and why, and we are steadily reducing duplication as well as removing weak or irrelevant products and programmes. "
        },
        {
            "text": "For context, our total government spend through the learning frameworks in April to June was £14.9 million (compared to £7.8 million in the same period last year, behaviour influenced by the pandemic). Our collective highest spend (more than £6 million) is on technical and specialist accredited courses within Strand 4 of the curriculum: project delivery; digital and data. A close second, approximately £5.5 million, are Strand 3 products and programmes, for leadership and management. Clearly this doesn’t capture all spending on learning and development (L&D), however it does show that there is more we must do in the universal skill space."
        },
        {
            "text": "Another pleasing bit of data to celebrate: around 2,000 courses on the frameworks have been reviewed to ensure they’re up to date, good quality, provide value for money and are relevant, or have been removed because they’re no longer required. This is an ongoing process to ensure the curriculum and campus are shaping demand and assuring high quality and accessible supply of training. "
        },
        {
            "heading": 4,
            "text": "Getting the most from our system"
        },
        {
            "text": "You can access all training courses, whether the off-the-shelf products or more bespoke L&D for your needs, through Prospectus Online and the new front end of Civil Service Learning. "
        },
        {
            "text": "If you really want to know how to get the most from our system, check out the Learning Frameworks Handbook and the New Requirements Handbook for more information."
        },
        {
            "text": "We all must develop our skills to better serve the public in the context of the challenges we face today and in the future. You can meet our personas to see examples of the types of training suitable to different roles."
        },
        {
            "text": "Search “Government Campus curriculum” to explore the training on offer and widen your transferable skills. Follow us on Twitter and LinkedIn and subscribe to Campus News."
        }
    ]
}