{
    "url": "https://educationhub.blog.gov.uk/2022/11/how-we-are-ensuring-more-children-have-access-to-high-quality-music-education/",
    "title": "How we are ensuring more children have access to high quality music education",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Arts",
        "music education"
    ],
    "pub_date": "2022-11-22T09:57:04+00:00",
    "content": [
        {
            "text": "Music is an important part of education, and it has been proven that it plays a key role in children’s cognitive and social development."
        },
        {
            "text": "This is because it helps with the nurturing of language, motor skills, emotional intelligence, and collaboration skills."
        },
        {
            "text": "We want all children to get these opportunities. That’s why this summer we launched the new National Plan for Music Education, The Power of Music to Change Lives and announced £25 million that will allow the purchase of around 200,000 musical instruments and equipment, including adapted instruments for pupils with SEND."
        },
        {
            "text": "A further £79 million will also be made available every year until April 2025 for the Music Hubs programme."
        },
        {
            "text": "You can read more about music in schools here."
        },
        {
            "text": "But what are music hubs and how do they work? Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "What is a Music Hub? "
        },
        {
            "text": "Music Hubs are groups of organisations – such as local authorities, schools, , art organisations, community or voluntary organisations – that work together to create joined-up music education provision and provide specialist music education services to around 90% of state-funded schools."
        },
        {
            "text": "Since 2012, Music Hubs increased the number of pupils supported through music progression routes, whole class instrumental lessons, singing lessons and choirs."
        },
        {
            "text": "Over the same period, Music Hubs have also been supporting an increasing number of pupils with SEND and those eligible for pupil premium with access to instrumental lessons and ensembles."
        },
        {
            "heading": 3,
            "text": "What part will Music Hubs play in the new National Plan for Music Education? "
        },
        {
            "text": "Arts Council England is facilitating an Investment Programme to appoint new Music Hub lead organisations."
        },
        {
            "text": "Newly selected Music Hubs will be in place for children and young people in September 2024."
        },
        {
            "text": "The delivery of new Music Hubs via this Investment Programme will help to achieve the vision of the new National Plan where all children and young people can learn to sing, play an instrument and create music together, and have the opportunity to progress their musical interests and talents, including professionally."
        },
        {
            "text": "We expect schools to have Music Development Plans in place for academic year 2023/24 and also expect Music Hubs to provide support for schools and others in line with the National Plan. The details for the transition will be set out in the New Year."
        },
        {
            "text": "The exact dates of the Music Hub Investment Programme’s timeline will be announced when the guidance for applicants is published in spring 2023."
        },
        {
            "text": " "
        }
    ]
}