{
    "url": "https://actuaries.blog.gov.uk/2022/11/22/looking-ahead-in-public-service-pensions-administration/",
    "title": "Looking ahead in public service pensions administration",
    "authors": [
        "Taylor Brightwell-Smith - Pensions Consultant"
    ],
    "categories": [
        "Finance",
        "Investment",
        "Pensions"
    ],
    "pub_date": "2022-11-22T14:08:55+00:00",
    "content": [
        {
            "text": "The right money, to the right person, at the right time."
        },
        {
            "text": "Throughout my career in pensions administration, this is the mantra I’ve heard most. It summarises the ultimate deliverable of good administration. It also oversimplifies the challenges faced by pension schemes and their administrators."
        },
        {
            "text": "The mantra focuses on the result. The culmination of an individual’s working life and the reward of retirement. But, as in life, the pension administration journey to that point can be challenging. These challenges add complication. It’s only when you address them that things can be delivered ‘right’."
        },
        {
            "text": "Some challenges are perennial (data, automation, capacity). Others present themselves out of the blue."
        },
        {
            "text": "Administrators of public service pension schemes are facing an unprecedented period of pressure. Major projects must be delivered alongside not only each other but also day-to-day services."
        },
        {
            "text": "In this blog I’ll consider some of the challenges that lay ahead, as well as the opportunities they present."
        },
        {
            "heading": 2,
            "text": "McCloud"
        },
        {
            "text": "We’re now approaching the point of delivery for many McCloud remedy workstreams."
        },
        {
            "text": "Policy colleagues are hard at work, focusing on how the remedy will be delivered in individual schemes, drafting scheme specific legislation. At the same time, administrators are looking to their practical application. Translating policy to process."
        },
        {
            "text": "Significant changes to existing processes and systems will be necessary. There may also be a need to distil this policy into operational benefit specifications. Such documents record the interaction between legislation, operational process, and scheme data."
        },
        {
            "text": "They're invaluable for ensuring things are done correctly and that administration systems don’t turn into a ‘black box’, where nobody understands how they work."
        },
        {
            "text": "Historically these documents have tended to remain the intellectual property of the administrator. Yet, there has been a recent shift towards scheme ownership, bringing the benefits of oversight and portability."
        },
        {
            "text": "Putting these documents together can be time consuming but the benefits are wide-reaching. For many public service pension schemes, deferred choice underpins mean remedy work will continue far into the future. Documentation of these processes benefits delivery not only now, but for many years to come."
        },
        {
            "heading": 2,
            "text": "Pension dashboards"
        },
        {
            "text": "30 September 2024. The staging deadline for public service pension schemes to connect to the Pensions Dashboard. This and other important dates were confirmed in the Government’s response to their consultation on the draft Pensions Dashboards Regulations 2022."
        },
        {
            "text": "Though a welcome easement, McCloud remedy and pensions dashboard projects will still have to run alongside one another."
        },
        {
            "text": "Capacity and headspace will be stretched. That’s the downside. The upside? These projects share many workstreams. Data, calculations, processes, and systems, all have potential crossovers. Therein lies opportunity for efficiencies."
        },
        {
            "text": "Data is key for McCloud, pensions dashboards and beyond. However, the prospect of getting the data in good order can be overwhelming. Targeted data analysis will help manage capacity and keep these projects on track."
        },
        {
            "text": "Providing incorrect information to members as part of the pensions dashboard will be a significant risk for schemes. Understanding your data, together with a strong quality assurance framework and consideration of scheme-specific complexities, will aid the calculation development stage. Providing confidence that the good data going in, is still coming out as good data at the other end."
        },
        {
            "heading": 2,
            "text": "Procurement"
        },
        {
            "text": "Schemes may also have the added requirement, or desire, to review their administration provider or administration system through a procurement process."
        },
        {
            "text": "Though a time-consuming project, a procurement exercise gives schemes the chance to review the requirements of their pensions administration, including opportunities to improve the current service. Some of the projects discussed above will no doubt be at the forefront of minds when considering future requirements."
        },
        {
            "text": "Taking stock can help schemes consider what’s working and what’s not. It also often provides a clearer picture about the true position of their data and path to more complete automation."
        },
        {
            "text": "While there are opportunities, the procurement and potential transition to a new provider are major projects which will take a significant amount of time and resource. Given the size and complexity of public service schemes these exercises also have significant governance requirements."
        },
        {
            "text": "A good governance structure, focussed on planning and evaluation, can help ensure that value is achieved, and opportunities are realised."
        },
        {
            "heading": 2,
            "text": "Summary"
        },
        {
            "text": "Alongside all this there remains the more ‘routine’ elements of administration to deliver. Things like annual benefit statements and factor reviews, to name a few, will still require time and attention."
        },
        {
            "text": "My time at GAD, so far, has involved a variety of work, touching upon many of these topics. I've worked alongside both actuarial and administration experienced colleagues, partnering with departments and their administrators to translate policy into practice. This work will continue as we collectively strive to deliver the best outcome for public service pension scheme members."
        },
        {
            "text": "It’s only by thoughtfully assessing and addressing these challenges that we can have confidence in delivering the right solution for members."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}