{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/22/mapping-an-integral-part-of-scheme-delivery/",
    "title": "Mapping: An integral part of scheme delivery",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2022-11-22T11:08:17+00:00",
    "content": [
        {
            "text": "As we discussed in a previous blog post, RPA uses digital maps to record physical land parcel boundaries and features, so correct payments can be made to farmers. RPA’s Operational Mapping Team tracks over 2.5million land parcels, using a range of intelligence and technology. In this blog Operational Mapping Lead David Franks talks about how he and his team provide accurate mapping for farmers and land managers. "
        },
        {
            "text": "I’m David, and I’m RPA’s Operational Mapping Lead, managing the Operational Mapping team. I’ve worked for RPA for over 15 years. I initially joined on a temporary contract working in the RLE1 processing team and have worked in or around the wider mapping team my whole career. Outside work I enjoy spending time with my family and managing my sons’ sports teams. Mapping is key to the administration of RPAs land-based schemes. Approximately 75% of the land in England is registered as over 2.5 million land parcels on our land system. Maintaining the integrity of our land system allows RPA to make timely and accurate payments to our customers."
        },
        {
            "text": "Our main responsibilities are processing mapping changes, contacting customers to resolve mapping queries and investigating mapping issues for other parts of the business. We ensure mapping updates are effectively delivered into our Land Management System to support land-based schemes and we’re constantly looking for opportunities to improve our processes."
        },
        {
            "text": "Technology underpins everything we do throughout the mapping process, and we wouldn’t be able to do our jobs without it. We use three main reference data sets alongside the information provided by customers; Ordnance Survey data, Aerial Photography and Satellite Imagery. These data sets are constantly being updated and are used to validate land parcels, identify where updates need to made and to prevent fraud. The quality of the data is increasing all the time, allowing us to make changes with a higher degree of accuracy and confidence."
        },
        {
            "text": "One of the hardest parts of the Mapping Team’s job is to manage the volume of work. We receive almost 50% of the yearly land changes within a three-month period, which puts us under a lot of pressure during this time. The best part of the mapping team’s job is working with maps and helping farmers. Farmers can help to make our job easier by providing clearly annotated maps as this helps to reduce the time taken to process mapping changes and may reduce the need for further clarification conversations."
        },
        {
            "text": "During the COVID pandemic we introduced an email route for submitting RLE1 forms. This was a new approach, but one that has been very popular, making it easier and cheaper for farmers to submit mapping changes. We appreciate that during our peak times of the year it can take a long time for these changes to be implemented so we are currently working on solutions to speed up the end-to-end turnaround of mapping changes. We’re looking to improve our online guidance, and also to improve understanding about what we do and why."
        },
        {
            "text": "The most recent improvement to the mapping process was for SFI. We delivered an online functionality that allows farmers to tell us about simple land cover changes without the need to contact the help line or send in an RLE1 form. We’re hoping to develop this further and make it available to all in 2023."
        },
        {
            "text": "Developments in technology are opening different avenues for farmers to communicate changes with us. We’re aware that our system capabilities aren’t as advanced as some of the technologies being used within the farming sector, so we’re trying to catch up to make it easier for farmers to communicate changes with us."
        },
        {
            "text": "Mapping will remain an integral part of scheme delivery whilst we continue to administer land-based schemes. We’re working to improve the land change process and that should hopefully make it easier and more efficient for everyone."
        },
        {
            "text": " "
        }
    ]
}