{
    "url": "https://educationhub.blog.gov.uk/2022/11/22/message-to-the-education-and-care-sector-from-the-secretary-of-state-for-education-gillian-keegan/",
    "title": "Message to the education and care sector from the Secretary of State for Education, Gillian Keegan",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-11-22T16:32:26+00:00",
    "content": [
        {
            "text": "I wanted to say hello and introduce myself to you and everyone working in education and care."
        },
        {
            "text": "Some of you may already know me from my previous stint at the Department for Education as Apprenticeships and Skills Minister but it is now a very great honour to be back as Education Secretary. An honour and a huge responsibility."
        },
        {
            "text": "The Chancellor’s recent autumn statement underlined the government’s commitment to education as he seeks to restore stability to the economy, to protect our public services and build long-term prosperity for the country."
        },
        {
            "text": "It was great to hear him acknowledge the massive contribution our heads, teachers and classroom assistants make to our national life and his statement reinforces our mission to drive up standards and give every child or learner an excellent education."
        },
        {
            "text": "The autumn statement announced that schools will receive £2bn in extra funding, which is over and above what has been previously committed both next year and the year after and is the biggest injection of funding ever. This has been backed up by the Institute of Fiscal Studies, which said that it would allow schools to return to at least 2010 levels in real terms – the highest spending year in history – and is what the sector said it needed."
        },
        {
            "text": "The autumn statement also announced the appointment of Sir Michael Barber as an adviser on skills. I am confident Sir Michael will help us to continue making the improvements that are going to transform skills provision in this country."
        },
        {
            "text": "Everyone has different reasons for being passionate about education and care."
        },
        {
            "text": "For me it was a teacher, Mr Ashcroft. He stayed after school to enable me to study engineering and technical drawing. His belief in me and the extra O levels I passed, changed my life. Thanks to him, I was able to get onto an apprenticeship which opened all manner of doors. This is the alchemy of education in action. It not only builds confidence and opportunities but helps level up communities and leads to greater social justice and prosperity."
        },
        {
            "text": "I know without a doubt that talent is equally spread across the country but sadly, opportunity is not. I passionately believe no matter where you are from or what stage of life you’re at, you should always be able to get a high-quality education."
        },
        {
            "text": "Success starts well before children enter school and the dedication and skill of our early years sector is critical in supporting children for life. I am committed to working across government to improve the cost and availability of childcare for parents, while continuing to provide safe and high-quality provision for our youngest children."
        },
        {
            "text": "In our schools we need a full and knowledge-rich curriculum, with high standards in reading, writing and maths. Allied to that, we also need to make sure that pupils do not miss out because their lessons are disrupted by poor behaviour. No child should fall behind because their needs have not been spotted or supported."
        },
        {
            "text": "All our young people are continuing to catch up after the disruption caused by the Covid pandemic and some need extra help, which is why we are continuing to expand our tutoring programme. Tutoring is no longer the preserve of the well off and is available to any child who needs it. Two million sessions have already been started."
        },
        {
            "text": "Excellence does not happen by chance, so we need to make sure that every child has a brilliantly trained teacher. We are making half a million teacher training opportunities available during this Parliament so that every teacher in the country will have access to free, high-quality, ongoing training."
        },
        {
            "text": "I also intend to publish a full response to the SEND and Alternative Provision Green Paper to make sure that every child gets the support they deserve."
        },
        {
            "text": "Keeping children safe and cared for is paramount. That means improving children’s social care. We are rolling out family hubs and putting more money into the Supporting Families Programme. We are also committed to an implementation strategy for the independent review of children’s social care, the National Panel review into the murders of Arthur Labinjo-Hughes and Star Hobson and the Competition and Markets Authority report on the placements market. I am determined that this system should work more effectively for children and families, so that our most vulnerable children get every opportunity to achieve their potential."
        },
        {
            "text": "When it comes to further education and skills, our fast-moving economy needs a workforce with world-class skills."
        },
        {
            "text": "We are already investing an additional £3.8bn in skills in England over this Parliament, including high-quality technical education for 16-19 year olds and boosting opportunities for adults to upskill."
        },
        {
            "text": "As a nation we have 1,255,000 vacancies, so we need to upskill, train and retrain to ensure business needs are met and more people realise their potential."
        },
        {
            "text": "When I was last in the department I oversaw some of our reforms to technical education, with a growth in apprenticeship standards and the creation of T-levels, Higher Technical Qualifications and Skills Bootcamps. These are all designed to give people of all ages and stages the ability and opportunities for a great career."
        },
        {
            "text": "As I return to the DfE, I am absolutely delighted to see that 92% of the first cohort of students passed their T levels. Uniquely designed with leading employers and including a work placement, T levels are part of the revolution taking place in this country to make sure young people have excellent options after their GCSEs and throughout their lives."
        },
        {
            "text": "I am proud of our world-class higher education institutions. Our universities are among the best in the world and the education they provide has been respected and treasured by generations of students, not just in this country but globally."
        },
        {
            "text": "The courses they offer, including degree apprenticeships, are of the highest quality and they work with businesses and communities to provide the skills our economy needs now and in the future."
        },
        {
            "text": "But more needs to be done to enable people to train, upskill or retrain as both their circumstances and the economy change."
        },
        {
            "text": "That is why we will introduce the Lifelong Loan Entitlement from 2025. It will mark a profound shift in the way students of all ages can obtain funding for further and higher education."
        },
        {
            "text": "Right now we face some difficult global political and economic headwinds, so I am delighted to have the support of a very experienced ministerial team."
        },
        {
            "text": "Nick Gibb needs no introduction. He has been spearheading a knowledge-rich curriculum for more than a decade. Our schools will be in safe hands. In Robert Halfon I have a fellow apprenticeship champion. He has been a vocal and dedicated spokesman for the importance of skills as chair of the Education Select Committee for more than five years. I am so pleased that Baroness Barran is continuing to represent the Department in the House of Lords and I welcome her experience and passion for excellence for all. Claire Coutinho is a comparative newcomer to our department but she brings huge experience from a variety of previous roles to inform our focus on those with learning disabilities, special needs and social care."
        },
        {
            "text": "I would like to echo the Chancellor’s comments and thank all of you, across the education sectors, for your tremendous efforts. His comments underline our belief that education is an engine of growth and social change."
        },
        {
            "text": "My team and I very much look forward to meeting many of you over the coming weeks and months ahead. We all share your dedication and passion and, with your help, I know we are going to make our education, skills and care systems ones the rest of the world looks up to."
        },
        {
            "text": "The Rt Hon Gillian Keegan MP\nSecretary of State for Education"
        },
        {
            "text": " "
        }
    ]
}