{
    "url": "https://homeofficemedia.blog.gov.uk/2022/11/22/sharpening-outdated-security-rules/",
    "title": "We must sharpen our outdated security rules to fight 21st-century threats",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Ministerial opinion"
    ],
    "pub_date": "2022-11-22T12:03:12+00:00",
    "content": [
        {
            "text": "By Tom Tugendhat, the Minister of State for Security - this article was published in the Telegraph on 15 Nov 2022."
        },
        {
            "text": "In 2018, the Salisbury poisonings were a clear statement of the threat we face. It was a tragic, and very public, glimpse into the new era of threats we face."
        },
        {
            "text": "While our intelligence and security agencies have been deterring and stopping attacks directed by hostile foreign powers for some years, this brought home the dangers they now pose to our people and freedoms."
        },
        {
            "text": "The threats we face from the hostile activities of foreign states have only increased. Our enemies are emboldened and more sophisticated, threatening not just life but our way of life."
        },
        {
            "text": "We need our law enforcement and intelligence agencies more than ever. They keep us safe so we can be free."
        },
        {
            "text": "The recent threats we have faced have made it clearer to us that our laws and powers are outdated. Our security and intelligence agencies have told us they need a modern armoury of law to meet the new threats. This government is answering that call."
        },
        {
            "text": "The National Security Bill is back in the House of Commons, bringing the most important update to our defensive laws against the hostile activities of foreign states in a century."
        },
        {
            "text": "The Bill modernises our security legislation, protecting us, our democracy and our values. It introduces a comprehensive set of new measures to modernise our legislation for tackling state threats. This will make a real difference to how we can protect ourselves."
        },
        {
            "text": "Existing counter-espionage laws were drafted before the rise of Nazi Germany or the fall of the Soviet Union, when there were clear definitions of enemy and friend, and when spying meant stealing aircraft plans or printed documents."
        },
        {
            "text": "The recent case of British individuals selling their advanced military training in China shows how the threat has changed. Now we’re not just guarding physical documents, but advanced research, tacit knowhow and the people who hold that knowledge. Our rivals know that the battlefield for strategic advantage lies in the race for cutting-edge science and technology."
        },
        {
            "text": "The tools we need to address this threat need to be sharpened for a different future. This Bill will give our intelligence agencies the routes to tackle this activity and make it even harder for those who want to steal our trade secrets, sensitive information or strategic advantage."
        },
        {
            "text": "A major reform created by this Bill is a new offence of sabotage. Cyber attacks have the potential to cripple our essential services, such as the one that hit the NHS in 2017 and caused serious disruption."
        },
        {
            "text": "Another major reform in this Bill is new tools to tackle the rising challenge of foreign interference. The Bill introduces an offence of foreign interference and has also introduced provisions which will increase the sentencing for electoral offences where there is a state threats link."
        },
        {
            "text": "It introduces a foreign influence registration scheme, which will require individuals and companies to register certain activities undertaken on behalf of a foreign state. Anyone lobbying parliamentarians on behalf of a foreign state-backed company will have to declare it. Failure to register will constitute a criminal offence."
        },
        {
            "text": "We know that many seek to subvert our democracy. Transparency into foreign influence attempts is a vital step to strengthening the integrity of our politics."
        },
        {
            "text": "Not all foreign interference directly targets politics, but it can still have a pernicious effect on freedom. We know that authoritarian states are deploying agents here in the UK to oppress and monitor diaspora communities."
        },
        {
            "text": "And just last week, the Foreign Secretary summoned Iran’s most senior diplomat over a series of serious threats against journalists based in the UK."
        },
        {
            "text": "Until now, we have been limited only to existing laws on harassment and assault to tackle them in extreme cases. For the first time, this Bill will make it illegal to act as an undeclared spy or take money to work on behalf of a foreign intelligence service. This is an important step which reflects the seriousness of state-backed violence and intimidation."
        },
        {
            "text": "The Bill also contains an “aggravating factor”, allowing the courts to impose higher sentences if a crime such as assault is committed at the behest of a foreign power."
        },
        {
            "text": "And the Home Secretary will, with the consent of Parliament, be able to designate a foreign power or part of a foreign power so that any action undertaken in the UK for that power must be registered – a targeted measure to give us assurance and make it harder to conduct hostile acts in the UK."
        },
        {
            "text": "Combined, these new powers to tackle foreign interference will make a real and tangible difference to how we protect our democracy and values."
        }
    ]
}