{
    "url": "https://teaching.blog.gov.uk/2022/11/22/the-p-word-reducing-the-stigma-of-periods-across-our-college/",
    "title": "‘The P Word’ – Reducing the stigma of periods across our college",
    "authors": [
        "Mel Kay"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2022-11-22T15:01:15+00:00",
    "content": [
        {
            "text": "Mel Kay, Student Support Manager, has been leading the way at Newcastle College to make sure that all learners have access to period products. The period product scheme is funded by DfE and will be running until July 2024. It is available to all state-maintained schools and academies with learners over the age of 10.\n"
        },
        {
            "text": "At Newcastle College we have been accessing free period products via the DfE scheme since spring 2021, helping to tackle period poverty and remove the stigma surrounding periods through a campaign called ‘The P Word.’"
        },
        {
            "text": "We are a large college with more than 12,000 students from all different backgrounds, so period poverty and period stigma are real issues for many of our learners. We are one of seven colleges across the country that make up the National College Group (NCG), meaning we play a key role in providing education and training to learners across the UK, and supporting its mission to encourage social mobility and economic prosperity. We are not just about the courses we offer, but about enabling real change for our young people and our communities."
        },
        {
            "text": "Having a period without access to basic hygiene products is not an experience that anyone should ever have. It can and does hold people back from all sorts of things, including education. Being able to access period products easily and free of charge is a lifeline for those who can’t access these products at home, or struggle to afford them. This is becoming even more important now that the cost of living is rising so rapidly."
        },
        {
            "text": "Raising awareness of the scheme"
        },
        {
            "text": "‘The P Word’ campaign has been a huge help in raising awareness of the scheme amongst students. The concept was a real collaboration between support colleagues, safeguarding officers, teaching staff, and college administrators, who all play vital roles in helping to raise awareness and distribute products."
        },
        {
            "text": "The initiative is introduced to students as soon as they start with us during their induction, so they have details of the products and where to find them from their first day with us. We also continue to remind them through ongoing pastoral sessions and campaign material in toilets, as well as some social media promotion throughout the year. We also continue to educate our staff, so they can understand the issue of period poverty and how they can support our learners."
        },
        {
            "text": "Improving accessibility of products "
        },
        {
            "text": "One of the most important things we do as part of the initiative is make the products as visible as possible. While our curriculum teams keep supplies handy, they’re readily available in all student toilets and student facing outlets, including our new campus shop and receptions across our campus. We believe that having them out on display for learners to easily access helps reduce the stigma around periods, but also empowers those who need to use these products. They never need to ask; they simply help themselves."
        },
        {
            "text": "In addition, to support learners outside of college opening times we provide a ‘click and collect’ service, so they can take additional products or bulk supplies for use over college holidays. Students just need to complete an online form to make their request and they’ll receive a response to let them know when they’re ready to collect. This service also allows learners to request their preferred products (which may not always be available in the self-service areas) including an eco-option, which is really important as we try to educate our learners about the importance of sustainability."
        },
        {
            "text": "One of the great things about opening up the conversation about periods is that new products are being developed all of the time. We can always offer new and improved, more effective options, as well as sustainable options which can be reused, like menstrual cups and period pants. We offer all of these options to our learners, and I absolutely love that we are able to do that through the scheme. It makes it accessible to all and really helps to break down the barriers for our learners, which is exactly its purpose."
        },
        {
            "text": "Nobody should be missing out on education or other parts of life because they have their period, and it's so important that young people can turn to their school or college for this type of support. I’d really recommend the scheme; it makes a real difference to people’s lives."
        }
    ]
}