{
    "url": "https://educationhub.blog.gov.uk/2022/11/what-is-the-multiplication-tables-check-and-why-is-it-important/",
    "title": "What is the multiplication tables check and why is it important?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools"
    ],
    "pub_date": "2022-11-22T09:34:28+00:00",
    "content": [
        {
            "text": "Research suggests that being able to recall times tables fluently is helpful when it comes to other maths activities."
        },
        {
            "text": "That’s why primary schools are teaching pupils their times tables, so they can recall them and don’t have to work them out."
        },
        {
            "text": "The multiplication tables check helps teachers understand which pupils know their times tables and it also helps schools identify if children may need additional support."
        },
        {
            "text": "Here’s everything you need to about the multiplication tables check."
        },
        {
            "heading": 3,
            "text": "Why is it important to know times tables? "
        },
        {
            "text": "Having a secure grasp of the basics of maths, including the fluent recall of times tables, is crucial for children’s success in moving on to more complex maths."
        },
        {
            "text": "Learning multiplication tables is a key part of maths education in many high-performing education systems such as those in Shanghai and Singapore."
        },
        {
            "heading": 3,
            "text": "What is the multiplication tables check?"
        },
        {
            "text": "The multiplication tables check is an online, on-screen assessment given to pupils in year 4. It checks their ability to fluently recall times tables up to 12x12."
        },
        {
            "text": "All eligible year 4 pupils who are registered at state funded schools including academies and free schools and special schools in England are required to take the check."
        },
        {
            "text": "It’s made up of 25 times tables questions. Your child will be able to answer 3 practice questions before taking the actual check. They will then have 6 seconds to answer each question. On average, the check should take no longer than 5 minutes to complete."
        },
        {
            "text": "There is no expected standard or ‘pass mark’ for the multiplication tables check, but higher scores indicate greater proficiency in fluently recalling multiplication tables.  Schools are encouraged to benchmark themselves against the national and local authority averages."
        },
        {
            "text": "Results will only be published at national and local-authority level; school-level data will not be published."
        },
        {
            "heading": 3,
            "text": "I haven’t heard of this before, is it a new thing? "
        },
        {
            "text": "Yes. The multiplication tables check was made statutory in the 2021/22 academic year."
        },
        {
            "text": "Results from the 2022 check will be published in November 2022."
        },
        {
            "heading": 3,
            "text": "Why have you introduced another test for pupils?"
        },
        {
            "text": "This is a check, not a test, and is designed to last no more than 5 minutes."
        },
        {
            "text": "Our trials have found that most pupils find little issue with undertaking the check and the majority of pupils enjoy taking part in the check."
        },
        {
            "text": "Before introducing the statutory check, we conducted trials to ensure the check is as easy as possible for schools to administer and have adapted the current process as necessary, acting on feedback from teachers and pupils."
        },
        {
            "text": "This short, easy to administer, on-screen check will simply help teachers to identify those pupils who may need more support in mastering their times tables."
        },
        {
            "text": "The multiplication tables check is an important part of the government’s plan to ensure that every child has the knowledge and skills they need to succeed at secondary school, supporting numeracy in primary schools in the same way that the phonics screening check supports literacy."
        },
        {
            "heading": 3,
            "text": "Do I need to prepare anything to prepare my child for the check? "
        },
        {
            "text": "No, you do not need to do anything additional to prepare your child for the check. As part of usual practice, teachers may ask you to practise times tables with your child."
        },
        {
            "text": "For children currently in Year 4, schools will have unlimited access to a ‘try it out’ area from April next year. They can use this to make sure pupils have the necessary support required to access the check."
        },
        {
            "text": "This includes opportunities for pupils to familiarise themselves with the check application and try out any access arrangements that may be required."
        }
    ]
}