{
    "url": "https://legalaid.blog.gov.uk/2023/01/11/beware-of-cyber-criminals-who-are-preying-on-legal-aid-providers/",
    "title": "Beware of cyber criminals who are preying on legal aid providers",
    "authors": [
        "markworkman"
    ],
    "categories": [
        "legal aid agency"
    ],
    "pub_date": "2023-01-11T18:05:15+00:00",
    "content": [
        {
            "text": "Ransomware attacks are a huge risk for law firms, which have already suffered from online criminals. This includes legal aid providers. The sector is an attractive target for cyber attacks because law firms:"
        },
        {
            "heading": 2,
            "text": "What are the risks?"
        },
        {
            "text": "Findings show the most significant cyber threats law firms face include phishing, ransomware, data breaches and attacks on your supply chain. Your supply chain will include many organisations, people, resources and activities. Any part of this complex network can be singled out by criminals looking for ways to compromise your data and systems."
        },
        {
            "heading": 2,
            "text": "What could happen?"
        },
        {
            "text": "Hostile actors have a range of tactics for accessing an organisation’s network. Phishing emails, or malware to extract sensitive company data, are among the favoured approaches. Another way is to drop destructive ransomware on to the network, before attempting a so called ‘double extortion’ against the victim. This happens when online data is both stolen and encrypted."
        },
        {
            "heading": 2,
            "text": "What should we do?"
        },
        {
            "text": "We encourage organisations to mitigate the threat by:"
        },
        {
            "heading": 2,
            "text": "Where can I find out more?"
        },
        {
            "text": "A webinar giving you the opportunity to meet experts from both the National Cyber Security Centre (NCSC) and the Ministry of Justice is taking place on Wednesday 25 January 2023, 4pm to 5pm. It is now open for bookings."
        },
        {
            "text": "This is your opportunity to learn more and ask questions about the essentials of cyber security and how to protect yourself online:"
        },
        {
            "text": "Ransomware and cyber security webinar"
        },
        {
            "text": "We also have a wide range of resources on the NCSC website, which you can use to protect your organisation from attack."
        },
        {
            "text": "You can sign up to receive cyber security updates, weekly ‘threat’ reports and news about events and webinars from our subscription centre. You can opt out any time."
        },
        {
            "text": "* Full names of individuals working for the NCSC need to be protected for security reasons"
        }
    ]
}