{
    "url": "https://services.blog.gov.uk/2023/01/11/creating-the-conditions-to-deliver-good-public-services/",
    "title": "Creating the conditions to deliver good public services",
    "authors": [
        "Dan Wintercross – Associate Director, GP IT Futures, NHS Digital"
    ],
    "categories": [
        "Service design"
    ],
    "pub_date": "2023-01-11T10:45:44+00:00",
    "content": [
        {
            "text": "Having worked across the public sector in a number of government departments, local authorities and the NHS, I’ve experienced first hand some of the extraordinary achievements that have taken place over recent years. Whether that was to deliver the changes required for Brexit or to support the fight against COVID-19, a lot of complex services have been stood up at speed. I often ask myself, what makes good public services possible?"
        },
        {
            "text": "Before delving in, it’s worth briefly defining what a (public) service is. A service is something that enables a user to do something, such as learn to drive, register to vote or apply for a passport. Importantly, however, public services in most cases are not a choice, users cannot go elsewhere in the market to get the outcome they need, such as applying for a state benefit, this therefore requires these services to work for everybody."
        },
        {
            "text": "Many of us working in government and the wider public sector will know what makes a good service. It should be grounded in a firm understanding of your users needs, adhering to to the Service Standard, accessible, and utilising technology to enable scalability. However, it is evident across the vast array of services delivered to the public that how good and usable a service is, varies considerably."
        },
        {
            "heading": 2,
            "text": "Leadership that enables good services"
        },
        {
            "text": "In order to understand what makes a good service it is vital to have an appreciation of what enables the design and build of good services. By enable I mean the organisational set up, mindset, ambition, risk appetite, culture, funding models, and the nature of the leadership in the organisation. Does the leadership for example buy in to building user centred services in the right way?"
        },
        {
            "text": "We have come a long way in the UK over the last 12 years or so. We have the Service Standard established by the Government Digital Service and the NHS’, award winning design patterns and a growing and thriving Digital, Data and Technology (DDaT) community. However, we still have significant inconsistencies in relation to the way we design and build services across the public sector, resulting in varying experiences for our users, citizens, organisations and businesses."
        },
        {
            "text": "The public have (rightly) become used to services that work for them, whatever their needs. This is why it’s important to recognise the significant number of complex services delivered in response to COVID-19 were largely effective and met the user needs because the voices of user centred, product centric people were heard loud and clear by those at the top."
        },
        {
            "text": "Paradoxically, the pandemic provided an opportunity for the government, local authorities, NHS and wider public sector to learn at scale how users engage with services. In many ways, this has enabled a resetting of the dynamic and relationship between the public and providers of public services, based on trust and it is vital we keep this momentum, with effective leadership across our public organisations."
        },
        {
            "heading": 2,
            "text": "Driving consistency in public services"
        },
        {
            "text": "Despite swathes of government (local and central) and the NHS delivering effective user centred services, it begs the question, how do we ensure that all public services across the UK are designed and built to better meet the needs of our users? This is not a new question but the reality still shows, from experience, that there remains significant differences in the understanding and appreciation of what a good service looks like and how you deliver them, or dare I say, whether this is important."
        },
        {
            "text": "As mentioned, we have thriving communities working with the same goals in mind (cross gov, cross NHS Slack channels, Services Week, NHS UCD maturity models and the NHS UCD working group) but for real change to take place at pace, we need our leaders to be committed and equipped to implement the DDaT framework, from policy and communication professionals, to hospital operations directors, clinicians and Local Authority housing teams. Within government this is being championed by the great work in the Cabinet Office initiative to drive at refreshing the leadership framework to be more attuned to the vital need for a DDaT, User Centred Design (UCD) mindset in our leadership."
        },
        {
            "text": "The capability and appreciation of DDaT and UCD from our leaders is fundamentally important to ensure we have effective leadership in critical roles in the public sector. Without this we will not be able to deliver the standard of services we need to, but this is only half of the puzzle, a strong(er) network across the public sector that understands the value of what a good service looks like is needed."
        },
        {
            "heading": 2,
            "text": "Embedding user-centred ways of working across the sector"
        },
        {
            "text": "We are making inroads in central government, the next stage is to scale this to ensure that from a holistic service offering, the public sector as a whole takes the same user centred, consistent approach, adhering to the service standards, sharing best practice, reusing components and implementing funding models that reward risk, avoiding preconceived ‘fixed scopes’. All of this will help to drive economies of scale and return on investment, which will be vital in the current economic climate, post-pandemic."
        },
        {
            "text": "As is evident the delivery of any service often touches and integrates with various other parts of the public sector. Achieving the aim of designing and building consistently good public services will only be possible by strengthening ties and further joining up central government, the wider NHS ecosystem, local authorities and the third sector. Systems thinking and enterprise leadership are vital to help facilitate this."
        },
        {
            "text": "By building and growing this network of DDaT grounded and user centred leadership we can be confident that we are all moving in the same direction to ensure we deliver good services for our users and serve as a reference point in delivering good services to the public, across the world. A consistent standard and ‘look and feel’ of services can only help to drive user satisfaction and trust from the public, which is arguably the most difficult sentiment to achieve."
        },
        {
            "text": "The value of getting this right, establishing a leadership network and capability that understands the value of DDaT and user centred design cannot be underestimated in terms of delivering better citizen/patient outcomes. Complementing this with the enormous efficiencies that would be enabled by a more connected public sector stands to establish an as yet unattainable consistency in the quality of public services."
        },
        {
            "text": "We need to move away from ‘policy’ being handed over to DDaT professionals and ensure our policy leaders appreciate and understand the fundamentals of what makes a good service. A service and policy is more likely to succeed in it’s objectives if policy makers are closer to DDaT. Through policy co-creation, drawing upon the right blend of skill sets it is shown to result in better outcomes for citizens and government."
        },
        {
            "text": "For real change to take place in the wider public sector, to deliver against the objective of delivering good public services, it needs to start from the top. As stated on the posters of the Government Services Week 2022, with tongue in cheek, ‘Services are too important to be left to Digital’. "
        }
    ]
}