{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/01/11/reflections-on-diversity-from-my-experience-as-emwf-sponsor/",
    "title": "Reflections on diversity from my experience as EMWF sponsor",
    "authors": [
        "goscomms"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Talent & Leadership"
    ],
    "pub_date": "2023-01-11T15:47:21+00:00",
    "content": [
        {
            "text": "Let me start by addressing the obvious. I am writing as the sponsor of the Ethnic Minority Women’s Forum (EMWF), but I am not from an ethnic minority and am a man. I will never be able to fully understand how people in this intersection feel, or the challenges that they face in their careers – or indeed in many other aspects of their lives.  "
        },
        {
            "text": "So why am I the sponsor of this Forum? And what value could I possibly bring in this context to a group that I do not belong to?  "
        },
        {
            "text": "My role as EMWF sponsor is underpinned by my strong belief that diversity and inclusion is not just a ‘nice to have’ – it is essential for the success of an organisation. Of course there are strong moral, ethical and social arguments for diversity and inclusion, but there is also a clear business case: diversity and inclusion improves performance.  "
        },
        {
            "text": "The Civil Service tackles big, important challenges every day. Challenges that if we overcome, will improve our society. But they will not be solved by an organisation consisting of like-minded individuals that look the same, have the same background, share the same belief structure and the same knowledge base. An organisation that does not reflect the diversity of the society it serves will perform less well. "
        },
        {
            "text": "In my field of science, I have seen first-hand the benefits of diversity; the new idea that comes from an unexpected quarter, the challenge to the status quo and received wisdom, the input of a perspective from a disadvantaged group that makes us all stop and think again. I have seen this in discovery science in academia, in my role in industry trying to discover new medicines, and of course on a daily basis during COVID-19. The formation of a subgroup of SAGE (the Scientific Advisory Group for Emergencies) that focused on ethnicity and disadvantaged groups was influential in many ways, from biology to behavioural science. Innovative start-up technology companies often actively seek diversity from the get-go, because they know it will help them become successful.  "
        },
        {
            "text": "That is why I am passionate about encouraging diversity in the Civil Service. Only by proactively seeking and including diverse perspectives, experiences and skills, can we truly innovate as an organisation and arrive at solutions to the complex problems and opportunities that we face.   "
        },
        {
            "text": "I have learned a lot about the challenges faced by ethnic minority women in the Civil Service since becoming sponsor of the EMWF. Just listening to daily personal experiences and the effects of everyday actions in the workplace makes me realise the energy and determination that is required to do things that as a white male I take for granted. I also work with the Forum to advise on how to approach senior leaders in government and obtain tangible actions from them in order to meet the Forum’s objective of effecting organisational change.  "
        },
        {
            "text": "Where we are and where we’re going  "
        },
        {
            "text": "According to Civil Service statistics, 54.5% of civil servants are women, 15% identify as being from an ethnic minority and 14% identify as having a disability. Looking specifically at science and engineering, the Government Science and Engineering (GSE) Profession recorded that just 31.3% of its members are women, and those who identified as being from an ethnic minority or having a disability were 10% and 8.9% respectively. Although this maps somewhat accurately onto the working population data, people from ethnic minorities aren’t as well represented at higher grades and it’s likely that those at the intersection of two or more disadvantaged characteristics also aren’t represented. Even when targets are reached and the statistics look good, the lived experience of many also suggests that barriers and hurdles to greater inclusivity remain.  "
        },
        {
            "text": "I’m proud to play a small part in the efforts to improve this by being a sponsor of the EMWF and a strong ally. I constantly learn from its members. Making our Civil Service more diverse and making sure we are truly inclusive will make us better at solving complex problems and improving lives. It will also make it a better place to work for all of us.   "
        },
        {
            "text": "I’m proud to play a small part in these efforts by being a sponsor of the EMWF and a strong ally. I constantly learn from its members. Making our Civil Service more diverse and making sure we are truly inclusive will make us better at solving complex problems and improving lives. It will also make it a better place to work for all of us.   "
        }
    ]
}