{
    "url": "https://cddo.blog.gov.uk/2023/01/11/the-digital-excellence-programme/",
    "title": "The Digital Excellence Programme",
    "authors": [
        "Barbra Webber, Head of Digital learning and frameworks, CDDO"
    ],
    "categories": [
        "DDaT",
        "DDaT community",
        "Digital learning and development",
        "Digital transformation"
    ],
    "pub_date": "2023-01-11T09:28:44+00:00",
    "content": [
        {
            "text": "Digital skills at scale is one of the key pillars in the government's Transforming for a Digital Future Strategy launched last year. As part of this, one of our key commitments is to ensure that over 90% of senior civil servants will be upskilled on Digital, Data and Technology essentials, with learning embedded into performance and development standards. "
        },
        {
            "text": "My previous blog posts have outlined CDDO’s Autumn of Digital Learning programme which included the popular Innovation Masterclass and impressive guest speakers featured in Spotlight webinars. "
        },
        {
            "text": "These events will continue in 2023, but I wanted this post to focus on the new Digital Excellence Programme (DEP), and our drive to support Senior Civil Servants (SCS) outside of the digital, data and technology (DDaT) profession to become a pioneer of the government’s transformation.  Also, you can read more about our digital skills imperative in our Chief Executive, Megan Lee Devlin’s recent blog post."
        },
        {
            "heading": 3,
            "text": "Join our pilot"
        },
        {
            "text": "CDDO and Government Skills and Curriculum Unit (GCSU) are excited to launch Digital Excellence Programme pilot in February 2023. The programme has been designed to support SCS outside of the DDaT profession to become a pioneer of the government’s transformation."
        },
        {
            "text": "With Apolitical, EY and the London School of Economics, you can learn to Build a Digital Culture in Government — and to Build a Data Culture in Government."
        },
        {
            "text": "Two courses, and two tightly-linked ways for SCS to transform government."
        },
        {
            "text": "The pilot is targeted at Senior Civil Servants to support the government’s transformation. We also welcome applications from aspiring senior civil servants (G6 and G7)."
        },
        {
            "text": "Each course is limited to 200 places and we also hope participants will contribute to shaping the delivery of future courses for their peers. This is a fantastic opportunity to not only  interact with leaders from within your own organisation but also across government."
        },
        {
            "text": "The online courses will go live on 21st February and learners will have several weeks to complete them, after which they will be invited to a live event with guest speakers."
        },
        {
            "text": "Course 1: Building a Digital Culture in Government (5 hours)"
        },
        {
            "text": "Forget tech. Think culture. To unlock the transformational potential of digital, the culture of government needs to evolve. To be more user-centred; better integrated across policy, delivery and ops; and more responsive to change. We can’t get there without leadership throughout senior ranks of the Civil Service."
        },
        {
            "text": "Course 2: Building a Data Culture in Government (5 hours)"
        },
        {
            "text": "Data fuels our digital society. The two are inextricably linked. All leaders need to be confident in both the science and management of data. This course builds on the ONS Masterclass to focus on the essential considerations of data management for senior civil servants."
        },
        {
            "text": " "
        }
    ]
}