{
    "url": "https://hmlandregistry.blog.gov.uk/2023/01/11/tried-and-tested-tips-for-reducing-requisitions/",
    "title": "Tried and tested tips for reducing requisitions ",
    "authors": [
        "Gill Parrish, Account Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-01-11T12:28:40+00:00",
    "content": [
        {
            "text": "HM Land Registry is working with customers to help drive down the number of requests for information (requisitions) we send, which cause delays in the registration process and can lead to cancellations.  "
        },
        {
            "text": "Enact Conveyancing has worked closely with HM Land Registry to reduce its requisition rate to less than 8%, using a combination of practical measures and Business Gateway services as part of an organisational drive to minimise requisitions.  "
        },
        {
            "text": "It has been a pleasure working with enact. Led by the post-completion team, their aim has been to ‘touch it once’. Put simply, enact don’t lodge applications and wonder if HM Land Registry will accept them, they lodge applications knowing that the applications are in order. "
        },
        {
            "text": "Here, enact’s Remortgage Support Manager, Alan Connor-Clark, talks about new strategies they’ve implemented. These are delivering positive results for enact’s customers, as well as improving efficiency. "
        },
        {
            "heading": 2,
            "text": "Enact's experience"
        },
        {
            "text": "Over the past three years, we’ve been working with Account Manager Gill Parrish to improve consistency. With her encouragement and support, we’ve reduced our requisition rate considerably to a consistent 6-8% range, using a combination of practical measures and Business Gateway services.  "
        },
        {
            "heading": 2,
            "text": "Time and money "
        },
        {
            "text": "As a high-volume conveyancing firm, we recognised that reducing requisition rates could save us time and money so, as part of a concerted effort to tackle the issue, we empowered our post-completion team to give them more influence and authority to improve applications. "
        },
        {
            "text": "With an eye on enhancing quality from the ground up, we augmented our quality control processes pre-completion, to minimise incidents of incorrect data making its way onto the AP1 form at submission. When incorrect data is submitted, our post-completion team now sends a request back to the case handler to check the application data or provide any outstanding additional evidence. This helps everyone involved with the application focus on getting it ‘right the first time’.  "
        },
        {
            "heading": 2,
            "text": "Quick wins"
        },
        {
            "text": "Enact has also implemented some changes within its casework management systems, including: "
        },
        {
            "heading": 2,
            "text": "Training and rewards "
        },
        {
            "text": "Our determination to drive down requisition rates means quality is top-of-mind among our operations staff, and they’re encouraged with reward strategies to get it ‘right the first time’. Our post-completion team must complete a thorough training regimen when they join the company, and they also have the benefit of a coach/mentor who is on hand to assist with queries. "
        },
        {
            "text": "In addition to our ongoing investment in training for our staff, we track actual requisition rates and their causes, so we can identify opportunities to further enhance efficiency and quality. This approach drives our organisational decision-making and is a crucial factor in delivering on our contractual commitments. "
        },
        {
            "heading": 2,
            "text": "A great relationship"
        },
        {
            "text": "By empowering the post-completion team, investing in training and incentives, and embedding a quality ethos throughout all of our teams, enact has achieved a sustained reduction in requisition rates of more than a third across the many thousands of applications we lodge every year. We continue to work with HM Land Registry to maintain or further reduce current rates.  "
        },
        {
            "text": "We have a great relationship with Gill and the team. We’re both receptive to feedback, and share the same desire for a speedy, efficient registration process. We track and dissect our requisitions constantly, and regularly review the results together, meaning hot spots are identified quickly. I’m also impressed with their drive to innovate."
        }
    ]
}