{
    "url": "https://educationhub.blog.gov.uk/2023/01/why-teaching-is-a-rewarding-career/",
    "title": "Why teaching is a rewarding career",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Teacher pay",
        "teachers"
    ],
    "pub_date": "2023-01-11T10:10:17+00:00",
    "content": [
        {
            "text": "Teaching is a job like no other. It’s unique in combining a rich range of professional skills with creativity, excitement and personal satisfaction – and a sense of making a real difference to the lives of children."
        },
        {
            "text": "Teaching is a hugely rewarding career, not just in the lifelong impact teachers can have but also in terms of salary, pension and development."
        },
        {
            "text": "Here’s everything you need to know about a career in teaching."
        },
        {
            "heading": 3,
            "text": "Qualified teachers have a starting salary of at least £28,000"
        },
        {
            "text": "The starting salary for a newly qualified teacher is at least £28,000 and this is set to rise to £30,000. In Inner London the starting salary is more; at least £34,500. Teachers receive annual pay rises through an independent pay review process, and many teachers also see greater uplifts by progressing up the pay scales."
        },
        {
            "text": "Most teachers in the first few years of their career will receive pay rises of up to 15.9% this year, from the combination of the pay award and progression up the pay scale. And around 40% of experienced teachers below the top of their pay range will also get pay increases through progression or promotion, on top of the 5% pay award."
        },
        {
            "text": "For classroom teachers the median salary across the country was £39,500 in November 2021 – above the national full-time median of £33,200 (according to ONS data). The pay rise of 5% for experienced teachers is equivalent to an extra £2,000 per year."
        },
        {
            "heading": 3,
            "text": "Headteachers’ pay is in the top 10% in the country"
        },
        {
            "text": "In leadership positions the rewards are even greater – the average salary for a headteacher in a primary school in November 2021 was £67,400 while the average salary for a secondary school headteacher was £94,900. Both figures put headteachers among the top 10% of earners in the country."
        },
        {
            "text": "The 5% pay rise for headteachers is equivalent to an increase of £3,400 in primary and £4,700 in secondary. In fact, headteachers’ salaries can rise as high as £123k or £131k in London. Other leadership positions, like heads of department or heads of year also see increased salaries."
        },
        {
            "heading": 3,
            "text": "Teachers get a 23.6% employer pension contribution, significantly higher than most professions (according to ONS data)"
        },
        {
            "text": "Teachers’ pensions are among the best and safest available – and they come with a 23.6% employer pension contribution. By contrast, in the private sector 48% of employees receive an employer contribution of less than 4%. Teacher contributions start from as little as 7.4% and a maximum of 11.7%."
        },
        {
            "text": "This table sets out the employer pension contributions and total remuneration packages at the various average salary points for teachers and headteachers."
        },
        {
            "text": "You can read more about teacher pensions here: Teachers’ Pensions – what you need to know - The Education Hub (blog.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Teachers can also benefit from a range of career development opportunities"
        },
        {
            "text": "We’re investing more and more in teachers’ professional development. Our reformed initial teacher training will increase the confidence of those entering the workforce, supporting longer term retention, and ultimately raising standards for every child."
        },
        {
            "text": "Underpinning support for early career teachers is the new ITT Core Content Framework and the Early Career Framework: together, these ensure that new teachers will benefit from at least three years of evidence-based training, across ITT and into their induction."
        },
        {
            "text": "And we’re committed to making sure teachers and school leaders can continue to develop once they’re established in their careers too. Last year, almost 30,000 teachers and leaders started a fully funded National Professional Qualification (NPQ). NPQs are designed by education experts to build classroom expertise or develop leadership confidence and are flexible to fit around teachers’ personal and professional responsibilities. You can find out more about NPQs in the NPQ Prospectus."
        },
        {
            "heading": 3,
            "text": "We’re also continuing to help drive down unnecessary workload for teachers."
        },
        {
            "text": "We continue to work with the sector to reduce teacher workload and improve teacher wellbeing, and work with the profession to understand and address longstanding issues around marking, planning and data management. The school workload reduction toolkit, developed alongside school leaders, is a helpful resource for schools that can enable them to reduce workload."
        },
        {
            "heading": 3,
            "text": "How to get into teaching"
        },
        {
            "text": "For those thinking of pursuing a career in teaching, please visit: Inspire the next generation | Get Into Teaching GOV.UK (education.gov.uk)."
        }
    ]
}