{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/10/23/change-nhs-and-the-role-of-mental-health-social-work/",
    "title": "Change NHS and the role of mental health social work",
    "authors": [
        "Robert Lewis"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Mental health"
    ],
    "pub_date": "2024-10-23T13:28:50+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our voice is needed"
        },
        {
            "text": "This week, the Department of Health and Social Care, in partnership with NHS England, launched the Change NHS campaign."
        },
        {
            "text": "This is the beginning of an ongoing conversation with the public as, together, our government and healthcare leaders seek the widest range of views possible to shape a new 10-Year Health Plan for England."
        },
        {
            "text": "This major public engagement on the future direction of the NHS is open also to those who work within and alongside the health service, presenting a welcome opportunity for social workers and others to add their voice to the NHS they would like to see."
        },
        {
            "text": "For social workers generally, and for mental health social workers (MHSWs) in particular, the relationship between local authorities and the NHS can sometimes feel fraught at the interface."
        },
        {
            "text": "For those employed directly in NHS Mental Health Trusts, they can often feel hidden and struggle to have their skills and knowledge recognised for the contribution they undoubtedly bring."
        },
        {
            "text": "As the fastest growing profession in the NHS mental health workforce, MHSWs need to embrace this opportunity to help bring about the changes we all want to see."
        },
        {
            "heading": 2,
            "text": "Unique perspectives"
        },
        {
            "text": "With our focus on strengths-based, person-centred, and trauma-informed approaches, mental health social workers are ideally placed to support the NHS in achieving the aims of the Community Mental Health Framework and the Government’s hoped for ‘shifts’ from hospitals to communities and treatment to prevention."
        },
        {
            "text": "What are you seeing that creates barriers to providing the best care and support? What do you need in the role to be successful? What ideas do you have for improving the services we work in?"
        },
        {
            "text": "One area of practice that is routinely exposed to the challenges of securing timely and appropriate responses to individuals is our work under the Mental Health Act."
        },
        {
            "text": "With social workers making up 95% of the Approved Mental Health Professional (AMHPs), one of the greatest privileges of the role is the opportunity to work across all age groups, with all types of difficulty and in all environments."
        },
        {
            "text": "Whether it is in emergency departments, custody suites, the person’s home, psychiatric wards, or prison cells, AMHPs see the whole system operating in real time. They see the challenges and missed opportunities for improvement."
        },
        {
            "text": "I encourage all local, national, or regional AMHP forums to invest the time to bring together your reflections and offer you voice and expertise to this process for the benefit of all."
        },
        {
            "text": "Think about the role the NHS could play in supporting your considerations at section 13, what meaningful alternatives to admission might look, and the benefits of partnership working between those with lived experiences, the NHS, local authorities and the VCSE sector."
        },
        {
            "text": "To our many mental health social workers and AMHPs I encourage you to talk, formulate and communicate your ideas and make sure you use this opportunity to bring the changes we need in the NHS."
        },
        {
            "heading": 2,
            "text": "What we can do right now"
        },
        {
            "text": "Whether you respond in a personal or professional capacity, it is essential we get this message out to those we support. Please encourage those with lived experience to add their voices too."
        },
        {
            "text": "Everyone can get started by signing up here."
        },
        {
            "text": "If you are:"
        }
    ]
}