{
    "url": "https://apprenticeships.blog.gov.uk/2024/10/23/jacqui-mcintosh-talks-to-ifate-about-representation-in-hair-and-beauty-apprenticeships/",
    "title": "Jacqui McIntosh talks to IfATE about representation in hair and beauty apprenticeships",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprenticeship standards",
        "Black History Month",
        "Employers",
        "Insider insights",
        "Route Panel"
    ],
    "pub_date": "2024-10-23T10:04:26+01:00",
    "content": [
        {
            "text": "This year, British Beauty Week coincides with Black History Month. The 2024 British Beauty Week theme is “a beauty industry that looks like you”, which highlights the importance of representation and inclusion in the beauty industry."
        },
        {
            "text": "IfATE is committed to the pursuit of equity, diversity, and inclusion in education. You can read about this goal in our equity, diversity and inclusion (EDI) framework and toolkit."
        },
        {
            "text": "IfATE also provides equality and diversity advice for employers of apprentices."
        },
        {
            "text": "To find out more, we spoke to Jacqui McIntosh. Jacqui is a globally renowned salon hairstylist, artistic educator, platform artist, qualified teacher, assessor, internal verifier, award-winning educator and trichologist. Her impressive career spans three decades and she is often referred to as the all-knowing “authority of textured hair and its business”."
        },
        {
            "text": "Jacqui has influenced the hair industry across Europe as well as generations of hairdressers across the globe. At Francesco Group, she worked with some of the largest hairdressing groups in the UK. She was Director of Francesco Group Birmingham Hair Academy, heading up their excessively curly hair centre of excellence, and the extraordinary Education Director for Avlon Industries (Europe)."
        },
        {
            "text": "She was recently celebrated as an industry pioneer for British Afro hairdressing as part of Black History Month."
        },
        {
            "heading": 2,
            "text": "Why are you passionate about diverse representation in the hair  industry? "
        },
        {
            "text": "As a Black person who has worked and trained from salon floor to management, I’ve seen how people from my community can be excluded or misrepresented.  "
        },
        {
            "text": "The hair industry plays a significant role in shaping how we view ourselves, and how we feel about our appearance. If we don't see people like us being catered to, it perpetuates the idea that our beauty is less valued. Representation is about more than aesthetics; it’s about self-worth, identity, and empowerment.  "
        },
        {
            "text": "I’ve been in rooms where Afro hair was seen as a niche. I’ve had to push for more inclusive curriculums and conversations about diversity. I joined the IfATE route panel because that change starts with education. We need to make sure that our hair standards, training programs, and career pathways reflect the rich diversity of our society.  "
        },
        {
            "heading": 2,
            "text": "How can apprenticeships remove inequalities faced by hair and beauty clients?"
        },
        {
            "text": "Hair and beauty apprenticeships must include a focus on: "
        },
        {
            "text": "This should not be an afterthought in training, but an integral part of the curriculum.  "
        },
        {
            "text": "This naturally broadens the range of services available to Black and minority clients. Employers and educators have a responsibility to make sure the next generation of professionals can cater to everyone.  "
        },
        {
            "heading": 2,
            "text": "What support should employers in the beauty industry give to Black apprentices?"
        },
        {
            "text": "To support Black and minority apprentices, employers must: "
        },
        {
            "text": "Representation is key. When learners see people who look like them succeeding in the industry, they will see themselves in those roles.  "
        },
        {
            "text": "Apprenticeships are a fantastic way to open doors for underrepresented groups, but they must be accessible.  "
        },
        {
            "text": "This means:"
        },
        {
            "heading": 2,
            "text": "How are you working with IfATE to make these changes within the hair and beauty sector? "
        },
        {
            "text": "Through my work with IfATE, I’m advocating for more inclusive training standards.  "
        },
        {
            "text": "This involves: "
        },
        {
            "text": "No apprentice should qualify without the ability to work with Afro-textured hair. Diversity must be embedded as a standard in the curriculum, not as an option.  "
        },
        {
            "text": "We also want to see better access to apprenticeships for Black and minority groups. We want to see more diversity in the professionals progressing into leadership roles, and influencing change.  "
        },
        {
            "text": "My goal is to help create an industry where diversity is not an afterthought. Diversity must be the foundation on which we build success. "
        },
        {
            "text": "Further information: "
        }
    ]
}