{
    "url": "https://nationalscreening.blog.gov.uk/2024/10/23/prudence-not-popularity-is-the-key-to-uk-nscs-work-says-chris/",
    "title": "Prudence, not popularity, is the key to UK NSC’s work, says Chris",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-10-23T14:13:50+01:00",
    "content": [
        {
            "text": "Members of the UK National Screening Committee (UK NSC) know their work will not always be popular with everyone."
        },
        {
            "text": "The UK NSC is sometimes criticised for being slow or standing in the way of progress and innovation, but committee member Professor Chris Hyde believes history is on its side."
        },
        {
            "text": "People naturally believe prevention is better than cure and a screening programme can seem an obvious government response. The UK NSC’s role is to establish if screening would be an efficient way of finding people who could benefit and reassuring those who would not."
        },
        {
            "text": "The committee’s careful evidence-based approach may sometimes be unpopular, particularly if something looks like it would save lives or disability."
        },
        {
            "text": "“People want easy answers and good news stories,” said Chris. “They don’t want people equivocating, so they may think we’re too negative. But I think history is on our side.”"
        },
        {
            "text": "Screening programmes affect millions of people, involve lots of staff, and the tests and treatments can be expensive. The UK NSC must ensure it gives the 4 UK governments the best information it can so they can make the right decisions for everyone."
        },
        {
            "text": "“The UK NSC has a well-earned reputation for rigour and prudence,” added Chris. “Screening is not as simple and obvious as it may initially look, and we have to look at things really carefully.”"
        },
        {
            "heading": 2,
            "text": "Influenced and trained by the best"
        },
        {
            "text": "Chris was brought up in Hertfordshire and studied medicine at St Thomas’s in London where he spent about 10 years as a hospital doctor, mainly in casualty departments."
        },
        {
            "text": "In the late 1980s, Chris trained as a public health specialist after becoming interested in the impacts of the environment, lifestyles, and poverty on health. Some of his public health training was in Oxford with the inspirational Sir Muir Grey, who helped set up the UK NSC and was its first director."
        },
        {
            "text": "“Muir was very passionate about all sorts of issues in public health, particularly the evidence, so I was taught by the best. The evidence-based healthcare movement was very strong in Oxford at the time, and I was very much influenced by that.”"
        },
        {
            "text": "After completing his specialist public health training, Chris took up a post at the University of Birmingham, running the ARIF research unit that aimed to improve how research findings are incorporated into healthcare decision making. Chris worked there for about 10 years, doing systematic reviews and helping healthcare commissioners interpret the evidence."
        },
        {
            "text": "In 2009, Chris moved to Exeter, both to lead the Exeter Test Group and succeed Prof Ken Stein as director of the Peninsula Technology Assessment Group. The Exeter Test Group is an internationally recognised centre of excellence for test evaluation, bringing together a broad range of skills in systematic evidence reviews, economic modelling, evaluation, and original research. "
        },
        {
            "text": "He is Chair of Public Health and Clinical Epidemiology at the University of Exeter and has a long association with policy making on tests. He was a member and then vice-chair of the National Institute of Health and Care Excellence (NICE) diagnostics advisory committee between 2009 and 2020, helping assess new tests coming on the market."
        },
        {
            "heading": 2,
            "text": "Big decisions and a big responsibility"
        },
        {
            "text": "Chris became a member of the UK NSC in 2017."
        },
        {
            "text": "“My public health background gives me a sense of the totality of everything which goes on in healthcare and influences health, from hospitals and primary care to social care and economic circumstances,” he said. “Screening occupies a really important place in that totality."
        },
        {
            "text": "“It’s important we get it right because screening is something which is imposed on people who are usually completely well and don’t have any symptoms. Screening is also very expensive. Tens of millions of pounds are required to set up any new screening programme and if they go wrong, they affect a lot of people, so they’re politically very sensitive."
        },
        {
            "text": "“All screening programmes have many different potentially positive and negative dimensions. Somehow, we’ve got to try to identify them all and bring them together to make an overall judgement about whether screening does more good than harm."
        },
        {
            "text": "“It’s also not just about setting up screening programmes, it’s making sure they are delivered to a high quality. Quality assurance is essential for them to deliver the promised benefits. We also feel it’s important that screening should be available to everybody. One of the great virtues of national screening programmes is that, to some extent, they overcome some of the issues of inequity.”"
        },
        {
            "text": "The UK NSC decision Chris has contributed most to, both as a member and through evidence generated by the Exeter Test Group, was the positive recommendation for a targeted lung cancer screening programme."
        },
        {
            "text": "The Exeter group’s modelling evidence contributed significantly to the recommendation, particularly in terms of the cost effectiveness of screening."
        },
        {
            "text": "“It has been incredibly interesting, but really complicated, and makes you realise the challenges the committee faces in terms of the complexity of the decisions,” said Chris."
        },
        {
            "text": "“It’s hard to take all the different potential benefits and harms of screening into consideration because quite often they don’t all move in the same direction.”"
        },
        {
            "text": "Chris is particularly interested in how the UK NSC assesses cost effectiveness and incorporates health economics into its decisions. Cost effectiveness modelling is challenging, partly because there are so many variables such as workforce capacity, the cost of tests and equipment, the interface between screening and primary care, and how to manage screen-detected incidental findings."
        },
        {
            "text": "“Incorporating all these things into an economic model is very challenging because every time you add in something new, it just makes the model more complicated,” said Chris."
        },
        {
            "text": "The UK NSC is currently grappling with the challenge of how to assess evidence for a range of new technologies such as artificial intelligence, multi-cancer tests and whole genome sequencing. The committee needs answers to lots of questions before determining if these technologies would do more good than harm at affordable cost when applied to screening."
        },
        {
            "text": "“There is a growing interest in screening as a way of treating public health challenges like cancer and in using new technologies,” said Chris. “They’re all interesting ideas, but they all need to be proven. There’s no such thing as an obvious slam dunk.”"
        },
        {
            "heading": 2,
            "text": "Making a splash away from work"
        },
        {
            "text": "Chris, who now spends half of his time based in Manchester and half in Exeter, has 2 children in their mid-20s. His son works in communications and his daughter is an analytical chemist."
        },
        {
            "text": "His main leisure pursuit is open water swimming. He recently completed a 10km swim along the River Dart in Devon, the equivalent of a swimming marathon, in an impressive time of 2 hours 40 minutes."
        },
        {
            "text": "“The West Country has so many beautiful bits of open water. I also swim in North Wales and have done quite a few swims in the Lake District,” he said."
        },
        {
            "text": "“It’s a lovely thing to do and there’s always something new to look at. I usually wear a wet suit, so I haven't really got much excuse not to go in at any time of the year.”"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}