{
    "url": "https://naturalengland.blog.gov.uk/2024/10/23/shaun-the-sheep-a-visit-to-aston-rowant-national-nature-reserve/",
    "title": "Shaun the Sheep: a visit to Aston Rowant National Nature Reserve",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Coast and access",
        "Connecting People with Nature",
        "Countryside Code",
        "Education",
        "Landscapes and access",
        "Mental health and wellbeing",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery",
        "Parks, trails and nature reserves",
        "wildlife and farming"
    ],
    "pub_date": "2024-10-23T14:43:26+01:00",
    "content": [
        {
            "text": "By Stephanie Wilson, Reserve Manager, Thames Solent Team at Natural England"
        },
        {
            "text": "Here at Aston Rowant National Nature Reserve (NNR), conservation grazing is one of many management tools we use to look after the site. You could argue having a conservation grazing flock is slightly more challenging than other management tools (I’ve certainly never had to deal with a woolly Robomower jumping over a fence!) but in many ways, our habitats would look very different without grazing if we just relied on mechanical management."
        },
        {
            "text": "Aston Rowant NNR sits within The Chilterns National Landscape and for most people it is pretty memorable as the deep cut through the escarpment, where one of the busiest motorways (the M40) is carved. The Nature Reserve sits on both sides of the M40 and in all, is just over 150ha of mixed scrub and juniper, herb rich chalk downland and beech woodland."
        },
        {
            "text": "Our chalk downland really is a special feature: the diversity of the flowering herbs can only really be appreciated during the peak flowering period, when swathes of bright purple, pink and yellow flowers are only matched by the numbers of orchids and accompanying pollinators. We know from countless pieces of research and published papers that, in the main, it is conservation grazing which keeps this habitat looking so wonderful. It is such a science, you can even pin down to the livestock unit, the number of grazing animals required per hectare."
        },
        {
            "text": "Thus, we have sheep. Beulah Speckled Face sheep to be exact. This is a Welsh breed, so they are suited to being out, grazing on the downland, year-round. The flock size varies between 150-200 grazers, split into smaller flocks which are regularly rotated around the paddocks. Over the autumn and winter seasons, the aim is getting the sward down to a close, tightly grazed sward whilst occasional spring and summer grazing is key to keeping on top of dominant grass species which can, if left unchecked, outcompete the smaller chalk herbs."
        },
        {
            "text": "As anyone with livestock will know, an inevitable challenge is the conflict between dogs and livestock in the countryside. So, the team here were excited to hear that the Countryside Code Champion, Shaun the Sheep, was planning to visit the site over the summer of 2024. We felt this presented an opportunity to produce a short film, all about the Countryside Code. With the Champion being a huge sheep, it was a perfect link for us to explain why we have sheep on the reserve, what conservation grazing is and why it’s so important for the chalk downland habitat on the Nature Reserve."
        },
        {
            "text": "With Shaun under our belts with his wonderful messaging around Respecting, Protecting and Enjoying the Countryside, we were delighted to recruit another partner, Stokenchurch Dog Rescue, to expand on the value of having dogs on a lead in the countryside: not only for livestock and livestock owners, but also for other four-legged friends enjoying the nature reserve. Volunteers from the dog rescue can often be spotted on site in their bright Hi-Viz jackets, walking an array of rescue dogs: all different breeds, colours and sizes, and all with different needs. As Tim from Stokenchurch Dog Rescue explains in the film, you can never be sure how different dogs will interact, so its worth being careful and keep dogs on a lead."
        },
        {
            "text": "We hope viewers will take away from this project the value of dogs being on a lead in the countryside– it really does make a difference to the welfare of our flocks, but also means all the other users we welcome to the Nature Reserve, including the hairy kind, can enjoy the site."
        },
        {
            "text": "Shaun hopes you’ll have a Baa-rilliant time, enjoying your adventures in the Countryside, and remember to Respect, Protect and Enjoy!"
        },
        {
            "text": "Have a watch of the full film below, and if you’re interested in learning more – or visiting the Aston Rowant NNR, you can find further info here:"
        },
        {
            "text": "Oxfordshire's National Nature Reserves - GOV.UK (www.gov.uk)"
        },
        {
            "text": "About the Countryside Code:"
        },
        {
            "text": "The Countryside Code is the public's guide to Respecting, Protecting and Enjoying outdoor spaces, created during the introduction of the 1949 National Parks and Access to the Countryside Act. The Shaun the Sheep X Countryside Code partnership began in May 2023 and is due to finish in 2025."
        },
        {
            "text": "The Countryside Code "
        }
    ]
}