{
    "url": "https://food.blog.gov.uk/2024/10/23/small-and-micro-food-business-operator-tracking-survey-wave-4-findings/",
    "title": "Small and Micro Food Business Operator Tracking Survey: Wave 4 Findings",
    "authors": [
        "Laura Gent"
    ],
    "categories": [
        "Business guidance"
    ],
    "pub_date": "2024-10-23T13:58:23+01:00",
    "content": [
        {
            "text": "Today, we published wave 4 of the small and micro FBO (food business operator) tracking survey. The survey takes place every other year and tracks small and micro FBOs' views on a variety of topics, including trust in the Food Standards Agency, and opinions on regulatory issues affecting their industry."
        },
        {
            "heading": 3,
            "text": "Background"
        },
        {
            "text": "The Food Standards Agency has been conducting these surveys since 2018, and the data collected has helped inform engagement and intervention activity targeted at businesses with fewer than 50 staff."
        },
        {
            "text": "Wave 4 took place from October to December 2023, with a total of 556 small and micro FBOs surveyed. To ensure the findings were representative of the small and micro FBO population the data was weighted."
        },
        {
            "heading": 3,
            "text": "Key findings"
        },
        {
            "heading": 4,
            "text": "Perceptions of the FSA"
        },
        {
            "text": "Awareness of the Food Standards Agency (FSA) amongst small and micro businesses remains high, which is consistent with previous waves of the survey (97 – 98% across all waves). Most businesses surveyed felt the FSA works hard to ensure food safety standards are maintained and improved (94%)."
        },
        {
            "text": "Around a third (30%) of businesses who had heard of the FSA had been in contact with them in the previous 12 months. These businesses rated the FSA highly on several metrics (on a scale from 1 to 10, where 1 is ‘very poor’ and 10 is ‘excellent’):"
        },
        {
            "text": "Most FBOs (94%) were confident the FSA can be trusted to use any information they give them appropriately, and that the FSA is good at identifying where poor standards exist (90%). Additionally, 87% were confident that the FSA understands the needs of businesses like theirs."
        },
        {
            "heading": 4,
            "text": "Confidence in the food safety system"
        },
        {
            "text": "FBOs expressed high confidence in food safety and hygiene standards and regulations with at least eight in ten agreeing that food standards and regulations are:"
        },
        {
            "heading": 4,
            "text": "Regulation awareness"
        },
        {
            "text": "The majority of businesses (85%) felt informed about regulations affecting their business, with 31% feeling very informed. However, awareness of the government’s commitment to Smarter Regulation was low (17%)."
        },
        {
            "heading": 4,
            "text": "Challenges and barriers"
        },
        {
            "text": "The survey found that the most pressing challenges for FBOs are:"
        },
        {
            "text": "These concerns have shifted since 2021, when supply chain disruptions and COVID-19 were the primary issues."
        },
        {
            "heading": 4,
            "text": "Importing and exporting trends"
        },
        {
            "text": "The proportion of FBOs involved in importing and exporting remains low, with only 3% importing and 1% exporting. Businesses that had changed their importing practices in the last 12 months suggested that the UK’s exit from the EU, changes to import costs and business growth were the primary factors that led them to change their importing practices."
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "Wave 5 of the survey will take place in 2025/26. If you have any questions or would like to see a particular topic covered in the next wave please contact: laura.gent@food.gov.uk."
        }
    ]
}