{
    "url": "https://space.blog.gov.uk/2023/05/05/egg-shaped-stars-and-wolf-359-the-uk-night-sky-in-may/",
    "title": "Egg-shaped stars and Wolf-359: The UK night sky in May",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2023-05-05T11:16:40+01:00",
    "content": [
        {
            "text": "May brings a meteor shower, a conjunction of the Moon with Mars and Venus, and a chance to see the core of our Milky Way galaxy."
        },
        {
            "text": "Those with binoculars or telescopes can look even further into space and search for galaxies that lie in the spring constellations."
        },
        {
            "heading": 2,
            "text": "Look out for Leo"
        },
        {
            "text": "Looking high in the south as darkness falls, you’ll see the pattern of stars that form constellation of Leo the Lion. You can find a map of this patch of sky below."
        },
        {
            "text": "The brightest star in Leo and the heart of the lion is Regulus, which is a system of four stars that lies around 80 light-years away from our Solar System."
        },
        {
            "text": "Regulus is a blue-white star around three times larger than our Sun and more than 250 times as bright. The speed at which it spins - rotating in just 16 hours compared to our Sun’s 25 days - has distorted the star, making it slightly egg-shaped."
        },
        {
            "text": "Leo is also home to one of the closest stars to our Sun, although the distances involved are still staggering. Depending on your preferred unit of measurement, the star ‘Wolf-359’ lies just eight light-years away, that’s around 80 trillion kilometres, 50 trillion miles, or 500,000 times the distance between Earth and the Sun!"
        },
        {
            "text": "While you’d think a star this ‘close’ would be prominent in our night skies, Wolf-359 is actually so small and faint that it can only be seen through a telescope. At 97,000km (60,000 miles) across, it’s only around 15% of the size of our Sun, and only slightly larger than Jupiter (71,000km or 44,000 miles)."
        },
        {
            "text": "This tiny star is known as a ‘Flare Star’ as it has been observed to dramatically increase in brightness from time to time, an effect caused by enormous solar flares erupting from it."
        },
        {
            "text": "Astronomers have identified that there may be at least two planets orbiting Wolf-359, though the erratic nature of their parent star is likely to make them very hostile environments."
        },
        {
            "heading": 2,
            "text": "Other night sky sights – galaxies and the Milky Way"
        },
        {
            "text": "May’s night skies host the constellations of Leo, Ursa Major, Canes Venatici, Coma Berenices and Virgo, which have a vast number of galaxies that can be spotted with the aid of binoculars or a telescope."
        },
        {
            "text": "The moonless nights around the middle of the month will give the best chance, and the further you can get from the light-filled skies of towns and cities, the more you’ll see."
        },
        {
            "text": "Remember that modern cameras are more sensitive to light than our eyes, so the images (like those above) are larger and brighter than you’ll see through binoculars or a telescope, but there’s something special about seeing these galaxies with your own eyes, seeing light that’s been travelling across space for tens of millions of years!"
        },
        {
            "text": "The other beautiful sight visible this month is the brighter band of stars that make up our own galaxy, the Milky Way, which requires an early start and dark skies to see."
        },
        {
            "text": "Get away from bright sources of light, give your eyes time to adapt to the darkness and look south-east in the hour or two before the dawn skies start to lighten. The lighter band of stars stretch from higher in the east down to the horizon in the south – from a truly dark-sky sight, the view is unforgettable."
        },
        {
            "heading": 2,
            "text": "The Moon and planets"
        },
        {
            "text": "Venus reaches its highest point in our evening skies early next month, so May is a great opportunity to see the brightest planet blazing in the west. Look out on the evening of 23 May to see a 50% illuminated (“first quarter”) moon between Venus and red-hued Mars."
        },
        {
            "text": "Saturn is visible in the south-eastern sky in the early hours of the morning and is joined later in the month by Mercury and Jupiter, which peak above the eastern horizon in the lightening skies just before sunrise."
        },
        {
            "text": "You may see news of a lunar eclipse on 5 May this month. Sadly, the event will have ended by the time the full moon rises around 9pm that evening.  Stargazers in the UK will have to wait until October for the next visible lunar eclipse."
        },
        {
            "heading": 2,
            "text": "The Eta Aquarids Meteor Shower"
        },
        {
            "text": "The Eta Aquarids meteor shower is expected to peak around 5-6 May, and there’s a good chance of spotting meteors throughout the month.  The peak of this shower coincides with the full Moon, which will be low in the southern sky."
        },
        {
            "text": "This may make it harder to spot some of the fainter meteors, but by getting away from as much ground light as possible and blocking the moon from your view, you stand a good chance of seeing as many as 50 meteors an hour."
        },
        {
            "text": "These meteors are tiny fragments of Comet Halley, colliding with our atmosphere at speeds of over 65 kilometres (40 miles) per second and burning up as they do.  Comet Halley’s orbit means it travels into the inner Solar System every 76 years, last passing through in 1986."
        }
    ]
}