{
    "url": "https://supportingfamilies.blog.gov.uk/2023/05/05/supporting-families-working-in-partnership-a-family-journey/",
    "title": "Supporting Families working in partnership: A family journey",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Health",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict",
        "Transformation",
        "Uncategorized"
    ],
    "pub_date": "2023-05-05T14:14:11+01:00",
    "content": [
        {
            "text": "Family Details "
        },
        {
            "text": "Mum Jo (21) and Dad Mike (22) have a daughter Leah (10 months) and a son Stuart, who was born several months after the work started. "
        },
        {
            "text": "There is a large extended maternal family who supported the parents and children and were involved in the multi-agency plan. "
        },
        {
            "text": "What happened? Why were services involved? "
        },
        {
            "text": "Jo disclosed during a maternity appointment that she had been physically abused by her partner Mike. The midwife referred Jo to children’s social care as there had been a pattern of physical and emotional abuse over the previous months.  "
        },
        {
            "text": "The couple had lived together through the COVID-19 pandemic, during which their daughter Leah had experienced violence and this put their unborn baby at risk too. "
        },
        {
            "text": "What help did they received? "
        },
        {
            "text": "The family were brought into Child Protection planning team and a social worker was allocated as lead practitioner to facilitate a team around the family's needs.  "
        },
        {
            "text": "A collaborative care plan enabled a range of well-paced interventions for both parents to access. The plan focussed on the strengths of the family whilst ensuring the safety of Jo and the children. "
        },
        {
            "text": "Although initially the couple separated due to police bail conditions, there were times during the process that they appeared to be reuniting. The risk to the children was therefore dynamic, requiring a dynamic plan for the family. Mike was ultimately convicted of offences against Jo and was subject to a probation order. "
        },
        {
            "text": "Once the parents had permanently separated, there were disputes about co-parenting and care of the children. Mike wanted to see the children regularly, but he was not able to be consistent enough to enable this. "
        },
        {
            "text": "The social worker used strength-based Motivational Interview techniques to empower the family to make the most of the support offers available and encouraged them to take ownership for their progress. Motivational Interviewing is an approach that supports the family member to identify and state what their priorities are and how they want to make change. When they felt comfortable to do so, the parents addressed previous childhood trauma with the social worker, and mental health practitioner. "
        },
        {
            "text": "Jo discussed with the social worker that she wanted to move house to be closer to her family. She often felt anxious and recognised that she needed support around her. She also shared she wanted to gain some educational qualifications and become a midwife herself. "
        },
        {
            "text": "The maternal family, as well as some members of the paternal family, were involved as part of a whole family plan to enable the safety and well-being of the children in the long term. The children’s development was monitored by health workers throughout. "
        },
        {
            "text": "Building on the very positive parenting that Jo intuitively provided for the children, 11 delivery partners contributed to the successful outcomes for the family.  "
        },
        {
            "text": "The support provided by agencies included Jo attending a domestic abuse Freedom Programme on-line, in-home parenting support provided for Mike by the social worker, a range of domestic abuse provisions for Mike, and individual mental health support for both parents. "
        },
        {
            "text": "What progress was made/what changed? "
        },
        {
            "text": "The children were at times exposed to abuse and conflict between the parents, but the risks significantly decreased through the period of support.  "
        },
        {
            "text": "Jo demonstrated significant resilience during this process, and she focussed on the emotional well-being of the children. She gained priority for a housing transfer and started an access programme at college. Leah was also benefiting from childcare in a nursery setting. "
        },
        {
            "text": "Mike spoke very positively of the services that he had received, especially in relation to his own mental wellbeing. Mike had not worked since the start of the pandemic and was offered support to access employment when he is ready.  "
        },
        {
            "text": "The Family Group Conference process was used to review how the extended family could be alerted to any risks for the children and support Mike to continue have access to his children in a safe way. "
        },
        {
            "text": "The support this family received demonstrated a positive example where one whole family plan based on the strengths of the family itself provided well-paced interventions. This enabled the safety and well-being of the children and contributed to developments for the parents that will enable them to sustain long-term benefits for themselves and the children. The family is moving out of statutory support.  "
        },
        {
            "text": "Comment from Jo “Don’t be afraid to get the help. Things will go smoothly as long as you are open to it and you work together” "
        },
        {
            "text": " "
        }
    ]
}