{
    "url": "https://companieshouse.blog.gov.uk/2023/05/05/the-companies-register-the-coronation-years/",
    "title": "The companies register: the coronation years",
    "authors": [
        "Justin Toland - Media & PR Lead"
    ],
    "categories": [
        "Companies House transformation",
        "Historic records"
    ],
    "pub_date": "2023-05-05T10:59:04+01:00",
    "content": [
        {
            "text": "As the nation prepares to celebrate the coronation of King Charles III, what better way to bring the Companies House register to life than through the lens of past coronations?"
        },
        {
            "text": "This blog post gives a snapshot of the register at the time of the 5 previous coronations in the 179-year history of Companies House."
        },
        {
            "text": "Companies House was formed in 1844, just 6 years into the long reign of Queen Victoria.  This meant it would be nearly 60 years before our first change of monarch."
        },
        {
            "heading": 2,
            "text": "The Edwardian era"
        },
        {
            "text": "After ascending to the throne in 1901, Edward VII was crowned King at Westminster Abbey in London on 9 August 1902."
        },
        {
            "text": "A search of our records shows that 1,623 companies incorporated before that date are still active on the register today."
        },
        {
            "text": "Looking into the data, we can see that these companies include familiar names such as:"
        },
        {
            "text": "The Edwardian era was comparatively short (1901 to 1910), but it certainly left its mark on the public consciousness. Think Edwardian jackets (the inspiration for the “Teddy Boys” half a century later) and King Edward potatoes (which were cultivated especially for the 1902 coronation)."
        },
        {
            "text": "Among the thousands of firms incorporated during Edward VII’s reign are famous names from retail (Waitrose, Selfridges), industry (Shell, BP) and the world of football (The Arsenal Football Club Limited; Manchester United Football Club Limited)."
        },
        {
            "heading": 2,
            "text": "George V and George VI"
        },
        {
            "text": "The coronation of King George V took place on 22 June 1911."
        },
        {
            "text": "A total of 2,752 companies incorporated by that date are still active on the register today."
        },
        {
            "text": "The reign of George V (1910 to 1936) saw the rise of new forms of mass entertainment, including recorded music, movies and the radio. The Performing Right Society, British Board of Film Classification, and Radio Society of Great Britain all date from this era."
        },
        {
            "text": "They are among 10,155 companies in existence at the time of George VI’s coronation on 12 May 1937 and still active on the register today, or around 1 in 16 of all companies then registered. In total, there were 159,498 companies on the register at the end of 1936."
        },
        {
            "heading": 2,
            "text": "The second Elizabethan age"
        },
        {
            "text": "By the end of 1952, the year that Elizabeth II became Queen, there were 260,789 companies on the register. Nearly 20,000 companies incorporated by her coronation day (2 June 1953) are still active on the register today. That is around 1 in 13 of all companies then registered."
        },
        {
            "text": "Elizabeth II’s coronation was notable for being the first to be fully televised. 7 companies that produce, distribute or broadcast television programmes that were on the register then are still active today."
        },
        {
            "text": "The second Elizabethan age was an era of expansion and change for Companies House. We opened our Cardiff site in 1976 to cope with the rapid growth of the register, which continued as company records moved from paper to microfilm to digital storage."
        },
        {
            "text": "By the end of 2022, there were more than 5 million companies on the register. The effective register - which excludes companies in the process of removal or liquidation - included more than 4.5 million companies at that time. These are categorised using SIC codes into more than 700 different types of business."
        },
        {
            "text": "As we celebrate another royal milestone, it’s fascinating to think how the register will grow during the reign of King Charles III, what new types of business will be incorporated, and which companies will continue to thrive."
        }
    ]
}