{
    "url": "https://naturalengland.blog.gov.uk/2023/05/05/the-death-of-free-a-natural-england-tagged-hen-harrier/",
    "title": "The death of Free, a Natural England tagged hen harrier",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Hen Harriers",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2023-05-05T09:28:25+01:00",
    "content": [
        {
            "text": "Stephanie Bird-Halton, Director, National Delivery, Natural England"
        },
        {
            "text": "Hen harriers are currently extremely rare in England due to illegal persecution and nest disturbance, primarily in areas associated with grouse shooting. Natural England satellite-tracks hen harriers in order to investigate patterns of dispersal and survival, and the causes of any deaths. This blog is about Free, one of our tagged hen harriers, that died due to human persecution."
        },
        {
            "text": "Free was hatched in 2020 from a nest in Cumbria, and in April 2022 he was two years old. At around this time, he had apparently settled in an area of moorland around Birkdale, near the border of Yorkshire and Cumbria. Our staff raised concerns when Free’s tag transmitted a signal late at night on 11 April 2022, indicating he was away from his normal roosting area."
        },
        {
            "text": "As always, the police were immediately informed. It is not always possible to accurately identify the location of a satellite tag, as they do not transmit constantly, but in this case the tag was swiftly tracked down to a rocky slope above Outhgill. Free was found dead, headless and missing a leg, but showing no other sign of being eaten or scavenged by an animal predator, and still fitted with his satellite tag."
        },
        {
            "text": "Free’s body was recovered and sent for post-mortem examination to diagnose signs of death. Shockingly and upsettingly, the post-mortem examination concluded that Free’s leg had been torn off while he was alive, and that the cause of death was the head being twisted and pulled off while the body was held tightly. These injuries would be consistent with Free being killed by human hands. There were no other signs of damage from any animal, and Free had not been shot."
        },
        {
            "text": "The police and National Wildlife Crime Unit were kept informed, and no information has been shared publicly while enforcement action has been ongoing. Unfortunately, the police investigation did not gather sufficient information to identify a suspect. We are appalled and upset by this horrible death of a beautiful bird, but without further evidence the police and Natural England have no basis for further action. Any requests for more details about this case, or new evidence, should be directed to Cumbria police."
        },
        {
            "text": "What next? "
        },
        {
            "text": "We are sickened by this evidence of persecution, which remains a serious issue and needs more focus and action from the police, businesses, landowners, and game management interests. We will continue our work tracking hen harriers and will make every effort to track down tags that stop transmitting, and to support the police in their role of bringing the perpetrators of these crimes to justice."
        },
        {
            "text": "Natural England remains committed to working with our partners on hen harrier recovery. We are encouraged by the possibilities demonstrated by the recent increase in nesting hen harrier numbers overall, and will continue to work to turn the tide on the illegal persecution of these at-risk birds."
        },
        {
            "text": "We regularly share the status of all our satellite-tracked Hen Harriers (every few months) on this page."
        },
        {
            "text": " "
        },
        {
            "text": "Acknowledgements:"
        },
        {
            "text": "We are grateful to our partners at the Zoological Society of London, the National Wildlife Crime Unit, North Yorkshire Police and Cumbria Police for their work on this investigation."
        }
    ]
}