{
    "url": "https://teaching.blog.gov.uk/2023/05/05/transform-the-planning-and-delivery-of-tutoring-in-your-school/",
    "title": "Transform the planning and delivery of tutoring in your school",
    "authors": [
        "Sez Aydin"
    ],
    "categories": [
        "Secondary schools",
        "Teachers' reflections"
    ],
    "pub_date": "2023-05-05T11:56:45+01:00",
    "content": [
        {
            "text": "Geography and business studies teacher Sez Aydin at Haileybury Turnford secondary school in Hertfordshire, shares how the role of tutoring coordinator has transformed the way they deliver school-led tutoring."
        },
        {
            "text": "This year, we are delivering school-led tutoring to approximately 200 pupils in years 7, 8 and 11 in maths, English and science. We do this during the school day, after school and also run a Saturday school, prioritising pupils who are eligible for pupil premium."
        },
        {
            "text": "With such a large number of pupils needing support, coordinating tutoring can be a huge undertaking. This academic year, we created a tutoring coordinator role to help us manage this successfully and reach more pupils with a structured model targeted at those who needed it most."
        },
        {
            "text": "The tutoring coordinator would coordinate the plan, deliver and evaluate tutoring in our school. I volunteered to carry out this role alongside my teaching responsibilities to make sure our most disadvantaged pupils get the support they need."
        },
        {
            "text": "Specifically, I help to:"
        },
        {
            "text": "Acting principal Maxine Goodes adds: Designating the duties of a tutoring coordinator within our existing teaching staff has led to the development of a structured tutoring model. This has enabled us to support more of our most vulnerable students and fully utilise the opportunities available through the National Tutoring Programme (NTP), which is having a positive academic impact across the school."
        }
    ]
}