{
    "url": "https://vets.blog.gov.uk/2023/05/05/welcoming-the-muscat-manifesto-putting-amr-at-the-top-of-global-agendas/",
    "title": "Welcoming the Muscat Manifesto-putting AMR at the top of global agendas",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Government Veterinary Services",
        "International Work",
        "Policy Work"
    ],
    "pub_date": "2023-05-05T15:31:10+01:00",
    "content": [
        {
            "text": "Today I want to reflect on the Muscat Manifesto and how it showcases international commitments to accelerate One Health Actions on antimicrobial resistance."
        },
        {
            "text": "It was presented at the Third High-Level Ministerial Conference on Antimicrobial Resistance (AMR) hosted by the Sultanate of Oman, with the UK delegation being led by the UK Special Envoy for AMR, Dame Sally Davies and supported by officials from Defra and DHSC."
        },
        {
            "text": "Antimicrobial Resistance (AMR) is one of the most pressing issues of our time and has far reaching consequences for global health, food and environmental security and sustainability. New data estimates that over a million human deaths worldwide were directly attributable to antibiotic resistance in 2019."
        },
        {
            "text": "The UK has made great strides nationally in raising awareness of AMR and inspiring action to tackle this accelerating pandemic. I want to encourage that, alongside my counterparts in human, animal, plant, and environmental health, this continues not just here, but worldwide."
        },
        {
            "text": "The Muscat Manifesto declaration commits countries to a comprehensive set of ambitions targeted at tackling AMR, with One Health at its centre. A few examples of the commitments included in the manifesto are:"
        },
        {
            "text": "The manifesto commitments complement the UK’s objectives in our UK National AMR Action Plan as well as the ambitions in our 20 -Year Vision for AMR, and I am proud to say the UK, alongside 46 other countries across the globe, have endorsed the Manifesto.  This will help inform conversations in political leadership and action on AMR in the upcoming UN General Assembly AMR High Level Meeting (UNGA HLM) in 2024."
        },
        {
            "text": "How the UK is supporting the Manifesto"
        },
        {
            "text": "The UK has already succeeded in achieving many of the commitments in the Manifesto and will take forward its ambition as we develop our new National Action Plan on AMR. We also recognise the Muscat Manifesto as a tool to galvanise action on AMR on a global scale. We will therefore look to it as we plan new international activity on AMR."
        },
        {
            "text": "We are currently developing the next five-year National Action Plan (2024-2029), which will build on our successes to date as well as incorporate the experience the UK has gained in recent years, including the lessons learnt from the Covid-19 pandemic. We want to ensure the UK is in a good position to deal with the complexities of AMR using a One Health approach. One of the targets in the Muscat Manifesto is to reduce the total amount of antimicrobials in the agri-food system by 30-50% by 2030. This aspirational target will drive the global ambition and commitment towards responsible use of antimicrobials in the agri-food sector."
        },
        {
            "text": "The UK has already achieved a 55% reduction in antibiotic use in animals since 2014 using a voluntary and collaborative approach between government, the agriculture industry, and the veterinary profession. The use of any antibiotic as growth promoters has been banned in the UK since 2006, and it is our intention to continue to reduce the unnecessary use of antibiotics in UK livestock while safeguarding animal health."
        },
        {
            "text": "To support global efforts to reduce the use of antimicrobials in the agri-food sector, the UK is championing the FAO’s RENOFARM (Reduce the Need for Antimicrobials on Farms) initiative. This 10-year global initiative aims to support countries to achieve a global reduction in antimicrobial use on farms , no matter where they are on their journey to responsible antimicrobial use in agriculture. Having achieved this on a national level the UK will continue to be a supportive global partner for other countries on their own journey to responsible and prudent use of antimicrobials in animals."
        },
        {
            "text": "I am proud to say that the UK has played a role in supporting  another global initiative, the Quadripartite AMR Multi-stakeholder Partnership Platform (AMR-PP) which was presented at the Oman Conference. This Platform will support stakeholders across the One Health family to collaborate and find solutions to translate global initiatives into local action. The AMR-PP and RENOFARM will be vital tools in supporting countries to work towards tackling AMR and fulfil the ambitions of the Muscat Manifesto."
        },
        {
            "text": "In March, the first congress of the FAO AMR Reference Centres was co-hosted with FAO by the agencies of the UK FAO Reference Centre for AMR at the APHA Weybridge, covering FAO and Quadripartite AMR initiatives. Some of the highlights of the congress have been expanded in this article."
        },
        {
            "text": "These are just some of the international activities we have been involved with alongside many others, including multilateral forums such as the G7 and G20, Codex Alimentarius and the Transatlantic Task Force on AMR."
        },
        {
            "text": "Alongside global Heads of State, politicians, scientific experts, and cross-sector representatives, Dame Sally Davies represents the UK on the AMR Global Leaders Group. The Global Leaders Group on AMR consists of world leaders and experts working together to raise public and political awareness of AMR, and they will be working across the UN system to contribute to an ambitious High-Level Meeting on AMR at the UN General Assembly in New York next year. The UK looks forward to supporting the Global Leaders Group and UN system on this."
        },
        {
            "text": "I’m excited to see The Muscat Manifesto is being endorsed by so many countries and huge thanks to Oman for their leadership in hosting the conference, which brought many countries together as we look towards the UNGA High Level Meeting on AMR.  This manifesto signposts a long-term commitment to keep AMR at the centre of One Health agendas, encouraging and empowering governments and stakeholders to make real change and improve health outcomes for all. We very much look forward to building on the momentum of this work for the UNGA High Level Meeting on AMR in 2024."
        },
        {
            "text": " "
        }
    ]
}