{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/01/27/helping-businesses-comply-with-the-funerals-order/",
    "title": "Helping businesses comply with the Funerals Order",
    "authors": [
        "Dipesh Shah"
    ],
    "categories": [
        "Remedies"
    ],
    "pub_date": "2023-01-27T10:00:09+00:00",
    "content": [
        {
            "text": "To ensure funeral directors and crematorium operators comply with the Funerals Order, we’ve published new guidance. We’re also now starting to take enforcement action to resolve compliance issues we’ve identified.  "
        },
        {
            "heading": 2,
            "text": "The Funerals Order"
        },
        {
            "text": "Anybody who has had to arrange a funeral will know that it can be a confusing and difficult process. Too often, it can also be far more expensive than many people expect.  "
        },
        {
            "text": "In 2021, the Competition and Markets Authority (CMA) completed an in-depth market investigation into the funerals sector after concerns were raised that some funeral directors were not treating customers fairly. The CMA found that bereaved families not always being given the information they need to choose the right funeral within their budget, especially when they are grieving and under time pressure. That’s why the CMA made the Funerals Market Investigation Order 2021. "
        },
        {
            "text": "The Order covers a range of issues, including the requirements for funeral directors and crematorium operators to provide price and other commercial information to customers. "
        },
        {
            "text": "The Order enables funeral directors and crematorium operators to support bereaved families and friends in making the right choices to meet their needs and budget during difficult times.  "
        },
        {
            "heading": 2,
            "text": "Making sure every business complies"
        },
        {
            "text": "Funeral directors and crematorium operators have been required to comply fully with the Order since September 2021. We recognise the efforts made by many businesses in the sector to ensure that they are meeting the requirements of the Order. We also appreciate the active support of trade associations in encouraging compliance amongst their members.  "
        },
        {
            "text": "However, our monitoring work across the sector has revealed that some businesses are only partially compliant and in some cases, have made no effort at all to comply with their legal obligations. "
        },
        {
            "text": "Now is the time for all funeral directors and crematorium operators to step up and help their customers purchase the funeral that best meets their needs and budget.  "
        },
        {
            "text": "That is why to help businesses make sure they know what to do, we: "
        },
        {
            "text": "This will improve the ability of everyone who has to arrange a funeral to have access to clear and consistent information from businesses. "
        },
        {
            "text": "Read the Funerals Order guidance alongside the Order and Explanatory Note to be sure you know what you need to do. "
        }
    ]
}