{
    "url": "https://ruralpayments.blog.gov.uk/2023/01/27/introducing-you-to-16/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2023-01-27T10:56:41+00:00",
    "content": [
        {
            "text": "Hi, I’m Carrie Smith and I’m an External Affairs Manager with RPA, based at the York office."
        },
        {
            "text": "I’ve worked for RPA since 2014 when the work area I was part of at the time (Rural Development) moved into RPA from Defra."
        },
        {
            "text": "It’s quite hard to describe what I do day-to-day in my role because it varies so much, but the simplest way to summarise is that I engage with people, both internally in RPA and also externally, to understand how we can work better, and to influence areas where we can make improvements happen."
        },
        {
            "text": "My primary goal is to consider what we can do differently to make life easier for those who access our services. A big focus for me is on accessibility and what we need to have in place to support people who might struggle to do what they need to do through traditional means. I think about everything from the point of view of those who are hardest to reach, or less likely (or less able) to engage – what do they need and how can we make it happen?"
        },
        {
            "text": "I have an ongoing responsibility to engage with various farming welfare organisations and charities to ensure their views and feedback on RPA services and schemes are recognised and acted on. This involves regular virtual sessions, but I’ve also been privileged to have been invited to speak at a number of face-to-face events about what RPA is doing to constantly improve the relationship we have with farmers."
        },
        {
            "text": "At the moment my team is working on two exciting initiatives which should strengthen our ability to develop those relationships. The first is around building up a network of people who can confidently engage with farmers at a local level. The aim is to support our people to be able to go out and represent RPA at events and have meaningful conversations about things that matter to farmers."
        },
        {
            "text": "The second is to get more of our people out visiting farms so they have a greater understanding and appreciation of the challenges farmers face, and how what we do has a real impact on real people’s lives."
        },
        {
            "text": "Alongside my work on external engagement, I also work with colleagues across the RPA and Defra communications teams to plan the best ways to get information out across all our channels. Most days will either involve planning or writing something for us to share like a press notice, or a letter, and I’m no stranger to writing for the RPA blog!"
        },
        {
            "text": "I enjoy being part of a team that genuinely wants to make a difference and I agree with Elise’s view in the last blog that the best way we can support our farmers further is by developing RPA people’s understanding of the farming community. As well as the initiatives mentioned above, I know from working alongside farming welfare groups that mental health in rural communities is a real issue, so I’m currently working on plans for how we can offer rural-specific mental health training to our people who are working directly with farmers."
        },
        {
            "text": "Prior to this role I’ve worked across many parts of RPA, usually internal facing, so putting myself out there to represent RPA was daunting to start with, and certainly outside my comfort zone, but I strive to be visible and authentic in every interaction, and that’s the same whether I’m talking to colleagues, farmers or external stakeholders."
        },
        {
            "text": "Outside work I’m a complete bookworm and regularly consume two or three books a week, of all genres. In the spring and summer I enjoy a day out walking, but in the winter I don’t have to pretend I get the same enjoyment because my grumpy border terrier is happy with a short stroll a few times a day, and then getting back to his rightful place in front of the fire – which coincidentally is also my favourite reading spot."
        },
        {
            "text": "I’ve also recently bought an Edwardian house on the edge of Harrogate with my partner. It needs a lot of TLC so we’re currently planning what we need to do to help it reach its full potential. I’m excited to have a project and to see the progress we make and I’m especially happy that we’re perfectly positioned for exploring the beautiful Yorkshire Dales when we need a break from DIY."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}