{
    "url": "https://educationhub.blog.gov.uk/2023/01/27/remote-education-when-can-school-children-learn-from-home-and-how-should-they-do-it/",
    "title": "Remote education – when can school children learn from home and how should they do it?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "remote education",
        "Schools"
    ],
    "pub_date": "2023-01-27T13:25:54+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "We know children learn best when they are at school, surrounded by their friends and teachers. Attendance is essential for pupils to get the most out of their school experience."
        },
        {
            "text": "There may, however, be times when a pupil is unable to attend because their school is forced to restrict attendance to some or all pupils, for example during any disruption that may be caused by upcoming strike action. In exceptional cases, a child might also be unable to attend for medical reasons but well enough to learn from home."
        },
        {
            "text": "In these circumstances, a school may consider providing remote education, allowing children to keep on track with their education and stay connected to their teachers and friends."
        },
        {
            "text": "Here we tell you what you need to know about learning from home."
        },
        {
            "heading": 3,
            "text": "When can school children learn from home? "
        },
        {
            "text": "It’s really important that remote education is not viewed as an equal alternative to attendance in school. For this reason, schools should only consider it as a last resort when the alternative would be no education."
        },
        {
            "text": "Schools may suggest that pupils should learn from home ‘remotely’ if pupils are unable to attend school in person due to closures or restrictions on attendance. This might, for example, be due to adverse weather or because there are higher than normal levels of staff absence. Restrictions to school attendance and closures should only happen in very exceptional circumstances and usually only where school leaders or the local authority (also known as the council) have decided that it would not be possible to open a school safely."
        },
        {
            "text": "There may also be limited instances where an individual pupil cannot attend school but is still able or well enough to continue their learning. This could be because they are:"
        },
        {
            "text": "When a child cannot attend school but is well enough to learn, their school should always seek to overcome the barriers to attendance and provide support for the pupil to attend before offering remote education. It is important that remote education is only considered as a last resort and a short-term solution as part of a plan to reintegrate back to school."
        },
        {
            "text": "Children whose attendance is likely to be affected in the long-term may need additional support. To bring the absence to an end as soon as possible, the school should work with the child, their parents or carers and, if appropriate, a relevant medical professional."
        },
        {
            "heading": 3,
            "text": "How should children access remote education? "
        },
        {
            "text": "Schools are likely to already have remote education plans in place. These should be regularly reviewed in consultation with staff and be adaptable to the individual needs and circumstances of pupils and their families."
        },
        {
            "text": "As school closures and individual absences often happen without warning, schools should share up-to-date procedures with parents or carers and pupils, so they know what to expect."
        },
        {
            "text": "It’s the school’s responsibility to make sure that any work provided during periods of remote education is high quality, ambitious, and covers an appropriate range of subjects. Schools should aim for remote work to be equivalent in length to the core teaching time they would receive in school. However, this is not always possible and a child’s age, home environment and learning needs should be considered."
        },
        {
            "text": "Not every pupil is able to access online or digital remote education, and schools should consider working to overcome these barriers. For example, they might distribute school-owned devices like laptops or tablets, or provide printed resources."
        },
        {
            "text": "Remote education might include:"
        },
        {
            "heading": 3,
            "text": "How do children on free school meals access their meals if they’re learning from home?"
        },
        {
            "text": "Where pupils eligible for benefits-related free school meals are receiving remote education, schools should work with their catering team either to provide good quality lunch parcels or to issue a food voucher if available. This will make sure that eligible pupils continue to be supported for the period they are unable to attend school. More information on free school meals can be found at Free school meals: guidance for schools and local authorities."
        },
        {
            "heading": 3,
            "text": "Can pupils with special educational needs and disabilities (SEND) access home education? "
        },
        {
            "text": "If pupils with SEND are not able to attend school and require remote education, their teachers are best placed to know how to help them continue to learn effectively."
        },
        {
            "text": "Some pupils with SEND may not be able to access remote education without adult support. Schools should work collaboratively with families to put arrangements in place that allow pupils with SEND to access education remotely. Decisions on how remote education can be provided should be informed by the individual needs of the pupils and their families."
        },
        {
            "text": "However, it may be challenging or impossible for the school to deliver remotely the kind of approach that it does in the classroom. In this instance, the school must instead consider, in cooperation with the local authority (if the child has an education health and care (EHC) plan), other ways in which it and the local authority can help."
        },
        {
            "heading": 3,
            "text": "Can vulnerable children still attend school during closures? "
        },
        {
            "text": "School leaders should take all reasonable steps to keep schools open for as many pupils as possible. Where there is no option but to restrict attendance, priority should be given to key cohorts including vulnerable children, children of critical workers, and pupils due to sit public exams and formal assessments."
        },
        {
            "heading": 3,
            "text": "Where can I find out more?"
        },
        {
            "text": "Remote education guidance for schools"
        },
        {
            "text": "Parental responsibility measures"
        },
        {
            "text": "NHS Is my child too ill for school guidance"
        },
        {
            "text": "Illness and your child's education"
        },
        {
            "text": "Learning to talk | 3 to 5 years | Start for Life"
        },
        {
            "text": "Teacher strikes: everything you need to know about strikes in schools "
        },
        {
            "text": " "
        }
    ]
}