{
    "url": "https://environmentagency.blog.gov.uk/2023/01/27/to-catch-a-thief/",
    "title": "To catch a thief",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-01-27T12:37:29+00:00",
    "content": [
        {
            "text": "We know there are people out there who see the waste industry as a route to make a fast buck. But we are on a mission to stop them to protect the environment, support the legitimate waste management industry and collect unpaid taxes which go into the public purse."
        },
        {
            "text": "One of the ways we are doing this is through our partnership with HMRC. Since 2018 we have been working together to shut down illegal waste sites and individuals’ who evade paying landfill tax by illegally depositing waste."
        },
        {
            "text": "When we suspect tax evasion as part of an illegal waste activity in the waste industry, we refer these cases to HMRC to investigate to check if the required tax has been paid."
        },
        {
            "text": "Anyone found to be directly depositing waste or knowingly causing or facilitating disposals at an unauthorised waste site can expect to be charged by HMRC for unpaid landfill tax."
        },
        {
            "text": "If more than one person is responsible, everyone involved can be held jointly liable and potentially gets a bill, be it waste brokers or dealers, waste hauliers, landowners, waste producers and company officers."
        },
        {
            "text": "Interest will also be added and if so, backdated to the date of disposal. On top of this, an additional wrongdoing penalty (which can be up to 100% of the tax due) can be charged, depending on how much assistance the tax avoider provides to us during our enquiries."
        },
        {
            "text": "We can seek criminal prosecution through the courts for anyone we find to be running an illegal waste site, which can result in fines or prison – or both. In these cases, HMRC can still collect monies due from the evasion of paying the landfill tax."
        },
        {
            "text": "All unauthorised waste disposals are taxed at the standard rate, which is currently £98.60 per tonne. As an example, anyone involved in an unauthorised waste disposal of 5500 tonnes, would get a tax assessment of £542,300 and a penalty up to the same value, which together would total more than £1 million."
        },
        {
            "text": "As a result of our referrals, HMRC have issued millions of pounds worth of tax bills. This shows committing waste crimes won’t pay.  This is good for the environment and good for the public purse."
        },
        {
            "text": "This successful partnership with HMRC will continue with more collaboration and information sharing, making those responsible for causing long-lasting damage to our environment by dumping waste and running unauthorised waste sites, pay for the destruction they cause."
        },
        {
            "text": "If you suspect crime within the waste industry, you can report it anonymously to Crimestoppers: www.crimestoppers-uk-org"
        },
        {
            "text": "If you are running a waste business, make sure you have the right permits in place: www.gov.uk/guidance/waste-environmental-permits"
        },
        {
            "text": "The most up to date information about unauthorised waste sites and how to be compliant with Landfill Tax legislation is available here: www.gov.uk/government/publications/excise-notice-lft1-a-general-guide-to-landfill-tax/excise-notice-lft1-a-general-guide-to-landfill-tax#landfill-tax-unauthorised-sites"
        }
    ]
}