{
    "url": "https://space.blog.gov.uk/2024/11/18/enabling-technologies-programme-advanced-and-novel-space-instruments/",
    "title": "Enabling Technologies Programme: Advanced and Novel Space Instruments",
    "authors": [
        "Emily Jayne Peters"
    ],
    "categories": [
        "Catalysing Investment",
        "Funding"
    ],
    "pub_date": "2024-11-18T12:43:01+00:00",
    "content": [
        {
            "text": "In this series of blog posts we have highlighted many of the 41 ongoing Enabling Technologies Programme (ETP) projects funded by the UK Space Agency, featuring work on lasers, to space exploration, to sensors and satellites. "
        },
        {
            "text": "In our latest blog, we bring you results from project teams across the UK who are making strides in a variety of advanced or novel instruments for space. "
        },
        {
            "heading": 2,
            "text": "COSMOS"
        },
        {
            "text": "Led by Dr Ajit Panesar, an ETP-funded project recently concluded at Imperial College London (ICL) having successfully developed cold spray metal additive manufacturing for application in space under their project, “COSMOS”. "
        },
        {
            "text": "A key enabler for both in-orbit servicing and manufacturing as well as exploration missions, Dr Panesar and his team explain their results and share insights from the lab in the video below."
        },
        {
            "text": "Also at Imperial College London, Dr Adam Masters and team are developing “SpiderMAG: Webs of Low-Resource Sensors and AI: Emerging Disruptive Technology for Magnetic Field Measurements in Space”.  "
        },
        {
            "text": "An enabling technology for low-cost space science missions and applicable to Space Situational Awareness (SSA), this ETP-funded project focuses on a new approach for magnetometer systems, minimising electromagnetic interference and thus reducing the need for booms on spacecraft. This technology will prove invaluable for many crafts in improving payload efficiencies."
        },
        {
            "text": "Dr Masters tells us that the project has already created one new engineering job in the ICL lab, with the potential for more benefits to be realised in the future for this emerging spacecraft technology."
        },
        {
            "heading": 2,
            "text": "LUCES"
        },
        {
            "text": "At Durham University, the ETP-funded project “LUCES (Looking Up image slicers optimum Capabilities in the EUV for Space)”, led by Ariadna Calcines Rosario (Durham University) and Sarah Matthews and Hamish Reid (UCL), is developing instrumentation to improve the space-based study of stars. "
        },
        {
            "text": "Their image slicer technology aims to bolster any research that requires the observation of 2D fields of view in the Extreme Ultra-Violet (EUV) regime. This innovative instrument is set to support solar physics, the observation of stars that cannot be spatially resolved, the study of space weather, and diagnosing fundamental astrophysical processes (such as particle acceleration).  "
        },
        {
            "text": "The Sun is the most energetic particle accelerator in our Solar System, however the image slicers can be used for many other astronomical objects, such as active galactic nuclei (AGN), black holes, neutron stars, gamma ray bursts, accretion disks, planetary magnetospheres or solar and stellar coronae. "
        },
        {
            "text": "To obtain the spectra of the 2D field simultaneously, Integral Field Spectroscopy must be applied, a technique that had not been developed in this spectral range before."
        },
        {
            "text": "LUCES has pushed the boundaries of metallic image slicer technology, obtaining state-of-the-art results and increasing its technology readiness level (TRL) for EUV applications.  "
        },
        {
            "text": "Eleven slicer demonstrators were produced at Durham University’s Centre for Advanced Instrumentation with two main goals:  (1) to reduce the minimum width of the slicer mirrors (related to the resolution), and  (2) to improve the surface roughness (related to stray light and efficiency). "
        },
        {
            "text": "The results of these studies are the best achieved to date, with an improvement of the surface roughness from a typical value of 4 nm RMS to 2.2 nm RMS, and having manufactured the thinnest slicer mirrors ever produced with a width of 15 microns.  "
        },
        {
            "text": "The LUCES team are also the first to ever successfully apply an EUV multi-layer dielectric coating on a slicer demonstrator. The coating is optimised at 18 nm, significantly increasing the efficiency of current solutions. "
        },
        {
            "text": "This project has also produced the conceptual design of an Integral Field Spectrograph combining the surfaces of the Integral Field Unit (IFU) with those of the spectrograph to obtain the spectra of 2D dynamic structures two orders of magnitude faster than the status quo. "
        },
        {
            "text": "The presentation of these results saw Ariadna Calcines Rosario awarded the “Best Oral Presentation” in the SPIE Astronomical Telescopes and Instrumentation international conference 2024 in Yokohama, Japan."
        },
        {
            "text": "To learn more about all 41 ETP-funded projects, take a look at the overview blog post. With ETP grants due to reach completion by March 2025, we look forward to sharing further successes from these promising projects."
        }
    ]
}