{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/18/how-the-national-education-nature-park-is-helping-young-people-restore-and-support-nature/",
    "title": "How the National Education Nature Park is helping young people restore and support nature",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Community",
        "Nature",
        "Plants",
        "Pollinators"
    ],
    "pub_date": "2024-11-18T09:29:08+00:00",
    "content": [
        {
            "text": "This week marks the final week of COP29, with leaders from around the world gathering in Baku, Azerbaijan, to discuss how we halt and tackle the challenge of climate change."
        },
        {
            "text": "We know that addressing the triple planetary crisis — climate change, biodiversity loss and pollution is key to creating a liveable planet for all to enjoy."
        },
        {
            "text": "To mark the conference, the Defra Environment blog team will be sharing nature stories throughout the week."
        },
        {
            "text": "That’s why on Youth Day at COP29, we wanted to raise awareness of schemes like the National Education Nature Park, which is helping to achieve our environmental goals.  helping to achieve our environmental goals. "
        },
        {
            "text": "Introduction to the National Education Nature Park"
        },
        {
            "text": "The National Education Nature Park was launched last year through a partnership between the Department for Education, the Natural History Museum, the Royal Horticultural Society and partners."
        },
        {
            "text": "Rather than being a single physical space open for visits, this initiative helps children and young people around the country connect to the natural world, especially in urban and nature-deprived areas, by mapping their local environment onto an England-wide virtual map."
        },
        {
            "text": "Anything nature-friendly, no matter how small, can be uploaded onto the map. You don’t need to have any existing green space to get involved – you can start with a window box or a hanging basket."
        },
        {
            "text": "The data students upload to the system is used by scientists at the Natural History Museum for research into nature recovery.  "
        },
        {
            "text": "And children and young people are encouraged to view the online, interactive map to see the collective impact being made for nature across the education estate (comprising educational grounds or buildings). "
        },
        {
            "text": "How educational groups can get involved"
        },
        {
            "text": "This scheme is available free of charge to teaching and non-teaching staff from nurseries, schools and colleges. Registering is straightforward through the the Nature Park website."
        },
        {
            "text": "Once signed up, organisations have access to a range of resources, including digital tools, classroom activities and the virtual nature park, which brings together everyone’s green spaces on a national map."
        },
        {
            "text": "The learning resources are linked with the National Curriculum, to help children and young people take positive action for the environment. Pupils can:"
        },
        {
            "text": "Schools are already making a difference"
        },
        {
            "text": "So far, over 3,500 schools and colleges in England have already signed up to take part, and they are starting to see improvements."
        },
        {
            "text": "For example, Milton Hall Primary School and Nursery transformed a grey corner of their playground into a wildlife haven, complete with wildflower containers, trellises and hanging pots. For many of the pupils, their school site is their only access point to nature and helps them to get more engaged with growing."
        },
        {
            "text": "The school started the project with a group of Year 5 pupils, who decided what grey areas could be developed. They then used the Nature Park resources to plan the space, measure the wildlife currently in those areas and research what flowers would be most attractive to pollinators."
        },
        {
            "text": "To see the results, watch the video Milton Hall Primary School have shared."
        },
        {
            "text": "What to do if you’re feeling inspired"
        },
        {
            "text": "Whether it’s through growing pollinator-friendly plants or creating habitats, the Nature Park is inspiring young people to take action to engage with and restore nature in their local area."
        },
        {
            "text": "If you’re also feeling inspired and want to make a difference, read the National Trust guidance on how to make a wildlife-friendly garden or our previous blog post on 5 actions to help pollinators."
        },
        {
            "text": "And if you’re interested in hearing more environmental updates, please subscribe to receive an email notification whenever a blog is published."
        }
    ]
}