{
    "url": "https://naturalengland.blog.gov.uk/2024/11/18/inspectors-tackling-wildlife-crime/",
    "title": "Inspectors tackling wildlife crime",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Licensing",
        "Natural England",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-11-18T10:25:59+00:00",
    "content": [
        {
            "text": "By Samantha Johnson-Roberts, Natural England Wildlife Inspector"
        },
        {
            "text": "Background"
        },
        {
            "text": "There aren't many jobs that combine tackling crime with protecting species like dormice and otters, but here at Natural England there are 46 of us and I'm lucky enough to be one of them. In September 2023 it was great news when the Secretary of State for the Environment, Food and Rural Affairs announced a new list of authorised Wildlife Inspectors, including myself, who are on the front line of nature recovery."
        },
        {
            "text": "Wildlife Inspectors are officers drawn from Natural England, the Animal and Plant Health Agency and Defra who are authorised under Section 18A of the Wildlife and Countryside Act 1981 to use additional legislative powers to investigate wildlife crime and breaches of protected species permits and licences."
        },
        {
            "text": "Whilst Natural England has historically had Wildlife Inspectors, no new appointments had been made since 2008. The latest Secretary of State authorisation provides Natural England with 46 Wildlife Inspectors across multiple teams in the organisation."
        },
        {
            "text": "My work"
        },
        {
            "text": "I have worked for Natural England for the last eight years, beginning my career in protected species licensing before moving into my current role, as a Senior Officer overseeing wildlife licensing enforcement in the Enforcement and Appeals Team, in 2021."
        },
        {
            "text": "Species licensing is a key tool for nature conservation and recovery. Natural England’s species advice and licensing provides the means for justified activities that impact protected species to proceed without compromising nature conservation and recovery goals."
        },
        {
            "text": "Natural England’s licensing services promote sustainable coexistence between people and wildlife, balancing social needs and economic growth with our aspiration to provide a rich and diverse natural environment for future generations."
        },
        {
            "text": "The role of the Enforcement and Appeals Team is to ensure Natural England’s nature conservation and recovery goals by preventing harm and remediating harm to the environment."
        },
        {
            "text": "We have responsibility for enforcing a number of laws that protect wildlife and the natural environment with our main work areas covering Sites of Special Scientific Interest (SSSI), Species Licensing, Animal Poisoning (Wildlife Incident Investigation Scheme), Environmental Impact Assessment (EIA) (Agriculture) Regulations, and Injurious Weeds offences."
        },
        {
            "text": "We work with landowners, licensees’ and the public to provide advice and guidance on how to achieve compliance with the relevant legislation. However, where offences have been committed and the environmental impact is of concern, we will take proportionate enforcement action which could comprise civil sanctions, cautions and prosecutions."
        },
        {
            "text": "In February 2024, I was selected to undergo training to receive authorisation by the Secretary of State Secretary of State for the Environment, Food and Rural Affairs as a Wildlife Inspector. Given the nature of my role, which involves managing investigations into breaches of protected species licences and other wildlife offences for which Natural England is the responsible enforcement body, the powers the authorisation conveys would assist in the gathering of evidence to identify and apprehend offenders."
        },
        {
            "text": "As part of this training, I attended a three-day training course covering the legislation Wildlife Inspectors operate under, powers of entry to premises, criminal investigations, forensic opportunities, communication skills and conflict management. The course included inputs from experienced trainers and practical scenarios, alongside two written exams."
        },
        {
            "text": "In March, having successfully completed the course along with 45 other colleagues, I received formal accreditation by the Secretary of State."
        },
        {
            "text": "Powers"
        },
        {
            "text": "These powers provide the ability for officers to enter premises without landowner’s consent to investigate suspected wildlife offences and breaches of licences issued by Natural England or to compliance check documents provided by licensees in connection with obtaining the grant of a licence, alongside the taking of samples and seizure of evidence. This also provides additional criminal offences of obstructing our officers in the exercise of these regulatory powers."
        },
        {
            "text": "The availability of these powers will support Natural England to achieve our strategic priorities, securing a healthy natural environment for people to enjoy, where wildlife is protected and our traditional landscapes are safeguarded for future generations."
        },
        {
            "text": "Natural England Wildlife Inspectors are authorised under the following statues:• Wildlife and Countryside Act 1981 – In respect of all bird species, plants and other Schedule 5 species, including water voles, adders and slow worms.• The Conservation of Habitats and Species Regulations 2017 – In respect of European protected species including bats, great crested newts, hazel dormice, otters and beavers.• Invasive Alien Species (Enforcement and Permitting) Order 2019 – In respect of invasive non-native species, including grey squirrel and muntjac deer.• Deer Act 1991• Protection of Badgers Act 1992• Destructive Imported Animals Act 1932"
        },
        {
            "text": "The use of these powers is closely governed by a Code of Conduct issued by the Secretary of State, and monitored to ensure they are used proportionately and consistently across the organisation."
        },
        {
            "text": "Natural England is committed to working closely with colleagues in Defra and the Animal and Plant Health Agency to ensure a streamlined approach is taken in the use of all regulatory powers, where possible."
        },
        {
            "text": "Lorraine Huggett, Deputy Director Complex Cases Unit, said:“The excellent training provided to our newly appointed Wildlife Inspectors has not only provided them with increased confidence in using these powers to educate our customers on the importance of compliance, but also allows Natural England to demonstrate our commitment to professionalism, nature recovery and building technical expertise”"
        },
        {
            "text": "Further information regarding Natural England’s enforcement responsibilities can be found on our GOV.UK webpage."
        }
    ]
}