{
    "url": "https://ukhsa.blog.gov.uk/2024/11/18/join-the-fight-against-flu-by-taking-part-in-our-citizen-science-project/",
    "title": "Join the fight against flu by taking part in our citizen science project",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "flu",
        "Winter"
    ],
    "pub_date": "2024-11-18T17:50:55+01:00",
    "content": [
        {
            "text": "Our scientists are tracking flu and other respiratory viruses and they need your help. Join our FluSurvey system and contribute directly to flu surveillance this winter."
        },
        {
            "text": "This UK-wide citizen science programme has now started, but there is still plenty of time to get involved. When you register, you'll be invited to report any respiratory symptoms via the website on a weekly basis. It’s quick and easy to submit the information, and you’ll be playing a part in protecting the health of all of us across the country."
        },
        {
            "text": "At UKHSA, our purpose is to protect the public from threats to health - everything from infectious diseases to nuclear incidents. To achieve this, we monitor health hazards and develop ways of dealing with them, which makes science a huge part of what we do. "
        },
        {
            "text": "As we approach another winter season, we are ramping up our comprehensive surveillance systems to monitor flu and other seasonal respiratory viruses. One of the ways we monitor these viruses this is through FluSurvey – an online platform that allows individuals to report symptoms weekly, providing real-time data on the occurrence of respiratory symptoms in the population. Not all people feeling unwell call 111 or visit their GP or hospital, and these people’s symptoms may not be reflected in other surveillance systems. Community-based systems such as FluSurvey are not limited to people who visit healthcare settings; providing an early understanding of respiratory illness activity in the population. Using weekly symptoms data, we can measure the number of participants who are experiencing symptoms of respiratory illnesses as well as trends over the course of the winter."
        },
        {
            "text": "When added to our existing sources of information, the value of real-time data on respiratory illnesses, provided directly by households countrywide, is immense. It's like having thousands of health detectives scattered across the country, all working together to build a comprehensive picture of flu-like illnesses. By taking part in FluSurvey, you would be contributing a vital piece to a larger puzzle."
        },
        {
            "text": "If you’re interested in taking part, sign up for FluSurvey today."
        }
    ]
}