{
    "url": "https://hmlandregistry.blog.gov.uk/2024/11/18/keeping-a-close-eye-on-your-property-helps-us-prevent-potential-fraud/",
    "title": "Keeping a close eye on your property helps us prevent potential fraud",
    "authors": [
        "Chloe Evans, Deputy Head of Counter Fraud"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2024-11-18T13:04:33+00:00",
    "content": [
        {
            "text": "International Fraud Awareness Week 2024 takes place this week, seeing hundreds of organisations around the world showcasing the support available to help people guard against fraud.  "
        },
        {
            "text": "According to the Crime Survey for England and Wales 2023, fraud accounts for around 40% of all crime in England and Wales, with 1 in 17 adults in England and Wales being victims of fraud. Find out more at the Home Office Stop! Think Fraud! Campaign which covers fraud in the home among its different categories. "
        },
        {
            "text": "Although relatively uncommon, fraudulent attempts on someone’s property are a serious issue, potentially affecting homeowners, sellers, buyers, landlords, tenants, conveyancers, solicitors and others. "
        },
        {
            "text": "They can deprive people of their homes, cost them hundreds of thousands of pounds and seriously impact their lives, often before they discover there is even a problem. "
        },
        {
            "text": "Between 2009 and 2023, HM Land Registry prevented more than £340 million worth of property fraud, while over the past five years we have prevented registered title fraud against property worth more than £123m, through a combination of detection, prevention and education. "
        },
        {
            "text": "Awareness of property and title fraud, and how to guard against them, is vital in supporting not only our own frontline defences but also the wider public and business sectors, and this is an ideal week to think about it."
        },
        {
            "heading": 2,
            "text": "What are property and title fraud?"
        },
        {
            "text": "Property fraud takes various forms, from bogus landlords letting out properties they do not own to a criminal stealing a property owner's identity and using it to make an application to HM Land Registry to register, for example, a forged transfer or mortgage deed. "
        },
        {
            "text": "When false documents are used to transfer property illegally, we call this registered title fraud."
        },
        {
            "heading": 2,
            "text": "Recent case studies"
        },
        {
            "text": "Although property fraudsters are sometimes successful, we can often step in and stop them, as two examples from last year show  "
        },
        {
            "text": "We received an application to transfer ownership of a bungalow at a cost of £360,000 – significantly below the average for the area. The owners had signed up for our free Property Alert service which meant they were notified of this application. They then contacted us and, on visiting the property, discovered the locks had been changed and a For Sale sign put up.  "
        },
        {
            "text": "At the owner’s request, we cancelled the application to transfer ownership.  "
        },
        {
            "text": "Another time, we received an application to register a £200,000 mortgage on a terraced house, but the owner – who didn’t live at the property – said they had not made a mortgage application and did not plan to. We cancelled the application and again prevented a possible fraud.  "
        },
        {
            "text": "It can be that simple."
        },
        {
            "heading": 2,
            "text": "What happens if a property is fraudulently sold?"
        },
        {
            "text": "This type of fraud mainly affects people who do not live in their property, such as second homeowners or landlords.  "
        },
        {
            "text": "If a registered title fraud has been committed, such as when a criminal steals a property owner's identity and uses it to make an application to HM Land Registry to register, for example, a forged transfer or mortgage deed, there is Government-backed support for those who have suffered a loss as a result of the fraud.   "
        },
        {
            "text": "If a registered title fraud has been committed, the Land Registration Act 2002 sets out when a mistake in the register can be put right, and when it cannot.  "
        },
        {
            "text": "This is to ensure people do not lose out financially even if they don’t get their property back. Where it is not possible to simply return someone’s house – because someone else bought it from a fraudster in good faith and has moved in – financial compensation is available for the original owner.  "
        },
        {
            "heading": 2,
            "text": "Sign up to Property Alert for peace of mind"
        },
        {
            "text": "Property Alert is a completely free service to help you protect your property from fraud. Once signed up, you will be alerted to certain types of activity on the register, such as an application for an official search (the first step in any property sale) or a mortgage application, enabling you to respond quickly if you spot anything unusual.  "
        },
        {
            "text": "You do not have to be the property owner to set up an alert and you can monitor up to 10 properties at a time. You might want to keep an eye on a friend or relative’s house, for example, or simply want to know if someone is interested in buying a property.  "
        },
        {
            "text": "It only takes a few minutes to set up an account. Just head to our Property Alert service and enter the required details. There are currently more than 770,000 active property alert accounts across England and Wales, so why not add yourself to the list?  "
        },
        {
            "heading": 2,
            "text": "Apply for a Form LL restriction"
        },
        {
            "text": "A less common approach to safeguarding your property is to enter a form LL restriction in the register. This is designed to help prevent the type of fraud where a fraudster obtains identity documents in the registered property owner’s name, and then uses them to persuade a buyer or lender that they are the true owner of the property.  "
        },
        {
            "text": "To sell or mortgage the property, the would-be fraudster must overcome the stringent terms of the restriction. This can be a deterrent but can also lead to delays if the legitimate owner of the property wants to sell or remortgage their property.  "
        },
        {
            "text": "For more information on the pros and cons of a form LL restriction, read our blog: Protecting your property from fraud: Form LL – the ‘counter-fraud’ restriction – HM Land Registry (blog.gov.uk) or watch our video: Form LL – the 'counter-fraud' restriction. "
        },
        {
            "heading": 2,
            "text": "Property fraud hotline lets you report suspicions quickly and easily"
        },
        {
            "text": "If you think you have been the victim of property fraud, we operate a dedicated property fraud line for you to report any concerns (also offering a Welsh language service). "
        },
        {
            "text": "Just call us on 0300 006 7030 (Monday to Friday, 8am to 5pm).  "
        },
        {
            "text": "You will also find some great pointers here: 5 top tips to keep your property safe.   "
        },
        {
            "text": "So why not sign up to our free Property Alert service during Fraud Awareness Week and help protect your property? There’s no better week to ‘think fraud’ and make sure you don’t become another victim."
        }
    ]
}