{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/02/19/cma-to-review-pricing-set-by-water-regulator/",
    "title": "CMA to review pricing set by water regulator",
    "authors": [
        "Lesley Moore"
    ],
    "categories": [
        "Regulatory appeals"
    ],
    "pub_date": "2025-02-19T12:27:11+00:00",
    "content": [
        {
            "text": "Every 5 years, Ofwat (the water services regulation authority) decides how much money people should pay for water and sewerage services, and the level of service customers should receive. In making price control decisions, Ofwat needs to weigh up various matters. This includes the need to protect consumers’ interests while also ensuring water companies have enough money to deliver and invest in their services."
        },
        {
            "text": "Ofwat’s latest price review was published in December 2024. "
        },
        {
            "heading": 2,
            "text": "Ofwat’s price review and the CMA "
        },
        {
            "text": "Companies that are unhappy with Ofwat’s price review can ask that the Competition and Markets Authority (CMA) reviews and ‘redetermines’ it: our role is to form our own conclusions on the price decisions for the individual companies that appeal, in accordance with the principles that apply to Ofwat, including its various statutory duties and the government’s Strategic Priority Statement."
        },
        {
            "text": "Once the process formally starts (once we receive a ‘reference’ from Ofwat), a panel of decision makers who are independent of the CMA board will be set up to review the price control and make its own decisions. The panel might agree with Ofwat’s decision, or think that the allowed price should be changed. "
        },
        {
            "text": "You can find out more on Ofwat’s website."
        },
        {
            "heading": 2,
            "text": "Why does the CMA get involved with water decisions? "
        },
        {
            "text": "The CMA is required by law to review Ofwat’s price controls when Ofwat refers those price controls to the CMA following requests by water companies that wish to challenge them. "
        },
        {
            "text": "The CMA’s review of Ofwat’s decisions around pricing is unrelated to the Independent Water Commission set up by the government. This commission is reviewing the water sector and how it is regulated, focusing on recommending changes which should take place beyond this price control. "
        },
        {
            "heading": 2,
            "text": "What happens next?  "
        },
        {
            "text": "The next step is for Ofwat to make references to the CMA. Once references are made, the independent inquiry group will be appointed, supported by a team of staff within the CMA.  "
        },
        {
            "text": "The CMA has 6 months from the date of the references to complete the redetermination, but if necessary this can be extended by up to another 6 months if Ofwat agrees to change the deadline it has set.    "
        },
        {
            "heading": 2,
            "text": "Follow this work "
        },
        {
            "text": "We’ll be publishing further information in the coming weeks, including a timetable for the review. This will be published on the CMA website. "
        }
    ]
}