{
    "url": "https://nationalscreening.blog.gov.uk/2025/02/19/experts-discuss-the-challenges-of-using-surrogate-endpoints-in-cancer-screening/",
    "title": "Experts discuss the challenges of using surrogate endpoints in cancer screening",
    "authors": [
        "Prof Bethany Shinkins",
        "Samantha Harrison",
        "Hope Walters"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-02-19T13:16:29+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) only recommends screening if evidence shows the benefits of offering screening outweigh any harms, and there are onward tests and treatments available for those identified through the programme. The goal of any cancer screening programme is to reduce future cancer deaths."
        },
        {
            "text": "Therefore, the UK NSC needs to see evidence for this before making a recommendation. For this reason, reduction in cancer mortality is the outcome, or ‘endpoint’, that is measured in research studies that assess cancer screening."
        },
        {
            "text": "Typically large, well-designed randomised controlled trials (RCT) are needed to prove or disprove the relationship between screening and cancer mortality. These trials can take many years or even decades to collect data on cancer-related deaths, resulting in a long wait for the evidence needed to make a decision about a cancer screening programme."
        },
        {
            "text": "The governments and health systems in the 4 UK countries all have ongoing activity to increase the proportion of cancers diagnosed at an early stage to reduce deaths from cancer. There is also a widespread desire to speed up the adoption of new technologies that promise to help detect conditions earlier, reducing illness and preventing deaths. Achieving these ambitions is likely to rely in part on the ability to generate timely evidence to support implementation of new cancer screening tests and innovations."
        },
        {
            "text": "Academics are therefore considering whether it might be possible to use other measurements or indicators that can be collected at an earlier timepoint and predict the effectiveness of cancer screening. These alternative measurements or indicators of effectiveness are known as ‘surrogate endpoints’. If there are good indicators that the tests and treatments are likely to reduce deaths and could be detected sooner, then the trials would not take so long. These indicators are called surrogates because they would be a good surrogate for the desired outcome (reduction in deaths). It is important to note that, for a small number of cancers, diagnosis at an earlier stage does not currently lead to notable improvements in survival. In these cases the use of a surrogate endpoint may not be appropriate."
        },
        {
            "text": "Researchers have suggested different potential surrogate endpoints to use in cancer screening trials to predict a future reduction in cancer mortality, including:"
        },
        {
            "text": "If the surrogate endpoints are tightly related to the desired endpoints (deaths), then they could reduce the length of time it takes to generate the necessary evidence to make decisions about cancer screening."
        },
        {
            "text": "Experts discussed the potential role and challenges of surrogate endpoints in cancer screening in a webinar hosted by Cancer Research UK and Consilium Scientific. "
        },
        {
            "text": "The event was chaired by UK NSC member Prof Bethany Shinkins, who led discussions with fellow cancer and screening experts Prof Peter Sasieni, Dr Hilary Robbins and Prof Sian Taylor-Phillips. During the course of the webinar, they discussed their different views on the use of surrogate endpoints for earlier cancer detection, the current state of evidence, outstanding questions within the research community on the suitability of these indicators, and the practical next steps required."
        },
        {
            "text": "Surrogate endpoints hold out the hope of accelerating screening adoption, but they must be carefully validated to make sure they lead to meaningful improvements in cancer outcomes. The webinar underlined the need for a collaborative effort to refine the use of surrogate endpoints in cancer screening."
        },
        {
            "text": "Striking the right balance between speed and scientific rigour will be essential in shaping the future of cancer screening and early detection efforts."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}