{
    "url": "https://insidehmcts.blog.gov.uk/2025/02/19/shaping-civil-justice-reflecting-on-successes-and-looking-to-the-future/",
    "title": "Shaping civil justice: reflecting on successes and looking to the future ",
    "authors": [
        "Jason Latham"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Digital services"
    ],
    "pub_date": "2025-02-19T13:00:00+00:00",
    "content": [
        {
            "text": "Justice should be easy for everyone to access. In today’s world, that means providing digital services that make our processes easier and more efficient to use."
        },
        {
            "text": "The national roll-out of our end-to-end digital service has removed unnecessary paperwork and streamlined the process. To make changes work as smoothly as possible, some courts and legal representatives tested new ways of working before wider roll-out. I'm grateful to our staff and to those legal professionals for their valuable feedback, which was important to iron out any final issues."
        },
        {
            "heading": 2,
            "text": "What do these changes mean for court users? "
        },
        {
            "text": "Legal representatives can now progress their clients’ cases entirely online, with real-time progress updates, 24/7 case access, and built-in efficiency tools that minimise delays. This means the need for legal professionals to contact us for case updates is reduced."
        },
        {
            "text": "The service continues to evolve and we are making improvements for those who are not legally represented. In November, we launched a new service which sees 16 County Courts testing the end-to-end service for Litigants in Person. This will allow us to resolve any issues before national roll-out later this year."
        },
        {
            "text": "People representing themselves say it’s easy to submit claims online, saving time and reducing stress. The system’s user-friendly design makes it simple and encourages people to self-serve."
        },
        {
            "heading": 2,
            "text": "Update on Civil Reform plans "
        },
        {
            "text": "The full digital service for money and damages claims marks a significant achievement for our Reform programme, which was launched in 2016. We’ve delivered major improvements during the programme, which is set to end in March 2025."
        },
        {
            "text": "Last year, we reviewed the scope of the Civil Reform Programme. We have made some adjustments to allow us to deliver the rest of civil reform well. The review posed difficult challenges and we have had to remove some of the things we wanted to do from the project. This includes the ability for users issuing bulk claims to use the digital Online Civil Money Claims Service, the journey for damages claims, higher value claims, and multi-party claims involving unrepresented parties, and some of the supporting features like ability to bulk scan forms submitted on paper."
        },
        {
            "heading": 2,
            "text": "What comes next? "
        },
        {
            "text": "We have built solid foundations on which we can continue to modernise more services. Our services are built in an agile way, so we can continue to adapt them in response to users’ needs, policy or legislative changes, and we can continue to improve them in the future."
        },
        {
            "text": "Work is now underway to design and develop a digital service for housing possession claims.  A digital system will reduce errors and manual handling and provide a modern and user-friendly interface so people can progress their cases effectively."
        },
        {
            "text": "Looking further ahead, we will continue to improve money and damages claims services to increase the volume of cases that can be included. We will also ensure they can remain digital throughout the process."
        },
        {
            "heading": 2,
            "text": "The civil courts today"
        },
        {
            "text": "It is important to provide the best digital services for our users, but it is equally important to improve our civil court operations. Outstanding caseloads remain high and waiting times too long for cases going to trial. But we are committed to better performance."
        },
        {
            "text": "Initial delays at the Civil National Business Centre (CNBC) in Northampton have been tackled, with all key stages of a claim now processed within 10 working days. Call waiting times have fallen from 40 minutes to 10 minutes by the end of 2024, and we will continue to improve this."
        },
        {
            "text": "More users are tracking cases online, reducing the need to call. A pilot webchat service for professional users and a new queued call-back system are further cutting wait times. If successful, these will be expanded to all users."
        },
        {
            "text": "We also introduced a big policy change in 2024 which made mediation a key part of resolving small claims under £10,000. This helps more people settle disputes without going to a full hearing. We expanded HMCTS’ Small Claims Mediation Service - hiring more mediators, adding administrative staff and improving the booking system. Most users are given a mediation appointment within four weeks. We have seen a record number of cases referred to mediation and feedback has been overwhelmingly positive, with users welcoming a quicker, lower-cost alternative to court."
        },
        {
            "heading": 2,
            "text": "Working together for a better future"
        },
        {
            "text": "I’m incredibly proud of what we’ve achieved so far, but there is much more to do. We’re committed to improving services and listening to feedback from staff, stakeholders, and the public. It takes time, and it is complex, but the aim is the same: modernise the civil courts so people and businesses can resolve their disputes swiftly, and conveniently."
        },
        {
            "text": "Keep up to date with the latest Civil news and information by subscribing to our e-alerts and newsletters."
        }
    ]
}