{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/10/chemistry-week-2023-gse-member-profile/",
    "title": "Chemistry Week 2023: GSE member profile",
    "authors": [
        "Jodie Worsley"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2023-11-10T13:58:05+00:00",
    "content": [
        {
            "heading": 3,
            "text": "GSE member profile: Jodie Worsley, GO-Science"
        },
        {
            "text": "Taking place from 5 to 11 November, Chemistry Week is a celebration of the chemical sciences. To show the impact of chemistry in government, we caught up with Jodie Worsley, who studied chemistry, and now is a Fast Streamer in the Government Office for Science."
        },
        {
            "heading": 4,
            "text": "Hi Jodie, can you tell me a bit about your current role?"
        },
        {
            "text": "My current role is in Science Systems and Systems Thinking in the Government Office for Science, where I am a Science and Engineering Fast Streamer. I am also a GSE Cross Discipline member."
        },
        {
            "text": "That sounds interesting. Why did you choose to study Chemistry? "
        },
        {
            "text": "I think because chemistry plays a fundamental role in everyone’s life and affects us in every way possible, I was drawn to it. I knew I wanted my career to make a valuable contribution to society, and the world will always need chemists to help improve the way we live. I liked the fact that by going into chemistry, there was such a diverse range of possible career opportunities, so I wasn’t closing any doors (which was important as I had no idea what I wanted to do)."
        },
        {
            "text": "What’s your favourite part of your role?   "
        },
        {
            "text": "My favourite part of the Science and Engineering Fast Stream is being able to try 4 different jobs across 3 years. This is a great way of seeing different career options available to a scientist in government and allows you to develop many skills, some of which I definitely wouldn’t have had the opportunity to develop without the role. "
        },
        {
            "heading": 4,
            "text": "From your chemistry background, what skills and experiences have been the most useful for your career?"
        },
        {
            "text": "Communication is one of the most useful skills I developed while studying chemistry and I use communication the most in my career. My degree developed my problem-solving skills as well as my analytical skills, which have both been extremely valuable in my career so far, particularly when using evidence to inform decision-making across government. Teamwork is also an essential skill for my career, which my chemistry background provided through collaborative laboratory projects I took part in."
        },
        {
            "heading": 4,
            "text": "And finally, what advice would you give to a scientist who wishes to pursue a career in government?  "
        },
        {
            "text": "My biggest piece of advice would be to embrace being out of your comfort zone. This is where both personal and career development is at its highest. Scientists are extremely valued in government, so don’t be afraid of joining!"
        },
        {
            "text": "Thank you for speaking with us Jodie."
        },
        {
            "text": "For more information on Chemistry Week, please visit the Royal Society of Chemistry website."
        }
    ]
}