{
    "url": "https://supportingfamilies.blog.gov.uk/2023/11/10/holistic-intervention-to-support-a-child-with-special-educational-needs-return-to-school-and-engaging-parents-as-part-of-the-process-a-familys-perspective/",
    "title": "Holistic intervention to support a child with special educational needs return to school and engaging parents as part of the process. A family’s perspective",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Early Help",
        "Education",
        "Employment",
        "Evaluation",
        "Financial Frameowrk",
        "Health",
        "Multidisciplinary Teams",
        "Policy links",
        "Transformation"
    ],
    "pub_date": "2023-11-10T09:06:37+00:00",
    "content": [
        {
            "text": "Family Details "
        },
        {
            "text": "Mum and Dad live with their daughter Jayne aged 12 and son John aged 14. "
        },
        {
            "text": "What happened and what support was put in place? "
        },
        {
            "text": "Jayne attends a Secondary school for pupils that caters specifically for children with learning difficulties and disabilities. The school described her as selectively mute. (Experts regard selective mutism as a fear (phobia) of talking to certain people. The cause is not always clear, but it’s known to be associated with anxiety). "
        },
        {
            "text": "Jayne hadn’t attended school for around 6 months. Her parents were supportive but struggling to cope with her aggressive behaviour in the home and when trying to get her into the school transport to attend school.  "
        },
        {
            "text": "The family was referred to the Children and wellbeing services and an Early help assessment was completed. A multi-agency approach was undertaken and, in this case, the right lead professional to support this family was the school.  This is when Jayne met Sam, the Community Senior Family support worker.  "
        },
        {
            "text": "Sam undertook home visits and built trust by adopting a whole family approach to support Jayne and her parents. She attended with the school support worker and games were played to reassess academic ability and build the relationship. John’s views were captured, and he engaged in the Team around the family meetings and shared his experiences. Dad reduced his working hours and worked from home to support Jayne and Mum. Mum was struggling to cope with Jayne's behaviours independently and she put this down in part, to her anxiety. "
        },
        {
            "text": "During one of the home visits, parents shared how a previous meeting with school had caused their daughter inadvertent distress.  After the meeting they came home, and thought Jayne was returning home with them, but instead stayed on at school. This miscommunication had a negative impact on Jayne’s health and anxiety. This was a trigger for Jayne, and she displayed high level of aggression, thus not wanting to get into school transport. Intervention included:   "
        },
        {
            "text": "Team around the family meetings were held in the family home alongside Sam the Community Family worker; school support; health visitors and Child and Adolescent Mental Health Service. These sessions gathered family views before, during and at the end to assess the distance travelled. "
        },
        {
            "text": "By adopting a Flexible individualised approach and building trust and relationships with the school, the parents felt empowered, and Jayne felt her views were considered. John shared his views and support was given to him to channel his thoughts and he was being kept updated of progress and next steps.   "
        },
        {
            "text": "What progress was made/what changed? "
        },
        {
            "text": " A successful outcome using a whole team around the family approach. "
        },
        {
            "text": " Quote from Jayne’s parents.  "
        },
        {
            "text": "\"We have found the EBSA (Emotional based school avoidance) toolkit really supportive especially when supporting Jayne to communicate her feelings about school and leaving our home, which she really struggles with. It met her level of understanding & made support fun.\"  "
        }
    ]
}