{
    "url": "https://aphascience.blog.gov.uk/2023/11/10/new-scientist-live-2023/",
    "title": "Generating new scientists and biosecurity champions!",
    "authors": [
        "Sarah Stewart"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2023-11-10T09:00:15+00:00",
    "content": [
        {
            "text": "At the beginning of October, APHA exhibited at New Scientist Live 2023 for the first time. We were pleased to join nearly one hundred other exhibitors at one of the largest festivals of science in the UK."
        },
        {
            "text": "This was the first time the agency had been to the three-day public show, which draws over 20,000 people from all age groups with an interest in science. It is also the first time APHA has organised an exhibition stand to unite animal and plant health public engagement messages on biosecurity. Over 23,000 people attended the show, and we were pleased to talk to around 1500 on our stand over the weekend, with 700 on the ‘Schools Day’ alone!"
        },
        {
            "heading": 3,
            "text": "Interactive displays"
        },
        {
            "text": "Our stand, built using re-used wooden frames and plinths sourced sustainably for the Chelsea Flower show, comprised five displays to take the visitors on a journey from potential disease threats for animals, plants and bees onto how everyone can help to protect animal and plant health through some simple biosecurity practices."
        },
        {
            "heading": 4,
            "text": "The Invaders"
        },
        {
            "text": "The first display introduced some of the common plant pests, animal pathogens and vectors that can be detrimental to plants, animals and bees. Lucy Carson Taylor, who has been leading the plant health public engagement work for a number of years, provided some great models of a Colorado potato beetle, oak processionary moths, an Asian hornet and Asian longhorn beetle. We did not have many models from the animal health side which meant sourcing some animal pathogen models over the summer! We commissioned a colourful new avian influenza (bird flu) virus model and purchased a range of fluffy bacteria and mosquitoes, which allowed us to discuss how animal and plants can become unwell."
        },
        {
            "text": "We also borrowed a huge E. coli model from the University of Salford following a call for assistance through the Royal Society of Biology outreach group and the Microbiology Society. We were excited when Professor Chloe James offered to loan us two E. coli models that she uses at events to demonstrate how bacteriophages work. Two university students with an interest in public engagement of science from Chloe’s network also volunteered to join us to talk about bacteria and other pathogens and pests. This was a great team effort to share outreach resources and knowledge."
        },
        {
            "heading": 4,
            "text": "Keep it Clean"
        },
        {
            "text": "A Lego farm was a fun way for visitors to drive vehicles along the road between farms, showing how an ultraviolet torch lit up the possible ‘germs’ in the tracks where the tyres had been spiked with a glow in the dark gel. This highlighted the importance for farmers to keep the tyres of vehicles entering or leaving their farm clean."
        },
        {
            "heading": 4,
            "text": "Are you a disease spreader?"
        },
        {
            "text": "Two mannequins were dressed to impress! One wore clothes showing how countryside walkers could spread disease and pests on their clothes and footwear and another wore a disposable boiler suit, helmet and wellington boots showing how scientists protect themselves from disease. A boot disinfecting pad gave the children a fun thing to trample through to reiterate the need to clean your footwear."
        },
        {
            "heading": 4,
            "text": "Don’t Risk It"
        },
        {
            "text": "The ‘Don’t Risk It’ red suitcase and luggage labels highlighted the risks from imports and reminded people travelling abroad not to bring plants and animal food products back into the UK."
        },
        {
            "heading": 4,
            "text": "Stop the Spread"
        },
        {
            "text": "Our newly commissioned landscape model covered a whole range of environmental areas, allowing us to ask questions and point to areas that might be high risk areas for transmission between farms, homes, seashores, plant nurseries and wildlife, bringing home the ‘Stop the Spread’ message."
        },
        {
            "heading": 3,
            "text": "At the show"
        },
        {
            "text": "Our stand was staffed by APHA Science, Technology, Engineering and Mathematics (STEM) ambassadors from animal and plant health. Everyone said how good it was to talk to so many people about our work and ways they could help us to protect animal and plant health, conveying how this can also affect people, food and the environment. The show was quite expensive to attend, but we were pleased to provide free tickets for some disadvantaged students from three schools close to our science headquarters in Surrey."
        },
        {
            "heading": 3,
            "text": "Pledging to be a biosecurity champion"
        },
        {
            "text": "Having looked around the stand, we asked people to pledge to protect animal and plant health in one of 3 ways: 1) wash their boots after a walk; 2) report dead wild birds or 3) not to bring home plant and animal food products from abroad. If anyone pledged 2 or 3, they were given a card with details of helpline numbers or a luggage tag as reminders. The results showed they were willing to consider taking action to help improve biosecurity and the children all walked away with a ‘I am a biosecurity champion’ sticker, which we hope encourages them to remember this in their daily lives. We also hope to have inspired some to consider careers in science and possibly at APHA sites around the country."
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}