{
    "url": "https://sustainableict.blog.gov.uk/2023/11/10/sustainability-alliance-gears-up-to-meet-key-milestones/",
    "title": "Sustainability Alliance gears up to meet key milestones",
    "authors": [
        "aimeesutherland"
    ],
    "categories": [
        "Circular economy",
        "GDSA",
        "Sustainable ICT"
    ],
    "pub_date": "2023-11-10T08:00:33+00:00",
    "content": [
        {
            "text": "Project Manager Aimee Sutherland looks forward to a busy few months as the UK Government Digital Sustainability Alliance prepares to come together to assess recent progress, and to plan for some key milestones on the road ahead."
        },
        {
            "text": "This is an exciting time for the Government Digital Sustainability Alliance (GDSA), as we prepare to come back together next week.. It’s exciting because coming together enables us to present on the outcomes we've been working on and planning for a large event that we’ll be holding in March."
        },
        {
            "text": "GDSA brings Defra, the government policy owner for digital sustainability, together with current and prospective government suppliers, and the supply chain, to drive the meeting of UK Government sustainable information communications technology (ICT) commitments."
        },
        {
            "text": "As a global leader in sustainable ICT, Defra announced the formation of the GDSA at COP27, to ensure government’s digital infrastructure and associated supply chains are rationalised, responsible, resilient, and free of slavery/exploitation, creating environmental, social and economic benefits for all."
        },
        {
            "text": "Since then, we have been working, quietly, in the background to develop a number of pieces of work and products. Although it’s a while since we last met, as a group, during that time, we have been very busy growing as an alliance, making tangible progress towards our sustainability objectives."
        },
        {
            "heading": 2,
            "text": "Collaboration is the aim of the game"
        },
        {
            "text": "We have created three working groups, focusing on Scope 3 emissions, Circular Economy, and Planetary Impact."
        },
        {
            "text": "The working groups have been collaborating, bringing together cross-IT supplier expertise to work on key deliverables and projects/products. These are now taking shape in the form of different products. They include insight papers, aimed at raising awareness of these three topics, white papers (government policy documents that set out proposals for future legislation), along with some further recommendations to government, and informative videos."
        },
        {
            "text": "Next week’s gathering provides an opportunity for GDSA partners to come together to build and strengthen relationships, sharing the working group products in the form of presentations which will then be followed by feedback sessions from across the alliance."
        },
        {
            "text": "I’m hoping the fact we will be together, face to face, will encourage and enable dynamic dialogue where GDSA members can discuss feedback, pose questions, challenge each other, and identify opportunities to provide support on our key deliverables."
        },
        {
            "heading": 2,
            "text": "Thinking about next steps"
        },
        {
            "text": "Sustainable and green ICT is an area Defra has managed across government departments for over a decade. We chair a cross-government group - Sustainable Technology Advice and Reporting (STAR) - which includes 80 members from various government department’s agencies and bodies, academia, professional and tech bodies, and charities."
        },
        {
            "text": "At the end of November, the working groups will be presenting their products to STAR – an exciting opportunity to share ideas and proposals to wider government."
        },
        {
            "text": "When alliance members do come together next week for our workshop we will also begin discussions and planning for the event we’re planning to hold in March aimed at exploring the implications arising from COP 28, which this year will take place from the end of November until mid-December. It’s important to capture the views from all our alliance members, as they aid in shaping future interactions and policies."
        },
        {
            "text": "An exciting footnote to our meeting next week is that have been nominated for an edie Net Zero Award for Decarbonisation Project of the Year. This is a fantastic achievement for the alliance and showcases the positive impact GDSA is having around supply chain decarbonisation. The awards are the same evening, and we are all excited to find out if we’ll be a winner!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}