{
    "url": "https://environmentagency.blog.gov.uk/2023/11/10/the-ground-breaking-environment-agency-project-helping-to-restore-nature-and-reduce-flood-risk-in-teesside/",
    "title": "The ground-breaking Environment Agency project helping to restore nature and reduce flood risk in Teesside",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-10T11:08:41+00:00",
    "content": [
        {
            "text": "Situated in one of the North East’s industrial centres, the River Tees Estuary has been heavily adapted by human hands over the last 200 years. While vital for jobs and the economy, this has led to the loss of 90% of the intertidal habitat that once existed."
        },
        {
            "text": "To redress the balance between nature and industry in a way that adapts to climate change, the Environment Agency (EA) has teamed up with key partners to launch the Tees Tidelands programme."
        },
        {
            "text": "With funding of more than £30million, this pioneering programme aims to realign flood defences, restore mudflat and saltmarsh habitat, and remove tidal barriers so migratory fish can return to rivers where they haven’t been seen for hundreds of years.  This is part of the EA’s work to build a future ensuring better land, air, and water for all."
        },
        {
            "text": "A joined-up approach to climate change"
        },
        {
            "text": "Using nature-based solutions, the project will manage flood risk and the impact of sea level rise in a way that’s sustainable, both for the environment and the economy. The vision for the project is to realign, restore and reconnect intertidal habitats and species. Phil Marshall, Senior Advisor for the Environment Agency in the Northeast, says:"
        },
        {
            "text": "“Tees Tidelands will help to safeguard the future economic prosperity of Teesside in a way that enhances the environment, using nature-based solutions to deliver long-term flood risk management.”"
        },
        {
            "text": "Right up to the 1970s, land in the area that would have been part of the estuary was reclaimed to build industrial sites. Several man-made flood defences built to protect those complexes are now old, in poor condition and difficult to maintain."
        },
        {
            "text": "Historical construction used waste material, including slag boulders, from the local iron and steel industry. These defences aren’t considered to be fit for the purpose of managing long term flood risk given their current state of repair and predicted sea level rise with climate change."
        },
        {
            "text": "In total, Tees Tidelands aims to create over 50 hectares of mudflats, saltmarsh and other valuable estuarine habitats, as well as reducing flood risk for homes and businesses."
        },
        {
            "text": "Restoring natural cycles "
        },
        {
            "text": "Phil points out that opening the tributaries of the River Tees to tidal influence and allowing the estuary to realign with its natural tidal cycle will create the correct conditions for wildlife to thrive. It will also reconnect the communities of Teesside with their estuary, a relationship gradually lost over the last 200 years."
        },
        {
            "text": "The project is working alongside key partners, such as Tees Rivers Trust’s, who work to grow and reintroduce seagrass and oysters into coastal and estuary habitats, and the Canal & River Trust which is working to enhance fish passage at the Tees Barrage."
        },
        {
            "text": "Vicky Ward, the Tees Estuary Recovering Nature Project Manager at Natural England, one of the partner organisations of the project, agrees, saying that the habitat restoration work taking place throughout the programme will strengthen nature’s recovery across the estuary."
        },
        {
            "text": "Looking Forward"
        },
        {
            "text": "The partner organisations say they’re hoping to work with Natural England’s ‘Tees Estuary Recovering Nature’ (T.E.R.N.) national nature recovery project – as well as wider partners - to build on the current work and develop a bigger, better, more joined up nature recovery programme at the landscape and seascape scale."
        },
        {
            "text": "The habitats and species remaining in the estuary - such as wading birds – are now internationally recognised and protected by the highest level of conservation designations. Looking forward the Tees Estuary has the potential to become a super national nature reserve recognised as an ecological jewel and safeguarded now and into the future."
        },
        {
            "text": "“The official launch of the project is a big moment, and we are grateful for the collective support of our partners as we work to bring the vision of Tees Tidelands to life and deliver these long-term benefits for people and nature,” Phil says."
        },
        {
            "text": "Further details about the project are available here: Tees programme launched to reduce flood risk and boost nature - GOV.UK (www.gov.uk). To keep up with the latest EA news, follow us on X."
        }
    ]
}