{
    "url": "https://aphascience.blog.gov.uk/2022/09/08/asian-hornet-week-2022/",
    "title": "22 confirmed Asian hornet sightings in Great Britain since 2016 … and counting",
    "authors": [
        "Rebekah Clarkson"
    ],
    "categories": [
        "Bee health",
        "Invasive Species"
    ],
    "pub_date": "2022-09-08T09:00:02+01:00",
    "content": [
        {
            "text": "This week, 5-11 September 2022, is the British Beekeepers’ Association’s Asian Hornet Week. The aim is to raise awareness about the yellow-legged Asian hornet (Vespa velutina) in the United Kingdom (UK) and show how to report sightings. Asian hornet is an invasive non-native species in the UK and is a highly effective predator of other insects, including honey bees, so could pose a serious threat to UK pollinators if it were to become established here."
        },
        {
            "text": "The species which is native to parts of Asia was accidentally introduced to France in 2004 and has spread rapidly into other European countries."
        },
        {
            "heading": 3,
            "text": "Breaking News"
        },
        {
            "text": "As this goes to print, APHA’s Pete Davies and the Eastern England bee inspector team are monitoring an Asian hornet sighting near Chelmsford. As Asian hornets can “hitchhike” e.g., on imported goods, or moved in vehicles, they can arrive anywhere as well as being “blown-in” from continental Europe, so please look out for hornets in your area and report your suspected sightings as described at the bottom of this blog."
        },
        {
            "text": "To date, there have been 22 confirmed sightings of Asian hornet in Great Britain since 2016. Twelve of these sightings have been associated with nests, all of which were destroyed. Most findings have been along England’s south coast."
        },
        {
            "text": "For the first time since the pandemic, the National Bee Unit (NBU) have sent inspectors to Jersey. The training ensures more inspectors gain live Asian hornet experience, including engaging in track and trace activities. Before inspectors were issued with a licence and badge, granting them authority to catch, mark and release Asian hornets whilst on the island, they undertook a short course and trained with the Jersey authorities. Without a licence it is unlawful to release these non-native insects once caught."
        },
        {
            "text": "Peter Folge, from APHA’s National Bee Inspectorate, were the first pair to receive training and over five hot days they saw many Asian hornets."
        },
        {
            "text": "All the inspectors who visited Jersey for training felt it was extremely worthwhile, equipping them with invaluable skills for when for the next sighting that could occur anywhere at anytime!"
        },
        {
            "heading": 3,
            "text": "Identifying an Asian hornet"
        },
        {
            "text": "When observed carefully, the Asian hornet has the following distinct identifying features:"
        },
        {
            "text": "You can download a free identification sheet or order a free hard copy from: nnss@apha.gov.uk."
        },
        {
            "heading": 3,
            "text": "How can you help?"
        },
        {
            "text": "This year, Jersey has recorded over 100 Asian hornet nests, its highest ever number. Although the UK has received thousands of sightings this year, most of the images sent clearly identify native species such as wasps, bees, and our native European hornet."
        },
        {
            "text": "You can help by taking some time this week or later in the month to watch pollinators in your area. You can watch insects feed on late flowering plants such as Ivy, fallen fruit, or make a simple monitoring station; for more ideas see this leaflet."
        },
        {
            "text": "Report insects you suspect to be Asian hornet using the free Asian Hornet Watch app for iPhone or Android or the online reporting form."
        },
        {
            "text": "You can get to know what similar insects look like by scrolling through images on the Asian Hornet Watch app or see this article on commonly misidentified insects."
        },
        {
            "heading": 3,
            "text": "Further reading"
        },
        {
            "text": "If you liked this blog, you may wish to read some of our previous Asian hornet blogs:"
        }
    ]
}