{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/09/08/back-to-school/",
    "title": "Back to school: pupil designer wins award",
    "authors": [
        "Lily Macaskill",
        "Laura Gray"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2022-09-08T12:00:16+01:00",
    "content": [
        {
            "text": "Lily Macaskill, Year 12 pupil at Alexandra Park School, in conversation with her teacher Laura Gray, on winning a national prize for design."
        },
        {
            "text": "Miss Gray: “Congratulations on winning the RSA’s Pupil Design Award Lily, would you be able to tell me a bit about your winning design?”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “Yes of course, my design is a pop-up book for children designed to educate them on food waste and the importance of growing their own food. It teaches them how to grow their own food and the book has seeds in the pages, a soil packet at the back, and a foldable pot so they can actually start growing their own produce at home.”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Miss Gray: “How do you feel your book went about tackling the issue of food waste?”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “When you educate children from a young age, it can put issues of climate change and food waste into perspective for them by starting a habit and a routine that shows the importance of the issue. It’s possible to grow a passion in children that gets them excited about making a change and doing something better overall, creating a wider positive impact on the food waste issue."
        },
        {
            "text": " "
        },
        {
            "text": "Miss Gray: “I love it. I think accessibility and sustainability really were what made your idea stand out. Could you talk about your thoughts behind that?”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “Yeah, I didn’t want the product to be priced highly, if it was priced at all. I don’t want it to be sold commercially in bookstores, I would prefer it to be given out in schools - whether it was government or charity distributed - like the M&S Little Garden where they give out seeds and soil to people for free. To me it was essential to give everyone the option to grow their own produce by ensuring it wasn’t a hindrance to buy or difficult to receive.”"
        },
        {
            "text": " "
        },
        {
            "text": "Miss Gray: “Especially in cities like London, not everyone has access to that garden space, but you came up with a way to tackle that.”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “Yeah, a lot of people live in flats or apartments which could increase the difficulty of using the product. In the back of the book, I added a soil packet and a decomposable foldable pot so that people can start it in their homes. It can be put in their kitchen and can be grown inside. Users don’t need an allotment and they don’t need to find more space. It is something that is minimal effort, minimal space, but it still makes a big difference”"
        },
        {
            "text": "Did other students come up to you with different solutions to the design briefs we were given?”"
        },
        {
            "text": "Miss Gray: “It was really interesting to see the variety of responses. There were 3 briefs, you chose the ‘food for thought’ brief, but there was also ‘learning to belong’ and ‘green streets’. It was great to see how students looked at and identified the problems of groups that may feel marginalised in school, and how - like in your project – they built sustainability and accessibility into their proposals”"
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “Is there a way you could help more kids develop their ideas in the future?”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Miss Gray: “When we visited the RSA, we talked about how to make ideas a reality. I think that’s a very interesting starting point for school projects, it is inspiring to see where these designs could go in the future.”"
        },
        {
            "text": "Have you had any thoughts about how you might develop your idea?”"
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “I know I would have to get in touch with charity organisations that would be open to developing my idea as I believe one of the biggest issues for people our age is funding. We don’t have the jobs, or the money already set up to enable us to continue our designs."
        },
        {
            "text": "What do you think schools could do to produce more student designers?”"
        },
        {
            "text": " "
        },
        {
            "text": "Miss Gray: “We have been looking at the future of Design Technology and product design. We have a generation coming up in Year 6 that have done a lot of STEM and are starting to learn programming and coding. This is something we should look at developing to keep it relevant - particularly in the KS3 curriculum. Things are constantly changing and design needs to evolve alongside that change. Our subject is diversifying very quickly. We need to make sure that we are up to date for the new generation coming through”"
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “Do you think the design tools you have taught your students will be useful outside of their classes?”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Miss Gray: “Of course. For a starter they learn about empathy and how to understand other people. They are leaving school with a critical eye and thinking about what they can change in the outside world - so their innovation isn’t just limited to tasks set in class. It’s giving young people a chance to engage in big problems that we need to find solutions to."
        },
        {
            "text": "What are your plans? Will you continue to design in the future?”"
        },
        {
            "text": " "
        },
        {
            "text": "Lily: “ I want to design throughout my life. I’m not entirely sure on the specific area I would want to go into, but I think design is something that should be constantly done. The smallest change in a design, in a routine or in someone’s life, can make a vast impact. That is why social design is so imperative for today’s society, where the more convenient option often has the worse effect. Designers are needed now, and in the future, to make changes that allow people to make the better choice with ease. Improvements are always needed, there is always a further step to take that can change the way we live for the better.”"
        }
    ]
}