{
    "url": "https://ruralpayments.blog.gov.uk/2022/09/08/introducing-you-to-11/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2022-09-08T15:43:11+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Hi, I’m Taran, and I’m an intern with the RPA, based in Bristol. I’m here as part of the Summer Diversity Internship Programme, (SDIP) which is an eight-week internship with the Civil Service, designed to get university students from diverse and low socio-economic backgrounds into Government. It’s usually taken during the summer after the penultimate year of university."
        },
        {
            "text": "While I’m here, I’m interning with the Organisational Capability Team, which focuses on getting great people into RPA, developing them in the role, and looking for areas to progress employees further, within or outside RPA."
        },
        {
            "text": "I’ve been helping the team with a few of their ongoing projects, whilst also taking on my own task of developing a school-aged work experience scheme aimed at 16-18 year olds for the RPA, particularly focusing on social mobility and under-served regions of the UK."
        },
        {
            "text": "I’m really enjoying seeing the roles of different teams within the RPA and how they work together to deliver an effective experience for farmers - it wasn’t something I knew too much about before I joined, so learning about the industry has been really interesting."
        },
        {
            "text": "Because I’m here for such a short time and I wanted to see as much of the organisation as possible, I don’t really have a typical day. The benefit of this is that I like coming to work with something new to look at every day. This might include shadowing another team in RPA, helping my team with any ad hoc tasks they may have, or working on my school outreach project."
        },
        {
            "text": "While I’ve been here, I’ve really enjoyed contributing to the team and seeing the development of a project - the RPA is a very collaborative organisation and I do like how everyone’s ideas are heard and considered."
        },
        {
            "text": "While I’ve really enjoyed contributing to the team, I also like having my own project to work on and drive forward, particularly as its in an area that’s important to me. As I mentioned, the SDIP programme I’m on is focussed on getting university students from diverse and low socioeconomic backgrounds into Government, and I see my project as another facet of that, showing a new generation of young people the opportunities available to them in the Civil Service and the importance of the work of RPA."
        },
        {
            "text": "When my internship ends this month, I will start my final year of my economics and politics course at Bristol University. I haven’t really got a fixed idea of what I want to do after I graduate, but going for a permanent role in the Civil Service would probably be one of my preferred options – recruitment controls permitting. I definitely want to return one day!"
        },
        {
            "text": "I’m originally from Bedfordshire, and outside of work I’m a big football guy, so I like going to games or watching at the pub with friends. I’m also really into my music, so I try to go to gigs when I can."
        }
    ]
}