{
    "url": "https://digitaltrade.blog.gov.uk/2024/12/18/belfasts-growing-digital-community-a-collaborative-and-innovative-environment/",
    "title": "Belfast's growing digital community: A collaborative and innovative environment",
    "authors": [
        "Hannah Henderson, Senior Engagement Manager",
        "Tracey Wilson, Deputy Service Owner",
        "Emma Kiely, Content Designer",
        "Emily Agnew, Assurance Manager",
        "Rachael Irwin, Data Analyst"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2024-12-18T10:42:22+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Hannah Henderson"
        },
        {
            "heading": 3,
            "text": "Tracey Wilson"
        },
        {
            "text": "The Northern Ireland digital sector has experienced remarkable growth in recent years, making it an exciting and relevant hub for Digital, Data and Technology (DDaT) professionals. Here at the Department for Business and Trade (DBT), DDaT teams drive digital transformation and innovation. We ensure that the department can use digital solutions to achieve its mission and provide world-leading support to businesses."
        },
        {
            "text": "DBT is a UK government department focused on economic growth. It supports businesses to invest, grow and export, creating jobs and opportunities. As part of this mission and its commitment to Places for Growth, the Civil Service programmes to base roles outside London, DBT has established a strong presence in Belfast. We have doubled the numbers of staff based in the city within the last year. The Belfast hub is a growing center of expertise, particularly in DDaT. We work in diverse, multi-disciplinary teams. Almost 40% of DDaT staff are based outside of London, meaning teams work together from all over the UK."
        },
        {
            "heading": 3,
            "text": "What makes DDaT in Belfast stand out?"
        },
        {
            "text": "•  Data Analysis"
        },
        {
            "text": "•  Content Design"
        },
        {
            "text": "•  Project Delivery"
        },
        {
            "text": "•  Data Science"
        },
        {
            "text": "•  Software Development"
        },
        {
            "text": "•  Service Ownership"
        },
        {
            "text": "•  Communications and Marketing"
        },
        {
            "heading": 3,
            "text": "Hear from some our Belfast based colleagues"
        },
        {
            "heading": 4,
            "text": "Emma Kiely"
        },
        {
            "text": "I joined DBT this year after working as a content designer in the voluntary sector."
        },
        {
            "text": "Content designers work with other user-centred colleagues to design content that meets the needs of our users. For DBT, that means helping businesses across the UK and around the world to get things done."
        },
        {
            "text": "For many content designers, working on GOV.UK content is a formative experience with great opportunities for career progression. However, until recently, very few roles were open to those of us living in Northern Ireland."
        },
        {
            "text": "Since joining DBT, I have seen how my work impacts people and businesses across the UK.  For example, most recently my team helped to design content for the Horizon Convictions Redress Scheme for wrongly convicted postmasters."
        },
        {
            "text": "DBT colleagues in Belfast are supportive and welcoming. It is a great environment to learn from each other."
        },
        {
            "heading": 4,
            "text": "Emily Agnew"
        },
        {
            "text": "I joined DBT DDaT this year as an Assurance Manager after working in the Northern Ireland Civil Service. While exploring UK government job opportunities in Northern Ireland, I was pleasantly surprised to discover that I could enter the highly sought-after digital sector without needing a typical 'techy' background."
        },
        {
            "text": "The opportunities for learning and development here are endless. I have taken courses on agile project delivery, risk management, and innovation. These have helped me to gain essential experience that has opened doors to careers I had never considered before. I have also had the opportunity to work on several exciting projects which impact people in the UK, and internationally."
        },
        {
            "text": "Working in a hub, especially in Belfast, has been an incredible experience. Meeting like-minded individuals across various teams and professions has been invaluable. You form close bonds with colleagues who you wouldn’t ordinarily have worked with, creating an inviting and engaging atmosphere. It is so important to enjoy where you work, and it is hard not to enjoy DBT Belfast."
        },
        {
            "heading": 4,
            "text": "Rachael Irwin"
        },
        {
            "text": "I applied for a Data Analyst role in DBT after reading a digital trade blog on the annual Data Challenge. It highlighted the collaborative nature of the department, and the extensive learning and development opportunities available to everyone.  "
        },
        {
            "text": "As a Data Analyst, I have the opportunity to work with a wide range of stakeholders and multi-disciplinary teams across the whole department. I enable them to create reports, visualisations and dashboards with their data. Although some of us are based in a different office to the rest of our team, we stay well connected. There are frequent opportunities to travel to other offices to meet up."
        },
        {
            "text": "If you are thinking about a role in DBT, I cannot recommend it enough!"
        },
        {
            "heading": 3,
            "text": "Why Belfast?"
        },
        {
            "text": "Belfast offers a dynamic mix of professional opportunity and quality of life. Recognised as one of the top 10 friendliest cities in the UK, it is known for its welcoming atmosphere and strong sense of community. The city has also built a reputation as a growing hub for technology, attracting businesses and talent in the digital and data sectors."
        },
        {
            "text": "For those joining DBT, Belfast offers the chance to be part of a close-knit, innovative Civil Service hub while benefiting from the wider opportunities the city provides. The cost of living is more affordable than many UK cities, and its size makes it easy to build connections across professional and social networks."
        },
        {
            "text": "Outside of work, Northern Ireland’s stunning natural beauty is always within reach. From the Mourne Mountains to the North Coast, you will find plenty of opportunities to unwind and explore. Belfast itself is home to a thriving cultural scene, with theatres, live music, and a growing food scene—all within easy reach. At this time of year, there is the added bonus of our famous Christmas Market!"
        },
        {
            "heading": 3,
            "text": "The Belfast hub: modern facilities in a thriving city"
        },
        {
            "text": "The recently built Erskine House is designed to support flexible working. It offers:"
        },
        {
            "text": "Located in the city centre, the office is easily accessible by public transport and surrounded by restaurants, shops, and key attractions. Its location reflects DBT’s commitment to providing modern, convenient workplaces that enable teams to thrive."
        },
        {
            "heading": 3,
            "text": "Community and culture"
        },
        {
            "text": "At DBT Belfast, we embrace the idea that ‘culture is everyone’s business’. The Belfast Hub Committee works with staff to ensure the hub is a welcoming and supportive place to work. Regular team lunches, all-staff meetings, and opportunities to connect through social events are just some of the ways we foster a sense of community."
        },
        {
            "text": "The hub also benefits from a balance of local focus and national connection. Staff in Belfast often have opportunities to travel to meet with colleagues across the UK, and contribute to projects beyond Northern Ireland. We are planning a team volunteering day soon, taking advantage of the 3 days of paid volunteering leave DBT provides."
        },
        {
            "heading": 3,
            "text": "Ready to join us?"
        },
        {
            "text": "If you’re considering a career in Digital, Data, and Technology, Belfast offers a unique combination of professional growth, collaborative work, and a vibrant lifestyle. Explore current opportunities and discover how you can make a difference as part of our growing Belfast hub."
        }
    ]
}