{
    "url": "https://defradigital.blog.gov.uk/2024/12/18/designing-a-style-guide-for-defra-content-designers/",
    "title": "Designing a style guide for Defra content designers",
    "authors": [
        "Louisa Mallon"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2024-12-18T12:11:28+00:00",
    "content": [
        {
            "text": "Continuing our series on the Defra content community projects, senior content designer Louisa Mallon describes how her team planned and created a Defra style guide."
        },
        {
            "text": "Last week Graeme Claridge, Head of Content at Defra, wrote a blog post about content community projects. One of these projects – and the one that I volunteered to lead – was to create a Defra-specific style guide and define a process for keeping it up to date."
        },
        {
            "heading": 2,
            "text": "Why style matters"
        },
        {
            "text": "An important part of a content designer’s job is to make sure the language in the content we create is clear, consistent and current. The government design principle ‘Be consistent, not uniform’ outlines the importance of this."
        },
        {
            "text": "You’ll find most government content designers have the GOV.UK style guide bookmarked because we spend a lot of time in there! The guide outlines style, spelling and grammar conventions for all content published on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Identifying the problem"
        },
        {
            "text": "But what happens when we need consistency and agreement on Defra-specific terms, language or conventions? There’s no guidance on farming, flood and food terms in the GOV.UK style guide, so we risk using these inconsistently across the content we create."
        },
        {
            "text": "We have a style council at Defra, where content designers discuss terms not covered in the GOV.UK style guide and agree a consistent approach. But we did not have a way of sharing the terms as decisions were made, and not everyone in the team was even aware the style council existed. So, the style guide content project was born."
        },
        {
            "text": "But who would our style guide be for? Would it only be for people in the Defra content community? Would our policy colleagues find it useful? Should we make it publicly available, like the content folk did with the Home Office style guide and the NHS England style guide?"
        },
        {
            "text": "We decided to focus on creating a minimum viable product (MVP) for the Defra content community. This would give us something tangible, which we could share with others in Defra later on to gauge their interest."
        },
        {
            "heading": 2,
            "text": "Learning from others"
        },
        {
            "text": "We spoke to content designers across government who had been through the same process as us to get an insight into their style guides and related processes."
        },
        {
            "text": "We also asked content designers in Defra to share any ‘informal’ style guides they had created, even if these were just a few terms agreed between them and a subject matter expert (SME)."
        },
        {
            "text": "Some Defra content designers in our flood team had done just this, and with their help we created a template for our guide. We added some entries from recent style council meetings and arranged user research sessions to ‘show the thing’ to our users: other Defra content designers."
        },
        {
            "text": "We used the time with our users to check our assumptions of what our style guide should do and include. The overwhelming feedback was our guide should:"
        },
        {
            "text": "We got mixed feedback on whether:"
        },
        {
            "text": "Armed with these insights, our project team took the first draft of the guide away to make some improvements and decisions."
        },
        {
            "heading": 2,
            "text": "Working with the style council"
        },
        {
            "text": "We’ve worked closely with a content designer from the style council throughout this project. This is to make sure there’s a smooth user journey, from someone submitting a term for consideration by the style council, through to it potentially appearing in the style guide."
        },
        {
            "text": "For example, we’ve designed a triage process together to help the style council decide which submissions to prioritise at their meetings. This process will help to identify:"
        },
        {
            "text": "We also looked at how we can keep the style guide concise and easy to use. We wanted to balance the needs of those who favour simplicity with those who prefer more detail, such as the rationale behind decisions."
        },
        {
            "text": "We created a Microsoft Planner board that integrates with the submission form, and which we’ll link to from the style guide. Those who want to see discussions about a term, or evidence, can find it one click away from the style guide."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "So, we have an MVP. Brilliant! We look forward to using it, testing it and thinking about whether we roll it out further in Defra."
        },
        {
            "text": "But we can’t celebrate just yet. Hopefully something you’ve taken from this blog post is that the style guide and the style council must go hand in hand."
        },
        {
            "text": "As a content community, we’ve just launched the next round of community projects, and I’m delighted one of them will focus on revamping the style council and getting more of our content community involved."
        },
        {
            "text": "I’ve volunteered to represent the style guide project in this new project, so we have continuity. Keep your eyes open for a blog post about that project in the coming months."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}