{
    "url": "https://hmlandregistry.blog.gov.uk/2024/12/18/explaining-easements-making-the-correct-applications/",
    "title": "Explaining easements – making the correct applications",
    "authors": [
        "Andrew Smedley, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-12-18T16:29:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Easements"
        },
        {
            "text": "Easements concern the rights enjoyed by one landowner over land owned by another. As such, they are a very important legal interest."
        },
        {
            "text": "Land purchased for a large sum may be worth much less than the price paid if it does not have the benefit of a crucial easement, such as a right of way. When things go wrong, the problem may be relatively simple to resolve, or it can be both complex and extremely expensive."
        },
        {
            "text": "For the avoidance of doubt, an easement may of course meet all the required characteristics/essential elements but will still not operate at law in relation to a registrable disposition if the registration requirements are not met."
        },
        {
            "text": "As an easement constitutes a disposition, under the Land Registration Act 2002 (LRA 2002) it must be registered to operate at law."
        },
        {
            "text": "In registering the grant or reservation of an easement, we enter a notice in the register of the land that has the burden of the easement (servient land) and, if the land that has the benefit of the easement (dominant land) is also registered, we enter the benefit in the register for the dominant land."
        },
        {
            "text": "We will look at the registration requirements for easements (which are set out in paragraph 7 of Schedule 2 to the LRA 2002: \"To operate at law the express grant or reservation of an easement for an interest equivalent to an estate in fee simple absolute in possession or a term of years absolute over registered land is required to be completed by registration\" (s.27(2)(d) LRA 2002)) in more detail in a future blog, along with some of the common issues that arise."
        },
        {
            "heading": 2,
            "text": "Making the right application"
        },
        {
            "text": "For now, we will assume that the easements in a deed meet all the required characteristics/essential elements."
        },
        {
            "text": "To meet the registration requirements, an application to register the grant or reservation of a legal easement must be made in form AP1, unless the easement has been created for the benefit of an unregistered legal estate, in which case form AN1 can be used."
        },
        {
            "text": "You must enter the title numbers of all the registered titles involved (servient and dominant) in panel 2 of the form AP1. We often receive applications that have not specified all the title numbers affected by the easement, which can cause significant problems down the line."
        },
        {
            "text": "For example, an application is made to transfer registered land. The Form AP1 only quotes the transferor’s title number, but the transfer grants easements that affect other titles belonging to the grantor."
        },
        {
            "text": "No application has been made against each affected title, so we will have to limit any entry of the easements in the transferee’s title. The entry will specify that the benefit of the easement over the land in those additional title numbers is not included in the registrat­­ion. We will not enter a notice in the register(s) for any of the additional servient titles."
        },
        {
            "text": "Several years later, the land in one of the additional titles is transferred for value. When the transfer is registered, the purchaser may take the land free of the easement granted over it, which had not been noted in the register. Should this happen, any resulting problem could be very difficult, and expensive, to resolve."
        },
        {
            "text": "The situation is slightly different where leases of registered land are concerned. When registering a prescribed clauses lease, we will only make an appropriate entry for easements granted that are referred to in clause LR11. Additionally, LR2.2 must specify the landlord’s title number and any other title numbers over which the easements in LR11 are granted. If LR2.2 is properly completed, there is no need to make a further application."
        },
        {
            "text": "Whether your application involves a transfer or lease, it is essential that you apply against every additional title affected by the easement. If an application has not been made against the additional title(s) and if everything else is in order, we may simply complete the application(s) as specified, which will include only registering the easement against the servient title that has been stated."
        },
        {
            "text": "Similarly, if the transfer or lease grants (or reserves) easements for the benefit of an additional title, again an application must be made against the relevant titles to register the benefit."
        },
        {
            "text": "Easements are likely to remain a complex area of land law but ensuring you make the correct applications should ensure you avoid many of the most serious difficulties that can arise."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "Our practice guide 62: easements provides more information on this subject."
        },
        {
            "text": "The forms referred to above are for applications in paper form, digital applications can be lodged via usual channels. For further details on making applications though the portal, ­­see HM Land Registry portal: login and guides."
        },
        {
            "heading": 2,
            "text": "Special requests"
        },
        {
            "text": "If there’s a land registration topic you’d like us to look at, please do get in touch. Email your suggestions to the Customer Communications Team: CustomerCommunicationsTeam@landregistry.gov.uk."
        },
        {
            "text": "Please note, the Communications team cannot answer any queries about live casework."
        }
    ]
}