{
    "url": "https://defrafarming.blog.gov.uk/2024/12/18/fipl-spotlight-meadow-match-cornwalls-wildflower-seed-dating-service/",
    "title": "FiPL Spotlight: Meadow Match, Cornwall's wildflower seed dating service ",
    "authors": [
        "Seán O’Hea"
    ],
    "categories": [
        "Guest post",
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2024-12-18T10:25:58+00:00",
    "content": [
        {
            "text": "In this guest post, Seán O’Hea shines a light on Cornwall National Landscape's Farming in Protected Landscape project."
        },
        {
            "text": "Cornwall National Landscape is a mosaic of 12 distinctive areas."
        },
        {
            "text": "Miles of Cornish hedges—unique boundary structures—frame a landscape dotted with tin mines and engine houses, which were once used to pump seawater out of mine shafts. Over time, mining sites and waste have transformed into wetlands, grasslands, and heathlands."
        },
        {
            "text": "As the saying goes, ‘If it's not grown, it’s mined.’  In Cornwall, both farming and mining have shaped the landscape we see today."
        },
        {
            "text": "Designated in 1959, this protected landscape covers approximately a third of Cornwall and includes 12 separate geographical sections: 10 coastal, one estuarine, and one moorland."
        },
        {
            "text": "Around 75% of the protected area is farmland, mainly used for dairy and beef livestock."
        },
        {
            "text": "While much of the coast is Grade 4 agricultural land (poor quality), the southern and western sections feature areas of Grade 2 (very good quality) and Grade 3 (good to moderate quality) land. Read more about Agricultural Land Classifications on GOV.UK."
        },
        {
            "text": "Bodmin Moor has large commons grazed by cattle, sheep, and ponies, while the south coast supports enclosed pastures and arable farming of maize, brassicas, wheat, barley, potatoes, and daffodils."
        },
        {
            "text": "Cornwall’s maritime climate, with frequent salt-laden winds and high rainfall, contrasts with its relatively high sunshine hours and mild temperatures, which enable early crops under favourable conditions."
        },
        {
            "text": "However, recent unpredictable weather highlights the importance of healthy soils. Many farmers are turning to diverse herbal leys to build resilience against flooding and drought."
        },
        {
            "text": "In areas of steep valleys and low-grade agricultural land, reduced farming activity has created opportunities for native wildflower meadow creation. Schemes like Countryside Stewardship and the Sustainable Farming Incentive (SFI) offer valuable support."
        },
        {
            "text": "However, many local farmers struggle to find suitable seed mixes that match their soil types and contain resilient native species."
        },
        {
            "heading": 3,
            "text": "Swiping right on wildflowers"
        },
        {
            "text": "Dr Grace Twiston-Davies from the Wildflower Collective approached the Cornwall FiPL team in January 2023 with a bold idea: Meadow Match, a “dating agency” for wildflower meadows."
        },
        {
            "text": "Grace and her team connect wildflower-rich donor sites with receptor sites that have similar soil conditions but poor species diversity."
        },
        {
            "text": "To make Meadow Match a reality, Grace teamed up with Dave Oates from Rosuick Organic Farm and James Ruddick from the Cornwall Council Nature Recovery Team to apply for FiPL funding for “Meadow Hubs.”"
        },
        {
            "text": "With support from the FiPL team, the application was designed to align with multiple FiPL themes and was approved by the Local Assessment Panel in May 2023."
        },
        {
            "text": "Panellists recognised the project’s potential to help local farmers restore grasslands, benefitting both nature and farming businesses."
        },
        {
            "text": "A diverse meadow sward is more resilient to extreme weather and offers nutritional and medicinal benefits to livestock."
        },
        {
            "text": "Using local seed is the gold standard for meadow restoration, as it includes species adapted to the landscape, soil, and climate. However, commercial seed mixes often lack key Cornish species, are costly (over £100 per kg), and aren’t always locally sourced. Meadow Match offers a cost-effective alternative."
        },
        {
            "heading": 3,
            "text": "Phase 1"
        },
        {
            "text": "The first round of FiPL funding supported wildlife surveys of donor and receptor sites, with data added to a Meadow Match database."
        },
        {
            "text": "The Wildflower Collective trained volunteers in meadow creation and surveying, and local wildflower seed was harvested and sown at receptor sites across the protected landscape."
        },
        {
            "text": "Three Meadow Hubs were established:"
        },
        {
            "heading": 3,
            "text": "Phase 2"
        },
        {
            "text": "In the second phase, a Seed Hub was built at Rosuick Farm to clean, dry, and sort seeds into bespoke mixes."
        },
        {
            "text": "Specialised equipment was purchased to process local seed mixes, and a trailer now transports equipment to other Meadow Hub locations."
        },
        {
            "heading": 2,
            "text": "Outcomes "
        },
        {
            "text": "We’re pleased to share that: "
        },
        {
            "text": "Volunteer training sessions and the seed dating event engaged over 30 landowners and 50 volunteers across the National Landscape. "
        },
        {
            "heading": 2,
            "text": "Reflections"
        },
        {
            "text": "Dr Grace Twiston-Davies said:“Using the Meadow Match service helps Cornish farmers care for their wildflower meadows, creates new income streams, and restores nature. It’s a cost-effective way to source seed, while also supporting volunteer groups and running community events."
        },
        {
            "text": "“We now have a purpose-built Seed Hub, enabling farmers to access equipment, facilities, and training to enhance their knowledge and skills."
        },
        {
            "text": "“The project’s success is thanks to a great team effort with Dave at Rosuick Organic Farm and the Cornwall Council Nature Recovery Team. We share a passion for helping nature thrive."
        },
        {
            "text": "“Challenges like wet weather and Environmental Impact Assessments (EIAs) caused delays, but we’ve adapted by sowing in year two and focusing on smaller sites that don’t require EIAs. Collaboration with the National Trust and other FiPL projects, like HeLEN (Herbal Ley Establishment Network), has also been invaluable.”"
        },
        {
            "text": "Dave Oates added:“As a farmer, I’ve increased priority habitats and seen my produce’s value rise due to better flavour and growing customer interest. My animals enjoy the variety in their diet, and I’ve moved into Countryside Stewardship for long-term support in managing these habitats.”"
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "Phase 3 has now been approved. This will focus on:"
        }
    ]
}