{
    "url": "https://nationalscreening.blog.gov.uk/2024/12/18/nhs-england-starts-detailed-implementation-planning-for-tyrosinaemia-screening/",
    "title": "NHS England starts detailed implementation planning for tyrosinaemia screening",
    "authors": [
        "Miranda Lawton",
        "Jane Hibbert"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-12-18T08:25:57+00:00",
    "content": [
        {
            "text": "Earlier this year, the English government endorsed the UK National Screening Committee's (UK NSC’s) recommendation to introduce newborn screening for hereditary tyrosinaemia type 1 (HT1), a rare genetic condition."
        },
        {
            "text": "HT1 will be added to the inherited metabolic disorder (IMD) conditions screened for by the NHS Newborn Blood Spot (NBS) Screening Programme in England. "
        },
        {
            "text": "HT1 affects approximately 7 babies per year in the UK. Screening has the potential to ensure all these babies are detected in time to be offered drug treatment and a special diet before they become ill. This reduces the chance of liver disease and the need for liver transplantation."
        },
        {
            "text": "A UK National Screening Committee (UK NSC) oversight group and expert clinical and laboratory sub-groups have helped lay the groundwork for the implementation of HT1 screening."
        },
        {
            "text": "The expert clinical sub-group developed a case definition for HT1. This is an agreed description of the criteria that classify a baby as having the condition."
        },
        {
            "text": "Screening programmes need a clear case definition to support consistent diagnosis and data collection. A clear case definition is a valuable tool in following the future progress of affected babies. It is also important for reassuring parents of babies who do not have the condition but do have abnormal screening test results. "
        },
        {
            "text": "The clinical sub-group also produced:"
        },
        {
            "text": "In addition, the clinical sub-group explored important outcome measures that will need to be recorded to monitor the effectiveness of the HT1 screening programme."
        },
        {
            "text": "Screening for HT1 requires a change in approach to the method of detection used for the existing IMDs. The laboratory sub-group has worked on developing guidance for laboratories on the new testing methodology options and processes."
        },
        {
            "text": "Many thanks to all those who were involved in this work. At the final meeting of the HT1 screening oversight group there was a tribute to Dr Mark Sharrard, who died after a short illness earlier this year. Mark was a renowned paediatric metabolic consultant at Sheffield Children’s Hospital. He contributed greatly to the HT1 screening project, particularly in developing public and professional materials for use in the screening programme."
        },
        {
            "text": "The work of the oversight group and sub-groups have now been presented to the UK NSC and the detailed implementation planning has been handed on to NHS England (NHSE), which expects to roll out screening during 2025 to 2026."
        },
        {
            "text": "The other UK nations continue to engage in meetings with NHSE on HT1 screening. Scotland is progressing with its implementation plans and hopes to introduce the programme as soon as practicable. Scotland’s planned move to a new child health system in 2025 may impact on its implementation timeline."
        },
        {
            "text": "Wales is prioritising work required to develop its NBS IT system ahead of implementation. The UK NSC’s recommendation is also being considered within Northern Ireland."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}