{
    "url": "https://socialcare.blog.gov.uk/2024/12/18/reflections-on-2024-and-looking-ahead-to-2025/",
    "title": "Reflections on 2024 and looking ahead to 2025",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Technology and data",
        "Workforce"
    ],
    "pub_date": "2024-12-18T11:45:51+00:00",
    "content": [
        {
            "text": "As 2024 draws to a close, let’s reflect on what a year it has been. The work that colleagues across adult social care have done this year has been phenomenal."
        },
        {
            "text": "Millions of people have benefited from dedicated professionals who work tirelessly to support people who draw on care and support to reach their potential and live their lives to the full."
        },
        {
            "text": "I have been especially inspired by the care colleagues I have met during my visits throughout the year."
        },
        {
            "heading": 2,
            "text": "Changes throughout the year"
        },
        {
            "text": "A change in government has brought a renewed focus on adult social care, with the commitment to build consensus on a National Care Service."
        },
        {
            "text": "Lots of that work is in early development but it is clear that people at the front line of services will be critical to shape the direction of travel for that long-term reform. Social care is about people, those we serve, and those who deliver those services 365 days a year.         "
        },
        {
            "text": "The government wants to build a health and social care system that is fit for the future. There are three shifts that will be pivotal to this."
        },
        {
            "text": "We want to hear your views, experiences, and ideas to help shape a new 10-Year Health Plan for England. The Change NHS campaign is a unique opportunity for everyone, regardless of age, circumstances, or profession, to share their thoughts and concerns about our health and care system. Your insights and experiences as part of the adult social care community will be particularly valuable. Please take a moment to share your thoughts and perspectives using the link below."
        },
        {
            "text": "It is exciting that there has already been progress made this year. We have seen the start of critical work on the Fair Pay Agreement with the introduction of the Employment Rights Bill in Parliament. These agreements will empower worker representatives, employers and others to negotiate pay and terms and conditions and will help to address the recruitment and retention crisis in adult social care."
        },
        {
            "text": "Also, the launch of the Adult Social Care Learning and Development Support Scheme represents a significant opportunity for eligible employers to access funding for training courses and qualifications for their care staff."
        },
        {
            "text": "By participating in this initiative, employers can empower the non-regulated adult social care workforce to complete qualifications like the new Level 2 Care Certificate, gain well-deserved recognition for their skills, and develop new areas of expertise."
        },
        {
            "text": "The ongoing digitisation of the sector is transforming the way care is being delivered and managed.  Over 70% of registered providers have made the switch from using paper care plans, opting to reap the benefits offered through digital care records instead."
        },
        {
            "text": "Going digital means that care professionals have the most up to date information on a persons’ care needs at their fingertips, wherever and whenever they need it."
        },
        {
            "text": "Not only is this move to digital saving countless admin minutes (at least 20 minutes per care worker per shift), but using digital approaches means that providers are able to have access to GP record information to support safer and more personalised care."
        },
        {
            "text": "And most importantly, relatives can stay involved in their loved ones care by accessing the family portal functionality that’s available through many digital care planning solutions."
        },
        {
            "text": "It means that wherever they are in the world, they can feel reassured that they’re still up to speed with how their family member is doing."
        },
        {
            "text": "These developments will not only enhance care quality but support our journey toward building a National Care Service."
        },
        {
            "heading": 2,
            "text": "Looking ahead to 2025"
        },
        {
            "text": "With so much achieved this year, it gives us a sense of a busy 2025 to come. Thank you for all you have done throughout 2024. What you do personally makes a real difference to many."
        },
        {
            "text": "I wish you and your families the happiest of times during this festive season and in 2025."
        }
    ]
}