{
    "url": "https://food.blog.gov.uk/2024/12/18/stakeholder-update-december-2024s-fsa-board-meeting/",
    "title": "Stakeholder update: December 2024's FSA Board meeting",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2024-12-18T11:59:38+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "It was the final FSA Board meeting of the year last week and we were able to catch up on a number of important issues that have been on our minds."
        },
        {
            "text": "We had an update to September’s Board discussion on National Level Regulation (NLR) and we were pleased to hear about the engagement activity that’s been taking place since we last discussed this very important issue."
        },
        {
            "text": "We previously conducted a pilot trial to see if some of the large food retailers could be regulated as a single business at a national level and whether this would be an effective way of continuing to uphold high standards for consumers. The Board asked FSA officials to continue this engagement and work closely with stakeholders in the system to co-design proposals for a new way of working that makes greater use of data from these businesses in addition to physical inspections."
        },
        {
            "text": "The Board heard about the reforms and improvements the FSA is making to its market authorisation process to make it more efficient and fit for purpose. This included a discussion on the regulatory sandbox being led by the FSA and Food Standard Scotland on cell cultivated products. This follows a £1.6m award from the Department of Science, Innovation and Technology’s (DSIT) Engineering Biology Sandbox Fund."
        },
        {
            "text": "Also covered were the principles that will underpin our risk management of Cannabidiol (CBD) products, following the publication of the first FSA safety assessments for CBD novel food applications. The Board heard how the FSA intends to make recommendations to Ministers on the authorisation of these products in Spring/Summer of next year, following a public consultation. The Board broadly supported the principles and the approach set out in the paper, and asked officials to consider carefully how the potential presence of a controlled substance in CBD products will be managed."
        },
        {
            "text": "Finally, we discussed how the costs of FSA meat inspections should be met in the future. The FSA has meat inspectors and vets based in abattoirs and meat plants, where they inspect more than a billion animals every year. Under Government rules, the costs of regulatory services should be recovered in full from the industry.  However, the current discount scheme has been in place since 2016 and the Board noted the discount was in effect a subsidy to the meat industry and needed to be justified. We want to look at the scheme again to ensure it continues to uphold the safety of our meat and also helps to achieve other outcomes that are important to the public, such as animal welfare or support for rural communities and businesses."
        },
        {
            "text": "The early evidence from our recent meat charging call for evidence has provided valuable insights into how businesses and consumers are affected by the discounts we provide. FSA officials were asked to continue engagement with stakeholders and governments in England, Wales and Northern Ireland so we can develop a full picture ahead of providing advice to Ministers next year."
        },
        {
            "text": "If you would like to know more about charging, James Cooper, the FSA's Deputy Director of Food Policy, has written a useful Q&A blog."
        },
        {
            "text": "You can also see a recording of December’s FSA Board meeting."
        },
        {
            "heading": 2,
            "text": "Cyfarfod Bwrdd yr ASB ym mis Rhagfyr"
        },
        {
            "text": "Cynhaliwyd cyfarfod olaf Bwrdd yr Asiantaeth Safonau Bwyd (ASB) ar gyfer y flwyddyn yr wythnos diwethaf, ac roeddem yn gallu trafod y diweddaraf am nifer o faterion pwysig."
        },
        {
            "text": "Cawsom ddiweddariad ar drafodaeth y Bwrdd ym mis Medi am Reoleiddio ar Lefel Genedlaethol, ac roeddem yn falch o glywed am y gwaith ymgysylltu sydd wedi bod yn digwydd ers i ni drafod y mater pwysig iawn hwn ddiwethaf."
        },
        {
            "text": "Gwnaethom cynnal cynllun peilot yn flaenorol i weld a allai rhai o’r manwerthwyr bwyd mawr gael eu rheoleiddio fel un busnes ar lefel genedlaethol, ac i ddysgu a fyddai hyn yn ffordd effeithiol o barhau i gynnal safonau uchel i ddefnyddwyr. Gofynnodd y Bwrdd i swyddogion yr ASB barhau â’r gwaith ymgysylltu hwn a chydweithio’n agos â rhanddeiliaid yn y system i gyd-ddylunio cynigion ar gyfer ffordd newydd o weithio sy’n defnyddio data’r busnesau hynny’n fwy, yn ogystal ag arolygiadau ffisegol."
        },
        {
            "text": "Clywodd y Bwrdd am y diwygiadau a’r gwelliannau y mae’r ASB yn eu gwneud i’w phroses awdurdodi cynhyrchion i’w rhoi ar y farchnad. Y nod yw sicrhau proses fwy effeithlon ac addas i’r diben. Roedd hyn yn cynnwys trafodaeth ar y cynllun blwch tywod rheoleiddiol sy’n cael ei arwain gan yr ASB a Safonau Bwyd yr Alban ar gynhyrchion a wneir drwy feithrin celloedd. Mae hyn yn dilyn dyfarniad gwerth £1.6 miliwn gan Gronfa Blwch Tywod Bioleg Peirianneg yr Adran Gwyddoniaeth, Arloesedd a Thechnoleg (DSIT)."
        },
        {
            "text": "Ymdriniwyd hefyd â’r egwyddorion a fydd yn sail i’n gwaith rheoli risg cynhyrchion Cannabidiol (CBD), yn dilyn cyhoeddi asesiadau diogelwch cyntaf yr ASB ar gyfer ceisiadau bwydydd CBD newydd. Clywodd y Bwrdd sut mae’r ASB yn bwriadu cyflwyno argymhellion i weinidogion ar awdurdodi’r cynhyrchion hyn yn ystod gwanwyn/haf y flwyddyn nesaf, a hynny yn dilyn ymgynghoriad cyhoeddus. Roedd y Bwrdd yn cefnogi’n fras yr egwyddorion a’r dull gweithredu a nodir yn y papur, a gofynnodd i swyddogion ystyried yn ofalus sut y bydd presenoldeb posib sylwedd rheoleiddiedig mewn cynhyrchion CBD yn cael ei reoli."
        },
        {
            "text": "Yn olaf, buom yn trafod sut y dylid talu costau arolygiadau cig yr ASB yn y dyfodol. Mae gan yr ASB arolygwyr cig a milfeddygon wedi’u lleoli mewn lladd-dai a ffatrïoedd cig. Maen nhw’n archwilio mwy na biliwn o anifeiliaid bob blwyddyn. O dan reolau’r llywodraeth, dylai costau gwasanaethau rheoleiddio gael eu hadennill yn llawn fel arfer.  Fodd bynnag, mae’r cynllun disgownt presennol wedi bod ar waith ers 2016, a nododd y Bwrdd fod y disgownt i bob pwrpas yn gymhorthdal i’r diwydiant cig a bod angen ei gyfiawnhau. Rydym am edrych ar y cynllun eto er mwyn sicrhau ei fod yn parhau i gynnal diogelwch cig a hefyd yn helpu i gyflawni canlyniadau eraill sy’n bwysig i’r cyhoedd, fel lles anifeiliaid neu gymorth i gymunedau a busnesau gwledig."
        },
        {
            "text": "Mae’r dystiolaeth gynnar o’n galwad diweddar am dystiolaeth ynghylch taliadau cig wedi darparu cipolwg gwerthfawr ar sut mae’r gostyngiadau a ddarparwn yn effeithio ar fusnesau a defnyddwyr. Gofynnwyd i swyddogion yr ASB barhau i ymgysylltu â rhanddeiliaid a llywodraethau yng Nghymru, Lloegr a Gogledd Iwerddon fel y gallwn ddatblygu darlun llawn cyn rhoi cyngor i weinidogion y flwyddyn nesaf."
        },
        {
            "text": "Os hoffech wybod mwy am godi tâl, mae Dr James Cooper, Dirprwy Gyfarwyddwr Polisi Bwyd yr ASB, wedi ysgrifennu blog sy’n cynnwys cwestiynau ac atebion defnyddiol."
        },
        {
            "text": "Gallwch hefyd weld recordiad o gyfarfod Bwrdd yr ASB ym mis Rhagfyr yma."
        }
    ]
}