{
    "url": "https://defrafmp.blog.gov.uk/2024/12/18/the-outcome-of-the-consultation-on-annex-a-of-the-jfs-has-been-published-today/",
    "title": "The outcome of the consultation on Annex A of the JFS has been published today",
    "authors": [
        "​​Emily Parsons - Policy Officer, Defra​"
    ],
    "categories": [
        "-Defra FMPs"
    ],
    "pub_date": "2024-12-18T12:31:24+00:00",
    "content": [
        {
            "text": "Today, we have published the government response to the consultation proposing amendments to Annex A of the Joint Fisheries Statement (JFS). "
        },
        {
            "text": "The consultation was launched on 10 October and closed on 21 November 2024. In the consultation, we proposed amending publication deadlines for the remaining Fisheries Management Plans (FMPs) and making a few other technical changes. "
        },
        {
            "text": "We received 39 responses, reflecting views from across interested groups, which we have analysed.   "
        },
        {
            "text": "You can read the summary of responses and government response to the consultation here: Joint Fisheries Statement: proposed amendments to Annex A - GOV.UK "
        },
        {
            "text": "Outcome of the consultation "
        },
        {
            "text": "Most respondents to the consultation agreed with the amendments we proposed to Annex A. "
        },
        {
            "text": "As a result, the following amendments take place with immediate effect: "
        },
        {
            "text": "We have also taken on board recommendations received to make two additional changes: "
        },
        {
            "text": "See the updated Annex A of the JFS here: Joint Fisheries Statement (JFS) - GOV.UK "
        },
        {
            "text": "REMEMBER: It’s not too late to have your say – the consultations on the next five Defra-led draft FMPs are still open! Find the links here.​ "
        }
    ]
}