{
    "url": "https://naturalengland.blog.gov.uk/2024/12/18/update-on-the-deaths-of-three-tagged-hen-harriers/",
    "title": "Update on the deaths of three tagged hen harriers",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Hen Harriers"
    ],
    "pub_date": "2024-12-18T14:22:12+00:00",
    "content": [
        {
            "text": "Hen harriers remain rare in England, with a welcome increase in their population over the last few years stalling in 2024. Poor weather and food availability may cause their numbers to fluctuate, but ongoing illegal killing remains a serious threat to the species’ survival in England."
        },
        {
            "text": "Natural England (NE) has recently received confirmation that police investigations into the deaths of two tagged hen harriers have concluded, and we can now be confident that releasing information relating to these cases will not jeopardise the course of justice. We have also recently received final post-mortem information for a third tagged bird. This blog serves to document their fate."
        },
        {
            "text": "R2-M1-23, #213927"
        },
        {
            "text": "Juvenile male harrier R2-M1-23 was tagged in July 2023, at a release site in Cumbria as part of the Brood Management Trial, before heading to spend the winter in North Devon (a link to our monitoring spreadsheet for all NE tagged hen harriers can be found here). On 29 February 2024, R2-M1-23’s tag recorded a very low body temperature, indicating death. As is standard procedure, NE’s Enforcement and Appeals Team (NE E&A) informed the police of the discrepancies in the tracking data. On 5 March under direction from police, specialist NE E&A staff were deployed to search for the missing hen harrier. R2-M1-23 was found in a small clearing between agricultural fields, his tag clearly visible, and his body showing some signs of predation."
        },
        {
            "text": "The carcass of R2-M1-23 was photographed and collected, then sent to the Institute of Zoology at Zoological Society of London (ZSL) for a post-mortem examination. Poor body condition, masses growing in the crop, and other internal signs, indicate that he carried a number of common diseases. The role of these in his death cannot be fully quantified, but R2-M1-23 is considered to have died of natural causes."
        },
        {
            "text": "R2-F2-20 #55144 + R3-F1-22 #213921a"
        },
        {
            "text": "Two female hen harriers R2-F2-20 and R3-F1-22 were tagged in 2020 and 2022 at release sites in northern England as part of the Brood Management Trial. During the winter of 2022 both settled into the same roost site in the North Pennines, monitored by NE Hen Harrier Team field staff under the brood management trial partnership agreement."
        },
        {
            "text": "On 7 December 2022, R2-F2-20’s tag stopped transmitting. One week later, on 14 December, R3-F1-22’s tag also went offline. Leading up to this both birds had been behaving naturally. With the full cooperation of local land managers, numerous searches were made by police and NE E&A staff around the last transmission site, nearby roost, and in areas used by each bird, but unfortunately neither was found in the weeks that followed."
        },
        {
            "text": "Further intermittent transmissions were received from both tags between January and April 2023, but further ground searches were unsuccessful until 10 April, when R3-F1-22 was recovered by NE field staff with the assistance of the local gamekeeper and estate manager. Her remains were collected by a Wildlife Crime (police) Officer and sent to ZSL for a post-mortem examination. On 25 June 2023, R2-F2-20 finally transmitted again; she was located 4 days later by a quickly mustered multi-agency search team, and also sent to ZSL for a post-mortem."
        },
        {
            "text": "After months laying dead, both bodies were highly degraded, but three suspected lead shotgun pellets were found within the body of R2-F2-20, and two in the body of R3-F1-22. The level of decomposition of the bodies led ZSL to conclude that it was not possible to explicitly link the death of either bird to the pellets. NWCU could take the case no further, but the presence of pellets suggests ongoing illegal persecution of hen harriers in northern England."
        },
        {
            "text": "Detective Inspector Mark Harrison from the National Wildlife Crime Unit (NWCU) said:"
        },
        {
            "text": "“The work that Natural England, and other organisations do to satellite tag these birds has given the police an opportunity to assess what is going on and where the greatest threats are. We have developed new procedures to assess each incident referred to us so that we can try to establish what has happened and to give the police the best chance of recovering evidence when a crime has occurred. It also means that we can be proactive and target repeat crime locations. It is working and there has been a significant decrease in crimes involving tagged birds this year. Obviously, birds do die naturally, but 2 out of 3 of these rare birds was a victim of crime. That is unacceptable and we will do everything we can to prevent further crimes and prosecute offenders.”"
        },
        {
            "text": "Natural England’s Hen Harrier Team monitor, tag and track these rare and threatened birds to support their recovery as set out in the Hen Harrier Action Plan. We are grateful to partner organisations and land managers who support our work, and will continue to work closely with the National Wildlife Crime Unit in their efforts to investigate bird of prey crime. In the interests of transparency, we publish the status of all tagged hen harriers on our tracking update page, and aim to share details of how birds died when possible. News of deliberate killing of tagged hen harriers is always hard for our team to hear, but it does not discourage us from our continued work on hen harrier recovery."
        }
    ]
}