{
    "url": "https://cspl.blog.gov.uk/2021/11/05/amending-the-descriptor-to-leadership-reinforcing-a-culture-of-respect-for-one-another/",
    "title": "Amending the descriptor to leadership – reinforcing a culture of respect for one another",
    "authors": [
        "Jane Martin"
    ],
    "categories": [
        "Nolan Principles",
        "Standards Matter 2"
    ],
    "pub_date": "2021-11-05T12:39:34+00:00",
    "content": [
        {
            "text": "The Committee’s latest report, Upholding Standards in Public Life, considered how the institutions and processes that regulate ethical standards are meeting the challenges of today, looking at their ability to withstand current and new challenges in a world of social media, political polarisation, and greater scrutiny of public office holders’ conduct."
        },
        {
            "text": "Read our report and recommendations."
        },
        {
            "text": "Despite significant societal and political change, evidence gathered for the review confirmed that Lord Nolan’s Seven Principles of Public Life continue to resonate today. Selflessness, integrity, objectivity, accountability, openness, honesty and leadership continue to reflect the standards the public expect of those who serve them."
        },
        {
            "text": "However, we also reflected on the fact that many codes of conduct – including Parliament’s Behaviour Code, the Ministerial Code, and the Senedd Code of Conduct - have been amended in recent years to stress opposition to bullying and harassment and emphasise the idea of respectful behaviour."
        },
        {
            "text": "Recognising this changing context, the Committee has decided to update the descriptor for the leadership principle to add in the need for holders of public office to treat others with respect. The descriptor:"
        },
        {
            "text": "‘Holders of public office should exhibit these principles in their own behaviour. They should actively promote and robustly support the principles and be willing to challenge poor behaviour wherever it occurs.’"
        },
        {
            "text": "Will now read:"
        },
        {
            "text": " ‘Holders of public office should exhibit these principles in their own behaviour and treat others with respect. They should actively promote and robustly support the principles and challenge poor behaviour wherever it occurs.’"
        },
        {
            "text": "The importance of leadership as one of the Seven Principles of Public Life was strongly emphasised by many people we spoke to for this review. Often referred to as the ‘tone from the top’, it was clear that having good role models endorsing and promoting high ethical standards matters throughout organisations, but for those in senior positions it was considered essential."
        },
        {
            "text": "Leadership means not only demonstrating high ethical standards but also calling out poor standards where necessary.  From other recent Committee reports into Local Government Ethical Standards and Intimidation in Public Life, we know that mutual respect exemplified in courteous behaviour must be the bedrock of political debate and public policy. Our latest review highlighted that a lack of respect for different opinions and points of view continues to hamper progress in developing a public culture which values high ethical standards and embraces the Seven Principles of Public Life. Our intention in amending the leadership principle is to challenge and foster a more constructive approach."
        },
        {
            "text": "Leadership, in the Committee’s view, implicitly includes respect for one another. However, against a backdrop of increasing intimidation and abuse, along with the greater awareness of issues of harassment and bullying, the Committee has come to the view that this should be made explicit in the descriptor. So too should it be explicit that all public office holders have a direct responsibility to challenge poor conduct."
        },
        {
            "text": "To be clear, the principle of leadership doesn’t only apply to Ministers, CEOs or line managers, or only relate to actions taken at board level. It applies to everyone in public office, encouraging all office holders to exemplify the Seven Principles on a day-to-day basis."
        },
        {
            "text": "Mutual respect is essential to foster civility in the public sphere. We have a long-standing culture of robust political discussion in the UK and a healthy public scepticism. This is a good thing, and no one would want to return to an age of deference. But listening to the views of others and treating people with respect is critical to open, robust decision making in the wider public interest."
        },
        {
            "text": "We will be updating the descriptor of the leadership principle to reinforce the expectation of respect for one another."
        },
        {
            "text": "The Seven Principles of Public Life"
        },
        {
            "text": "Watch a short video about the work of the Committee"
        }
    ]
}