{
    "url": "https://teaching.blog.gov.uk/2021/11/05/get-inspired-schools-responding-to-the-climate-change-challenge/",
    "title": "Get inspired: schools responding to the climate change challenge",
    "authors": [
        "Various authors"
    ],
    "categories": [
        "Primary schools",
        "Secondary schools"
    ],
    "pub_date": "2021-11-05T12:58:32+00:00",
    "content": [
        {
            "text": "As the COP26 summit continues in Glasgow, we asked teachers and leaders from schools across the country to share how they are playing their part in creating a sustainable future."
        },
        {
            "text": "Giving young people a voice"
        },
        {
            "text": "At Greatwood we have a team of Eco-Rangers, who are pupils from years 1-6. They have been carrying out a ‘Year of Waste Challenge’ where they are set monthly challenges by the Trust Leader/CEO. So far, they have focused on waste crime, clothes production and reducing the schools carbon footprint. The children have also carried out their own investigations into food waste, travel to school, electricity use, and have presented further improvement ideas and held the school to account."
        },
        {
            "text": "Jonelle Yeoman, Headteacher - Greatwood Community Primary & Nursery School"
        },
        {
            "text": "Our pupils have created various innovative sustainability initiatives within the school, such as 'Plastic Free Fridays' and 'Meat Free Mondays'. This pupil-led approach has enabled true ownership of the various initiatives, and fully embeds the importance of taking responsibility for looking after the world around them."
        },
        {
            "text": "Adam Stainsbury, Principal - Westerings Primary Academy"
        },
        {
            "text": "Small changes to make school more sustainable"
        },
        {
            "text": "To encourage sustainability, every class has two ‘power down champions’ who turn off electrical equipment when it is not being used. We have also set up recycling stations in every classroom for paper, we plant trees which are free from the Woodland Trust and have a walk to school week. In addition, we’ve had conversations with our school kitchen staff about reducing single use plastics and introducing re-usable straws."
        },
        {
            "text": "Jonelle Yeoman, Headteacher - Greatwood Community Primary & Nursery School"
        },
        {
            "text": "We’ve implemented a school-wide initiative to reduce the amount of single use plastics. We looked at the number of plastic bottles, plastic cutlery and polystyrene cups being used daily in the canteen and encouraged all pupils to keep reusable bottles. Every pupil has now been given a Parkwood Academy reusable water bottle and the academy has become completely plastic free."
        },
        {
            "text": "Gemma Cottingham, Headteacher - Parkwood Academy"
        },
        {
            "text": "Making a big statement"
        },
        {
            "text": "In school, we host termly ‘No Electricity’ days which have a huge impact on how pupils think about and use electricity. This term we have organised the day to coincide with COP26 and will spend the day learning about the summit."
        },
        {
            "text": "We have also taken inspiration from the recent Earthshot Prize, to design our very own Environmental Prize in school. This encourages pupils to design an idea to help the school become more environmentally friendly. We will be hosting an awards ceremony, which will identify two winners, who will receive £500 towards achieving their ideas."
        },
        {
            "text": "Tom Parkin, Headteacher - South Molton Community Primary School"
        },
        {
            "text": "Improving biodiversity"
        },
        {
            "text": "Our pupils have planted over 400 trees and installed two compost zones within our school grounds. We’ve also created a wildlife walk within the woodland areas of the school. The centrepiece of the wildlife walk is the addition of pupil-made bird boxes which can be viewed from their newly installed bird hide. As well as encouraging wildlife walks, we also have ‘walk to school' initiatives to get pupils to travel to school more sustainably, by walking, scooting, or cycling."
        },
        {
            "text": "Adam Stainsbury, Principal - Westerings Primary Academy"
        },
        {
            "text": "At Ringmer we have appointed eco reps and have a dedicated eco team. We have been concentrating on biodiversity and one of our initiatives for Spring 2022 is the rewilding of the school grounds. The aim is to encourage wildlife onto the site, by planting indigenous species hedgerows and orchards and digging a wetland and pond space."
        },
        {
            "text": "Sarah Pillar & Emma Holmes - King’s Academy Ringmer"
        },
        {
            "text": "Engaging the wider community"
        },
        {
            "text": "Some of our pupils have formed a Climate Action Group, where they work closely with the Borough Council. The group will be taking part in an event focusing on generating local agreement on what should happen to help combat climate change within Solihull. They have also recently conducted a Climate Action Survey, provided by the InterClimate Network, to inspire and enable the school community to tackle climate change."
        },
        {
            "text": "Abid Butt, Principal - Lyndon School"
        },
        {
            "text": "We recently hosted a Climate Summit, which was an exciting opportunity for children to hear live from the UN Climate Change Conference and to quiz our leaders about the work they are doing to encourage sustainability. Pupils sent leaf messages to Westminster, supporting the WWF’s Schools’ ‘Promise to the Planet’ campaign. Their messages included asking world leaders to stop burning fossil fuels, plastic pollution, and deforestation."
        },
        {
            "text": "Angela Spencer & Margaret Land - St Margaret Clitherow Catholic Academy Trust"
        },
        {
            "text": " "
        },
        {
            "text": "For more ways to get inspired:"
        }
    ]
}