{
    "url": "https://design102.blog.gov.uk/2021/11/05/giving-good-feedback-7-ways-to-get-the-most-from-your-designer/",
    "title": "Giving good feedback: 7 ways to get the most from your designer",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Advice",
        "Design",
        "Services",
        "Team"
    ],
    "pub_date": "2021-11-05T12:00:12+00:00",
    "content": [
        {
            "text": "When you commission a project with Design102, we will always include time for feedback and amendments. Refinement is often essential to making a great idea even better and nailing those small details can really help a design to resonate with your audience."
        },
        {
            "text": "This means that giving good feedback is essential – both to making sure the design is as good as it can be, and to ensuring that the amends process runs smoothly. We asked our design team what good, helpful feedback looks like."
        },
        {
            "text": "This blog post details how to give good feedback, resulting in good design outcomes."
        },
        {
            "heading": 2,
            "text": "1. Share helpful examples"
        },
        {
            "text": "Sharing examples of campaigns or designs you think are attractive or successful is useful as it can help us to understand the tone you’re looking for and how simple or complex the ask is."
        },
        {
            "text": "Keep it simple. Sharing 6 very different videos can be more confusing than helpful, but if there’s a particular illustration style or colour scheme that you’ve seen, don’t be afraid to share it. If you’re new to the process, our website is a good place to find examples."
        },
        {
            "text": "If research and testing has shown there’s certain things you need to avoid, tell us this too."
        },
        {
            "heading": 2,
            "text": "2. Be specific..."
        },
        {
            "text": "If feedback is too vague, we might need to spend time clarifying your needs, which ultimately costs money. You can prevent this by making sure all your feedback is clear and easy to understand."
        },
        {
            "text": "It helps to be specific, so try to avoid phrases like ‘make it punchy’ or ‘give it some pop’. Instead you could say, ‘we’d like the photos to show people looking into the camera’, or, ‘brighter colours would work better for this audience’. Being specific can be especially important if we’re following strict brand guidelines."
        },
        {
            "heading": 2,
            "text": "3. ...but not prescriptive"
        },
        {
            "text": "Constructive feedback helps us to develop designs, but if it’s overly prescriptive it can limit us. Describe the problem – for example, ‘the text boxes look too cramped’ – and trust the designer to solve it. Balancing specific requests with some level of creative freedom is the best way to get the most from your designer."
        },
        {
            "heading": 2,
            "text": "4. Involve the right people at the right time"
        },
        {
            "text": "Make sure your feedback comes from the correct people, and include any key decision makers and stakeholders early in the project. This will help avoid any major changes later down the line, or even after a design has been signed off."
        },
        {
            "text": "Reviewing and consolidating your feedback and designating one person as the main point of contact also helps keep communication smooth and simple."
        },
        {
            "heading": 2,
            "text": "5. Give feedback in the right format"
        },
        {
            "text": "The project manager should have a discussion with you about how you will supply your feedback. Once a process is agreed, stick to it as much as possible – for example, marking up amends on a PDF using the correct tools."
        },
        {
            "text": "It’s more time-consuming if feedback is supplied in different formats, such as some via email and some via PDF. This also creates more chances for errors to creep in – for example, increasing the potential for feedback to get missed."
        },
        {
            "heading": 2,
            "text": "6. Be constructive"
        },
        {
            "text": "Our designers work hard to meet your needs, so it’s important that feedback is clear and constructive. When possible, face-to-face feedback is useful as it gives you the chance to engage directly with designers and discuss any changes or complex questions. It’s also an efficient way of getting all the appropriate stakeholders in one place."
        },
        {
            "heading": 2,
            "text": "7. Trust your designers"
        },
        {
            "text": "The people who get the best from their designers show trust and respect, communicate clearly and politely, and establish expectations upfront. It’s natural to want to offer your own solutions, but designers are experts and are best-placed to translate your needs into effective and engaging design solutions. Explore and compare the work together, and you’ll reap the rewards."
        },
        {
            "text": "Done right, the client-designer relationship can be rewardingly collaborative and dynamic, offering an exciting opportunity for your knowledge of objectives, audience and context to inform and inspire a designer’s own unique expertise."
        },
        {
            "text": "You can see great examples of collaborative working on the Design102 website."
        },
        {
            "text": " "
        },
        {
            "text": "If you’d like to know more about Design102 or you’ve got a project we can help with, just drop us a line at hello@design102.co.uk"
        }
    ]
}