{
    "url": "https://environmentagency.blog.gov.uk/2021/11/05/learning-to-tackle-our-carbon-footprints-individually-and-together/",
    "title": "Learning to tackle our carbon footprints – individually and together",
    "authors": [
        "Shelly Beckett"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2021-11-05T13:58:47+00:00",
    "content": [
        {
            "text": "As COP 26 takes centre stage, we are all hoping for a sincere, global commitment to the urgent reduction in carbon emissions. We all want to do something, anything that will help us out of our climate crisis, right? This is our biggest, global environmental challenge. We have been talking about it for decades; climate change, the climate crisis, the biodiversity emergency. It’s not new."
        },
        {
            "text": "Complex and global? Yes. But not new."
        },
        {
            "text": "And despite all the talk, commitments, actions to-date, the truth is the planet continues to warm and our carbon dioxide levels continue to rise."
        },
        {
            "text": "No wonder there is often a feeling of hopelessness and frustration. The enormity of this one global challenge, is at once beyond comprehension and frankly, frightening. In addition, the sense of individual powerlessness can be overwhelming."
        },
        {
            "text": "Whilst I am an optimist, I do see that optimism alone won’t help this crisis. I do, however, have hope. And for me, hope is knowing that I can do something."
        },
        {
            "text": "Working for the Environment Agency, I’m surrounded by others who feel the same, and who work day in, day out, to protect and enhance our environment. Together we work to leave nature in a better state than we found it. It goes without saying that this includes tackling the climate emergency."
        },
        {
            "text": "At the EA we’ve made our own commitment to net zero by 2030 – meaning we will no longer be contributing to climate change – and earlier this year, revealed our roadmap for achieving this goal. We’ll cut our emissions by at least 45% and offset the rest through projects that bring added benefits for people and nature, such as reduced flood risk and more, better habitats."
        },
        {
            "text": "The scale of the challenge is huge, and we will all have to play a part."
        },
        {
            "text": "Which is why one of the first things the organisation is doing is making sure all our people have the right knowledge and skills as a foundation."
        },
        {
            "text": "The EA is one of the first government bodies to roll out its own, bespoke training developed with the Carbon Literacy Trust to all staff. The training will help us all understand our impacts on the environment, our individual and collective carbon footprints, and the actions we can take to reduce these at work and at home. It will help educate, inform and inspire us to make better decisions and change our behaviours – and to influence others to do the same."
        },
        {
            "text": "And everyone who completes it becomes externally certified as Carbon Literate, with the EA as a whole seeking Carbon Literacy accreditation by the end of next year."
        },
        {
            "text": "And with COP 26, history’s most important climate conference, underway now, the training couldn’t have been timelier."
        },
        {
            "text": "I signed up for and completed my day’s training package, giving me a much better understanding of the impacts and costs of carbon dioxide and other greenhouse gases on our everyday activities. The training included a climate-science module and a group discussion where we talked about our ability and motivation to reduce emissions, on an individual, community and organisational basis. If we want to be role models, to actively do something, then this training is a good nudge, a great start, and it seems it’s gathering momentum."
        },
        {
            "text": "A key part of the training is that those completing it must make a commitment to take tangible action to reduce their carbon impact."
        },
        {
            "text": "So what did I do?"
        },
        {
            "text": "I was keen to see what I could do individually and as part of my local community. I proposed a ‘trees for the future’ project on our local village green. To develop and create a small mixed woodland / orchard habitat, bringing benefits in terms of climate change, biodiversity and the opportunity to increase both habitat, wildlife and the future amenity value for all those that use it. I have secured funding for the trees, engaged our local councillors, have volunteers young and old for the tree planting, and bird and bat boxes will be put up too. A series of story boards will also be created to explain why the ‘Trees for the Future’ project matters."
        },
        {
            "text": "Whilst this minuscule action in the global scheme of things may almost seem irrelevant, it is the start of doing something. Putting learning into action, using your voice and turning it into a wider conversation. It is about listening, talking, thinking and working together. We did something."
        },
        {
            "text": "What will you do?"
        },
        {
            "text": "For more information on Carbon Literacy Training, check out the Carbon Literacy Trust."
        },
        {
            "text": "Have questions about our net zero goal? Get in touch: EANetZero@environment-agency.gov.uk."
        }
    ]
}