{
    "url": "https://dcmslibraries.blog.gov.uk/2021/11/05/libraries-and-climate-change-reducing-reusing-and-recycling-in-gll/",
    "title": "Libraries and climate change: reducing, reusing and recycling in GLL",
    "authors": [
        "Diana Edmonds, Head of Libraries, GLL"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2021-11-05T13:00:21+00:00",
    "content": [
        {
            "text": "We are all becoming increasingly aware of the challenges our world faces because of climate change – and the UN Climate Change Conference (COP 26) is very firmly focusing our attention on this right now."
        },
        {
            "text": "Libraries are often viewed as the perfect example of recycling – one book is used by many people – but does that mean that we can sit back and relax, feeling the job is done and the world is saved for future generations? GLL is a charitable social enterprise and manages five public library services – and over the last few years, we have been exploring ways in which all aspects of our services can become more sustainable. We are librarians – and so our first task was a literature search, which lead us to adopt “reduce, reuse and recycle” as our mantra."
        },
        {
            "text": "Our opportunity to turn our mantra into reality came with a major refurbishment project in Bromley Central Library. We manage a lot of libraries and always have a refurbishment project on the go somewhere – but the upgrade of Bromley Central Library was a major work programme, involving the refurbishment of two floors of a nine floor building, areas which house both the public library service and also Bromley Historic collections including archives and artefacts. This significant project gave us the opportunity to work towards an eco refit and to ensure that the library was as sustainable as possible:"
        },
        {
            "text": "As we progressed, we grew more enthusiastic – and so we looked for more opportunities for this ‘green’ approach."
        },
        {
            "text": "An easy option came with the many printed leaflets we previously displayed – and laminated – in the library. These laminated notices have now been replaced with large screens which provide information on activities."
        },
        {
            "text": "Then we moved onto toilets. We changed the toilet paper to bamboo or recycled paper, changed soap to a ‘green’ variety and changed from paper towels to energy efficient electric driers. In future we may change the toilets themselves to use ‘grey water’."
        },
        {
            "text": "We also worked with our cleaning company to move to a ‘green regime’ using environmentally friendly cleaning products – and using refills rather than buying new plastic containers when the old one was empty."
        },
        {
            "text": "We have carried forward these principles in other refurbishments: Eltham Library’s refurbishment programme brought new life to a Victorian library building and, once again we followed the sustainable approach we had in Bromley."
        },
        {
            "text": "While Bromley and Eltham offer specific examples of the actions we’ve taken, we’re working towards “reduce, reuse and recycle” across all our libraries. We now share servers, resulting in power reduction and all hardware is reused or recycled."
        },
        {
            "text": "It may seem strange – but almost the last thing we looked at was the library service itself and the plastic clad bookstock. Book labels now use recycled paper and adhesives are environmentally friendly. Our suppliers are required to dispose of packaging responsibly – and to be accredited for doing so. We have moved to electronic invoices to reduce the use of paper – and the books are now delivered direct to library branches in order to make transportation more efficient. Our next challenge is to make inroads into the number of plastic covers we use on our books."
        },
        {
            "text": "We looked at library tickets, too – did we really need to use plastic? It did not seem possible to buy a biodegradable library ticket – and so we worked with our suppliers to produce one, manufactured to our specification. Earlier this year the libraries we operate in the Royal Borough of Greenwich became the first in the country to move to fully biodegradable library cards that are made in the UK, from ethically sourced materials. The suppliers are now onto version 2 of the library cards, which last longer but which can still be recycled. With over 121,000 library cards currently in circulation within Greenwich alone, the change will have a significant environmental impact – reducing the amount of plastic going to landfill."
        },
        {
            "text": "Libraries receive lots of paper and we recycle wherever possible, providing a network of paper recycling bins across the whole of our operation. In some locations we offer a recycling point for the public, too, collecting things like batteries and small electrical goods, or acting as a refill station, providing water for reusable bottles."
        },
        {
            "text": "While we’re proud of what we have achieved to date, there is still much more to do and we’re focussed on the future. We want to bring all our libraries up to our own green standards and roll out initiatives such as the eco library cards further. All future refurbishments will have ecological matters at their heart And the libraries managed by GLL will provide information on sustainability, encouraging our users to adopt more sustainable behaviours as part of their daily lives."
        }
    ]
}