{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/05/natives-by-akala-a-must-read-for-black-history-month-2021/",
    "title": "Natives by Akala - A must-read for Black History Month 2021",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-11-05T10:48:07+00:00",
    "content": [
        {
            "text": "If you want to explore the idea of meritocracy and engage with a provocative discussion on the success of the British Empire, you will certainly discover some novel insights from Akala’s debut book Natives."
        },
        {
            "text": "Akala is a well-known figure in the UK, as hip-pop artist, social entrepreneur and public speaker. He is an outspoken critic on (the growing) inequality in the UK, focusing on class and race. In this book he shows what it was like to grow up in Camden as a poor, mixed raced kid in the 1980s. He shows how being in the wrong place at the wrong time is the most important factor determining the outcome for black Britons."
        },
        {
            "text": "In this well-researched book, Akala explores how the exceptional achievements of black people do not provide evidence that the perceived obstacles of poverty and race can be overcome by all. Additionally, he goes further and shines a light on narratives ranging from disturbing truths about history and contemporary politics, accompanied by auto-biographical passages."
        },
        {
            "text": "However, it was Akala’s lived experience told clearly and graphically that kept me reeling as I read. I was shocked by the how the school system treated Akala, putting him in a lower class with the assumption that black people are less intelligent. They even disputed that he had read certain books and he would be constantly overlooked when trying to answer questions in class."
        },
        {
            "text": "On aspects of history, Akala challenges some of the notions that underpin British history. For example, Akala argues against ”William Wilberforce as the ‘white saviour’ who freed his black ancestors from slavery”, and “Britain being the first country to abolish slavery”. This book is not just about race. Akala also writes “class affects everything, even racism”. The main message of the book is how race and class are constructed categories benefiting the ruling elite, and that this is something that needs attention not only in Great Britain, but in other European countries as well."
        },
        {
            "text": " "
        },
        {
            "text": "Nim Mahamalimage, Nim is a Science and Engineering Fast streamer in the Defence Science and Technology, Ministry of Defence."
        },
        {
            "text": "Rameya, Chair of the DIAG Ethnic Minorities group"
        },
        {
            "text": "The GSE Board is committed to improving diversity and inclusion in Government Science and Engineering."
        },
        {
            "text": "Chris Pook, Deputy Director in the Government Office for Science"
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}