{
    "url": "https://socialcare.blog.gov.uk/2021/11/05/preparing-for-liberty-protection-safeguards/",
    "title": "Preparing for Liberty Protection Safeguards",
    "authors": [
        "Paula Thompson-Butler"
    ],
    "categories": [
        "Care and support",
        "Safeguarding",
        "social work"
    ],
    "pub_date": "2021-11-05T15:24:50+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Positive developments"
        },
        {
            "text": "As a qualified social worker, I welcome the changes which Liberty Protection Safeguards (LPS) intends to bring to the sector.  It promotes a better way for how we will work to support individuals who may have their liberty deprived in order for their care and support needs to be met. Many people working in health and social care know about the change, but there is understandable concern across the sector about how to fulfill their responsibilities."
        },
        {
            "text": "As an Associate at the Social Care Institute for Excellence (SCIE), we have together created a film which introduces some of the changes we can expect as we move from working under Deprivation of Liberty Safeguards (DoLS) to LPS.  We hope this short video will reduce some of the anxieties expressed by highlighting that the changes align closely with statutory duties and core principles of the Care Act 2014."
        },
        {
            "text": "While the processes relating to an authorisation of a deprivation of liberty will change, the sector skills, knowledge and experience gained under the Care Act framework means there is already a solid foundation for expected practice under LPS."
        },
        {
            "heading": 2,
            "text": "Following process and respecting human rights"
        },
        {
            "text": "Under LPS, any individual or organisation supporting an adult with need for care and support will need to make sure an appropriate assessment of the individual's capacity to consent to the arrangement has been undertaken. In the event the individual is assessed to lack capacity, is under constant supervision and will not be free to leave the setting within which support is provided, then this deprivation of liberty will need to be authorised."
        },
        {
            "text": "The significant shift in focus, however, is that authorisation should be granted prior to the deprivation and not after it has occurred. Practice will be centred around person-centred support planning, making sure least restrictive options are taken, which will have been considered if we adhere to our duties within the framework of the Care Act 2014 and Mental Capacity Act 2005."
        },
        {
            "text": "So, there will be changes to how a deprivation of liberty is authorised and organisations will need to adapt their processes accordingly. We believe our film reinforces the view that our sector is in a good position to practice in a way which keeps individuals at the centre of any intervention, even if it means a deprivation of their liberty."
        },
        {
            "text": "Steve Chamberlain, an independent social worker and trainer, says the film reinforces how important human rights are to everyone and how LPS will work to protect those most vulnerable to having their rights undermined. He agrees it clarifies the close link between Care Act duties and LPS and how effective assessment and care planning will help to streamline the process."
        },
        {
            "text": "I know we are waiting with baited breath for the draft LPS Code of Practice consultation, but there are things we can do to prepare. A good place to start learning about the new responsibilities for the social care sector is to view SCIE’s new film and access the other resources below."
        },
        {
            "heading": 2,
            "text": "More help with LPS from SCIE"
        }
    ]
}