{
    "url": "https://homeofficemedia.blog.gov.uk/2021/11/05/returns-and-charter-flight-factsheet-may-2022/",
    "title": "Returns and Charter Flight Factsheet (May 2022)",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2021-11-05T21:16:23+00:00",
    "content": [
        {
            "text": "Returns and Charter Flight Factsheet (Updated May 2022)"
        },
        {
            "text": "The purpose of this factsheet is to provide information to explain the deportation and enforced removal process, the use of charter flights and to explain the checks and balances in the system to ensure our work is carried out both fairly and in accordance with the law."
        },
        {
            "text": " Definitions"
        },
        {
            "text": "Charter flights are sent to different countries around the world, we utilise them where there is a lack of scheduled routing via commercial airlines to a particular country or where it is most cost effective. We use them to return people under different pieces of legislation and we use different language to describe the type of return:"
        },
        {
            "text": " The legislation"
        },
        {
            "text": "The power to remove a person who requires leave to enter or remain in the UK but does not have it, is contained in section 10 of the Immigration and Asylum Act 1999 (as amended by the Immigration Act 2014). This provides for removal directions to be issued for:"
        },
        {
            "text": "The Home Secretary is required by law (UK Borders Act 2007) to issue a deportation order to any non-British or Irish citizen who has been convicted of an offence in the UK and received a custodial sentence of at least 12 months, unless an exception applies."
        },
        {
            "text": "Under the Immigration Act 1971, a foreign national may also be deported where it is “conducive to the public good”. Typically, this will be a person who has been convicted of an offence that has caused serious harm, is a persistent offender or who represents a threat to national security."
        },
        {
            "text": "Commonwealth citizens and citizens of the Republic of Ireland, who were citizens before 1 January 1973 and then ordinarily resident in the United Kingdom and at the time of the decision to deport had for the last five years been ordinarily resident, are exempt from deportation."
        },
        {
            "text": "The Process"
        },
        {
            "text": "If a foreign national is convicted of a crime and the court sentences them to serve a prison sentence, the prison and probation service is required to inform the Home Office. The police also carry out checks for overseas criminal convictions on those who are arrested."
        },
        {
            "text": "The UK only ever returns those whom the Home Office – or when legal claims are raised, the courts – are satisfied do not need protection and have no legal basis to remain in the UK."
        },
        {
            "text": "Legal challenges"
        },
        {
            "text": "We have received criticism due to the low number of people that are returned on charter flights to some destinations. We always intend to ensure that the process of running charter flights is cost effective and aim to maximise capacity on the flights. However, we do see a large number of last-minute legal claims from those who are detained for these flights and to ensure that we are meeting our lawful obligations, we must ensure that we carefully consider those claims fully before removal."
        },
        {
            "text": "Where claims cannot be resolved in time for the flight’s departure this can act as a barrier to removal and the person will not be returned on that flight. If you wish to read more about the issues raised by people facing return in immigration detention you can find a Home Office report into this issue here."
        },
        {
            "text": "Those being returned are provided with the opportunity to raise claims, including claims that they have been victims of modern slavery and trafficking, prior to their return. All claims raised are fully considered and decided upon before return including, where applicable via the courts."
        },
        {
            "text": "All legal claims raised are fully considered and decided upon before return, first by the Home Office and then, if the individual is not satisfied with the decision and pursues a legal challenge or appeal, by the courts."
        },
        {
            "text": "Every person who meets the threshold for deportation is given access to legal advice and support and has an opportunity to challenge their removal through the legal system."
        },
        {
            "text": "A right of appeal to the First-Tier (Immigration and Asylum) Tribunal is available in most cases where the Home Office refuses a human rights or protection claim or where the individual’s protection status is revoked."
        },
        {
            "text": "When a person makes a claim against deportation under Article 8 (right to private and family life) of the European Convention on Human Rights, a range of factors are considered when assessing the public interest in deportation, in line with the Immigration Rules. The Immigration Rules state that where a person is liable to deportation the presumption shall be that the public interest requires deportation."
        },
        {
            "text": "In the case of those who have received a prison sentence of between 12 months and less than four years and claim private life the factors will include the length of time the individual has lived in the UK, as well as the strength of their social and cultural integration in the UK and very significant obstacles to integration in the destination country."
        },
        {
            "text": "Where the person has claimed family life in the UK, the Immigration Rules state deportation is in the public interest unless the person has a genuine and subsisting relationship with a qualifying partner, or a genuine and subsisting parental relationship with a qualifying child, and the effect of deportation on the partner or child would be unduly harsh."
        },
        {
            "text": "In cases where a person has been sentenced to a period of imprisonment of at least four years, they will need to demonstrate very compelling circumstances over and above these factors."
        },
        {
            "text": "Immigration Removal Centres"
        },
        {
            "text": "In most cases those awaiting removal will be detained in an Immigration Removal Centre."
        },
        {
            "text": "All individuals in Immigration Removal Centres are provided with a mobile phone and have access to landline telephones on request, fax machines, email and video calling facilities which can be used to contact legal advisers and family and friends."
        },
        {
            "text": "Additionally, face-to-face legal visits can be facilitated and, safe systems of work are in place to ensure the safety of detained individuals, onsite staff and visitors during these visits."
        },
        {
            "text": "Those detained are able to contact friends and family to arrange visits or to facilitate their personal belongings being delivered to them. If you want further information on this process you can find it here and here if you wish to know more about the management of property belonging to those who are detained."
        },
        {
            "text": "COVID-19"
        },
        {
            "text": "The COVID-19 pandemic has had an impact on returns. However, we have continued to remove individuals where flight routes are available."
        },
        {
            "text": "Throughout the COVID-19 pandemic, the Home Office has operated a range of measures in the immigration estate, to mitigate and manage the risk and spread of the virus. This was supported by the High Court, which in 2020 ruled that our approach to detention and COVID-19 was sensible and proportionate, with the appropriate precautionary measures in place.  We continue to take proactive steps to ensure that the immigration removal estate operates the most appropriate level of mitigations against COVID-19 in line with Government, UKHSA and Public Health Scotland guidance and maintains the health and welfare of both staff and residents."
        },
        {
            "text": "The safety of detained individuals and staff is of vital importance. The Home Office has robust contingency measures in place and basic hygiene has been enhanced.  We manage charter flight operations very carefully and only remove people when it is safe to do so. Public health guidance is adhered to on all removal flights."
        },
        {
            "text": "Re-integration support"
        },
        {
            "text": "We provide funding for returns to Jamaica; the Home Office supports two non-governmental organisations (NGOs) in Jamaica who provide re-integration support to those who are deported. They provide initial support to those who may not have anyone to meet them at the airport or who need transport. They are also able to help with short-term accommodation for those without a place to stay."
        },
        {
            "text": "In the longer term they can provide training, including recognised qualifications, to enable them to find employment and help with obtaining documentation. They can also provide emotional and wellbeing support to those who need it."
        },
        {
            "text": "Statistics"
        },
        {
            "text": "Our published statistics refer to enforced returns which include deportations, as well as cases where a person has breached UK immigration laws, and those removed under other administrative powers who have declined to leave voluntarily. Figures on deportations alone are not separately available. The top five countries we removed people to in year ending September 2020 and year ending September 2021 (latest published 12-month period) were:"
        },
        {
            "text": "Full published data on our returns figures can be found here: https://www.gov.uk/government/statistical-data-sets/returns-and-detention-datasets#returns"
        },
        {
            "text": "*As of 24 February 2022."
        }
    ]
}