{
    "url": "https://food.blog.gov.uk/2021/11/05/the-urgency-of-eco-labelling-in-light-of-cop26/",
    "title": "The urgency of eco-labelling in light of COP26",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2021-11-05T19:53:59+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Food Standards Agency Chief Scientist, Robin May, explains why urgent progress is needed on unified eco-labelling system for food in the UK as world leaders meet for COP26. Robin draws on learnings from our recent Healthy and Sustainable Diets consumer survey to explore consumer attitudes to sustainable food production. "
        },
        {
            "text": " "
        },
        {
            "text": "World leaders have already gathered in Glasgow to discuss a raft of strategies to tackle climate change, and as food is responsible for 26% of greenhouse gas emissions globally, you would hope this featured high up on the agenda."
        },
        {
            "text": "The way we grow, process and transport food is a major contributor to climate change, with food production as a whole accounting for more than a quarter of all greenhouse gas emissions. Reducing this will require dramatic changes in agriculture, manufacturing and transport. The food we buy is driven by a complex interplay between consumer demand, retail marketing and farm production, but who is responsible for driving change when it comes to sustainability?"
        },
        {
            "heading": 2,
            "text": "Sustainable production"
        },
        {
            "text": "At present, there are no internationally agreed standards for environmental sustainability labelling and no agreement on what ‘sustainable production’ should measure: carbon dioxide release, water use, biodiversity impact? Consequently, there is no easy way for consumers to make evidence-based purchasing decisions about the environmental impact of their diet."
        },
        {
            "text": "Our Healthy and Sustainable Diets survey has shown that 48% of people feel the responsibility for improving the environmental impact/sustainability of UK diets sits with ‘The Government’, and equally, 48% of those surveyed also indicated that ‘Those involved in food production or manufacturing’, have a part to play."
        },
        {
            "text": "Change is already underway; in the UK, three quarters of us rate sustainability as having a ‘Fairly’ or ‘Very’ important influence on the food we buy and 40% of people claim that they have changed, or attempted to change, their diet for environmental reasons since the onset of the COVID-19 pandemic."
        },
        {
            "text": "However, transforming the food system into one that is fully sustainable relies on a central premise – that the environmental footprint of foods is known. Then ‘Eco-labelling’ of foods would enable consumers to compare the environmental footprint of different foods and vote with their wallets. More importantly, eco-labelling would be a powerful driver of change in the food industry. Experience has already shown that mandatory nutritional labelling has helped incentivise companies to reformulate foods, bringing health benefits that go far beyond individual changes in consumer purchasing. Eco-labelling could achieve the same for environmental credentials and drive rapid improvements in food sustainability."
        },
        {
            "heading": 2,
            "text": "Consumer trust on eco-labelling"
        },
        {
            "text": "With no alignment on how we measure sustainability and so much information out there, how do consumers know where to place their trust? To set the food system on a path to sustainability, we need to urgently tackle this information vacuum. Doing so will require an unprecedented level of collaboration between business, academia and government, but comparable climate-driven collaborations are already underway in sectors such as transport and energy, and there is no reason that food should be different."
        },
        {
            "text": "With many large food businesses already developing their own ‘in-house’ sustainability labelling schemes, there is an even greater need for consistency to reduce the risk of misinformation and consumer confusion. If we act swiftly and decisively to create an overarching system underpinned by transparent, auditable metrics, we will be able to set the food system on the fast track to sustainability. Consumer choice would be enhanced, businesses incentivised to ensure sustainable production systems and food manufacturing encouraged to invest in innovative, carbon-neutral technologies."
        },
        {
            "text": "Creating such a system will not be easy, but there are valuable lessons that can be ‘recycled’ from aspects such as nutritional labelling, or even non-food sectors such as energy performance certification in housing."
        },
        {
            "heading": 2,
            "text": "Transparency in eco-labelling"
        },
        {
            "text": "The key underpinning principles must be trust and transparency. Dishonest labelling undermines confidence in the entire food system, so it is essential that sustainability labelling is not only accurate but also easily verifiable by both regulators and consumers. Particular challenges surround detection of mislabelling, since a ‘sustainable’ Braeburn apple looks identical to a non-sustainable one on the supermarket shelf. However, advances in biochemical analysis (for instance, detecting isotope patterns that are specific for certain regions or indicative of specific fertiliser use) are likely to catch up quickly as eco-labelling is rolled out."
        },
        {
            "text": "Such labelling must also be consistent across the sector. Comparing ‘three green stars out of five’ at Retailer X with ‘140 carbon miles’ at Retailer Y will spread confusion and risks jeopardising the entire concept. Developing a single system will require close coordination between businesses, an enhanced assurance capability for regulators and expert input from behavioural science to be sure that the end product is clearly and accurately understood by consumers. There is a golden opportunity now for businesses to work together with each other and the public sector in order to ‘get on the front foot’ – creating a coherent voluntary scheme that can be easily morphed into a mandatory one in due course."
        },
        {
            "heading": 2,
            "text": "The role of data"
        },
        {
            "text": "The complexity of the food system is daunting, and collating the data required for accurate sustainability labelling will not be trivial. In many cases, key data already exist, but need to be brought together. For instance, farmers and importers already know how much fuel they use to harvest or transport a crop. In other cases, we will need science and technology solutions to obtain new data; for instance, drone-based imaging to estimate carbon capture, or automatic gas analysis to monitor methane release by livestock. These technologies already exist, but are not a typical part of the farmer or food manufacturer’s arsenal of equipment."
        },
        {
            "text": "In some cases, new research is going to be needed: we have accurate data already on the carbon footprint of a UK dairy cow or a Danish pig, but far less about small-scale coffee plantations or organic tree nut harvesting, for instance. This is particularly true of new and emerging sustainable food types; comparing the sustainability credentials of Californian almond ‘milk’ with Devon dairy milk, or a lab-grown burger with a traditional beefburger, can only be done if both food types have a comprehensive data set attached to them."
        },
        {
            "heading": 2,
            "text": "A sustainability footprint"
        },
        {
            "text": "There are also tough, pragmatic decisions to be taken about where to stop and start. Most people would agree that the sustainability footprint of a cheese, for instance, should reflect the footprint of the cow that produced the milk, but what about the fertiliser that was used on the grass that the cow ate, or the transport footprint of the staff at the dairy?"
        },
        {
            "text": "And how should a sustainability labelling system incorporate factors that fluctuate over time? A pizza topping made in Cambridge might have a tiny footprint in the summer, using locally produced, field-grown tomatoes, but a far larger one in December when the tomatoes come from heated greenhouses in The Netherlands. Should the label be updated on a batch-by-batch basis?"
        },
        {
            "text": "Climate change is a global problem and needs global solutions. The UK is a recognised leader in food standards and has correspondingly high levels of consumer trust in the food system. This gives us the opportunity to lead the way in making food more sustainable too, but we must act now if we are to do so. None of the problems in the food system are insurmountable, but time is not on our side."
        },
        {
            "heading": 1,
            "text": "Yr angen brys i eco-labelu bwyd yng ngoleuni COP26"
        },
        {
            "text": "Mae Prif Wyddonydd yr Asiantaeth Safonau Bwyd (ASB), Robin May, yn esbonio pam mae angen cynnydd brys ar system eco-labelu unedig ar gyfer bwyd yn y Deyrnas Unedig (DU) wrth i arweinwyr y byd gwrdd ar gyfer COP26. Mae Robin yn tynnu ar wybodaeth o'n harolwg defnyddwyr Deietau Iach a Chynaliadwy diweddar i archwilio agweddau defnyddwyr at gynhyrchu bwyd yn gynaliadwy."
        },
        {
            "text": " "
        },
        {
            "text": "Mae arweinwyr y byd eisoes wedi ymgynnull yn Glasgow i drafod llu o strategaethau i fynd i'r afael â newid yn yr hinsawdd, a gan fod bwyd yn gyfrifol am 26% o allyriadau nwyon tŷ gwydr yn fyd-eang, y gobaith fyddai bod hyn yn uchel ar yr agenda."
        },
        {
            "text": "Mae'r ffordd yr ydym ni’n tyfu, prosesu a chludo bwyd yn cyfrannu'n helaeth at newid yn yr hinsawdd, gyda chynhyrchu bwyd yn ei gyfanrwydd yn cyfrif am fwy na chwarter yr holl allyriadau nwyon tŷ gwydr. Er mwyn lleihau hyn, bydd angen newidiadau dramatig yn y meysydd amaethyddiaeth, gweithgynhyrchu a thrafnidiaeth. Mae'r bwyd rydym ni'n ei brynu yn cael ei yrru gan gydadwaith cymhleth rhwng galw defnyddwyr, marchnata manwerthu a ffermydd cynhyrchu. Ond pwy sy'n gyfrifol am yrru newid o ran cynaliadwyedd?"
        },
        {
            "heading": 2,
            "text": "Cynhyrchu’n gynaliadwy"
        },
        {
            "text": "Ar hyn o bryd, nid oes unrhyw safonau y cytunwyd arnynt yn rhyngwladol ar gyfer labelu cynaliadwyedd amgylcheddol, na chytundeb ar yr hyn y dylai ‘cynhyrchu cynaliadwy’ ei fesur: rhyddhau carbon deuocsid, defnyddio dŵr, effaith bioamrywiaeth? O ganlyniad, nid oes ffordd hawdd i ddefnyddwyr wneud penderfyniadau prynu ar sail tystiolaeth o ran effaith amgylcheddol eu deiet."
        },
        {
            "text": "Mae ein harolwg 'Deietau Iach a Chynaliadwy' wedi dangos bod 48% o bobl yn teimlo mai cyfrifoldeb y ‘Llywodraeth’ yw gwella effaith amgylcheddol/cynaliadwyedd deietau'r DU. Yn yr un modd, nododd 48% o'r ymatebwyr hefyd fod 'Y rheiny sy’n ymwneud â chynhyrchu neu weithgynhyrchu bwyd', â rhan i’w chwarae."
        },
        {
            "text": "Mae newid eisoes ar y gweill; yn y DU, mae tri chwarter ohonom yn ystyried bod gan gynaliadwyedd ddylanwad ‘Eithaf pwysig’ neu ‘Bwysig iawn’ ar y bwyd a brynwn ac mae 40% o bobl yn honni eu bod wedi newid, neu wedi ceisio newid, eu deiet am resymau amgylcheddol ers dechrau pandemig COVID-19."
        },
        {
            "text": "Fodd bynnag, mae trawsnewid y system fwyd yn un sy'n gwbl gynaliadwy yn dibynnu ar gysyniad canolog – bod ôl troed amgylcheddol bwyd yn hysbys. Yna, byddai 'eco-labelu' bwydydd yn galluogi defnyddwyr i gymharu ôl troed amgylcheddol gwahanol fwydydd a mynegi eu barn trwy weithredoedd. Yn bwysicach fyth, byddai eco-labelu yn sbardun pwerus i newid y diwydiant bwyd. Mae profiad eisoes wedi dangos bod labelu maeth gorfodol wedi helpu wrth gymell cwmnïau i ailfformiwleiddio bwydydd, gan gynnig manteision iechyd sy'n mynd ymhell y tu hwnt i newidiadau unigol i arferion prynu defnyddwyr. Gallai eco-labelu gyflawni'r un peth ar gyfer cyflawniad amgylcheddol a sbarduno gwelliannau cyflym o ran cynaliadwyedd bwyd."
        },
        {
            "heading": 2,
            "text": "Ymddiriedaeth defnyddwyr ar eco-labelu"
        },
        {
            "text": "Fodd bynnag, heb unrhyw aliniad o ran y ffordd yr ydym yn mesur cynaliadwyedd, ac am fod cymaint o wybodaeth ar gael, sut mae defnyddwyr yn gwybod beth i ymddiried? Rhaid mynd i'r afael â'r diffyg gwybodaeth hwn ar frys os ydym ni am osod y system fwyd ar y llwybr cywir o ran cynaliadwyedd. Bydd gwneud hynny yn gofyn am lefel ddigynsail o gydweithredu rhwng busnesau, y byd academaidd a'r llywodraeth. Mae cydweithrediadau tebyg sy'n cael eu gyrru gan yr hinsawdd eisoes ar y gweill mewn sectorau fel trafnidiaeth ac ynni, ac nid oes unrhyw reswm y dylai bwyd fod yn wahanol."
        },
        {
            "text": "Gyda llawer o fusnesau bwyd mawr eisoes yn datblygu eu cynlluniau labelu cynaliadwyedd ‘mewnol’ eu hunain, mae’r galw am gysondeb i leihau'r risg o wybodaeth anghywir a dryswch ymysg defnyddwyr yn fwy nag erioed. Os byddwn ni’n gweithredu’n gyflym ac yn bendant i greu system gynhwysfawr wedi'i seilio ar fetrigau tryloyw y gellir eu harchwilio, byddwn yn gallu gosod y system fwyd ar y llwybr cywir o ran cynaliadwyedd. Byddai dewis defnyddwyr yn cynyddu, busnesau'n cael eu cymell i sicrhau systemau cynhyrchu cynaliadwy, a byddai’r maes gweithgynhyrchu bwyd yn cael eu hannog i fuddsoddi mewn technolegau arloesol, carbon-niwtral."
        },
        {
            "text": "Ni fydd yn hawdd creu system o'r fath, ond mae gwersi gwerthfawr y gellir eu ‘hail-ddefnyddio’ o agweddau fel labelu maeth, neu hyd yn oed sectorau nad ydynt yn ymwneud â bwyd fel ardystio perfformiad ynni mewn tai."
        },
        {
            "heading": 2,
            "text": "Tryloywder eco-labelu"
        },
        {
            "text": "Rhaid mai ymddiriedaeth a thryloywder fydd y prif egwyddorion sylfaenol. Mae labelu anonest yn tanseilio hyder yn y system fwyd gyfan, felly mae'n hanfodol bod labelu cynaliadwyedd nid yn unig yn gywir ond hefyd yn hawdd ei wirio gan reoleiddwyr a defnyddwyr. Mae heriau penodol yn ymwneud â chanfod cam-labelu, gan fod afal Braeburn 'cynaliadwy' yn edrych yn union yr un fath ag un nad yw'n gynaliadwy ar silff yr archfarchnad. Fodd bynnag, mae’r maes dadansoddi biocemegol (er enghraifft, canfod patrymau isotop sy'n benodol ar gyfer rhai rhanbarthau neu'n arwydd o ddefnydd gwrtaith penodol) yn debygol o ddatblygu’n gyflym wrth gyflwyno eco-labelu."
        },
        {
            "text": "Rhaid i labelu o'r fath hefyd fod yn gyson ar draws y sector. Bydd cymharu 'tair seren werdd allan o bump' ar gyfer Manwerthwr X â '140 milltir carbon' ar gyfer Manwerthwr Y yn achosi dryswch ac yn peryglu'r cysyniad cyfan. Bydd datblygu un system yn gofyn am gydlynu agos rhwng busnesau, gallu sicrwydd gwell i reoleiddwyr a mewnbwn gwyddor ymddygiadol arbenigol i sicrhau bod defnyddwyr yn deall y cynnyrch terfynol yn glir ac yn gywir. Mae cyfle euraidd nawr i fusnesau weithio gyda'i gilydd a'r sector cyhoeddus er mwyn ‘bod ar flaen y gad’ – gan greu cynllun gwirfoddol cydlynol y gellir ei gorffori'n hawdd i un gorfodol maes o law."
        },
        {
            "heading": 2,
            "text": "Rôl data"
        },
        {
            "text": "Mae cymhlethdod y system fwyd yn frawychus, ac ni fydd casglu'r data sy'n ofynnol ar gyfer labelu cynaliadwyedd cywir yn ddibwys. Mewn llawer o achosion, mae data allweddol yn bodoli eisoes, ond mae angen dod â’r data at ei gilydd. Er enghraifft, mae ffermwyr a mewnforwyr eisoes yn gwybod faint o danwydd maen nhw'n ei ddefnyddio i gynaeafu neu gludo cnwd. Mewn achosion eraill, bydd angen atebion gwyddoniaeth a thechnoleg arnom i gael data newydd; er enghraifft, defnyddio delweddau drôn i amcangyfrif dal carbon, neu ddadansoddiad nwy awtomatig i fonitro gollyngiadau methan gan dda byw. Mae'r technolegau hyn eisoes yn bodoli, ond nid ydynt yn rhan nodweddiadol o offer y ffermwr neu'r gwneuthurwr bwyd."
        },
        {
            "text": "Mewn rhai achosion, bydd angen ymchwil newydd: mae eisoes gennym ni ddata cywir ar ôl troed carbon buwch laeth y DU neu fochyn o Ddenmarc, ond llawer llai am blanhigfeydd coffi ar raddfa fach neu gynaeafu cnau coed organig, er enghraifft. Mae hyn yn arbennig o wir am fathau newydd o fwyd cynaliadwy sy'n dod i'r amlwg; dim ond os oes set ddata gynhwysfawr ynghlwm wrthynt y gellir cymharu cymwysterau cynaliadwyedd 'llaeth' almon Califfornia â llaeth o fferm laeth yn Nyfnaint, neu fyrgyr wedi'i dyfu mewn labordy â byrgyr cig eidion traddodiadol."
        },
        {
            "heading": 2,
            "text": "Ôl-troed cynaliadwyedd"
        },
        {
            "text": "Mae yna hefyd benderfyniadau pragmatig anodd i'w gwneud o ran ble i stopio a dechrau. Byddai'r mwyafrif o bobl yn cytuno y dylai ôl troed cynaliadwyedd caws, er enghraifft, ystyried ôl troed y fuwch a gynhyrchodd y llaeth, ond beth am y gwrtaith a ddefnyddiwyd ar y glaswellt yr oedd y fuwch yn ei fwyta, neu ôl troed teithio'r staff yn y llaethdy? A sut ddylai system labelu cynaliadwyedd ymgorffori ffactorau sy'n amrywio dros amser?"
        },
        {
            "text": "Efallai y bydd gan dopin pizza a wneir yng Nghaergrawnt ôl troed bach yn yr haf, gan ddefnyddio tomatos lleol, wedi'u tyfu mewn caeau, ond un llawer mwy ym mis Rhagfyr pan ddaw'r tomatos o dai gwydr wedi'u cynhesu yn yr Iseldiroedd. A ddylid diweddaru'r label ar sail swp-wrth-swp (batch-by-batch)?"
        },
        {
            "text": "Mae newid yn yr hinsawdd yn broblem fyd-eang ac mae angen atebion byd-eang. Mae'r DU yn arweinydd cydnabyddedig o ran safonau bwyd ac mae ganddo lefelau uchel o ymddiriedaeth defnyddwyr yn y system fwyd. Mae hyn yn rhoi cyfle i ni arwain y ffordd wrth wneud bwyd yn fwy cynaliadwy hefyd, ond rhaid i ni weithredu nawr os ydym ni am wneud hynny. Nid yw un o’r problemau yn y system fwyd yn rhy fawr i’w datrys, ond mae amser yn ein herbyn."
        }
    ]
}