{
    "url": "https://designnotes.blog.gov.uk/2025/12/09/bringing-together-international-public-designers-in-amsterdam-berlin-and-brussels/",
    "title": "Bringing together international public designers in Amsterdam, Berlin and Brussels",
    "authors": [
        "Kara Kane – Head of Design for Test, Learn and Grow, Cabinet Office",
        "Martin Jordan – Head of Design and User Research, German government’s Digital Service",
        "Viktoria Westphalen – Content Designer, HMCTS"
    ],
    "categories": [
        "Community",
        "International"
    ],
    "pub_date": "2025-12-09T09:00:00+00:00",
    "content": [
        {
            "text": "In 2024, the International Design in Government Community returned to in-person conferences after a 5-year pandemic-related break. This year, we've hosted our biggest event since 2019, bringing together hundreds of public sector designers from across the globe. With exciting plans for further events in 2026, here's an update on what's happened recently and what's coming up next."
        },
        {
            "heading": 2,
            "text": "Gathering in the Netherlands, re-connecting with the User Needs First community"
        },
        {
            "text": "In autumn 2019, we teamed up with our Dutch colleagues for the first time. Their national User Needs First community (Gebruiker Centraal in Dutch) brings together user-centred designers from across the Netherlands and all levels of government. For their 10th anniversary this year, they extended their annual conference to include our International Design in Government community."
        },
        {
            "text": "From 9 to 11 April 2025, hundreds of members of our global community went to Amsterdam for the User Needs First International Conference. Over 700 participants gathered for talks, workshops, discussions, excursions, and some special experiences."
        },
        {
            "text": "The first day of the conference was exclusive to the International  community. We (Kara and Martin) led a keynote on Protecting our practice to start the day. In a time of shifting priorities and roles for user-centred digital teams in government, it felt important to acknowledge how to design longevity into our practices so that they endure. The rest of the day was spent on excursions around Amsterdam and Rotterdam. In small groups we went on visits to: City of Amsterdam, Netherlands Police, Ministry of the Interior and Kingdom Relations, City of Rotterdam and Novum, the Innovation Lab of the SVB (Social Insurance Bank)."
        },
        {
            "text": "The next two days of the conference were full of learning, sharing, and reflecting on the state of design and digital in the public service – now that we are established, how do we ensure we’re working on the right things for the right impact?  "
        },
        {
            "text": "We managed to record 6 of the over 40 talks at the conference. The recordings are available through a public video playlist. The playlist includes a keynote talk from Richard Pope, who spoke about the next-generation of public services. It also includes an update on the ongoing work on global service design patterns, led by UK-based designers. "
        },
        {
            "text": "These international exchanges continue to strengthen design practice in UK government. Insights from the Netherlands on embedding user research in policy development, and Germany's approach to digital-ready legislation, are informing how UK teams work across departmental boundaries. The connections made at these events also support UK civil servants in accessing peer support and shared resources when tackling similar challenges."
        },
        {
            "heading": 2,
            "text": "Creating content with the community"
        },
        {
            "text": "Ahead of the conference, we once again invited members of our community to co-create a new printed edition of the Service Gazette - a community-led publication showcasing design work from across the public sector. We created the first issue for the London conference in 2018 and most recently one for the Helsinki conference in 2024."
        },
        {
            "text": "Practitioners from 7 countries and regions contributed to the newspaper, including the European Union, Germany, Ireland, the Netherlands, Singapore, the United Kingdom and the United States. In the cover story, Hillary Hartley, co-founder of the US digital unit 18F and former Deputy Minister of the Ontario Public Service in Canada, reflects on digital service resilience and what endures when government innovation units close."
        },
        {
            "text": "The articles are all openly published online on Medium."
        },
        {
            "text": "During the conference, community members also co-created content on site. Our Dutch colleagues facilitated the recording of the 'User Needs First Across Borders' podcast. In two episodes (available on the Gebruiker Centraal website), user-centred designers from Denmark, Germany, Italy, the Netherlands, and the UK discuss the themes 'Learning from others' and 'Design in policy'."
        },
        {
            "text": "Equipped with more great content than time during the event, the conference organisers decided to run a post-conference webinar a few weeks later. We helped with running it. Through 3 talks, the 90-minute session offered practical insights into user-centered design in justice and public services. Presenters from Thailand, Germany, the Netherlands and the UK shared their work on prison, legal data and housing services.A recording and a writeup of the webinar is available online. There is also a writeup of the key takeaways from the 3 day conference. "
        },
        {
            "heading": 2,
            "text": "Meeting with creative bureaucrats and discussing design for policy"
        },
        {
            "text": "In early June, about 2,000 public servants gathered in Berlin again for the annual Creative Bureaucracy Festival. Together with various community members, we have participated in the festival since 2019. This year’s many sessions included a vivid discussion on why community matters in government. "
        },
        {
            "text": "The day after the festival, we partnered with the European Commission’s Policy Lab and ran a workshop hosted by the German government’s Digital Service. We looked at different approaches on design for policy. From the EU’s Policy Lab, we heard about the dynamic effects of design on policymaking culture in the union. German colleagues shared their approach to digital-ready legislation, and the Head of Policy & Service Design from Camden Council, Alejandra Diaz, shared what designing policy with communities looks like."
        },
        {
            "text": "In subsequent breakout discussions, we looked at different degrees of involvement of designers along the policy cycle, from the stage of identifying the policy need over formulating policy to evaluating policy outcomes. We wanted to hear and share what community members do today and where barriers are to getting involved in other stages of the policy cycle. We shared approaches, failures and hopes. Collectively, we recognised that some of us are involved in short-term lawmaking, others in long-term policy theme exploration. Contexts and setups differ vastly."
        },
        {
            "heading": 2,
            "text": "What’s next for the community"
        },
        {
            "text": "Several international colleagues have been approaching us to learn about future in-person events. There seems to be a desire for gathering once a year. Community members from multiple continents are currently exploring how they can run smaller and larger events in 2026. You can subscribe to the blog to receive updates."
        },
        {
            "text": "PolyFutures, Reimagining Policymaking for Europe"
        },
        {
            "text": "In April 2026, the EU Policy Lab team are running PolyFutures, an invitation based conference in Brussels to bring together a community of researchers, designers and foresight experts for exchange and exploration on participation, creative and future-oriented policymaking. We will collaborate with them again on a design for policy session."
        },
        {
            "text": "Nordic Baltic community "
        },
        {
            "text": "Established earlier this year, the Nordic Baltic Design in Government community comes together once a month to share, learn and relate. Only those working in the region can join. Follow the community on LinkedIn and become a member by sending the organisers a message."
        },
        {
            "text": "Community calls"
        },
        {
            "text": "For early 2026, we have prepared topics for further community calls. Upcoming themes include designing for AI, developing service patterns, designing for life events and designing public transportation."
        }
    ]
}