{
    "url": "https://despatch.blog.gov.uk/2025/12/09/changes-to-booking-system-understanding-views-and-how-these-inform-the-planned-changes/",
    "title": "Changes to booking system – understanding views and how these inform the planned changes",
    "authors": [
        "Christian Oreschnick"
    ],
    "categories": [
        "Driving test",
        "Feature",
        "Learning to drive"
    ],
    "pub_date": "2025-12-09T09:12:57+00:00",
    "content": [
        {
            "text": "My name is Christian Oreschnick. I've recently become the service development lead in learn to drive/ride and it's my job to work with others in the agency to improve the service we offer you. You can find out more about my background in my bio."
        },
        {
            "text": "Last week Pauline Reeves (DVSA’s Director of Driver Services) explained some of the factors that helped inform ours and the ministers' decision-making when announcing the outcome of the driving test consultation. "
        },
        {
            "text": "She also explained how we are taking a more service-led approach to managing our’ services."
        },
        {
            "heading": 3,
            "text": "Publishing the full consultation report"
        },
        {
            "text": "Today (Tuesday, 9 December) we have published the full results of our consultation on improving the rules for booking a driving test. "
        },
        {
            "text": "I want to thank the 11,000 approved driving instructors (ADI) who responded to the consultation, alongside learners, parents, and other stakeholders. The expertise held by the driver training industry is key to getting the right decisions from the consultation. "
        },
        {
            "text": "I want to reassure you that we reviewed responses by audience group – learners, ADIs, driving schools, parents – and considered the reasoning behind views, not just numbers. "
        },
        {
            "text": "The outcomes have already been announced, but I know those of you who book and manage tests for your pupils will be looking for answers and clarity to help you, your business and customers prepare. I want to reassure you we will keep you updated on this work and are committed to supporting you with the introduction of these changes. "
        },
        {
            "text": "We understand you will need time to prepare, and we will continue working with representatives from our driver training forum (NASP, AA driving school and RED) to make sure we get our engagement right and provide the guidance and support you need. "
        },
        {
            "text": "We know that these changes will require instructors and driving schools to adapt how they work with their pupils, which is why we wrote to you recently to explain the consultation process.  "
        },
        {
            "text": "We are committed to working closely with the driver training industry and representative bodies to help prepare for the implementation of these changes. "
        },
        {
            "heading": 3,
            "text": "The direction has been set"
        },
        {
            "text": "Before getting into details I wanted to reaffirm one important point: the decisions have been made using the views and feedback gathered from the consultation."
        },
        {
            "text": "We know that those who wanted a different outcome will be disappointed. However, we think these changes will improve how driving tests are booked and stop learner drivers being exploited by the small number of people gaming the system."
        },
        {
            "text": "We recognise these changes will impact some business models, particularly those who offer intensive courses and have built their services around managing the booking process for pupils and customers.  "
        },
        {
            "text": "I want you to know we hear your concerns about the economic implications and the impact these changes will have on business models. We are working with the industry to develop a pupil toolkit and guidance to support you and your pupils to prepare for these changes."
        },
        {
            "heading": 3,
            "text": "Restricting who can book and manage tests"
        },
        {
            "text": "The first question was about who can book and manage driving tests, with 3 options: "
        },
        {
            "text": "A. Only learner drivers can book and manage tests "
        },
        {
            "text": "B. Both learners and instructors can book, but only learners can make changes "
        },
        {
            "text": "C. Keep the current system "
        },
        {
            "heading": 3,
            "text": "What you told us"
        },
        {
            "text": "The majority of people who responded agreed we should introduce option A – 70.7% overall, including almost half of the driving instructors who provided their views. "
        },
        {
            "text": "For option C, 54.6% of ADIs and 69.8% of driving schools who responded agreed and wanted to keep the current system. "
        },
        {
            "text": "The table below shows the level of agreement from the main audiences for options A, B and C of this question."
        },
        {
            "heading": 3,
            "text": "What we're changing"
        },
        {
            "text": "We will introduce option A. "
        },
        {
            "text": "This will restrict the booking and management of practical car driving tests to learner drivers only, meaning third parties, including driving instructors will no longer be able to book or manage tests on behalf of pupils. "
        },
        {
            "heading": 3,
            "text": "Why this option was chosen"
        },
        {
            "text": "One of our main objectives is to make the booking system fairer. This measure ensures learner drivers can book their test at the prescribed fee, as third parties will no longer be able to book tests to resell at inflated costs. Crucially, this change will disrupt cancellation finding services from scanning the system to book tests ahead of learner drivers. This will make the booking system fairer for all."
        },
        {
            "text": "This decision is not about instructor conduct or blaming you or customers for long waiting times. We know the vast majority of you who use the online business service (OBS) do so legitimately to provide an excellent service to your pupils. When the change comes into force, ADIs will still be able to use OBS to show when they are available for tests. "
        },
        {
            "text": "You will still be able to access the Ready to Pass? resources to support difficult conversations with pupils who want to take a test when you don't think they're ready. We will support you where you use reasonable judgement to decide that a learner is not ready to take their test and refuse to take them in their car. "
        },
        {
            "text": "We will continue to do work through the Ready to Pass? campaign to encourage learner drivers to be guided by their driving instructor on when they are ready for test. "
        },
        {
            "text": "Until the changes come in, ADIs can still book tests for their pupils, and we will give plenty of notice ahead of the change. "
        },
        {
            "text": "The consultation found that having control over their own booking is important to learner drivers. This measure will give them this control, whilst ADIs continue to play their crucial role in advising learners when they're ready. "
        },
        {
            "text": "We're aware some learners will need support to book tests, particularly those with accessibility requirements or learning difficulties. We're working through the details to ensure no one is disadvantaged, and we'll discuss practical solutions with you ahead of implementation. "
        },
        {
            "heading": 3,
            "text": "Limiting test swaps and location changes"
        },
        {
            "text": "The second question was about test management, with 3 options: "
        },
        {
            "text": "A. Remove the ability to swap tests or change test locations "
        },
        {
            "text": "B. Limit test swaps and location changes to 2 and limit the location of swaps "
        },
        {
            "text": "C. Keep current swapping rules and location change rules "
        },
        {
            "heading": 3,
            "text": "What you told us"
        },
        {
            "text": "Responses were mixed. A slightly higher proportion of respondents overall preferred to keep the current rules. However, a higher proportion of learner drivers and driving instructors – those most affected by the test booking system – favoured option 2B. "
        },
        {
            "text": "The table below shows the level of agreement from the main audiences for options A, B and C of this question."
        },
        {
            "heading": 3,
            "text": "What we're doing"
        },
        {
            "text": "We will introduce option B. "
        },
        {
            "text": "This will limit the number of times a test can be swapped or changed to 2 and restrict the locations booked tests can be moved to. "
        },
        {
            "heading": 3,
            "text": "Why this option was chosen"
        },
        {
            "text": "Choosing option B offers a balance between allowing learners the flexibility to make changes to their test booking whilst creating a fairer system. "
        },
        {
            "text": "This change will help stop unfair practices by a small number of OBS users who exploit existing rules to exploit learner drivers. A small proportion of ADIs, in their call for evidence responses, confirmed they're not using the swap feature for its intended purpose: 0.3% admitted to using it to resell tests and 8.1% admitted to using it to hold potential test dates. "
        },
        {
            "text": "Introducing a geographical restriction will stop tests being booked at a test centre with lower demand and then moved to a higher demand centre using a third party. This change will help reduce waiting times at lower demand centres but will make it more challenging for learner driver in high demand areas to book a test. "
        },
        {
            "text": "Having a clearer view on which areas have high and low demand will make it easier for DVSA to manage its examiner workforce and focus resource at higher demand centres. This will help us offer more tests at centres where demand is highest whilst still meeting demand at other centres. "
        },
        {
            "text": "We are still working through the detail on how these geographic restrictions will work from a technical and process perspective and will share regular updates with you as we progress. "
        },
        {
            "heading": 3,
            "text": "Next steps"
        },
        {
            "text": "We know we need to work quickly to introduce these changes to the current booking system from spring 2026. So, we don’t yet have answers to all of your questions about how this will work. As soon as we have the detail around this, we will share it with you."
        },
        {
            "text": "These changes will be replicated in the new booking system, which is currently being developed. "
        },
        {
            "text": "We will also need legislative changes which will be implemented in the spring in line with the technical changes.  "
        },
        {
            "text": "We will keep you updated and give you as much notice as possible before the changes come into effect. In the new year we'll invite you to webinars so we can update you about the progress on the upcoming changes. "
        },
        {
            "text": "Thank you to everyone who took the time to respond to this consultation. Your views have been essential to help inform and design our modern service that helps provide a safer, fairer experience for all learners and instructors. "
        }
    ]
}