{
    "url": "https://marinedevelopments.blog.gov.uk/2025/12/09/coastal-planners-corner-2/",
    "title": "Coastal Planners corner",
    "authors": [
        "Kathleen Telford, Marine Planner",
        "Mark Maguire, Coastal Planner",
        "Char Lewis, Marine Planner",
        "Marie Canny, Coastal Planner",
        "Eva Turley, Coastal Planner",
        "Mae van Loaf, Coastal Marine Planner (South West)",
        "Ellie Hoad, Coastal Marine Planner",
        "Chloe Boyle, Coastal Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-12-09T11:37:33+00:00",
    "content": [
        {
            "text": "Our Coastal Planners have been working with partners, attending key events, and supporting projects that strengthen collaboration and ensure England’s seas are managed sustainably."
        },
        {
            "text": "North East"
        },
        {
            "text": "In between developing the Heritage Assets and Employment policies for the revised East Marine Plan and reviewing comments received through our engagement that are helping shape our approach. Katheen has met with stakeholders in the North East including Berwick harbour and project leaders at the Durham Heritage Coast Annual Forum who have shared their passion for their sectors that has been inspiring."
        },
        {
            "text": "Kathleen has also learned more about the area’s heritage during a site visit to Seaham Harbour, seeing first-hand the cargo arriving at the port and the skills required for vessels to manoeuvre though the harbour entrance on a busy day."
        },
        {
            "text": "As part of our efforts to better align marine and terrestrial planning, Kathleen also delivered a presentation to the North East Royal Town Planning Institute (RTPI), which generated many questions, and was pleased to be supported by a senior colleague during the session."
        },
        {
            "text": "These valuable conversations and site visits continue to inform our work as we progress the revised East Marine Plan."
        },
        {
            "text": "East"
        },
        {
            "text": "Marks work in the East has been focused on policy development alongside meetings with Local Nature Partnerships. Earlier in the quarter, Mark assisted with the East Marine Plan development sessions which provided local stakeholder insight to the next stage of the marine planning cycle. Mark has also been contributing to the development of the EastME conference, whilst attending regular BAU meetings."
        },
        {
            "text": "South East"
        },
        {
            "text": "Like other marine planners, Marie has been focused on stakeholder engagement and subsequent policy development for the replacement of the East Marine Plan. Marie was part of the team that delivered in-person workshops along the East coast in Norwich, King’s Lynn and Hull during September. Local stakeholders had the opportunity to hear about the progress on the plan so far and provide feedback on draft policies and key themes. Stakeholders shared their knowledge and understanding of the east marine plan areas and provided their valuable unique insights. Understanding stakeholder views is essential to creating a well-informed and balanced plan. This feedback was then integrated into the next phase of policy drafting. You can read the summary report for all of the recent East engagement here."
        },
        {
            "text": "Marie delivered a Marine Spatial Planning (MSP) Challenge session with Paul Gilliland as part of The UK Partnering for Accelerated Climate Transitions (UK PACT) programme, jointly funded and governed by The Foreign, Commonwealth and Development Office (FCDO) and The Department for Energy Security and Net Zero (DESNZ). The programme hosted a visit from a Philippine delegation, primarily Government representatives, to share knowledge and best practices on marine spatial planning and governance. The visit convened key government counterparts together with UK experts to widen their knowledge base on marine planning in terms of regulation, co-implementation and monitoring. We learnt that the Philippine planning and process for offshore wind development has many parallels to the UK."
        },
        {
            "text": "South"
        },
        {
            "text": "Eva has attended meetings such as the Dorset LNP and Dorset catchment partnership and the South West Coastal Group meetings. These meetings allow us to keep up to date with what is happening in the south marine area as well as engage with stakeholders about the South Marine Plan and any issues that may arise."
        },
        {
            "text": "Eva also travelled to the East to assist with the East Marine Plan development workshops in Norwich and Kings Lynn, and it was great to engage with stakeholders and hear their opinions on policies and their development."
        },
        {
            "text": "Jamie Thorpe joined Eva to facilitate a marine spatial planning challenge with some MSc students in Portsmouth University. The group found it useful to have an interactive element to their learning experience and saw how relatable the session was to their studies."
        },
        {
            "text": "South West"
        },
        {
            "text": "This month, Ellie travelled to Ilfracombe to spend a day shadowing local marine officers along the coast and attend the Lundy Marine Protected Area (MPA) Advisory Group meeting."
        },
        {
            "text": "As our first time participating in the Lundy MPA Advisory Group, the meeting offered valuable insights into the island’s management. Local rangers shared updates on seal disturbance and biosecurity measures, as well as biodiversity census results for seabirds and seals. Meetings like these provide important opportunities to understand regional issues, explore ongoing coastal initiatives, and strengthen networks with key stakeholders."
        },
        {
            "text": "To foster collaboration and joined up working across MMO teams, we actively support shadowing opportunities. During Ellie’s visit, she accompanied marine officers to the harbour master’s office and observed a Band 1 licence inspection. This experience highlighted the reactive nature of the work of the operations team in the MMO and the challenges they face on the ground. It also brought to life the applications of marine plans and policies."
        },
        {
            "text": "North West"
        },
        {
            "text": "In October Chloe and a colleague from the evidence and evaluation team delivered a presentation at the Coastal Partnership Network (CPN) conference in Liverpool. The CPN provide support for collaboration work across the UK coastline, connecting Coastal, Estuary & Marine Partnerships and similar initiatives. For more information on the CPN conference and our involvement, you will find a designated article on this newsletter, or you can access it on the Marine Developments Blog."
        }
    ]
}