{
    "url": "https://defrafmp.blog.gov.uk/2025/12/09/mmo-publishes-bass-authorisation-review-report/",
    "title": "MMO publishes bass authorisation review report",
    "authors": [
        "Fisheries Management Team, Marine Management Organisation"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-12-09T15:00:00+00:00",
    "content": [
        {
            "text": "In June 2025, the Bass Management Group (BMG) highlighted that a task-and-finish group was reviewing the system for authorising commercial fishing vessels to land bass in England."
        },
        {
            "text": "This review was guided by goal 2 of the bass fisheries management plan (FMP) which is around fair access to the bass fishery, while prioritising stock sustainability."
        },
        {
            "heading": 2,
            "text": "The review"
        },
        {
            "text": "The Marine Management Organisation (MMO) led the review with help from a group of commercial and recreational fishermen, regulators and environmental groups. They met over multiple meetings and gathered views from nearly 300 stakeholders at 20 coastal events."
        },
        {
            "heading": 2,
            "text": "Current rules"
        },
        {
            "text": "The bass fishery is important for many people - from commercial fishermen to those who enjoy fishing for fun. To keep bass stocks healthy, rules were introduced after years of poor recruitment (the number of juveniles that join the adult stock in any given year) and heavy fishing. These include:"
        },
        {
            "heading": 2,
            "text": "Recommendations"
        },
        {
            "text": "The review produced 24 recommendations to help with the long-term health of the fishery."
        },
        {
            "text": "Key proposals include:"
        },
        {
            "heading": 2,
            "text": "What happens next?"
        },
        {
            "text": "It's important to be clear that these are recommendations and not final decisions. Defra and the BMG will now look at the evidence, consult further, and assess impacts before any changes are made."
        },
        {
            "heading": 2,
            "text": "Reports and helpful products"
        },
        {
            "text": "Find a report of the review on GOV.UK. An infographic and video summarising the report are below."
        }
    ]
}