{
    "url": "https://openpolicy.blog.gov.uk/2025/12/09/serious-games-to-support-organisation-design/",
    "title": "Serious games to support organisation design",
    "authors": [
        "prateekbuch"
    ],
    "categories": [
        "Policy Lab",
        "Projects",
        "Serious Games"
    ],
    "pub_date": "2025-12-09T08:59:02+01:00",
    "content": [
        {
            "text": "In 2022 Policy Lab proposed eleven experimental methods for policy design. One of those methods was ‘serious games’. Over the past three years, we have tested, developed and deployed serious games as interactive tools that allow people to model and test different scenarios either collaboratively or in competition, through different rules that govern how players interact with each other. In this post we share how Policy Lab used serious games to support more intentional and collaborative thinking in the process of designing public institutions and the teams that sit within them."
        },
        {
            "heading": 2,
            "text": "Why serious games? Challenges in public sector organisation design"
        },
        {
            "text": "Organisation design is a field of design that focuses on aligning an organisation’s structure and processes with its strategy. Organisation design and development (OD&D) practitioners in government coach public bodies through meaningful conversations that explore ways of improving the way they are organised to better meet their specific operational and strategic contexts."
        },
        {
            "text": "Policy Lab set out to augment the toolkit available to OD&D practitioners by introducing novel approaches to decision-making. Our commissioners – the Civil Service Organisation Development Practice (ODP) team in the Government People Group – sought to focus on working better with spans (the number of people line managed by an individual) and layers (the number of structural layers in the organisation) at different levels of the UK Civil Service as part of good organisation design. Improving the design of government departments matters because it helps them deliver better outcomes for the public."
        },
        {
            "text": "We began by researching barriers and opportunities to optimising the spans and layers in government organisations. We heard from a cross-government working group on OD&D and interviewed eight experts from within and outside the Civil Service. We also analysed published literature and internal departmental reviews of how spans and layers are considered when designing and re-designing teams."
        },
        {
            "text": "Research participants told us that a number of things held them back from taking timely, intentional decisions on organisation design. This included the speed of decision-making and having to react to changing circumstances, which makes it hard to take a holistic view of their organisation. We heard that organisational design decisions were therefore often tactical rather than intentional."
        },
        {
            "text": "Our research participants told us that a game or tool that helped them be more intentional, and test different scenarios, would help. We also found that whilst spans and layers are crucial lenses through which organisation design can be improved, OD&D practitioners and team leaders were keen to develop a serious game that accounted for wider factors in successful, resilient organisation design."
        },
        {
            "heading": 2,
            "text": "Designing and testing a serious game for organisation design"
        },
        {
            "text": "We worked with Focus Games to design a game based on our research findings that would help team leaders and OD&D professionals supporting them to make more intentional decisions."
        },
        {
            "text": "Focus Games developed two game concepts which we tested with OD&D professionals. In one, participants model their current organisation and use scenario cards to stress-test these structures. In the other, participants are prompted to structure group discussions around key organisation design principles. In both cases, game elements like constraints and role-play help surface issues in a psychologically safe environment."
        },
        {
            "text": "Building on these two concepts, OD&D professionals and people taking decisions about team design in government departments helped us shape a game that helps participants model and stress test their organisation design. The game uses discussion prompts and scenarios based on our research, and helps participants measure the health of the organisation that emerged from the modelling."
        },
        {
            "heading": 2,
            "text": "How serious games support more intentional organisation design"
        },
        {
            "text": "The game enables a more intentional approach by:"
        },
        {
            "text": "The game, Organogame, is steadily being tested with larger and more complex teams. It is designed to be modular, so it can be played in settings as varied as a departmental board meeting, in conjunction with OD&D professionals when re-organising a department, in regular health checks within a Directorate, or in team away-days."
        },
        {
            "text": "Something we have found while testing the game is the importance of careful facilitation. Certain discussions around organisation design can become sensitive as they involve the way individuals work together. For this reason, we are making Organogame available through a ‘lending model,’ offering flexible facilitation support to those in government who wish to run conversations about organisation design. Policy Lab and the ODP team will support those who ‘borrow’ the game through either remote or face-to-face assistance, depending on their specific requirements. To find out more, please email us."
        },
        {
            "text": "Learn more about the use of serious games in government or Policy Lab’s experimental methods."
        }
    ]
}