{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/06/10/addressing-concerns-in-the-veterinary-sector/",
    "title": "Addressing concerns in the veterinary sector",
    "authors": [
        "Martin Coleman"
    ],
    "categories": [
        "Markets"
    ],
    "pub_date": "2025-06-10T07:00:12+01:00",
    "content": [
        {
            "heading": 2,
            "text": "An update on our market investigation, following our consultation on potential remedies for vet businesses"
        },
        {
            "text": "When we published our consultation on measures to address potential competition concerns in vet businesses, we expected a broad and robust set of responses – we have not been disappointed!"
        },
        {
            "text": "We've received over 500 responses to our consultation, the vast majority of which were from individuals and independent vets, alongside responses from pet owners and consumer representatives."
        },
        {
            "heading": 2,
            "text": "Understanding a complex market"
        },
        {
            "text": "Providing vet services is not like selling mobile phones or insurance. This complex market requires careful consideration of animal welfare and public health alongside competition. Clinical judgements, professional expertise, and the relationships between vets and pet owners all play vital roles."
        },
        {
            "text": "This is precisely why we consult."
        },
        {
            "text": "It would be wholly irresponsible to produce remedies without subjecting the possibilities to vigorous debate and discussion by those who may be affected, which is what we will be doing over the coming weeks as part of our extended administrative timetable."
        },
        {
            "heading": 2,
            "text": "What we are hearing so far"
        },
        {
            "text": "We're still analysing responses, but our initial review has revealed a number of key points:"
        },
        {
            "heading": 3,
            "text": "What consumers are telling us"
        },
        {
            "text": "Many consumer groups have told us that action is needed to address significant consumer detriment, including inadequate complaints and redress systems for when things go wrong."
        },
        {
            "text": "For example, Which? urged the CMA to ‘act boldly to tackle the high barriers to consumer engagement’ and told us:"
        },
        {
            "heading": 3,
            "text": "What vets are telling us"
        },
        {
            "text": "We've received mixed feedback from the vets sector."
        },
        {
            "text": "Many would welcome changes to the regulatory system, including ensuring that non-vet owners of practices are subject to appropriate regulatory scrutiny. There's recognition that regulation has real-life impact on both animal care quality and value for money for pet owners."
        },
        {
            "text": "Many vets acknowledge the importance of transparency – people incurring significant costs should know what they may end up paying, and be informed of available treatment options before committing. All whilst recognising that clinical practice can never be entirely predictable."
        },
        {
            "text": "We've also heard about 3 concerns:"
        },
        {
            "heading": 4,
            "text": "1. Practicalities"
        },
        {
            "text": "What are implementation risks? For example, can generic prescribing, common in human medicine, work effectively in veterinary practices?"
        },
        {
            "heading": 4,
            "text": "2. Costs and proportionality"
        },
        {
            "text": "Do benefits to pet owners outweigh additional costs to businesses, particularly for smaller practices?"
        },
        {
            "heading": 4,
            "text": "3. Business model impacts"
        },
        {
            "text": "What would happen to veterinary practices that rely on medicine mark-ups if more pet owners purchase medicines online?"
        },
        {
            "text": "While it's too early to say what will be in our provisional findings, the many helpful and constructive submissions that we've received will be core to what we're considering."
        },
        {
            "heading": 2,
            "text": "Key considerations"
        },
        {
            "heading": 3,
            "text": "1. Context is crucial"
        },
        {
            "text": "It is important to remember why we're considering these remedies in the first place. While people have a lot of trust in individual vets, there are concerns about vet businesses and we are considering evidence that may indicate:"
        },
        {
            "text": "Our job remains to get to the bottom of these concerns, and address them where we can."
        },
        {
            "heading": 3,
            "text": "2. Impact on businesses"
        },
        {
            "text": "Additional responsibilities, even when designed to address consumer concerns, have real consequences for businesses – not just in costs but in time and focus."
        },
        {
            "text": "40% of first opinion practices are small or medium-sized businesses – some of them are very small indeed."
        },
        {
            "text": "My father ran a small business, I understand the pressures – no HR department, no compliance professionals, no finance department, it was all him. His time was precious, costs were tight."
        },
        {
            "text": "We made a point in our consultation to seek views on potential regulatory costs and burdens, and this is a key consideration to balance against wider benefits."
        },
        {
            "heading": 3,
            "text": "3. Informed consumer choice"
        },
        {
            "text": "The relationship between pet owners and vets is not purely transactional – trust is key – and we have heard suggestions that giving consumers more information so that they can better assess the choices available to them might damage this relationship. But is it the case that there is a tension between better informed consumers and trusted relationships with vets?"
        },
        {
            "text": "Some responses suggested that greater awareness of available choices might lead pet owners to make decisions detrimental to a particular business. For example, knowing that medicines can be purchased more cheaply online might encourage pet owners to buy there instead."
        },
        {
            "text": "On the other hand, where buying online could lead to savings on some medicines of up to 50% or more over many years, should consumers not be made aware of their options to make their own choices? "
        },
        {
            "text": "And to make informed choices, pet owners need to know what the alternatives are."
        },
        {
            "heading": 2,
            "text": "Moving forward constructively"
        },
        {
            "text": "The issues we're addressing are widespread and strongly felt. Our inquiry did not create these concerns but was set up in part as a response to them."
        },
        {
            "text": "Our job is to assess problems and seek the most proportionate resolutions. Many veterinary professionals understand this. They recognise that resting on professional trust isn't enough when veterinary services as a business may not be functioning as well as they should."
        },
        {
            "text": "We particularly value those respondents who acknowledge the problems and suggest alternative solutions where they disagree with our proposed remedies. Through constructive dialogue, we'll find the right answers."
        },
        {
            "heading": 2,
            "text": "Extending our admin timetable"
        },
        {
            "text": "We have announced our decision to extend our administrative timetable so we can fully consider the responses we have received on our proposed remedies. "
        },
        {
            "text": "The statutory extension is for 6 months but we aim to publish our provisional decision in September 2025, to hold the response hearings around the end of October 2025, and to publish a final decision by February 2026 rather than at the end of November 2025 as originally intended."
        },
        {
            "text": "This is not a decision we have taken lightly. We understand the value of providing greater certainty to the many stakeholders – not least the vets, nurses, receptionists and other hardworking frontline staff – affected by this work and delivering outcomes as quickly as possible is a key objective for the CMA. "
        },
        {
            "text": "It is also important that those outcomes are measured, well-targeted and proportionate, and that the process gives a fair hearing to affected parties. "
        },
        {
            "text": "In this case, given the volume and strength of feeling of comments from consumer groups and vets and the complexity of the issues we are considering it is vital that we take the time needed to address consumer harm and avoid unintended consequences for veterinary professionals and businesses."
        },
        {
            "text": "Follow our ongoing investigation on the veterinary services for household pets page."
        }
    ]
}