{
    "url": "https://educationhub.blog.gov.uk/2025/06/artificial-intelligence-in-schools-everything-you-need-to-know/",
    "title": "AI in schools and colleges: what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2025-06-10T15:01:29+01:00",
    "content": [
        {
            "text": "Artificial intelligence (AI) is here to stay. It’s already having a significant impact across the public sector -  from helping police identify criminals to improving cancer screening in the NHS.  "
        },
        {
            "text": "That’s why we are bringing the AI revolution to classroom – using it to modernise our education system, to back our teachers and deliver for our children and learners.   "
        },
        {
            "text": "Here is everything you need to know about how AI can transform education.  "
        },
        {
            "heading": 3,
            "text": "Are teachers allowed to use AI? "
        },
        {
            "text": "Yes, teachers can use AI to help with things like planning lessons, creating resources, marking work, giving feedback, and handling administrative tasks. But they need to use their professional judgement and check that anything AI generates is accurate and appropriate—the final responsibility always rests with them and their school or college. "
        },
        {
            "text": "Schools and colleges can set their own rules on AI use, as long as they follow legal requirements around data protection, child safety, and intellectual property. "
        },
        {
            "text": "More information on Generative artificial intelligence (AI) in education can be found in our policy paper."
        },
        {
            "heading": 3,
            "text": "How could AI help teachers? "
        },
        {
            "text": "From drafting curriculum plans to producing high-quality teaching resources, AI has the potential to reduce the amount of time teachers spend doing administrative tasks, so they can focus on what they do best– teaching and supporting their students. "
        },
        {
            "text": "There is so much untapped potential for AI to give teachers a helping hand with classroom life. That’s why we are funding the development of brand new AI tools for education. These tools truly stretch the capabilities of what AI can do – from assessing handwritten work to giving feedback on hand-drawn geography maps and even recognising mistakes in soldering on circuit boards made by engineering students. "
        },
        {
            "text": "Time previously spent on burdensome marking and admin allows teachers to focus on face-to-face teaching."
        },
        {
            "heading": 3,
            "text": "Will teachers be replaced by AI? "
        },
        {
            "text": "Absolutely not. "
        },
        {
            "text": "Teachers are irreplaceable, and AI could never be a substitute for teachers' professional judgement and the personal relationships they have with their students. "
        },
        {
            "text": "We're developing AI tools specifically to support teachers, not to replace the unique role they play in education. These tools are designed to handle repetitive tasks that currently take teachers’ energy away from face to face classroom interactions. "
        },
        {
            "text": "Good teachers are key to raising standards in education. Using AI to reduce workload could also help address the recruitment and retention challenges in teaching - helping to restore teaching as an attractive profession. These tools have the potential to make a difference to the every day lives of teachers, and will help them focus on what matters, teaching. "
        },
        {
            "heading": 3,
            "text": "Are students allowed to use AI? "
        },
        {
            "text": "It’s up to schools and colleges to decide if students can use AI, but they need to have the right safeguards in place. That means close supervision, using tools with safety and filtering features, and making sure students stick to age restrictions—many AI tools are 18+. Schools and colleges also need to think about how AI affects learning and whether homework policies need updating. "
        },
        {
            "text": "Each school or college can choose how and when AI is used. Some might allow it in certain subjects or year groups, while others may decide it’s just for teachers. Whatever they choose, keeping students safe should always come first. "
        },
        {
            "heading": 3,
            "text": "How could AI help students? "
        },
        {
            "text": "Evidence shows  that high quality, personalised feedback builds attainment, and AI tools can help with this. This means getting more of what makes the biggest difference to their learning - high-quality face-to-face teaching and personalised feedback.  "
        },
        {
            "text": "AI tools can speed up marking and help teachers understand each student's progress better, so they can tailor their teaching to what each learner needs. This won't replace the important relationship between students and teachers - it will strengthen it by giving teachers back valuable time to focus on the human side of teaching that makes all the difference to how well pupils learn. "
        },
        {
            "heading": 3,
            "text": " What are you doing to develop AI in education? "
        },
        {
            "text": "From investing in AI tools, to upskilling teachers and leaders ,and gathering evidence about how teachers and students are using AI, we’re already investigating how we can take advantage of AI in education.  "
        },
        {
            "text": "These are just first steps, but we have already:  "
        },
        {
            "text": "In August 2024 we announced two exciting initiatives to stimulate the education technology sector and help build tools that will support with teacher workload.  "
        },
        {
            "text": "The content store is a £3 million data library funded by the Department for Science and Technology which will be used to provide large language AI models with high quality educational information, like curriculums and mark schemes. This means AI products will be even more effective at producing resources to help teachers.  "
        },
        {
            "text": "We also announced the AI Tools for education: £1 million of funding through Innovate UK’s contracts for innovation programme. This was awarded to 16 innovators to use the information from the content store to build AI tools that will help with teacher workload across a range of the key stages.  "
        },
        {
            "text": "We have also announced an additional £1m of Contracts for Innovation funding to accelerate the development of AI tools for teachers — moving them from the design phase into real classrooms. This brings ground breaking AI tools a step closer to being ready for everyday use in schools."
        },
        {
            "text": "This boost for Oak National Academy, a provider of free, optional, high-quality digital curriculum resources, has helped to develop and improve Oak’s AI tools. Oak National Academy has launched an AI-powered lesson assistant, Aila, to support teachers to reduce their workload. Oak has worked with expert AI developers, teachers and other education specialists to create a tool that teachers report has saved them around 3-4 hours per week in lesson planning.  "
        },
        {
            "text": "We have created straightforward training and resources for schools and colleges to help teachers and school leaders use AI safely with confidence to improve classroom experience for pupils."
        },
        {
            "text": "For teachers, we're developing simple online guides that explain AI basics and provide practical tips for using AI safely with young people. These resources will show teachers how to use AI tools to reduce administrative tasks, giving them more time to focus on delivering inspiring lessons and less time on paperwork."
        },
        {
            "text": "For leaders, we're providing comprehensive support for managing AI across their entire settings. This guidance will help them integrate AI effectively into their digital strategy, with real examples of how other schools and colleges have successfully implemented AI. We're also including research insights on the educational benefits of using AI in schools and colleges."
        },
        {
            "text": "This work responds directly to what schools and colleges have been asking for - practical help to use AI safely while freeing up valuable teaching time."
        },
        {
            "heading": 3,
            "text": "How are you making sure pupils have access to the right technology? "
        },
        {
            "text": "We're investing £45 million to enhance digital connectivity in schools nationwide, specifically targeting the digital divide over the coming year. This funding includes £25 million for wireless network improvements and £20 million for fibre upgrades, ensuring reliable internet access becomes standard across all schools.  "
        },
        {
            "text": "We believe that every child deserves equal access to digital learning opportunities. This investment will help ensure no pupil is disadvantaged by lack of technology access, while also supporting teachers to harness educational technology advances in their classrooms.   Alongside this immediate investment, we've launched a consultation on our long-term strategy for narrowing the digital divide, with particular focus on establishing new digital and technology standards for schools and colleges across the country. "
        }
    ]
}