{
    "url": "https://gfie.blog.gov.uk/2025/06/10/celebrating-and-supporting-carers-during-carers-week/",
    "title": "Celebrating and Supporting Carers during Carers Week!",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "Breaking down barriers",
        "Carers",
        "Inclusion",
        "Life Chance Recruitment"
    ],
    "pub_date": "2025-06-10T16:14:20+01:00",
    "content": [
        {
            "text": "This week we celebrate Carer’s Week 2025 June 9th – 15th, the aim is to shine a spotlight on the incredible contributions of carers and raise awareness of caring, highlight the challenges carers face and recognise their contribution to families and communities throughout the UK."
        },
        {
            "text": "The theme for this year is ‘Caring about Equality’ highlighting the inequalities faced by unpaid carers. These include barriers to employment, poor mental and physical health and less opportunities for education."
        },
        {
            "heading": 3,
            "text": "Employment"
        },
        {
            "text": "Nearly 2.5m people in employment are providing unpaid care in England and Wales- 9% of the total number of people in employment. This highlights the importance of making sure carers feel supported in the workplace. The Civil Service Carer’s Passport enables a carer and their manager to discuss and document the flexibilities to combine caring and work."
        },
        {
            "text": "Sometimes an unpaid caring role may mean that employment is interrupted, and a survey conducted by Carers UK found that many carers found it increasingly difficult to juggle work and care. 40% of carers who had responded to the survey said they had given up work to care."
        },
        {
            "text": "Given the above, why is it important to consider the barriers that carers may face in relation to employment? The GFIE Carers scheme is open to people returning to work after a period of care, recognising that they may have barriers such as lack of confidence. We provide ongoing assistance and connect these individuals with potential job opportunities they may want to pursue across different Departments."
        },
        {
            "heading": 3,
            "text": "Education"
        },
        {
            "text": "The latest school census relating to young carers was released in June 2024 by the Department for Education , showing that 53,976 pupils were recorded as young carers, representing 0.6% of the pupil population. "
        },
        {
            "text": "Analysis by UCL, as part of a research collaboration with Carers Trust found that young adult carers were 38% less likely to obtain a university degree than their counterparts, for those caring more than 35 hours a week, they were 86% less likely."
        },
        {
            "text": "The majority of employment opportunities that come through GFIE do not require any higher-education degree, and sometimes educational opportunities such as apprenticeships are attached to opportunities, enabling carers to achieve qualifications whilst they are working."
        },
        {
            "heading": 3,
            "text": "Mental and Physical Health"
        },
        {
            "text": "65% of carers agreed that the increase in cost of living was having a negative impact on their physical and/or mental health in a report by Carers UK 2023. "
        },
        {
            "text": "The Civil Service aims to support civil servants who are also carers in a number of ways, including Employee Assistance Programmes (offering tools to support health and wellbeing) and a Carers Staff Network which can provide support relevant to carers within the Civil Service. The Civil Service Carers Network (CSCN) brings together representatives from 42 carers networks across the Civil Service. The CSCN exists to support the networks that provide direct support to carers in Civil Service departments and other public bodies - this is another layer of support for young adult carers and carers coming back to the workplace after a period of care."
        }
    ]
}