{
    "url": "https://vets.blog.gov.uk/2025/06/10/government-veterinary-services-at-bva-live-12-13-june/",
    "title": "Government Veterinary Services at BVA Live               (12-13 June) ",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2025-06-10T09:10:10+01:00",
    "content": [
        {
            "text": "Want to learn more about the work of the Government Veterinary Services (GVS)? Come and see us at BVA Live. "
        },
        {
            "text": "We will be speaking at a few events across the 2 days: "
        },
        {
            "text": "Thursday 12th June: "
        },
        {
            "text": "10:25-11:25: Business, Careers & Debates Theatre "
        },
        {
            "text": "HOT TOPIC: Shaping the future: reforming the veterinary surgeons act and its impact. This will be a lively debate, including the UK’s Chief Veterinary Officer, Professor Christine Middlemiss CB. "
        },
        {
            "text": "11:30-12:15: BVA Interactive Zone "
        },
        {
            "text": "What should reform of the Veterinary Surgeons Act look like? Join BVA President and Defra’s head of veterinary policy to share your views on any potential reform of the VSA "
        },
        {
            "text": "15:15-16:15: Business, Careers & Debates Theatre "
        },
        {
            "text": "Where is the UK on bTB control? Join a discussion with all 4 UK Chief Veterinary Officers debate the issue of bovine tuberculosis, and how impacts and control methods differ across the UK "
        },
        {
            "text": "Friday 13th June: "
        },
        {
            "text": "16:15-16:55: Equine & Farm Clinical Theatre "
        },
        {
            "text": "Vets at the frontier of new and emerging diseases. Join the UK Deputy Chief Veterinary officer and APHA’s Head of Scanning Surveillance to hear about the important role the veterinary profession plays in early disease detection – you are part of this line of defence, even if you don’t realise it! "
        },
        {
            "text": "The Animal and Plant Health Agency will have a stand at E45 – be sure to swing by and say hello! "
        }
    ]
}