{
    "url": "https://nationalscreening.blog.gov.uk/2025/06/10/sma-screening-ise-partnership-board-updated-on-nihr-research-call/",
    "title": "SMA Screening ISE partnership board updated on NIHR research call",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "Newborn Blood Spot Screening"
    ],
    "pub_date": "2025-06-10T16:30:54+01:00",
    "content": [
        {
            "text": "The SMA Screening ISE Partnership Board, which is overseeing the planning of the in-service evaluation (ISE) of newborn screening for SMA, was updated by the National Institute for Health and Care Research (NIHR) at its meeting on 15 May."
        },
        {
            "heading": 2,
            "text": "NHS England update"
        },
        {
            "text": "NHS England (NHSE) provided an update on preparatory workstreams. These include detailed work on establishing treatment costs for all 3 SMA therapies in a screened population. NHSE is working with specialised commissioning to refine this work further."
        },
        {
            "text": "NHSE has also been looking at the data and IT requirements for adding SMA to the newborn blood spot (NBS) screening pathway."
        },
        {
            "heading": 2,
            "text": "ScHARR cost effectiveness model"
        },
        {
            "text": "The Sheffield Centre for Health and Related Research (ScHARR) has developed a modelling study into SMA screening for the UK context that suggests newborn screening may be cost saving. Some limitations and uncertainties remain, however, including the true cost of treatment, long-term outcomes and the fact that 2 of the 3 therapies are only currently available under a National Institute for Health and Care Excellence (NICE) managed access agreement (MAA)."
        },
        {
            "text": "ScHARR will present its model to the June meeting of the UK National Screening Committee (UK NSC). A manuscript explaining the uncertainties and what the ISE can do to address them will be made available to the ISE research team."
        },
        {
            "heading": 2,
            "text": "Scotland may be able to participate in ISE"
        },
        {
            "text": "NHS Scotland is exploring whether it will be possible to also take part in the ISE. Details are yet to be confirmed but it is in discussions with the NIHR and the ISE data and methodology (D&M) sub-group and will keep the partnership board updated.  "
        },
        {
            "heading": 2,
            "text": "Sub-group updates"
        },
        {
            "text": "The D&M sub-group reviewed information from UK Biobank and Genomics England to understand if:"
        },
        {
            "text": "The sub-group concluded this would not be necessary because the evidence consistently suggests that penetrance is high. Data from the ISE could also support the understanding of penetrance better if needed."
        },
        {
            "text": "SMA Reach has released new data which the D&M group will look at."
        },
        {
            "text": "The clinical pathway sub-group has discussed whether SMA should be named as a suspected condition at the first contact with parents after a positive screening result. Concern had been raised that parents might access inaccurate, outdated or incomplete information online before an appointment with a specialist.  "
        },
        {
            "text": "However, research conducted with parents from the Thames Valley study was presented to the group which suggests most parents would prefer to have the condition named at first contact. This is how all other NBS screening test results are managed."
        },
        {
            "text": "The parent and professional screening information that is being developed to support the ISE will address the issue of directing parents to up-to-date information."
        },
        {
            "text": "The clinical pathway group is also refining the list of specialist centres that can prescribe SMA treatment for newborns."
        },
        {
            "text": "The laboratory sub-group confirmed that the quickest option to implement the ISE would be to begin with the 3 labs where the reagents and equipment needed are already in place. These labs test approximately 170,000 babies per year. The next quickest option would be to include all 6 labs that currently test screening samples for severe combined immunodeficiency (SCID) using a multiplex PCR technology. Together, these 6 labs currently test approximately 370,000 babies per year."
        },
        {
            "text": "Screening labs have been working hard to prepare for the implementation of newborn screening for Hereditary Tyrosinemia type 1 in 2025 and are well placed to anticipate what may be needed to conduct a successful evaluation for SMA.   The partnership board agreed that the testing methodology should be evaluated as part of the ISE."
        },
        {
            "text": "The parent information and staff training task and finish group has been working on draft content for parent information and staff training materials. This content has been submitted to experts in the clinical pathway group for review prior to wider clinical and user group review."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}