{
    "url": "https://mhclgdigital.blog.gov.uk/2025/06/10/supporting-local-government-to-reduce-cyber-risk-through-targeted-interventions/",
    "title": "Supporting local government to reduce cyber risk through targeted interventions",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Cyber",
        "Local Digital"
    ],
    "pub_date": "2025-06-10T11:08:31+01:00",
    "content": [
        {
            "text": "The cyber threat to local government is real, increasing, and constantly evolving. Attacks can disrupt essential services, damage public trust and cause significant financial losses. We’ve seen this first-hand with ransomware attacks targeting councils such as Hackney, Gloucester, and Redcar and Cleveland.   "
        },
        {
            "text": "In response, MHCLG’s Local Digital team has been helping councils to build their cyber resilience through: "
        },
        {
            "text": "Four years into the Cyber Support programme, we’re sharing insights on the impact of our cyber work. These are drawn from early findings of the independent evaluation of the Local Digital programme.  "
        },
        {
            "text": "We’ll also share how we plan to gather further insights on sector risk to inform the future of our cyber support. "
        },
        {
            "heading": 2,
            "text": "Where we’re seeing real improvements "
        },
        {
            "text": "As well as funding, the Cyber Support programme provided participating councils with: "
        },
        {
            "text": "These focused on actions that can have the most impact on reducing the threat of ransomware attacks. "
        },
        {
            "text": "Results from the independent evaluation show that this support has had a major impact on councils. The programme has resulted in real, measurable improvements to sector-wide cyber resilience and direct financial benefits, with high satisfaction rates across participating councils.   "
        },
        {
            "text": "Between 2020 and February 2025, the programme contributed to: "
        },
        {
            "text": "While the evaluation highlights progress, it revealed some wider sector challenges. These include: "
        },
        {
            "heading": 2,
            "text": "What’s next for our cyber support "
        },
        {
            "text": "The evaluation has shown us that targeted, tailored support works. It’s helped improve our understanding of the sector’s cyber needs and gaps, which will help us to develop our support offer.  "
        },
        {
            "text": "It’s also revealed where a different approach may be needed. We’re now exploring how we can utilise the value of sharing cyber security data, expertise and capabilities across the sector through our Defend as One pilots.  "
        },
        {
            "heading": 3,
            "text": "Help us shape the future of our support "
        },
        {
            "text": "To continue improving our offer, we need a deeper understanding of risk across the sector. "
        },
        {
            "text": "By completing the CAF for local government and submitting your progress to MHCLG, you can help us build that picture. Over 200 councils have completed the Get CAF Ready programme, and many have started their CAF self-assessment. "
        },
        {
            "text": "Visit our CAF for local government webpage to learn more and subscribe to our CAF newsletter for the latest updates on the service. "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "To hear more about Local Digital’s work: "
        }
    ]
}