{
    "url": "https://marinedevelopments.blog.gov.uk/2025/06/10/the-ocean-is-a-climate-ally-how-the-east-marine-plan-can-lead-on-climate-action/",
    "title": "The ocean is a climate ally: How the East Marine Plan can lead on climate action",
    "authors": [
        "Sian McGuinness, Senior Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-06-10T13:37:25+01:00",
    "content": [
        {
            "text": "Sian McGuinness from the Marine Planning team discusses a new study “The opportunity for climate action through climate-smart Marine Spatial Planning”, led by Plymouth Marine Laboratory"
        },
        {
            "text": "“After almost 100 years on the planet, I now understand the most important place on Earth is not on land, but at sea.” – David Attenborough"
        },
        {
            "text": "That single sentence captures what many of us working in marine-focused fields have long understood: the ocean is not just a victim of climate change, but one of our greatest lines of defence against it."
        },
        {
            "text": "That is why I am proud to have collaborated with an international team of marine scientists, climate experts, and marine spatial planning practitioners on a new study, “The opportunity for climate action through climate-smart Marine Spatial Planning”, led by Plymouth Marine Laboratory. The paper explores how climate-smart Marine Spatial Planning (CSMSP) can help us tackle climate change while ensuring the sustainable use of marine resources. CSMSP proactively integrates climate considerations into the planning and management of the marine environment, both to reduce greenhouse gas emissions and to improve adaptation to a changing climate."
        },
        {
            "text": "The study looks at why climate-smart marine spatial planning is not yet widespread. It identifies key blockers and enablers (Figure 1) and highlights real-world examples of where CSMSP is working. The goal is to support countries and planning teams starting to design and deliver more climate-smart marine spatial plans."
        },
        {
            "text": "Figure 1: Enablers and blockers of climate-smart Marine Spatial Planning."
        },
        {
            "text": "The study found that while offshore renewables are often included in marine plans, other forms of climate action such as nature-based solutions and broader adaptation strategies are far less common. Key blockers include limited access to climate data and projections, competing sectoral priorities, and a lack of funding and capacity within planning teams."
        },
        {
            "text": "At the same time, there are clear enablers that have been shown to drive progress:"
        },
        {
            "text": "The paper shares successful examples of CSMSP in action from around the world. England’s marine plans are among those highlighted for incorporating both mitigation and adaptation, with policies that address flooding and coastal erosion, conserving and restoring blue carbon habitats, and strengthening the resilience of developments."
        },
        {
            "text": "As the Marine Management Organisation (MMO) replaces the East Marine Plan, we seek to build on the strong CSMSP foundations already within English marine plans. Insights from this paper will help us go further. By strengthening the use of nature-based solutions and working with researchers and stakeholders to embed climate modelling, evidence, and tools into the planning process, we can make the second generation of marine plans even more climate-smart. In doing so, the English marine plans can help ensure that the ocean continues to protect us as much as we work to protect it."
        }
    ]
}