{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/06/30/celebrating-the-year-of-engineering-biology-at-ukri/",
    "title": "Celebrating the Year of Engineering Biology at UKRI",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Deep Specialist",
        "Guest Blog",
        "Science"
    ],
    "pub_date": "2025-06-30T13:18:58+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Exploring the transformative potential of engineering biology "
        },
        {
            "text": "Engineering biology is a transformative technology predicted to add up to $4 trillion per annum to the global economy over the next decade."
        },
        {
            "text": "Since 2007, UKRI has invested over £800m in engineering biology, supporting researchers to develop new approaches using nature’s toolbox to unlock bio-based solutions in a more sustainable way. Drawing on the tools of synthetic biology, engineering biology can help solve some of the biggest challenges facing society."
        },
        {
            "text": "In 2021, we established the National Engineering Biology Programme (NEBP), in partnership with the Defence Science and Technology Laboratory (Dstl), to harness the potential of engineering biology to deliver a greener, healthier, and more resilient future. "
        },
        {
            "heading": 2,
            "text": "On a mission to harness the potential of engineering biology"
        },
        {
            "text": "Over the past year, bolstered by the Technology Missions Fund (TMF), UKRI took a mission-led approach, focused on the application-inspired themes of the NEBP, and invested a total of £125 million in a suite of engineering biology initiatives to strengthen the engineering biology ecosystem and to build on a world-leading capability in the UK to tackle global grand challenges."
        },
        {
            "text": "Between 2024-2025, we announced a £100 million investment in six Engineering Biology Mission Hubs and 22 Mission Awards, £13.5 million across 48 Engineering Biology collaborative R&D projects ,and an additional £5.8 million devoted towards driving commercialisation and innovation in the engineering biology sector."
        },
        {
            "text": "You can find out more about the TMF programme by reading our UKRI Technology Missions Fund 2025 brochure, as well as view and listen to the recent video and podcast on The Preventing Plastic Pollution with Engineering Biology (P3EB) Mission Hub, led by Professor Andy Pickford at Portsmouth University, watch the video and listen to the podcast to learn more."
        },
        {
            "text": "Last month, we launched the Engineering Biology Mission Hubs Showcase, which will take place over the summer, where each Mission Hub will be hosting their own webinar to discuss their Hub’s mission and to address community questions. To find out more, visit the UKRI Events website for details."
        },
        {
            "heading": 2,
            "text": "Supporting the engineering biology community"
        },
        {
            "text": "As a technology of critical importance for tackling global challenges, we are delighted to work together with our international partners to maximise our combined strengths in engineering biology and accelerate advancements."
        },
        {
            "text": "A key priority is how we can best support and train the future generation of researchers and innovators who will go on to shape the R&D landscape of tomorrow. Over the past decade we have invested a total of £26 million, across four Engineering Biology Centres for Doctoral Training (CDTs) programme, supporting over 207 academic and industrial leaders of tomorrow."
        },
        {
            "text": "This year, we were delighted to announce the launch of our new Doctoral Focal award in Engineering Biology, helping to train the next generation of researchers in cutting-edge technologies applicable to supporting a diverse range of careers. "
        },
        {
            "heading": 2,
            "text": "Future aspirations for engineering biology "
        },
        {
            "text": "I have been delighted to be involved in shaping the Engineering Biology Aspirations Foresight project on Unlocking the power of Engineering Biology, with colleagues at the Government Office for Science and key stakeholders, to develop a set of evidence-based visions for engineering biology over the next 10 years."
        },
        {
            "text": "Below is a flavour of a few examples of recent UKRI investments which align with the five areas of opportunity."
        },
        {
            "text": "Biosynthetic fuels"
        },
        {
            "text": "C3 Biotechnologies has developed a pioneering system that uses engineering biology to turn food and agriculture waste into synthetic high-performance fuels, helping industries adopt next generation fuels and transition to a more sustainable future. "
        },
        {
            "text": "Nitrogen-fixing cereals"
        },
        {
            "text": "Dr Nicola Patron at the University of Cambridge is leading a Mission Award, exploring how we can use model-informed tools to produce disease-resistant lettuce plants by introducing targeted genetic changes, to help restore crop yields. "
        },
        {
            "text": "Future fashion"
        },
        {
            "text": "Colorifix  has developed the first entirely biological process to produce, deposit and fix dyes onto textiles, helping the textile industry dramatically and cost-effectively reduce its environmental impact. "
        },
        {
            "text": "Lab-grown blood"
        },
        {
            "text": "Scarlet Therapeutics is developing a platform that generates novel red blood cells that carry additional proteins within them to provide therapeutic benefits to potentially treat a wide range of diseases."
        },
        {
            "text": "Microbial metal factories"
        },
        {
            "text": "The ELEMENTAL Engineering Biology Mission Hub aims to develop a suite of sustainable solutions to tackle metal contamination into the environment by engineering bacteria capable of selectively sequestering metals from contaminated areas for re-use within the circular economy. "
        },
        {
            "heading": 2,
            "text": "Convening our community "
        },
        {
            "text": "I believe opportunities from research are greatest when we bring the whole ecosystem together to share ideas and experiences. That’s why last year we brought together our engineering biology community in one place to share knowledge, insights and ideas to continue driving advances in engineering biology research and innovation.  "
        },
        {
            "text": "I look forward to continuing that momentum to harness more opportunities from engineering biology in the future as we look to our next convening event later this year – planning is just getting underway!"
        }
    ]
}