{
    "url": "https://defradigital.blog.gov.uk/2025/06/30/how-our-digital-teams-supported-innovation-in-flood-risk-services/",
    "title": "How our digital teams supported innovation in flood risk services",
    "authors": [
        "Helen Eden"
    ],
    "categories": [
        "Defra digital",
        "Digital delivery"
    ],
    "pub_date": "2025-06-30T16:44:13+01:00",
    "content": [
        {
            "text": "Helen Eden, Programme Delivery Manager for Flood at Defra, celebrates the success of our Flood Digital Team, who have been recognised for their innovative work in delivering crucial flood risk information to help protect communities across the UK and plan for the future."
        },
        {
            "text": "Defra’s Flood Digital Team helped to deliver the Environment Agency's new National Flood Risk Assessment (NaFRA2), which recently won the Digital Excellence Award at the Flood & Coast 2025 Awards."
        },
        {
            "heading": 2,
            "text": "Award-winning innovation"
        },
        {
            "text": "This achievement recognises the team's dedication to transforming how flood risk information is delivered to both the public and planning professionals. It celebrates the collaborative efforts of our teams who’ve worked tirelessly to integrate complex flood risk data into user-friendly digital services including:"
        },
        {
            "heading": 2,
            "text": "Improving access to data"
        },
        {
            "text": "This ambitious upgrade to essential services means the Environment Agency can easily share both current flood risk information and projected flood risk data for the next 30 years."
        },
        {
            "text": "The previous national flood risk assessment data provided limited information without climate change projections. Updates were difficult to implement, creating backlogs and inconsistencies between national and local modelling."
        },
        {
            "text": "The new NaFRA2 represents a substantial leap forward, offering:"
        },
        {
            "heading": 2,
            "text": "Services designed for users"
        },
        {
            "text": "Both service teams worked closely with their target audiences throughout the development process, testing innovative ways to present complex information about climate change and flood depth. This collaborative approach ensured the final services would meet user needs effectively."
        },
        {
            "text": "The 2 upgraded services cater to distinct audiences with specific needs."
        },
        {
            "text": "The ‘Check your long term flood risk’ service is designed for non-technical, public users. It helps them understand flood risk in their area from 4 potential sources – rivers and the sea, surface water, groundwater and reservoirs. The upgraded service provides probabilistic data with yearly flood risk ratings that help people understand their actual level of risk."
        },
        {
            "text": "The ‘Flood map for planning’ service helps planning professionals assess whether developments require a flood risk assessment during the planning process. The upgraded service includes more detailed flood zones based on improved national modelling, surface water data, and crucially, information showing how climate change might impact future flood risk."
        },
        {
            "heading": 2,
            "text": "Protecting people and property across the UK"
        },
        {
            "text": "These digital innovations directly support ministerial commitments and the National Flood and Coastal Erosion Risk Management Strategy objectives. By providing better access to high-quality flood risk information, we're helping communities, businesses and planning authorities make informed decisions to enhance resilience against flooding."
        },
        {
            "text": "The teams' work exemplifies how digital services can translate complex environmental data into accessible, actionable information to help protect people and property across the UK."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}