{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/06/30/support-that-empowers-my-journey-through-care-and-why-the-dfe-care-leavers-resource-website-matters/",
    "title": "Support That Empowers: My Journey Through Care and Why the DfE Care Leavers Resource Website Matters",
    "authors": [
        "Lawrence"
    ],
    "categories": [
        "Care leavers",
        "Wellbeing"
    ],
    "pub_date": "2025-06-30T16:25:07+01:00",
    "content": [
        {
            "text": "I’m Lawrence, a 24 year old care leaver and care experienced professional currently working full-time at Carefree Cornwall."
        },
        {
            "text": "My journey began with joining the Carefree Board of Trustees. I’m now proud to be part of the National Children’s Bureau’s Social Care Advisory Board, where I provide lived-experience insight to shape national conversations about children’s social care. I also sit on the Cornwall Community Foundation Grant Panel, which has allowed me to give back to the community while helping shape the kind of change I would have benefitted from growing up."
        },
        {
            "heading": 2,
            "text": "Facing the fear of 18"
        },
        {
            "text": "Growing up in care, turning 18 wasn’t something I looked forward to, it was something I worried about. “Who’s going to help me budget?”, “Where will I live?”, “What if I get it wrong?”. These were real concerns that lived rent-free in my head."
        },
        {
            "heading": 2,
            "text": "A lifeline through ‘Staying Put’"
        },
        {
            "text": "I was extremely fortunate to benefit from the Staying Put arrangement, which allowed me to remain with my foster carers beyond the age of 18. Staying with them gave me the stability I needed to make that critical transition into adulthood at a manageable pace. But even with that kind of support, the gaps still existed."
        },
        {
            "text": "I often felt isolated. I didn’t always know where to find the answers to everyday challenges. That’s why I think the Department for Education’s new Support for Care Leavers website is such a significant and meaningful step forward."
        },
        {
            "heading": 2,
            "text": "A website that makes a difference"
        },
        {
            "text": "This is the kind of resource I wish had existed when I was transitioning out of care. It’s a thoughtfully designed space that offers real, usable guidance for young people.It covers vital areas like housing, education, health, money, employment, and entitlements, but in a way that feels clear, supportive, and empowering. It doesn’t assume you already know the system.For young people who may not have a strong support system, having this kind of centralised, easy-to-understand resource could be life changing. Whether you're applying to university, looking for work, sorting benefits, or just trying to figure out how to start living independently, this website gives you a starting point."
        },
        {
            "heading": 2,
            "text": "Growth, confidence, and purpose"
        },
        {
            "text": "Since leaving care, I’ve grown in ways I never imagined. Recently, I attended Anthropy25 and was honoured to be recognised as an emerging leader. I also participated in the All-Party Parliamentary Group for Children (APPGC) meeting at Westminster, where we discussed the Children’s Wellbeing and Schools Bill. Young people’s voices shouldn’t just be heard, they should help shape policy."
        },
        {
            "heading": 2,
            "text": "A message to care leavers"
        },
        {
            "text": "You matter. Your future matters. You deserve support, stability and opportunity, just like anyone else. Let this be your reminder that the world is your oyster."
        },
        {
            "heading": 2,
            "text": "Discover more"
        },
        {
            "text": "To find support and guidance for young people leaving care aged 16 to 25, visit the Support for Care Leavers website."
        }
    ]
}