{
    "url": "https://ruralpayments.blog.gov.uk/2023/09/11/introducing-you-to-21/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2023-09-11T17:09:41+01:00",
    "content": [
        {
            "text": "Hello!  My name is Jo Ransome, and I work in RPA’s Customer Insight Team. My role covers everything related to gathering insight. The Research and Insight Network Group started just over a year ago and it’s a very busy environment to work in.  No two days are the same – I can be having an in-depth telephone conversation, testing a survey before release, analysing results, facilitating one-to-one interviews, or running focus groups."
        },
        {
            "text": "I like to think that my interaction with customers is seen as positive. If I’m speaking with an arable farmer, I would readily admit I know very little about arable farming, although I do know a lot more about cattle and sheep!"
        },
        {
            "text": "Since 2010 my husband Robin and I have lived on a Powys County Council holding near Knighton, breeding pedigree Welsh Black cattle and commercial sheep."
        },
        {
            "text": "We’re first generation livestock farmers. We started farming in 1985 and using a very small inheritance, bought an old tractor with a loader and a tup, and began our lives as UK tenant farmers. Over time we grew from having just one in-calf heifer, and two pet ewes, to milking one of the largest flocks of sheep in the country."
        },
        {
            "text": "Robin and I know first-hand the enormous struggle of trying to get onto that first rung of the farming ladder and stay there!  It is a massive undertaking, not just financially, but physically and emotionally too. We’ve had our share of heartbreaks, from having to sell up our first venture, to losing our first animal to Bovine Tuberculosis in 2008.  But despite it all, we’re still standing, still in business, and for that we’re proud and thankful."
        },
        {
            "text": "I first transferred to the Ministry of Agriculture, Fisheries and Food (MAFF) from the Welsh Office in 2000 as an inspector, before joining the Worcester office during the Foot & Mouth Disease. I helped set up the call centre, fronting initial calls from farmers, working closely with vets, and supporting the animal movement licencing department."
        },
        {
            "text": "The aspect of my role I enjoy most is meeting like-minded customers and being able to strike up conversations whilst doing my job! Also, realising and genuinely knowing the challenges that our customers are facing. When you receive comments such as “It’s so nice to talk to someone who knows about farming – it made our conversation a lot easier and quicker,” makes for happy feelings!"
        },
        {
            "text": "This is why I so enjoy my role in the RPA Insight Team, and why I’m delighted to be a part of the RPA Research and Insight Network Group. What’s so amazing about our workshops and telephone interviews, is that they allow farmers to come to us and discuss matters with us openly and honestly, and on neutral ground; something I have always believed is absolutely vital."
        },
        {
            "text": "I also recently undertook some work for the Communications Team, interviewing and filming customers on their farms, to promote uptake of the new schemes, such as Countryside Stewardship 2023."
        },
        {
            "text": "My proudest moments in RPA have always been whenever I’m able to help make things better for a fellow farmer. It’s the most important part of my job - and whether I’m working on a customer survey, advising Defra’s Companion Animal Welfare Policy team, or providing feedback to the Livestock Information Service, I never lose of sight of this."
        },
        {
            "text": "Native species are a passion for myself and my husband, and in 2016 we started to show our (now award-winning) Welsh Blacks; a steep learning curve but a very enjoyable one. Our Suffolk x Lleyn lambs also do well in carcase competitions, and this means the world to us because if native livestock disappear, they will never return."
        },
        {
            "text": "We have two daughters, who – although they both grew up on the farm – show zero interest in following our in our farming footsteps (traitors!) but at least the grandchildren love riding on the quad and “driving” the mini-digger! I still ride my own horse regularly, but no longer compete."
        },
        {
            "text": "I truly believe that together we can make a difference.  Certainly, the way forward for agriculture brings its own challenges and opportunities, but if RPA can work together with the UK rural industry to make things better, I will retire a very happy lady - albeit not for the foreseeable future!"
        }
    ]
}