{
    "url": "https://dcmslibraries.blog.gov.uk/2023/09/11/libraries-paving-the-way-for-youth-enterprise/",
    "title": "Libraries paving the way for youth enterprise",
    "authors": [
        "Ryan Johnson, Business Engagement & Marketing Manager, Oxfordshire County Council"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-09-11T15:08:26+01:00",
    "content": [
        {
            "text": "Libraries are the perfect setting to engage youth audiences, with entrepreneurial activities attractive to even the hardest to reach teenagers."
        },
        {
            "text": "Oxford Westgate Library became a member of the British Library Business & IP Centre (BIPC) National Network one year ago. Since BIPC Oxfordshire launched it has engaged and supported thousands of young people with enterprising activities, contributing to Oxfordshire County Councils priority to ‘create opportunities for children and young people to reach their full potential.’"
        },
        {
            "text": "The centre’s versatile design allows us to meet the needs of all audiences and has proven extremely popular for youth engagement. It also features a marketing suite with green screen, professional lighting, teleprompter, light photo boxes, podcasting and video recording equipment, virtual reality headsets, drones, interactive screens, scrum boards and more."
        },
        {
            "text": "With the British Library giving centres the autonomy to respond to local needs, a goal of BIPC Oxfordshire is to introduce entrepreneurial activities to children and young people, whilst boosting awareness and engagement with the wider library resources."
        },
        {
            "text": "A recent impact report highlighted 36% of BIPC Oxfordshire service users were aged 35 or under. We have managed this by partnering with and supporting the objectives of youth organisations, services and professionals."
        },
        {
            "text": "Importantly, whether hosting events, creating bespoke workshops, advising teaching staff or introducing young people to the business resources such as COBRA database, we have also ensured that young people know their local library is well-equipped to support them when starting their own business."
        },
        {
            "text": "Externally we have supported numerous local and national organisations, including:\n- Young Enterprise\n- National Citizen Service\n- Schools and colleges (both public and private)\n- Specialist education needs schools\n- Ukrainian refugees\n- University departments and societies\n- Careers festivals and community events"
        },
        {
            "text": "Internally we have also supported a number of the council’s teams, including:\n- Targeted youth support service\n- Education employment & training team\n- Youth justice\n- Climate action team\n- Apprenticeships"
        },
        {
            "text": "Most recently the centre delivered provisions for the Department for Education summer holiday activities and food programme (HAF), engaging young people in receipt of benefit-related free school meals in activities that included; inventors academy, future technologies and music-videography workshops. This programme helped to successfully engage teenagers that weren’t offered opportunities across other HAF providers, “I would be sat in my room all summer if not here” commented one participant."
        },
        {
            "text": "Funding requires we provide a daily meal, and so we linked up with a nearby burrito restaurant, popular with teenagers, and provided fresh fruit and refreshments across the day."
        },
        {
            "text": "We have also had the opportunity to support community members to launch their own youth activity start-up. Get Fed CIC, an organisation that supports schools with young people at risk of exclusion and exploitation by introducing them to entrepreneurial skills through operating their very own coffee van, was one of these."
        },
        {
            "text": "During the British Library launch of the Democratising Entrepreneurship 2.0 report hosted at House of Lords, one of the young people supported by GET Fed was able to attend, having never visited London before and impressing dignitaries with his enthusiasm."
        },
        {
            "text": "The work with young people has received a lot of attention both internally within the local authority and externally, with BIPC Oxfordshire recently winning the libraries connected ‘children’s promise award.’"
        },
        {
            "text": "We have had many wins with our youth engagement approaches in the first year of delivery. As we continue to map the Oxfordshire eco-system more opportunities to engage young people within the library in innovative, collaborative, and impactful ways present themselves. Our arms remaining wide open to support all community members, ideas and opportunities."
        },
        {
            "text": " "
        }
    ]
}