{
    "url": "https://ukhsa.blog.gov.uk/2023/09/11/using-the-power-of-data-to-build-the-uks-health-security/",
    "title": "Using the power of data to build the UK’s health security  ",
    "authors": [
        "Steven Riley"
    ],
    "categories": [
        "UKHSA"
    ],
    "pub_date": "2023-09-11T13:00:28+01:00",
    "content": [
        {
            "text": "Data is now the driving force of the world’s modern economies, fuelling innovation and progress."
        },
        {
            "text": "Data is equally essential to health security, underpinning our ability to prepare for, prevent and respond to health threats so we can save lives and protect livelihoods."
        },
        {
            "text": "Like many other government departments, health, and scientific organisations, UKHSA handles a lot of data."
        },
        {
            "text": "In today’s rapidly evolving world, we need to make the best use of that data and provide decision-makers with the right information at the right time to help them understand health security threats."
        },
        {
            "heading": 3,
            "text": "Tackling health security threats"
        },
        {
            "text": "Data will play a crucial role in the delivery of UKHSA’s recently published 3-year Strategic Plan which sets out how we’ll face down challenges from our changing climate and future pandemics through to vaccine preventable disease and antimicrobial resistance."
        },
        {
            "text": "And data is also a crucial tool in tackling health emergencies, as the last couple of years have repeatedly shown."
        },
        {
            "text": "Take tools such as our COVID-19 Dashboard which became invaluable during the pandemic. This brought together data and statistics in one place, keeping the public and leaders across government and the healthcare sector informed."
        },
        {
            "text": "The dashboard was a breakthrough in the democratisation of public data, making information and metrics available to everyone, not just a select few in Whitehall. User feedback confirmed this, with members of the public regularly reporting that they used the dashboard daily to understand their personal risk."
        },
        {
            "text": "The creation of the COVID-19 dashboard demonstrated the UK's ability to create world-class open data products quickly and affordably and we are working on a new dashboard which will act as an important source of data on a wider range of health threats."
        },
        {
            "text": "Likewise, when the mpox outbreak began in May 2022, bringing together the right data to inform the response and protect health was crucial: at national level, via daily reports to local health protection teams and by providing data for clinical trials."
        },
        {
            "text": "There is much to learn from every health incident and outbreak and looking forward we are continuing to iterate our approach to data in response to incidents like this."
        },
        {
            "text": "But it’s not just in times of crisis we need fast, accurate and detailed data."
        },
        {
            "heading": 3,
            "text": "Ensuring a unified approach to data"
        },
        {
            "text": "We’re a key contributor to the health data and analysis landscape, with this in mind, we need to lead a data transformation and data culture change."
        },
        {
            "text": "This means further capitalising on our partnerships and fostering greater collaboration and innovation."
        },
        {
            "text": "We also want to be transparent with our data and release more data and statistics that the public can access. Public trust in us shouldn’t be assumed but earned through our actions and behaviours."
        },
        {
            "text": "And we want to keep developing as a high-performing agency, known as a career destination of choice for data professionals - attracting, recruiting, rewarding, and retaining great people."
        },
        {
            "text": "Keeping pace with innovation in data engineering, epidemiology, data science, modelling and health economics will ensure we grow our talent while protecting health."
        },
        {
            "text": "With all this in mind, it’s the perfect time for us to launch our data strategy – a unified approach to data which supports our 3-year strategic plan."
        },
        {
            "heading": 3,
            "text": "A new data strategy for UKHSA"
        },
        {
            "text": "Our data strategy sets out 5 guiding principles. These principles support us to use data in a better way and manage our data in ways that make it easier to re-use securely, legally and ethically:"
        },
        {
            "text": "Our guiding principles will underpin all aspects of our work as we collect, analyse and share high-quality health data in a timely way to advance public health outcomes."
        },
        {
            "text": "Partnerships have always been a crucial part of public health but the pandemic demonstrated what can be achieved when Government, industry and academia work together, so our strategy is focused on building deeper and stronger partnerships. We will maintain the spirit of collaboration and momentum from the past few years to tackle all health threats. This includes striving to be a trusted partner to wider Government and beyond, known for secure and modern data handling."
        },
        {
            "heading": 3,
            "text": "Opportunities offered by data"
        },
        {
            "text": "Having a single, coherent view of what data we have, how we are using it, and what work is being done to change and improve how we collect, store, and use data, presents us with opportunities. We will be more efficient by finding and sharing data quicker, reusing existing data, and reducing duplication of work."
        },
        {
            "text": "We will be able to better monitor and track the emergence and spread of infectious diseases, identify potential outbreaks, and implement targeted interventions. Work such as our approach to One Health, which aims to improve health security as well as health equity around the world supports global health priorities."
        },
        {
            "text": "Additionally, by being more efficient and effective with our data, we will be able to allocate resources in the most appropriate way."
        },
        {
            "text": "We will be able to improve our data products and services, including the development of public facing dashboards and maximise the use of tech advancements such as machine learning and artificial intelligence."
        },
        {
            "text": "Our laboratory surveillance plays an essential role in detecting and monitoring infectious disease outbreaks. Our data strategy will serve as a guiding framework to continue to deliver and improve our responsive surveillance system."
        },
        {
            "heading": 3,
            "text": "Looking forward "
        },
        {
            "text": "UKHSA is a unique organisation with an ability to combine data analytics and science with expertise in operational response, acting together to protect public health."
        },
        {
            "text": "By adapting to the changing data landscape, fostering collaboration, and evaluating the maturity of our data, we can unlock our full potential to protect every person, community, business and public service from infectious diseases and environmental hazards, helping to create a safe and prosperous society."
        },
        {
            "text": "I’d encourage you to read our strategy document and engage with us at DataStrategy@ukhsa.gov.uk if you’re interested in sharing knowledge."
        }
    ]
}