{
    "url": "https://naturalengland.blog.gov.uk/2025/01/13/forests-beneath-the-waves-celebrating-our-magnificent-kelp/",
    "title": "Forests beneath the waves: celebrating our magnificent kelp ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Coast and access",
        "Marine environment",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2025-01-13T16:42:33+00:00",
    "content": [
        {
            "text": "Marina Rees, Marine Higher Officer at Natural England"
        },
        {
            "text": "When I joined the Thames Solent team as a marine lead adviser, I jumped at the opportunity to work on a project which delved into the world of kelp. I have long been enamoured with kelp and the species which rely on it – as proven by pictures of myself as a child playing with cast-off strands of seaweed on the shore.   "
        },
        {
            "text": "Kelp, a group of large seaweeds, forms dense forests under the sea. They create some of the most productive habitats on the planet and can be found not far from the shoreline. Kelp forests themselves can act as a buffer against storms, increase oxygen, reduce carbon dioxide and absorb anthropogenic nutrients. What I have always loved about kelp is that they are ecosystem engineers - they create habitat through their structure. This means they provide shelter, nursery grounds, and feeding grounds to a wide array of species, as the kelp forest holds numerous food sources. This includes species such as sea snails, sea urchins and limpets. Despite their resilience however, they are at risk from disappearing from our seas – in the Northeast Atlantic, both their reduced distribution and decreased genetic diversity have been reported."
        },
        {
            "text": "Over the summer of 2023 we commissioned a team of film makers, led by Dr Ian Hendy from the University of Portsmouth to film kelp forests in the waters around the Isle of Wight, Devon and Cornwall. The team set out with a clear aim, to capture the beauty as well as the function of this important habitat, highlighting the many species that rely on it. ‘Forests Beneath the Waves’ was born."
        },
        {
            "text": "But why is it so important to talk about kelp, some may ask? In the film we see an undulate ray and two-spot gobies hiding from predators, a nursehound shark looking to lay her egg in a safe place, and a seal hunting for food. A whole world in an underwater forest that would usually be unknown to us land-dwelling creatures. Raising awareness of the importance of kelp is necessary to safeguard its future."
        },
        {
            "text": "In past decades, a strong decline of kelp across the world has been observed, including in the UK. Climate change is a big factor. I have myself witnessed the increase of bleached kelp during heat waves, and escalating storms destroying entire parts of kelp forests. The warming waters induce a change of ecosystem too. Species of kelp are starting to migrate north, and non-native species of both seaweeds and animals are arriving in the UK. In the film, the eerily graceful and luminous crystal jellyfish is captured, a species common in the warm waters of the Pacific Ocean, but a visitor to our seas. "
        },
        {
            "text": "Other factors contributing to the decline of kelp forests include increased nutrients, through run-offs from agriculture and other human activities, bottom trawling practices in fisheries, ecosystem imbalance favouring kelp grazers, and pollution of inorganic metals. "
        },
        {
            "text": "I specifically chose a career focusing on the sea to inject hope into the world. While we cannot stop all those factors of decline, together we can work to reduce those pressures on kelp forests, helping them become more resilient to what this changing planet is throwing at them."
        },
        {
            "text": "Forests Beneath the Waves was created with the aim to reach out and enthuse people about our wonderful kelp forests. Already, some communities are rising to mitigate losses, as the Sussex Kelp Recovery Project shows:"
        },
        {
            "text": "Rewilding the Sussex seabed | Sussex Kelp Recovery Project"
        },
        {
            "text": "There are many ways people can individually help, through volunteering, donating, or simply spreading awareness about the world of kelp."
        },
        {
            "text": "From fan worms to juvenile wrasses, cuttlefish to dogfish, the film captures only a small fraction of the life that is teaming within the swaying, underwater forests. But it is enough to paint a picture of the wonders that can be found beneath the waves and hopefully spark greater interest from all those that see it."
        },
        {
            "text": "Forests Beneath the Waves is now available to watch below. I hope this film will make you fall in love with kelp forests too. "
        },
        {
            "text": "The film Forests Beneath the Waves was produced alongside the launch of a children’s book about kelp: Captivating Kelp Forests, second in the series “Discovering Marine and Costal Habitats”. "
        }
    ]
}