{
    "url": "https://insidedio.blog.gov.uk/2025/01/13/life-on-the-range/",
    "title": "Life on the Range",
    "authors": [
        "Pete Chamberlain"
    ],
    "categories": [
        "Military Training",
        "Training Estate Public Safety",
        "Working at DIO"
    ],
    "pub_date": "2025-01-13T17:16:15+00:00",
    "content": [
        {
            "text": "I am the Training Safety Marshal for East Anglia Training Areas which includes Barton Road Rifle Range. Barton Road Rifle Range is about 1,200 yards long and one of only three bracketed ranges in the UK, meaning that there are several brackets up to 1,200 yards in 100m increments. The University of Cambridge provided the land on which Barton Road Rifle Range sits.  "
        },
        {
            "text": "We take the safety of the public very seriously and during live firing, our wardens close the gates. When the firing ends, we open them to allow members of the public the access through, as there are public footpaths on either side of the range. We hardly ever get incursions of people on the range and once the gates are closed, people are kept out and understand why.  "
        },
        {
            "text": "My primary role is to ensure that the range and its users operate in a safe manner, I am basically there to oversee that we provide a safe place to train. I regularly speak to the various units, ensuring that everything such as the electronic and wooden targets we provide is working as it should. At the end of their various firing sessions, I conduct a debrief, listening to ideas about the services we provide, including any suggestions about improvement to various aspects of the range, which I then feedback through the system. I am also responsible for authorising the use of the training areas on the range for both live firing and dry firing, so my job as Training Safety Marshal is wide-ranging.   "
        },
        {
            "text": "On a normal day, once the firing stops, I spend a lot of time going around the range and the danger areas to ensure that little things, such as the signage warning the public to keep off certain areas, are in order, correctly and properly maintained and displayed. I spend my time also liaising with the Landmark Support Services to make sure they have all they need on a day-to-day basis.    "
        },
        {
            "text": "The range is also home to numerous types of wildlife, including deer that pass through the range on a regular basis. We have buzzards and nesting red kites in the trees that have returned to the range for some years now.   "
        },
        {
            "text": "For me, the most interesting thing about my job is meeting the different people that come in all the time. I enjoy the meet and greet aspect of the job, and I have a short chat with units coming in to use our ranges. Sometimes, when they see me coming over, they stop firing, thinking that I have come to reprimand them, but in fact, I enjoy going around and interacting with different people, that for me is the fun part of this job. "
        }
    ]
}