{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/07/12/become-a-gse-member-and-well-plant-a-tree/",
    "title": "Become a GSE member and we’ll plant a tree",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Profession Updates"
    ],
    "pub_date": "2021-07-12T07:00:55+01:00",
    "content": [
        {
            "text": "Today we are proud to launch the new Government Science & Engineering (GSE) Profession Strategy."
        },
        {
            "text": "The Strategy sets out how we will support our people to make a real difference through government science and engineering, alongside our priorities for years to come. We want this Strategy to encourage people to join our profession, access our offers, and identify and develop their science or engineering skills."
        },
        {
            "text": "We want to say a special thanks to our members and volunteers who have collaborated with the Profession to develop this Strategy. We understand the importance of having a diverse and inclusive membership and have listened to our stakeholders throughout the Strategy’s development."
        },
        {
            "text": "To ensure we can embed scientific knowledge and experience into every corner of decision making, the GSE Profession has teamed up with Forestry and Land Scotland and Natural Resources Wales on a special membership offer from Monday 12th to Friday 16th July 2021."
        },
        {
            "text": "For every 100 new members who sign up to the GSE Profession, the GSE team will plant a tree. Become a member now by filling out this simple form, it takes less than 60 seconds!"
        },
        {
            "text": "For existing members, we will plant a tree for every 150 members who resubmit their details through our new membership tool by completing this quick and easy form."
        },
        {
            "text": "Any crown, civil or public servant with an interest or background in science and engineering can be a GSE member, but are you aware of the benefits? The Strategy outlines how the GSE Profession can support you in lots of ways, from supporting your learning and development goals, connecting you with fellow scientists and engineers, to helping you find specialist expertise to strengthen your work. Evidence is the cornerstone to successful decision making, and we want to support you in finding and using this."
        },
        {
            "text": "Find out all about our Strategy at our live launch event on 14th July from 14:00 – 15:00, hosted by Sir Patrick Vallance, with a senior panel discussion. Register for the event here."
        },
        {
            "text": "Our Head of Profession and Government Chief Scientific Adviser, Sir Patrick Vallance, says: “With your support, we will continue to build on the hard work and lessons learnt over the past year and act together to put science and engineering at the heart of Government decision making”."
        },
        {
            "text": "The strategy sets out how we will support our people to reach our new vision: ‘making a real difference through government science and engineering’. The strategy contains two strategic drivers:"
        },
        {
            "text": "It also sets out ambitious plans delivered against six new work themes: Expertise, Interchange, Inclusivity, Learning and Development, Talent and Leadership."
        },
        {
            "text": "We have worked hard to ensure our drivers and goals aligned with the new Government Reform by supporting priorities such as building science, engineering and technology expertise across government, incentivising our deep subject experts, and helping to secure the UK as a science superpower."
        },
        {
            "text": "So, whether you’re a new or existing member we want you to get involved!"
        }
    ]
}