{
    "url": "https://aphascience.blog.gov.uk/2021/07/12/bee-inspector/",
    "title": "Life as a Seasonal Bee Inspector",
    "authors": [
        "Avril Earl"
    ],
    "categories": [
        "Bee health"
    ],
    "pub_date": "2021-07-12T10:00:07+01:00",
    "content": [
        {
            "text": "Today, 12 July, marks the start of Bees’ Needs Week. This year, Avril Earl talks about how she became a Seasonal Bee Inspector and why she loves her job."
        },
        {
            "text": "This is my third season as a Seasonal Bee Inspector (SBI) for Wiltshire, Southern Region. And what an amazing, unusual and unexpected time I am having."
        },
        {
            "text": "After more than 30 years as a pharmacy technician, I took early retirement in 2019 and was looking forward to spending more time with my eight beehives in a local field. Little did I know that I would soon be spending a lot more time with bees – though mostly not my own."
        },
        {
            "text": "The job of an SBI in my county was to work four days a week from May through to August - I thought this would allow me to become semi-retired so I applied, even though I was not sure if the job was for me or that I had the right experience. I was elated to receive an invitation to the National Bee Unit’s headquarters at Sand Hutton near York for an interview. The interview was a combination of identifying bee disease and non-native pests as well as a practical test of our skills at a hive site and a verbal interview."
        },
        {
            "text": "I was delighted to get the job, covering Wiltshire, for the Southern Region and was lucky to shadow Kevin Pope, a very experienced inspector for Dorset. He showed me how to become an inspector, and how to deal with disease outbreaks and with shocked beekeepers!"
        },
        {
            "text": "After demonstrating competency, I was inspecting on my own."
        },
        {
            "text": "Sometimes visits are in response to calls from beekeepers worried that they have found something suspicious in their colonies. If a photo is not enough or if I think there is a problem, I will arrange a visit. Our target is three apiaries a day, conducting thorough disease inspections on a minimum of 15 colonies so I can drive many miles a day as Wiltshire is a big county."
        },
        {
            "text": "When not responding to calls, I choose areas for selective visits, usually those near to disease hotspots. BeeBase (our online bioinformatics database) shows where there have been disease incidents and the location of other apiaries in the area. Fortunately, most people are happy to receive a visit and to be assured that their bees are healthy."
        },
        {
            "text": "Some beekeepers are a little nervous that I may tell them off or give them a lecture, but it is not my job to tell anyone how to keep their bees – my primary role is to look for notifiable diseases and pests and help to eradicate them if they are found."
        },
        {
            "text": "Throughout my first season, the regular meetings with Peter Davies, the Regional Bee Inspector, and my fellow Southern Region SBIs were invaluable. As we work mostly on our own, it is useful to meet colleagues face-to-face to swap information and advice. I am always impressed with the depth of my colleagues’ knowledge. They are always keen to share news and views on the latest research and initiatives. They all care very deeply about helping beekeepers and improving the health of our bees."
        },
        {
            "heading": 3,
            "text": "My other responsibilities"
        },
        {
            "text": "During 2019 I took part in Bee Health Days, which educate beekeepers in the identification of diseases and best practice."
        },
        {
            "text": "At the end of the season I volunteered to work an extra month to identify the Asian Hornet - Vespa velutina, also known as the yellow-legged hornet, a non-native that is in France and Jersey and threatens to establish itself here (pictured above). It is potentially a threat to our UK honeybee population and other native pollinators."
        },
        {
            "text": "Asian hornets were reported in Christchurch in 2019 and Gosport in 2020 and I have been part of both track-and-trace teams. The nests were identified and destroyed which was a great end to both seasons."
        },
        {
            "heading": 3,
            "text": "New challenges"
        },
        {
            "text": "I had expected my second year to be pretty much the same as the first, but COVID-19 hit us however thankfully we are classed as key workers so I was able to continue with my work."
        },
        {
            "text": "It was a stark contrast to the first year that had been so sociable. Most beekeepers allowed me access to their apiaries but kept their distance so there was no help lifting the hives, which can get heavy as they fill with honey. It was also pretty eerie driving around the countryside on empty roads. Occasionally I would be at the bottom of a garden inspecting bees and a face would appear from a back window of the house shouting questions at me. Goodness knows what the neighbours must have thought!"
        },
        {
            "text": "I have come to know some great people in the Bee Unit who have a vast amount of knowledge of which I am in constant awe. I squirrel away gems of information I pick up, which are often a throw-away thought or comment. The training for bee inspectors never stops and there is a programme of continuous professional development. We also work towards a formal City & Guilds qualification."
        },
        {
            "text": "I believe the job of a bee inspector is unique as you need to be a beekeeper to fully apricate the role and the issues facing beekeepers and bee farmers alike."
        },
        {
            "heading": 3,
            "text": "About the National Bee Unit (NBU)"
        },
        {
            "text": "After the Second World War, a government unit was set up to look into best farming practices, including the honeybee and other livestock. The NBU, formed in 1979, has gone through various changes and today is part of APHA."
        },
        {
            "text": "Our purpose is to identify notifiable bee diseases and to look for non-native species. We also research best practice in the control of Varroa which continues to be a problem to bees, so the NBU also advises beekeepers on how to manage this parasitic mite."
        },
        {
            "heading": 3,
            "text": "Want to know more?"
        },
        {
            "text": "BeeBase is the APHA’s National Bee Unit website and is a key information resource for beekeepers."
        },
        {
            "text": "You may also enjoy some of our previously published bee health related blogs."
        },
        {
            "text": " "
        }
    ]
}