{
    "url": "https://deframedia.blog.gov.uk/2021/07/12/buzzing-for-bees-needs-week-2021/",
    "title": "Buzzing for Bees’ Needs Week 2021",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-12T12:06:37+01:00",
    "content": [
        {
            "text": "The Defra-coordinated annual Bees’ Needs Week kicked off today to highlight what everyone can be doing at home to care for bees and other pollinators."
        },
        {
            "text": "There was positive coverage in The Daily Telegraph, Daily Express, Daily Star, Farming UK, Scottish Farmer and Horticulture Week reporting that gardeners as well as farmers and managers of urban green spaces are being encouraged to cut their grass less and let their gardens go wild to help bees, while also limiting pesticide use and growing more shrubs to help improve soil health and store carbon."
        },
        {
            "text": "Bees’ Needs Week 2021 sees Defra and several green organisations including Buglife, the Royal Horticultural Society and Bumblebee Conservation Trust, working together to encourage everyone who can to do simple things at home, at work, and in other private and public spaces to help our precious pollinators thrive."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "Natural England CEO, Marian Spain said:"
        },
        {
            "text": "Five simple actions everyone can take to help pollinators and make sure their populations are sustained are:"
        },
        {
            "text": "Another way people can help is by monitoring your local bee and pollinator populations. Spend 10 minutes in the sun to count insects for the UK’s Pollinator Monitoring Scheme (PoMS), and get involved on social media using #beesneeds."
        },
        {
            "text": "This year’s Bees’ Needs Week follows the recent launch of Defra’s new campaign Plant for Our Planet, aimed at inspiring the public to get planting, helping us to build back greener from the pandemic and step up our efforts to tackle climate change and biodiversity loss. To get involved download our partner pack here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}