{
    "url": "https://hodigital.blog.gov.uk/2021/07/12/our-home-office-2024-ddat-strategy-is-published/",
    "title": "Our Home Office 2024 DDaT Strategy is published",
    "authors": [
        "Rob Thompson"
    ],
    "categories": [
        "DDaT Strategy",
        "Transformation"
    ],
    "pub_date": "2021-07-12T16:23:52+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Every now and then we need to evaluate where we are and map out our future."
        },
        {
            "text": "In Home Office Digital, Data and Technology (DDaT) we’ve just published our 2024 DDaT Strategy which sets out how we'll prioritise your needs, deliver more value and run Home Office DDaT more innovatively and efficiently."
        },
        {
            "text": "The strategy embeds a new digital mindset that’s dedicated to bold, transformative principles."
        },
        {
            "text": "It sets out how we'll become product-centric and collaborative in our operations, and data-driven in our design and decision-making."
        },
        {
            "heading": 2,
            "text": "Publishing our strategy in the open"
        },
        {
            "text": "We’ve published our strategy on GOV.UK to allow us to have a narrative of change in the open."
        },
        {
            "text": "Being open like this is part of our DDaT culture. Not only is it good practice to be transparent, but it's also how we make things better."
        },
        {
            "text": "We invite your feedback on our strategy, and plan to update it in response. Please leave your thoughts on the strategy in the comments below."
        },
        {
            "heading": 2,
            "text": "Six core principles for change"
        },
        {
            "text": "There are six digital principles at the heart of our 2024 DDaT Strategy. They are:"
        },
        {
            "heading": 2,
            "text": "Converging technology and creating shared technology products"
        },
        {
            "text": "We are streamlining our technology and data estates and unifying systems and products that try to solve the same or similar problems. By reducing this duplication and adopting open source and cloud technologies that are scalable and maintainable, we will get to a more converged place. Technology convergence allows us to bring systems together to do more with less."
        },
        {
            "text": "We’ll create and embed standards for the way we buy, build and run software and become more transparent over our estate by creating things like product and technology registers."
        },
        {
            "text": "Wherever there’s a digital service or technical component that’s likely to be needed by different areas of the organisation we will build it as a shared product."
        },
        {
            "text": "We'll invest in documentation and knowledge management to help us achieve this, creating common resources like style guides, pattern libraries, and design systems."
        },
        {
            "heading": 2,
            "text": "Becoming product-centric and data-driven"
        },
        {
            "text": "We will become product-centric, not project-centric."
        },
        {
            "text": "A project is a temporary endeavor with fixed outputs, costs and timescales. Instead we will focus on the impact that products have. This will ensure we don’t tie decisions to assumptions made at the beginning of a project. Decisions will be driven by the needs of users."
        },
        {
            "text": "Being product-centric will ensure we create products that are long-lived. We will evolve as needs and technologies change."
        },
        {
            "text": "Data has become our primary asset. By transforming the way we think about architecting our systems, we’ll make data central to the design. We will focus on how we use and maintain data sets, using data models, metadata and data standards wherever possible."
        },
        {
            "heading": 2,
            "text": "Delivering effectively at scale and embracing innovation"
        },
        {
            "text": "We will transition to digital ways of working, moving from traditional siloed structures with defined hierarchies to empowered networks of multidisciplinary product teams who decide what’s best for their product."
        },
        {
            "text": "Our people will work in the open, proposing innovative ideas, experimenting and designing creative solutions collectively."
        },
        {
            "text": "We’ll build an innovation community and use a central Innovation Pipeline to help us explore ideas that will create the most impact for the services we design for you."
        },
        {
            "heading": 2,
            "text": "We want your feedback"
        },
        {
            "text": "When I joined the Home Office, I blogged about some of the challenges we face. We’ve made many improvements since then. This strategy will go further by delivering innovative product-centric, data-driven services for the public good."
        },
        {
            "text": "Read our Home Office 2024 DDaT Strategy here. We welcome your feedback so please leave your comments below."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}