{
    "url": "https://deframedia.blog.gov.uk/2021/07/12/southern-water-fined-record-90m-for-dumping-sewage/",
    "title": "Southern Water fined record £90m for dumping sewage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-12T17:14:06+01:00",
    "content": [
        {
            "text": "There was extensive media coverage this weekend of a record £90 million fine handed to Southern Water on Friday (9 July) following an Environment Agency investigation."
        },
        {
            "text": "The Times, Guardian, Daily Mail, Financial Times, Mirror, Telegraph and I paper covered the sentencing by the Honourable Mr Justice Johnson, who ordered the company to pay the record fine after pleading guilty to thousands of illegal discharges of sewage into rivers and coastal waters in Kent, Hampshire and Sussex between 2010 – 2015. The case is the largest criminal investigation in the Environment Agency’s 25-year history."
        },
        {
            "text": "Southern Water is required by permit to properly treat wastewater so as to protect the environment. Instead, the court heard the company admit to causing thousands of illegal discharges lasting a total of 61,704 hours. The court was also told Southern Water deliberately presented a misleading picture of compliance to the Environment Agency, hindering proper regulation of the company."
        },
        {
            "text": "The fine will be paid out of company operating profits – protecting customers from having to pick up the tab for illegal pollution."
        },
        {
            "text": "Chair of the Environment Agency, Emma Howard Boyd said:"
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "The Environment Agency has worked closely with Ofwat, the economic regulator, which imposed a £126 million penalty on SWS in 2019 as a result of the company’s regulatory failings over the same period. The sentencing was part of the criminal investigation into permit breaches and environmental harm."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}