{
    "url": "https://educationhub.blog.gov.uk/2021/07/what-you-need-to-know-about-exams-in-2022/",
    "title": "What you need to know about exams in 2022",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Exams and qualifications"
    ],
    "pub_date": "2021-07-12T16:02:13+01:00",
    "content": [
        {
            "text": "*This page was last updated on 12 August 2021. "
        },
        {
            "text": " Students studying A levels, GCSEs and vocational and technical qualifications are expected to sit exams and other formal assessments next year, as the best and fairest way to assess their performance.  "
        },
        {
            "text": "We recognise the disruption young people have faced in the last 18 months which will still affect students sitting those exams and assessments.  "
        },
        {
            "text": "That’s why we and Ofqual have consulted with students, their parents and their teachers on proposals that will allow exams and assessments to take place while making adaptations to take into account the impact of the pandemic.  "
        },
        {
            "text": "We answer your questions on what you need to know about the proposed approach for 2022.  "
        },
        {
            "heading": 3,
            "text": "Will exams go ahead in 2022?  "
        },
        {
            "text": "We believe exams are the best and fairest form of assessment and our firm intention is that exams and other formal assessments will go ahead in 2021/22. We are also working with Ofqual on contingency plans in case it does not prove possible for exams to go ahead safely and fairly, and will publish these in the autumn.  "
        },
        {
            "text": "In order to ensure that exams can go ahead fairly, we must recognise that students in the 2021/22 cohort have experienced significant disruption to their education, and we are proposing that exams and assessments in 2022 should be adapted to take this into account.   "
        },
        {
            "text": "Earlier this year, we and Ofqual jointly consulted on changes to exams and assessments in 2022 to take account of this disruption. The suggested arrangements for GCSEs, AS and A levels include choices about the topics students will be assessed on for some subjects, and giving schools and colleges advance information about the focus of content of the exams for other subjects. "
        },
        {
            "text": "The outcome of the consultation on Vocational and Technical Qualifications (VTQs) confirmed the adaptations allowed for these exams and assessments in 2021/22. "
        },
        {
            "heading": 3,
            "text": "And what about grading in 2022?  "
        },
        {
            "text": "It’s vital that students and families have confidence in the grades they’re receiving, just like they can this year.  "
        },
        {
            "text": "Ofqual will be giving a clear indication of the grading system for 2022 in the autumn term. We are asking them to ensure that they are as fair as possible to students taking qualifications that summer, to those who took them in previous years, and to those who will take them in the future.  "
        },
        {
            "heading": 3,
            "text": "Are you going to overhaul the A level grading system and move to a numerical scale? "
        },
        {
            "text": "No decisions have been made about grading in the longer term – although we can be clear now that no such widescale reform will be implemented for summer 2022. "
        },
        {
            "text": "Changing the grading scale is one of a number of options under consideration, however any reform on this scale would take a great deal of time and consideration before it was implemented.  "
        },
        {
            "heading": 3,
            "text": "How will you make assessments fair?  "
        },
        {
            "text": "Our proposals will help to ensure exams and assessments will be as fair as possible.  "
        },
        {
            "text": "For GCSE, AS and A levels in summer 2022 the proposals include:  "
        },
        {
            "text": "Ofqual is also considering how best to grade qualifications in 2022 in a way that is as fair as possible to that cohort, as well as to past and future students.  "
        },
        {
            "heading": 3,
            "text": "But why don’t you scrap GCSEs altogether as two cohorts now haven’t sat them?  "
        },
        {
            "text": "Teachers and students have done brilliantly this year to make sure the grades awarded this week worked for them, and enabled young people to progress.    "
        },
        {
            "text": "But exams are the best and fairest way to determine a student’s abilities, and they will continue to be.   "
        },
        {
            "text": "They are the best way to prepare young people for higher study and the world of work, and we strengthened them a few years ago following feedback from employers and universities to make sure they were providing that vital preparation young people need.  "
        }
    ]
}