{
    "url": "https://digitalhealth.blog.gov.uk/2018/11/12/health-product-people-designing-and-delivering-better-health-and-care-digital-services/",
    "title": "Health Product People: designing and delivering better health and care digital services",
    "authors": [
        "Dharmesh Chauhan"
    ],
    "categories": [
        "Capability",
        "Health Product People",
        "Services and products"
    ],
    "pub_date": "2018-11-12T11:02:31+00:00",
    "content": [
        {
            "text": "The Health Product People community was started in January 2018 to bring together people working on digital services across the health and care space to share ideas, collaborate and work together to solve problems. The Health Product People community builds on the good work of the cross-government product and service community."
        },
        {
            "text": "At our seventh event, we looked at designing and delivering better health and care digital services.\n\nWe had attendees from the Department of Health and Social Care, Care Quality Commission, NHS Digital, Public Health England and wider government. In total we had 11 people dialing in remotely, and 25 people in the room!\n"
        },
        {
            "text": "The event was split into six parts:"
        },
        {
            "heading": 3,
            "text": "Update from the Department of Health and Social Care"
        },
        {
            "text": "Our new Secretary of State, Matt Hancock, is passionate about transforming the NHS and Social Care.\n\nWe’ve seen the release of the vision for digital, data and technology in health and care and code of conduct for data-driven health and care technology. A special shout out goes to the department’s digital strategy and technology team for all their hard work on this. \n\nKatie Regan, Digital Capability Lead, highlighted all the hard work the department is doing to ensure we are digitally capable and ready for the future. Katie talked about reverse mentoring initiatives and running digital week with over 25 events. "
        },
        {
            "text": "Colin Pattinson, Product Manager, talked about going into Beta on the Healthy Start project, which provides support to improve the diets of low income pregnant women and families with children under the age of four. "
        },
        {
            "text": "I talked about the Medical Examiner programme, a new way of certifying the cause of death in England and Wales. This project is about to move into alpha - so stayed tuned for an update in the near future."
        },
        {
            "text": "Show and tells"
        },
        {
            "text": "Matt Edgar, Head of Design, NHS Digital"
        },
        {
            "text": "Matt talked about using human-centered design and supporting people’s understanding to help them take control of their health and care. Here’s some of the highlights of that talk:"
        },
        {
            "text": "You can read more about Matt's talk here."
        },
        {
            "text": "Kassandra Karpathakis, Digital Strategy Lead, Public Health England"
        },
        {
            "text": "Kassandra talked about her work improving how we measure the success of the services we make. Here’s some of the highlights of that talk:"
        },
        {
            "text": "Ian Roddis, Lead Product Manager, NHS Digital"
        },
        {
            "text": "Ian talked about developing a service manual that provides advice on building good digital services. Here’s some of the main highlights from his talk:"
        },
        {
            "text": "Hadley Beeman, Chief Technology Advisor to the Secretary of State, Department of Health and Social Care"
        },
        {
            "text": "Hadley talked about the Secretary of State, Matt Hancock’s priorities, and what is needed to improve health and care products and services. Some highlights:"
        },
        {
            "text": "Retrospective — reflecting on the event"
        },
        {
            "text": "In our efforts to make this community helpful to our colleagues, we then ran a short start/stop/continue retrospective to see what we should begin doing, what we need to stop and what should continue. Below are the responses."
        },
        {
            "heading": 3,
            "text": "Continue"
        },
        {
            "heading": 3,
            "text": "Start"
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "After each event we record feedback on a Trello board and use it to keep the sessions both interesting and useful. We always welcome suggestions for future events so do get in touch. "
        },
        {
            "heading": 3,
            "text": "Joining the Health Product People community"
        },
        {
            "text": "Are you part of the Department of Health and Social Care? Are you part of one the department's Arm Length Bodies? Interested in sharing your ideas and work with others?"
        },
        {
            "text": "If you answered yes to any of these questions, please contact dharmesh.chauhan@digital.dh.gov.uk or colin.pattinson@digital.dh.gov.uk with information about who you are, your role and the service you are working on."
        }
    ]
}