{
    "url": "https://defraenvironment.blog.gov.uk/2023/11/15/biodiversity-net-gain-for-land-managers-step-by-step-flowcharts/",
    "title": "Biodiversity Net Gain for land managers – step by step flowcharts",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Land Use"
    ],
    "pub_date": "2023-11-15T16:18:10+00:00",
    "content": [
        {
            "text": "With the January launch date around the corner, the market for Biodiversity Net Gain offers many potential opportunities for land managers, but what steps do land managers need to take to sell to this new ecosystem service market? Katie Gowers, BNG’s metric policy lead at Defra, has put together some helpful flowcharts to guide land managers through the process, and to consider the different sale options."
        },
        {
            "text": "You can access the flowcharts here: BNG flowcharts for landowners"
        },
        {
            "text": "We have published guidance on how land managers can sell biodiversity units here, with more detailed information to follow in late November."
        },
        {
            "text": "Below, Katie takes us through the different stages of the sale:"
        },
        {
            "text": "You must own the land or manage it on behalf of the landowner (and be able to demonstrate you have their consent to undertake BNG on that land – but more on that later). When you’ve identified a piece of land you’d like to explore BNG opportunities on, check the land registry to see the registered title, and if that land has other constraints."
        },
        {
            "text": "If you’re a tenant farmer, you absolutely can sell units, but you will need agreement from the main landowner. Likewise, a landowner will need agreement from affected tenants to undertake BNG."
        },
        {
            "text": "You can create or enhance habitats to sell biodiversity units, for off-site BNG. The first step in this process is to carry out a baseline habitat survey to determine what habitats are present on their land and what condition they’re in."
        },
        {
            "text": "Think about what habitats you want to create or enhance. They may agree to create or enhance certain habitats to sell the units to a specific development, or they may create habitats and sell the units to a developer later (known as habitat banking)."
        },
        {
            "text": "You should also think about your land within the wider landscape. Try to deliver joined up, complementary habitats where you can and find out what habitats your local area would benefit from. This will be set out in Local Nature Recovery Strategies (LNRS), which are being produced across the country with the explicit intention of assisting better targeting of BNG and nature recovery activities more generally. You can find out which LNRS your land comes under here. Your local responsible authority will be managing landowner engagement and setting expectations for the area’s LNRS. If an LNRS is not published for your land, ask your local planning authority (LPA) for a draft version, or for the strategy they are applying in the area until the LNRS is published."
        },
        {
            "text": "The habitat baseline and planned enhancements for the site can be entered into the biodiversity metric to give land managers an idea of biodiversity unit outputs. The number of units generated will vary depending on the timing of the habitat creation and the location of the development they are sold to. You can find out more about the impact of these factors in the biodiversity metric guidance here."
        },
        {
            "text": "To sell units, you’ll need to commit to creating and managing habitats for at least 30 years under a legal agreement. This legal agreement must be either a planning obligation (section 106 agreement) with their local planning authority, or a conservation covenant agreement with a Responsible Body. Land managers will also need to agree a habitat management and monitoring plan that sets out how they intend to achieve the planned habitat enhancements. Confirmed Responsible Bodies, which are needed for land managers to enter a conservation covenant, will be published soon."
        },
        {
            "text": "When land has been legally secured, you’ll need to register their land on the Biodiversity Gain Site Register. There will be a registration fee, the price will be confirmed in guidance. This will be a digital service in which land managers will supply information about their land and planned habitat enhancements. If you’re applying on behalf of the legal landowner, or as a tenant, you’ll need to provide evidence that you have the landowner’s consent to register the land. Details will be provided in guidance. Once approved, information for biodiversity gain sites in the register will be publicly searchable."
        },
        {
            "text": "If you already have an agreement with developers, there will be an option to apply to register land and link specific biodiversity units to a development at the same time."
        },
        {
            "text": "The register will become available when BNG becomes mandatory."
        },
        {
            "text": "Land managers who are habitat banking will then have to agree to sell units to developers. Developers must purchase units for the habitat types which they have impacted. The cost of units will need to cover the costs of creating or enhancing the habitat, any necessary monitoring, and maintaining it for a minimum of 30 years: you can find more details in our land manager guidance page here."
        },
        {
            "text": "After agreeing the sale, which development the biodiversity gains are allocated to will need to be recorded on the register. Local Planning Authorities will check that developments have the correct allocations before approving their biodiversity gain plan. Once approved, their development can commence."
        },
        {
            "text": "If habitat creation has not yet started, you can begin work to create habitats or enhance existing habitats. Any habitats will then need to be managed and monitored for at least 30 years in line with the legal agreement and agreed habitat management and monitoring plan."
        },
        {
            "text": " "
        }
    ]
}