{
    "url": "https://deframedia.blog.gov.uk/2023/11/15/coverage-of-nao-report-on-resilience-to-flooding/",
    "title": "Coverage of NAO report on resilience to flooding",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Flood"
    ],
    "pub_date": "2023-11-15T14:51:57+00:00",
    "content": [
        {
            "text": "There is widespread coverage this morning of a report by the National Audit Office into the Government’s long-term ambition to create a nation more resilient to future flood and coastal erosion risk and whether Defra and the Environment Agency are delivering value for money after two years of the capital programme."
        },
        {
            "text": "The report notes the government has doubled its capital funding in England for the six years to 2027 to a record £5.2 billion to combat the growing dangers from flooding. It suggests, however, that the capital funding is forecast to deliver protection to fewer properties by 2027 than was promised when the capital programme was launched."
        },
        {
            "text": "As with any major infrastructure project, the impacts of inflation and the delays caused by the pandemic have made the original targets more challenging. Inflation alone accounts for between half and two-thirds of the reduction in the forecast for properties better protected."
        },
        {
            "text": "Our long-term approach and ambitious targets remain, ensuring that all those at risk of flooding are better protected and prepared for the future. We will be setting out more detail on this in the coming months. We will continue to deliver all projects that have already been announced. We will continue to develop the pipeline of future projects and will deliver them as fast as capacity and funding allows."
        },
        {
            "text": "The report also looks into the Environment Agency’s maintenance of its assets. The Environment Agency prioritises maintenance where there is significant threat to lives and livelihoods, which was supported by a £200 million investment between April 2022 and March 2023 to ensure assets were ready for winter. At the end of 2022/23, 95% of Environment Agency-maintained flood management assets in high consequence systems were in fair condition or above, which means we would expect these assets to function as designed during a flood. This is an increase from 92% in March 2022."
        },
        {
            "text": "Between 2015 and 2021, the Environment Agency and partners completed more than 850 projects to protect better more than 314,000 homes, nearly 600,000 acres of agricultural land and thousands of businesses and major pieces of infrastructure, funded by £2.6 billion investment in new flood defences. More than 100,000 properties were directly protected from flooding during the recent storms."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "You can find out if you are at risk of flooding by checking your postcode on the government’s website and you can also sign up for flood warnings. You will be alerted by phone, email or text when flooding is expected."
        },
        {
            "text": "Follow Defra on Twitter and sign up for email alerts here."
        }
    ]
}