{
    "url": "https://environmentagency.blog.gov.uk/2023/11/15/day-in-the-life-of-a-monitoring-officer/",
    "title": "Day in the life of a Monitoring Officer",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Our staff",
        "Water"
    ],
    "pub_date": "2023-11-15T15:08:32+00:00",
    "content": [
        {
            "text": "The environment agency (EA) regularly monitors inland and coastal waters as part of its EA2025 commitment to ensure healthy air, land and water. Here, one of the EA’s dedicated monitoring officers, Hannah Pihama, explains why this area of work is so vital."
        },
        {
            "text": "I’m a Monitoring Field Officer in the Wessex Field Monitoring Team, covering Bristol, Bath and Bournemouth.  This involves chemical and ecological sampling to check water quality, including bathing waters. I also undertake fish population surveys - part of my role which I especially enjoy."
        },
        {
            "text": "Every day is different, but here are two standard days for me while out and about in the field:"
        },
        {
            "text": "One day I can be out taking bathing water samples on the northern beaches of Wessex, including Clevedon and Weston.  The Severn estuary has the second highest tidal range in the world and there can be 15 metres difference between high and low tide!  Any samples must be taken within one hour of high tide, so accessing these sites is especially time-sensitive.  Once we’ve taken all our samples, they’re sent to the lab for analysis to test for bacteria, including Escherichia Coli and Enterococci. These types of bacteria can come from a range of sources such as sewage, livestock, wildlife, as well as surface run-off.  The use of pollution risk forecasts also gives us an indication of water quality, and once analysed, the sample findings are reported on the Swimfo database."
        },
        {
            "text": "I also conduct water chemistry sampling and invertebrate kick samples as part of our regular monitoring programme. This involves wading in a river, agitating the bed (with your foot sometimes, hence the name!) and taking samples. Invertebrate kick samples are particularly important as they can give us a clear picture of water quality without the need for chemical sampling.  This is because certain invertebrates can only survive in specific water types - for example mayfly nymphs are only found in highly oxygenated, unpolluted rivers or streams. All this data feeds into national programmes, such as the Water Framework Directive, and plays a vital role in determining the state of our waters."
        },
        {
            "text": "Another day I could be working as Officer in Charge on a fishing survey, which often involves talking to private landowners and fishing clubs in order to gain access. If you’re one of these people who allow us access to your land, then thank you!  These surveys are essential as they give us an important insight into the health of our seas and rivers."
        },
        {
            "text": "To carry out these surveys, we ‘electrofish’ a 100m stretch of river, using a small electrical current which temporarily draws the fish to the anode so that we can catch them very quickly and efficiently, minimising any stress.  We then keep them in an aerated tank filled with water whilst we identify and measure each individual. This enables us to monitor the fish populations in a stretch of river.  Measuring the fish determines the age of the individuals caught, showing us if there is healthy reproduction occurring in our rivers. All the data is uploaded onto our national fish database, with all data available on our Fish and Ecology Data Explorer."
        },
        {
            "text": "As a Monitoring Field Officer, I spend the majority of my time in the field in all weathers and conditions. Whilst this can be challenging at times, it is extremely rewarding to be able to play a part in keeping our waterways healthy and ensuring that the fish population in our rivers and waterways are thriving."
        },
        {
            "text": "At the Environment Agency, we’re dedicated to protecting our air, land and water. To find out about what we’re doing this year to work towards the goals of our EA2025 plan, visit: Environment Agency EA2025."
        }
    ]
}