{
    "url": "https://homeofficemedia.blog.gov.uk/2023/11/15/electronic-travel-authorisation-eta-scheme-factsheet-june-2023/",
    "title": "Electronic Travel Authorisation (ETA) scheme factsheet – November 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-11-15T10:00:37+00:00",
    "content": [
        {
            "text": "The government’s number one priority is keeping the UK safe. To strengthen the security of our border and improve travel, the UK has launched an Electronic Travel Authorisation (ETA) scheme - an ETA is a digital permission to travel to the UK. "
        },
        {
            "text": "ETAs are being introduced as part of our transformation and digitisation of the UK border. They will enable a more efficient customer experience and cement the UK as a world leader in border security.  "
        },
        {
            "text": "The ETA scheme is broadly for visitors who do not need a visa for short stays to the UK, or who do not already have a UK immigration status prior to travelling. "
        },
        {
            "text": "The ETA scheme is open to Qatari nationals, who now require an ETA to travel to the UK. Other nationalities do not need to apply yet. "
        },
        {
            "text": "An ETA costs £10, permits multiple journeys and is valid for two years or until the holder’s passport expires – whichever is sooner.​​ "
        },
        {
            "text": "From 1 February 2024, the scheme will be introduced for nationals of Bahrain, Kuwait, Oman, United Arab Emirates, Saudi Arabia and Jordan. "
        },
        {
            "text": "In the future, the scheme will be implemented worldwide for visitors to the UK who do not currently need a visa for short stays, including European nationals. "
        },
        {
            "text": "How much will an ETA cost? "
        },
        {
            "text": "How do people apply for an ETA? "
        },
        {
            "text": "How many visitors will this impact? "
        },
        {
            "text": " How will an ETA help UK border security? "
        },
        {
            "text": " What will happen if someone is refused an ETA? "
        },
        {
            "text": " How will the scheme work in the context of the Ireland-Northern Ireland border?    "
        },
        {
            "text": " Will Electronic Visa Waivers still be valid? "
        },
        {
            "text": " Are ETAs needed by those transiting through the UK? If so, why?  "
        }
    ]
}