{
    "url": "https://vets.blog.gov.uk/2023/11/15/helping-veterinary-surgeons-keep-dogs-and-humans-free-from-brucella-canis/",
    "title": "Helping veterinary surgeons keep dogs and humans free from Brucella canis",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Disease outbreak",
        "Government Veterinary Services"
    ],
    "pub_date": "2023-11-15T19:37:13+00:00",
    "content": [
        {
            "text": "Brucella canis, is an emerging issue for UK pets, owners, and the veterinary profession. The Chief Veterinary Officers (CVOs) for the UK, Scotland and Wales have issued recommended advice to veterinary surgeons on Brucella canis. The advice is advisory and voluntary, pending further evidence gathering and assessment to inform appropriate potential policy changes."
        },
        {
            "text": "What is Brucella canis?"
        },
        {
            "text": "Canine brucellosis is an infectious disease of dogs that is caused mainly by the bacteria, Brucella canis. Historically the UK has been free of Brucella canis, but the UK is seeing an increasing numbers of cases. All UK cases have been in dogs that:"
        },
        {
            "text": "Infection in people  "
        },
        {
            "text": "Brucella canis is a zoonotic pathogen and, while reported cases of the infection in people are rare, it is likely that some groups of people, such as children under the age of 5, elderly people, and those with compromised immune systems, may experience more severe symptoms if they become infected."
        },
        {
            "text": "In humans, symptoms can include:"
        },
        {
            "text": "Those who deal with imported dogs of unknown provenance, or breeding dogs which may have contact with imported dogs, may be more at risk of exposure to Brucella canis."
        },
        {
            "text": "The UK’s most recent assessment of the risks posed by Brucella canis, has been published by the Human Animal Infection and Risk Surveillance (HAIRS) group and is available at Human Animal Infections and Risk Surveillance group (HAIRS) - GOV.UK (www.gov.uk). The assessment confirms that although the risk to the wider population is very low, in cases where there is close contact with an infected dog, the likelihood of exposure and consequence increases."
        },
        {
            "text": "Symptoms of Brucella canis in dogs"
        },
        {
            "text": "Infection in dogs may not result in obvious clinical signs or may cause a range of clinical signs of varying severity. These can include:"
        },
        {
            "text": " "
        },
        {
            "text": "Disease due to infection of dogs with Brucella canis is not notifiable but detection of the presence of the pathogen was made reportable under amendments to the Zoonoses Order 1989 in 2021. This has allowed the UK to monitor the number of suspect cases to identify if there is evidence of a wider problem of ongoing transmission within the UK dog population.  We are confident this is still mostly a problem associated with imported dogs used for breeding."
        },
        {
            "text": "Diagnosing Brucella canis in dogs"
        },
        {
            "text": "It is recommended that veterinary surgeons take samples for testing when there are obvious and specific clinical signs that raise suspicion of canine brucellosis. This is particularly important for those dogs with a history of import or close association with imported dogs."
        },
        {
            "text": "The UK’s National Reference Laboratory for Brucella canis is the APHA laboratory at Weybridge. For detection of Brucella canis infection, it is recommended that both serological tests Brucella canis SAT (TC1032) and Brucella canis iELISA (TC0116) are undertaken. If either test is positive, then the sample is considered serologically positive. If both tests are negative, then the sample is considered serologically negative. The diagnostic value of some other tests such as lateral flow tests has not yet been verified by the National Reference Laboratory (APHA Weybridge)."
        },
        {
            "text": "For more specific information on recommended testing, please see our frequently asked questions. This includes information on how to submit samples to the APHA laboratory for testing, including from abroad, as well as test costs and diagnostic specificity and sensitivity values."
        },
        {
            "text": "Treatment for Brucella canis"
        },
        {
            "text": "Unfortunately, there is no consistently effective treatment protocol for canine brucellosis. The only way to completely eliminate the risk of transmission of canine brucellosis is by euthanasia of the infected animals. Where owners do not wish to carry out euthanasia, risk reduction steps are recommended to be undertaken for positive animals.  These steps will mitigate the risk of spread to other animals, owners and veterinary personnel handling these animals."
        },
        {
            "text": "To help improve the understanding of the disease amongst veterinary professionals, the"
        },
        {
            "text": "Animal and Plant Health Agency (APHA) have created a Summary Information Sheet Canine-Brucellosis-Summary.pdf (defra.gov.uk) covering further information, including the management of the infection. For public health guidance, visit our Brucella canis: information for the public and dog owners - GOV.UK (www.gov.uk) page."
        }
    ]
}