{
    "url": "https://teaching.blog.gov.uk/2023/11/15/how-pupils-and-schools-are-benefiting-from-artsmark-in-ellesmere-port/",
    "title": "How pupils and schools are benefiting from Artsmark in Ellesmere Port",
    "authors": [
        "Emily Reid"
    ],
    "categories": [
        "Curriculum best practice"
    ],
    "pub_date": "2023-11-15T13:51:25+00:00",
    "content": [
        {
            "text": "For Artsmark Celebration Week we’re shining a light on the amazing work of schools who’ve received Artsmark accreditation for their commitment to arts and cultural education. Emily Reid, assistant headteacher at St. Bernard’s School in Cheshire, shares details on the Artsmark journeys of schools across Ellesmere Port."
        },
        {
            "text": "Can you tell us more about Artsmark in Ellesmere Port?"
        },
        {
            "text": "Back in November 2021, four local arts organisations came together to form the Ellesmere Port Cultural Learning Exchange. These organisations worked with schools and our local community to develop a hyper local plan to help address barriers to accessing arts and culture."
        },
        {
            "text": "This term we’re celebrating 21 schools in Ellesmere being on their Artsmark journey – which is more than double that of 2021 - all thanks to the commitment of individual schools and the hard work of the Cultural Learning Exchange. We’re so proud to be showing our commitment to teaching to support creativity in our community."
        },
        {
            "text": "What impact has prioritising arts and cultural education had on your pupils?"
        },
        {
            "text": "We’ve seen a really positive impact on pupils' wellbeing as a result of this strong commitment to arts and cultural education, which is supporting them to develop a creative mindset."
        },
        {
            "text": "By engaging in arts-based activities, our pupils have become more inquisitive and improved their imagination, collaboration, resilience and problem solving skills."
        },
        {
            "text": "It has been wonderful to see how experiencing high quality cultural opportunities has developed their own sense of identity and helped them make sense of the world around them."
        },
        {
            "text": "What top tips do you have for other teachers and school leaders wanting to teach for creativity?"
        },
        {
            "text": "How do you share best practice across the different schools?"
        },
        {
            "text": "The Ellesmere Port Cultural Learning Exchange hosted Artsmark development sessions for all schools, as well as half termly teacher lunches. These lunches gave teachers the opportunity to reflect on their schools’ current provision and share great ideas about how to enhance it. Through the teacher lunches, local cultural organisations have shared creative offers, school leaders have talked about how they prioritise arts, culture and creativity and creative practitioners have delivered some fantastic (free) CPD."
        },
        {
            "text": "The Cultural Learning Exchange has worked hard to connect schools with local creative practitioners. This doesn’t just involve a practitioner coming in to deliver one session, it is about partnership. Through these partnerships, schools now have a selection of creative practitioners they work with on a regular basis."
        },
        {
            "text": "Find out more about Artsmark"
        },
        {
            "text": "The Artsmark Award is the only creative quality standard for schools and education settings, accredited by Arts Council England."
        },
        {
            "text": "Find out how your school can begin its Artsmark journey."
        }
    ]
}