{
    "url": "https://educationhub.blog.gov.uk/2023/11/15/how-schools-childcare-settings-and-colleges-can-claim-a-free-portrait-of-king-charles-iii/",
    "title": "How schools, childcare settings and colleges can claim a free portrait of King Charles III  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-11-15T14:01:10+00:00",
    "content": [
        {
            "text": "Schools, childcare, further education colleges and other education settings in England can apply for a free framed portrait of King Charles III celebrate the new reign. "
        },
        {
            "text": "The portraits can be displayed in public buildings across the country as a tribute to the new sovereign. Hanging a portrait of the reigning monarch in public buildings is a long-standing British tradition.  "
        },
        {
            "text": "King Charles III was crowned on 6 May 2023. The free portraits offer an exciting opportunity to commemorate the historic occasion, strengthen civic pride, and reflect the new era in our history. "
        },
        {
            "text": "The image of the King in full regalia will be released in December by Buckingham Palace and the scheme is funded by the government.  "
        },
        {
            "heading": 3,
            "text": "Who’s eligible?  "
        },
        {
            "text": "Public authorities across England are able to apply for the free portrait of the King, including the following education settings:  "
        },
        {
            "heading": 3,
            "text": "How to apply for a free portrait  "
        },
        {
            "text": "Eligible education settings can apply for a free portrait by filling out this form before 2 February 2024.  "
        },
        {
            "text": "You’ll need to provide details including the public authority type and name.  "
        },
        {
            "text": "Registrations take around 24 hours to be authorised, although some can take up to a week. If approved, you’ll receive a confirmation email containing your log in details.  "
        },
        {
            "text": "You’ll need to log in to the ordering portal to place and complete your order. Once submitted, you will receive an email confirmation.  "
        },
        {
            "text": "Portraits are expected to be delivered between February and April 2024.  "
        },
        {
            "heading": 3,
            "text": "Can public bodies not eligible claim a portrait?  "
        },
        {
            "text": "Public bodies that aren’t eligible for a free portrait, or eligible bodies wanting additional portraits, will be able to buy extra. Further details will be provided in due course. "
        },
        {
            "text": "You can find answers to your specific questions on the FAQ website. "
        },
        {
            "heading": 3,
            "text": "Resources for schools "
        },
        {
            "text": "There are a number of resources available to primary and secondary schools to help celebrate the King’s reign."
        },
        {
            "text": "For primary schools: "
        },
        {
            "text": "For secondary schools: "
        }
    ]
}