{
    "url": "https://openpolicy.blog.gov.uk/2023/11/15/launching-systemic-a-game-for-applying-systems-change-thinking-to-policy/",
    "title": "Launching “Systemic” - A game for applying systems change thinking to policy ",
    "authors": [
        "vanessalefton",
        "alexfleming"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2023-11-15T13:07:53+01:00",
    "content": [
        {
            "text": "This blog launches “Systemic” – a game that simulates how policy-making systems function and possible shifts that can be made to improve policy outcomes. Systemic has been inspired by the world of board games, and was co-created by Policy Lab and Matteo Menapace, the co-author of ‘Daybreak’. It forms part of our learning from a project aiming to shift complex systems around multiple disadvantage with the Changing Futures Programme. Serious games are one of Policy Lab’s new experimental methods, set out in the launch of our experimental innovation strategy last year.   "
        },
        {
            "heading": 3,
            "text": "Why? "
        },
        {
            "text": "The problems we face today, such as climate change, aging populations and inequality, cannot be fixed by one team or department alone. They require a systems approach. Through our nine-month project for the Changing Futures programme in Department for Levelling Up, Housing and Communities (introduced in our first blog in this series) we learnt policymakers don't often have the time or space to consider the current policy system, and test possible deep-rooted changes. “Systemic” offers a space for reflecting on the current policy system works, and then play-testing changes that might lead to better policy outcomes.  "
        },
        {
            "text": "Having the space to take a systems approach is key for policymakers working on some of today's deep-rooted societal challenges. It is particularly useful to understand complexity and intractable problems. Jennie Winhall and Charles Leadbeater suggest that that the following requires a systemic approach: an issue that appears deep rooted, so that the problem returns even despite attempts to fix them, produces persistent patterns of failure, connects to other issues across components and systems, and reflects fundamental values, purposes and organisational approaches in society.    "
        },
        {
            "text": "You might want to consider trying “Systemic” if the following resonates:  "
        },
        {
            "heading": 3,
            "text": "Introducing “Systemic”  "
        },
        {
            "text": "If this resonates with you, “Systemic” is one way to explore simulating systems change in your policy area. “Systemic” gives you an opportunity to uncover the current rules of policy systems, considering how power, purpose, relationships and resource flows operate within your current system. You’ll then be supported to create a future shared vision and explore aspects of the system which might need to change.    "
        },
        {
            "text": "At the end of this blog, you’ll find an option to download a beta version of Systemic. The game can be played independently or facilitated by Policy Lab in away-days or longer team sessions."
        },
        {
            "heading": 3,
            "text": "Playing “Systemic” will enable you to:   "
        },
        {
            "text": " A policymaker described an early version of the game, “I considered afresh the importance of not taking constraints (I.e. rules or policies) for granted or leaving them untouched - the game pointed towards amending the rules to achieve better outcomes, so I was reminded how policymakers should be bold in re-casting policies.”   "
        },
        {
            "heading": 3,
            "text": "Your turn: Play the game to leap into systemic change  "
        },
        {
            "text": "If this resonates and you are interested in exploring what more effective systems could look like with your team or networks, get in touch. You can facilitate a session of Systemic using our downloadable resources or ask us to facilitate “Systemic” at your next awayday or extended team meeting. We’ll take you through the stages of creating systems change and draw out the frameworks we used to help you explore your policy problem.   "
        },
        {
            "text": "A beta version of “Systemic” is also downloadable. If you’d like to take a go at playing independently, you can print and play with the following materials:  "
        },
        {
            "text": "Credits:"
        },
        {
            "text": "Lead games designer: Matteo Menapace"
        },
        {
            "text": "Lead researcher: Vanessa Lefton"
        },
        {
            "text": "Lead designer: Alex Fleming"
        },
        {
            "text": "Assistant visual designer: Suzie McMurtry"
        },
        {
            "text": "Kindly supported by the Policy Profession Unit "
        },
        {
            "text": "[Amended 15th November 2023]"
        },
        {
            "text": "   "
        }
    ]
}