{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/15/my-experience-in-the-royal-society-pairing-scheme/",
    "title": "My experience in the Royal Society Pairing Scheme",
    "authors": [
        "Rodolfo Barradas"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2023-11-15T14:20:38+00:00",
    "content": [
        {
            "heading": 4,
            "text": "What is the Royal Society Pairing Scheme?"
        },
        {
            "text": "Every year, the Royal Society Pairing Scheme, in partnership with GO-Science, brings together 30 scientists with 30 Parliamentarians and Civil Servants to build stronger links between academia and policy makers.  "
        },
        {
            "text": "I had just started working as a Senior Policy Advisor at DfT based in the Leeds office when I spotted this opportunity advertised in the Science and Engineering Profession newsletter. It immediately caught my attention. I knew that my new role would mean working more closely with researchers than before. Therefore, with the support from my manager, I put my application together, which was a really straightforward process. "
        },
        {
            "heading": 4,
            "text": "The pairing experience  "
        },
        {
            "text": "I was paired with Dr Benjamin Cerfontaine, a Lecturer in Geotechnical Engineering at the University of Southampton working on developing innovative foundations for offshore applications. "
        },
        {
            "text": "The Pairing Scheme has two parts. First, there’s the ‘Week in Westminster’, packed with workshops, shadowing, networking and even a tour of The Royal Society library. We spent some time in Parliament and attended a reception hosted by the Science and Technology Select Committee. It was well worth making the most of it because you get to meet many of the other researchers and make connections beyond your direct pairing."
        },
        {
            "text": "In welcoming Benjamin to DfT’s London office, I endeavoured to showcase the breadth of work that crosses my desk, brought him into meetings and introduced him to as many colleagues as possible, giving him a real glimpse of Whitehall. Plus having a scientist with you is a great conversation starter and we even had a chance to meet Prof Sarah Sharples, DfT’s Chief Scientific Advisor, by passing her in the open-plan office and introducing ourselves.  "
        },
        {
            "heading": 4,
            "text": "Highlights from the scheme "
        },
        {
            "text": "My other highlight was my shadowing visit to Southampton, organised by Benjamin. I got to meet the team behind the Southampton Marine and Maritime Institute, visit the National Oceanography Centre and hear about the latest research on maritime air quality. I observed a live shipping test in the towing tank and toured the impressive National Infrastructure Laboratories. Plus, I got to meet lots of scientists who helpfully explained their research, on everything from renewable energy to railway infrastructure – I've really come away with a renewed understanding (and appreciation!) of geotechnical engineering. "
        },
        {
            "heading": 4,
            "text": "A great opportunity "
        },
        {
            "text": "The Pairing Scheme was a brilliant opportunity to go behind the scenes and take the time to understand each other’s ways of working. I found it really helpful to have the opportunity to start building a network of researchers that I can tap into in the future and get a better sense of what challenges researchers face in engaging with policymakers in government.  "
        },
        {
            "text": "I would really encourage other civil servants to apply. And if you get selected, really take the time to make the most of it. Don’t worry too much about being matched with someone that works in your area either – the team tries its best to align subject areas but understanding the world of academia cuts across any subject area and you might just find yourself having fascinating conversations about topics you never thought about before.  "
        }
    ]
}