{
    "url": "https://ofsi.blog.gov.uk/2023/11/15/one-year-on-the-ofac-ofsi-enhanced-partnership/",
    "title": "One Year On: The OFAC-OFSI Enhanced Partnership",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial Sanctions",
        "OFAC",
        "UK"
    ],
    "pub_date": "2023-11-15T16:35:35+00:00",
    "content": [
        {
            "text": "October 2023 marked one year since the launch of the OFAC-OFSI Enhanced Partnership, an ongoing commitment from two of the world’s leading financial sanctions implementation authorities to deepen their collaboration.  Over the last year, the UK Office of Financial Sanctions Implementation (OFSI) and the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) have worked more closely than ever to exchange best practices, better align sanctions implementation, and more effectively deliver on our shared objectives."
        },
        {
            "text": "As Directors of these organisations, we were delighted to mark the one-year milestone with a multi-day technical exchange in London in October 2023, and together underscore our continued commitment to this partnership."
        },
        {
            "text": "The Enhanced Partnership is a forward leap to ensure the implementation of robust, cutting-edge financial sanctions.  Amidst ever evolving threats to international security, prompted by the global instability resulting from Russia’s illegal and unprovoked invasion of Ukraine, the United Kingdom and United States are working collaboratively to tackle these issues.  This partnership is anchored by a shared vision for the effective implementation of sanctions through the active use of robust authorities, coupled with calibrated exceptions such as general licences and clear messaging and support to the private sector through regular and responsive guidance.  This common picture has allowed us to align our priorities and maximise opportunities for co-operation."
        },
        {
            "text": "Regular Exchanges"
        },
        {
            "text": "Over the past year, the Enhanced Partnership has included quarterly virtual and in-person exchanges at all levels of seniority.  They have enabled colleagues in the United Kingdom and the United States working on challenging cross-jurisdictional issues to explore different perspectives, improve understanding, and identify innovative ways to tackle important issues such as those relating to trust services and digital assets."
        },
        {
            "text": "Joint Industry Guidance and Engagement"
        },
        {
            "text": "OFSI and OFAC issued our first joint fact-sheet to provide further clarity on United Kingdom and United States Russia-related humanitarian authorisations.  We have heard directly from non-governmental organisations (NGOs) and financial institutions that this guidance has enabled them to continue to provide and facilitate aid and support to the world’s most vulnerable populations.  We have also participated jointly on a number of key industry panels and global events, discussing topics such as circumvention, enforcement, and international alignment."
        },
        {
            "text": "The Enhanced Partnership has also seen us undertake joint visits to improve sanctions effectiveness across the globe.  Our visits to countries at risk of sanctions circumvention have helped further inform both ourselves and local government officials about the impacts of our regimes, enabling us to improve compliance with United Kingdom and United States sanctions globally, put out more tailored guidance, and take steps to mitigate unintended consequences."
        },
        {
            "text": "At this year’s in-person technical exchange, officials from both teams explored new ways of tackling our shared challenges.  This included discussion on areas where our respective authorities may differ, such as on ownership and control and reporting requirements, with a commitment to work more closely on these policy areas going forward.  We also shared economic analysis regarding sanctions programmes and committed to further exchanges on this topic.  Both teams agreed to share more data across a range of functions to increase insights, strengthen analytical capacity to inform sanctions programme design and implementation, and identify more ways to strengthen coordination of our ongoing efforts.  We also agreed to explore further areas for joint industry engagement and guidance.  Finally, we are proud to have launched a reciprocal secondee programme, with an OFAC employee now embedded in OFSI and plans to have an OFSI employee at OFAC soon, allowing us to further share and exchange hands-on experience."
        },
        {
            "text": "We also utilised the in-person visit to conduct a series of joint engagements to hear directly from industry on areas where we can more closely align.  As Directors, we participated in a UK Finance-chaired Senior Implementation Group (SIG) meeting with senior representatives from a range of sectors including financial services, insurance, law, and accountancy on topics including alignment and our collaboration over the past year."
        },
        {
            "text": "Members of both teams then held the first joint OFSI-OFAC roundtable with fintech and digital asset stakeholders, focused on sanctions compliance best practices across both jurisdictions in this sector.  OFSI and OFAC committed to participate in regular joint engagements and will look to replicate this model in the coming months with the humanitarian sector, in recognition of the wide-ranging benefits such dialogues provide to government and industry, and the NGO community alike."
        },
        {
            "text": "Commitment to Ongoing Collaboration"
        },
        {
            "text": "Both the United Kingdom and United States governments as well as our stakeholders have already felt the benefits of this Enhanced Partnership, which will be of ever-growing importance as we face an increasingly complex sanctions implementation landscape.  We are deeply grateful for the commitment of stakeholders and their constructive engagement, which in turn shapes our policy approach. We are proud of our enduring alliance and are excited for the opportunities to come as our Enhanced Partnership continues to prosper."
        },
        {
            "text": " "
        },
        {
            "text": "Giles Thomson, Director, The Office of Financial Sanctions Implementation, HM Treasury"
        },
        {
            "text": "Brad Smith, Director, Office of Foreign Assets Control, U.S. Department of the Treasury"
        }
    ]
}