{
    "url": "https://ukhsa.blog.gov.uk/2023/11/15/the-fight-against-antimicrobial-resistance-progress-and-challenges/",
    "title": "The fight against antimicrobial resistance: progress and challenges",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Antimicrobial resistance"
    ],
    "pub_date": "2023-11-15T16:27:14+01:00",
    "content": [
        {
            "text": "\nAntimicrobial resistance (AMR) - when microbes evolve to resist the medicines designed to kill them - is an urgent global threat. In England, resistant infections rose by 4% in 2022 after decreasing during the pandemic. Action is needed to curb inappropriate antibiotic use, a key driver of resistance."
        },
        {
            "text": "In 2013, we set up the English Surveillance Programme for Antimicrobial Utilisation and Resistance (ESPAUR) to collect data on the use of, and resistance to, these medicines. The 10th edition of the ESPAUR report, covering 2022 to 2023 has just been published."
        },
        {
            "text": "In this post we highlight some of the progress and challenges reported."
        },
        {
            "heading": 2,
            "text": "Antimicrobials: antibiotics and more"
        },
        {
            "heading": 2,
            "text": "Tracking bloodstream infections and AMR"
        },
        {
            "text": "During the pandemic, infection rates went down due to factors including restrictions on socialising and improved hand and respiratory hygiene. Some infections then made a resurgence following the lifting of pandemic restrictions. These included E. coli, bacterial pneumonia, Group A Strep, and the fungus Candida auris. In 2022, like previous years, E. coli was responsible for the majority of cases of antibiotic-resistant bloodstream infections (BSIs), making up 82% of the total. Rates of resistant bloodstream infections also remain below those published in 2018 despite rebounding from pandemic lows."
        },
        {
            "heading": 2,
            "text": "Health inequalities and antimicrobial resistance"
        },
        {
            "text": "Factors like ethnicity and social deprivation correlate with higher rates of resistant infections, indicating a need to address inequalities. The report showed that in 2022 the highest number and rate of BSI episodes were observed among the white ethnic group. Over 80% of bloodstream infections were recorded in this group, and out of those, about 19% were resistant to at least one of the key antibiotics. However, the highest percentage of antibiotic resistant infections was noted in the Asian or Asian British ethnic group, with almost 35% of these infections showing resistance."
        },
        {
            "heading": 2,
            "text": "Reducing unnecessary antibiotic use"
        },
        {
            "text": "Prescribing of antibiotics in England increased in 2022 after years of decline. All settings (except dental) saw more use, with total prescribing increasing by 8.4% in 2022 compared with 2021. However, overall use remains below pre-pandemic levels."
        },
        {
            "text": "The AMR National Action Plan provides a national goal to reduce antibiotic use in humans by 15% by 2024. Several helpful tools and resources have been developed by UKHSA, both to guide doctors in making the right decisions about when and how to prescribe antibiotics, and to help patients understand why these medicines might not always be appropriate. An example of an effective approach has been using SMS/text messaging to send patients online leaflets related to infection risks: the most widely shared was about preventing urinary tract infections (UTI) in women under 65."
        },
        {
            "text": "A campaign called Antibiotic Guardian, encourages healthcare organisations, GP practices, hospitals, community pharmacies, farmers, patients and the public to pledge towards responsible use of antibiotics. By 2022, there had been more than 155,000 pledges made and 89 organisations - including some from abroad - registered their efforts on the Antibiotic Guardian website. To date, more than 195,000 people have signed up. Programmes such as this, raise awareness and encourage everyone to take personal action to contribute to tackling AMR."
        },
        {
            "heading": 2,
            "text": "Ongoing research efforts"
        },
        {
            "text": "Continued research on AMR and healthcare-associated infections is key to further policy improvements. Healthcare-Associated Infections (HCAIs) and AMR have been the subject of many important UK research projects over the last year and have resulted in over 50 scientific papers authored by or with input from members of UKHSA, each one reviewed and approved by experts in the field."
        },
        {
            "heading": 2,
            "text": "The path ahead"
        },
        {
            "text": "While progress has been made, continuing to prevent infections, antimicrobial stewardship and research remain vital to combat AMR. A collaborative effort engaging healthcare professionals, scientists and the public is needed: if we treat antimicrobials with respect, they will be there to help us all in the future."
        }
    ]
}