{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/11/15/we-are-strategic-command-with-ellis-paterson/",
    "title": "We Are Strategic Command with Ellis Paterson",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Personnel"
    ],
    "pub_date": "2023-11-15T15:00:50+00:00",
    "content": [
        {
            "text": "In Episode 2 of We Are Strategic Command, Ellis speaks on her transition from a background in law to a pivotal role in shaping strategies for UK Defence. "
        },
        {
            "text": "Join us for the second episode of We Are Strategic Command, and dive into the world of Defence Strategy with Ellis Paterson - Strategy Manager at Strategic Command. Ellis's unique journey, transitioning from a legal background to a crucial role in shaping long-term strategies, sheds light on the vital work of Strategic Command within the UK Defence landscape."
        },
        {
            "text": "Ellis Paterson: Hi, I'm Ellis Paterson, and I work as a Strategy Manager at Strategic Command. My role is like a coordination hub where I gather various perspectives from different parts of Strategic Command and shape them into a coherent narrative for our Head Office."
        },
        {
            "text": "Interviewer: Can you give us the inside scoop on what the Strategy Directorate does at Strategic Command?"
        },
        {
            "text": "Ellis: Of course! The Strategy Directorate is essentially the Strategy Function.. But there's also the International Function that deals with International Engagement. These two teams collaborate to craft long-term strategies for Strategic Command. We're the people behind those big Defence documents like the Command Paper, plans, and strategies. We also brainstorm with academics and experts to come up with innovative ideas."
        },
        {
            "text": "Interviewer: It's intriguing how you shifted from a law background to your current role. Can you share more about what led you to this position?"
        },
        {
            "text": "Ellis: Well, it's a bit of a journey. I started my career in law, but soon realised that practising law wasn't my passion. Before joining the Defence world, I spent three years at the Ministry of Justice, and what fascinated me from the get-go was understanding how policy evolves and how ideas transform into legislation. So when I was looking for a fresh start in a different department, I stumbled upon Strategic Command. It's this incredible melting pot covering everything from Defence Medical to Support & Logistics to Intelligence. It felt like an amazing opportunity to dive into areas I didn't even know existed."
        },
        {
            "text": "Interviewer: How would you personally describe what Strategic Command is all about?"
        },
        {
            "text": "Ellis: Strategic Command is a bit of a chameleon; it's been called many things - the glue that binds Defence together, the crown jewel of Defence. And honestly, it's because we wear many hats and perform critical functions. We're the backbone of Defence, with all these essential components coming together under one roof."
        },
        {
            "text": " "
        }
    ]
}