{
    "url": "https://dfedigital.blog.gov.uk/2023/11/15/work-experience-in-the-department-for-education/",
    "title": "Work experience in the Department for Education",
    "authors": [
        "Freya Smith"
    ],
    "categories": [
        "Careers",
        "culture",
        "design"
    ],
    "pub_date": "2023-11-15T09:00:05+00:00",
    "content": [
        {
            "text": "The time is coming for myself and others to discover where our futures can take us, which can be an extremely overwhelming feeling! The pressure to have a clear career plan at such an early age is something I found difficult throughout secondary school. However, with help from the Department for Education, these decisions were less daunting than I thought."
        },
        {
            "heading": 2,
            "text": "A bit about me"
        },
        {
            "text": "Hello, my name is Freya Smith. I am a year 13 student studying A-level History, Sociology, and Philosophy and Ethics. Growing up, I always had an interest in writing and reading - I wanted to develop my creativity and innovation as much as possible. So, when my sixth-form college announced work experience week, it was the perfect opportunity to gain a real insight into the life of work. and to interpret my skills into different activities. The Department for Education (DfE) was offered to students, and eventually four of us took it and we became a small but determined team."
        },
        {
            "heading": 2,
            "text": "What did we do?"
        },
        {
            "text": "After meeting important people on the DfE team, we were set a task - ‘How could we design a service for young people 14-24, to find local support’. To do this, we developed a variety of skills such as:"
        },
        {
            "text": "We were then able to translate these into our designs for the Find and Connect website. Having the trust and dedication to create our own prototypes, attending the 9.30am stand up calls, and connecting with the team, increased my confidence to present my ideas in front of unfamiliar faces. With such a nice and welcoming team, we all managed to present!"
        },
        {
            "text": "Laura also introduced us to different careers within the Department for Education. There is such a wide range of jobs within the industry, and from talking to so many different people, everyone had a different journey too. It was reassuring to know there are positions that will suit my personal skills and preferences."
        },
        {
            "text": "On the last day of our work experience, we got to pitch our designs to Ben, who set the task, and others who attended the call. We let people comment on our drafts so we could make improvements. For example, making it more accessible with certain colours or text positioning. This was interesting as I would never have previously considered factors such as accessibility, or paid attention to this on other websites."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "My work experience feedback"
        },
        {
            "text": "I really enjoyed the independent thinking tasks we worked on, and any idea we wanted to develop, the team would have our support to make it work. Everything was thoroughly explained to us, and the feedback we received also made us feel like we were a part of the team. If DfE offers this experience again, I would suggest giving students more physical tasks to complete. We spent a lot of time face to face talking which can be quite overwhelming for some people."
        },
        {
            "text": "I was surprised by how well this experience tied in with one of my subjects, sociology, which I thoroughly enjoy. Many sessions we had, including user research, related to a lot of the content I already knew, helping to develop my skills even further. Overall, it has increased my knowledge of careers around, and, after researching, government social research and human resources is something that really interests me."
        },
        {
            "text": "I would recommend work experience in this department to any student who doesn't know what they want to do, or for valuable experience in a new field. Either way, this is a broad and favourable experience for anyone. I am incredibly grateful for the opportunity - I have gained so much from this, and it has motivated me to pursue a creative career and to be successful."
        }
    ]
}