{
    "url": "https://marinedevelopments.blog.gov.uk/2024/08/26/the-marine-spatial-planning-challenge-game/",
    "title": "The Marine Spatial Planning Challenge Game",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2024-08-26T10:35:50+01:00",
    "content": [
        {
            "text": "Used around the world by policy expert, decision makers and stakeholders to explore the challenges and opportunities of sustainably developing our oceans and seas. The interactive format of the game demonstrates the challenges and complexities of marine spatial planning."
        },
        {
            "text": "Credit: Indonesia Nature Film Society, Rekam Nusantara Foundation’"
        },
        {
            "text": "The Marine Management Organisation (MMO) offers these interactive sessions, free for up to 30 participants, to explore conflicts and resolutions within the marine space. These tailored training sessions focus on specific sectors or scenarios, with participants role-playing as different marine sectors. This exercise involves translating complex aims, negotiating with other marine sectors and identifying opportunities for coexistence and sustainable development. Excellent for those new to marine planning and experienced policy practitioners, an MSP Challenge game session is a good opportunity for knowledge and team building."
        },
        {
            "text": "The marine planning team also offers bespoke workshops tailored to the group’s requirements and day to day tasks which intersect with marine planning. For instance, in a session with the Underwater Noise Regulators Working Groupcoastal planners developed a scenario emphasising the increasing noise levels generated within our busy seas. By implementing a ‘noise budget’ with associated costs for disruptive activities, participants had to consider the impact of noise pollution, both spatially and seasonally, and restrict certain activities dependent on the noise generated. By setting a fixed budget, participants were compelled to make difficult decisions regarding the suitability of various developments."
        },
        {
            "text": "Our team also facilitated a session with the Marine Spatial Planning Addressing Climate Effects (MSPACE) research group. This session enabled participants to consider their climate-based research within the wider context of marine planning. They faced the challenge of adhering to strict net-zero targets while ensuring socio-economic prosperity through sustainable development in the marine area. A significant challenge was balancing the need to connect offshore developments to the shore through cabling or pipelines, which required complex cross border negotiations."
        },
        {
            "text": "\nCredit: Indonesia Nature Film Society, Rekam Nusantara Foundation’"
        },
        {
            "text": "Innovative Engagement: a quick and impactful MSP Challenge game"
        },
        {
            "text": "A condensed version of the MSP Challenge game was presented at the Marine Minerals Academy (MMA), organised by The Crown Estate."
        },
        {
            "text": "At the MMA the session reached 30 aggregate stakeholders and regulators from across the industry. With limited time available, our team creatively adapted the game to a discussion-based format. Participants formed teams and made a case outlining why their industry would not support a new offshore renewables development. Despite the condensed format, the session was hugely effective, helping participants understand how to use marine plans to support their work in marine aggregates. The response was overwhelmingly positive, with interest in full-length sessions, which we look forward to facilitating in the future."
        },
        {
            "text": "Building on this success, a similar session was also delivered to planning students at the University of Brighton. The session significantly raised awareness among future planning professionals about the critical aspects of marine planning, highlighting the importance of integrating marine and terrestrial planning."
        },
        {
            "text": "Get a game near you!"
        },
        {
            "text": "These sessions demonstrate the MSP Challenge game as a valuable tool that can be tailored to meet specific requirements, including time constraints, stakeholder interests, and varying levels of knowledge. If you are interested in organising an MSP Challenge game session for your organisation, please get in contact with our team at: planning@marinemanagement.org.uk."
        }
    ]
}