{
    "url": "https://defrafarming.blog.gov.uk/2022/08/22/apply-for-share-of-16-5-million-innovation-funding/",
    "title": "Apply for share of £16.5 million innovation funding",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2022-08-22T10:59:58+01:00",
    "content": [
        {
            "text": "From the end of this month (August 2022) £16.5 million will be available through 2 new research and development competitions. "
        },
        {
            "text": "Farmers, growers, foresters, businesses and researchers can apply for: "
        },
        {
            "text": "This funding is part of the £270 million Farming Innovation Programme. It's the second round for both competitions. We were impressed by the quality of the applications received last time. I'll share more on these below."
        },
        {
            "text": "The Farming Innovation Programme supports England’s farmers and growers to collaborate on the research and development of innovative methods and technologies. "
        },
        {
            "text": "There is no set theme for these competitions as we don’t want to create barriers to innovation. However, all projects must focus on improving the productivity, environmental sustainability and resilience of England’s agricultural, horticultural and forestry sectors. "
        },
        {
            "text": "UK Research and Innovation (UKRI) published guidance to help you prepare."
        },
        {
            "text": "In this post, I’ll give an overview of this new opportunity and update you on the progress of the first round."
        },
        {
            "heading": 2,
            "text": "Feasibility projects "
        },
        {
            "text": "Feasibility Projects help businesses to check if a research idea works in practice. "
        },
        {
            "text": "Through these projects, we want to back new and innovative solutions, aid early-stage research, and encourage collaboration.   "
        },
        {
            "text": "We’re taking this approach in response to the feedback that we should offer more support for early investment and testing of applied ideas. "
        },
        {
            "text": "Projects worth up to £500,000 and lasting up to 2 years can investigate new or early-stage solutions that have the potential to improve the overall sustainability, productivity and resilience of UK farming on our path to net zero. "
        },
        {
            "text": "In June, we announced the new Feasibility Projects from the first round. "
        },
        {
            "text": "They explore a range of topics and challenges across agriculture, animal farming, pest and disease detection and novel technologies. "
        },
        {
            "text": "Successful projects include: "
        },
        {
            "heading": 2,
            "text": "Small R&D partnership projects "
        },
        {
            "text": "Small R&D partnership projects help businesses to develop a new farming product or service further to take it towards commercialisation. "
        },
        {
            "text": "These can be used to develop your solution, once you know that it works in practice.  "
        },
        {
            "text": "Through this competition, we are looking for innovative solutions that have the potential to substantially improve productivity, sustainability, and resilience of the sectors with a focus on larger projects worth £1 million to £3 million up to 3 years.  "
        },
        {
            "text": "Today we are also pleased to be able to share details of the nine successful Small R&D Partnership projects from our previous competition which opened in 2021 and are getting started on their research and development. "
        },
        {
            "text": "These include: "
        },
        {
            "text": "We look forward to seeing all these projects grow and sharing their progress. "
        },
        {
            "text": "If you have an interesting idea, or a proven solution that needs further development, then we’d encourage you to apply for funding. "
        },
        {
            "heading": 2,
            "text": "Timelines"
        },
        {
            "text": "Both competitions open for applications on 31 August.  "
        },
        {
            "heading": 2,
            "text": "Other Farming Innovation Programme news "
        },
        {
            "text": "We are also pleased to see results from the first round of the Research Starter Pilot competition. "
        },
        {
            "text": "These projects were successful in their applications for bold, ambitious, early-stage ideas. Recipients of this initial funding come from across the farming and growing sector – from crops and forestry, to livestock, soil and water solutions.   "
        },
        {
            "heading": 2,
            "text": "Get ready to apply"
        },
        {
            "heading": 3,
            "text": "Guidance"
        },
        {
            "text": "The Farming Innovation Programme website contains guidance for:"
        },
        {
            "heading": 3,
            "text": "Video"
        },
        {
            "text": "You can also watch a video briefing on how to apply.  "
        },
        {
            "heading": 3,
            "text": "Events"
        },
        {
            "text": "Innovate UK will host a Q&A session for both competitions on 1 September, 11-12pm. Register to attend the webinar. "
        },
        {
            "text": "Innovate UK-KTN will host a consortium building event on 6 September, 10-12pm. Register to attend the online session. "
        }
    ]
}