{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/08/22/delivering-the-promise-of-integrated-health-and-care/",
    "title": "Delivering the promise of integrated health and care",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Information and access",
        "Integration",
        "Knowledge and skills",
        "Personalisation"
    ],
    "pub_date": "2022-08-22T15:07:07+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Digital determination"
        },
        {
            "text": "Earlier this summer , the Department of Health and Social Care's plan for digital health and social care included the assertion that the “long-term sustainability of health and social care is dependent on having the right digital foundations in place, and so digital transformation must be the linchpin upon which all... reforms are based.”"
        },
        {
            "text": "The challenge of integrating health and social care cannot be fixed simply by addressing one part of the jigsaw. Improving funding, so that health and care are on a sustainable footing, training professionals to have the right skills and behaviours and making sure we have enough good people to meet the health and care needs of an ageing population – all these are pressing issues."
        },
        {
            "text": "But without a doubt, digital transformation is also essential to creating an integrated system people can depend upon when they need it most."
        },
        {
            "text": "A colleague of mine frequently tells me “data is care”. By that she means recording information in a person’s care record is more than an administrative task, it is a vital part of providing care, just like diagnosing illness, prescribing medicines, helping someone wash and dress, or arranging a family visit."
        },
        {
            "heading": 2,
            "text": "Depth of data serves diversity of need"
        },
        {
            "text": "Today, care is provided by many different professionals with unique skill sets in a wide range of settings. To fulfill their caring role, they need up to date information at their fingertips. That means having access to digital systems which share information in real time, helping them support people with full knowledge of their current circumstances and needs."
        },
        {
            "text": "Getting the basics of information sharing right is just the beginning though. As a health and care system, we should aspire to use information to make the shift from reactive services to predictive and preventative services."
        },
        {
            "text": "The White Paper on the integration of health and social care earlier this year summarised the challenges succinctly:"
        },
        {
            "heading": 2,
            "text": "Common standards = common good"
        },
        {
            "text": "Standardising the information professionals use to provide care is fundamental to improving connectivity between health and care services. The Professional Record Standards Body (PRSB) has produced a set of standards which define and describe what information should be included in a person’s care record to support better integrated care."
        },
        {
            "text": "The core information standard defines what should be noted in a shared care record to inform professionals providing care in any care setting. About Me allows people to create a profile of themselves, their needs and preferences, so that professionals can provide more personalised, responsive care. Meanwhile, personalised care and support plans help people living with long-term health and care needs manage their own care better, with support from a wide range of health and social care services."
        },
        {
            "text": "PRSB is campaigning to raise awareness of the About Me standard and the ability of people to create About Me profiles. Health and care professionals can then access these profiles and system suppliers support its use. To find out more visit CareAboutMe."
        },
        {
            "text": "Standards can help improve information sharing and support health and care professionals to spot early warning signs of deteriorating health, whether at home, in care homed or in other care settings. That should trigger a care planning update and possibly a change or increase in the care someone receives. If we can get that right we could avoid unnecessary or preventable hospital admissions and improve people's health and wellbeing."
        }
    ]
}