{
    "url": "https://educationhub.blog.gov.uk/2022/08/22/what-options-are-available-for-students-after-their-gcses/",
    "title": "What options are available for students after their GCSEs?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Exams and qualifications",
        "Further education",
        "GCSE results",
        "T Levels"
    ],
    "pub_date": "2022-08-22T16:11:47+01:00",
    "content": [
        {
            "text": "After young people have completed their GCSEs there are a range of possibilities open to them including continuing education by taking A levels or going down one of several technical education routes now available to them, including T Levels."
        },
        {
            "text": "Here, we provide some of the exciting options for post-16 education."
        },
        {
            "heading": 3,
            "text": "A levels"
        },
        {
            "text": "A levels or Advanced Levels are two-year subject-based qualifications for students aged 16 or older who plan to go to university or want much deeper knowledge of a study area."
        },
        {
            "text": "A levels are often provided by schools with sixth form colleges, dedicated Sixth Form colleges and Further Education colleges. There is a wide range of subjects for students to choose from – depending on what their school or college offers."
        },
        {
            "text": "There are also one year AS level qualifications in most subjects for which there are A levels. The AS is a standalone qualification and marks do not count towards the final A level grade."
        },
        {
            "heading": 3,
            "text": "T Levels"
        },
        {
            "text": "Our ground-breaking new qualifications, T Levels which are broadly equivalent in size to three A Levels are proving hugely popular."
        },
        {
            "text": "They combine study in a learning environment with a substantial industry placement so that students gain the skills and experience they need to progress into work, an apprenticeship or higher study."
        },
        {
            "text": "Students spend 80% of their time in the classroom and 20% on a minimum 9-week placement with an employer."
        },
        {
            "text": "There are 10 subjects available now in England, including digital, science, construction, and health."
        },
        {
            "text": "More subjects are coming in September 2022 and others will be introduced over the next few years."
        },
        {
            "text": "To explore more on your choices when you reach 16/17 check out the Get the Jump pages on the National Careers Service website: Get the Jump: explore your education and training choices | National Careers Service."
        },
        {
            "text": "Or why not chat to a Careers Adviser who may be able to help with any questions on future pathways: Contact us | National Careers Service."
        },
        {
            "heading": 3,
            "text": "Apprenticeships "
        },
        {
            "text": "Apprenticeships are a brilliant option for people of all ages to launch their careers in a huge range of exciting industries or upskill at various levels."
        },
        {
            "text": "There are thousands of apprenticeship vacancies on offer, with more than 640 high-quality apprenticeships approved for use by employers – meaning someone could pursue a career in anything from space engineering to advertising."
        },
        {
            "text": "We have also just launched Career Starter Apprenticeships which are a great opportunity for those with limited work experience."
        },
        {
            "text": "With an apprenticeship, students can earn while they learn, and they include high quality training."
        },
        {
            "text": "For those who are considering an apprenticeship, check out Five reasons why you should consider an apprenticeship - The Education Hub (blog.gov.uk)."
        },
        {
            "heading": 3,
            "text": "Higher Education"
        },
        {
            "text": "Some students may go to university or into another type of higher education earlier than 18 years old."
        },
        {
            "text": "Students can often study flexibly at their own pace by learning online or part-time. Courses are usually taught in universities, colleges or specialist institutions like art schools."
        },
        {
            "text": "There are many different types of higher education qualifications, including: diplomas; Bachelor’s degrees; foundation degrees and foundation years and degree level apprenticeships."
        },
        {
            "text": "Our Higher education | National Careers Service section on our Get the jump campaign provides all you need to know on post-16 higher education options."
        },
        {
            "heading": 3,
            "text": "Level 3 VTQs "
        },
        {
            "text": "Vocational technical qualifications (VTQs) are practical qualifications designed with the workplace in mind."
        },
        {
            "text": "They're designed to help students get the skills they need to start their career or go on to higher levels of education."
        },
        {
            "text": "VTQs are available in a range of subject areas and course sizes, ranging from equivalent to an A/S level up to equivalent to 3 A levels."
        },
        {
            "heading": 3,
            "text": "Traineeships"
        },
        {
            "text": "Traineeships are courses for 16-to-19-year-olds that last from 6 weeks up to 1 year. They include a work placement that help young people prepare for an apprenticeship or a job."
        },
        {
            "text": "A traineeship provides students with work experience, help with next steps and support to improve maths and English skills."
        },
        {
            "text": "Students will spend at least 70 hours in a work placement with the rest of the time in college or at a training centre."
        },
        {
            "text": "Visit Find a traineeship - GOV.UK (www.gov.uk) for more information."
        }
    ]
}