{
    "url": "https://deframedia.blog.gov.uk/2021/11/01/coverage-of-cop26-as-summit-begins/",
    "title": "Coverage of COP26 as summit begins",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-11-01T10:49:16+00:00",
    "content": [
        {
            "text": "There has been widespread coverage of the climate change summit COP26 which started yesterday (31 October)."
        },
        {
            "text": "Following an interview with environmental editor Emma Gatten, a piece in The Daily Telegraph includes comments from the Environment Secretary regarding a range of climate change related issues including food and farming. Eustice is quoted saying the UK will need to “move into the realms of things like carbon taxes” when existing EU agricultural subsidies are finally phased out. The piece also notes that the Government is already working on a new tax system for parts of the food sector that contribute most to global warming, such as meat and dairy."
        },
        {
            "text": "On Sunday 31 October there was a positive front page article in The Sunday Times following a further interview with the Secretary of State. The article reports how the UK government is working to secure commitment of dozens of key countries to reverse the rate of global deforestation. George Eustice is quoted stressing that “every ounce of effort” has gone into trying to land a significant commitment on forestry, land use and international commodities trading."
        },
        {
            "text": "Comments from the Chair of Natural England, Tony Juniper, are featured in coverage from The Independent on the importance of nature recovery and nature-based solutions in tackling climate change. Following Tony Juniper’s interview with the Independent, the article focuses on the role of the Nature Recovery Network; the importance of peat and how reintroduction projects can have socio-economic benefits. Sir Patrick Vallance is also quoted highlighting the importance of biodiversity."
        },
        {
            "text": "Environment Secretary George Eustice has also been interviewed by school children for BBC Newsround about their concerns around the environment ahead of COP26. The interview covered a lot of areas, including electric vehicles and how to rid the ocean of plastics. The Secretary of State was hopefully about the prospect of making progress at COP26, but highlighted that all countries needs to act together in order for us to tackle this major global issue."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}