{
    "url": "https://cspl.blog.gov.uk/2021/11/01/high-standards-begin-at-home/",
    "title": "High standards begin at home",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Standards Matter 2"
    ],
    "pub_date": "2021-11-01T11:31:20+00:00",
    "content": [
        {
            "text": "Standards in public life – outlined in Nolan’s seven principles - are the widely accepted ‘deal’ between the public and those governing them."
        },
        {
            "text": "Accountability, honesty, openness, selflessness, leadership, objectivity and integrity - these seven words describe the values we expect to see from anyone taking decisions or delivering services on behalf of the public - from nurses, police officers and local planning officials to government ministers. Translated into codes of conduct across the public sector, they also extend to private companies where taxpayers’ money is being spent."
        },
        {
            "text": "Good conduct and sound governance in public life are not optional extras; they are vital to UK business and our reputation internationally. Businesses want to invest in countries where governance is stable, predictable and fair. The UK’s success in countering corruption abroad depends on our reputation for high ethical standards at home."
        },
        {
            "text": "My committee has been assessing the health of the institutions, processes and structures that currently regulate conduct in public life, looking at their ability to withstand new challenges. The wider context of social media, globalisation, political polarisation – even before EU Exit and the pandemic – bring new and different ethical challenges."
        },
        {
            "text": "The regulation of conduct in public life in the UK relies heavily on convention, what was described as the ‘good chaps’ theory. My committee believes it is time to place more of the ethics regulators dealing with ministerial interests, public appointments and business appointments for former office holders onto a statutory footing giving them clearer accountability and greater independence from the executive they regulate – bringing arrangements in government closer to those found in the best parts of the private sector."
        },
        {
            "text": "We also recommend more proactive, timely and meaningful transparency to both facilitate scrutiny and accountability and deter inappropriate lobbying. Government needs a more thorough and rigorous compliance function, and we call for greater leadership – at all levels – to drive high standards."
        },
        {
            "text": "Accountability, honesty, openness, selflessness, leadership, objectivity and integrity are not just a ‘nice to have’ - they are integral to ‘building back better’."
        },
        {
            "text": "You can read the report and recommendations here."
        }
    ]
}