{
    "url": "https://ofsi.blog.gov.uk/2021/11/01/ofsi-updates-charity-sector-guidance/",
    "title": "OFSI updates charity sector guidance",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Afghanistan",
        "Charities",
        "Compliance",
        "Counter-terrorism",
        "Financial sanctions",
        "Financial sanctions regime"
    ],
    "pub_date": "2021-11-01T11:30:36+00:00",
    "content": [
        {
            "text": "In response to Afghanistan's Taliban takeover in August, OFSI has updated its Charity Sector Guidance."
        },
        {
            "text": "The Taliban takeover has created a complex situation where people subject to financial sanctions (designated persons) in the UK now claim to be in positions of authority."
        },
        {
            "text": "The UK has enforced financial sanctions relating to Afghanistan since 1999. These sanctions come from United Nations (UN) resolutions, and the UK has an obligation to implement and enforce them. A number of individuals and entities, including members of the Taliban are subject to UN sanctions. The UK has not implemented sanctions against the Taliban as an entity and in the absence of an applicable derogation in the relevant UN resolution, the UK is unable to grant a humanitarian licence."
        },
        {
            "text": "HMG remains committed to its engagement with the NGO sector to understand the barriers to legitimate humanitarian activities and to assist where possible."
        },
        {
            "text": "Today, OFSI has published an update to its Charity Sector Guidance. The UK supports the delivery of aid to Afghanistan that will be used for humanitarian purposes. We appreciate at these difficult times there may be barriers to this delivery but recognise that now more than ever efforts are needed in the region to prevent a worsening humanitarian crisis."
        },
        {
            "text": "We support a targeted approach to sanctions, so that they are effective against sanctions targets while minimising unnecessary disruption or delay of legitimate humanitarian activity."
        },
        {
            "text": "The latest updates we have made to our charity guidance include information on due diligence when using Informal Value Transfer Systems (IVTS) including the Hawala system that operates in Afghanistan, a reminder of the UK’s ownership and control policy, and highlights of the relevant parts of OFSI’s enforcement approach."
        },
        {
            "text": "On 30 August 2021, OFSI issued an update to our e-alert subscribers to flag the changing situation in Afghanistan. The advice from this alert remains relevant, and you should subscribe for further updates to receive the latest information from OFSI."
        },
        {
            "text": "If you become aware that a financial sanctions breach has occurred, please report it to OFSI as soon as possible. OFSI values early reporting and will take this into account when considering any enforcement action. We treat each suspected breach on its own merits. We assess the facts of each case to decide an outcome that is fair and proportionate. We will take mitigating factors into account when deciding how to proceed with a case, which may reduce a penalty we impose or lead us not to take enforcement action."
        },
        {
            "text": "Although OFSI has the power to issue monetary penalties, many of our cases are dealt with through other means. Individuals, charities, NGOs and companies are frequently directed to our published guidance to promote greater awareness and understanding of financial sanctions compliance measures."
        },
        {
            "text": "As with any regime particularly in more unstable regions, people and positions will usually change and evolve with time. OFSI will keep its documents under constant review to accurately reflect the dynamics in the region and provide as much guidance as is possible."
        },
        {
            "text": "OFSI is working closely with its cross-government counterparts in sanctions notably the FCDO to work closely with stakeholders to address challenges arising in relation to Afghanistan. We will shortly be conducting a webinar with the Charity Commission of England and Wales targeted at charities operating in high-risk jurisdictions, such as Afghanistan, to help provide some clarity on challenging issues. This will include a short Q&A to take questions."
        },
        {
            "text": "For those working hard to get aid to those that need it on the ground in Afghanistan – we understand and appreciate how very difficult it is. Please contact us should you have any questions via our mailbox ofsi@hmtreasury.gov.uk or our helpline on 020 7270 5454."
        },
        {
            "text": "This blog applies specifically to the current situation in Afghanistan since August 2021. Other regimes have different sanctions frameworks in place, and we encourage NGOs to use humanitarian exceptions and licensing grounds wherever possible."
        }
    ]
}