{
    "url": "https://charitycommission.blog.gov.uk/2021/11/01/trustees-week-encouraging-different-perspectives/",
    "title": "Trustees’ Week, encouraging different perspectives",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-01T09:02:42+00:00",
    "content": [
        {
            "text": "Today marks the start of Trustees’ Week, the time of year when we unite to celebrate the vital work of charity trustees."
        },
        {
            "text": "The charities on our register are hugely diverse – in the aims they have, the work they do and the people they support. But they have one thing in common: they are run by a board of trustees, a group of individuals who take ultimate responsibility for everything that happens in the charity, and who make sure the charity delivers on its purpose and mission."
        },
        {
            "text": "Almost all trustees volunteer their time for free, doing their important work often on top of already busy lives. They are the life blood of charity in our country, and they are, for the most part, unsung heroes."
        },
        {
            "text": "Trustees Week is about taking a moment to shine a light on trustees, about saying thank you to the 700,000 people in England and Wales who serve their communities and the causes they care for."
        },
        {
            "text": "And it’s about encouraging more people to consider what they might be able to offer as a charity trustee, and what they might gain from the experience."
        },
        {
            "heading": 2,
            "text": "The theme for this year is “encouraging different perspectives”"
        },
        {
            "text": "We want charities to think about the ideas, perspectives, skills and experiences they need on their board in order to thrive and inspire trust."
        },
        {
            "text": "We know that, taken as a whole, trustees do not reflect the make-up of the communities their charities serve. The average trustee is older to educated to degree level, and men outnumber women by two to one."
        },
        {
            "text": "Let me be really clear. I have no criticism of, only gratitude towards, every one of these trustees. You do great and important things."
        },
        {
            "text": "But the current lack of diversity is a problem. First, there is the question of fairness and access. Trusteeship can open doors for people, and young people, people of colour, women, and those from different educational background or regions of the country should have access to that opportunity."
        },
        {
            "text": "It is also a risk to good governance. Having a diverse group of people on their boards – in terms of background and experience, but also in outlook and personality – helps charities make better decisions. Diverse boards are better able to anticipate and manage risks, seize new opportunities, future proof their organisations and tackle difficult but necessary decisions. Conversely, boards that lack the right mix of skills, experience and perspectives, that do not test and challenge decisions or ideas, are more at risk of ‘groupthink’ and of losing their way."
        },
        {
            "text": "We would like to see charities do more to attract and welcome new types of trustees to their organisations. One simple step is to always advertise and recruit openly when positions become available. At the moment, too many new trustees are recruited informally, through existing networks, which risks perpetuating a trustee ‘monoculture’."
        },
        {
            "text": "Trusteeship gives a lot back. As the testimonies that we’ve brought together on the Trustees’ Week website show, trusteeship is a richly rewarding experience. It’s not easy – often its hugely challenging – but it offers an opportunity to make a difference for the cause you care about and it can offer experience of leadership that can be attractive to future employers."
        },
        {
            "heading": 2,
            "text": "So we are asking you to get involved in Trustees’ Week, whoever you are."
        },
        {
            "text": "If you know someone who gives of their spare time to serve as a trustee, use this opportunity to say thank you."
        },
        {
            "text": "If you know someone who would make a great trustee, tag them using the hashtag #TagATrustee and encourage them to find out more about becoming a trustee."
        },
        {
            "text": "And if you are a trustee yourself consider taking part in one of over 60 free or low-cost events available to book on the Trustees’ Week website. Take the trustee quiz to find out what skills you bring to your board, and encourage your colleagues on your board to do the same, and to discuss the outcomes at your next board meeting. Or use the opportunity to refresh your knowledge on all the trustee essentials in our easy-read 5-minute guides."
        },
        {
            "text": "Together this week, we can help promote the visibility of trusteeship, encourage new people into the role, and celebrate those who are already involved."
        }
    ]
}