{
    "url": "https://environmentagency.blog.gov.uk/2021/11/01/using-the-power-of-nature-to-increase-flood-resilience/",
    "title": "Using the power of nature to increase flood resilience",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2021-11-01T11:29:42+00:00",
    "content": [
        {
            "text": "James Bevan, Chief Executive of the Environment Agency"
        },
        {
            "text": "At the Environment Agency we’re very good at building walls and embankments to reduce the risk of flooding to vulnerable communities. The trouble is, in a changing climate that is not enough.  Whatever carbon reduction agreements governments of the world can make at COP26 this year will be welcome, but we know that our climate will continue to warm for many decades to come."
        },
        {
            "text": "The kinds of extreme climatic events experienced in Germany and the Low Countries this Summer, leading to devastating flooding, is sadly likely to become a more familiar sight over the next century. As our recent Climate Adaptation Report concludes, we – and other flood risk management authorities - alone cannot protect everyone from increasing flood and coastal risks."
        },
        {
            "text": "But there is room for optimism. There are many practical ways in which we, together with others, can use the power of nature to increase flood resilience. Natural flood management techniques include the re-meandering of rivers, the restoration of wetlands and targeted woodland planting and can be used in conjunction with more traditional hard engineering options."
        },
        {
            "text": "Approaching flood risk with softer engineered solutions is not new to flood and coastal risk management practitioners. For years, many of our beaches have been managed to take the energy out of stormy seas to protect our coasts. We are familiar with places that have reconnected rivers with their natural floodplain to make space for water away from vulnerable built-up areas."
        },
        {
            "text": "Too often, the conversation has been about a false choice between hard or soft engineering – as if there were conflict or competition between them. We now have a better understanding of the role that NFM can play in complementing flood defence walls or embankments to enhance flood resilience within a community."
        },
        {
            "text": "And that is in part thanks to our national Natural Flood Management Programme which in 2017 received £15 million of government funding. The programme completed this year and has achieved some great successes. Across 60 pilot projects the programme created an equivalent of 1.6 million cubic metres of water storage. This has come from the cumulative impact of many small interventions mostly in the catchments and streams upstream of areas at risk of flooding."
        },
        {
            "text": "In addition to increasing flood resilience to 15,000 homes, the programme also contributed to nature recovery: improving 4,000 hectares of habitat, improving 610 kilometres of river and planting 100 hectares of woodland. Healthy natural environments are good for wildlife and good for storing and slowing flood waters to contribute to flood resilience."
        },
        {
            "text": "You can read a summary of the main findings from the Natural Flood Management programme here."
        },
        {
            "text": "Partnership is the recipe for success"
        },
        {
            "text": "The programme has shown us what we can do, together, and has been possible through collaboration with a total of 85 partner bodies.  National and local government agencies, community groups, rivers and wildlife trusts and – perhaps most importantly - local landowners and managers have all been critical.  Indeed, one of the aspects of the story I find most encouraging is the times that local flood action groups have got together with environmental groups and found ways to improve the local environment and build resilience to flooding."
        },
        {
            "text": "Our national Flood and Coastal Erosion Risk Management Strategy includes commitments to help mainstream use of nature based solutions to improve flood resilience, to complement the hard defences we’ll continue to need to protect people. Government commitments to nature recovery, to carbon reduction and to green growth will all play their part in helping practitioners and policy makers to enable clean and green growth."
        },
        {
            "text": "Learning what works"
        },
        {
            "text": "There is a substantial and growing body of scientific literature on the methods and benefits of nature based solutions. In September, for example, we contributed to the fantastic International Guidelines on Natural and Nature Based-Features for Flood Risk Management. This year has also seen the launch of our online service to help flood novices work through the practical steps to using nature-based solutions to reduce risk. Bit by bit, we are learning how to harness the power of nature to reduce flood risk."
        }
    ]
}