{
    "url": "https://nationalscreening.blog.gov.uk/2025/03/28/final-data-analysis-under-way-to-inform-scid-screening-recommendation/",
    "title": "Final data analysis under way to inform SCID screening recommendation",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-03-28T13:24:56+00:00",
    "content": [
        {
            "text": "Well over 1 million babies have now been screened for severe combined immune deficiency (SCID) since the September 2021 launch of an in-service evaluation (ISE) in NHS services."
        },
        {
            "text": "NHS England (NHSE) has now completed the collection of all the data and information from the ISE."
        },
        {
            "text": "The UK National Screening Committee (UK NSC) recommended the evaluation of screening for SCID. Evidence suggested that screening was likely to be effective in increasing the number of babies who survive before and after treatment, but there were important evidence gaps that could only be answered by evaluating screening in lots of babies."
        },
        {
            "text": "The data and information that has now been collected from the ISE will help determine the best way to deliver newborn screening for SCID. It will also fill the important evidence gaps that include:"
        },
        {
            "text": "Statisticians, clinicians, patient and public voice (PPV) representatives and screening programme experts are currently analysing and discussing the data so they can be included in a final ISE report to be submitted to the UK NSC."
        },
        {
            "text": "This report will provide evidence on the effectiveness of newborn blood spot (NBS) screening for SCID. The UK NSC and its expert fetal, maternal and child health (FMCH) group will assess the report with the NHSE ISE team. The report will then form part of a package of evidence that will go out to public consultation. Following that consultation, the UK NSC will make a recommendation and ministers will make a final decision on whether screening for SCID should become part of the NHS NBS screening programme."
        },
        {
            "text": "We would again like to take this opportunity to thank everyone who has been involved in the planning and delivery of the ISE. This includes a wide range of health care professionals, including midwives, laboratory staff, paediatricians, child health services, modellers, statisticians, commissioners, immunisation leads and IT experts."
        },
        {
            "text": "We will continue to keep you up to date on progress via the blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}