{
    "url": "https://naturalengland.blog.gov.uk/2025/03/28/mountain-hares-in-decline-new-research-reveals-diminishing-numbers-in-the-peak-district/",
    "title": "Mountain hares in decline: New research reveals diminishing numbers in the Peak District ",
    "authors": [
        "Dr Carlos Bedson"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Monitoring",
        "Natural England",
        "Nature",
        "Science and evidence",
        "Wildlife"
    ],
    "pub_date": "2025-03-28T11:15:04+00:00",
    "content": [
        {
            "text": "By Dr Carlos Bedson"
        },
        {
            "text": "The Peak District is home to England's only population of mountain hares, a remarkable Arctic species introduced here in the 1870s by sporting landowners. These cold-adapted mammals, with their distinctive seasonal white winter coats, have become an iconic part of our upland landscape."
        },
        {
            "text": "However, new research published in the peer-reviewed journal Ecology and Evolution reveals a concerning decline in this unique population."
        },
        {
            "text": "I’m Dr Carlos Bedson, one of the authors of the new paper, and a quantitative spatial ecologist supporting the East Midlands area team of Natural England. "
        },
        {
            "text": "Long-term monitoring reveals significant decline"
        },
        {
            "text": "Since 2017, we've been conducting surveys of mountain hare populations in the Peak District using distance sampling methodology - the leading non-invasive technique for wildlife population monitoring worldwide. Our previous research, published in 2022, established baseline population figures of approximately 3,500 mountain hares, with density hotspots of around 15 hares per square kilometre."
        },
        {
            "text": "Our latest findings, based on eight years of continuous monitoring, show a dramatic decline of nearly 60% in the main mountain hare hotspots. Density has fallen to just 6 hares per square kilometre, with the total Peak District population now estimated at only 1,000 individuals - a number that raises serious questions about their long-term viability."
        },
        {
            "text": "Multiple factors likely driving the decline"
        },
        {
            "text": "The causes of this decline are likely complex and interconnected. As cold-adapted animals, mountain hares are particularly vulnerable to climate change. When their white winter coats no longer match the increasingly snow-free landscape, they become more visible to predators - a phenomenon known as coat colour mismatch."
        },
        {
            "text": "Other potential factors include:"
        },
        {
            "text": "Interestingly, our research indicates that mountain hare numbers appear higher in areas where previously degraded blanket bog has been ecologically restored with diverse vegetation. In contrast, numbers remain very low in areas dominated by deep, impenetrable heather."
        },
        {
            "text": "Looking ahead: Conservation and research priorities"
        },
        {
            "text": "Understanding the exact causes of this decline requires further research. We're considering additional methods such as Global Positioning System (GPS) collaring to better understand how mountain hares respond to human activity and environmental changes. However, with such low population densities, this approach may meet initial challenges in actually finding hares for collaring."
        },
        {
            "text": "The support of conservation partners may be crucial as we look for ways to assist this unique population. Natural England is committed to maintaining our existing monitoring programme and is open to developing new partnerships to support this remarkable species."
        },
        {
            "text": "By working together, we hope to understand the factors which can support the continued presence of mountain hares in England's uplands."
        },
        {
            "text": "---"
        },
        {
            "text": "Dr Carlos Bedson's research was originally supported by a group of conservation charities including the People's Trust for Endangered Species and the Hare Preservation Trust, and various universities. The new paper \"Seven Year Decline of Mountain Hare Abundance in the Peak District, England\" is now published in Ecology and Evolution."
        }
    ]
}