{
    "url": "https://ukhsa.blog.gov.uk/2025/03/28/travel-health-and-the-growing-risk-of-antibiotic-resistant-stis-like-gonorrhoea/",
    "title": "Travel health and the growing risk of antibiotic-resistant STIs like gonorrhoea",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Sexual health"
    ],
    "pub_date": "2025-03-28T14:45:32+01:00",
    "content": [
        {
            "text": "Travel offers exciting adventures, but it's important to protect your health wherever you go. While casual sexual encounters during holidays are common, protecting yourself from sexually transmitted infections (STIs) is more crucial than ever - especially with rising trends in antibiotic resistance."
        },
        {
            "heading": 2,
            "text": "Why protection matters when travelling"
        },
        {
            "text": "When enjoying holidays overseas, practising safer sex is just as important as getting travel insurance or applying sunscreen. STIs can pose a serious risk to health, so there is a need to use condoms consistently and correctly with all new or casual partners."
        },
        {
            "text": "There's a concerning upward trend of antibiotic-resistant gonorrhoea infections, particularly in popular tourist destinations across the Asia-Pacific region. This includes countries such as Thailand, China, Cambodia and Vietnam. These infections are sometimes called ‘super-gonorrhoea’ in the media."
        },
        {
            "heading": 2,
            "text": "Treatment challenges"
        },
        {
            "text": "Gonorrhoea has developed resistance to various antibiotics, including ceftriaxone - considered the 'last-line' treatment option. This means healthcare providers have limited alternatives when this treatment fails."
        },
        {
            "text": "While ceftriaxone resistance remains uncommon in the UK, cases are being detected with increasing frequency. The data reveals a worrying pattern:"
        },
        {
            "heading": 2,
            "text": "Broader STI context"
        },
        {
            "text": "Within the UK, the overall number of gonorrhoea diagnoses (not just those with resistance to ceftriaxone) have reached record-breaking levels in recent years."
        },
        {
            "heading": 2,
            "text": "Know the symptoms"
        },
        {
            "text": "Many people with gonorrhoea have no symptoms, making regular testing essential. However, possible signs include:"
        },
        {
            "heading": 2,
            "text": "Take action"
        },
        {
            "text": "If you've had condomless sex while travelling:"
        },
        {
            "text": "1. Get tested when you return to the UK, even if you don't have symptoms"
        },
        {
            "text": "2. Avoid sexual contact if you notice any symptoms"
        },
        {
            "text": "3. Seek treatment promptly after a diagnosis - untreated gonorrhoea can lead to serious health problems including pelvic inflammatory disease, infertility, and pregnancy complications"
        },
        {
            "heading": 2,
            "text": "Testing options"
        },
        {
            "text": "Testing is quick, free and confidential. Depending on where you live, you can:"
        },
        {
            "text": "- order an STI self-sampling kit online"
        },
        {
            "text": "- visit your local sexual health clinic"
        },
        {
            "heading": 2,
            "text": "Prevention is better than treatment"
        },
        {
            "text": "When you are planning a trip abroad, visit the Travel Health Pro website to find out more about health risks in your destination."
        },
        {
            "text": "With resistant infections becoming more common prevention remains crucial. Using condoms with new or casual partners is the best way to protect yourself both at home and abroad."
        },
        {
            "text": "Returning from your travels with good memories is far better than bringing back an infection that could have serious health consequences and be difficult to treat."
        }
    ]
}