{
    "url": "https://cspl.blog.gov.uk/2025/03/28/when-something-goes-wrong-it-is-often-the-case-that-someone-knew/",
    "title": "When something goes wrong, it is often the case that 'someone knew'",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "Early Warning Signs",
        "Ethical standards",
        "Leadership"
    ],
    "pub_date": "2025-03-28T10:06:22+00:00",
    "content": [
        {
            "text": "Recent independent inquiries have laid bare the catastrophic impact of major failures by public sector bodies on innocent lives. The Grenfell, Infected Blood and Post Office inquiries all heard harrowing evidence of human suffering, including the tragic and avoidable loss of life. Public sector failure also comes with a financial penalty – not just the expense of inquiries to determine why scandals happened and the cost of government compensation schemes borne by the taxpayer. There is also the time public sector bodies must spend dealing with the aftermath of failures, inevitably diverting resources from their organisations’ core purposes. And then there is the damage done to public trust. Public sector organisations wield huge power over the lives of citizens and are entrusted to act in the public interest. When they let down the public, the consequences are manifold and far-reaching."
        },
        {
            "text": "Understandably, the public wants to know that those identified as culpable for failure will face consequences. They rightly want those responsible to be ‘held accountable’. But how much better would it be if public sector bodies could avert the crisis in the first place?"
        },
        {
            "text": "Of course, the old adage that ‘hindsight is 20/20’ holds true – it is far easier to evaluate past decisions from the vantage point of knowing the outcome than it is to foresee problems in advance."
        },
        {
            "text": "Major failings in public life are invariably due to a combination of factors. The picture is usually complex – illustrated by public inquiries often spanning several years and producing reports that can run into well over a thousand pages. However, a look at some recent public inquiries such as the Grenfell, Infected Blood and Post Office Horizon IT inquiries and independent reviews such as the Windrush review and reviews of maternity services, reveal recurring themes. These include a failure to listen to and act on concerns raised by employees and/or the public, a failure to learn lessons from past mistakes or similar incidents and a failure to identify and share emerging themes that might have alerted the organisation to a developing risk. There is often a failure of the board to have effective oversight of issues and concerns. A common characteristic of bodies responsible for a major failure is an overly defensive organisational culture. "
        },
        {
            "text": "Our report, ‘Recognising and Responding to Early Warning Signs’, launched on 25 March, highlights these common themes and sets out to support public sector bodies in getting better at spotting problems at the earliest possible stage – while there is still time to act and, potentially, avert a disaster."
        },
        {
            "text": "To stand a chance of successfully recognising and responding to early warning signs leaders must do four things. They must realise they have a problem, act to address it, identify the wider lessons to be learned and be diligent in ensuring that those lessons are embedded fully within the organisation."
        },
        {
            "text": "When things go wrong, it is often the defensive response of the public sector body and its failure to acknowledge what happened and offer a meaningful apology that compounds the pain suffered. Responding with candour is important following major failures when the public wants to know what has happened. But the responsibility to uphold the principles of honesty and openness goes wider. These principles – like all of the Seven Principles of Public Life – are an important guide to the behaviour the public expects at all times."
        },
        {
            "text": "Our report is aimed squarely at those in public life. Rather than making hard recommendations, we offer practical insights and ‘points for reflection’ intended to help leaders think deeply about the processes and culture in their organisation and consider whether improvements can be made. But the questions are not only for leaders; they can help staff at all levels to challenge their leaders to think about these important matters. "
        },
        {
            "text": "No-one is perfect – mistakes will be made because humans are fallible and the harsh glare of hindsight may show those decisions to have been flawed. But this isn’t a reason not to try to get better at recognising the first signs of things going wrong and to respond appropriately. The cost of failure is too high not to try."
        },
        {
            "text": "This blog first appeared in Civil Service World on 25 March 2025."
        },
        {
            "text": "Sign up for alerts"
        },
        {
            "text": "Follow CSPL on Linkedin or X"
        },
        {
            "text": "Watch short film about the work of the Committee"
        }
    ]
}