{
    "url": "https://food.blog.gov.uk/2023/07/21/and-the-winner-of-the-rcvs-impact-award-is-collin-willson/",
    "title": "And the winner of the RCVS Impact Award is... Collin Willson!",
    "authors": [
        "Dr Natalie Sampson, Head of Veterinary Advisory Services, UK & International Affairs Directorate"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-07-21T11:56:04+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The FSA has long been proud of all of its vets and the vital work they do."
        },
        {
            "text": "The challenge has been that this work protecting public health, animal health and welfare and underpinning international trade often goes unnoticed by the public and frequently by the wider veterinary profession. Our colleagues in the clinical veterinary world hold the public imagination much more and yet, without undermining clinical practice, the profession also offers many other interesting opportunities and career paths."
        },
        {
            "text": "Imagine then, our delight when Collin not only won the Impact Award from The Royal College of Veterinary Surgeons (RCVS) but was nominated by British Veterinary Association (BVA) President Malcolm Morley. Collin has a lifetime of achievements which deserve nominations in their own right but the ‘catapult’ for this particular award is his vital work on welfare at slaughter, especially his work with the Halal meat industry."
        },
        {
            "text": "The ongoing impact of his work will positively affect millions of animals… and knowing Collin, he will just shrug and continue making a difference in his own humble way."
        },
        {
            "heading": 3,
            "text": "Here's what Collin says about his RCVS Impact Award win:"
        },
        {
            "text": "I had the pleasure of joining Collin’s family at RCVS Awards Day to watch Collin receive his award in person and represent those of us who have chosen a different veterinary career pathway."
        },
        {
            "text": "I have no hesitation in pushing Collin into the limelight to let him know how proud we all are of him."
        },
        {
            "heading": 1,
            "text": "Enillydd Gwobr Effaith Coleg Brenhinol y Milfeddygon (RCVS) yw... Collin Willson!"
        },
        {
            "text": "Mae milfeddygon a’r gwaith hanfodol y maent yn ei wneud o hyd wedi bod yn destun balchder i’r Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Fodd bynnag, nid yw’r gwaith sy’n diogelu iechyd y cyhoedd, iechyd a lles anifeiliaid, ac sy’n sail i fasnach ryngwladol yn dwyn sylw’r cyhoedd na’r proffesiwn milfeddygol ehangach yn aml iawn. Mae ein cydweithwyr yn y byd milfeddygol clinigol yn well am ddal dychymyg y cyhoedd ac, heb danseilio ymarfer clinigol, mae’r proffesiwn hefyd yn cynnig llawer o gyfleoedd a llwybrau gyrfa diddorol eraill."
        },
        {
            "text": "Dychmygwch felly pa mor falch oeddem pan enillodd Collin, nid yn unig Gwobr Effaith Coleg Brenhinol y Milfeddygon (RCVS), ond hefyd pan gafodd ei enwebu gan Lywydd Cymdeithas Milfeddygon Prydain (BVA), Malcolm Morley. Mae gan Collin oes o gyflawniadau sydd oll yn haeddu enwebiadau. Fodd bynnag, yr hyn a arweiniodd at ennill y wobr arbennig hon oedd ei waith hanfodol ar les anifeiliaid adeg eu lladd, ac yn enwedig ei waith gyda’r diwydiant cig Halal."
        },
        {
            "text": "Bydd effaith barhaus ei waith yn effeithio’n gadarnhaol ar filiynau o anifeiliaid... a o nabod Collin, bydd yn codi’i ysgwyddau a pharhau i wneud gwahaniaeth yn ei ffordd ddiymhongar ei hun."
        },
        {
            "heading": 3,
            "text": "Dyma air gan Collin am ennill Gwobr Effaith RCVS:"
        },
        {
            "text": "Cefais y fraint o ymuno â theulu Collin ar Ddiwrnod Gwobrau RCVS i’w weld yn derbyn ei wobr yn bersonol, gan hefyd gynrychioli’r rheiny sydd wedi dewis llwybr gyrfa milfeddygol gwahanol."
        },
        {
            "text": "Rwyf wrth fy modd yn canu clodydd Collin, gan sicrhau ei fod yn gwybod ein bod ni gyd yn hynod o falch ohono ef a’i lwyddiannau."
        }
    ]
}