{
    "url": "https://equalities.blog.gov.uk/2023/07/21/womens-reproductive-health-ending-period-stigma-in-the-construction-sector/",
    "title": "Women’s Reproductive Health: Ending period stigma in the  construction sector",
    "authors": [
        "geostrategiccomms"
    ],
    "categories": [
        "GEO team",
        "Men and Boys",
        "Women"
    ],
    "pub_date": "2023-07-21T12:56:34+01:00",
    "content": [
        {
            "heading": 4,
            "text": "To mark the one year anniversary of the landmark Women’s Health Strategy for England, the Equality Hub is hosting the first of a series of roundtables with businesses, to identify what good support looks like for women experiencing health issues such as infertility, pregnancy loss and menstruation in the workplace."
        },
        {
            "text": "We will be hearing from Rick Lee OBE, Chief People Officer at Willmott Dixon, one of the UK's leading construction and property services companies, on their leadership in promoting period dignity in the construction sector."
        },
        {
            "text": "Despite some progress, the industry is still male-dominated (in 2022, around 15% of people employed in the construction industry were women) and periods still largely remain a ‘taboo’ subject. This means that all too often there is a risk that welfare facilities and toilets may not be suitable for female employees (for example there may not be separate facilities, or sanitary waste bins may not be provided or regularly emptied)."
        },
        {
            "text": "Rick Lee explains -"
        },
        {
            "text": "At Willmott Dixon, one of our employees was at a meeting of our Diversity Steering Group and she said that she had been to a site recently, during her period."
        },
        {
            "text": "She said that she went to use the women’s toilet, as she needed period products. The toilet was locked so she had to request a key! She then discovered that the toilet served as a storage room for cleaning equipment. Once she managed to get past the cleaning equipment, to her dismay, she discovered there were no period products available."
        },
        {
            "text": "She highlighted her experience in the Diversity Steering Group meeting and challenged us to think about what that experience may have been like for her and other women working on construction sites. This triggered the Steering Group into taking immediate action to address this important issue."
        },
        {
            "text": "Promoting period dignity at Willmott Dixon"
        },
        {
            "text": "To avoid a recurrence, Willmott Dixon made a commitment to promote period dignity on all of our sites and offices. As such, we have committed to:"
        },
        {
            "text": "● Ensuring that each site/office has a designated female toilet which is always\naccessible, regularly cleaned and lockable.\n● Ensuring that hand washing facilities with running water and soap are\nprovided in all welfare facilities.\n● Ensuring that sanitary bins are provided and that they are cleaned and\nemptied regularly.\n● Ensuring that an ‘emergency’ supply of period products are provided, free to\nour people.\n● Using a Social Enterprise, such as Hey Girls for the supply of the period\nproducts.  (Hey Girls are a social enterprise with a buy one give one philosophy, all profits help girls or women in need. We buy a box, they give a box)."
        },
        {
            "text": "As part of site inspections, our Health and Safety team monitor the implementation of these agreed actions. Period dignity is also covered in our Inclusive Facilities Guidance."
        },
        {
            "text": "Ending period stigma and helping women thrive in the workplace"
        },
        {
            "text": "Willmott Dixon are pleased to be part of the conversation with government and wider employer networks to identify what support is already available around women's reproductive health over the life course, including tackling workplace period stigma. The importance of meaningful dialogue on these issues cannot be understated if we are to achieve fully inclusive workplaces where everyone can thrive and reach their full potential."
        }
    ]
}