{
    "url": "https://planninginspectorate.blog.gov.uk/2025/10/23/a-complex-landscape-with-real-opportunities/",
    "title": "A complex landscape with real opportunities",
    "authors": [
        "Rebecca Phillips"
    ],
    "categories": [
        "Appeals"
    ],
    "pub_date": "2025-10-23T12:06:30+01:00",
    "content": [
        {
            "text": "Interim Chief Planning Inspector, Rebecca Phillips, reflects on the opportunities and challenges for housing development following changes to national planning policy on Green Belt.  "
        },
        {
            "text": "At this year’s National Planning Conference I was lucky enough to be part of a panel discussion tantalisingly titled ‘The Grey Belt debate: Exploring the impact of land categorisation on development viability.’ "
        },
        {
            "text": "My fellow panel members were drawn from different corners of the development world and it’s always so worthwhile and instructive to listen to the views and real-life examples of how policy plays out in the wider planning system. "
        },
        {
            "heading": 2,
            "text": "What is Grey Belt? "
        },
        {
            "text": "Grey belt is a relatively new term which opens up possibilities in plan-making and decision-making.  "
        },
        {
            "text": "It is described in full here in the updated National Planning Policy Framework (see Page 73) which saw the introduction of Grey Belt land within the Green Belt where it makes a limited contribution to its core purposes. This land is now prioritised for development – where housing needs cannot otherwise be met. "
        },
        {
            "heading": 2,
            "text": "Grey Belt in practice "
        },
        {
            "text": "Its practical use is complex, and as the panel reflected, will present some planning challenges – particularly around development viability. "
        },
        {
            "text": "Local Planning Authorities (LPAs) are required to review Green Belt boundaries if they cannot meet development needs using non-Green Belt land – signalling a shift of the policy from being discretionary to mandatory. LPAs must now balance housing delivery targets with Green Belt protections. However, there is still a sequential approach to land release with brownfield land being considered first, then Grey Belt and Green Belt land – but only if necessary.  "
        },
        {
            "text": "The introduction of Golden Rules  (see paragraph 156 of the National Planning Policy Framework) for major development includes a higher affordable housing requirement on Green Belt sites (up to 50%) as well as infrastructure and accessible green space requirements. Members of the panel argued that higher affordable housing and other contributions could depress land values, especially for sites newly released from the Green Belt.  "
        },
        {
            "text": "There was also acknowledgement from the panel that there are considerable variations in viability depending on location. It was argued that in some regions where land values are lower, affordable housing targets and other requirements could well render schemes unviable.    "
        },
        {
            "heading": 2,
            "text": "What next? "
        },
        {
            "text": "This means for LPAs, as ever, strategic planning is key. For developers, constructive and early dialogue, site selection and financial modelling is more critical than ever.      "
        },
        {
            "text": "At the Planning Inspectorate we understand this is a complex part of policy and we’re keen to share our insights and information wherever possible. If you haven’t managed to catch it already, our webinar on decision making in Green Belt appeals is really useful.  "
        },
        {
            "text": "The National Planning Conference was held in Manchester and was hosted by the RTPI, Planning Portal and The Planner. "
        },
        {
            "text": "ENDS "
        },
        {
            "text": "Panel Members for The Grey Belt Debate were: "
        },
        {
            "text": "Dan Williams – Chief Revenue Officer TerraQuest and Planning Portal "
        },
        {
            "text": "Rebecca Phillips – Interim Chief Planning Inspector "
        },
        {
            "text": "Megan Wilson – Head of Planning, Marrons "
        },
        {
            "text": "Mark Skillbeck – UK Planning Director, Taylor Wimpey Plc "
        },
        {
            "text": "Annette Roberts – Corporate Director for Place and Communities, South Staffordshire District Council "
        }
    ]
}