{
    "url": "https://companieshouse.blog.gov.uk/2025/10/23/companies-house-strategy-building-trust-in-our-data-cracking-down-on-economic-crime-and-supporting-growth/",
    "title": "Companies House strategy: Building trust in our data, cracking down on economic crime and supporting growth",
    "authors": [
        "Andy King - Chief Executive and Registrar of Companies for England and Wales"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2025-10-23T11:46:17+01:00",
    "content": [
        {
            "text": "Having only joined Companies House recently, I’ve been impressed at the commitment of our people to our mission, our service users and our ongoing transformation. I’m delighted to be able to share the next chapter in our journey, our new 5-year strategy."
        },
        {
            "heading": 2,
            "text": "The backdrop"
        },
        {
            "text": "Companies House has been offering free access to its data for 10 years now. We were pioneers in truly open business registers, and that openness has created enormous value for the UK economy."
        },
        {
            "text": "But we're not stopping there. We want to lead global standards for corporate registries. When other countries look at how to balance transparency with business needs, we want them to look to the UK as the gold standard."
        },
        {
            "text": "The Economic Crime and Corporate Transparency Act 2023 changed everything for us at Companies House. It was the biggest shake-up in our 180-year history, giving us new powers and new responsibilities. Fast forward to today and we’re not just registering information - we’re actively checking it, challenging it, and using it to prevent misuse of our registers and associated harms."
        },
        {
            "heading": 2,
            "text": "Our vision for 2030"
        },
        {
            "text": "We’re on a mission to ensure that our registers deliver greater value for legitimate businesses whilst stopping the criminals who try to abuse them."
        },
        {
            "text": "We're determined to help create an environment where honest businesses can thrive, letting legitimate businesses know that their competitors aren't getting an unfair advantage by cutting corners or breaking the law. We want them to know that when they're doing business with another company, the information we hold about them is accurate and trustworthy. That's what we're building."
        },
        {
            "text": "By 2030, we want to be known as the trusted guardian of corporate transparency. That means when someone looks up a UK company anywhere in the world, they can be confident the information they're seeing is accurate, up-to-date, and reliable."
        },
        {
            "text": "This isn't just about Companies House – it's about supporting the government's broader mission for economic growth. When businesses can trust the corporate information ecosystem, when criminal misuse of the register is actively investigated and deterred, and when legitimate companies can operate efficiently, everyone wins."
        },
        {
            "heading": 2,
            "text": "A brighter future ahead"
        },
        {
            "text": "The next 5 years will see Companies House continue to transform from a traditional registry into a dynamic, intelligent guardian of corporate transparency. We're continuing to evolve into an organisation that will better protect businesses, support economic growth, and help disrupt crime – not just in the UK, but internationally."
        },
        {
            "text": "For business owners, this means operating in a fairer, more equitable business landscape, where legitimate companies which play by the rules can thrive. For every citizen, it means better protection from economic crime and a stronger, more trustworthy business environment."
        },
        {
            "text": "Companies House is now more than a registry – we're building the foundations for a more transparent, secure, and prosperous business environment for everyone."
        },
        {
            "text": "Read the Companies House 2025 to 2030 strategy."
        }
    ]
}