{
    "url": "https://dragonsden.blog.gov.uk/2025/10/23/dragons-den-ip-blog-series-22-episode-13/",
    "title": "Dragons Den IP Blog - Series 22 Episode 13",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Copyright",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-10-23T21:00:00+01:00",
    "content": [
        {
            "text": "As I settled in to watch this week's Dragons' Den, I was ready and eager to spot the intellectual property (IP) opportunities amongst the pitches. From wrestling entertainment to tattoo care, educational gaming and house-sharing solutions, the Den was packed with innovation and tech ventures at every turn. "
        },
        {
            "heading": 3,
            "text": "Slamming into the Den "
        },
        {
            "text": "The first pitch quite literally crashed onto our screens. Andrew Bowers, founder of North Wrestling, was the first to emerge from the lift and as he did so, a staged fight broke out between the two wrestlers he'd brought along! "
        },
        {
            "text": "After a tense and exciting wrestle, Andrew pitched what he described as 'the ultimate variety show' – a ticket-selling business that also finds success on social media. The pitch was filled with nostalgia as he shared tales of childhood wrestling matches with his dad. The entrepreneur and his business certainly packed an impressive punch. "
        },
        {
            "text": "Andrew mentioned in the pitch that an extra source of revenue from the brand is the merchandise they sell both at matches and on their website, which features their eye-catching logo.   "
        },
        {
            "text": "Logos, words, colours or even sounds can be protected with a registered trade mark. Trade marks help consumers to distinguish goods or services from those on offer from similar companies and are an essential asset when building a brand.   "
        },
        {
            "text": "Despite the jaw-dropping introduction and Andrew's clear passion for wrestling, he couldn't twist the Dragons' arms into investment and left the Den without backing. "
        },
        {
            "heading": 3,
            "text": "Well-designed care "
        },
        {
            "text": "The next entrepreneur to brave the Dragons was Fiona Ritchie, owner of The Ink Balm – a tattoo care balm made from vegan oils and butters, specially formulated to care for tattoos. The balm is also in a stick form, making it convenient for application on the go. While Fiona doesn't have any tattoos herself, she entered the Den with a promise that should the Dragons invest in her product, she would get a dragon tattoo herself! "
        },
        {
            "text": "Fiona shared the market potential: 40% of Gen Z and Millennials have inky body art, and there are more than 3,000 tattoo studios and 10,000 artists in the UK . Fiona claimed that she wants to become the go-to product for tattoo aftercare. She asked the Dragons for £60,000 in exchange for 15% of her business to help achieve this goal. "
        },
        {
            "text": "Beyond the planet-friendly ingredients, Fiona's unique selling point lies in the labels that adorn her balms. Tattoo studios that stock her product have an opportunity to design their own labels based on their unique artistic style, meaning artists can stock products authentic to their brand. "
        },
        {
            "text": "Despite the booming tattoo market, the Dragons chose not to invest, meaning Fiona may not be getting that dragon tattoo anytime soon. "
        },
        {
            "heading": 3,
            "text": "Power-up your classroom "
        },
        {
            "text": "Next to enter the Den was Reedah El-Saie, founder of Brainspark Games. Her pitch was inspired by watching her own children gaming, and she was determined to find ways to integrate education and lesson plans into games. "
        },
        {
            "text": "After introducing the Den to the company, conversation turned to the future of innovation and tech in education. Brainspark Games has received an Innovate UK grant to fund the project, and Peter Jones, being somewhat of an expert in the area, was quick to engage. "
        },
        {
            "text": "Peter shared that the success of educational games depends on getting them into schools – something close to his heart. As a government advisor, he's been working to embed innovation into the curriculum, though he acknowledged it's a long road ahead. "
        },
        {
            "text": "Our IPO education team is also working to introduce more children to innovation in schools, with a focus on understanding IP. You can access free teaching resources focused on IP through our online support tools, designed to help educators bring these concepts into the classroom. "
        },
        {
            "text": "In the end though, it was Sara Davies who joined forces with Touker Suleyman and Deborah Meaden, with all three Dragons investing £10,000 each for a 1% stake in Reedah's business. "
        },
        {
            "heading": 3,
            "text": "With a little help from your friends "
        },
        {
            "text": "The youth of today have been dubbed 'generation rent', with more people than ever engaging with private lets and house shares with strangers. As someone who's done my fair share of house sharing, I’m aware that this can come with risks – something which MatesPlace aims to address. "
        },
        {
            "text": "Rebecca Moule and Sophie Emler propose that by importing your phone contacts to the app, you can find out if you have any mutual connections with potential housemates. This will allow you to get a personal reference before making any decisions to house share with them.   "
        },
        {
            "text": "Touker Suleyman offered the £100,000 the entrepreneurs requested, but for a 20% stake rather than their hoped-for 5%. They accepted the offer, proving that sharing really can work out well.  "
        },
        {
            "text": "What an evening in the Den! From wrestling excitement to educational gaming innovations, intellectual property considerations were present in every pitch. "
        },
        {
            "text": "Disclaimer: The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs' pitches and highlight how IP works, or could work, in the real-life examples featured. IPO's authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}