{
    "url": "https://otsi.blog.gov.uk/2025/10/23/making-licensing-applications-for-sanctioned-trade-services-more-flexible-and-secure/",
    "title": "Making licensing applications for sanctioned trade services more flexible and secure",
    "authors": [
        "Office of Trade Sanctions Implementation"
    ],
    "categories": [
        "Trade Sanctions"
    ],
    "pub_date": "2025-10-23T14:57:40+01:00",
    "content": [
        {
            "text": "OTSI has now introduced GOV.UK One Login and a new ‘save and return’ feature to apply for a licence to provide sanctioned trade services. "
        },
        {
            "text": "The changes are designed to give businesses more flexibility and security when applying for licences using OTSI’s online service.  "
        },
        {
            "text": "Using GOV.UK One Login "
        },
        {
            "text": "GOV.UK One Login enables users to sign in to OTSI’s trade sanctions licensing service, and a number of other government services, with the same email address and password. "
        },
        {
            "text": "Once signed in, users can continue the applications they have started and view those they have previously submitted. "
        },
        {
            "text": "This can be done from anywhere, on any device. It also adds in advanced security features to help protect personal information, such as multi-factor authentication and secure encryption. "
        },
        {
            "text": "Adding the ability to save and return "
        },
        {
            "text": "We understand that licence applicants may need to gather information and to collaborate offline when applying for a licence. With this new feature, users can now save their progress at any point in the application and return later to finish it.  "
        },
        {
            "text": "This means there is no longer a need to complete an entire application in one sitting, making it easier to apply for a trade sanctions licence. It also reduces the risk of potentially losing work.  "
        },
        {
            "text": "Feedback "
        },
        {
            "text": "OTSI is committed to continually improving our services. If you have any feedback or suggestions, please get in touch."
        }
    ]
}