{
    "url": "https://ipo.blog.gov.uk/2025/10/23/moka-magic-how-ip-fuels-your-morning-coffee-ritual/",
    "title": "Moka magic: how IP fuels your morning coffee ritual",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "3D Shape Trade Mark",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-10-23T10:00:00+01:00",
    "content": [
        {
            "text": "Coffee is more than just a beverage - it’s a daily ritual, a social connector, and for many, a moment of calm before the day begins. Whether it’s a quick instant brew between meetings or a slow stovetop preparation shared with housemates, the way we make and enjoy coffee is steeped in tradition and innovation. My personal favourite? The moka pot."
        },
        {
            "text": "A moka pot is a small, stove-top coffee maker that brews strong, espresso-like coffee by passing boiling water pressurised by steam through ground coffee. While there have been a range of versions available on the market, the original aluminium Moka Express® , iconic in both design and function, was created by Italian inventor Alfonso Bialetti in the mid-20th century."
        },
        {
            "text": "There’s something special about the rich aroma of the brew and the satisfying clink of metal on the hob. But behind this familiar ritual lies a fascinating story of design, invention, and intellectual property (IP) - the unsung hero that helped shape the moka pot into the icon it is today."
        },
        {
            "heading": 3,
            "text": "The perfect brew begins"
        },
        {
            "text": "The moka pot might seem like a simple kitchen tool, but it’s the result of clever problem-solving and a few key pieces of intellectual property. In 1964, Alfonso Bialetti filed a patent titled “Steam pressure coffee maker for the preparation of express coffee for domestic use” (ES318772A). His invention addressed a common issue with home coffee makers at the time: water temperatures during brewing often reached boiling point, which could overpower the delicate flavours and aromas in the coffee."
        },
        {
            "text": "To solve this, Bialetti introduced an intermediate container between the boiler and the coffee filter. This part acted as a temperature regulator, allowing the water to heat more gently and stay below 100 degrees Celsius. The result was a smoother, more balanced cup of coffee that avoided the bitterness caused by overheating."
        },
        {
            "text": "Bialetti’s innovation didn’t stop there. The company went on to file further patents, including one in 1999 for a pressure coffee maker that improved consistency throughout the brewing process (EP1208781A). This ensured that water only passed through the coffee grounds once the right pressure and temperature had been reached. It produced coffee with a creamy top layer, similar to what you’d get from an espresso machine, while keeping the process simple and affordable for home use."
        },
        {
            "heading": 3,
            "text": "The man with the moustache"
        },
        {
            "text": "If you’ve ever used a Moka Express®, you might have noticed the little cartoon man with a moustache printed on the side. That character isn’t just decoration, it’s part of Bialetti’s brand identity and is said to be based on Alfonso Bialetti himself."
        },
        {
            "text": "The company registered this illustration as a trade mark in 1960 (UK00000812953), and it’s one of several marks Bialetti has filed to protect its brand. Others include the name Moka Express® (UK00000740098) and the Bialetti logo (UK00801499957)."
        },
        {
            "text": "One of the more interesting registrations is a 3D shape trade mark protecting the shape of the pot (UK00904253233). It’s important to note that while the company was able to register this trade mark, three dimensional marks can be complex to obtain. If you're interested in filing an application for a 3D shape trade mark, we recommend consulting a trade mark attorney. You can find an attorney on CITMA’s website."
        },
        {
            "heading": 3,
            "text": "The perfect blend"
        },
        {
            "text": "These days, moka pots don’t just come in the classic silver colour. You’ll find them in bright colours, bold patterns, and even themed designs inspired by pop culture. Some of these are the result of collaborations between Bialetti and other brands."
        },
        {
            "text": "Bialetti has worked with TV shows like Stranger Things, Squid Game, and Bridgerton, as well as fashion label Dolce & Gabbana and outdoor brand The North Face. These partnerships are usually made through licensing agreements, which permit Bialetti to use certain parts of the other brand, like logos or design elements, while the original brand keeps control over how its identity is used."
        },
        {
            "text": "It’s a smart way to protect creative work while opening the door to new ideas. Licensing can help brands grow, reach new audiences, and create something fresh without giving up ownership. For Bialetti, it means the classic moka pot gets a modern twist, while still staying true to its roots."
        },
        {
            "heading": 3,
            "text": "Grounds for thought"
        },
        {
            "text": "Next time I brew coffee in my moka pot, I’ll be thinking about more than just the flavour. It’s a great example of how intellectual property shapes the everyday - from the way a product works to how it looks and feels. The original patents solved real technical problems, improving the brewing process for home users. The trade marks built a brand that’s instantly recognisable, right down to the moustached man on the side. And today, licensing keeps the product fresh through collaborations that blend heritage with pop culture."
        },
        {
            "text": "\n"
        },
        {
            "text": "\n"
        },
        {
            "text": " "
        },
        {
            "text": "\n"
        }
    ]
}