{
    "url": "https://ukhsa.blog.gov.uk/2025/10/23/norovirus-what-to-do-if-you-catch-it-and-helping-to-stop-the-spread/",
    "title": "Norovirus: What to do if you catch it and helping to stop the spread",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Norovirus"
    ],
    "pub_date": "2025-10-23T15:43:13+01:00",
    "content": [
        {
            "text": "Norovirus, commonly known as the winter vomiting bug (although you can catch it throughout the year, including during summer), is a stomach bug that causes vomiting and diarrhoea. It spreads easily through communities, making outbreaks common in settings where individuals have close contact such as hospitals, care homes, schools and nurseries."
        },
        {
            "text": "The virus infects the stomach and intestines, and is also known as a gastrointestinal virus. You can catch norovirus more than once in a short time period because multiple types (or genotypes) of norovirus circulate at any given time. You may develop limited immunity to one strain but can still be infected by a different one soon after."
        },
        {
            "heading": 2,
            "text": "What are the symptoms of norovirus infection?"
        },
        {
            "text": "Symptoms include sudden onset of feeling sick and wanting to vomit, projectile vomiting and diarrhoea, but can also include a high temperature, pain in the stomach area and aching limbs."
        },
        {
            "heading": 2,
            "text": "How long do norovirus symptoms take to develop?"
        },
        {
            "text": "The incubation period of norovirus is usually 12 to 48 hours. This is the time between catching the virus and developing symptoms."
        },
        {
            "heading": 2,
            "text": "How long are you contagious for with norovirus?"
        },
        {
            "text": "Individuals are most infectious when showing symptoms, but it's possible to pass on norovirus both before developing symptoms and after symptoms have stopped. You should stay at home and avoid preparing food for others until 48 hours after symptoms have completely stopped, as you may still be shedding the virus during this time."
        },
        {
            "heading": 2,
            "text": "How long do norovirus symptoms last?"
        },
        {
            "text": "For most people, norovirus is an unpleasant but short-lived illness, with full recovery within 2 to 3 days without needing any medicine. However, some groups - including young children, the elderly or those with weakened immunity - are at risk of suffering more serious and prolonged illness, which may require medical treatment."
        },
        {
            "heading": 2,
            "text": "How long does norovirus last on surfaces?"
        },
        {
            "text": "Norovirus can survive on surfaces for days or weeks, this is one of the key reasons why the virus spreads so easily through communities. It is important to properly clean and disinfect contaminated surfaces using a bleach-based solution (chlorine), wearing disposable gloves where possible. The typical recommendation is to use a 0.1% sodium hypochlorite solution (i.e. 1,000 parts per million (ppm)) for surfaces."
        },
        {
            "heading": 2,
            "text": "What treatment is there for norovirus?"
        },
        {
            "text": "There is no specific treatment for norovirus and it cannot be treated with antibiotics because antibiotics work to fight bacteria, not viruses. The focus of treatment is preventing dehydration by drinking plenty of fluids, as vomiting and diarrhoea cause your body to lose water and salts. Elderly people, young children and those with weakened immune systems are most at risk of becoming dehydrated and may need medical treatment."
        },
        {
            "heading": 2,
            "text": "How can I avoid catching norovirus?"
        },
        {
            "text": "Good hand hygiene is crucial to stop norovirus spreading. Wash your hands frequently and thoroughly with soap and warm water, particularly after using the toilet, before eating or preparing food, and after cleaning up vomit or diarrhoea. Alcohol-based hand sanitisers don’t kill norovirus."
        },
        {
            "heading": 2,
            "text": "What should I do if I have norovirus?"
        },
        {
            "text": "If you've got norovirus:"
        },
        {
            "heading": 2,
            "text": "How can we stop norovirus spreading?"
        },
        {
            "text": "Practising good hygiene and avoiding contact with others while infectious are the best ways of preventing the virus from spreading. The virus is easily transmitted through contact with infected people and any surfaces or objects contaminated with the virus, so thorough cleaning and proper hand hygiene are essential."
        },
        {
            "text": "Wash any contaminated clothing or bedding using normal washing powder at 60°C, and if possible, wear disposable gloves to handle contaminated items. Disinfect contaminated surfaces using bleach-based cleaning products where possible, as norovirus can survive on surfaces for days or weeks otherwise."
        },
        {
            "heading": 2,
            "text": "Is norovirus called stomach flu because it is related to the flu virus?"
        },
        {
            "text": "No, norovirus is not related to the flu virus at all. The term ‘stomach flu’ is misleading - it's simply a common nickname for inflammation of the stomach and intestines. The seasonal flu is caused by influenza viruses, which are completely different from norovirus and primarily affect the nose, mouth, lungs and airways rather than the digestive system. Norovirus is a gastrointestinal virus."
        },
        {
            "heading": 2,
            "text": "What is Kawasaki norovirus?"
        },
        {
            "text": "One of the norovirus genotypes (GII.17) has been incorrectly covered in the media as Kawasaki norovirus, which is a historic GII.17 variant, not another name for the current GII.17. The distinction is important because the incorrect use of ‘Kawasaki virus’ has caused confusion with ‘Kawasaki disease,’ which is an unrelated, very serious condition."
        }
    ]
}