{
    "url": "https://healthmedia.blog.gov.uk/2025/10/23/resident-doctor-strikes-everything-you-need-to-know/",
    "title": "Resident doctor strikes: everything you need to know ",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2025-10-23T15:47:30+01:00",
    "content": [
        {
            "text": "The British Medical Association (BMA) announced resident doctors strikes from July 25 to July 30 and called further strikes from Friday 14 November to Wednesday 19 November."
        },
        {
            "text": "Here, we tell you everything you need to know about resident doctor strikes, including what patients need to know about their care in the event of future strikes. "
        },
        {
            "heading": 3,
            "text": "What happens next and what are you doing to stop strikes?"
        },
        {
            "text": "With waiting lists down by over 206,000, satisfaction with GPs on the up, and 5.2 million appointments delivered in our first year, we are turning the NHS around."
        },
        {
            "text": "There is finally light at the end of the tunnel for the NHS, but the BMA is putting that progress at risk with further strike action."
        },
        {
            "text": "We have been clear that, following a 28.9% pay rise across three years for resident doctors, we cannot go further on pay this year."
        },
        {
            "text": "By walking out on strike, the BMA are walking away from an offer to improve resident doctors’ working conditions and create more specialty training roles to progress their careers."
        },
        {
            "text": "This government is clear that it wants to work constructively with all unions to improve working conditions."
        },
        {
            "heading": 3,
            "text": "What were you discussing with resident doctors?"
        },
        {
            "text": "This government is fully committed to measures which will genuinely improve the working lives of resident doctors and expand their training opportunities."
        },
        {
            "text": "We cannot move on pay this year. "
        },
        {
            "text": "This government is willing to work with the BMA to go further on: "
        },
        {
            "text": "The BMA are blocking a better deal for doctors."
        },
        {
            "heading": 3,
            "text": "How much do resident doctors earn? "
        },
        {
            "text": "New resident doctors when their additional earning are included earn an average of £49,000 a year, rising to £97,000 for the most experienced resident doctors.  "
        },
        {
            "text": "That is significantly more, in a resident doctor’s first year, than the average full-time worker in this country earns."
        },
        {
            "heading": 3,
            "text": "What pay rises have they had in recent years? "
        },
        {
            "text": "Resident doctors pay has increased by 28.9% across the last three years, thanks to this government. "
        },
        {
            "text": "For the second consecutive year, resident doctors received the highest pay increase across the public sector – 5.4% this year. This means they’ve had two years in a row of above inflation pay increases.  "
        },
        {
            "heading": 3,
            "text": "Is it true that there’s a doctor employment crisis?"
        },
        {
            "text": "According to recent UKFPO survey data, 80% of doctors had secured a role post Foundation training by August of the year they graduate from the programme. "
        },
        {
            "text": "However, we know that high competition for speciality training has caused concern, and we are taking steps to address this. "
        },
        {
            "text": "By cutting red tape and investing more in our NHS, we have already put over 2,500 extra GPs into general practice to deliver more appointments through our Plan for Change.   "
        },
        {
            "text": "We are creating 1,000 additional training places, taking steps to prioritise UK medical graduates and other doctors who have worked in the NHS for a significant period for specialty posts, while conducting a review of postgraduate training to make sure the system works for doctors."
        },
        {
            "text": "In October, NHSE made changes to this year’s specialty training application process to reduce competition and support UK medical graduates.  "
        },
        {
            "text": "We want to work with the BMA on this, but their reckless rush to strike action compromises resource which could have been focussed on work to improve conditions and career progression for doctors."
        },
        {
            "heading": 3,
            "text": "Is it true that most resident doctors didn’t vote to strike? "
        },
        {
            "text": "Yes. "
        },
        {
            "text": "Because of the turnout (55.3%), under half of resident doctors in the BMA have actually voted in favour of strike action (49.78%).  "
        },
        {
            "text": "Of the 77,000 resident doctors working in our NHS hospital and community health services, only around a third actually voted for strike action.    "
        },
        {
            "text": "The BMA launched a second ballot of first year doctors (FY1s) in autumn. In June 2025 there were over 8,200 FY1 doctors working in NHS Hospital Trusts. With only 3,950 voting in favour of a strike, based on these figures, under half (48%) of FY1s voted to strike in the FY1 ballot. "
        },
        {
            "heading": 3,
            "text": "How are you keeping patients safe during strikes? "
        },
        {
            "text": "Our priority is to keep patients safe, and we will do everything we can to mitigate the impact of the strikes on patients and the disruption that will follow.  "
        },
        {
            "text": "NHS leaders have been clear that previous rounds of strike action caused much wider levels of harm than previously realised and there is no reason why planned care for cancer for example should be treated as less important than other NHS services. We know that cancelling non-urgent work comes at a risk to patients too and must not ignore this. "
        },
        {
            "text": "Due to the dedication of NHS staff and a different operational approach from previous strikes, the NHS significantly reduced disruption to patients during strikes in July, with early indications showing that 10,000 extra patients receiving care compared to previous strike action. A majority of resident doctors didn’t vote for strike action and data shows that less than a third of residents took part."
        },
        {
            "heading": 3,
            "text": "Will my appointment be cancelled during strikes? "
        },
        {
            "text": "Patients with appointments booked on strike days will be contacted if their appointment needs to be rescheduled due to industrial action.  "
        },
        {
            "text": "If they have not been contacted, they should attend their appointment as planned.   "
        },
        {
            "text": "Any appointments that need to be rescheduled will be done so as a priority. "
        },
        {
            "heading": 3,
            "text": "What if I need urgent medical attention? "
        },
        {
            "text": "It’s important that you do not put off seeking urgent care, and you should turn up for planned appointments unless you have been told otherwise.  "
        },
        {
            "text": "Anyone who needs urgent care should use NHS 111 online or use the NHS App to be assessed and directed to the right care for them.  "
        },
        {
            "text": "As usual, patients should only use 999 if it is a serious or life-threatening emergency. "
        },
        {
            "text": "For more information on when to call 999 and when to go to A&E, you can visit the NHS UK website. "
        },
        {
            "heading": 3,
            "text": "Should I be worried about falling ill during strikes? "
        },
        {
            "text": "The NHS has tried and tested ways to keep patients safe during strikes. "
        },
        {
            "text": "This includes derogations which are exemptions or special arrangements that allow certain essential services to continue operating during industrial action, even when healthcare workers are on strike. "
        },
        {
            "text": "When NHS staff take strike action, they work with hospital management to identify critical services that must be maintained to ensure patient safety and prevent serious harm.  "
        },
        {
            "text": "This ensures that whilst industrial action can proceed to highlight disputes over pay, working conditions, or other issues, patient safety remains the primary concern. "
        }
    ]
}