{
    "url": "https://naturalengland.blog.gov.uk/2025/10/23/species-recovery-programme-call-for-ideas-opportunity/",
    "title": "Species Recovery Programme - Call for Ideas Opportunity",
    "authors": [
        "Karen Shelley-Jones",
        "Luke Gill"
    ],
    "categories": [
        "Biodiversity",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-10-23T09:07:07+01:00",
    "content": [
        {
            "text": "By Karen Shelley-Jones - Senior Officer – Funding and Grant Scheme Management and Luke Gill - Senior Officer - Species Recovery Programme"
        },
        {
            "text": "Earlier this month, we launched a new call seeking ambitious new ideas for projects aimed at recovering England’s most vulnerable species starting from next year. "
        },
        {
            "text": "Since launching the call for ideas, Natural England has received lots of enquiries, and we are excited by the level of interest across the country. Natural England has written this blog to help all prospective partners based on the range of questions asked to date."
        },
        {
            "text": "For over 30 years, the Species Recovery Programme has worked with partners to save many of England’s (and the UK’s) most threatened species from extinction. Historically, this includes the cirl bunting and large blue butterfly, and more recently it has contributed to conservation efforts for species such as the turtle dove and fen orchid."
        },
        {
            "text": "The Environment Act 2021 introduced new, legally binding targets for species. The Species Recovery Programme now directly contributes to these targets, focusing on the long-term biodiversity goal of reducing species’ extinction risk by 2042, relative to 2022 levels. "
        },
        {
            "text": "Whilst achieving environmental targets around habitats and species will depend heavily on landscape-scale approaches that restore natural ecosystem functioning, the Species Recovery Programme plays a crucial distinct but complementary role. It delivers tailored interventions for species that need targeted, species-specific action. These interventions are among those published in the Threatened Species Recovery Actions dataset which serves as the evidence base for the programme."
        },
        {
            "text": "Species eligibility"
        },
        {
            "text": "Only species with associated actions in the Threatened Species Recovery Actions (TSRA) dataset are eligible for Species Recovery Programme (SRP) funding.  Natural England intends to review TSRA at regular intervals, with the next substantive update planned for 27/28.  In addition, a very small update will take place in the coming year for particularly urgent cases where species have a new Red List status. These updates will give the opportunity to also correct errors and review new information relating to species populations and the actions required.  "
        },
        {
            "text": "In highly exceptional circumstances actions for species not in TSRA but facing imminent national extinction (GB level), could be considered, but this must be agreed with the SRP Management Team, prior to responding to the call for ideas. The SRP team will take a final decision on eligibility, but please note agreeing to accept a response for any such species does not guarantee the idea will be shortlisted."
        },
        {
            "text": "Where species have Natural England-endorsed strategies or action plans, ideas should closely adhere to these. Examples of these are:"
        },
        {
            "text": "National Single Species Action Plan for the UK Breeding Population of Black-tailed Godwit"
        },
        {
            "text": "Long-term strategic recovery plan for pine martens in Britain"
        },
        {
            "text": "Britain's National Hedgehog Strategy"
        },
        {
            "text": "England Red Squirrel Action Plan 2023-2028"
        },
        {
            "text": "A conservation strategy for the Shrill carder bee in England and Wales"
        },
        {
            "text": "UK Sturgeon Conservation Strategy and Action Plan"
        },
        {
            "text": "If you are planning to do work in an area that has a published Local Nature Recovery Strategy (LNRS) and your target species is featured in this, you should explain how your work will to help deliver the species' actions as outlined in the LNRS."
        },
        {
            "text": "We expect ideas involving any form of conservation translocation to follow the Defra code: Reintroductions and conservation translocations in England: code, guidance and forms - GOV.UK"
        },
        {
            "text": "Type of funding & eligible costs"
        },
        {
            "text": "The Species Recovery Programme was funded with a solely capital budget with strict accounting criteria during the last funding period. "
        },
        {
            "text": "Whilst the upcoming settlement for 2026/27 to 2028/29 is yet to be confirmed, we anticipate a level of resource funding to complement the capital funding for the programme."
        },
        {
            "text": "Alongside the focus on delivering targeted action, this budget change has allowed us to expand the range of actions we are able to fund, such as monitoring and advice as enabling actions, as well as offer a level funding for previously ineligible elements like overheads."
        },
        {
            "text": "Note that any contributions to overheads will likely be capped at a maximum of 20% of eligible staff costs and applicants will still need to evidence rates for this to ensure value for public money is achieved."
        },
        {
            "text": "We encourage respondents to focus their ideas on TSRA actions; we will provide further information on eligibility criteria to those invited to submit a full application."
        },
        {
            "text": "Agri-environment schemes"
        },
        {
            "text": "SRP will not fund options covered through pre-existing agri-environment scheme agreements. SRP should be focused on funding highly bespoke actions that TSRA species require which are above and beyond most agri-environment agreements and options. For instance, requiring additional management tailoring or coordination of action across multiple landholdings. We cannot provide duplicate funding."
        },
        {
            "text": "Scope"
        },
        {
            "text": "There is no limit to the number of ideas which any organisation can submit, though we encourage stakeholders to focus on fewer, high-quality, well-developed ideas as opposed to multiple, lower-quality ideas."
        },
        {
            "text": "We will be actively looking to match organisations working on the same species and actions, so we strongly encourage and expect collaboration and coordination across the sector before submission."
        },
        {
            "text": "Costs and match funding"
        },
        {
            "text": "NE’s contribution to each project is capped at £1.5m though the project may well be worth more than this should match contributions be included in the proposal."
        },
        {
            "text": "At this stage we are seeking a high-level indication of the likely amount of funding you would request from us if invited to submit a full application, we do not expect to see the detail at this call for ideas stage."
        },
        {
            "text": "We expect some match contributions (either cash or in-kind) wherever possible to demonstrate value for money.  Please note this will need to be evidenced if you are invited to apply."
        },
        {
            "text": "Funding period "
        },
        {
            "text": "The Species Recovery Programme expects to offer agreements from summer 2026 to March 2029, unfortunately not the anticipated 4-year period. While this is a significant improvement over previous commitments, the funding window may still be insufficient to support full delivery of longer-term projects (e.g. full PhD funding). In such cases, we may consider part-funding contributions and encouraging partners to utilise match funding to secure longer-term projects."
        }
    ]
}