{
    "url": "https://despatch.blog.gov.uk/2025/10/23/working-together-dvsa-and-the-driver-training-industry/",
    "title": "Working together: DVSA and the driver training industry  ",
    "authors": [
        "Pauline Reeves"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Feature",
        "Learning to drive"
    ],
    "pub_date": "2025-10-23T12:36:07+01:00",
    "content": [
        {
            "text": "First and foremost, I want to acknowledge the significant challenges that many of you as approved driving instructors (ADIs) are currently facing. We understand that the continued long waiting times for a test is: "
        },
        {
            "heading": 3,
            "text": "Tackling driving test waiting times with concrete measures"
        },
        {
            "text": "We know that words alone will not solve the problem – you need to see tangible action and measurable improvements. We will reduce waiting times, and we’re working hard to do it. Here’s what we’ve done so far: "
        },
        {
            "text": "1. Encouraging existing examiners to stay "
        },
        {
            "text": "We introduced an exceptional payment for existing examiners for the next 12 months. For every full-time examiner who stays, this could keep 1,200 tests in the system. "
        },
        {
            "text": "2. Recruiting and training 450 driving examiners "
        },
        {
            "text": "271 new examiners are now testing across Great Britain, with 67 in training. We've nearly doubled our permanent trainers to speed up onboarding. "
        },
        {
            "text": "3. Cracking down on abuse of the test booking service "
        },
        {
            "text": "Since January 2024, we have created a dedicated team to work on this and have closed 880 accounts and suspended 377. This team is also continuing to review the terms and conditions for the service to book and manage driving tests for your pupils. This is to make it easier to remove those who abuse the system. "
        },
        {
            "text": "4. Improving the way tests are booked "
        },
        {
            "text": "We recently asked for views on how to improve the rules for booking driving tests, and the consultation closed in July. We received over 100,000 responses, and we’re now reviewing the feedback to help make the system fairer and stop learners being charged too much. We are also exploring how a fairer booking system can better support disabled learner drivers, including improving access to additional time slots where extra support may be required. "
        },
        {
            "text": "5. Supporting better test preparation "
        },
        {
            "text": "Our 'Ready to Pass?' campaign is continuing to help ensure your pupils are fully prepared when they take their test, reducing wasted test slots and supporting an increase in first-time pass rates. "
        },
        {
            "heading": 3,
            "text": "Improving our communication and engagement"
        },
        {
            "text": "We've heard clearly that our communication and the way we engage with the driver training industry needs to be better. We’ve taken this on board and have been making improvements, such as:  "
        },
        {
            "heading": 3,
            "text": "Working together on shared priorities to achieve real change"
        },
        {
            "text": "Together, the forum has agreed on 5 important areas to focus on:"
        },
        {
            "text": "1. Reduce waiting times "
        },
        {
            "text": "2. Protect the profession"
        },
        {
            "text": "3. Make roads safer"
        },
        {
            "text": "4. Improve our services"
        },
        {
            "text": "5. Improve our communications"
        },
        {
            "text": "Four of these areas - 'Reduce waiting times', 'Protect the profession', 'Make roads safer' and 'Improve our communications' – will see DVSA and driving instructors working side by side to address problems. The fifth area, 'Improve our services', is where DVSA will change how we work internally to better support everything else we're doing together. "
        },
        {
            "heading": 3,
            "text": "A personal commitment"
        },
        {
            "text": "The forum is a powerful example of how DVSA and the driver training industry are coming together to deal with shared challenges. We’re not just talking about partnership – we’re doing it. I’m incredibly proud of the energy and ideas that came out of our recent meeting, and I look forward to continuing this journey together. "
        },
        {
            "text": "As Director of Driver Services, I make this personal commitment to you: we will continue to do all we can to reduce driving test waiting times, communicating transparently with you throughout the process.  "
        },
        {
            "text": "Where we succeed, we'll share that success with you because it will be the result of our partnership. Where we face challenges, we'll be honest about them and work with you to find solutions. "
        },
        {
            "text": "Your success is essential to road safety in Great Britain. When ADIs thrive, learners receive better training, and our roads become safer. That's the partnership we're committed to strengthening. "
        },
        {
            "text": "Your voice matters – share your thoughts and suggestions in the comments below to help shape future forum meetings. If you're part of a national driving instructor association, raise your concerns with them – they’ll represent your views to DVSA. "
        },
        {
            "text": "If you would like more information about what we talked about at the 2 recent car driver training and testing forum meetings, you can read the reports:"
        }
    ]
}