{
    "url": "https://educationhub.blog.gov.uk/2025/09/free-school-breakfast-clubs/",
    "title": "Everything you need to know about free school breakfast clubs",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Schools"
    ],
    "pub_date": "2025-09-29T10:22:01+01:00",
    "content": [
        {
            "text": "Families will soon be able to start accessing free breakfast clubs lasting 30 minutes for their children before school through our new free breakfast club programme."
        },
        {
            "text": "Free breakfast will help ensure pupils start every day ready to learn, and in turn will improve behaviour, attendance and attainment."
        },
        {
            "text": "We’re inviting schools to apply to be part of an early adopter scheme, rolling it out to families starting from April 2025."
        },
        {
            "text": "Up to 750 participating schools will be funded to provide access to a free, universal breakfast club lasting at least 30 minutes that includes food."
        },
        {
            "text": "As well as helping children thrive academically and socially, breakfast clubs give parents and carers more choices in childcare, and support families with the cost of living."
        },
        {
            "text": "That’s why we’ve promised to triple our investment in breakfast clubs to over £30milion in the 2025-26 financial year."
        },
        {
            "heading": 3,
            "text": "How can schools apply to the free breakfast club programme?"
        },
        {
            "text": "Schools can apply by completing an expression of interest form."
        },
        {
            "text": "Schools will be selected across different school types, sizes and geographical areas to ensure a wide range of representation."
        },
        {
            "text": "We want to test and learn with as many different types of schools as possible.  "
        },
        {
            "text": "Schools that become early adopters will have the unique opportunity to shape the future of the national breakfast club policy and directly benefit the children and families of their school.  "
        },
        {
            "heading": 3,
            "text": "When will families be able to access free breakfast clubs?"
        },
        {
            "text": "If their school is selected as one of first to roll out the free breakfast clubs, families of primary aged children will be able to access a free breakfast from April 2025."
        },
        {
            "text": "Schools will be in touch with families about how to sign up to the breakfast club."
        },
        {
            "text": "The £30million we outlined in the Budget will fund the breakfast clubs for a year from April 2025, as well as continue to support the schools currently providing the National School Breakfast Programme to disadvantaged children."
        },
        {
            "text": "We will learn from the early adopter schools before rolling out the scheme nationally."
        },
        {
            "heading": 3,
            "text": "Is this the same as the National School Breakfast Programme?"
        },
        {
            "text": "Our free breakfast club scheme is separate to our existing National School Breakfast Programme, which sees the government subsidise the cost of breakfast club provision in selected state-funded schools in disadvantaged areas, and doesn’t include childcare."
        },
        {
            "text": "We have already confirmed funding for the programme so it can continue for the next financial year."
        },
        {
            "heading": 3,
            "text": "What other support is available to families?"
        },
        {
            "text": "We’re also expanding childcare for primary school children across England by increasing the number of places available, to support working families."
        },
        {
            "text": "Separate to the breakfast programme, wraparound childcare is before and after school care for primary school aged children in England during term time, such as regular afterschool provision that runs until 6pm or later. You can read more about the offer on the Education Hub."
        },
        {
            "text": "Hundreds of thousands of eligible working parents can also now access 15 hours government-funded early education for children aged 9-months-old and older after new rules kicked in from 1 September 2024. Read more here. "
        },
        {
            "text": "Some families may also be entitled to free school meals at lunchtime. You can find out more about the programme, including who’s eligible, on Gov.uk."
        }
    ]
}