{
    "url": "https://forestrycommission.blog.gov.uk/2025/09/29/from-seed-to-sapling-why-seed-collection-is-fundamental-to-future-forest-resilience/",
    "title": "From seed to sapling: why seed collection is fundamental to future forest resilience",
    "authors": [
        "Lorenza Pozzi"
    ],
    "categories": [
        "Climate change and resilience"
    ],
    "pub_date": "2025-09-29T09:00:00+01:00",
    "content": [
        {
            "text": "Each autumn, a quiet but critical process begins across the country: the collection of tree seed. This marks the very first step in the journey from seed to sapling and ultimately, to a thriving forest."
        },
        {
            "heading": 2,
            "text": "The meticulous task of tree seed collection"
        },
        {
            "text": "Seed collection is a skilled and strategic task. Trained collectors begin by identifying trees and stands that have produced a significant crop of seed or fruit. Armed with large bags and a great deal of patience, they set out to gather seeds in a variety of ways, depending on the species, terrain and available resources."
        },
        {
            "text": "For example, oak trees often require large nets to be spread beneath their canopy to catch falling acorns. This method prevents the acorns from reaching the forest floor, where they would quickly rot. In contrast, species such as hawthorn, rose or blackthorn are typically harvested by hand, requiring careful handling of the thorny branches to collect berries, rosehips and sloes."
        },
        {
            "text": "Once collected, the seeds undergo several processing steps. Some are ready to be sown immediately, while others must be cleaned to separate them from the surrounding fruit flesh, cones, or wings. Certain species also require a process called stratification, in which seeds are exposed to specific temperature conditions for a set period, to break dormancy and trigger germination. Only then can the seeds be sown or stored in a temperature and humidity controlled environment to preserve their viability."
        },
        {
            "heading": 2,
            "text": "Investing in seed collection"
        },
        {
            "text": "Seed collection, processing and storage are foundational to successful tree production. For this reason, as England works toward its statutory target of increasing tree and woodland cover to 16.5% of total land area by 2025,1 investment in seed infrastructure has become increasingly important. Forestry England has taken a leading role in this effort, establishing a state-of-the-art seed processing facility at Delamere nursery in Cheshire."
        },
        {
            "text": "The Forestry Commission’s tree and seed production grants have enabled various organisations to improve their seed processing capabilities, such as More Trees, which have been able to increase their community tree nursery network seed collections from 30,000 to 150,000 seeds annually."
        },
        {
            "text": "Through the first three rounds of the Seed Sourcing Grant, the Forestry Commission has funded the identification, management or establishment of over 200 seed stands or orchards, representing over 20 different species."
        },
        {
            "heading": 2,
            "text": "Genetic quality not just quantity"
        },
        {
            "text": "Effective seed collection is not simply about gathering as many seeds as possible. Quality and genetic diversity are equally critical. A robust seed collection strategy involves sourcing seed from a wide geographic area and from numerous individual trees. This approach maximises intra-specific genetic diversity (the genetic diversity within one species) to increase the ways trees can respond to future threats."
        },
        {
            "text": "Genetic diversity equips woodlands to better tolerate and adapt to environmental stressors such as drought, pests and disease. Each tree carries a unique genetic makeup, and within a diverse population, some individuals may possess traits that enable them to survive and thrive under challenging conditions. This diversity in populations offers a variety of responses to threats, increasing the overall adaptability and health of the woodland ecosystem."
        },
        {
            "heading": 2,
            "text": "A combined approach to seed sourcing"
        },
        {
            "text": "Veteran trees are often assumed to be genetically superior due to their longevity and presumed local adaptation. While these trees can certainly contribute valuable genetic material, their survival could also have been influenced by chance, historical land use or human selection, rather than by inherently superior genetics. In addition, these trees survived past conditions that are now rapidly changing."
        },
        {
            "text": "As global temperatures rise, rainfall patterns shift and extreme weather events become more frequent. The environments that shaped today’s veteran trees are evolving. The traits which helped these trees survive in the past may not equip their offspring to thrive in the future."
        },
        {
            "text": "To address this, seed for today’s forests is also sourced from more southerly latitudes, where trees have already adapted to warmer conditions and drought stress. This practice, known as assisted migration, mimics natural migration processes but at a faster rate."
        },
        {
            "text": "Rather than choosing between local or non-local seed sources, it is useful to take a combined approach at the landscape level. By using seeds from both local trees and climate-adapted populations from other regions, we can hedge our bets against uncertainty and build forests that are genetically diverse and resilient."
        },
        {
            "heading": 2,
            "text": "Sourcing seeds for future forest resilience"
        },
        {
            "text": "Ultimately, forest resilience depends on several factors. These factors range from how suitable tree species are to site conditions, the compatibility of tree mixes (trees that complement one another), structural diversity (having a mix of tree ages and heights), as well as the sustainable management of woodlands and forests."
        },
        {
            "text": "However, providing genetic diversity through thoughtful seed collection remains fundamental. Each seed collected and nurtured is a potential tree that will contribute to the ecological, social and economic value of our leafy landscapes for generations to come."
        }
    ]
}