{
    "url": "https://healthmedia.blog.gov.uk/2025/09/29/gp-contract-what-you-need-to-know/",
    "title": "GP Contract: What you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "GPs"
    ],
    "pub_date": "2025-09-29T12:38:42+01:00",
    "content": [
        {
            "text": "From Wednesday 1st October, every GP practice in England must keep their online booking open all day during working hours (8am-6:30pm) - no more closing these systems and forcing everyone onto jammed phone lines.  "
        },
        {
            "text": "This delivers on our manifesto promise to end the 8am scramble - patients can now contact their GP digitally whenever suits them during core hours, not just in that frantic morning rush.  "
        },
        {
            "text": "It's about choice and convenience - patients can still phone or walk in, but now they've also got the online option available all day. More people requesting bookings online means quieter phone lines for those who need to call.  "
        },
        {
            "text": "This is nothing new and the evidence shows it works - practices already doing this have seen dramatic improvements. One London surgery cut waiting times from 14 days down to just 3 days, with 95% of patients seen within a week.  "
        },
        {
            "heading": 3,
            "text": "Won’t this lead to GPs being overloaded with requests?"
        },
        {
            "text": "No. Many GPs have been offering this service, and now it will be provided to patients across the country. "
        },
        {
            "text": "Practices who weren’t already offering this service were given 6 months from when the contract was agreed to prepare for this change. Evidence shows that where GP practices have moved to this model, both staff and patients have reported a smoother workflow and a better service. "
        },
        {
            "text": "One London GP surgery which adopted this approach to online bookings reduced waits from 14 days to just 3 – with 95% of patients seen within a week. "
        },
        {
            "heading": 3,
            "text": "Will this lead to serious cases being missed?"
        },
        {
            "text": "No. This move will support GPs to care for their patients who need non-urgent care. "
        },
        {
            "text": "GP websites will feature clear instructions telling patients requiring urgent care to phone their GP or attend in person. "
        },
        {
            "text": "There are GP surgeries already successfully rolling out online appointment requests, showing it works for patients and practices.  "
        },
        {
            "text": "The BMA signed up to and agreed this policy with GPs, and we remain committed to wanting to work together to implement this as efficiently as possible.  "
        },
        {
            "heading": 3,
            "text": "Is this just more work for GPs with no new funding?"
        },
        {
            "text": "We’ve invested an extra £1.1 billion in general practice – the biggest cash increase in over a decade – and hired over 2,000 extra GPs across England. "
        },
        {
            "text": "The new requirement represents best practice which many GP practices across England have already adopted successfully.  "
        },
        {
            "text": "Of course we'll keep supporting practices throughout implementation, learning from the ones already doing it. "
        },
        {
            "heading": 3,
            "text": "Are you listening to the BMA’s concerns?"
        },
        {
            "text": "The BMA signed up to and agreed this policy with GPs, and we remain committed to working together to implement this as efficiently as possible.  "
        },
        {
            "heading": 3,
            "text": "What are you doing to support GPs?"
        },
        {
            "text": "Fixing the front door of the NHS is a priority for this government, and GPs are front and centre of our 10 Year Health Plan."
        },
        {
            "text": "We have recruited more than 2,300 extra GPs, delivered 8 million more GP appointments this year, and secured a funding boost of over £1 billion for GP practices."
        },
        {
            "text": "Thanks to this record support and the hard work of GPs, public satisfaction with GP services is finally on the rise."
        }
    ]
}