{
    "url": "https://valuationoffice.blog.gov.uk/2025/09/29/revaluation-2026-everything-you-need-to-know/",
    "title": "Revaluation 2026 – everything you need to know",
    "authors": [
        "voadigitalpublishing"
    ],
    "categories": [
        "Revaluation 2026"
    ],
    "pub_date": "2025-09-29T10:15:16+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "The Valuation Office Agency (VOA) is currently updating the values it holds for over 2 million business and other non-domestic properties across England and Wales. "
        },
        {
            "text": "These values are used to calculate business rates bills. "
        },
        {
            "text": "The future values come into effect in April 2026, but there are actions you can take now to be prepared. If you own a property that might be liable to pay business rates – here is everything you need to know about the 2026 Revaluation. "
        },
        {
            "text": "1. What is a revaluation? "
        },
        {
            "text": "The VOA updates the rateable values of non-domestic properties in England and Wales every three years. This is known as a revaluation. "
        },
        {
            "text": "Rateable values are the amount of rent a property could have been let for on a set valuation date. For the 2026 revaluation, that date is 1 April 2024.  "
        },
        {
            "text": "Rateable values are used by local councils to calculate business rate bills. Using this value as a basis, local councils will apply a standard percentage or ‘multiplier’ and details of any reliefs and discounts to give the amount to be paid.  "
        },
        {
            "text": "Revaluations make sure that these bills are based on up-to-date information. "
        },
        {
            "text": "A change in your rateable value does not always mean a change in your bill.  "
        },
        {
            "text": "We have published a video with more information about the process: What is a revaluation? "
        },
        {
            "text": "2. How can I access information about my business rates valuation? "
        },
        {
            "text": "You can view your property’s current rateable value through the Find a Business Rates Valuation service on GOV.UK.  "
        },
        {
            "text": "If you want to see more details about your current valuation, check the details we hold on your property or request a change, you will need a business rates valuation account. "
        },
        {
            "text": "Future rateable values for non-domestic properties, that come into effect on 1 April 2026, will be published before 31 December 2025. Once published, you will be able to see details about these valuations on your Business Rates Valuation Account, or through the Find a Business Rates Valuation Service on GOV.UK.  "
        },
        {
            "text": "We have published guidance on how to set up a business rates valuation account online and in our recent video: Business Rates Valuation Account registration "
        },
        {
            "text": "3. What to do if I think my valuation is wrong? "
        },
        {
            "text": "If you believe your current valuation isn’t correct, you can ask us to review it through your business rates valuation account. "
        },
        {
            "text": "First, you’ll need to complete what’s called a Check. This will allow you to correct or confirm factual details about the property. "
        },
        {
            "text": "If this doesn’t result in a change to your rateable value, you can decide to progress to what’s called a Challenge.  You’ll need to provide evidence to support your case. There’s more information about this on GOV.UK. Confirm your property details - GOV.UK "
        },
        {
            "text": "It’s important to note that your rateable value can go up as well as down as part of this process. "
        },
        {
            "text": "You have from now until 31 March 2026 to contact the VOA about your current rateable value. You can contact the VOA about your new rateable value from 1 April 2026. "
        },
        {
            "text": "You can find out more information on how to do this through other videos on our YouTube account. How to check if you think your business rates valuation is wrong "
        },
        {
            "text": "4. Choosing to work with a rating agent "
        },
        {
            "text": "You may want to appoint someone to deal with your business rates and the Valuation Office Agency (VOA) on your behalf. This is called your agent. "
        },
        {
            "text": "The vast majority of rating agents are reputable and provide a good service. But a small minority act in bad faith. "
        },
        {
            "text": "These rogue agents usually promise big reductions in business rates – but they do this by submitting inaccurate information. This could result in penalties or increased rates bills for you. "
        },
        {
            "text": "If you do decide to appoint a rating agent to manage your business rates on your behalf, you can access our checklist to help you choose. We’ve also published a video to explain how you should approach choosing a ratings agent on our YouTube channel: Choosing a business rates agent checklist. "
        },
        {
            "text": "5. How does the VOA value my property? "
        },
        {
            "text": "We use one of three methods, depending on the type of evidence available:  "
        },
        {
            "text": "A rateable value for a property may not be the same as the actual rent paid for the property. "
        },
        {
            "text": "We have more information about how we calculate the value of different properties on our blog (Valuation Office Agency – News and updates from the Valuation Office Agency) and on our YouTube channel (How we measure properties for business rates).  "
        },
        {
            "heading": 2,
            "text": "Ailbrisiad 2026 – popeth sydd angen i chi ei wybod "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Ar hyn o bryd mae Asiantaeth y Swyddfa Brisio (VOA) yn diweddaru’r gwerthoedd ardrethol y mae yn ei dal ar gyfer dros 2 filiwn eiddo busnes ac eiddo annomestig arall ledled Cymru a Lloegr. "
        },
        {
            "text": "Defnyddir y gwerthoedd ardrethol yma i gyfrifo biliau ardrethi busnes. "
        },
        {
            "text": "Daw’r gwerthoedd ardrethol diwygiedig i rym ym mis Ebrill 2026, ond mae camau y gallwch chi eu cymryd nawr i fod yn barod at hyn. Os ydych chi’n berchen ar eiddo a allai fod yn agored i ardrethi busnes – dyma bopeth sydd angen i chi ei wybod am Ailbrisiad 2026. "
        },
        {
            "text": "1. Beth yw ailbrisiad? "
        },
        {
            "text": "Mae’r VOA yn diweddaru gwerthoedd ardrethol eiddo annomestig yng Nghymru a Lloegr bob tair blynedd. Gelwir hyn yn ailbrisiad. "
        },
        {
            "text": "Gwerth ardrethol yw’r swm o rent y gellid bod wedi gosod eiddo amdano ar ddyddiad prisio penodol. Ar gyfer ailbrisiad 2026, y dyddiad hwnnw yw 1 Ebrill 2024. "
        },
        {
            "text": "Defnyddir gwerthoedd ardrethol gan gynghorau lleol i gyfrifo biliau ardrethi busnes. Gan ddefnyddio’r gwerth hwn fel sail, bydd cynghorau lleol yn cymhwyso canran safonol neu ‘luosydd’ ynghŷd â manylion unrhyw ryddhadau a gostyngiadau i bennu’r swm i’w dalu. "
        },
        {
            "text": "Mae ailbrisiad yn sicrhau bod y biliau hyn yn seiliedig ar wybodaeth gyfredol. "
        },
        {
            "text": "Nid yw newid yn eich gwerth ardrethol bob amser yn golygu newid yn eich bil. "
        },
        {
            "text": "Rydym wedi cyhoeddi fideo gyda mwy o wybodaeth am y broses: Beth yw ailbrisiad? "
        },
        {
            "text": "2. Sut alla i gael gwybodaeth am fy mhrisiad ardrethi busnes? "
        },
        {
            "text": "Gallwch weld gwerth ardrethol cyfredol eich eiddo drwy’r gwasanaeth Dod o hyd i brisiad ardrethi busnes ar GOV.UK. "
        },
        {
            "text": "Os ydych chi eisiau gweld mwy o fanylion am eich prisiad cyfredol, gwirio’r manylion sydd gennym ni ar eich eiddo, neu ofyn am newid, bydd angen cyfrif prisio ardrethi busnes arnoch. "
        },
        {
            "text": "Bydd gwerthoedd ardrethol ar gyfer eiddo annomestig yn y dyfodol, sy’n dod i rym ar 1 Ebrill 2026, yn cael eu cyhoeddi cyn 31 Rhagfyr 2025. Unwaith y byddant wedi’u cyhoeddi, byddwch chi’n gallu gweld manylion am y prisiadau hyn ar eich Cyfrif Prisio Ardrethi Busnes, neu drwy’r gwasanaeth Dod o hyd i brisiad ardrethi busnes ar GOV.UK. "
        },
        {
            "text": "Rydym wedi cyhoeddi canllawiau ar sut i sefydlu cyfrif prisiad ardrethi busnes ar-lein ac yn ein fideo diweddar: Cofrestru am Gyfrif Prisiad Ardrethi Busnes "
        },
        {
            "text": "3. Beth ddylwn ei wneud os ydw i’n meddwl bod fy mhrisiad yn anghywir? "
        },
        {
            "text": "Os ydych chi’n meddwl nad yw eich prisiad cyfredol yn gywir, gallwch ofyn i ni ei adolygu drwy eich cyfrif prisio ardrethi busnes. "
        },
        {
            "text": "Yn gyntaf, bydd angen i chi gwblhau’r hyn a elwir yn achos Gwirio. Bydd hyn yn caniatáu ichi gywiro neu gadarnhau manylion ffeithiol am yr eiddo. "
        },
        {
            "text": "Os nad yw hyn yn arwain at newid i’ch gwerth ardrethol, gallwch benderfynu symud ymlaen i’r hyn a elwir yn achos Herio. Bydd angen i chi ddarparu tystiolaeth i gefnogi eich achos. Mae rhagor o wybodaeth am hyn ar GOV.UK. Cadarnhau manylion eich eiddo - GOV.UK "
        },
        {
            "text": "Mae’n bwysig nodi y gall eich gwerth ardrethol godi yn ogystal â gostwng fel rhan o’r broses hon. "
        },
        {
            "text": "Mae gennych chi o nawr tan 31 Mawrth 2026 i gysylltu â’r VOA ynghylch eich gwerth ardrethol cyfredol. Gallwch gysylltu â’r VOA ynghylch eich gwerth ardrethol newydd o 1 Ebrill 2026. "
        },
        {
            "text": "Gallwch ddod o hyd i ragor o wybodaeth am sut i wneud hyn drwy fideos eraill ar ein cyfrif YouTube. Sut i wirio os ydych chi’n meddwl bod eich prisiad ardrethi busnes yn anghywir "
        },
        {
            "text": "4. Dewis gweithio gydag asiant ardrethu "
        },
        {
            "text": "Efallai yr hoffech benodi rhywun i ddelio â’ch ardrethi busnes ac Asiantaeth y Swyddfa Brisio (VOA) ar eich rhan. Gelwir hyn eich asiant.  "
        },
        {
            "text": "Mae gan y mwyafrif helaeth o asiantiaid ardrethu enw da ac yn darparu gwasanaeth da. Ond mae lleiafrif bach yn gweithredu’n anonest. "
        },
        {
            "text": "Fel arfer, mae asiantiaid amheus yn addo gostyngiadau mawr mewn ardrethi busnes - ond maent yn gwneud hyn trwy gyflwyno gwybodaeth anghywir. Gallai hyn arwain at gosbau neu filiau ardrethi uwch i chi. "
        },
        {
            "text": "Os ydych yn penderfynu i benodi asiant ardrethu i reoli eich ardrethi busnes ar eich rhan, gallwch gael mynediad at ein rhestr wirio i’ch helpu i ddewis. Rydym hefyd wedi cyhoeddi fideo i esbonio sut y dylech fynd ati i ddewis asiant ardrethu ar ein sianel YouTube: Rhestr wirio ar gyfer dewis asiant ardrethi busnes "
        },
        {
            "text": "5. Sut mae’r VOA yn prisio fy eiddo? "
        },
        {
            "text": "Rydym yn defnyddio un o dri dull, yn dibynnu ar y math o dystiolaeth sydd ar gael: "
        },
        {
            "text": "Efallai na fydd gwerth ardrethol ar gyfer eiddo yr un fath â’r rhent gwirioneddol a delir am yr eiddo. "
        },
        {
            "text": "Mae gennym ragor o wybodaeth am sut rydym yn cyfrifo prisiad gwahanol eiddo ar ein blog (Asiantaeth y Swyddfa Brisio – Newyddion a diweddariadau gan yr Asiantaeth y Swyddfa Brisio) ac ar ein sianel YouTube (Sut rydym yn mesur eiddo ar gyfer ardrethi busnes). "
        }
    ]
}