{
    "url": "https://naturalengland.blog.gov.uk/2025/09/29/wildfires-natures-role-in-resisting-the-spark/",
    "title": "Wildfires: Nature’s role in resisting the spark",
    "authors": [
        "Prof Sallie Bailey"
    ],
    "categories": [
        "Biodiversity",
        "Countryside Code",
        "Landscape",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Wildfire"
    ],
    "pub_date": "2025-09-29T11:13:57+01:00",
    "content": [
        {
            "text": "By Sallie Bailey, Natural England’s Chief Scientist"
        },
        {
            "text": "This year we have witnessed wildfires ravaging England’s uplands and heaths on a historic scale, with prolonged hot and dry weather providing the ideal conditions for blazes lasting weeks."
        },
        {
            "text": "These disasters for both people and wildlife graphically demonstrate the way in which climate change and nature loss fuel each other. But they can also give us clues as to how restoring nature can help to reduce the risk of wildfires and to guard against a warming planet. And the strengthening of legislation on moorland burning, which takes effect tomorrow (30 September), can give valuable momentum to the restoration of England’s peatlands."
        },
        {
            "text": "Getting hotter"
        },
        {
            "text": "In the UK the term “wildfire” means any uncontrolled blaze on vegetation that needs action to put out. Virtually all wildfires in this country are caused by human activity, from the careless (e.g. negligent use of barbecues or burning of rubbish) to the deliberate (e.g. arson), not to mention the inadvertent such as equipment faults and “managed fires” (heather/grass burning for land management purposes) that escape control."
        },
        {
            "text": "Climate change is heightening the risk of wildfires, creating hot, dry conditions where one spark or piece of broken glass could lead to destruction and distress for wildlife and people across vast tracts of the country."
        },
        {
            "text": "It is no coincidence that the driest Spring for more than a century, followed by the hottest ever Summer, have seen 2025 smash an unwelcome record for the highest amount of land claimed by wildfire in a single year in the UK. Alarmingly, it reached that mark as early as April and by August the figure of 40,000 hectares burned was 50 per cent higher than the previous record of 2019. With the long-running drought likely to continue through Autumn and be extended to new areas, as outlined by the National Drought Group earlier this month, that total could yet rise significantly."
        },
        {
            "text": "According to a study by the Met Office, the Centre for Ecology & Hydrology and the University of Exeter, the damaging fires during the 40C Summer of 2022 were made at least six times more likely by human-induced climate change. Also in 2022, scientists for UNEP predicted that extreme fires would be 50 per cent more likely by the end of this century without significant actions on emissions."
        },
        {
            "text": "This terrifying trend spells disaster for the health of the world’s population, who can be fatally affected by fires thousands of miles away. Pollution from the Canadian wildfires in 2023, for example, led to an estimated 41,900 premature deaths in North America and a further 22,400 across the Atlantic in Europe."
        },
        {
            "text": "There are dire consequences for businesses, economies and consumers too. Wildfires during the Summer of 2018 cost UK farms approximately £32 million in total, pushing up food prices for everyone in the process."
        },
        {
            "text": "Nature is also affected, with 83 of England’s Sites of Special Scientific Interest reporting fires so far this year, including Dartmoor and the North York Moors, on which more than 3,000 hectares were burnt."
        },
        {
            "text": "Sadly, this merely fuels an ever-worsening cycle as extensive fires on peatland cause carbon to be released into the atmosphere, spurring on a changing climate which in turn increases the likelihood of conditions for wildfires."
        },
        {
            "text": "Nature is our ally"
        },
        {
            "text": "Fortunately, we do have an ally which can help us not only reduce the threat of wildfires but also tackle the climate change which makes them more likely and more damaging."
        },
        {
            "text": "Recovering nature, by creating healthy and resilient landscapes, is our best tool against heightened wildfire risk. The evidence-based view of Natural England, the Government’s statutory adviser for the natural environment, is that restoring habitat condition, for example through re-wetting peat previously damaged by drainage and other activities such as repeated burning and overgrazing, will reduce both the risk and severity of future wildfires over the long term. Other habitats, such as drier heath complexes, will require a different approach to nature recovery."
        },
        {
            "text": "Having a mosaic of healthy habitats across landscapes can help to reduce the likelihood of fires rapidly spreading across areas dominated by single species, such as heather which contains flammable oils. Preferring drier conditions, heather’s dominance on UK moorlands is largely down to the use of fire for management and comes at the expense of vegetation capable of forming peat. We recognise the importance of this habitat to upland communities, both economically and culturally, but more natural conditions along with sustainable management of heather would allow other plant species to take their place alongside heather."
        },
        {
            "text": "We are working with landowners, backed by funding such as the Environmental Land Management schemes, to ensure measures to restore habitats are appropriate for local conditions: wetness (e.g. Sphagnum moss layers in a bog), coarseness (e.g. mature broadleaved trees) and structural variety (e.g. grasslands with varied sward heights) all can increase resilience to wildfire spread."
        },
        {
            "text": "Nature restoration has helped to reduce the impacts of a number of recent fires. In 2023, after a significant period of drought, Marsden Moor in West Yorkshire suffered seven wildfires over a tenth of the 2000-hectare estate. While drier areas continued to smoulder, restored wet areas with Sphagnum mosses acted as firebreaks to limit the spread of the fire."
        },
        {
            "text": "A few miles away in Dove Stone Nature Reserve outside Oldham, a wildfire started in 2018 on neighbouring dry, heather-dominated land before spreading onto the reserve. The more diverse, damp vegetation slowed the fire down enough for it to be stopped by a moss-filled gully located on United Utilities/RSPB land. Although the fire wouldn’t have died out completely by itself, the change from dry peat to the wetter Sphagnum-dominated gullies of Dove Stone meant that the height and heat of the flames reduced sufficiently for human action to bring it under control."
        },
        {
            "text": "Multiple benefits"
        },
        {
            "text": "Not only does this type of nature restoration help to combat the threat of fires, it brings a host of other benefits too. The soil holds carbon underground instead of releasing it into the atmosphere where it contributes to climate change. At the same time it retains water, improving water quality while mitigating the impacts of droughts and floods – all with positive advantages for businesses and the bills and insurance premiums their customers pay. In addition, the landscape provides more habitat for wildlife and more places for people to visit and enhance their mental and physical health."
        },
        {
            "text": "Bearing in mind the searching targets currently lying ahead of us, not least to halt species decline by 2030 and to restore (or have under restoration) 280,000 hectares of peatland by 2050, nature recovery is the answer to many of our most pressing challenges."
        },
        {
            "text": "Government leadership in this area is crucial and is demonstrated earlier by tomorrow’s extension to the ban on burning of deep peat from 40cm to 30cm across all of the English uplands. This legislation will triple the area covered, meaning 676,628 hectares – equivalent to the size of Devon – will now be protected from harmful unlicensed burning and given the chance for nature to thrive. Nature recovery is a long-term solution to fires, but landowners can still manage risk in the short term through burning in certain circumstances under the legislation, provided they obtain a licence from Defra. While the current drought continues there are steps everyone can take to help reduce the risk of wildfires, outlined in this blog post  and in the Countryside Code. In the longer term, I hope that the collaborative efforts being made towards nature recovery mean that this year’s UK wildfire record is one that will never be beaten."
        }
    ]
}