{
    "url": "https://moderncivilservice.blog.gov.uk/2023/11/05/a-skilled-civil-service-reforming-the-fast-stream/",
    "title": "A Skilled Civil Service: Reforming the Fast Stream",
    "authors": [
        "Modernisation and Reform Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Skilled",
        "Skilled Civil Service"
    ],
    "pub_date": "2023-11-05T12:26:22+00:00",
    "content": [
        {
            "text": "The Fast Stream has long been the Civil Service’s flagship emerging talent development programme. It rivals the best graduate programmes in the UK, currently sitting in the number two spot of the Times Top 100 Graduate Employers. Every year around 1,000 new recruits are welcomed onto the Fast Stream where they are enabled and empowered to build the skills, knowledge and networks needed to thrive as effective leaders, managers and civil servants. "
        },
        {
            "text": "Offering access to roles in almost every government department and across 15 specialist schemes, the Fast Stream opens up a huge range of opportunities for graduates and existing civil servants. It accelerates careers, developing talented, high-potential people to become the leaders and managers of tomorrow. Most importantly, the work they do supports the government to implement its policies effectively, on behalf of communities across the UK. "
        },
        {
            "text": "So, when the Civil Service already has a globally recognised programme, why change things?"
        },
        {
            "heading": 2,
            "text": "The approach to reform"
        },
        {
            "text": "In 2020, the Fast Stream and Emerging Talent (FSET) team, in the Cabinet Office, started a review of the programme, with a focus on principles of effectiveness, efficiency and relevance. The Declaration on Government Reform (2021) acknowledged the Fast Stream to be “among the best graduate programmes in the world”, it also set the challenge to ensure we were “attracting talent from the widest range of disciplines and locations.”"
        },
        {
            "text": "The reform of the Fast Stream is vital to ensure it is reflective of both current and future strategic workforce requirements, is equipping future leaders and managers with the skills and knowledge to adapt and deliver in a changing world, and enables the government to deliver better outcomes for citizens."
        },
        {
            "text": "FSET consulted widely: across departments and professions, with current fast streamers and alumni, with external talent providers and with colleagues across the Civil Service delivering other talent programmes."
        },
        {
            "text": "They reviewed all elements of the Fast Stream: the attraction and selection methods, the operational delivery model, the training and development offer, all the way through to the on-scheme assessment approach and the alumni offer. "
        },
        {
            "text": "This was done while considering the role the Fast Stream can play in relation to wider government priorities: Modernisation and Reform, Places for Growth, and growing Science, Technology, Engineering and Mathematics (STEM) skills in the Civil Service, to name but a few."
        },
        {
            "heading": 2,
            "text": "Fast Stream reform: from design to delivery"
        },
        {
            "text": "FSET are now poised to deliver on the reform ambitions. These include:"
        },
        {
            "text": "Alex Edmundson, Deputy Director for FSET says “We are fiercely proud of our existing Fast Stream programme, and were delighted to recently welcome the incoming 2023 cohort. But we can never rest on our laurels and reputation, and through realising our ambitions for Fast Stream reform we are confident that the Civil Service Fast Stream will continue to attract and develop brilliant people, with huge potential, from all backgrounds and truly be a place to grow like nowhere else.”"
        }
    ]
}