{
    "url": "https://educationhub.blog.gov.uk/2023/11/how-were-protecting-jewish-students-on-university-campuses/",
    "title": "How we’re protecting Jewish students on university campuses",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2023-11-05T14:46:16+00:00",
    "content": [
        {
            "text": "The unfolding tragedy in the Middle East is having devastating consequences. Israel suffered the worst terror attack in its history, and Palestinian civilians in Gaza are experiencing a growing humanitarian crisis."
        },
        {
            "text": "Following the attacks by Hamas on 7 October in Israel, Ministers wrote to university leaders to remind them that they should act swiftly against any threats to Jewish students’ safety and welfare and reminded them that support for Hamas, a proscribed terrorist organisation, is a criminal act."
        },
        {
            "text": "The letter also reiterated university leaders’ obligations under the UK’s Prevent counter-extremism programme."
        },
        {
            "text": "Discrimination of any kind, including antisemitism, will not be tolerated on university campuses. It is vital that all students feel safe and secure while they learn."
        },
        {
            "text": "We have also written to schools and colleges to set out how teachers should respond sensitively to the Israel-Hamas conflict in the classroom."
        },
        {
            "text": "In addition, the Prime Minister has announced an extra £3 million to protect Jewish community sites, such as schools, synagogues, and community buildings on campus."
        },
        {
            "heading": 3,
            "text": "What else are you doing to protect Jewish students from antisemitism?"
        },
        {
            "text": "We take antisemitism in our universities seriously. Writing to universities was an important first step, and we’ve now set out the action that we and university leaders should take to strengthen our support for Jewish students."
        },
        {
            "text": "Our five-point plan sets out that we will:"
        },
        {
            "text": "1. Call for visas to be withdrawn from international students who incite racial hatred."
        },
        {
            "text": "Studying in the UK is a privilege, not an entitlement. Any foreign national with a student visa who incites racial hatred and violence can have their visa revoked, and they may be expelled from the country."
        },
        {
            "text": "2. Write to Vice Chancellors asking that they act decisively against staff and students involved in antisemitism."
        },
        {
            "text": "We will write again to universities to underline that they should take immediate disciplinary action if any student is found to be inciting racial hatred or violence."
        },
        {
            "text": "This could lead universities to suspend the student while an investigation is ongoing."
        },
        {
            "text": "If a student is suspended by the university, their fees and maintenance payments from the Student Loan Company could also be suspended."
        },
        {
            "text": "3. Meet the Office for Students (OfS), the independent regulator for higher education, to discuss its role in reviewing incidents and any potential action."
        },
        {
            "text": "The Education Secretary will request an urgent meeting with the OfS to discuss their role in reviewing serious incidents reported by universities and whether potential regulatory action is needed."
        },
        {
            "text": "4. Make it clear in all discussions that acts that may be criminal should be referred to the police."
        },
        {
            "text": "It’s critical that when a university believes a criminal act has been committed, they should refer it to the police. The police and Crown Prosecution Service will then decide whether an arrest is appropriate, based on the available facts."
        },
        {
            "text": "5. Explore establishing an antisemitism charter in Higher Education, signing up universities which demonstrate a commitment to tackling antisemitism."
        },
        {
            "text": "This charter would sign-up universities that demonstrate an active commitment to tackling antisemitism with practical steps that support Jewish students and staff, like adopting the IHRA definition of antisemitism, which most universities have already done."
        },
        {
            "text": "This would aim to encourage more universities to strengthen their standards for inclusion, wellbeing and security."
        },
        {
            "heading": 3,
            "text": "How are you protecting free speech on campus?"
        },
        {
            "text": "Creating an atmosphere of tolerance and openness goes hand in hand with protecting freedom of speech. We’re committed to protecting freedom of speech on campus, which is why we introduced the Higher Education (Freedom of Speech) Act earlier this year to put more responsibility on universities to ensure students are able to speak freely in and out of the classroom."
        },
        {
            "text": "Importantly, though, the Act only covers speech that is within the law. The right to freedom of speech is not an absolute right and it does not include the right to harass others or incite them to violence or terrorism."
        },
        {
            "text": "It does not mean creating an atmosphere where students fear expressing or showing their religion in public. The promotion of conflict and glorification of terrorism will never be tolerated."
        },
        {
            "text": "This means that while students should be able to express concern about the humanitarian impact of the conflict in both Gaza and Israel, targeted harassment of Jewish students or support for Hamas is absolutely unacceptable."
        },
        {
            "heading": 3,
            "text": "What other support is available?"
        },
        {
            "text": "The Community Security Trust has published several educational resources, including those that support understanding and identifying antisemitism. Separately, for anyone in the UK who feels impacted by the ongoing conflict, Victim Support is available online on 0808 168 9111. It's free and available 24/7."
        },
        {
            "text": "This also goes for supporting British Muslim communities against islamophobia. The Government has been in regular contact with Tell MAMA, a service that provides support to victims of anti-Muslim hatred, and we are aware that they are recording an increased number of reports of anti-Muslim hatred."
        },
        {
            "text": "The Prime Minister has also made clear the Government stands with British Muslim communities and will not tolerate Anti-Muslim hatred in any form and seeks to stamp it out wherever it occurs."
        },
        {
            "text": "Find out more"
        }
    ]
}