{
    "url": "https://defrafarming.blog.gov.uk/2024/01/25/apply-for-an-improving-farm-productivity-grant/",
    "title": "Apply for an Improving Farm Productivity grant",
    "authors": [
        "Izzie Wells"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2024-01-25T11:13:06+00:00",
    "content": [
        {
            "text": "I’m pleased to say that you can now apply for an Improving Farm Productivity grant.  "
        },
        {
            "text": "Last month, we published the guidance for the grant on GOV.UK as we wanted to give you time to plan and consider your options before the checker (the first step to apply) launched. "
        },
        {
            "text": "The guidance explains what the Improving Farm Productivity grant is for, who is eligible and the process to apply."
        },
        {
            "text": "In this post, I'll explain some additional changes we've made to the offer, give you a recap of other aspects of the grant and the links you'll need to get started. "
        },
        {
            "heading": 2,
            "text": "Update to the robotics and automation offer "
        },
        {
            "text": "Since my last post on 12 December, we decided to increase the proportion of the costs that the grant will cover from 40% to 50% for robotic and automated equipment. "
        },
        {
            "text": "This means that the grant will pay for a greater proportion of the total project cost than under Round 1. "
        },
        {
            "text": "The offer for solar equipment will remain the same at 25%. "
        },
        {
            "text": "The guidance has been updated to reflect this change, please take the time to familiarise yourself with this before you apply. "
        },
        {
            "heading": 2,
            "text": "Grant overview"
        },
        {
            "text": "This is the second time we've offered this grant, with the first round opening in January 2022. "
        },
        {
            "text": "Part of the Farming Investment Fund, the Improving Farm Productivity grant is open to farmers, growers and related contractors. It will pay for capital items to improve farm and horticulture productivity through: "
        },
        {
            "text": "For robotic and automated equipment, the minimum grant available is £25,000 and the maximum grant available is £500,000. The grant will now cover up to 50% of the cost.  "
        },
        {
            "text": "For solar equipment, the minimum grant available is £15,000 and the maximum grant available is £100,000. The grant will cover up to 25% of the cost. "
        },
        {
            "text": "You can apply for both automated and robotic equipment and solar equipment, however your maximum grant amount still cannot exceed £500,000 in total for both applications together. "
        },
        {
            "text": "The grant is open to horticultural and farm businesses. Contractors from those sectors are eligible to apply for grants towards the purchase of robotic and automated equipment, but not solar equipment. "
        },
        {
            "heading": 2,
            "text": "How to apply  "
        },
        {
            "text": "As was the case in the first round, there is a 2-step application process for this round.    "
        },
        {
            "text": "Start by reading the Improving Farm Productivity grant guidance (Round 2) on GOV.UK."
        },
        {
            "heading": 3,
            "text": "1. Online checker "
        },
        {
            "text": "The process starts with an online eligibility checker. You'll find it in the 'How to apply' section of the guidance. "
        },
        {
            "text": "The checker is designed to determine your eligibility and whether your project fits the funding priorities. It has two separate journeys: one for robotic and automated equipment and another for solar equipment.  "
        },
        {
            "text": "You will be asked various questions on the type of equipment you wish to fund, whether it be robotic or automated, or solar equipment. "
        },
        {
            "text": "It will take roughly 20 minutes to complete and you will learn the outcome instantly.  Depending on the outcome of the checker, you will be invited to make a full application.  "
        },
        {
            "text": "The checker is now live, and it will remain open for 8 weeks.  "
        },
        {
            "text": "This means the deadline to use the checker is 21 March at 23:59."
        },
        {
            "heading": 3,
            "text": "2. Full application"
        },
        {
            "text": "Those invited to make a full application have until 30 June 2025 to do so. "
        },
        {
            "text": "Before you submit your full application, depending on the nature of your project, you may need to secure planning permission. "
        },
        {
            "heading": 2,
            "text": "Join our webinars"
        },
        {
            "text": "We’ll share links to the recordings on the blog once they’re over.  "
        },
        {
            "text": "If you have any questions about the grant or process to apply after reading the guidance, leave a comment below."
        },
        {
            "text": "You might be interested to read the comments on my last post as a number of you put questions to me there."
        }
    ]
}