{
    "url": "https://mhclgmedia.blog.gov.uk/2024/01/25/coverage-of-additional-local-government-funding-announcement/",
    "title": "Coverage of additional local government funding announcement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2024-01-25T11:56:59+00:00",
    "content": [
        {
            "text": "There is widespread reporting of the additional local government funding announcement, proactively briefed by press office yesterday. The Financial Times, The Telegraph, The Times, Independent, Evening Standard, PA, The Sun, Daily Mail, BBC, The Guardian, Politico and many regional outlets report on the additional £500 million for social care and the uplift in funding for English councils from 3 to 4 per cent, as part of the £600 million overall for English councils on top of what was announced in December."
        },
        {
            "text": "The coverage notes the Secretary of State’s comments that the £600 million “illustrates our commitment to local government” and features supportive quotes from the Local Government Association, County Councils Network and the District Councils Network welcoming the funding."
        },
        {
            "text": "The government values the important contribution councils make and has conducted an extensive engagement and listening programme with councils to understand the pressures they are facing including high inflation, driven by the legacy of Covid, and global instability with war in Ukraine and the Middle East."
        },
        {
            "text": "The support package will primarily see an additional £500 million added to the Social Care Grant to bolster social care budgets, a key concern raised by councils. The further £100 million comprises of an increase to the Funding Guarantee from 3% to 4%, £15 million for the Rural Services Delivery Grant, £3 million for authorities with Internal Drainage Boards, and additional funding for the Isle of Wight and the Isles of Scilly with the remainder distributed through the Services Grant."
        },
        {
            "text": "This funding builds on the £64 billion package already announced at the provisional Local Government Finance Settlement for 2024-25."
        },
        {
            "text": "Levelling Up Secretary Michael Gove said:"
        },
        {
            "text": "Minister for Local Government Simon Hoare added:"
        }
    ]
}