{
    "url": "https://educationhub.blog.gov.uk/2024/01/how-we-are-supporting-students-with-their-living-costs/",
    "title": "How we are supporting students with their living costs",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education"
    ],
    "pub_date": "2024-01-25T11:30:27+00:00",
    "content": [
        {
            "text": "We know that many students are facing increased living costs and that is why we’ve made sure support is available through universities."
        },
        {
            "text": "Here is everything you need to know about what support is available to help students meet everyday costs while completing their studies."
        },
        {
            "heading": 3,
            "text": "What support is available?"
        },
        {
            "text": "Universities are responsible for ensuring students who need help get the support they need, including through their own hardship funds, or through bursaries and scholarships."
        },
        {
            "text": "To support universities the government is providing £286 million this academic year, through the student premium fund to the Office for Students (OfS), which they can draw from to boost their own hardship funds."
        },
        {
            "text": "We have also increased loans and grants to support undergraduate and postgraduate students with living and other costs by 2.5% percent for the 2024/25 academic year."
        },
        {
            "text": "For the seventh year in a row, we have also frozen tuition fees for a full-time undergraduate course at a maximum of £9,250 which will reduce the initial amount of debt students will take on."
        },
        {
            "heading": 3,
            "text": "I’m a student in need of support – what should I do?"
        },
        {
            "text": "If you are a student and worried about your circumstances should speak to your university. If you are not sure where to get help, your university should have a student support service or a students’ union who can direct you to the correct team."
        },
        {
            "text": "Many universities have stepped up their efforts this year, providing support where it is needed and offering innovative schemes to help their students."
        },
        {
            "text": "For example:"
        },
        {
            "text": "These are just a few of the examples of universities supporting students in need, so if you are struggling, please do get in touch with your university to find out what support they can offer you."
        }
    ]
}