{
    "url": "https://openpolicy.blog.gov.uk/2024/01/25/introducing-regbox-using-serious-games-in-regulatory-development/",
    "title": "Introducing RegBox: using serious games in regulatory development",
    "authors": [
        "Sanjan Sabherwal",
        "Nina Cutler",
        "Suzie McMurtry"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-01-25T13:09:45+01:00",
    "content": [
        {
            "text": "Today Policy Lab is introducing RegBox – a toolkit enabling policymakers to convene stakeholders and work together to make decisions affecting regulation, using serious games. The toolkit will consist of game patterns for different use cases, a collection of case studies, guidance, and a set of tools to help policymakers to decide which approach to take. Work on RegBox is still in progress but in the spirit of being open and iterative we wanted to share and communicate it early. Our overarching challenge question is:  "
        },
        {
            "heading": 3,
            "text": "How can we provide engaging and participatory tools that help policymakers to develop and test regulations and make effective decisions? "
        },
        {
            "text": "This investigation, supported by the Policy Profession Unit, has given us time to research an opportunity that we think could add value to policy making practice, the application of serious games in regulatory development across central government and regulatory authorities.  "
        },
        {
            "text": "Policy Lab has worked on a range of projects that intersect with regulation and we’ve noticed a growing demand for more anticipatory and participatory approaches in this area. Regulators are having to respond to emerging technologies which are disrupting markets and posing new risks to individuals and institutions. Additionally, the government has just launched the Smarter Regulation programme, which is encouraging officials to use regulations only where necessary, and ensure their use is proportionate and future-proof. Because a change in regulation can have significant effects on businesses, organisations, and individuals it is important to understand the potential effects before deciding. We hypothesise that serious games can be used to understand regulatory challenges and stress-test solutions at pace.  "
        },
        {
            "heading": 3,
            "text": "Why serious games? "
        },
        {
            "text": "Over the past five years, Policy Lab has gravitated towards using serious games in several regulatory projects because the approach lends itself to developing and testing rules in participatory ways.  "
        },
        {
            "text": "Games have rules and mechanisms that govern how players interact with each other. Policies are rules that shape the behaviour of businesses, organisations, and people. Therefore, we can use games to model different rules and understand the resulting changes in behaviour. This is why we identified serious games as one of our 11 experimental methods which could have a high potential for next practice in policy making.  "
        },
        {
            "text": "Across several projects, we’ve observed that serious games can help by: "
        },
        {
            "text": "Many of these benefits can occur simultaneously when using a serious game in policy development. The serious games we’ve created so far have been a part of wider projects, mainly used in co-design workshops as research tools. Here are three examples to illustrate the applications and benefits listed above: "
        },
        {
            "text": "Interestingly the MCA modified the game we provided, enabling it to continue designing regulations in participatory ways. In autumn 2023 the MCA delivered a session at the International Maritime Organization attended by international regulatory experts focusing on technological innovation, alternative fuels, and inspection best practice.  "
        },
        {
            "heading": 3,
            "text": "Capability building  "
        },
        {
            "text": "Policy Lab wants to enable regulators to follow the MCA's example, by sharing our experience and tools for developing serious games in a policy context.  "
        },
        {
            "text": "Our hypothesis is that by codifying game patterns for different use cases and by providing accessible guidance we can support more regulators grappling with knotty challenges to take a participatory approach.  "
        },
        {
            "heading": 3,
            "text": "Get involved! "
        },
        {
            "text": "We believe the best way to increase the adoption of serious games in regulatory development is to connect with innovative practitioners inside and outside of government. This will help to inform the development of tools, build an evidence base to demonstrate impact and hopefully find opportunities to test and learn. If you are interested, you can engage with RegBox by:  "
        }
    ]
}