{
    "url": "https://insidehmcts.blog.gov.uk/2024/01/25/looking-at-the-future-of-remote-hearings/",
    "title": "Looking at the future of remote hearings",
    "authors": [
        "Claire Jukes, Senior Service Manager"
    ],
    "categories": [
        "Court and tribunal reform",
        "Digital services"
    ],
    "pub_date": "2024-01-25T13:35:45+00:00",
    "content": [
        {
            "text": "We were exploring the potential to increase the use of remote hearings long before the pandemic, but the impacts of COVID-19 demonstrated why building flexibility and resilience into the justice system is so important."
        },
        {
            "text": "To ensure justice continued, we quickly rolled out Cloud Video Platform (CVP) and it’s still being used by courts and tribunals in England and Wales today. As an “off the shelf” service it’s met our needs so far, but longer term we need to cater for the specific requirements of a court or tribunal hearing. That’s where the Video Hearings Service comes in."
        },
        {
            "text": "Our vision – that we’re already working towards - is to provide a service that’s flexible and improves access to justice for all court users."
        },
        {
            "text": "The Video Hearings Service has been designed in partnership with judges, justice partners and other stakeholders to reflect the formality of a court hearing. It’s important that people attending remote hearings treat them with the same seriousness as a hearing in a court or tribunal building whilst benefitting from the improved convenience and reduced costs."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Remote hearings that are fit for the future"
        },
        {
            "text": "The Video Hearings Service is specifically designed to meet the needs of judges, court professionals and members of the public. This includes providing simultaneous interpretation which allows participants and their interpreters to hear each other in the hearing and in a virtual meeting room, allowing interpretation to proceed without disrupting the hearing."
        },
        {
            "text": "We also have specialist technical support based in our service centres to ensure hearings go ahead without delay."
        },
        {
            "text": "The service also brings a range of other benefits including:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Changing how you prepare for hearings"
        },
        {
            "text": "The Video Hearings Service is already being used in the civil and family jurisdiction in a small number of courts and by tribunals including the Property, Tax, Employment and Immigration Chambers, so you may have attended a hearing on the service already. We’re also testing the service in Chester Crown Court to explore how it’ll support the specific processes and requirements of criminal hearings."
        },
        {
            "text": "We’re planning to roll out the service nationally from Autumn 2024. If you’ve not yet attended a hearing on the service, you’ll notice a few changes to the way your hearing is managed. For example:"
        },
        {
            "text": "User accounts also give access to pre-court consultations enabling private discussions to take place. They ensure people can only access the hearings relevant to them balancing security with convenience."
        },
        {
            "text": "Given the differences to CVP, participants are sent letters in advance, which provide important information and instructions to ensure the hearing runs smoothly. We encourage participants to read this letter carefully to avoid delays in joining and always ask people to join the hearing up to 30 minutes before it’s due to begin, to allow plenty of time to check equipment or contact us for any assistance."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "Developing a service of this magnitude is a huge undertaking. We’re in ongoing talks with stakeholders from the third sector, professional court user associations and of course, the judiciary, to make sure it meets the needs of participants attending a hearing remotely."
        },
        {
            "text": "You can hear more about how we’re making remote hearings accessible for neurodiverse people in our recent podcast."
        },
        {
            "text": "Information about attending a hearing on the Video Hearings Service is available on GOV.UK. If you’ve used the service and have feedback for us, or if you’d like to find out more about the service, please contact us at video-hearings@justice.gov.uk."
        }
    ]
}