{
    "url": "https://moderncivilservice.blog.gov.uk/2024/01/25/one-big-thing-2023-putting-the-big-in-big-data/",
    "title": "One Big Thing 2023: putting the ‘big’ in big data!",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-01-25T16:30:25+00:00",
    "content": [
        {
            "text": "The Civil Service launched One Big Thing on 4 September 2023, as a new annual initiative for civil servants to take shared action each year around a reform priority.  Our theme for 2023 was data skills and we committed to give everyone a chance to improve their skills and knowledge about data, wherever they worked. After four successful months One Big Thing has delivered a whopping 703,000 hours of data learning to 212,000 people. Over 182,000 core One Big Thing e-learning courses were completed on Civil Service Learning."
        },
        {
            "heading": 2,
            "text": "Why data matters"
        },
        {
            "text": "The Digital and Data mission was launched in July 2023 as part of Government Reform Phase 2 and aims for the Civil Service to harness the power of digital and data to make better decisions, improve service delivery and enhance user experience. It’s a key element of government reform and a major part of our vision for A Modern Civil Service."
        },
        {
            "text": "Over a four month period, hundreds of thousands of civil servants across the country dived into learning about data skills through One Big Thing; whether through our online learning platform, through on-the-job learning and implementing new ways of working, team discussions, at events such as Civil Service Live Online in Newport, or the One Big Conference, a hands-on technical upskilling event in London or through the excellent bespoke learning offers  in departments.  Data gurus from all areas of the Civil Service — including the Office for National Statistics (ONS), the Government Digital Service, the 10 Downing Street Data Science Team, and the Central Digital and Data Office (CDDO) —  shared their skills with colleagues and encouraged everyone to get to grips with data to improve their work."
        },
        {
            "text": "This was a huge collective effort to organise and communicate across the Civil Service, supported by leaders and delivery teams from all government departments along with the  Government Skills and Curriculum Unit, CDDO, ONS and I.AI to promote and run One Big Thing. "
        },
        {
            "heading": 3,
            "text": "Here are some highlights"
        },
        {
            "text": "On average — every 15 seconds of every working day since launch, one civil servant signed-up to learn about data. Wednesdays were the most popular days for sign ups. People from a massive 102 countries visited the One Big Thing Platform."
        },
        {
            "text": "The five ministerial departments with the highest percentage of sign-ups were Department for Work and Pensions (DWP), Department for Science, Innovation and Technology (DSIT), Home Office (HO), Department for Transport (DfT), and Cabinet Office (CO). The five ministerial departments with the highest completion rates of core e-learning were DWP, DfT, DSIT, HM Treasury (HMT), and HM Revenue and Customs (HMRC)."
        },
        {
            "text": "The  three non-ministerial departments with the highest percentage of sign-ups were the Office of Rail and Road (ORR), the Office for Standards in Education, Children’s Services and Skills (Ofsted) and the Chancellor’s Other Departments (made up of Government Actuary’s Department and NS&I). "
        },
        {
            "text": "The five ministerial departments with the highest completion rates of core e-learning were DWP, DfT, DSIT, HMT, and HMRC."
        },
        {
            "heading": 2,
            "text": "What’s Next? "
        },
        {
            "text": "One Big Thing 2023 kickstarted individual and collective data learning journeys, with the aim of  better use of data in the delivery of policy and services."
        },
        {
            "text": "Civil servants are continuing to explore learning opportunities, apply the knowledge and skills gained in day-to-day work, make practical changes to facilitate better use of data, have conversations, and build meaningful networks."
        },
        {
            "text": "One Big Thing 2024 is being planned and the theme will be shared soon. Here’s to more shared learning across the Civil Service to help us serve the public better and deliver the vision of A Modern Civil Service!"
        }
    ]
}