{
    "url": "https://marinedevelopments.blog.gov.uk/2024/01/25/protecting-our-diverse-and-valuable-seabird-species/",
    "title": "Protecting our diverse and valuable seabird species",
    "authors": [
        "Freja Gjerstad, MMO Marine Protected Area Manager"
    ],
    "categories": [
        "Evidence",
        "fisheries",
        "marine conservation",
        "Marine Science",
        "Uncategorized"
    ],
    "pub_date": "2024-01-25T09:27:03+00:00",
    "content": [
        {
            "text": "Have you ever been asked to name a UK seabird on the spot? Seagulls probably come to mind first, right? Or maybe you think about those charismatic puffins or bustling ‘seabird cities’ of guillemots. "
        },
        {
            "text": "We’re actually home to some of the biggest and best seabird colonies in the world, with over one hundred diverse species of marine bird sharing the marine environment around our coast. Twenty-five of these species breed here, with others visiting from further afield to escape winter chill. "
        },
        {
            "text": "They come in all different shapes and sizes, from the northern gannet with wingspans up to 1.8 metres, to the tiny storm petrel, weighing around the same as a pencil!  Each one has unique and distinct characteristics, such as the bright red feet of the black guillemot, or the foul-smelling oil fulmars spit to protect their nests from intruders. "
        },
        {
            "text": "We’d also like to point out that ‘seagull’ is not an actual species, there are in fact many different types of gull.  "
        },
        {
            "text": "The little gull for instance is a distinct species and is protected by the offshore marine protected area (MPA) network in England.  "
        },
        {
            "text": "The importance of seabird protection "
        },
        {
            "text": "Many of our local and migrant seabird populations are of huge international importance. They are an essential part of the marine ecosystem, and our coastline plays a crucial role in supporting these populations.  "
        },
        {
            "text": "Globally, birds are threatened by a range of factors such as climate change, habitat loss and disturbance as well as avian flu. 24 of the 25 UK breeding seabird species are at risk of local or global extinction, with the number of breeding seabirds falling by almost a quarter in the last 20 years. Their protection is becoming increasingly important in helping to tackle these threats.  "
        },
        {
            "text": "Sites designated to protect marine birds "
        },
        {
            "text": "There are three offshore MPAs in England protecting six types of bird as well as other important birds (waterbird assemblage) in some areas. Two of the MPAs can be found off the east coast of England, and the other is located off the coast of north west England.  "
        },
        {
            "text": "They include: "
        },
        {
            "text": "Let us introduce you to some of the birds protected by these areas! "
        },
        {
            "text": "Red-throated diver "
        },
        {
            "text": "Terns  "
        },
        {
            "text": "Sandwich tern colony, © Natural England/Allan Drewitt 03-Jun-06"
        },
        {
            "text": "Little gull "
        },
        {
            "text": "Common scoter "
        },
        {
            "text": "Take part in our latest call for evidence and help inform marine bird protection "
        },
        {
            "text": "We’re currently asking for your evidence and views on the impacts of fishing on harbour porpoise and marine bird MPAs.  "
        },
        {
            "text": "Your views and evidence will shape fisheries management decisions to ensure marine birds are protected.  Please ensure you support this work before it closes on 13 February 2024."
        },
        {
            "text": "Find out more and take part."
        }
    ]
}