{
    "url": "https://environmentagency.blog.gov.uk/2024/01/25/water-transformation-source-to-sea/",
    "title": "Water transformation: source to sea.",
    "authors": [
        "Helen Wakeham"
    ],
    "categories": [
        "Cleaner Seas",
        "Fisheries and biodiversity",
        "Water"
    ],
    "pub_date": "2024-01-25T14:33:03+00:00",
    "content": [
        {
            "text": "Helen Wakeham, Director of Water Transformation at the Environment Agency delivered a keynote speech today (25 January) at the annual Coastal Futures Conference in London."
        },
        {
            "text": "Here, Helen shares her thoughts on the history and future of our estuarine, coastal, and marine environments and how the Environment Agency and others can make a real difference."
        },
        {
            "text": "Over the past thirty years, there has been a significant improvement when it comes to estuarine, coastal and marine water pollution in the UK. Declared biologically dead in the 1950s, there are now more than 100 types of fish including seahorses living in the tidal Thames in central London for example - an incredible improvement."
        },
        {
            "text": "Much of this improvement is because of source to sea environmental regulation, planning and investment - in businesses, industry, and many agricultural practices.  There has also been an increased focus on wastewater treatment and the implementation of advanced technologies to minimise pollution."
        },
        {
            "text": "However, we know that much more needs to be done. Ecological standards put 19% of our estuaries and 45% of our coastal waters at good status.  In England, over the past 150 years, there has been a loss of 85% of saltmarsh, 99% of native oyster reefs, and seagrass meadows from up to 50% of the water bodies where it was once found. With habitat and species loss, we also lose the wider benefits that they provide, which are becoming increasingly more apparent as we connect with nature. We know also that a changing climate will challenge us further."
        },
        {
            "text": "Positive steps forward"
        },
        {
            "text": "This isn’t a counsel of despair. Ensuring people and wildlife have clean and plentiful water is one of the biggest challenges we face but also one of the biggest gifts we can give to future generations. There is lots to be positive about. People’s connection with the environment is closer now that it ever has been before. People are noticing, care and want better.  And we can learn from what we’ve done already."
        },
        {
            "text": "Bathing water quality at the coast has shown enormous improvements in recent decades.  That’s down to Environment Agency regulation and tougher rules but also water customers' investment in better wastewater treatment - and the hard teamwork of businesses, communities and local authorities to tackle what can be very local and complex issues. 96% of our bathing waters meet at least the minimum standards and 90% of bathing waters in England are rated as ‘good’ or ‘excellent’. Persistent issues at certain locations stem from complex land-related factors, requiring collaboration with diverse partners for resolution."
        },
        {
            "text": "The involvement of all stakeholders is critical, as water quality concerns impact not just water companies but also local businesses demanding timely solutions. Efforts include promoting sustainable farming and investing in advanced water treatment technologies, along with regular water quality monitoring to proactively address issues."
        },
        {
            "text": "All of this thinking and debate is central to the argument for increased investment in water quality."
        },
        {
            "text": "Biodiversity in many of our rivers is a lot better than it was - in 2019, 76% were at good status for invertebrates, which are a critical part of the food chain for thriving river wildlife. And the otter, once on the brink of extinction, has now seen a widespread return thanks to legal protection and a more general improvement in water quality, particularly the reduction in certain pesticide levels, allowing otters to recolonise much of their previous range."
        },
        {
            "text": "Positive indicators in our estuaries and at the coast also show an increase in saltmarsh of 7% over 10 years. In some estuaries, seagrass is also increasing, for example in the Thames Estuary in London, seagrass beds we monitor have increased by as much as 50% and where we monitor intertidal seagrass in other waters most achieve good or high status."
        },
        {
            "text": "But we know we need to do more if we are to shift the dial on good ecological status."
        },
        {
            "text": "Which is why in 2018, along with partners from across the sector, we started the restoration initiative (Restoring Meadow Marsh and Reef) to give a new focus on our estuarine and coastal environment which has helped focus minds on the outcomes we wanted to achieve - going beyond protecting our water environment, but also restoring it.  Now, five years on, the Environment Agency, along with Defra, have invested in a programme office for the Restoring Meadow Marsh and Reef initiative so we can support the delivery of more restoration projects at a local level along with our partners through the Championing Coastal Coordination programme."
        },
        {
            "text": "How can we ensure continued momentum and progress?"
        },
        {
            "text": "Firstly, we can’t face challenges alone. The Environment Agency’s third round of River Basin Management Plans provided a fantastic opportunity to capture the aspirations of our estuarine and coastal communities, on actions needed, from source to sea, to improve the water environment.  We now have around 30 new specific estuarine and coastal measures detailed in the plans – supported by many more source to measures. But for those measures to be successful, effective partnerships, from catchment to coast are vital if we are to succeed in restoring and enhancing our estuarine and coastal waters beyond the status quo."
        },
        {
            "text": "Secondly, we must adopt a comprehensive approach to management that recognises the interconnectedness of our water environment - from catchment to coast and the wider marine environment, while also addressing specific coastal challenges like climate change, habitat loss and direct pollution. The \"source to sea\" model is a framework to create sustainable initiatives across this entire system, managing water, sediment, pollution, organisms, materials, and ecosystem services. By integrating management of land, freshwater, estuaries, coasts, and the ocean, we can improve governance, resource sustainability, and fill existing policy gaps."
        },
        {
            "text": "Finally, evidence to underpin targeted action across the water system supported by new and innovative ways to gather that evidence is needed. That’s why Defra have invested £148M in the Natural Capital Ecosystem Assessment Programme across its Arm's Length Bodies, covering terrestrial and aquatic environments."
        },
        {
            "text": "To conclude, we should take heart from the actions we have taken to tackle our problems - monitoring, planning, investment and regulation have delivered for us in the past. And the opportunities to invest come when there is public and political will to act. Like right now. It should give us hope and optimism that major environmental problems can and will be tackled with a concerted effort from all of us."
        }
    ]
}