{
    "url": "https://environmentagency.blog.gov.uk/2025/11/05/environment-agency-and-fire-and-rescue-services-strengthen-partnership-to-tackle-illegal-waste-burning/",
    "title": "Environment Agency and Fire and Rescue Services strengthen partnership to tackle illegal waste burning",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2025-11-05T15:15:00+00:00",
    "content": [
        {
            "text": "The Environment Agency places great value on partnership working to enhance and strengthen our regulatory role. We actively collaborate with other agencies where our objectives align, protecting people, the environment, and legitimate businesses. Information sharing between partners is key to identifying, preventing, and disrupting environmental crime."
        },
        {
            "text": "One of our key partners is the National Fire Chiefs Council (NFCC), a strategic member of the Joint Unit for Waste Crime (JUWC). Together, we work to ensure a consistent and coordinated approach to tackling waste crime across the UK."
        },
        {
            "text": "The JUWC supports the development and training of NFCC Waste Fire Tactical Advisors, enhancing their ability to identify and respond to potential waste crime activity. Through this collaboration, the JUWC and NFCC share best practice, lessons learned, and identify opportunities for prevention, early intervention, and detection across agencies."
        },
        {
            "text": "This collaboration is delivering tangible results. Below are examples of how the Environment Agency and Fire and Rescue Services are working together, locally and nationally to prevent and tackle illegal waste burning."
        },
        {
            "heading": 2,
            "text": "Local collaboration identifies and targets high-risk waste fire locations"
        },
        {
            "text": "Stuart Hoyle, Environment Agency Waste Crime Engagement Officer explains: "
        },
        {
            "text": "In Lincolnshire, I work closely with the Lincolnshire Fire and Rescue Service Arson Taskforce Manager. We both sit on the county Environmental Crime Partnership and jointly proposed the establishment of a multi-agency project team focused on deliberate waste fires making this a county-wide priority for the year. Together, we co-lead the project, working alongside local authorities, the police, and the National Farmers Union (NFU) County Advisor."
        },
        {
            "text": "Our initial focus was on reviewing how waste fires were recorded across partner agencies. By categorising incidents by cause, we were able to identify fires that were deliberately ignited by waste operators seeking to avoid environmental regulation and disposal costs,  with clear disregard for the environment and public health."
        },
        {
            "text": "Through multi-agency data analysis, we identified two areas within the county with a higher concentration of waste fire incidents. This insight enabled us to target our prevention and enforcement activity more effectively."
        },
        {
            "text": "Enhanced information sharing also allows us to identify where partner agencies may have attended incidents unknown to others. Effective joint working ensures that each agency can deploy its most appropriate prevention or enforcement powers, creating a more coordinated and impactful response."
        },
        {
            "text": "Working with non-enforcement partners is equally important. The involvement of the NFU facilitates two-way information exchange with stakeholders directly affected by, and influential in addressing these issues. This partnership approach strengthens our collective capability to prevent and reduce illegal waste activity."
        },
        {
            "heading": 2,
            "text": "UK Fire and Rescue Service on lookout for waste criminals"
        },
        {
            "text": "Peter Stark, Environment Agency Enforcement Team Leader explains:"
        },
        {
            "text": "Organised waste criminals are known to illegally burn waste to avoid legitimate disposal routes and associated costs. To conceal their activity, they may contact their local Fire and Rescue Service, reporting the incident as a ‘controlled burn’ in an attempt to prevent detection."
        },
        {
            "text": "I have collaborated with the NFCC to address issues related to waste fires, controlled burns, and waste crime incidents. I have participated in recommending amendments to operational and fire control guidance provided to all UK Fire and Rescue Services. This guidance is intended to help Fire Control personnel identify calls that could suggest potential waste crime activity and assist both fire control and operational staff in recognising suspicious patterns, facilitating timely referrals to relevant agencies."
        },
        {
            "text": "Drawing on my 26 years of frontline operational experience with the Environment Agency, I have provided technical input across several areas of NFCC guidance, including notification protocols to the Environment Agency, management of surface water and groundwater, foul and surface drainage systems, waste legislation, and fire prevention plans."
        },
        {
            "text": "Throughout my career, collaboration between the Environment Agency and Fire and Rescue Services has been essential. We have worked together not only on waste-related incidents but also during tidal and fluvial flooding, emergency planning exercises, Control of Major Accident Hazards (COMAH) events, and major incidents such as the Buncefield oil terminal fire in 2005. These partnerships demonstrate our shared commitment to protecting people, businesses and the environment."
        },
        {
            "text": "I am proud to work alongside the NFCC, UK Fire and Rescue Services, and other professional partners who share our goal of protecting communities and the environment through effective joint working. Together, we continue to strengthen our collective response to waste crime and environmental harm."
        }
    ]
}