{
    "url": "https://defraenvironment.blog.gov.uk/2025/11/05/growing-britains-future-investing-in-tree-planting-to-restore-nature-and-unlock-growth/",
    "title": "Growing Britain's future: investing in tree planting to restore nature and unlock growth",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Forestry",
        "Nature",
        "Tree planting"
    ],
    "pub_date": "2025-11-05T14:28:38+00:00",
    "content": [
        {
            "text": "Forests provide essential benefits for communities across the country. They clean the air, support wildlife, offer spaces for recreation and wellbeing, and absorb carbon from the atmosphere. They're also increasingly recognised as vital for sustainable economic growth. "
        },
        {
            "text": "Today (Wednesday 5 November), the government announced the creation of the second of three new national forests - this one located in the Oxford-Cambridge corridor. This means millions of trees will be planted in the years ahead as part of a wider commitment to invest over £1 billion this parliament to planting trees and supporting the forestry sector, creating green spaces accessible to local communities whilst developing the region's economic potential. "
        },
        {
            "text": "Delivering on commitments "
        },
        {
            "text": "The government committed in its manifesto to creating three new national forests to support nature recovery at scale. The Western Forest, announced in March 2025, will see millions of trees planted from the Cotswolds to the Mendips – the first new national forest in 30 years. "
        },
        {
            "text": "The Oxford-Cambridge national forest builds on this progress, demonstrating the government's commitment for trees to work for communities, growth and nature across this vital economic corridor. A competition will launch in early 2026 to determine the location of a third forest in the Midlands or North of England. "
        },
        {
            "text": "Supporting communities and growth "
        },
        {
            "text": "The new forests will help deliver national renewal for communities, drive economic growth whilst enhancing nature and bringing trees closer to where people live. Meeting tree planting targets across Great Britain could result in over 14,000 jobs being created and supported. "
        },
        {
            "text": "The Oxford-Cambridge corridor has been identified as an area of strategic importance. The new forest will help unlock growth potential by embedding nature recovery into development, with green spaces designed alongside new homes, jobs, and infrastructure. "
        },
        {
            "text": "Access to nature has proven benefits for physical and mental health, particularly in areas experiencing deprivation. The forest will also create employment opportunities in forestry, conservation and tourism, supporting local economies whilst bringing more visitors to the region. "
        },
        {
            "text": "Enabling sustainable development and net zero "
        },
        {
            "text": "This approach demonstrates how creating high-quality natural environments can work alongside economic development.  "
        },
        {
            "text": "The announcement comes ahead of the Prime Minister's attendance at COP30, where the UK will champion the country's interests including supporting investment into clean energy. The UK is a global leader on climate action, with the Prime Minister announcing new climate goals in Baku at COP29 including reducing emissions by 81% by 2035. "
        },
        {
            "text": "The government is also exploring a Woodland Carbon Purchase Fund, offering upfront payments to landowners to plant carbon-rich woodlands, which would help us meet net zero targets. The fund, backed by up to £250 million, will give growers financial certainty and help accelerate tree planting, tackling one of the major barriers to woodland creation. Alongside this, investment in apprenticeships and training will boost rural employment and equip people with skills for green jobs. "
        },
        {
            "text": "Contributing to environmental targets "
        },
        {
            "text": "This investment forms part of the government's ambitious tree planting programme and its commitment to nature recovery – all part of the Plan for Change. The funding will contribute to meeting Environment Act targets, including improving water and air quality and increasing biodiversity. "
        },
        {
            "text": "Our woodlands are vital for regulating our climate, supporting wildlife and increasing access to nature for us all. This ambitious tree planting programme will help unlock growth, restore nature and create green jobs for the future. "
        },
        {
            "text": "What happens next "
        },
        {
            "text": "The exact location of the Oxford-Cambridge national forest is subject to design work and discussion with partners. Further details about delivery partners, specific locations, and the number of trees to be planted will be announced in the coming months, with further detail set out in the upcoming Environmental Improvement Plan. "
        },
        {
            "text": "All woodland creation will be undertaken in collaboration with landowners and communities, and local people will have opportunities to contribute to how the forest takes shape in their areas. "
        },
        {
            "text": "By creating forests that support development whilst delivering benefits for the environment and communities, the government is building foundations for long-term, sustainable, nature-rich prosperity across the Oxford-Cambridge corridor and beyond. "
        }
    ]
}