{
    "url": "https://defrafmp.blog.gov.uk/2025/11/05/new-proposals-for-sustainable-scallop-fishing-in-welsh-waters/",
    "title": "New proposals for sustainable scallop fishing in Welsh waters",
    "authors": [
        "FMP comms team"
    ],
    "categories": [
        "Public consultation"
    ],
    "pub_date": "2025-11-05T14:00:00+00:00",
    "content": [
        {
            "text": "We are highlighting a chance for those with an interest in the Welsh scallop fishery to share views through a consultation with the Welsh government."
        },
        {
            "text": "They are proposing changes to the way the scallop fishery is managed and want to hear what you think on the proposals, which suggest ways to build a stronger, more flexible management system for the inshore area to the entire Welsh zone."
        },
        {
            "text": "The proposals aim to make scallop fishing more sustainable as part of putting the king scallop fisheries management plan (FMP) into action."
        },
        {
            "text": "The FMP sets out proposals to tackle fisheries management challenges and develop a new management framework."
        },
        {
            "heading": 2,
            "text": "Have your say"
        },
        {
            "text": "If you have an interest in the Welsh scallop fishery, your views on the proposals are welcome. All responses will be considered by the Welsh government before deciding how to proceed."
        },
        {
            "text": "Visit the Welsh scallop fishery consultation page on the Welsh government website to respond online, download a form to return via email or post, or find contact details."
        },
        {
            "text": "The consultation closes at 23:59 on 15 January 2026."
        },
        {
            "heading": 2,
            "text": "What is being proposed?"
        },
        {
            "text": "There are several proposals including those relating to:"
        },
        {
            "text": "You can give your feedback on any of them. Don't forget to give evidence to support your thoughts. "
        }
    ]
}