{
    "url": "https://educationinspection.blog.gov.uk/2025/11/05/our-renewed-inspection-framework-what-weve-learned-from-pilots/",
    "title": "Our renewed inspection framework: what we’ve learned from pilots ",
    "authors": [
        "Lee Owston, National Director, Education"
    ],
    "categories": [
        "inspection",
        "schools"
    ],
    "pub_date": "2025-11-05T10:49:26+00:00",
    "content": [
        {
            "text": "Since September, we’ve carried out pilot inspections in 115 schools and taken time to carefully review the findings. "
        },
        {
            "text": "Overall, feedback on the renewed framework has continued to be really encouraging. Many providers described the toolkit and methodology as a positive step forward, appreciating the clarity they bring to the inspection process and the opportunity to see how inspectors are applying the renewed approach. The collaborative tone, regular reflection meetings, learning walks with headteachers, and the move away from deep dives are all being well received. "
        },
        {
            "text": "Leaders highlighted that inspectors were approachable, professional, and genuinely interested in understanding each school’s unique context. They also valued being kept informed of emerging findings and welcomed the chance to engage in meaningful professional dialogue. Many felt the process was fairer and more inclusive than previous inspections. "
        },
        {
            "text": "That said, some leaders did raise concerns or questions. A few mentioned increased workload and pressure on staff, particularly in smaller schools or those with more complex circumstances, where logistics could be challenging. Others had worries about how achievement is evaluated. "
        },
        {
            "text": "We’ve listened carefully to all the feedback from both providers and inspectors. Based on what we’ve heard, we’re taking steps to address concerns, offer clearer guidance, and make the logistics smoother going forward. I’ve outlined these below.  "
        },
        {
            "heading": 2,
            "text": "Toolkit update "
        },
        {
            "text": "We’ve made a small correction to the toolkit by removing the duplicated sentence below from one of the leadership and governance expected standards, as this is part of the strong standard: "
        },
        {
            "text": "Leaders provide meaningful opportunities for them to share perspectives and insights and collaborate throughout any change process. "
        },
        {
            "heading": 2,
            "text": "Evaluating achievement "
        },
        {
            "text": "To help inspectors reach accurate evaluations about achievement, we’ve added a single word ‘typically’ to one of the expected standards. This change is based on feedback from leaders and from inspectors. It helps to acknowledge that sometimes, due to limitations in the data, pupils’ achievement might not be fully reflected in published outcomes. This could be, for example, where there is a very small cohort. It also takes account of when there is no published data about pupils’ achievement, particularly in special schools and alternative provision. The updated standard now reads: "
        },
        {
            "text": "On the whole, pupils achieve well. Typically, this will be reflected in their attainment and progress in national tests and examinations, which are broadly in line with national averages, including for disadvantaged pupils. "
        },
        {
            "text": "This small but important change will enable inspectors to apply this standard accurately in all schools. In doing so, they will be helped by the detail in the new IDSR to determine where there may be some atypicality.    "
        },
        {
            "heading": 2,
            "text": "Supporting inspectors with context "
        },
        {
            "text": "To further support inspectors in building a clear picture of achievement, the new IDSR will include helpful context flags about pupil cohorts. These indicators will highlight things like cohort stability, levels of disadvantage, and the proportion of pupils with SEND in each school, giving inspectors a fuller understanding of the school’s context.    "
        },
        {
            "heading": 2,
            "text": "Minimising pressure on leaders and staff "
        },
        {
            "text": "We’ve learned a lot from the pilot inspections about how to reduce pressure on school leaders and staff. Having an extra inspector on site gave the lead inspector more time to engage with leaders, hear about all the aspects of the school that leaders wanted to celebrate with us, and helped everything run more smoothly.  "
        },
        {
            "text": "We’re making sure that our inspectors are fully up to date with the most effective strategies they can use to keep things manageable. In smaller schools – including some primaries – or those with more complex contexts, logistics often needed extra thought. For example, we’ve seen how important it is to anticipate the potential impact on staff right from the planning call. Involving leaders in shaping the timetable, deciding who is best placed to accompany inspectors, and planning how case sampling and learning walks will work can help keep things calm and avoid overwhelming staff. "
        },
        {
            "text": "We also trialled a different approach to allocating the additional inspection day for small schools. Instead of adding it to day one, we found that having two inspectors on each day made things much more manageable for everyone involved. "
        },
        {
            "text": "In maintained nursery schools, we noticed that it was more difficult to evaluate impact during the autumn term, especially when most children were 3- and 4-year-olds who had only recently started. So, going forward, we’ll be scheduling inspections for these settings in the spring and summer terms only, when there’s more evidence of progress over time. "
        },
        {
            "heading": 2,
            "text": "Steady and assured start  "
        },
        {
            "text": "The pilot phase has given inspectors the chance to get hands-on experience with the new methodology, and it’s been a valuable learning opportunity for everyone involved. Now, we’re moving towards a steady and assured start to inspections. "
        },
        {
            "text": "We’re carefully planning the schedule so that inspectors leading the first inspections will be supported by our most experienced inspectors, including regional directors, assistant regional directors and Senior His Majesty’s Inspectors. From November through to the end of the year, inspectors will take part in shadowing, teaming, and learning activities. This is all about making sure everyone feels confident and well-prepared to work with the renewed framework. "
        },
        {
            "text": "A big thank you to all the leaders and staff who took part in the pilot inspections and shared such valuable feedback. Your insights have played a key role in shaping the actions we’ve taken, and we’re truly grateful for your time and engagement in the process. "
        },
        {
            "heading": 2,
            "text": "Where you can find out more  "
        },
        {
            "text": "Sign up to the IDSR webinar on 3 December"
        }
    ]
}