{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/11/05/research-software-engineers-in-action/",
    "title": "Research software engineers in action",
    "authors": [
        "gseprofession",
        "Dimitrios Theodorakis",
        "Pierre Siddall"
    ],
    "categories": [
        "Blog Series",
        "Collaborating & Networking",
        "Guest Blog"
    ],
    "pub_date": "2025-11-05T14:58:44+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why the Research Software Engineering conference matters for government"
        },
        {
            "text": "By Dimitrios Theodorakis, Scientific Software Engineer and Pierre Siddall, Foundation Scientific Software Engineer, Met Office "
        },
        {
            "text": "Following Research Software Engineering Day on 9 October, and our professional societies conference in September, we reflect on the vital role research software engineers (RSEs) play in government and the power of collaboration with partners. "
        },
        {
            "heading": 4,
            "text": "Who are research software engineers? "
        },
        {
            "text": "Research software engineers like us combine professional software engineering skills with a deep understanding of research. This lets us combine our expertise in areas such as artificial intelligence with cutting edge research. Research Software Engineers work in all parts of government; from the Met Office helping you be weather ready to the home of big data and artificial intelligence, The Alan Turing Institute. Research software engineering covers a wide range of roles in the civil service. If you work with software in research, you might also be a research software engineer. "
        },
        {
            "heading": 4,
            "text": "Conference and collaboration "
        },
        {
            "text": "In September, over 400 people gathered at the University of Warwick for the annual Society of Research Software Engineering conference. RSEs from seven government departments gave 11 talks and workshops on a wide range of topics from the energy efficiency of supercomputers to climate communication. This year there were four government sponsors: The Met Office, AWE’s strategic Centre of Excellence in Scientific Computing based at the Edinburgh Parallel Computing Centre (EPCC), the Science and Technology Facilities Council (STFC), and The Alan Turing Institute. Sponsoring such events gives us the chance to promote public service and government research while fostering new connections with industry and academia. "
        },
        {
            "text": "The conference has already led to a workshop between government departments sharing good practice, and attendees are exploring exciting new avenues for collaboration both within government and beyond. If you are a research software engineer, we look forward to seeing you at the next conference for research software engineering.  "
        }
    ]
}