{
    "url": "https://educationhub.blog.gov.uk/2025/11/what-you-need-to-know-about-the-changes-to-the-national-curriculum/",
    "title": "What you need to know about the changes to the National Curriculum",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Schools"
    ],
    "pub_date": "2025-11-05T09:30:00+00:00",
    "content": [
        {
            "text": "A major review of the curriculum – what children learn at school – and the qualifications and assessment system has just been published, and the government is making changes based on what it found."
        },
        {
            "text": "The National Curriculum hasn’t been updated in over ten years, so these changes will ensure it stays relevant for today’s world."
        },
        {
            "text": "These changes will deliver a world-leading curriculum and give every child a better, more well-rounded education that sets them up for life after school."
        },
        {
            "text": "Here's what it means for you and your child."
        },
        {
            "heading": 3,
            "text": "What is the Curriculum and Assessment Review?"
        },
        {
            "text": "This is an independent review looking at what children and young people aged 5 to 19 learn in schools and colleges in England."
        },
        {
            "text": "Professor Becky Francis CBE led the review with a panel of experts over the past year. The review received over 7,000 responses from the public to inform its findings."
        },
        {
            "heading": 3,
            "text": "Why are we changing what children learn at school?"
        },
        {
            "text": "The National Curriculum sets out what children learn at primary and secondary school, split by age group (known as key stages). It also lays out the minimum expectations for what children should be taught within each subject. The current National Curriculum hasn't been updated since 2014. Education for 16 to 19 year-olds is separate to the National Curriculum, but the review looked at this too."
        },
        {
            "text": "The review found that much of what's currently taught works well, but some areas could be better – especially for children from disadvantaged backgrounds or those with special educational needs and disabilities (SEND)."
        },
        {
            "heading": 3,
            "text": "What's changing?"
        },
        {
            "text": "We're modernising the curriculum so children have the right skills and knowledge to thrive in a changing world."
        },
        {
            "text": "Building strong foundations"
        },
        {
            "text": "High standards, more choice"
        },
        {
            "text": "Learning for a changing world"
        },
        {
            "heading": 3,
            "text": "What happens next?"
        },
        {
            "text": "We're developing the new curriculum with teachers, curriculum experts, pupils and parents. The final curriculum will be published in spring 2027, and schools will start teaching it from September 2028."
        }
    ]
}