{
    "url": "https://ukhodigital.blog.gov.uk/2024/10/04/collaboration-day-developing-a-community-of-learning/",
    "title": "Collaboration day - developing a community of learning",
    "authors": [
        "Dita Dixon"
    ],
    "categories": [
        "Collaboration",
        "Ways of working"
    ],
    "pub_date": "2024-10-04T07:18:24+01:00",
    "content": [
        {
            "text": "The UK Hydrographic Office (UKHO) and the Met Office strengthened their long-standing relationship earlier this year by signing a Memorandum of Understanding (MoU). Located only 32 miles apart in the southwest of England, the MoU creates the opportunity for further across-government collaboration between the two organisations."
        },
        {
            "text": "To maintain momentum and realise greater efficiencies through working closer together, the UKHO and Met Office arranged a day of collaboration hosted by the Met Office, exploring their shared understanding and learnings on the topic of ‘our people’. The day helped the organisations develop a community of learning, sharing best practices and knowledge, and exploring how they can nurture and retain talent, resulting in better employee experiences."
        },
        {
            "text": "Andrew Henretty, Head of People Development, at the Met Office, commented."
        },
        {
            "text": "Participants gained a deeper understanding of each organisation’s people strategies and frameworks. Similarities were identified, such as a focus on creating an employee experience that attracts and retains the right people and developing an inclusive, adaptive and empowering culture that enables individuals to thrive and the organisation to have the skills and capabilities to adapt for the future."
        },
        {
            "heading": 2,
            "text": "Shared learnings from the Met Office's Profession Review and the UKHO's Culture Programme Project"
        },
        {
            "text": "Representatives from the Met Office also shared learnings from their recent Professions Review and how these align with similar external vocations. They discussed how a more consistent and aligned professional competency framework, which includes best practice and different approaches adopted externally, adds greater value to the Met Office and its people."
        },
        {
            "text": "Similarly, representatives from the UKHO shared their insights on culture, showcasing the work undertaken by the Culture Programme Project team within its people division. The project involved engaging with a range of stakeholders within the organisation, gathering comprehensive data and insights to understand current strengths and identify development areas to redefine the UKHO’s future culture."
        },
        {
            "text": "The work undertaken at the Met Office and the UKHO supports the delivery of overall business strategies while continuing to develop and retain staff."
        },
        {
            "text": "The day concluded with participants splitting into three groups to explore strengths, weaknesses and opportunities within learning, talent, and performance management and leadership. Delegates discussed what both organisations do well, highlighting any areas or gaps that could be improved by the other organisation’s strengths or by developing something new together. Each group left with a set of actions or points to develop."
        },
        {
            "text": "Joe McNulty, Learning and Development Manager at the UKHO, commented:"
        },
        {
            "text": "This collaboration day on people is the first of a planned series of days between the two government agencies, with the next session exploring international engagement scheduled in early 2025."
        },
        {
            "text": "Discover more about the on-going relationship between the Met Office and the UKHO in this blog ‘Strengthen ties through spotlight talks’."
        }
    ]
}