{
    "url": "https://dcmslibraries.blog.gov.uk/2024/10/04/green-libraries-week-returns/",
    "title": "Green Libraries Week returns",
    "authors": [
        "nicoleagyekum",
        "Hinna Vayani, CILIP"
    ],
    "categories": [
        "Events",
        "Uncategorized"
    ],
    "pub_date": "2024-10-04T13:15:17+01:00",
    "content": [
        {
            "text": "This October, Green Libraries Week returns to celebrate the work going on in libraries across the UK focused on sustainability, climate change and green action within their communities."
        },
        {
            "text": "During Green Libraries Week from 07 to 13 October, the Green Libraries Partnership is  working with libraries across the UK to encourage users and non-users of all ages to be a part of the campaign theme of ‘Every library a green library’.  "
        },
        {
            "text": "The Green Libraries Partnership is a UK-wide, cross-sector programme focused on the contribution of librarians, information and knowledge professionals to the sustainability agenda. It aims to encourage libraries to actively reduce their carbon footprint and increase awareness of environmental issues for the wider public by providing accessible resources. The Partnership was launched in spring 2022. "
        },
        {
            "text": "Earlier this year, the Partnership welcomed new partners on board, broadening the work of the campaign to bring in academic, health and research libraries alongside public libraries to focus on green action."
        },
        {
            "text": "The Green Libraries Week map "
        },
        {
            "text": "The Green Libraries Week interactive map plots the innovative and exciting green events and activities that are taking place around the country. We hope the map can be a source of inspiration and shared knowledge for the sector."
        },
        {
            "text": "Activities for 2024 include:"
        },
        {
            "text": "GLP board member and Libraries Connected representative Sarah Mears shines a light on the value of celebrating sustainable practices in public libraries, saying ‘Green Libraries Week is a fantastic opportunity to highlight the work that libraries do to connect local communities to environmental issues and sustainability. Libraries are using their information and learning role to support customers to better understand and develop more sustainable behaviours. This is a week to celebrate achievements but also to aspire to ever more creative green practices ensuring that every library is a truly green library.’"
        },
        {
            "text": "Green Libraries Week is closely followed by the second Green Libraries Conference, taking place at the British Library’s Knowledge Centre on 25 November. "
        },
        {
            "text": "Early bird ticket sales end on the last day of Green Libraries Week, Friday 25 October. "
        },
        {
            "text": "For more information on the Green Libraries Conference and to book your ticket, visit https://www.cilip.org.uk/page/greenlibrariesconf24 "
        }
    ]
}