{
    "url": "https://environmentagency.blog.gov.uk/2024/10/04/how-can-being-winter-ready-help-all-year-round/",
    "title": "How can being winter ready help all year round?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture"
    ],
    "pub_date": "2024-10-04T11:33:38+00:00",
    "content": [
        {
            "text": "In our last post about how farmers can get ready for winter we looked at a case study with Tom, a dairy farmer in Cornwall, who had made some major changes to his slurry storage and farm buildings. In this follow up video, we go behind the scenes to look at the agronomics that support the improvements Tom made and why regulation can help a farm business. The video features Rob, our Senior Environment Officer in Cornwall, and Graham, a local agronomist who worked with Tom. (And also happens to be his father-in-law!)"
        },
        {
            "text": "Why is regulation important?"
        },
        {
            "text": "The principal purpose of agriculture regulations for water quality speak for themselves – to ensure that waterways are protected from harm, specifically from nutrients that can cause imbalances in their ecosystems."
        },
        {
            "text": "If we look beyond this, regulation also provides other things. Like all sectors, agriculture is competitive and businesses that are efficient will thrive. Clear regulations that are properly enforced mean that all businesses compete on  a level playing field. They all have to achieve the same regulatory compliance, and have to invest similar amounts of time and money, relatively speaking, in doing so."
        },
        {
            "text": "As our environment officer Rob explains in this video, achieving compliance, and going beyond its requirements, can provide security for a business for 25 – 30 years. It gives room for expansion and the knowledge that a farm is operating from a stable platform."
        },
        {
            "text": "And as Tom found, being compliant with the regulations also bought practical and financial benefits to his business."
        },
        {
            "text": "Business benefits"
        },
        {
            "text": "The benefits that Graham highlights in the video may seem obvious at first glance, but the detail behind them really brings home their value to the farm."
        },
        {
            "text": "If you have more capacity to store organic fertilisers from your livestock (i.e. slurry), then you only have to use it when you need to. In practice what this means is applying it to your land when the conditions are most favourable, when the grass or crops you are growing need it and when they will benefit most from it. And it is possible to quantify this - Graham notes that nutrient uptake when applying slurry in Spring, as opposed to Autumn, can be as much as 30% more due to more favourable conditions. Not only that, by doing so you will be complying with Farming Rules for Water requirements to only spread fertiliser to land in accordance with soil and crop need."
        },
        {
            "text": "The knock-on effect of this is clear – less need to buy in bagged fertiliser, with significant savings year on year. Add in reduced costs for fuel and vehicle maintenance, fewer man hours and reduced impact on soils from heavy machinery and the benefits start to add up. Also, by increasing his storage capacity, Tom was able to create an efficient ‘circular economy’ on his farm. Nutrients being applied to land from slurry, growing more grass to feed his cows, nutrients then returned to the land through the slurry."
        },
        {
            "text": "We recognise that agriculture is a unique industry in England, with a varied make up of small, medium and large-scale businesses. Weather and ever-changing markets make it a high-risk industry to operate in, and this has a significant impact on the ability of farmers to invest."
        },
        {
            "text": "Through our winter ready campaign, we have aimed to highlight that even small changes can  bring benefits and that financial and technical advice is available. As our case study videos have shown, if you do have the ability to invest you can reap the benefits quickly and improve the efficiency of your farm."
        },
        {
            "text": "We do not want farmers to be afraid to speak to us about slurry storage, or to be worrying unnecessarily about the coming winter when we can help. If you have concerns or would like more information, contact us or our partner organisations using the details and weblinks below."
        },
        {
            "text": "Environment Agency National Customer Contact Centre"
        },
        {
            "text": "Tel. 03708 506 506 "
        },
        {
            "text": "Email: enquiries@environment-agency.gov.uk "
        },
        {
            "text": "Catchment Sensitive Farming: Catchment Sensitive Farming: advice for farmers and land managers - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Farming Advice Service: Home | Farming Advice Service"
        }
    ]
}