{
    "url": "https://mojdigital.blog.gov.uk/2024/10/04/prisoner-facing-services-design-principles/",
    "title": "Prisoner-facing Services: Design Principles",
    "authors": [
        "Jane Stead"
    ],
    "categories": [
        "Content design",
        "Content Hub Team",
        "Design",
        "digital principles",
        "digital services",
        "Our services",
        "our users",
        "service design",
        "User Centred Design",
        "User research"
    ],
    "pub_date": "2024-10-04T15:03:44+01:00",
    "content": [
        {
            "text": "Extensive in-prison research leads to the first set of design principles for prisoner-facing services."
        },
        {
            "heading": 3,
            "text": "Five years' of prisoner research"
        },
        {
            "text": "In 2018, as part of the Launchpad in-cell technology programme, we researched, designed and built the Content Hub platform for prisoners. In doing so, we collected research and data about the unique and complex needs of prisoners as a user group. "
        },
        {
            "text": "Fear of stigma or vulnerability means many prisoners hide their difficulties, meaning they miss out on necessary support. For example, a person may disengage, show anger or create tension rather than admit they can't read or understand what's being asked of them. "
        },
        {
            "text": "Using 5 years' worth of extensive in-prison research, data and direct online prisoner feedback, we've created a set of design principles for prisoner-facing content and services."
        },
        {
            "text": "The principles are to help designers design for prisoners, in addition to the UK Government’s Design Principles."
        },
        {
            "heading": 3,
            "text": "What are the principles?"
        },
        {
            "text": "Principle 1: Design for basic literacy, numeracy and digital skills"
        },
        {
            "text": "Compared with the general population, the prison population has a higher percentage of people with poor literacy, numeracy and digital skills."
        },
        {
            "text": "We design simply, by default, in order to create services and content that is understood by as many people in prison as possible."
        },
        {
            "text": "Principle 2: Anticipate complex access needs"
        },
        {
            "text": "The prison population has a higher percentage of vulnerable people with complex needs, which means people in prison may present, and be largely undiagnosed with, one or a combination of:"
        },
        {
            "text": "We design sensitively for prisoners to accommodate this range of complex emotional needs, neurodiverse conditions and learning difficulties by using a trauma-informed, non-threatening, non-authoritarian tone to avoid triggering or adding to existing cognitive load."
        },
        {
            "text": "Principle 3: Build trust, show respect, design with data"
        },
        {
            "text": "Prisoners can be wary of information and content associated with authority or from official sources. They can feel 'left in the dark' and frustrated about decisions and processes. "
        },
        {
            "text": "They can be given conflicting answers and information from different members of staff. When information is inconsistent, prisoners feel suspicious, then disengage."
        },
        {
            "text": "We design using data to build trust by making information, processes, dates and decisions transparent. We adapt data from Digital Prison Services (DPS) so the format and tone of voice is appropriate for prisoners' needs, as well as creating an enriched and personalised prisoner experience."
        },
        {
            "text": "Principle 4: Prioritise privacy"
        },
        {
            "text": "Prisoners can be anxious about other prisoners getting access to their personal information. "
        },
        {
            "text": "Details about money, family, important milestones or significant sentence dates that fall into the wrong hands can lead to bullying, intimidation and violence. Prisoners need to feel their information is secure. We design in ways that prioritise security to protect prisoners' privacy."
        },
        {
            "text": "Principle 5: Practice authenticity and diversity "
        },
        {
            "text": "Prisoners, like most user groups, only engage with content they feel reflects them. They respond more positively when listening to or watching people with lived experience. "
        },
        {
            "text": "For services and content to communicate well, they must be authentic, feel genuine and show diversity."
        },
        {
            "text": "We use an authentic voice, in audio and video format. We design services including people from a range of racial, cultural, socioeconomic and ethnic backgrounds, and of different genders and sexual orientations."
        },
        {
            "text": "Principle 6: Push boundaries, realistically"
        },
        {
            "text": "An understandably risk-averse security or stakeholder team may block new digital suggestions that could help prisoners. "
        },
        {
            "text": "Finding safe ways of pushing the digital boundaries in prisons is important, but it can be time-consuming because the security constraints put on this user group are vast."
        },
        {
            "text": "We try to push boundaries in design to make things more accessible, simple and reflective of the outside world, but we are aware and realistic of the many constraints designing for prisoners has."
        },
        {
            "heading": 3,
            "text": "Summary of PFS principles"
        },
        {
            "text": "Prisoners need simple designs, with clear messages, delivered in a trauma-informed way which respects their privacy and reflects their lived experience."
        }
    ]
}