{
    "url": "https://ruralpayments.blog.gov.uk/2024/10/04/rpa-customer-board-visit-to-bleak-bank-farm/",
    "title": "RPA Customer Board visit to Bleak Bank Farm",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-10-04T13:25:00+01:00",
    "content": [
        {
            "text": "In the third of a series of blogs about Customer Director Marie Hardeman’s visits to shows, farms and projects, she tells us about her time visiting Bleak Bank Farm with members of RPA’s Customer Board. The Customer Board was created in March this year with the aim of finding ways that RPA can improve service delivery for customers. Members are from across different areas of RPA and as well as sharing best practice, they look at the problems customers experience from different angles to ensure RPA improves its services and provides a seamless customer experience. "
        },
        {
            "text": "Bleak Bank farm, a family-run, hill farm in the Yorkshire Dales, with sheep and a dairy herd has rights to graze on common land. They also works with the Foundation for Common Land to deliver hill farm training courses. "
        },
        {
            "text": "Members of the Customer Board were hosted by farmers John and Judith Dawson, their son William, a neighbouring farmer and representatives from the Foundation for Common Land, so were able to get a few different perspectives during the visit."
        },
        {
            "text": "Marie reflected: “This farm was in some ways a complete contrast to our previous visit to the Allerton Project, but so many of the challenges each are facing, and trying to mitigate, are similar. We learnt a lot about grazing on common land and the complexities involved and how passionate about farming the family are. They want to do the best for their land, their animals, the environment and their business and are constantly looking at different, and new ways, to achieve this.”"
        },
        {
            "text": "The visit allowed the Customer Board to get a feel for the farm’s day-to-day workings, a sense of the need for co-operation and community involvement in working common land. It was a good opportunity to gain insight about some of the complexities and frustrations of working across more than one part of Defra."
        },
        {
            "text": "RPA’s Head of Customer Experience Gareth Jones who went on the visit commented “John was really brilliant at articulating some of the challenges he, and farms like his, experience. We really got a sense of a typical working day, and it was good to understand how RPA fitted into the farm’s ecosystem. It was also really clear how important funding is and being able to see how it is put to use practically. I was really struck by how time-poor John is, and it brought home to me the importance of having processes in place that make it as easy as possible for him to navigate RPA."
        },
        {
            "text": "Also key for me was just how paramount animal welfare was. The pride taken in doing the best for his animals was palpable and it struck me just how enthusiastic John was about the natural environment and ensuring biodiversity on the common land he manages.”"
        },
        {
            "text": "Kath Illidge, Head of Customer Engagement added: “Visiting Bleak Bank Farm on a nice day certainly didn’t live up to its name - clear blue skies made for a pleasant experience. However, the tough reality of hill farming was very evident as we passed through the common gate and climbed steeply onto the fell, a different type of farming to the rolling lowlands of Leicestershire at the Allerton Project. Here I learned more about the complexities of common land, grazing rights and working with your neighbours to ensure the environmental outcomes supported through our schemes are met. Two very different businesses but with one fundamental common goal – a passion for sustainable farming, where food production and the environment go hand in hand.”"
        },
        {
            "text": "Janine Christie is based in RPA’s Regulatory and Advice Service which provides farmer-focused visits for schemes and aims to support farmers by offering greater levels of advice, guidance and signposting to help improve compliance with standards and scheme requirements. She said: “The focus on commons, and how that interacted with schemes was particularly useful for me. The need for a good working relationship with neighbours and the challenges this brought wasn’t something I was aware of before the visit. It was great to see the detail within a commons agreement, as well as location (how hilly or none hilly!). I hadn’t realised as a non-farmer what an impact it would have. It was also very interesting to hear comments about the type of customer contact they have with RPA and improvements they want to see in that area, as well as the frustration that SFI isn’t yet available to HLS customers. One piece of work I’ll be able to feed into my day-to-day tasks will be how we can improve RPA’s interactions with farmers and land managers by making better use of our data to enhance the customer experience.” "
        },
        {
            "text": "As well as learning about common land grazing, the Customer Board also vaccinated lambs, sheared sheep and walked up fells on Ingleborough, one of the Yorkshire Three Peaks. They also enjoyed the herding and sorting sheep (after an excellent sheepdog display), vaccinated and trimmed sheep and had a try of the robotic milker. Gareth in particular enjoyed the stock sorting exercise where sheep from the common were passed through a narrow channel and sorted into sub groups – “a simple but really effective method requiring co-ordinated team work and a good sense of humour!”"
        },
        {
            "text": "Read the first in the series about Marie’s visit to a Lancashire farm here."
        }
    ]
}