{
    "url": "https://ipo.blog.gov.uk/2015/10/06/happy-birthday-dear-website/",
    "title": "Happy Birthday dear website",
    "authors": [
        "Kirsty Edwards"
    ],
    "categories": [
        "Business"
    ],
    "pub_date": "2015-10-06T15:30:05+01:00",
    "content": [
        {
            "text": "Not that I’ve ever needed an excuse for cake but today is the first anniversary of our website on GOV.UK so it would be rude not to. Let’s take a look back and find out what’s been happening."
        },
        {
            "heading": 2,
            "text": "A warm welcome from GDS"
        },
        {
            "text": "Graham Francis, Proposition Manager, Government Digital Service (GDS), welcomed the IPO on board:"
        },
        {
            "text": "The last 12 months has seen us work hard to update and refresh our website for you, our users. We’ve made big changes to the site including the introduction of new online services such as:"
        },
        {
            "text": "We’ve also refreshed lots of our content including big updates to our IP for business collection. The collection now holds an array of useful guides, tools and case studies that allow businesses to understand how intellectual property is applied in real life."
        },
        {
            "heading": 2,
            "text": "Continuous improvement"
        },
        {
            "text": "Continuous improvement is important to us and we actively work through any feedback received. Customer visits have indicated that our users still experience issues when searching for IPO content. We previously recognised this issue and created a video for our customers to understand how to filter content by organisation. Take a look and make sure you’re clued up when it comes to searching for our content."
        },
        {
            "text": "Missing IPO Pro? Don’t forget all our professional content now sits under the Law and practice topic on our homepage."
        },
        {
            "text": "Your comments allow us to find out what we could do better and more of, so please continue to get in touch and we will continue to listen."
        },
        {
            "text": "This continuous improvement approach is encouraged by GDS and Graham:"
        },
        {
            "heading": 2,
            "text": "The birth of the blog"
        },
        {
            "text": "Part of transition saw the set up of this very blog platform which replaced our old IP Insight newsletter. From Bubble Wrap to Cromer crabs, from Minions to soil, it’s fair to say we’ve seen some weird and wonderful blogs this past year. However, there’s one thing that ties them all together…IP."
        },
        {
            "text": "If you are passionate about IP or simply looking for something interesting to read, we’re sure you’ll enjoy our weekly blogs. Our talented authors include IPO staff, external writers and industry experts. Make sure you sign up below to ensure you don’t miss any of our interesting reads."
        },
        {
            "text": "To keep in touch, sign up to email updates from this blog, or follow us on Twitter."
        }
    ]
}