{
    "url": "https://traderemedies.blog.gov.uk/2024/06/17/current-vacancies-at-the-tra/",
    "title": "Current Vacancies at The TRA",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Analysis",
        "Digital",
        "HR",
        "People",
        "Recruitment"
    ],
    "pub_date": "2024-06-17T12:25:15+01:00",
    "content": [
        {
            "heading": 4,
            "text": "The TRA is one of the first public bodies to be set up to meet the new needs of the UK following its departure from the European Union. We play a central part in ensuring that the international trading environment is fair as well as free, by protecting British businesses from unfair trading practices such as dumping, trade-distorting subsidies and unforeseen surges in imports."
        },
        {
            "heading": 4,
            "text": "If you are interested in a new challenge and would like to join us please scroll to read about our exciting vacancies:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "G7 Economic Adviser - Analyst Team"
        },
        {
            "text": "As an Economic Adviser, you will act as a trusted authority on trade remedies-related analysis and your knowledge and skills will be needed throughout our investigations. We will look to you to deliver high quality analysis at pace, communicate your findings influentially and promote best practice."
        },
        {
            "heading": 4,
            "text": "The key details.."
        },
        {
            "text": "Location: Reading based office with hybrid working available. The Analyst team currently attend the office a minimum of two days a mon the and more often as and when required."
        },
        {
            "text": "Salary: £55,392 - £60,190. This role attracts an allowance £4010 per annum based on meeting Technical Qualification or belonging to a specific Analytical Profession. Plus a Civil Service Pension with an average employer contribution of 27%."
        },
        {
            "text": "Working pattern: Flexible working, full-time, part-time, compressed hours."
        },
        {
            "text": "Contract type: Permanent"
        },
        {
            "text": "Roles available: Three"
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "The Economic Interest Test (EIT)"
        },
        {
            "text": "At the TRA we are unique in using the Economic Interest Test (EIT) as part of our investigations, but it may be new to some of our applicants. In this short video, our Chief Economist, Aproop Bhave discusses what the EIT is and why it is so important to what we do!"
        },
        {
            "heading": 4,
            "text": "Have questions about the role?"
        },
        {
            "text": "Our Head of Economics, Igor Gavran will be delighted to answer any questions you may have on a 1-2-1 basis. To set up an informal chat, please email igor.gavran@traderemedies.gov.uk"
        },
        {
            "text": "To read the full job description and apply please head to Civil Service Jobs here"
        },
        {
            "text": "Closing date Sunday 7 July 11:55pm"
        },
        {
            "heading": 3,
            "text": "HEO Investigator - Analyst Team"
        },
        {
            "text": "At the TRA, you’ll play a key role in ensuring fair trade practices by assessing claims of unfair trade activities. Collaborating with a diverse team of fellow investigators, lawyers, policy advisors, accountants and analysts, you’ll review financial documents, analyse data, conduct site visits and engage with stakeholders. Your work will result in externally-facing and detailed reports that provide clear recommendations to the Secretary of State on trade remedies. This role offers a chance to have a strategic impact on UK industries, against the backdrop of international economic and trade policy."
        },
        {
            "heading": 4,
            "text": "The key details.."
        },
        {
            "text": "Location: Reading based office with hybrid working available."
        },
        {
            "text": "Salary: £34,565 plus Civil Service Pension with an average employer contribution of 27%."
        },
        {
            "text": "Working pattern: Flexible working, full-time, part-time, compressed hours."
        },
        {
            "text": "Contract type: Permanent"
        },
        {
            "text": "Roles available: Ten"
        },
        {
            "heading": 4,
            "text": "Have questions about the role?"
        },
        {
            "text": "One of our Lead Investigators, Jonathon Farrell will be delighted to answer any questions you may have on a 1-2-1 basis. We are hosting two virtual drop-in sessions which you can join on the dates listed below:"
        },
        {
            "text": "Click to join the Wednesday session here."
        },
        {
            "text": "Click to join the Monday session here."
        },
        {
            "text": "To read the full job description and apply please head to Civil Service Jobs here."
        },
        {
            "text": "Closing date Sunday 14th July 2024."
        }
    ]
}