{
    "url": "https://deframedia.blog.gov.uk/2022/01/21/government-consults-on-plans-to-tackle-waste-crime/",
    "title": "Government consults on plans to tackle waste crime",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-21T13:32:20+00:00",
    "content": [
        {
            "text": "There has been coverage today including in BBC Online, Times, Independent, Telegraph, iNews, Sun, Express and Yorkshire Post of our proposals to tackle waste crime and support people and businesses to ensure their waste is managed properly."
        },
        {
            "text": " Plans set out in two new consultations will see increased background checks for firms who move or trade waste, as well as making it easier for regulators across the UK take action against rogue operators."
        },
        {
            "text": "Environment Minister Jo Churchill was interviewed by BBC Breakfast, BBC World at One and 5 News to highlight how the reforms will tackle waste crime including fly-tipping, illegal waste sites, and illegal waste exports."
        },
        {
            "text": "The reform of the waste industry will see increased background checks for firms who move or trade waste, as well as making it easier for regulators across the UK take action against rogue operators. With waste often handled by intermediaries who conceal their identities to commit serious and organised waste crime, the increased checks will ensure waste is managed by authorised persons only and in a safe manner, making it harder for unregistered operators to find work in the sector."
        },
        {
            "text": "New plans will also see the introduction of mandatory digital waste tracking, using powers in the landmark Environment Act to overhaul existing waste record keeping. This means those handling waste will record information from the point waste is produced to the stage it is disposed of, recycled and reused."
        },
        {
            "text": "Environment Minister Jo Churchill said:"
        },
        {
            "text": "“Waste criminals show complete disregard for our communities, the environment and the taxpayer. We have disrupted these rogue operators by giving extra powers to the Environment Agency, with nearly 1,000 illegal waste sites now being shut down each year, while our new Joint Unit for Waste Crime is successfully disrupting criminal gangs, for example, prosecuting fly tippers illegally dumping hundreds of tonnes of hazardous waste across the countryside."
        },
        {
            "text": "“But there is more to do. Reforming the licensing system will clamp down on abuse of the system and new mandatory digital waste tracking will greatly improve transparency in the sector and make it easier for householders to check that their waste is being disposed of legally."
        },
        {
            "text": "“Together, these reforms will stop criminals abusing the waste system and make it easier to prosecute offenders successfully.”"
        },
        {
            "text": "You can respond to the waste carrier, broker and dealer reform consultation here. You can respond to the mandatory digital waste tracking consultation here."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}