{
    "url": "https://aphascience.blog.gov.uk/2022/01/21/grey-squirrel-contraceptive/",
    "title": "How do you feed an oral contraceptive to 2.5 million grey squirrels?",
    "authors": [
        "Sarah Beatham"
    ],
    "categories": [
        "Wildlife"
    ],
    "pub_date": "2022-01-21T11:20:57+00:00",
    "content": [
        {
            "text": "How do you feed an oral contraceptive to 2.5 million grey squirrels? This is a question Sarah Beatham, a field ecologist at APHA, is currently facing in her 4th year of research on developing an oral contraceptive for grey squirrels. As these contraceptives may affect other mammals, one of the most important parts of the research is to design a platform for the bait (known as a bait hopper) that only grey squirrels can feed from."
        },
        {
            "text": "In this insightful blog, Sarah gives a summary of some of the work she has been doing with Northumberland red squirrel volunteer groups this summer. She was trying to find out if the bait hoppers could be used for grey squirrels without red squirrels and other animals feeding from them, as we only want grey squirrels to eat the contraceptive. The plan would then be to use the bait hoppers being developed to house the oral contraceptive for grey squirrels."
        },
        {
            "heading": 3,
            "text": "Background to the study"
        },
        {
            "text": "Our hopper was co-developed with NatureCounters to collect data such as numbers of feeding visits by individual squirrels and amount of bait taken per visit. This helps us learn about grey squirrel behaviour and enables us to devise the bait that squirrels like best so that they readily eat it when it contains a contraceptive."
        },
        {
            "text": "So far, in our field studies, the hoppers have had a 70g door that has to be pushed open by the animal, in order to access the bait. Every time the door is lifted, the date and time is recorded automatically. We then identify what has lifted the door using a remote camera, set to take photos and videos."
        },
        {
            "text": "We have completed a number of field trials in woods in Yorkshire and North Wales and besides thousands of grey squirrels, we have only seen one mouse entering a hopper."
        },
        {
            "text": "Based on previous research by Forest Research, for this study, we decided to test door weights of 200g and 240g, to see if they would prevent red squirrels and other animals, apart from grey squirrels, from feeding on the bait."
        },
        {
            "heading": 3,
            "text": "The field trials"
        },
        {
            "text": "We carried out field trials in two woodland areas of Northumberland, near Wooler and Otterburn. Both of these locations were known to have good populations of red squirrels and no grey squirrels, making them ideal. Two friendly and knowledgeable groups of volunteers assisted me with deploying the equipment, baiting the hoppers and checking the remote cameras."
        },
        {
            "text": "I met with both groups in late July and we deployed ten hoppers across each wood. Each hopper was fixed to a one-metre-high stand and monitored by a remote camera. Five of the hoppers in each wood were fitted with a novel colour sensor device positioned at the entrance, that recorded the colour of the red squirrel coats. We will use the colour data collected to see if there is a difference between red and grey squirrel coats, which we can then use to exclude red squirrels from hoppers."
        },
        {
            "text": "We started with the hopper doors tied open, to encourage red squirrels and other animals to feed freely from a mixture of sunflower seeds, peanuts and hazelnut paste that the red squirrels found irresistible. The bait was replaced four times in 10 days. We then closed the doors and fitted them with 200g weights at one site and 240g at the other. We replaced the bait inside the hoppers three times in a week and recorded the weight of the bait eaten on each visit. The following week, we swapped the weights between each site and repeated the trial."
        },
        {
            "heading": 3,
            "text": "The results so far…"
        },
        {
            "text": "During the two-week trial, 16,000 photos and videos were taken of animals around the hoppers. The vast majority of these were of red squirrels, but we also recorded mice, stoats and small birds such as nuthatches, great tits and robins entering the hoppers while the doors were tied open."
        },
        {
            "text": "In both woods, the red squirrels quickly started to feed from the hoppers and when both door weights were added, they were visibly frustrated, swishing their tails in annoyance! However, some tenacious red squirrels persisted and managed to lift the doors. The only other species that managed to lift the weighted doors, with some struggle and on only a few occasions at one site, were stoats; though the video records suggested it is unlikely that they consumed the bait."
        },
        {
            "text": "We collected red squirrel coat colour data from hundreds of visits from different squirrels at both woods, which we will compare with grey squirrel colour data in future trials to determine whether colour could be used to exclude red squirrels from feeders containing contraceptives, while still allowing grey squirrels access."
        },
        {
            "text": "This study provided important benchmark data from which to progress our research into developing a feeder for grey squirrels only. We will continue with our work to exclude red squirrels from the hoppers, but this study has provided further evidence that we can exclude most UK wildlife using a simple and cost-effective design. In practice, this means the hoppers could be used safely in areas where there are no red squirrels, and therefore in most areas where grey squirrels occur."
        },
        {
            "text": "I very much enjoyed working on this study. It was lovely to be out in beautiful surroundings with people who are also passionate about red squirrel conservation. This was also a big personal milestone for me, as it was the final field trial planned for my PhD, which I am currently studying for part-time at Durham University and APHA. My thesis is based on the grey squirrel contraceptive project work and with the support of my tutor Giovanna Massei and the rest of my team at APHA, I have been able to collect a lot of good quality data in a relatively short time period. I aim to submit my thesis by October this year, the fourth year of my studies."
        },
        {
            "text": "Many thanks to the Wooler Red Squirrel Group and the volunteers at Otterburn for all their hard work during the trials, to the Woodland Trust for providing the funding for this study and the UK Squirrel Accord for their continued support."
        },
        {
            "heading": 3,
            "text": "How to report red squirrel sightings"
        },
        {
            "text": "If you are lucky enough to spot a red squirrel in one of the following key areas in the United Kingdom: Scotland, Northern Ireland, Northern England, and Northern and Mid Wales, please report sightings to the UK Squirrel Accord. Or for those happy to record other mammal sightings, you can download and use the Mammal Society app. Doing so will help conservation efforts as well as important population monitoring."
        }
    ]
}