{
    "url": "https://educationhub.blog.gov.uk/2022/01/how-becoming-a-cadet-can-improve-your-skills-and-qualifications/",
    "title": "How becoming a Cadet can improve your skills and qualifications",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-01-21T17:10:04+00:00",
    "content": [
        {
            "text": "Being in the cadets give young people access to an unparalleled range of activities. That’s why we’ve invested £50 million into the Cadet Expansion Programme, to increase the number of cadet units in schools across the country."
        },
        {
            "heading": 3,
            "text": "What are Cadets?"
        },
        {
            "text": "Cadets aims to inspire young people between 12 and 18 years old to challenge their limits, grow their abilities and go further in life."
        },
        {
            "text": "The Cadet Expansion Programme is part Government’s aim of promoting military ethos in schools; to inspire values in young people that will help them get the most out of their lives, and to contribute to their communities and country."
        },
        {
            "heading": 3,
            "text": "Who can be a Cadet?"
        },
        {
            "text": "The cadet experience is open to everyone, so whatever your nationality, background or ability, whether you're male or female. The Cadet Expansion Programme is available to people whose schools have an established cadet unit."
        },
        {
            "heading": 3,
            "text": "What can pupils gain from becoming a cadet?"
        },
        {
            "text": "There is a lot to be gained from becoming a cadet. From fun activities to meeting new people and competing in sporting events."
        },
        {
            "text": "Along with these activities, the cadet experience offers young people the opportunity to develop valuable personal abilities, build life skills like teamwork and resilience, and fosters confidence, loyalty and respect, and a sense of service to others."
        },
        {
            "text": "Cadets can gain nationally recognised qualifications, and the non-cognitive skills gained as a cadet can improve young people’s life chances and prepare them for the challenges and responsibilities of employment and adult life."
        },
        {
            "heading": 3,
            "text": "Are there any benefits to teachers and staff in the school?"
        },
        {
            "text": "It is also available to education staff who volunteer as Cadet Force Adult Volunteers. Staff have the chance to undergo leadership training and development, as well as specific activity training. Through this, they can gain nationally recognised qualifications, which enhance their life skills, and which can benefit the school."
        },
        {
            "heading": 3,
            "text": "But does it work?"
        },
        {
            "text": "Yes. Schools that have established cadet units have seen benefits for their young people, the school and the local community. They have seen improvement in attendance, behaviour, commitment, and relationships between staff and students."
        },
        {
            "text": "Headteachers have commented on the positive impact their cadet unit has had across the entire school and how their cadets provide excellent examples to the other pupils."
        },
        {
            "text": "The University of Northampton also conducted a four-year study into the social impacts of cadets. The key finding was participation in the Cadet Forces has particularly significant positive impacts on young people, particularly those from disadvantaged backgrounds."
        },
        {
            "text": "The full findings of the study can be found here: What is the social impact and return on investment resulting from expenditure on the Cadet Forces in the UK? Research Commissioned by the Ministry of Defence and conducted between 2016 - 2020 Final Report — University of Northampton's Research Explorer."
        },
        {
            "heading": 3,
            "text": "Are you currently doing anything to increase cadet numbers?"
        },
        {
            "text": "We are continuing to work with Ministry of Defence to help achieve the Government ambition of having 60,000 cadets in school cadet units by 2024."
        },
        {
            "text": "To help make this happen, we have committed £1.1 million of funding to English state-schools that have a cadet unit to help fund the cost of the unit’s School Staff Instructor to spend more time on cadet activities and tasks associated with the role."
        },
        {
            "heading": 3,
            "text": "So how do I get involved?"
        },
        {
            "text": "If your school has an established cadet unit please speak with your teacher to see how you can join the unit."
        },
        {
            "text": "Alternatively, there are several cadet forces sponsored by the Ministry of Defence. These can be found here: The Ministry of Defence cadet forces - GOV.UK (www.gov.uk)."
        }
    ]
}