{
    "url": "https://dluhcdigital.blog.gov.uk/2022/01/21/modernising-planning-software-in-collaboration-with-councils-and-suppliers/",
    "title": "Modernising planning software in collaboration with councils and their suppliers",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Land",
        "Digital Planning",
        "Local Digital",
        "Local Digital Declaration",
        "Local Digital Fund",
        "Local Digital Team",
        "PropTech"
    ],
    "pub_date": "2022-01-21T10:00:38+00:00",
    "content": [
        {
            "text": "Our digital planning software work is moving into a new phase of collaboration and delivery with Local Planning Authorities (LPAs) and software providers."
        },
        {
            "text": "We continue to build on the success of the Reducing Invalid Planning Applications (RIPA) and Back Office Planning System (BOPS) private beta launch, by announcing eight new councils that will join the programme."
        },
        {
            "text": "We are also excited to announce the eight councils leading new Pathfinder projects that will explore ways to enhance their planning services by working closely with existing software providers."
        },
        {
            "text": "A key focus of DLUHC's work to reform the planning system in England is to improve the software used by LPAs to support development management - the part of the planning ecosystem related to planning applications and decisions."
        },
        {
            "text": "Read on to find out which councils we are funding to improve digital planning software, and how you can follow their progress."
        },
        {
            "heading": 2,
            "text": "The story so far: funding councils to design new software"
        },
        {
            "text": "When a small group of councils came to us in 2019 to request funding to improve their planning services, the message was clear: there’s a lot more that modern technology could do to enable better local planning services that work for users."
        },
        {
            "text": "The RIPA and BOPS products were originally funded as two separate projects by the Local Digital Fund, involving the same three core partners: Buckinghamshire, Lambeth and Southwark Councils."
        },
        {
            "text": "2021 was a pivotal year for the department’s planning reform programme, and our digital planning work in particular. The RIPA and BOPS projects united around a shared goal to design an end-to-end beta service that could process live applications for Lawful Development Certificates (LDCs) - the piece of paper you need to say that your project does not require planning permission."
        },
        {
            "text": "As they worked towards a common goal, those involved in the projects combined into a joint project team. Additional funding has been provided to grow the team and to increase the number of councils contributing to and adopting the RIPA and BOPS products in 2022."
        },
        {
            "heading": 2,
            "text": "The successful LPAs joining the RIPA/BOPS project"
        },
        {
            "text": "Eight LPAs have successfully applied for DLUHC funding until the end of March 2023 via an Expression of Interest. The new LPA partners are:"
        },
        {
            "text": "The new partners will be onboarding to the project team in the next few months with the aim of launching a beta service for LDCs on their websites in the summer."
        },
        {
            "text": "LDC applications have been an excellent place to begin testing the products with live applications because they are entirely based on national planning legislation, common across England."
        },
        {
            "text": "Next, the team will look to develop functionality for applications for full planning permission - a more complicated challenge that depends on differing local planning policies."
        },
        {
            "heading": 2,
            "text": "Support for councils to enhance their planning software"
        },
        {
            "text": "We want all users of the planning system – from citizens, property developers, local authorities, as well as the tech market – to benefit from modern, intuitive and standards-based software tools, and existing software providers will play a vital role in realising this ambition through the continued development of the services they provide."
        },
        {
            "text": "Modern software will make applying for planning permissions more transparent and easier to understand for the public and planning professionals, and will allow local planning officers to work more efficiently by spending less time on admin and data processing tasks, and more time providing guidance and working on complex planning decisions."
        },
        {
            "text": "The data that drives this software will be able to benefit all aspects of the planning ecosystem and a broader network of products and services."
        },
        {
            "text": "With this vision in mind, the Development Management (DM) Software Pathfinder Expression of Interest invited LPAs to propose 12-week projects to enhance the software they currently use. This Pathfinder funding has been specifically provided to support LPAs who are eager to continue to work with their existing providers to enhance the software they are already using."
        },
        {
            "text": "The successful councils will work in close collaboration with their providers, following the principles of the Local Digital Declaration to ensure that user needs come first and that the outputs are reusable and shared openly with other LPAs."
        },
        {
            "text": "The project teams will consist of staff from both the council and the supplier, who will work through problems in a regular dialogue to generate a deeper understanding of the needs of the principle users."
        },
        {
            "text": "The emphasis of the Pathfinders will be on learning and iterating, and we’re excited to see what the projects produce over the next few months."
        },
        {
            "heading": 2,
            "text": "The successful Pathfinder projects to enhance existing planning software"
        },
        {
            "text": "The eight development management software Pathfinder projects are:"
        },
        {
            "heading": 3,
            "text": "Basingstoke and Deane Borough Council"
        },
        {
            "text": "Funds awarded: £58,000\nEnhancing data use and access for all, including reviewing and sharing practices with other LPAs. The project will pilot opportunities for better reporting of planning data using Microsoft Power BI."
        },
        {
            "heading": 3,
            "text": "Colchester Borough Council"
        },
        {
            "text": "Funds awarded: £150,000"
        },
        {
            "text": "Exploring ways customers can interact with live spatial geographic information system (GIS) data rather than static documents."
        },
        {
            "heading": 3,
            "text": "London Borough of Harrow"
        },
        {
            "text": "Funds awarded: £150,000"
        },
        {
            "text": "Ensuring that information submitted in the comment webform is automatically loaded into the relevant system so that the time taken to process consultee comments can be reduced."
        },
        {
            "heading": 3,
            "text": "London Borough of Havering"
        },
        {
            "text": "Funds awarded: £150,000"
        },
        {
            "text": "Exploring full integration of pre-application advice requests, payments and bookings with Development Management software and the connection of Management Information and SMS notification software to improve customer experience, disjointed business processes, and outdated reporting practices."
        },
        {
            "heading": 3,
            "text": "North Devon District Council"
        },
        {
            "text": "Funds awarded: £149,000"
        },
        {
            "text": "Exploring and linking of all SQL data and intelligence to address the problem of data duplication. This will improve efficiency by decreasing duplication, progress reporting, and ensure the council has a robust corporate database and can provide an improved service to users."
        },
        {
            "heading": 3,
            "text": "Nottingham City Council"
        },
        {
            "text": "Funds awarded: £114,000"
        },
        {
            "text": "Deriving more value from planning data through efficient and effective data publishing processes to improve reporting."
        },
        {
            "heading": 3,
            "text": "Sevenoaks District Council"
        },
        {
            "text": "Funds awarded: £150,000"
        },
        {
            "text": "Exploring and implementing solutions to improve access to Tree Preservation Order information, and submitting applications to carry out works to protected trees and notifications of works to trees in Conservation Areas."
        },
        {
            "heading": 3,
            "text": "Tewkesbury Borough Council"
        },
        {
            "text": "Funds awarded: £150,000"
        },
        {
            "text": "Exploring an open and standard way of exposing planning application data to provide progress updates to service users via a tracker, to address their concerns about a lack of information on progress or timescales for determining a planning application."
        },
        {
            "heading": 2,
            "text": "Follow our digital planning projects"
        },
        {
            "text": "The continued investment in local planning authorities reflects the department’s ambitions to modernise planning software. By working with the sector, we will enable the conditions for a more innovative market that uses planning data in new and exciting ways, and for better planning services that support faster, more accurate decision-making."
        },
        {
            "text": "The Pathfinder projects and the RIPA/BOPS team will give regular updates via Show and Tells and blog posts across the duration of their work."
        },
        {
            "text": "If you are interested in following their progress, please email DigitalPlanningTeam@communities.gov.uk so we can add you to the mailing list."
        }
    ]
}