{
    "url": "https://deframedia.blog.gov.uk/2022/01/21/new-legislation-reduces-time-and-cost-of-gene-editing-trials-for-researchers/",
    "title": "New legislation reduces time and cost of gene editing trials for researchers",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-21T13:29:09+00:00",
    "content": [
        {
            "text": "On Thursday 20th January, we announced that new legislation would be put in place to cut unnecessary red tape for gene editing research and development. This technology has great potential to help farmers grow more resistant, nutritious, and productive crops, within a fraction of the time traditional breeding methods permit."
        },
        {
            "text": "The announcement gained widespread coverage across broadcast, national and trade media titles; including a full report on ITV News at 10 , BBC Radio 4 Today and Farming Today programmes yesterday, as well as in the Daily Express, The Guardian and Farmer’s Weekly."
        },
        {
            "text": "The rule changes, made possible by the UK’s departure from the EU, will mean researchers across England will be able to undertake plant-based research using gene editing much more quickly and at a lower cost."
        },
        {
            "text": "The rules will apply to plants where gene editing is used to create new varieties similar to those which could have been produced more slowly through traditional breeding processes only. All scientists undertaking research with genetic technologies will have to continue to notify Defra of research trials."
        },
        {
            "text": "Minister for Agri-Innovation and Climate Adaptation Jo Churchill said:"
        },
        {
            "text": "“New genetic technologies could help us tackle some of the biggest challenges of our age – around food security, climate change and biodiversity loss."
        },
        {
            "text": "“Now we have the freedom and opportunity to foster innovation, to improve the environment and help us grow plants that are stronger and more resilient to climate change. I am grateful to the farming and environmental groups that have helped us shape our approach, and I look forward to seeing what we can achieve.”"
        },
        {
            "text": "Chief Scientific Adviser, Professor Gideon Henderson, said:"
        },
        {
            "text": "“Gene editing is a powerful tool that will help us make plant breeding more efficient and precise by mimicking natural processes that currently take many years to complete."
        },
        {
            "text": "“With the new rules now formally in place, scientists will be able to assess new crops in real-world conditions more easily.  This will increase our ability to harness the potential of gene editing to efficiently help grow plants that are more nutritious, beneficial to the environment, more resilient to climate change, and resistant to disease and pests.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}