{
    "url": "https://socialcare.blog.gov.uk/2024/10/21/change-nhs-your-chance-to-make-social-care-part-of-the-conversation/",
    "title": "Change NHS: your chance to make social care part of the conversation",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Innovation",
        "Workforce"
    ],
    "pub_date": "2024-10-21T12:34:33+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Generational opportunity"
        },
        {
            "text": "This week, the Department of Health and Social Care, in partnership with NHS England, launches the biggest national conversation about the state of the NHS in its 76-year history."
        },
        {
            "text": "Change NHS is a once in a lifetime opportunity for all of us, whatever our age, circumstance, or profession, to share our experiences, ideas, and concerns about the state of our health and care system. It’s our chance to make a difference and help shape its future."
        },
        {
            "text": "But what does the widest public engagement for a generation have to do with social care? The answer is: quite a lot. There can be no long term solutions to fixing the challenges facing the NHS without meaningful involvement from the care sector."
        },
        {
            "text": "As social care nurses and colleagues in wider care teams, we are dedicated to maximising good health and wellbeing and, where clinically appropriate, avoiding hospital admissions and supporting timely discharge."
        },
        {
            "text": "In cases where people are discharged from hospital back to residential or nursing care settings, or their own homes, we are there to support ongoing recovery. We do this by working with NHS community teams to maximise their independence for as long as possible."
        },
        {
            "heading": 2,
            "text": "Insights tested in the field"
        },
        {
            "text": "We already proved our worth alongside our equally dedicated NHS colleagues during the pandemic (working closely together to limit and minimise outbreaks and uphold the highest standards of infection prevention and control)."
        },
        {
            "text": "We also undertook enhanced roles to meet increased care needs. We can build from that experience with further opportunities generated through neighbourhood teams, helping us deliver care as close to home as possible."
        },
        {
            "text": "Likewise, our expertise in delegated healthcare activities, where regulated healthcare professionals, including nurses or occupational therapists, delegate healthcare interventions to care colleagues, continues to enhance the care experience as we look after the same people in different ways."
        },
        {
            "text": "This evolution in care and support fits well with the government’s desire to see three major ‘shifts’ in how healthcare is delivered in England: ‘from analogue to digital’, ‘from sickness to prevention’ and ‘from hospital to community’. Social care can be a strong and effective partner in all three."
        },
        {
            "text": "‘From hospital to community’, like the other shifts, is not a new aspiration, but I welcome its return, because it is arguably the place where our input as care professionals carries most weight."
        },
        {
            "text": "If we’re to improve our health and care system for care colleagues, residents, and patients, we need to understand why things don’t always work as smoothly as they could."
        },
        {
            "heading": 2,
            "text": "Ideas? We have plenty"
        },
        {
            "text": "What examples from our professional experience could make things work more effectively? Better communication is often the way to solve many workplace problems."
        },
        {
            "text": "We might recommend more timely pharmacy access, proactive discharge planning and other ways we can work with clinical counterparts to make sure residents and patients are cared for in the right place at the right time."
        },
        {
            "text": "How can we develop the incredible skills of our workforce to be the best care home nurse specialists and advanced practitioners they can be?"
        },
        {
            "text": "There is so much more we can do to avoid hospital admissions through activities like nurse prescribing, for example, halting deterioration of treatable conditions like UTI’s."
        },
        {
            "text": "End of life care, in both domestic and residential settings, is another area in which we excel. We should grasp this opportunity to share our learning across the care and health sectors."
        },
        {
            "text": "So, wherever care colleagues and people who use care services live and work, the campaign really wants to hear from you. Whether you have a little or a lot to say, it all matters, it all has value."
        },
        {
            "text": "While you can quickly and easily contribute online, more than 100 in-person events will be taking place nationwide, and the voice of social care will be welcome at all of them."
        },
        {
            "text": "I will be working closely with the new NHS England Chief Nursing Officer, Duncan Burton, to make sure social care nursing and wider care sector voices are heard loud and clear."
        },
        {
            "text": "Rest assured, your views will play a vital role in shaping the government’s 10-Year Health Plan to build a health and care system fit for the future."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "To find out how to give your views on the 10-Year Health Plan, visit Change.NHS.uk."
        }
    ]
}