{
    "url": "https://gds.blog.gov.uk/2024/10/21/how-gds-is-supporting-women-in-stem/",
    "title": "How GDS is supporting women in STEM",
    "authors": [
        "Laura Yarrow - Head of Design, GOV.UK, Government Digital Service"
    ],
    "categories": [
        "GDS team",
        "People and skills"
    ],
    "pub_date": "2024-10-21T10:49:24+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "text": "Here at the Government Digital Service, we're committed to gender equality throughout our workforce. So, it's crucial that we do our bit to make sure younger generations can take advantage of the fantastic opportunities that exist through careers in technology. "
        },
        {
            "text": "That’s why GDS recently hosted three students from Next Tech Girls (NTG), a social enterprise set up in 2016 that works with girls currently in education looking to work in STEM (Science, Technology, Engineering, Maths) careers. They especially focus on working with girls from lower income and minority backgrounds. "
        },
        {
            "text": "Next Tech Girls facilitates work placement and career opportunities for the students across a broad spectrum of organisations. Their mission is “to inspire today's girls in education to be tomorrow's women in tech”. As a woman who has been on that journey myself, I wanted to get involved to bring opportunities I didn’t have in the past to the next generation of female digital and technology specialists."
        },
        {
            "text": "In the UK, Next Tech Girls statistics show that there is currently a huge gender gap in STEM careers, with women severely underrepresented. Women are much less likely to enter into a STEM career path due to a number of factors. "
        },
        {
            "text": "This can range from the stereotypes of it being a predominantly male career path (I was one of the only girls on my own university computer science degree out of approximately 100, which was intimidating), issues with a lack of role models and visibility of women working in tech, to a lack of advocacy and support in school to pursue these types of careers in the first place. "
        },
        {
            "text": "This can mean girls are not able to make these choices at the critical time they are building the qualifications and knowledge needed to pursue a career in STEM."
        },
        {
            "heading": 2,
            "text": "Setting up the work placement"
        },
        {
            "text": "It was important for GDS to understand what the students wanted to get out of the work placement, so we met with the girls before our week together started to understand a bit more about them, their interests and background, and to make sure we were going to provide a good experience for them."
        },
        {
            "text": "We learnt that the students were especially interested in our individual career paths, what qualifications we each had, what helped us get to where we currently were in our career, and what a day in the life of different disciplines looked like, especially what it was like to work in a modern office environment. "
        },
        {
            "text": "Part of this was going to be about exposing the students to different STEM roles and activities, so it became important to assemble a set of people they could work with across a variety of roles. This led to putting together a team of designers, developers, delivery managers, data scientists, and leadership roles to spend some time throughout the week giving the students a variety of perspectives. "
        },
        {
            "text": "One of the principles of this project was to ensure the majority of the people speaking to the students were female, and we achieved that. 9 out of 10 of the staff involved were female, and could offer that unique perspective on their careers, challenges and approach to work to the students. "
        },
        {
            "text": "I also wanted to ensure we inspired the students, and to give them confidence that they can pursue any career they wanted to. Luckily at GDS we are not short of inspirational and accomplished women, who agreed to put together a timetable of immersive activities and learning."
        },
        {
            "text": "Our agenda was across an action-packed five days, which we divided up into a morning session, then lunch followed by an afternoon session that finished at 4pm. It was important to respect the time of our volunteers, but also give the students a bit of time to learn from people, then go off and complete some self-directed activities and tasks. The challenge here was not making it too much like the school environment, and exposing them in a safe way to a work environment where they had to use their initiative to develop their own skills."
        },
        {
            "text": "We kicked the week off with an introduction from myself to GDS and our unique history. I then gave a brief overview of my education and career to date, what I enjoyed and what I found a challenge. This format was used by most of our volunteers to give an insight into how different people approached their careers, followed by some hands-on activities and experience. I also set them a task for the week of summarising what they learned during their time with us, to present back on the Friday afternoon."
        },
        {
            "text": "A sample of the other sessions students attended were:"
        },
        {
            "heading": 2,
            "text": "End of the placement week"
        },
        {
            "text": "At the end of the week, we all convened to watch a presentation from the placement students. This was the highlight of the week for me, as not only was it an energetic presentation from the girls, but seeing the sheer amount of things they learned about and put into practice over such a short time that week was incredible. They told us they really enjoyed the week and have a good idea of what to do next to start out in their careers."
        },
        {
            "text": "As a team, it was also useful to hear feedback from the girls at the end-of-week session. It was great to hear that the students had a positive experience at GDS, and to know we now have the blueprint to offer this sort of work experience again. "
        },
        {
            "text": "We learned it was so important to have a strict agenda to stick to, to give confidence that the students would have a good mix of taught and self-directed learning, and to see the spread of disciplines and activities they would be doing. It was also useful to set up a Slack channel for all volunteers to keep in touch with, and in case of emergencies. "
        },
        {
            "text": "We learned it was important to be candid and talk about not just the surface elements of a career, but the deeper aspects such as challenges, pay and uniquely female experiences such as “what happens if I get my period at work?”. We had to remember that they weren’t familiar with many of the daily aspects of work we take for granted as experienced STEM professionals."
        },
        {
            "text": "One thing that was consistent between all volunteers was that nothing prepared us for how much we would enjoy this week. It was a thoroughly positive, fulfilling and uplifting experience to be part of a group of women supporting the next generation of girls leaving school to start their own careers. "
        }
    ]
}