{
    "url": "https://insidedvla.blog.gov.uk/2024/10/21/how-were-protecting-and-enhancing-biodiversity-at-dvla/",
    "title": "How we’re protecting and enhancing biodiversity at DVLA",
    "authors": [
        "Harry Harding"
    ],
    "categories": [
        "Features",
        "Sustainability"
    ],
    "pub_date": "2024-10-21T14:15:50+01:00",
    "content": [
        {
            "text": "Autumn is here! As we move into a season of falling leaves, foggy mornings and fireworks, we’re looking back on some of our key sustainability milestones of the year so far."
        },
        {
            "text": "From pollinating our crops to regulating the air that we breathe, the natural environment is crucial to our survival and it’s important to us that we do everything we can to preserve it. At DVLA we’re dedicated to protecting and enhancing biodiversity across the estate in line with our Greening Government Commitments (GGC)."
        },
        {
            "text": "Our Sustainability and Environment Manager, Harry Harding, takes us through our most recent initiatives to promote and protect biodiversity across our estate…"
        },
        {
            "heading": 2,
            "text": "No Mow May"
        },
        {
            "text": "Did you know that we’ve lost around 97% of wildflower meadows since the 1930s? This means that there’s much less pollen and nectar for pollinating insects to survive on – at DVLA, we’ve made a pledge to improve this!"
        },
        {
            "text": "Since 2021, DVLA has taken part in No Mow May, a campaign by Plantlife calling on all lawn owners not to mow during the month of May. The movement aims to increase areas of grass and wildflowers, benefitting wildlife, and even helping to reduce pollution."
        },
        {
            "text": "DVLA is a largely urban estate, but we’re lucky to enjoy green spaces which flourish in the springtime. We’ve allowed the green areas of our estate to thrive during this period, providing food for pollinators like bees and butterflies, which are critical to our ecosystems and way of life. Not only do our flourishing wildflower meadows support biodiversity, they also provide a calming space for staff to enjoy nature – it’s a win-win!"
        },
        {
            "heading": 2,
            "text": "Putting down roots"
        },
        {
            "text": "Planting various species of tree is essential for an environment rich in biodiversity. As part of our commitment, we’ve recently planted trees across our estate that are native species. These will boost the local ecosystem by providing habitat and berries for local birds. Some of the trees we’ve planted include:"
        },
        {
            "text": "These trees are DVLA’s legacy for local wildlife and will provide habitat for many years to come!"
        },
        {
            "heading": 2,
            "text": "Plan bee!"
        },
        {
            "text": "Bees are vital to our planet and essential for our survival. Unfortunately, our busy bees are reducing in numbers due to factors such as habitat loss, pollution and climate change."
        },
        {
            "text": "To support our bees, our Sustainability Team proudly maintain 2 bee colonies and are responsible for looking after the beehives, making sure the colonies stay healthy. Our bee colonies provide support to local meadow habitats by delivering pollination services."
        },
        {
            "text": "Our goal is for the colonies to become self-sufficient and produce enough honey to last through the winter months. No Mow May also greatly benefits the bees, as it provides them with plenty of wildflowers to pollinate and collect nectar from."
        },
        {
            "heading": 2,
            "text": "A flourishing future"
        },
        {
            "text": "To continue our efforts in protecting and enhancing the biodiversity of our estate, it’s important for us to meet the targets set out in our biodiversity action plan, which details our biodiversity objectives and how we’ll achieve them."
        },
        {
            "text": "To better understand the current condition of our estate, and how our initiatives are progressing, we use the services of qualified ecologists to conduct surveys to assess biodiversity at DVLA. Surveys include a preliminary ecological assessment, bat surveys, herpetofauna surveys and a tree survey."
        },
        {
            "text": "The plan also contains 6 specific habitat action plans (HAPS) and 5 specific species action plans (SAPS) which focus on species and habitats that are considered priorities by the Environment (Wales) Act 2016."
        },
        {
            "text": "We’re excited to begin working on DVLA’s next biodiversity action plan, covering 2025 to 2030. We’ll be looking at how we can manage our estate to increase biodiversity through habitat creation and protecting the species who already have a home on our estate. We’ll be paying a particular focus to species and habitats that have a protected status to make sure we’re doing everything we can to give them the best opportunity to flourish."
        },
        {
            "text": "Find out more about how DVLA is planning to increase biodiversity, and protect species and habitats across our estate in our biodiversity action plan."
        },
        {
            "text": "Follow DVLA on X, follow us on Facebook and connect with us on LinkedIn. You can also subscribe to the DVLA digital services blog."
        }
    ]
}