{
    "url": "https://nda.blog.gov.uk/my-experience-on-the-commissioning-graduate-programme-at-sellafield-ltd/",
    "title": "My experience on the commissioning graduate programme at Sellafield Ltd",
    "authors": [
        "Anouschka Van Mourik"
    ],
    "categories": [
        "Recruitment",
        "skills"
    ],
    "pub_date": "2024-10-21T13:01:38+01:00",
    "content": [
        {
            "text": "With a degree in electrical and electronic engineering and a keen interest in the nuclear sector, Anouschka knew Sellafield would be the best place for her to begin her career in the industry."
        },
        {
            "text": "That career has already seen her relocate from Sheffield to Cumbria and scooping the title of Sellafield Ltd Graduate of the Year."
        },
        {
            "text": "Our graduate programme is open to applications, meaning you can follow in Anouschka’s footsteps. Here are just a few of her career highlights as a graduate commissioning engineer at Sellafield."
        },
        {
            "heading": 2,
            "text": "I have helped to deliver world firsts"
        },
        {
            "text": "One of my graduate placements was with the commissioning team for the Pile Fuel Cladding Silo. This is one of the most interesting and demanding projects in the engineering sector."
        },
        {
            "text": "Here, I got to engage with the day-to-day operation on plant, and experience cutting-edge technology intersecting with one of the oldest nuclear stores in the world."
        },
        {
            "text": "It was a privilege to be part of the team that achieved the first waste retrieval from the silo. In doing so, I know that I’ve made a meaningful difference to progressing Europe’s largest and most complex environmental restoration challenge. There aren’t many people that can say they’ve done that straight out of university!"
        },
        {
            "heading": 2,
            "text": "I have contributed to major infrastructure projects"
        },
        {
            "text": "As well as working on one of the oldest parts of the site, I also got to work on the early commissioning phase of one of our major infrastructure projects – the Sellafield Product and Residue Store Retreatment Plant. Delivered through the Programme and Project Partners (PPP), the project is integral to ensuring the safe long-term storage of special nuclear materials on the Sellafield site."
        },
        {
            "text": "The complexity and scale of the project exposed me to the importance of the Sellafield mission which made the work I did incredibly fulfilling. It showed me the importance of multiple disciplines working collaboratively. With the revolutionary delivery model of the PPP, it also gave me a unique experience of working in integrated teams with the supply chain. This helped my professionally development as I was exposed to multiple company practices, cultures, and procedures."
        },
        {
            "heading": 2,
            "text": "I have had the support to be the best nuclear professional I can be"
        },
        {
            "text": "Being part of the Sellafield graduate scheme provides you with lots of opportunities for chartership, training and certifications. The programme pushes our development and keeps us accountable to ensure we get the best out of roles."
        },
        {
            "text": "These opportunities have given me the foundation to become a leading nuclear professional in my future career."
        },
        {
            "heading": 2,
            "text": "I have built a network within the industry"
        },
        {
            "text": "One of my biggest achievements outside of my usual ‘day job’ was the opportunity to compete in the final of the Nuclear Institute’s Young Generation Network (YGN) speaking competition. It was a challenging and transformative experience."
        },
        {
            "text": "I had the opportunity to discuss a topic I am passionate about - driving gender equality and diversity in the nuclear industry - whilst honing my public speaking skills."
        },
        {
            "text": "The competition allowed me to engage with fellow young nuclear professionals and senior leaders from around the UK."
        },
        {
            "text": "It was a rewarding experience that not only broadened my understanding of nuclear energy and decommissioning but strengthened my confidence as a speaker and advocate of the nuclear industry."
        },
        {
            "heading": 2,
            "text": "I have inspired others to pursue careers in Science, Technology, Engineering and Mathematics (STEM)"
        },
        {
            "text": "I am incredibly passionate about improving gender equality and social mobility across STEM and other areas. Sellafield has provided me with a platform to pursue this passion via our STEM ambassador programme."
        },
        {
            "text": "In this role, I have volunteered at STEM outreach events, mentored year 6 students at a local primary school in a Lego league challenge, and have been both a resource lead and volunteer of the Elements innovative work awareness programme for STEM careers."
        },
        {
            "text": "By inspiring the next generation to consider a career in STEM, I know I’ve made a positive impact in improving diversity in the future not just for Sellafield Ltd, but also our sector. It has been one of the highlights of the graduate programme."
        }
    ]
}