{
    "url": "https://defrafarming.blog.gov.uk/2024/10/21/new-rules-for-fair-milk-contracts-supporting-dairy-producers-in-england/",
    "title": "New rules for fair milk contracts: supporting dairy producers in England ",
    "authors": [
        "Richard Thompson"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Guest post"
    ],
    "pub_date": "2024-10-21T12:11:04+01:00",
    "content": [
        {
            "text": "Poor contractual relationships and unclear or unfair terms between producers and processors can affect farmers' ability to budget, manage price volatility, invest in their businesses and innovate. "
        },
        {
            "text": "To address these issues in the dairy supply chain, new regulations were introduced this year to ensure fairer contract practices. These changes, which follow a consultation, aim to help dairy producers thrive while allowing processors and retailers to better serve their customers. "
        },
        {
            "text": " The Fair Dealings Obligations (Milk) Regulations (FDOM24) set out the rules for how milk purchase contracts must operate. FDOM24 is designed to make these contracts fairer and more transparent across the dairy industry. "
        },
        {
            "text": "To enforce FDOM24, a new Agricultural Supply Chain Adjudicator (ASCA), Richard Thompson (pictured above) was appointed. "
        },
        {
            "text": "In this guest post, Richard shares insights into his role and what to check in your contract. "
        },
        {
            "text": "I was proud to be appointed as the ASCA this year. Over the past few months, I have been welcomed by dairy producers and purchasers alike — both virtually on introductory calls and in person at dairy shows, on dairy farms and at milk processing facilities. "
        },
        {
            "text": "A huge amount of hard work and dedication goes into putting milk products on tables and I’ve been struck by the commitment of both dairy producers and processors to get things right under FDOM24 to improve transparency and fairness in the supply chain.  "
        },
        {
            "text": "Over the course of just a few months, these experiences have given me confidence that, by working together, we can improve the dairy supply chain without creating significant burdens or generating animosity in the process.  "
        },
        {
            "text": "By setting out my approach to enforcement in this post, I hope to reassure you of this. And, if after reading this post, you’d like to learn more or leave a comment, please do.  "
        },
        {
            "heading": 2,
            "text": "FDOM24 and making a complaint "
        },
        {
            "text": "For those of you who aren’t yet familiar with FDOM24, I’ll give quick overview.  "
        },
        {
            "text": "FDOM24 covers the direct purchase of cow’s milk from a farm by a business purchaser — so, from farm gate to dairy processor or manufacturer.  "
        },
        {
            "text": "These new rules make sure both purchasers and producers know their rights and responsibilities under milk purchase contracts. "
        },
        {
            "text": "In summary, contracts must now be in writing, signed, and include clear terms about pricing, how long the contract lasts, how it can be ended, and how disputes will be settled. "
        },
        {
            "text": "If you’re a dairy producer or purchaser, any new milk purchase contract you make after 9 July 2024 must comply with the rules. And by 9 July 2025, all contracts — new and existing — must meet these standards. "
        },
        {
            "text": "A primary part of my role as the ASCA is to ensure purchasers understand and comply with FDOM24 and producers know how to raise a complaint with my office. "
        },
        {
            "text": "A producer can make a complaint if: "
        },
        {
            "text": "If I find there’s been a breach, I can impose a fine of up to 1% of the purchaser’s turnover and/or make them compensate the producer. "
        },
        {
            "text": "We’ve published full guidance on the regulations, my enforcement role, and how to make a complaint on GOV.UK. "
        },
        {
            "text": "I know making a formal complaint can feel overwhelming for producers, especially for small, local businesses. My goal is to make the process as open and accessible as possible. "
        },
        {
            "text": "I want everyone — whether a producer or a purchaser — to get a fair, prompt, and empathetic service where we can reach resolution as quickly and easily as possible.  "
        },
        {
            "heading": 2,
            "text": "Influencing positive behaviour change in the dairy industry "
        },
        {
            "text": "My role isn’t just about formal complaints. It’s about improving fairness and transparency in the supply chain. This means raising awareness about what’s working well — and what’s not — in the dairy market. It’s about encouraging best practice and influencing positive behaviour change. "
        },
        {
            "text": "That’s why ongoing engagement with dairy producers, purchasers, and other stakeholders is so important. By being a trusted, authoritative voice on what’s happening in the dairy supply chain, my aim is to be able address issues early and encourage positive changes before complaints even happen. "
        },
        {
            "text": "As part of this, I welcome the opportunity to meet with you and understand issues with your milk purchase contract from your perspective.  "
        },
        {
            "text": "While I won’t hesitate to use my enforcement powers when needed, I hope we can achieve a lot by working together to prevent problems from arising in the first place. "
        },
        {
            "text": "If you have any questions about this work after this post or the guidance on GOV.UK do leave a comment below. "
        },
        {
            "text": "Or, if you would like to get in touch with the ASCA, please get in touch via the ASCA mailbox: asca@defra.gov.uk "
        }
    ]
}