{
    "url": "https://moderncivilservice.blog.gov.uk/2024/10/21/office-for-national-statistics-statistics-for-the-public-good/",
    "title": "Office for National Statistics: Statistics for the Public Good",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-10-21T15:57:57+01:00",
    "content": [
        {
            "heading": 6,
            "text": "A guest blog from the Office for National Statistics (ONS)."
        },
        {
            "text": "At the Office for National Statistics, we know that people have a lot of questions when it comes to their personal information being used. Our research has told us that while people understand that providing data is part of modern living, there is low awareness about who collects data, what the data is used for, and how their data is anonymised and kept secure."
        },
        {
            "text": "Across government, we produce many statistics on every aspect of society, from the cost of living to changes in wildlife populations. We know that to build public trust in our use of their data for statistics, everyone should know how their data is sourced, used, and how it’s kept safe."
        },
        {
            "heading": 2,
            "text": "Bringing data to life"
        },
        {
            "text": "Our new webinar series, ‘Bringing data to life’, is an opportunity for anyone to learn more about the life cycle of statistics. We’re working in collaboration with other government departments and agencies to present a monthly engaging interactive series to keep people informed on how their data is used."
        },
        {
            "text": "We’re reaching out to members of the public to invite them to register for the event, but this is also a perfect chance for you to learn more about the work that we and other official statistics producers are doing."
        },
        {
            "text": "You can find out more and sign up for the events on Eventbrite. The first four webinars for Autumn 2024 are:"
        },
        {
            "text": "Each webinar will be recorded and available for anyone to view later on the ONS website. The remaining eight topics will take place throughout 2025 and will explore statistics on the following:"
        },
        {
            "text": "Together, we can bring data to life and show how statistics can be used to help us make better choices and improve our society."
        },
        {
            "heading": 2,
            "text": "Engaging the public on data"
        },
        {
            "text": "The webinar series is part of our wider, ongoing efforts to engage the public on the use of their data for statistics. We’ve launched a programme of communications activities that can be shared with your audiences, including video content and education resources."
        },
        {
            "text": "The aim of these resources is to improve people's understanding of data and the impact statistics can have in helping organisations make better informed decisions."
        },
        {
            "text": "We have created:"
        },
        {
            "text": "All of these resources are free and available on our website. Our communications toolkit contains materials that you can share on your own communication channels. "
        },
        {
            "text": "If you would like more information on our range of resources to engage the public, please contact us at engagement.hub@ons.gov.uk. We welcome any feedback you have on our resources or ideas for future webinars."
        }
    ]
}