{
    "url": "https://educationinspection.blog.gov.uk/2024/07/17/changes-to-ungraded-inspections/",
    "title": "Changes to ungraded inspections",
    "authors": [
        "Lee Owston, National Director Education"
    ],
    "categories": [
        "deep dives",
        "education inspection framework",
        "inspection",
        "schools"
    ],
    "pub_date": "2024-07-17T11:32:20+01:00",
    "content": [
        {
            "text": "In this blog, we’ll talk you through the changes we will be making to ungraded inspections in the autumn term. You may already be aware of these changes from the announcements that Sir Martyn Oliver made in his speech to the NAHT in May and I am sorry we have not been able to provide further information sooner."
        },
        {
            "text": "In his speech, Sir Martyn talked about the importance of professional dialogue between the inspection team and school leadership during inspections. The emphasis of ungraded inspections will be on providing school leaders with opportunities to demonstrate where they have improved and to discuss where they still have work to do. Because of this, we have announced that from the autumn term onwards, we will no longer carry out deep dives during ungraded inspections."
        },
        {
            "text": "So, what will ungraded inspections look like now? And how do we know this approach will work?"
        },
        {
            "heading": 3,
            "text": "Trying out the new approaches"
        },
        {
            "text": "Since the announcement, we’ve been working on what ungraded inspections will look like in practice. To make sure that we get this right, we asked some of you to be involved. I’d like to thank those of you who offered up your time to give us your honest feedback and who invited us into your schools to help us check whether we were on the right lines. This has made us even more confident that these changes are for the better."
        },
        {
            "text": "So, what did we do? First of all, we spoke to some school leaders about what we were planning to change. Then we went to a range of schools to try out parts of the inspection or do a ‘walk through’ of a whole inspection. At each point, we’ve taken feedback both from school leaders and our inspectors about what is working well, and have changed things along the way. As we have said since the beginning of this year, we’re serious about listening, serious about acting and serious about improving. And from these valuable discussions, we’ve now got our new way of working ready to go in the autumn term."
        },
        {
            "heading": 3,
            "text": "How will a new ungraded inspection begin?"
        },
        {
            "text": "As you would expect, the day before the on-site inspection begins, we’ll have an extended phone conversation with you. This phone call is about working out what we need to do during the on-site inspection to get the evidence we need."
        },
        {
            "text": "In this call, the headteacher will be able to talk to the lead inspector about some of the things that really matter in their school. They will discuss the school’s context, the things that the school does well and the things that have improved since the last inspection. And there will be the chance to discuss anything that leaders still need to tackle to make the school the best it can be. Of course, this call doesn’t need to be just with the headteacher. In fact, we’d actively encourage headteachers to have someone else with them, or indeed a few of the senior team, who can all contribute to this important conversation."
        },
        {
            "text": "The lead inspector will have done some preparation before this call, and will have some questions to ask leaders. These might come from the data they’ve seen in the IDSR or from looking at the school’s website and previous inspection report."
        },
        {
            "text": "Through this conversation, the lead inspector will agree with the headteacher several areas of focus for the inspection. These will take account of things that the inspector wants to look at and things that are particularly important to the school – for example something the school has been working on, or something related to its particular context."
        },
        {
            "heading": 3,
            "text": "What will ungraded inspections look like when inspectors are in school?"
        },
        {
            "text": "The areas of focus will influence what inspectors do when they’re in school. At least a couple of these areas will be related to the quality of education, as you might expect. But they won’t focus on one subject and they won’t be deep dives. Instead, inspectors will look at a group of subjects together. So, in a primary school, they’re likely to look at early English and early mathematics together as a group so they can make sure that schools are getting these important basics right. Or they might look at a group of subjects from the wider curriculum. In a secondary school, there could be a focus on the core subjects and another focus on, for example, vocational subjects. We might focus on a specific aspect across these subjects. For example, perhaps a school has been working on improving assessment. We might then go with the headteacher or another senior leader to visit lessons in a group of subjects and discuss the impact of this new assessment work."
        },
        {
            "text": "And there will usually be one or two other areas of focus too. These might be related to personal development, behaviour, attendance, or something that includes all of these. Again, these will be decided during the initial phone conversation and will be tailored to the school."
        },
        {
            "heading": 3,
            "text": "What will ungraded inspections feel like?"
        },
        {
            "text": "We have been transparent about the fact that some of the conversations we have during ungraded inspections may be challenging, but these changes will allow for a proper conversation between professionals about the school’s strengths, and its areas for improvement."
        },
        {
            "text": "We’re also aiming to reduce the burden on subject leaders. Headteachers and senior leaders have said that they sometimes feel out of the loop with deep dives because they’re not part of that process. But headteachers and senior leaders will be central to the new ungraded inspections. These inspections will focus more on a dialogue between headteachers and their senior leaders. So, while we will still want to have conversations with subject leads, they won’t be as intensive."
        },
        {
            "text": "Other elements of inspection, including the framework and inspection methodology are not changing."
        },
        {
            "heading": 3,
            "text": "When will we find out more details?"
        },
        {
            "text": "We’ll be publishing the new inspection handbooks in September this year and we’ll produce some informative videos for schools that will expand on the information we’ve given you here. We hope that these will be helpful to you. We’ll release more details about these webinars in due course, so please do look out for them."
        },
        {
            "text": "In the meantime, enjoy a well-deserved break and thank you for all the work that you do to improve the lives of children and young people, day in, day out."
        }
    ]
}