{
    "url": "https://environmentagency.blog.gov.uk/2024/07/17/farmers-protect-yourselves-from-waste-criminals/",
    "title": "Farmers – Protect yourselves from waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2024-07-17T15:31:00+00:00",
    "content": [
        {
            "text": "A wet winter has meant it’s been a difficult start to the year for many farmers. Facing reduced early crop yields or worse still, zero yields, the temptation to cut costs or diversify, to find additional income is more tempting than ever."
        },
        {
            "text": "Unfortunately, this makes farmers an ideal target for unscrupulous waste operators who are more than willing to take advantage of people under greater financial pressure. Whether it is an offer of a “cheap tip” of materials that can be used to repair roads and tracks or an agreement to secure land for spreading or storage of materials in farm buildings."
        },
        {
            "text": "These activities aren’t necessarily illegal in themselves, but they should “raise a red flag” and prompt you to ask more questions and make more checks than you might do ordinarily."
        },
        {
            "text": "Waste crime costs the economy in England an estimated £1 billion a year so remember - if it’s sounds too good to be true, it’s probably something that will cost you more in the long run!"
        },
        {
            "text": "Be wary of offers to tip “excess or leftover materials” – this is almost certainly a waste and will need some kind of authorisation before it is deposited."
        },
        {
            "text": "If someone wants to rent a building to store materials, make appropriate checks to confirm who you’re dealing with. Ask what materials they want to store and check regularly to make sure that is what they are storing. Be warned, criminals have filled warehouses in a single weekend and walked away leaving landowners with removal costs running into the millions!"
        },
        {
            "text": "Restrict access points to your land to make it difficult for large plant and equipment to enter without your permission."
        },
        {
            "text": "Do not pay any money up front or agree to tipping outside of normal daytime operating hours. Make sure someone is present whenever materials are deposited and indicate that vehicles used, may be photographed and registration numbers recorded as added assurance."
        },
        {
            "text": "Do you use a land agent? If so, how clued up on what the rules and regulations are around handling, storing and depositing waste are they? Do they know what questions to ask to determine whether a material is waste or non-waste – it’s not as straight forward as you might think."
        },
        {
            "text": "If an operator claims the material on offer is not a waste, ask them where it’s come from and how it has come about. As a rule of thumb, if it has been removed from somewhere, it is surplus to requirements or it has been through some kind of sorting or treatment process (such as crushing) it’s safer to assume it is a waste. There is a complex process to turn a waste back into a non-waste which requires operators to provide customers with evidence that it meets the relevant Quality Protocol (QP). Ask for this QP evidence up front and don’t accept technical sounding responses as to why it’s not needed. Asking for the QP evidence makes you sound like you’re aware of the rules and as such, makes you less desirable and less likely to become a victim of waste crime."
        },
        {
            "text": "Taking these precautions could mean you lose out on an opportunity to cut costs but it’s more likely you’ve just saved yourself thousands (if not tens of thousands) of pounds worth of clean-up costs or worse!"
        },
        {
            "text": "You can always contact us for further advice: call 03708 506 506 or email: enquiries@environment-agency.gov.uk"
        }
    ]
}