{
    "url": "https://socialcare.blog.gov.uk/2024/07/17/welcoming-a-new-government-and-what-this-means-for-adult-social-care/",
    "title": "Welcoming a new Government and what this means for adult social care",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Diversity",
        "LGBT+ awareness",
        "LGBTQ+",
        "Uncategorised"
    ],
    "pub_date": "2024-07-17T15:20:50+00:00",
    "content": [
        {
            "text": "The votes have been cast and the country has spoken. The new Government is now busy setting out its priorities and future direction as set out in its election manifesto."
        },
        {
            "text": "As a sector, adult social care will be adjusting to new ways of thinking, as together we get to know how the new ministerial team likes to work. This means huge change and an inevitably busy summer as we seek to build new relationships and agree a way forward."
        },
        {
            "text": "What is already clear for social care is an appetite for a bold, ambitious and challenging agenda lead by Minister for Care, Stephen Kinnock in Secretary of State for Health and Social Care, Wes Streeting’s team. I am very much looking forward to working with them and flying the nursing and care workforce flag."
        },
        {
            "text": "The focus in the coming months will be supporting the new ministerial team to visit a variety of care settings, formulate plans and brief them on the critical issues needing swift action."
        },
        {
            "text": "A new energy brings a buzz to the Department of Health and Social Care and my colleagues here are bracing themselves for a fast and furious year ahead. I am excited to continue my efforts to keep the social care agenda centre stage."
        },
        {
            "heading": 2,
            "text": "Recent activities"
        },
        {
            "text": "Upon the general election being called six weeks ago, there began a period of intense planning and briefing preparation for the incoming government. During this time, I had the pleasure of visiting various care settings around the country and presenting gold   to the following colleagues:"
        },
        {
            "text": "Congratulations again to all nominees for their achievements and for being an inspiration to the care sector."
        },
        {
            "text": "It was fantastic to celebrate Philippines Independence Day in London with the Philippine Ambassador, Teodoro Locsin Jr. At this event, we discussed the importance and benefits of international recruitment. We were joined by nursing colleagues from both NHS and social care services."
        },
        {
            "text": "Care Home Open Week was another success this year and I was able to meet colleagues and celebrate the fantastic care and support they provide."
        },
        {
            "text": "I took some of my colleagues to St Monica Trust’s Chocolate Quarter care complex in Bristol and saw fantastic integrated services. I was also pleased to make visits to care homes in Sussex and Hertfordshire."
        },
        {
            "text": "In all these settings, I met great people doing great things. These interactions never fail to gladden my heart and remind me and those I work with why careers in social care can be so exciting, challenging and rewarding."
        },
        {
            "text": "I was able to wave off the first ever social care group to represent the care sector at Pride London. Organised by The Outstanding Society, 140 people, representing colleagues from various roles and people who use services, came together to be part of the buzz and celebrations."
        },
        {
            "text": "All in all, it’s been an exciting few weeks celebrating the great and the good of the sector, whilst also looking forward to a new era of collaboration with ministers as, together, we recommit to supporting, enhancing and growing this amazing profession."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Keep updated on adult social care announcements including news, policy updates and events via our monthly newsletter."
        },
        {
            "text": " "
        }
    ]
}