{
    "url": "https://ukhsa.blog.gov.uk/2024/07/17/what-is-rsv-and-is-there-a-vaccine/",
    "title": "What is RSV and is there a vaccine?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2024-07-17T00:01:20+01:00",
    "content": [
        {
            "text": "Respiratory syncytial virus (RSV) is a major respiratory virus that is common over the winter period, typically November to February. While the symptoms are mild for many, RSV accounts for around 30,000 hospitalisations of children under 5 in the UK annually, and for 20 to 30 infant deaths."
        },
        {
            "text": "RSV can also be severe in older adults, causing pneumonia and flare-ups of existing lung disease and other long-term conditions. It causes around 9,000 hospitalisations in those aged over 75 in the UK each year. "
        },
        {
            "heading": 2,
            "text": "Who is at risk?"
        },
        {
            "text": "RSV can be especially dangerous for infants and the elderly."
        },
        {
            "text": "RSV is most common in infants under 1 year old. Babies are particularly vulnerable to RSV lung infections as they have small airways and have limited immunity against the virus which can lead to a condition called bronchiolitis that causes inflammation in the lung."
        },
        {
            "text": "Infants with severe bronchiolitis may need intensive care and the infection can be fatal. Older adults can also be at risk of severe RSV lung infections, and the virus is a cause of illness and mortality in people aged 75 years and older.   "
        },
        {
            "heading": 2,
            "text": "The symptoms of RSV"
        },
        {
            "text": "RSV may cause a cough or a cold, wheezing, shortness of breath, tiredness and fever. Most cases are not serious and clear up within 2 to 3 weeks. You can find out more about the symptoms of RSV on the NHS site."
        },
        {
            "text": "RSV can also cause bronchiolitis in infants, which can make it difficult to breathe and feed. RSV bronchiolitis symptoms may include difficult, fast or noisy breathing and being unsettled or difficult to comfort."
        },
        {
            "heading": 2,
            "text": "RSV vaccination"
        },
        {
            "text": "From August 2024 in Scotland and September 2024 in England, Northern Ireland and Wales, pregnant women at week 28 or later and everyone aged 75 to 79 or turning 75 years old on or after the 1 September will be offered a vaccine to protect themselves or their babies against Respiratory Syncytial Virus (RSV)"
        },
        {
            "heading": 2,
            "text": "How can I protect my baby from RSV?"
        },
        {
            "text": "The best way to protect babies against RSV infection is for the mother to have the vaccine during pregnancy. Vaccination reduces the risk of severe RSV lung infection by around 70% in the first six months of life."
        },
        {
            "text": "The vaccine boosts the pregnant woman’s immune system to make antibodies that can fight RSV infection. These antibodies then pass through the placenta to help protect the baby from birth."
        },
        {
            "text": "The vaccine is offered from week 28 of pregnancy, often by maternity services. If you haven’t been offered the vaccine around the time of your 28-week antenatal appointment, contact your maternity service to make an appointment. Having the RSV vaccine in week 28 or within a few weeks of this gives the best protection for the baby, including if they are born early."
        },
        {
            "text": "Having the vaccine later in the pregnancy will still provide some protection from infection and reduce the risk of spreading infection to the newborn baby. If it wasn’t possible to have a dose earlier, it can be given right up until you have the baby. "
        },
        {
            "heading": 2,
            "text": "Is more than one dose of RSV vaccine needed?"
        },
        {
            "text": "Pregnant women should have the RSV vaccine in every pregnancy – this will give your new baby the best protection."
        },
        {
            "text": "In older adults, a single dose is expected to give good protection for a few years. A single dose of vaccine will help to boost protection as you reach an age group at highest risk of serious RSV infection."
        },
        {
            "heading": 2,
            "text": "Preventing the spread of RSV"
        },
        {
            "text": "RSV can spread through coughs and sneezes."
        },
        {
            "text": "You can help to prevent the spread of the virus by covering your mouth and nose when you cough or sneeze (ideally with a tissue, or else into the bend of your elbow), and you can wash your hands with warm soapy water frequently to kill the germs."
        },
        {
            "text": "If you have symptoms that could be RSV you should try and avoid young babies. It is perfectly okay for parents to ask people with colds to keep away from newborn babies, particularly in the first few months, and for babies born prematurely."
        },
        {
            "text": "Even with these measures it can be difficult to avoid RSV infection."
        }
    ]
}