{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/29/coverage-of-our-transformative-funding-to-communities-across-south-tyneside/",
    "title": "Coverage of our transformative funding to communities across South Tyneside",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Communities"
    ],
    "pub_date": "2025-07-29T16:23:36+01:00",
    "content": [
        {
            "text": "On Monday 28th July, the Minister for Local Growth, Alex Norris, visited projects in South Shields and Hebburn set to benefit from the transformative £20 million Community Regeneration Partnership developed with residents, community groups, local businesses and leaders."
        },
        {
            "text": "People across South Tyneside will see bustling high streets, revived community assets and more job opportunities as new plans are announced to deliver local growth and boost prosperity for residents, as promised in the Plan for Change."
        },
        {
            "text": "Buzzing from the Lionesses historic victory at the Euros the night before, local media joined the Minister at Hebburn Football Club, set for a £2 million investment to upgrade pitch quality, build a new education space and community building and extend the car park to get more fans on pitch side and bring the community together."
        },
        {
            "text": "The £20 million package was welcomed by local media The Newcastle Chronicle and The Shields Gazette. The Gazette and the Chronicle (page 7) both ran in-depth pieces on the funding for Hebburn FC set to inspire a new generation of footballers in the community, including a video interview here and local Bauer Radio stations carried the Ministers words welcoming the Lionesses inspiring win."
        },
        {
            "text": "The Minister also visited South Shields town centre which is set to be transformed with over £9 million going into making King Street and the market into a thriving space for culture, shopping, work and socialising. More pedestrian paths, enhanced greenery, removal of street clutter, tackling empty shops and investment in safety measures like more street lighting, too boost footfall, get locals back on their high street and grow the local economy."
        },
        {
            "text": "Minister for Local Growth Alex Norris said:"
        },
        {
            "text": "“South Tyneside is a region of huge potential, but like many other parts of our country, people in these communities have often been over-looked and not benefitted from the same level of investment as elsewhere. "
        },
        {
            "text": "“We are determined to spread growth and investment more fairly across the country, getting residents involved in the decision making so communities can take back control of their futures."
        },
        {
            "text": "“This funding is part of our wider Plan for Change that is already providing more opportunities, growing local economies and delivering better public services across the UK.”"
        },
        {
            "text": "Cllr Tracey Dixon, Leader of South Tyneside Council, said:"
        },
        {
            "text": "“We’re delighted to welcome this vital investment and are pleased that government has recognised the huge opportunities here in South Tyneside to improve people’s lives. The funding will help us deliver real benefits for our communities, revitalising our town centres in Hebburn and South Shields, boosting local pride and increasing footfall."
        },
        {
            "text": "“These projects will create more vibrant, welcoming and secure environments. We’re especially pleased to be able to invest in improved facilities at Hebburn Football Club, which plays such an important role in our local community, inspiring young talent and bringing people together. The funding will also help us to build on the success of key initiatives such as the South Tyneside Pledge and our partnership work with schools to tackle child poverty.”"
        },
        {
            "text": "Stephen Rutherford, Hebburn Town Football Club Chief Executive said:"
        },
        {
            "text": "\"On behalf of Hebburn Town FC I'd like to thank the Minister for Local Growth, his office and our local MP Kate Osborne for the hard work and support they have provided in securing this funding that will be transformational for the football club, our town and the wider community we support."
        },
        {
            "text": "“This is a magnificent milestone in providing a lasting legacy of sport and exercise within the town of Hebburn and surrounding areas with state-of-the-art facilities proposed to be developed.\""
        }
    ]
}