{
    "url": "https://moderncivilservice.blog.gov.uk/2025/07/29/supporting-our-line-managers-for-a-civil-service-that-delivers/",
    "title": "Supporting our line managers for a Civil Service that delivers",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-07-29T11:11:55+01:00",
    "content": [
        {
            "text": "Supporting effective line management is vital for thriving organisations. Line manager effectiveness directly impacts our ability to serve the public and deliver on the government’s priorities, such as the focus on the productive and agile state and the Plan for Change."
        },
        {
            "text": "This is the focus of the Line Management Capability (LMC) programme which has the Civil Service Code and values at its heart. It aims to develop people who can manage with confidence and empathy, enabling staff to perform at their best, supporting their wellbeing and building effective and inclusive teams. Over the past eighteen months we have introduced a series of development and capability products to support line managers."
        },
        {
            "heading": 2,
            "text": "New interactive Line Management Development Tool"
        },
        {
            "text": "The recently launched Line Management Development Tool is one supporting resource available for line managers and a great example of collaborative working, with many departments contributing to its development. This interactive tool allows line managers to benchmark their skills to the Line Management Standards, generating personalised reports along with tailored training recommendations."
        },
        {
            "heading": 2,
            "text": "Other line management resources"
        },
        {
            "text": "The Civil Service Line Management Standards is an innovative framework that provides the foundation for all line management resources. The Standards bring consistent expectations of line management across the Civil Service, providing a pathway to enhanced engagement, performance, and productivity for teams."
        },
        {
            "text": "The Line Manager Induction Programme is designed for new line managers to help them understand their responsibilities and what they can expect from their own leaders. This is also a useful course as a refresher for existing line managers."
        },
        {
            "heading": 2,
            "text": "Leadership development for senior managers"
        },
        {
            "text": "This month marks another milestone with the launch of the Accredited Pathway for Senior Civil Service (SCS) line managers. Senior Civil Servants (SCS) play a crucial role in modelling exemplary management practice. Developed in partnership with the University of Leeds, the Accredited Pathway supports and equips SCS1 managers with honing their essential skills for effective leadership. Successful participants receive a university-accredited certificate and Chartered Management Institute Level 7 Chartered Manager status - recognition of their expertise and commitment."
        },
        {
            "heading": 2,
            "text": "Cross-government collaboration drives success"
        },
        {
            "text": "These resources are products of successful cross government collaboration."
        },
        {
            "text": "Carol Bernard, Executive Director for Line Management Capability, who leads the programme, echoed this sentiment: “I’m delighted to see how many departments have engaged with the Line Management Standards over the last year. With the recent launches of both the Line Management Development tool and the Accredited Pathway we’ve been able to provide a range of resources to ensure line managers are equipped to manage high performing teams.”"
        },
        {
            "heading": 2,
            "text": "Evidence-based approach to development"
        },
        {
            "text": "The programme's approach is grounded in evidence based research. \"We asked hundreds of line managers across the Civil Service about the most important elements of line management,\" explains Carol. \"The consistent themes were effective communication, clear expectations, focused leadership, empathy, and creating supportive work environments.\""
        },
        {
            "text": "Gareth Davies, senior sponsor of the LMC programme shared his thoughts; “It’s been great to see the progress following the introduction of the Line Management Standards last year. Communicating clear expectations is essential for harmonious, effective teams, which is what we all want to be part of. The Line Management Standards provide a consistent framework for us all to now work to and I’m not surprised to see how widely they’ve been embraced across departments.”"
        },
        {
            "text": "All of the evidence gathered in the extensive research and development stage of the Line Management Standards and Line Management Development Tool have been used to inform and shape these products. These end products are a true reflection of the insights from line managers telling us what they want and need to support them in managing their teams as well as providing an example of a truly collaborative development process. "
        },
        {
            "text": "Good line management provides clear direction, connecting individual work to broader objectives. By investing in line management capabilities, the Civil Service is building a more effective, engaged workforce that delivers better outcomes for citizens. As we continue to embed these standards and tools across government, we're creating a foundation that supports quality public service delivery. Strong line management isn't just about managing people, it's about unlocking the potential of every civil servant to serve the public effectively and with pride."
        }
    ]
}