{
    "url": "https://deframedia.blog.gov.uk/2022/09/05/110m-fund-to-level-up-rural-communities-announced/",
    "title": "£110m fund to level up rural communities announced",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-09-05T12:16:52+01:00",
    "content": [
        {
            "text": "There was coverage over the weekend including in the BBC online, Bloomberg, Farming UK, and Yorkshire Post of our announcement of the £110 million Rural England Prosperity Fund and publication of the second annual rural proofing report."
        },
        {
            "text": "The Rural England Prosperity Fund will be invested in projects which will boost productivity and create rural job opportunities. These could include farm businesses looking to diversify by opening a farm shop, wedding venue or tourism facilities or improvements to village halls, pubs and other rural hubs for community uses."
        },
        {
            "text": "It will be delivered by eligible local authorities and give local leaders a greater say in investment than they previously had under EU schemes. It will be in addition to the £2.6 billion allocated via the UK Shared Prosperity Fund (UKSPF) to support levelling up across the UK. The fund will be part of the UKSPF and is a rural top-up for eligible local authorities."
        },
        {
            "text": "The ‘Delivering for Rural England’ report describes how rural interests will be at the heart of the government’s approach to levelling up to ensure the 12 levelling-up missions deliver for these communities."
        },
        {
            "text": "The report sets out how the government is working to close the productivity gap for rural areas, which has fallen from 90% of the England average in 2001 to 83% in 2019. Funding announced today through the Rural England Prosperity Fund, together with the government’s UK Shared Prosperity Fund (UKSPF), Food Strategy and the Agricultural Transition Plan, is set to unlock billions of investment in rural communities over the coming years."
        },
        {
            "text": "Secretary of State for Levelling Up, Greg Clark MP said:"
        },
        {
            "text": "Lord Benyon, Minister for Rural Affairs, said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}