{
    "url": "https://nationalscreening.blog.gov.uk/2022/09/05/annual-call-has-opened-suggest-a-new-screening-programme-or-changes-to-a-current-programme/",
    "title": "Annual call has opened: suggest a new screening programme or changes to a current programme",
    "authors": [
        "Paula Coles"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2022-09-05T09:02:30+01:00",
    "content": [
        {
            "text": "Do you have a suggestion for a new national screening programme?"
        },
        {
            "text": "If yes, then the UK National Screening Committee (UK NSC) would like to hear from you."
        },
        {
            "text": "The 2022 annual call for new topics opened today, Monday 5 September 2022, and will close on Monday 5 December 2022."
        },
        {
            "heading": 2,
            "text": "Expansion of the UK NSC remit"
        },
        {
            "text": "This will be the first annual call run under the UK NSC’s expanded remit, which means it can now consider targeted and stratified screening proposals as well as population screening."
        },
        {
            "text": "This is the opportunity for stakeholders – individuals or organisations – to submit proposals for potential new screening programmes or new technologies that have not previously been reviewed by the committee."
        },
        {
            "text": "Under the annual call, anyone can also propose changes to current NHS screening programmes (programme modifications) or early updates to topics already on the UK NSC list. The committee considers early updates if new evidence calls into question a current recommendation."
        },
        {
            "heading": 2,
            "text": "Making a submission"
        },
        {
            "text": "Before you write your proposal, please check:"
        },
        {
            "text": "If your answer is ‘yes’ to all these questions you may have a strong case to send to the committee."
        },
        {
            "text": "Please make sure you submit your proposal between Monday 5 September and Monday 5 December 2022."
        },
        {
            "heading": 2,
            "text": "What happens to the annual call proposals?"
        },
        {
            "text": "The UK NSC secretariat first assesses the proposals to ensure they are within the remit of the committee for consideration as either a population, targeted or stratified screening programme."
        },
        {
            "text": "The proposals are then presented to an expert evaluation group made up of members of the UK NSC, its expert feeder groups, the devolved governments and other experts for a more in-depth assessment."
        },
        {
            "text": "If a proposal meets the criteria outlined in the guidance, the UK NSC will then formally consider it."
        },
        {
            "text": "Don’t worry if you do not have the technical expertise or access to the research. If the condition is not already on the list, is found in the general population, or an easily identifiable target group, and you can refer to some published evidence, the expert evaluation group will consider your proposal."
        },
        {
            "text": "Evidence maps are commissioned for proposals that are within scope. An evidence map gauges the volume and type of evidence available on the proposal and:"
        },
        {
            "text": "We look forward to reviewing your proposals."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}