{
    "url": "https://environmentagency.blog.gov.uk/2022/09/05/environment-agency-giving-a-helping-hand-to-keep-rivers-flowing/",
    "title": "Environment Agency: giving a helping hand to keep rivers flowing",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-09-05T09:51:42+00:00",
    "content": [
        {
            "text": "The Environment Agency owns and operates 8 groundwater schemes and 5 surface water transfer schemes that supplement the flows in several key rivers during the driest months."
        },
        {
            "text": "Just as we do when managing flood risk, our staff work all year round to ensure these assets are ready to help support customers, communities and protect the environment."
        },
        {
            "text": "The schemes are mostly in the east and south of England along with Shropshire and West Berkshire. To keep these schemes running we have 163 pumps and 288 kilometres of pipelines – the equivalent distance of London to Liverpool."
        },
        {
            "text": "The schemes pump water from the ground or rivers and move it to another watercourse to increase flows there. By supplementing the flow of water, we enable some river abstractions to continue for longer, as well as minimising the environmental impact of drought and helping to protect habitats in which dozens of species live."
        },
        {
            "text": "Ten of these schemes have been operating throughout this summer with the first scheme, the Trent Witham Ancholme transfer scheme in Lincolnshire, operating since 30 April. An eleventh scheme, West Berkshire, is due to start operating in September to help ensure abstraction for public water supply across the Thames Water area."
        },
        {
            "text": "Like other abstractors each scheme must operate within the limits of their water resources abstraction licence, this includes the volume of water that can be taken from each source."
        },
        {
            "text": "Before and when using the schemes, we also carry out associated work such as:"
        },
        {
            "text": "We have dedicated staff who manage and operate each scheme supported by experts in hydrology, groundwater, and engineering. They work all year round to ensure these assets are in good condition and are ready to operate. We inspect and test our assets regularly to assess their condition covering electrical, mechanical and safety elements."
        },
        {
            "text": "Our incident management response includes the management of drought, so our staff regularly undergo training and practice exercises, to ensure we are ready to respond should we, like this year, face a drought and need to put our schemes in action."
        },
        {
            "text": "This year many of the schemes are being operated earlier, and for a much longer period than would be expected in a typical English summer.  This year we expect that many of the schemes will continue to operate over autumn and into winter to help maintain flows in rivers. Alongside operating the assets, our teams are already planning maintenance and improvements to ensure the assets are ready for future use to keep rivers flowing."
        }
    ]
}