{
    "url": "https://queensawards.blog.gov.uk/2022/09/05/guidance-for-your-innovation-application/",
    "title": "Guidance For Your Innovation Application",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Assessors",
        "Innovation",
        "Judges",
        "Queen's Awards",
        "Uncategorized"
    ],
    "pub_date": "2022-09-05T10:00:45+01:00",
    "content": [
        {
            "text": "Does your company have a flair for innovation? "
        },
        {
            "text": "The Queen’s Awards for Enterprise’s Innovation category recognises businesses who demonstrate strong commercially successful innovative products or services.  "
        },
        {
            "heading": 3,
            "text": "Eligibility  "
        },
        {
            "text": "To apply for the Innovation award, you must: "
        },
        {
            "text": "Your innovation should be in one of the following categories: "
        },
        {
            "heading": 3,
            "text": "Top tips for your application "
        },
        {
            "text": "In the Innovation category we want to hear why your innovation is unique and how it has benefited your business, customers, and others.  "
        },
        {
            "text": "It is important for us to know what issue your innovation has solved and what challenges you have overcame in developing or distributing it.  "
        },
        {
            "text": "State whether your innovation has been adopted by others in your sector or in another sector.  "
        },
        {
            "text": "Avoid technical jargon and explain why your business approach, product or service is innovative. "
        },
        {
            "heading": 3,
            "text": "Advice from previous Queen’s Award Winners"
        },
        {
            "text": "SPTS Technologies, Welsh Innovation Winners  "
        },
        {
            "text": "Allow plenty of time to fill in the application. It will require input from various parts of your company. Not every submission will be successful, but this makes it worth winning! If you are unsuccessful, do not give up – take on board the feedback from the judging panel and make the necessary improvements to your company and/or your Queen’s Award submission for the next year. "
        },
        {
            "text": " "
        },
        {
            "text": "Simply Doughnuts Ltd, North West Innovation Winners "
        },
        {
            "text": "Persistence is important, as is detailed attention to the Awards’ guidance. We applied, unsuccessfully, in 2019 but by taking the Awards Office’s feedback into account, and by amending our entry for 2020, we were able to submit a successful application. "
        },
        {
            "text": "It is also important to focus on the factual content rather than on emotive language. The application process places a strong emphasis on hard data and evidence, and that is very much what is required. "
        },
        {
            "text": " "
        },
        {
            "text": "Twinkl, Yorkshire and The Humber Innovation Winners  "
        },
        {
            "text": "The application process is a wonderful experience and brings an opportunity to really reflect on your achievements. It does take time though and requires commitment and input from different departments across the business. It needs to be a collaborative effort but coming together and sharing past and present successes is extremely rewarding. "
        },
        {
            "text": "The entire Twinkl team, both in the UK and across the world, are extremely proud of the awards and we would wholeheartedly encourage other ambitious and enterprising businesses to apply for a Queen’s Award too. "
        },
        {
            "text": "Has your business got what it takes to achieve a Queen’s Awards for Enterprise in Innovation? \nApply here: https://www.gov.uk/queens-awards-for-enterprise  "
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880    "
        }
    ]
}