{
    "url": "https://educationinspection.blog.gov.uk/2022/09/05/thousands-of-year-7s-struggle-with-reading/",
    "title": "Thousands of year 7s struggle with reading",
    "authors": [
        "Amanda Spielman"
    ],
    "categories": [
        "reading",
        "schools"
    ],
    "pub_date": "2022-09-05T14:28:19+01:00",
    "content": [
        {
            "text": "Amanda Spielman, Her Majesty’s Chief Inspector, writes about the importance of reading – and the need to help struggling readers as they start secondary school."
        },
        {
            "text": " "
        },
        {
            "text": "The new school year has begun in England, and so have the usual calls to reform the school system. Exams should be scrapped, say some. Others demand curriculum changes.  "
        },
        {
            "text": " "
        },
        {
            "text": "But my concern is more practical. I am worried about children who are still struggling to read when they start secondary school. "
        },
        {
            "text": " "
        },
        {
            "text": "Children are tested in the last year of primary school, known as SATs. This year’s tests showed that nearly 175,000 pupils did not meet the expected standard in reading. That means around a quarter of all Year 7s still have a reading age of below 11.  "
        },
        {
            "text": " "
        },
        {
            "text": "This really matters. Children who cannot read well find it difficult to keep up in secondary school. Reading is an essential part of almost every subject. How can children learn history or geography if they can’t get to grips with textbooks or worksheets? How can they do well in another language when they haven’t fully grasped their own?  "
        },
        {
            "text": " "
        },
        {
            "text": "We know that children who struggle can quickly switch off in lessons. That can lead to disruptive behaviour that affects their classmates too. And children who don’t read well at the start of secondary school are far less likely to do well at English and maths GCSEs. "
        },
        {
            "text": " "
        },
        {
            "text": "The repercussions for weak readers continue after they leave school. Everyday tasks like understanding household bills, reading instructions on medicines, or completing job applications are much harder for them. "
        },
        {
            "text": " "
        },
        {
            "text": "That’s why we put so much emphasis on reading when we inspect schools. "
        },
        {
            "text": " "
        },
        {
            "text": "And it’s why I want to draw attention to children in secondary school: the Year 7s and Year 8s whose disrupted education means they are still catching up on skills they should have learnt at primary school. "
        },
        {
            "text": "  "
        },
        {
            "text": "Many of these children still have gaps in the phonic knowledge that is the foundation of fluent reading. Phonics teaching is well-established in primary schools but is not necessarily expected of secondary school teachers.  "
        },
        {
            "text": " "
        },
        {
            "text": "These children need extra teaching so they can read accurately and fluently, and must be taught in a way that doesn’t patronise them or knock their confidence.  "
        },
        {
            "text": " "
        },
        {
            "text": "We need to pay attention to older children in primary school too, so they don’t start behind next year. Parents can play their part, by reading to and hearing their children read out loud throughout primary school – not just when they’re little. Parents can pick up if their children are pronouncing words correctly, and can ask questions about what they’ve just read, to check they understood the story. It’s great when children read for pleasure, but they will only really enjoy reading by themselves when it stops being a laborious effort. "
        },
        {
            "text": " "
        },
        {
            "text": "At the start of a new school year, there are always debates about the future of education. But let’s not forget the basics. Children need to be able to read so that they don’t get left behind. "
        }
    ]
}