{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/06/18/green-claims-and-the-cma/",
    "title": "'Green claims' and the CMA",
    "authors": [
        "Cecilia Parker Aranha"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2021-06-18T11:02:28+01:00",
    "content": [
        {
            "text": "Whether it’s buying clothes, cosmetics or cleaning products, more people than ever are trying to make choices which are better for the environment."
        },
        {
            "text": "More than half of UK consumers take environmental considerations into account when buying products."
        },
        {
            "text": "Many businesses are already doing the right thing by being clear and upfront about how green a product really is, but that’s not always the case."
        },
        {
            "text": "Did you know a recent analysis of websites found that 40% of green claims made online could be misleading?"
        },
        {
            "text": "We're concerned that people are paying more for so-called ‘eco-friendly’ products, while businesses that are genuinely investing in going ‘green’ aren’t getting the recognition they deserve."
        },
        {
            "heading": 3,
            "text": "Our work on environmental claims isn’t over yet "
        },
        {
            "text": "Last year we began investigating the impact of green marketing on consumers."
        },
        {
            "text": "Since then, we’ve spoken to range of people including businesses, campaign and consumer groups, to find out how these claims are being made and how people respond to them."
        },
        {
            "text": "It became clear to us that what businesses need is guidance to help them know what they should do to communicate their green credentials, in the best way, to reduce the risk of misleading their customers."
        },
        {
            "text": "This is why we’ve written draft guidance for green claims, which sets out the 6 principles businesses should follow when making environmental claims."
        },
        {
            "text": "We think businesses should:"
        },
        {
            "heading": 3,
            "text": "You can help"
        },
        {
            "text": "It’s important we get this guidance on green claims right, not only to help businesses with their environmental goals but to also help their customers."
        },
        {
            "text": "Customers should be able to know if a business, along with their products and services, is as green as they claim."
        },
        {
            "text": "So, we’d like to hear from you."
        },
        {
            "text": "If  you’re someone who buys or sells products which claim to be eco-friendly, you can tell us your thoughts by responding to our consultation by 16 July 2021."
        }
    ]
}