{
    "url": "https://ukhsa.blog.gov.uk/2021/06/18/siren-one-year-on/",
    "title": "SIREN: One year on",
    "authors": [
        "Susan Hopkins"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-06-18T09:29:08+01:00",
    "content": [
        {
            "text": "A year ago today we launched the world’s biggest real-world study into COVID-19 antibodies. As infections soared around the world, we set up the SIREN study to start looking for answers to some of the most important questions about reinfection and the impact of antibodies."
        },
        {
            "text": "In the past year SIREN has carried out 519,465 PCR tests, 249,402 blood tests, with 44,549 participants across 135 sites. Participants are tested every 2-4 weeks using both PCR and antibody tests. All in the interest of answering the questions that we and the public need to know."
        },
        {
            "text": "Here are five things that we have learnt from the study so far:"
        },
        {
            "heading": 2,
            "text": "1 - Can reinfection occur from COVID-19?"
        },
        {
            "text": "This was one of the biggest questions we needed to answer as it would have a huge impact on how the pandemic might progress and how we would manage it. From the study we learnt last year that reinfection was possible and could occur, although it was reasonably rare."
        },
        {
            "text": "Once we had the answer to this it led to the next obvious question"
        },
        {
            "heading": 2,
            "text": "2 - Do antibodies offer you protection?"
        },
        {
            "text": "We wanted to understand what, if any, protection people who have antibodies might have from the virus. How long would they last, was it possible to recover from COVID-19 but then get it straight away?"
        },
        {
            "text": "The evidence from SIREN suggested that antibodies would offer some degree of protection for several months after infection. When SIREN reported its first analysis, the study showed that 83% of people infected with COVID-19 had protection against reinfection for at least 9 months."
        },
        {
            "heading": 2,
            "text": "3 - How effective are the vaccines?"
        },
        {
            "text": "To answer some of the vaccine questions we expanded the number of participants in the study to collect additional vaccination data and increased recruitment around the time that  vaccination of healthcare workers started. This helped us to assess the effectiveness of vaccines."
        },
        {
            "text": "SIREN analysis from February showed that healthcare workers were 72% less likely to develop infection, both symptomatic and asymptomatic, after one dose of the vaccine, rising to 86% after the second dose. Incredible numbers showing us that the way out of the pandemic was to vaccinate. It also showed us that individuals who were vaccinated had a milder illness and were more likely to have infections without symptoms."
        },
        {
            "heading": 2,
            "text": "4 - How long does it take for the vaccines to work?"
        },
        {
            "text": "At the same time, SIREN found that  protection from the vaccine begins two weeks after  the first dose but is optimal from 2 weeks after the second dose. This was key information to help us understand how we could move forward as we started to vaccinate the country."
        },
        {
            "text": "Analysis also showed that this protection helps to reduce the spread of infection. If an individual is not infected, they cannot spread the virus; the more individuals who cannot spread the virus, the greater protection for the whole population."
        },
        {
            "heading": 2,
            "text": "5 - What more can we find out?"
        },
        {
            "text": "It has been a difficult 15 months for us all but scientific studies have helped us to understand what we are dealing with, how to manage the pandemic, and will continue to help us as we move forward."
        },
        {
            "text": "Since its creation, the SIREN study has answered some of the most important questions about COVID-19 infection, reinfection and antibodies. But our work is not over and there is much more to do."
        },
        {
            "text": "We are assessing what level of antibodies those who had a reinfection have versus those that did not."
        },
        {
            "text": "We will continue to monitor participants closely to see the impact of antibodies and vaccines on COVID-19 over the next 12 months, understanding the durability of the vaccine response and measuring the impact of any future COVID vaccines on the immune response and protection against infection."
        },
        {
            "text": "These discoveries would not be possible without the work and effort by so many people. Especially the NHS researchers and volunteer participants who give up their time in the interest of science."
        },
        {
            "text": "Which is why I am delighted the study will continue this vital work over the coming year to help answer the mysteries of a virus that, just 18 months ago, had not yet been identified. These discoveries would not be possible without the efforts of so many people, especially the participants who give up their time in this vital act of public service."
        }
    ]
}