{
    "url": "https://insidehmcts.blog.gov.uk/2021/06/18/sitting-days-how-are-they-decided/",
    "title": "‘Sitting days’: how are they decided?",
    "authors": [
        "Kevin Sadler"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-18T10:00:55+01:00",
    "content": [
        {
            "text": "The allocation of ‘sitting days’, or the number of days that judges ‘sit’ in court each year to hear cases brought before them, is something that you will likely have heard mentioned in relation to courts and tribunals, particularly around dealing with outstanding cases in the Crown Court."
        },
        {
            "text": "But what is less well known is the process undertaken to decide how many sitting days are provided for the financial year ahead in dealing with outstanding cases, and how these days will be allocated across the jurisdictions."
        },
        {
            "text": "The process"
        },
        {
            "text": "Each year, forecasts are made by analysts across the Ministry of Justice (MoJ) to determine how many sitting days are needed to deal with the number of cases expected to come into the court system. For the criminal jurisdiction, these forecasts involve discussions with policing, the Home Office, and Crown Prosecution Service to forecast expected caseload, with consideration given to the expected offence types, as well as levels of seriousness and complexity. Trends in case receipts (what comes in to the court), disposals (what is completed) and outstanding cases (what cases are still to be heard) are closely tracked to inform this forecasting exercise."
        },
        {
            "text": "The analysis focuses on court receipts rather than reported crime. However, reported crime, and anticipation of the volume and nature of offences that the police may charge, informs the analysts’ understanding of how many and what type of cases may be received by the courts."
        },
        {
            "text": "Any developments in the criminal justice system, which are likely to have an upstream impact on the courts, legal aid, probation and prison population (such as the recruitment of 20,000 extra police officers, for example), are carefully considered by the MoJ’s forecasting team and are taken into account when determining sitting day allocations."
        },
        {
            "text": "In other jurisdictions, the process we use is similar but the conversations are with other government departments - where they are responsible for the policy that can drive demand - for example the Department for Work and Pensions for social security and the Home Office for immigration tribunals. Where most disputes are party-to-party such as civil case, employment tribunals or private family law, we rely more on projections of current trends in receipts, disposals and outstanding cases. But where possible we incorporate intelligence from users as well."
        },
        {
            "text": "Decision-making"
        },
        {
            "text": "All decisions on HMCTS resourcing, including decisions on the allocation of sitting days, are made by the Lord Chancellor. This is in accordance with their statutory responsibility to ensure there is an efficient and effective system to support the business of the courts and tribunals, resourcing the system adequately, and ensuring that the judiciary is supported in undertaking its function to deliver justice independently. The Lord Chancellor considers the forecasts, the level of outstanding work in jurisdictions and the available judicial resource."
        },
        {
            "text": "Following review of the analysis, the proposed allocation of sitting days is decided by the Lord Chancellor. This is shared with the HMCTS Board, who then provide independent advice to the Lord Chief Justice and Senior President of Tribunals on whether the settlement is sufficient for the efficient and effective operation of the system."
        },
        {
            "text": "This leads to a formal discussion between the Lord Chancellor, the Lord Chief Justice and the Senior President of Tribunals, where the Lord Chancellor sets out the proposal, which includes the number of sitting days across Crown, Civil, Family and Magistrates’ courts as well as for all Tribunals.  The Lord Chief Justice and Senior President consider the Board’s advice and respond.  This often involves highlighting any risks associated with the proposals and concerns relating to shifting volumes of demand. If the Lord Chief Justice and the Senior President of Tribunals are concerned that the proposed allocation is not sufficient to ensure the efficient and effective operation of the courts and tribunals, they can make their concerns known and ultimately could raise them with Parliament."
        },
        {
            "text": "In the case of the Crown Court, once the allocation is finalised, the Senior Presiding Judge will split the allocation by circuit, based on workload and judicial capacity. The listing of cases into allocated sitting days is then a matter for the independent judiciary."
        },
        {
            "text": "This year"
        },
        {
            "text": "More sitting days will be available across all jurisdictions as part of a wider effort to maximise space and capacity across the justice system."
        },
        {
            "text": "This will enable courts and tribunals to safely hold as many hearings as possible over the coming year as we continue to respond to and recover from the pandemic."
        }
    ]
}