{
    "url": "https://phescreening.blog.gov.uk/2021/06/18/supporting-informed-choice-screening/",
    "title": "Supporting informed choice in NHS screening – a view from Cancer Research UK",
    "authors": [
        "Sophia Lowes"
    ],
    "categories": [
        "General information",
        "NHS Bowel Cancer Screening Programme",
        "NHS Breast Screening Programme",
        "NHS Cervical Screening Programme"
    ],
    "pub_date": "2021-06-18T13:47:19+01:00",
    "content": [
        {
            "text": "Public Health England (PHE) Screening asked Cancer Research UK (CRUK) to tell us about their work on informed choice. Sophia Lowes, a health information manager at CRUK, tells us more."
        },
        {
            "text": "One in two people will develop cancer at some point in their lives."
        },
        {
            "text": "That’s why so much time and resources go into researching, developing and running cancer screening programmes. They can save lives from the disease, by detecting the early signs of cancer before symptoms have had a chance to develop."
        },
        {
            "text": "Catching it early also means that treatment is more likely to be successful. Some types of cancer screening can even prevent cancer from developing in the first place."
        },
        {
            "text": "But screening has harms as well as benefits. Tests can have false positive and false negative results. The former is when a person is given an abnormal result but does not have cancer. A false negative is when a cancer is missed. Screening can also lead to overdiagnosis. This is when a cancer is diagnosed which never would have gone on to cause that individual harm."
        },
        {
            "text": "Our ultimate goal at CRUK is to beat cancer, and we believe that screening can help us in the early diagnosis and prevention stages. We support the NHS national cancer screening programmes — breast, bowel and cervical."
        },
        {
            "text": "We believe that in these cases, the evidence shows the benefits outweigh the harms at a population level, although the balance is different for each programme."
        },
        {
            "heading": 2,
            "text": "Informing not persuading"
        },
        {
            "text": "CRUK is a trusted source of cancer information. We have a responsibility to tell people both the pros and cons of screening to help them weigh up their options."
        },
        {
            "text": "It is why we put a lot of work into ensuring informed choice is at the centre of our information about cancer screening."
        },
        {
            "text": "Screening is personal, and people can respond differently when faced with the same information about the potential benefits and risks. This variation is, in part, why some take up the offer of screening and some do not."
        },
        {
            "text": "It is an individual’s choice to take up screening or not – there is no ‘right’ or ‘wrong’ decision."
        },
        {
            "text": "But we also know that some people want health experts to tell them what decision they should make. We need to give people information that meets their needs, whilst still supporting informed choice and without creating confusion. It is not always an easy task."
        },
        {
            "text": "We see CRUK’s role as raising awareness and removing barriers. We want to encourage people to consider their invitation and provide information to help them come to their own decision. And we want to help everyone who wants to take part in screening to do so."
        },
        {
            "text": "Since COVID-19, improving access to screening is more important than ever as many people have been unable to attend in the last year. The pandemic has created new barriers and reinforced others. We need to address these while still ensuring people can make an informed choice about screening."
        },
        {
            "heading": 2,
            "text": "How we do this"
        },
        {
            "text": "We add informed choice to our content, by making it evidence based and not coercive. Our information is based on insight about people’s needs and it goes through user-testing to make sure it meets our aims. We focus on answering questions, busting myths and reducing barriers. We:"
        },
        {
            "text": "We are not afraid to challenge the available information."
        },
        {
            "text": "In 2012, CRUK and the UK government asked Professor Sir Michael Marmot to chair an independent panel of experts. They were asked to review the evidence about the pros and cons of breast screening, to make sure that women were given the clearest information possible."
        },
        {
            "text": "We also collaborate with PHE to support informed choice and reduce barriers. We have supported their screening information leaflets and Be Clear on Cancer campaigns and are grateful for the opportunity to contribute to these great resources."
        },
        {
            "heading": 2,
            "text": "Taking charge"
        },
        {
            "text": "Whether it is deciding to take part in screening, or talking to a doctor about an unusual change, we want people to take an active role in their health."
        },
        {
            "text": "Giving people the best information to address myths and barriers is our role – it is up to individuals to decide what is right for them."
        },
        {
            "text": "In part 2 of this blog post, we will be talking about our work with, and resources for, health professionals, who can also play a key role in screening. It is vital that health professionals support informed uptake of screening, by raising awareness and reducing barriers for their patients."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}