{
    "url": "https://civilservicelocal.blog.gov.uk/2021/06/18/the-g7-comes-to-cornwall/",
    "title": "The G7 comes to Cornwall",
    "authors": [
        "Heidi Stephens"
    ],
    "categories": [
        "South West England"
    ],
    "pub_date": "2021-06-18T08:35:21+00:00",
    "content": [
        {
            "text": "Well we can’t let the G7 pass without mentioning all the civil servants from the South West and elsewhere in the UK who got involved in supporting this huge event in our region. Supporting the Foreign, Commonwealth & Development Office (FCDO) I worked on the Event Security and Police Liaison Team, welcoming delegates and working with other teams to ensure the safety and smooth running of the event. There were a variety of roles available to volunteers such as Delegation Liaison Officers who were responsible for making sure delegates had everything they needed, to Media Liaison Officers who assisted media getting to the right places on time for ‘media moments’."
        },
        {
            "text": "The majority of us have never worked in such close proximity to world leaders and those who support and protect them. Law enforcement, private security, military, local staff and civil servants all worked so well together to make the event a success. I have to thank the security team and the police officers I worked with.  Despite working very long hours they were incredibly helpful, friendly and professional, which made the event for me. That and being back home in Cornwall with some great weather to showcase our beautiful county."
        },
        {
            "text": "Working face to face with people again, after such a long time working at home, was fantastic. I have missed the human interaction, the stories and the humour. The role was far different to anything I have done in a long time and really gave me an insight into working at pace, solving problems, managing queries and thinking on your feet whilst dealing with ‘customers’."
        }
    ]
}