{
    "url": "https://gds.blog.gov.uk/2021/06/18/were-hiring-more-user-researchers-at-gds/",
    "title": "We’re hiring more user researchers at GDS",
    "authors": [
        "Pablo Romero - Lead User Researcher for the Digital Identity programme, Government Digital Service",
        "Nick Breeze - Lead User Researcher for Goverment as a Platform, Government Digital Service",
        "Chris Marshall - Lead User Researcher for GOV.UK, Government Digital Service"
    ],
    "categories": [
        "GDS team",
        "People and skills",
        "User research"
    ],
    "pub_date": "2021-06-18T15:58:26+01:00",
    "content": [
        {
            "text": "GDS will be hiring user researchers to support our exciting and ambitious strategy. We are looking for several user researchers to join us across the board, in the GOV.UK, Digital Identity and Government as a Platform (GaaP) teams."
        },
        {
            "text": "Does this sound like an opportunity for you? We’ve got some colleagues sharing what they find valuable about being a user researcher, what’s going on in their area, and advice on applications for you."
        },
        {
            "heading": 2,
            "text": "Why we need user researchers"
        },
        {
            "text": "GDS needs to grow to meet our delivery commitments. We need user researchers to plan, design and carry out research activities with users to help our delivery teams get a deep understanding of the people that use government services."
        },
        {
            "text": "User research informs policy, proposition, service, content and interaction design so that services work well for users and achieves policy intent. As well as leading user research activities, our researchers work tirelessly to build and sustain our user-centric delivery culture."
        },
        {
            "heading": 2,
            "text": "What you will be working on"
        },
        {
            "text": "The User Research Leads for each team have more information about what user researchers newly joining us will help to deliver."
        },
        {
            "heading": 3,
            "text": "Chris Marshall - Lead User Researcher, GOV.UK"
        },
        {
            "text": "It’s a great time to be joining GOV.UK as we have an exciting and ambitious roadmap for 2021. GOV.UK is the best place to find government services and information, and user needs are at the heart of everything we do. Our vision is for GOV.UK to offer users joined-up, trusted and personalised interactions."
        },
        {
            "text": "GOV.UK user researchers help our delivery teams build a deep understanding of our users and their needs. They also help develop our GOV.UK user research practices, which enables us to carry out high quality and impactful research."
        },
        {
            "text": "There are currently 11 user researchers on GOV.UK and we are looking to recruit for a number of positions in the coming months, who would join our team and the wider data and insight community."
        },
        {
            "heading": 3,
            "text": "Pablo Romero - Lead User Researcher, Digital Identity"
        },
        {
            "text": "The vision of the Digital Identity programme is that citizens will be able to use one login for all government services. To do this, we need a high-performing team which is representative of the citizens we serve and motivated to make a real difference for our users."
        },
        {
            "text": "This is a high profile programme that aims to transform the way people access services and interact with government. Our product has to be inclusive in order to ensure that everyone can access the services they need."
        },
        {
            "text": "User researchers in the Digital Identity programme are part of interdisciplinary teams building a product that is for everyone, respecting the privacy of users and delivering a great user experience."
        },
        {
            "heading": 3,
            "text": "Nick Breeze - Lead User Researcher, GaaP"
        },
        {
            "text": "GDS’s GaaP products provide a range of shared services that solve common problems across government, enabling teams to design, build, and host services quickly and cheaply."
        },
        {
            "text": "We are recruiting for a role on the Design System, which is an integral part of GaaP. The Design System provides teams with the styles, components and patterns to enable services to be consistent with GOV.UK and avoid doing work that’s been done elsewhere."
        },
        {
            "text": "As a user researcher you’ll be a key part of this multidisciplinary team. Your skills will play a vital role in the team understanding its users, and will also enable informed product decisions to be made so the Design System continues to be an exemplar across government."
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "You can visit the GDS career page to find out more about working here, and there are lots of blog posts about different aspects of working life. Here’s just a few to get you started:"
        }
    ]
}