{
    "url": "https://digitalpeople.blog.gov.uk/2024/02/16/2023-summer-interns-supporting-visit-by-international-delegations/",
    "title": "2023 summer interns - supporting visit by international delegations",
    "authors": [
        "Ramaya Pillai, Summer Intern, GDS"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Digital data and technology",
        "Diversity and Inclusion",
        "Government Digital and Data"
    ],
    "pub_date": "2024-02-16T06:00:24+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "When I found out that my internship would be with the Communications team at the Government Digital Service (GDS), I was nervous about how I would fare and unsure how useful it would be for me. I didn’t have any experience in communications, nor was it something I had considered as a future career option. "
        },
        {
            "heading": 3,
            "text": "What I learnt"
        },
        {
            "text": "I quickly discovered that the internship would not be at all what I was expecting. The team welcomed me with open arms and in my first couple of hours at GDS, I was already helping with the final arrangements for the inaugural Learning Day event. I was surprised by how much I enjoyed internal communications and events - getting completely stuck in. "
        },
        {
            "text": "So far, I have learnt how to draft comms plans, send out newsletters, film strategy videos, organise all staff events and much more. I was given responsibility for an audit of the GDS Wiki, a collection of valuable pages where staff go to find important information. I set out plans to check the content, formatting and functionality of each page on the site. This has been a long but rewarding task. Each time I updated a page I felt that I was contributing to something which benefits the wider GDS community. "
        },
        {
            "text": "I have even been given opportunities to spread my wings outside of the Communications team. When my line manager discovered I was studying International Relations and German, he immediately thought of introducing me to the International Team at GDS. I assisted the team with a visit from a Ukrainian delegation and am now leading on a visit from a delegation from the Czech Republic. Coordinating with the embassy and ministerial staff to organise the meeting has been exciting and insightful. Through this, I have realised that there are opportunities for international engagement outside of the Foreign, Commonwealth and Development Office. I now feel more secure in the knowledge that there are multiple paths towards my career goals. "
        },
        {
            "heading": 3,
            "text": "Conclusion"
        },
        {
            "text": "In the first six weeks of my internship at GDS, I gained so much knowledge about what it’s like to work in the Civil Service and skills that will undoubtedly shape me into a more well-rounded candidate for the Fast Stream. The people and working environment are overwhelmingly positive and have left me with a dilemma; I am now seriously considering a career in internal comms and events and would love to stay at GDS for longer! "
        },
        {
            "text": " "
        }
    ]
}