{
    "url": "https://cddo.blog.gov.uk/2024/02/16/making-great-services-what-is-the-top75/",
    "title": "Making ‘Great’ services: what is the Top75?",
    "authors": [
        "Ruby Meehan, Business Analyst, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-02-16T16:23:34+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introducing the Top 75"
        },
        {
            "text": "Government committed to getting 50 of the Top 75 services to a ‘great’ standard by 2025 in the roadmap for digital and data. This blog marks the start of a series of Central Digital and Data Office (CDDO) blog posts to share more insights on this crucial programme of work."
        },
        {
            "text": "Our goal with Top 75 is to improve some of the vital government services that citizens use throughout their lives. To improve services, you first need to define what good looks like. Working with teams across government, we’ve created a performance framework defining what makes a ‘Great’ service. By having a collective understanding CDDO, working closely with departments, can focus our efforts on targeted improvements to have the maximum impact. "
        },
        {
            "heading": 3,
            "text": "Why 75?"
        },
        {
            "text": "Government provides thousands of digital services. We know we can’t transform them all at once, so we have carefully selected the 75 from a list put forward by departments and approved by ministers. You can see the full list of services included in our digital roadmap’s annex. "
        },
        {
            "text": "Selecting just 75 services wasn’t an easy process, and reflects around 1% of government services, as most services are important to their users. By engaging closely with central departments, we collectively identified a list of the highest volume and impact services. Naturally, given the importance of government services in our daily lives, there were a vast range of services numbering far higher than 75. CDDO worked with colleagues and partners to whittle this list down to just 75 services used by citizens all across society, including some well known services like Sign up to Flood Warnings through to Register to Vote. "
        },
        {
            "heading": 3,
            "text": "What do we mean by transforming? "
        },
        {
            "text": "By transforming services we really mean making them modern, easy to use, inclusive and cost efficient from start to finish. Often parts of a service are excellent while other parts aren’t so we’re focussing on the end-to-end experience. There are pockets of brilliance, but we need to make this universal."
        },
        {
            "text": "In practice, this means updating inefficient legacy systems and leveraging new and emerging technologies to make services more effective. It also means taking a user-centred approach to refine services and make them easier to use."
        },
        {
            "text": "Transforming services doesn’t just help the user, it also means we can make better use of public money. Transforming the Top 75 services can also make them more productive so time can be spent where it has the greatest impact."
        },
        {
            "heading": 3,
            "text": "How can we help?"
        },
        {
            "text": "Each service is on its own journey to be ‘Great’ and most have ambitious roadmaps to achieve it by 2025. Our shared commitment has been apparent since we launched the Top 75 Programme and as we’ve worked with service teams, we’ve been impressed with their efforts to deliver the best services.   "
        },
        {
            "text": "In CDDO we’ve created a team focussed on the Top 75, providing support to measure service performance, track improvements and help services improve. This can range from specialist advice on challenging topics (such as meeting accessibility standards) through to helping teams design and implement improvements to their services. This also includes identifying the areas services are exemplars and helping them to share this information across government so all can learn and improve. "
        },
        {
            "text": "Whether it’s assisting with data analysis or understanding blockers, the Top 75 team are committed to helping our public services improve and meet the needs of the citizens who use them. "
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "We’re going to publish more blogs in the coming months on different aspects of the Top 75 work including improving accountability with Single Service Owners, case studies of currently ‘Great’ services and more information about what we’re doing to support transformation. "
        }
    ]
}