{
    "url": "https://moderncivilservice.blog.gov.uk/2024/02/16/meet-the-modern-civil-service-jenny-brooker/",
    "title": "Meet the Modern Civil Service: Jenny Brooker",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Interview",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-02-16T10:49:49+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Hello! Welcome to the fourth interview in the Meet the Modern Civil Service series. The aim of this series is to showcase the people in the civil service who are innovating change, whether that be through being a learning champion, embracing digital and data into their daily working or helping develop new hubs across the UK."
        },
        {
            "text": "Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit spoke with Jenny Brooker, Chief Data Architect at the Central Digital and Data Office (CDDO) about what A Modern Civil Service means to her, as well as how she sees reform in action and how all civil servants will benefit from these positive, digital and data-driven changes."
        },
        {
            "heading": 2,
            "text": "What does A Modern Civil Service mean to you?"
        },
        {
            "text": "I think a modern civil service means the people themselves are comfortable and happy that data is just a thing that they do. It's not a particular thing we have to work hard at, it just happens. I think that is a lot to do with the skills that we have, particularly when you look at kids in school who were learning at coding clubs and who are going to grow up with the fact that you've got all these wonderful kind of new ChatGPTs and tools that they can use as they start to join the civil service, expectations are going to be so much higher."
        },
        {
            "text": "To me, the Central Digital and Data Office (CDDO) is here to drive the use of digital and data so that everything is there for people to utilise. They can build those skills they need to work with technology, they have access to the data that they need, and all of that just becomes so frictionless and easy that it's just something that we do."
        },
        {
            "heading": 2,
            "text": "Insights from One Big Thing training"
        },
        {
            "text": "Talking to some of the team here, who are very experienced data people, it would have been easy for us to just say “we know it all, we don't need to do this whole One Big Thing  training.” What I learned was I don't know everything about data and actually, I did quite a lot of my One Big Thing training through Data Connect, which is our virtual conference for data communities, and it's very much run by the community."
        },
        {
            "text": "There were some great sessions there. I attended a panel session on AI which had the University of Cambridge, the Open Data Institute, the Alan Turing Institute, and Microsoft themselves, all talking about how data fit into this new world of AI? What are the things we should think about? Particularly around data ethics, and like ethical use and responsible use of data. "
        },
        {
            "text": "There were some aspects that I never really considered in that, and I think that was what I learned most from my One Big Thing training was that actually, there are so many use cases out there and so many pockets of projects and people that are building who are sharing best practice with each other through our communities and who also are doing things that others could make great use of."
        },
        {
            "heading": 2,
            "text": "Using data to benefit behaviour change"
        },
        {
            "text": "There's quite a few ways that people can change their behaviour, but the one that I come back to is making it easy and making it frictionless in terms of use of data. Wouldn't it be great if in all of the decision making that we are doing, we're building data into those processes around writing a business case or developing a policy?"
        },
        {
            "text": "We do a lot around building digital services for citizens and making sure that data is part of that in terms of measuring the success of those services. Those things drive change because you are getting feedback on your service."
        },
        {
            "text": "Getting feedback on the policy that you've developed, that's where data can drive that behaviour change. It's not in using data itself, it's measuring what it is that you do and actually being able to point to those successes. In order to do that, we need to make data accessible to people."
        },
        {
            "text": "One of the key services we're building this year for the public sector is the data marketplace, which is a central place where if you are developing your digital service, you can discover all of the shared data across the departments. The aim is that you might find something that you were going to ask a citizen to type in themselves or be trying to capture."
        },
        {
            "text": "It doesn't have to be a big change — it could just be that you are transferring your data into a spreadsheet instead of writing it down on your notepad. Even those small changes around automation can make a big difference to people and have a real impact on the things that we're asking citizens to do."
        },
        {
            "heading": 2,
            "text": "Essential Data Skills for Civil Servants"
        },
        {
            "text": "Being able to interpret data and read it in the first place is an essential skill for Civil Servants. If you have amazing analysts or economists or data scientists who are providing you great outputs, you don't necessarily need to know exactly how they're doing those things, but understanding the information that's been presented to you and how to interpret it is a key skill to have."
        },
        {
            "text": "I also think that knowledge of how to interpret the information that you're being presented with is really important, as well as knowing what information you need. Questions you can ask yourself are: “Do I understand enough about the information that is being captured in my organisation and how we might manage those things?” or “Is there data that I need to be able to share with others and is it valuable to other people?” And I think that some of the work we're doing around data ownership and getting organisations to really think about how they are managing data could be really useful."
        },
        {
            "text": "Thinking about using AI, we need to consider how we ask questions of data. Great new technologies are coming out where you don't need to be able to write any particular coding language or anything in order to be able to ask questions of your data. You might think “How do I know what to search for in the first place?”,  so knowing what questions to ask your data and knowing what it can and can’t answer."
        },
        {
            "heading": 2,
            "text": "Data ecosystem - the Argos catalogue of government data"
        },
        {
            "text": "The government data ecosystem is just a fancy way of saying we’re taking all of the data flowing between and within all the organisations and making that better. So data marketplaces are there to help you actually find it. Some of you'll remember the Argos catalogue and looking through it thinking, “what I ask Santa for Christmas?” and the data ecosystem is a lot like that; what data is there that I can have in my service?"
        },
        {
            "text": "One great example of where sharing data in an ecosystem works really well is the government Warm Home Discount Scheme. It has cross-government data sharing between four different departments and 17 energy suppliers, and it enabled 3 million low income rebates to low income households during winter 2022 and 2023."
        },
        {
            "text": "That was through data sharing through APIs, which is a really secure way to share data. It enabled citizens and delivered better outcomes for real people in the real world just through sharing different data sets across four departments with all of those different energy suppliers."
        },
        {
            "text": "What I learned very quickly was a love of data because when you brought datasets together, when you understood what it was that the power of that dataset could do, what questions it could answer what technology could do with that in order to answer those questions, that is what excites me."
        },
        {
            "text": "It's bringing together datasets because when you start to join them, when you start to link them together, actually, they can answer a hundred more questions than you ever believed before. But I think one of the biggest parts of that as well that excites me is thinking about how do we do that ethically? How do we do that responsibly? And that’s one of the key responsibilities at CDDO. "
        }
    ]
}