{
    "url": "https://stratcommand.blog.gov.uk/2024/02/16/we-are-strategic-command-with-lieutenant-commander-susan-jeffreys/",
    "title": "We Are Strategic Command with Lieutenant Commander Susan Jeffreys",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-16T09:00:29+00:00",
    "content": [
        {
            "text": "Lieutenant Commander Susan Jeffreys, Innovation Scout in jHub Med, talks about what led her from a career as an Intensive Care Nurse to a life of innovation in Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you introduce yourself and tell us about your role?"
        },
        {
            "text": "Susan: I’m Lieutenant Commander Susan Jeffreys, and I am an Innovation Scout in jHub Med."
        },
        {
            "text": "As part of my role, I search for problem sets or technology that we can innovate and bring to users in Defence. I do this through collaboration with Small to Medium sized Enterprises, start-ups, or using new technology. A big part of my role is also managing ongoing projects and making sure we’re delivering what our Armed Forces need."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What brought you to the role?"
        },
        {
            "text": "Susan: I am an Intensive Care Nurse by trade, and I first got involved with jHub when I was doing Trauma Research in 2017. At the time we were still carrying bunches of keys around hospitals to access our Controlled Drug Cupboards, and when people would lose them, I would think “there’s got to be something better than this!”."
        },
        {
            "text": "My boss pointed me towards a hackathon run by jHub Med as a way of channelling my desire to improve our processes. I went along and joined a team to explore how we could 3D print surgical instruments. It was a brilliant event, but the best part was that our team won the hackathon, and I was able to carry on working on the project for 5 months."
        },
        {
            "text": "Sometime later I received a call from my Career Manager saying there were positions available in jHub Med, I jumped at the opportunity and the rest is history."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What is the best part about your role in jHub Med?"
        },
        {
            "text": "Susan: You get the chance to be creative, autonomous and it’s not a place where you’re afraid to ask questions. I've got freedom to go and scout problem sets and then hold a canvas and say, is this something we should look at?"
        },
        {
            "text": " "
        },
        {
            "text": "Interview: Why do you think innovation is so important in Defence?"
        },
        {
            "text": "Susan: Innovation is important because if you want to be at the cutting edge, be the best and get the best results, then you need to keep innovating and learning."
        },
        {
            "text": "You can't be stagnant; we need to arm our people with the right tools, at the right time."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What drives you as an individual?"
        },
        {
            "text": "Susan: This has changed over the time that I've been in the Navy. What's driving me now is the desire to leave a good legacy."
        },
        {
            "text": "I want to leave people with the tools and training in place to have a good experience. I want them to be fully prepared for deployment and see all the benefits that working in Defence has to offer. I want them to have that light bulb moment, where you see their eyes light up and they get it, and it’s something that will never leave them."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What would you say to someone thinking about joining jHub Med?"
        },
        {
            "text": "Susan: I would say, don't be scared of trying something new. It's a diverse, supportive place where you can be curious, and if you don't get it or don't understand, you can ask the questions. You get the freedom in finding opportunities and pursuing them, and you get to make a real long-lasting impact."
        }
    ]
}