{
    "url": "https://defralanduse.blog.gov.uk/2023/07/20/10-actions-local-planning-authorities-can-take-to-prepare-for-biodiversity-net-gain-bng/",
    "title": "10 actions local planning authorities can take to prepare for Biodiversity Net Gain (BNG)",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "BNG"
    ],
    "pub_date": "2023-07-20T10:45:50+01:00",
    "content": [
        {
            "text": "With BNG round the corner, we’ve put together suggested actions, to help LPAs prepare ahead of November."
        },
        {
            "text": "We've put these together based on feedback from local authorities and will make any updates directly in this blog. This list does not cover every possible action and each local area will have specific needs. It’s also worth noting that these points do not replace the legislation and guidance that we’ll be providing later this year. You can check this page for the latest BNG guidance, which will be added to throughout summer, alongside the Planning Advisory Service’s own BNG area, which contains a handy FAQ."
        },
        {
            "text": "1. Consider how BNG joins up with other local policy priorities - BNG can contribute to how you deliver other policies such as health and well-being and flood risk. Consider how green infrastructure, nature based solutions, Local Nature Recovery Strategies (LNRS), and BNG can be linked up to deliver on local priorities, such as better places for people and nature."
        },
        {
            "text": "2. Get to know the Biodiversity Metric and guidance - Gain familiarity with the current Biodiversity Metric and guidance published in support of mandatory BNG. Consider training where necessary. Biodiversity metric: calculate the biodiversity net gain of a project or development - GOV.UK (www.gov.uk)"
        },
        {
            "text": "3. Consider how to include BNG requirements in your local plan– Detailing local policy requirements for BNG in the Local Plan with supporting detail set out in supplementary planning documents can provide detail for developers and landowners needing to comply with BNG. Mandatory BNG will require 10% biodiversity gain when it comes into force."
        },
        {
            "text": "4. Publish local habitat creation and enhancement priorities – you should make available any relevant policies and information on local habitat creation and enhancement priorities to developers. We’d suggest doing this publicly on your website. This will help landowners and planning applicants when considering providing biodiversity units for mandatory BNG."
        },
        {
            "text": "5. Consider being an enforcing body for on and off-site gains – Significant on-site and all off-site biodiversity gains will need to be legally secured for 30 years using planning obligations or conservation covenants. LPAs can be enforcing bodies for these agreements and can offer them as chargeable services. Land for BNG can be secured via planning obligations such as s106. Conservation covenants are voluntary, but legally binding, agreements between a landowner and a designated ‘responsible body’ such as a conservation charity, public body or for-profit body to conserve the natural or heritage features of the land. You can find further information on conservation covenants here. Prospective Responsible Bodies will need to apply to Defra to be designated: the designation process is now open, application guidance can be found here."
        },
        {
            "text": "6. Assess whether you want to sell to the off-site biodiversity market and/or be a broker – the off-site biodiversity market offers an opportunity for you to gain additional income and help contribute towards Local Nature Recovery Strategies (LNRS). As a broker, you can connect developers to off-site unit providers. You can also sell biodiversity units from your own land (or via a habitat bank in collaboration with other landowners) into the off-site market, provided you do not direct buyers towards your units in preference to other suppliers. Even if you don’t want to sell BNG on your own land, you could provide guidance for landowners, to encourage habitat creation in line with LNRS’. Find out more on our guidance page: Sell biodiversity units as a land manager - GOV.UK (www.gov.uk)"
        },
        {
            "text": "7. Make sure the whole organisation knows about BNG – inform planning, ecology, parks & greenspace, policy, legal and executive arms of the organisation of BNG and the requirements. Consider using resources from the Planning Advisory Service (Biodiversity Net Gain for local authorities | Local Government Association)"
        },
        {
            "text": "8. Find relevant local expertise – consider investing in local ecology and planning expertise to provide capacity and maximise local place making and nature improvement opportunities. You can also check in with your LNRS responsible authority, to help guide on and off-site delivery of BNG."
        },
        {
            "text": "9. Speak to local partners – Engage with other organisations considering biodiversity net gain including, but not limited to, local nature partnerships, catchment partnerships, local environmental records centres, environmental charities (e.g. local wildlife trusts), local habitat providers and statutory agencies (Natural England and Environment Agency) where appropriate"
        },
        {
            "text": "10. Biodiversity duty - Consider how actions to prepare of biodiversity net gain contribute to the ‘the biodiversity duty’ and if a local planning authority, what information you may need to collect when publishing a biodiversity report."
        },
        {
            "text": " "
        }
    ]
}