{
    "url": "https://educationhub.blog.gov.uk/2023/07/6-ways-were-widening-access-to-apprenticeships/",
    "title": "6 ways we’re widening access to apprenticeships  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-07-20T11:16:53+01:00",
    "content": [
        {
            "text": "Since 2010 over 5.5 million apprentices have started their apprenticeship journey in a wide range of industries, from health to business, to engineering and beyond."
        },
        {
            "text": "We’re committed to making sure that everyone who wants to become an apprentice can do so, so that people of all ages can earn while they learn and gain the skills they need to build a rewarding career."
        },
        {
            "text": "Here are just some of the things we’re doing to widen access to apprenticeships."
        },
        {
            "heading": 3,
            "text": "1. Boosting up take of apprenticeships "
        },
        {
            "text": "From Autumn 2023, UCAS will expand its service so that young people can see more personalised options, including apprenticeships. From 2024, students will then be able to apply for apprenticeships alongside degrees, so that they can decide which route suits them best."
        },
        {
            "text": "By opening up the service to apprenticeship opportunities, thousands more young people will benefit from a wider choice of high-quality options. The plans will also help put technical and vocational education on an equal footing with traditional academic routes."
        },
        {
            "text": "We will also launch a new online platform this Autumn where people and employers can search for and compare all our high-quality training offers including apprenticeships - all in one place."
        },
        {
            "text": "We are also supporting employers to take on more apprentices including by cutting the steps needed to register to take on an apprentice, allowing them to backdate funding so their apprentice can start straight away and updating 100 apprenticeships in sectors such as construction and healthcare so they reflect the latest technological advancements"
        },
        {
            "heading": 3,
            "text": "2. Bursaries for care leavers"
        },
        {
            "text": "We’re increasing financial support for care leavers who opt to do an apprenticeship as they make the transition to independent living."
        },
        {
            "text": "From 1 August, care leavers who start an apprenticeship will be entitled to a tax-free bursary of £3,000, up from £1000, providing more support for those who want to get high-quality training through an apprenticeship."
        },
        {
            "heading": 3,
            "text": "3. Introducing more high-quality apprenticeships and degree apprenticeships"
        },
        {
            "text": "There are now more than 670 high quality apprenticeships in a wide range of roles. This includes degree apprenticeships in nursing, engineering, law, and science. The first ever NHS doctor apprenticeship will all start from September 2024, and we’ve just announced a brand-new degree apprenticeship in space systems engineering also launching next year."
        },
        {
            "text": "Apprentices earn while learning on these programmes, helping widen access to advanced education by providing a tuition fee-free route to a bachelor’s or master’s degree."
        },
        {
            "heading": 3,
            "text": "4. Improving the quality of apprenticeships"
        },
        {
            "text": "We are making sure more people have access to high quality training and complete their apprenticeships. We have introduced more support for training providers, apprentices and employers, as well as a new accountability framework to strengthen how we hold training providers to account. Ofsted will also inspect all training providers by 2025."
        },
        {
            "text": "We are already seeing encouraging signs, with latest figures showing a 20.1% increase in the number of apprentices who completed their apprenticeship compared to the same period last year."
        },
        {
            "heading": 3,
            "text": "5. Mentoring support for disabled people "
        },
        {
            "text": "The latest data shows more people with learning disabilities are doing apprenticeships, with 15.1% of apprentices declaring a learning difficulty – up from 13.8% and 12.1% in previous years."
        },
        {
            "text": "We know that people with learning difficulties and disabilities may need extra support to manage their training and complete their apprenticeship."
        },
        {
            "text": "To support them we’ve announced a new mentoring pilot to be launched later this year, which will offer bespoke training to disabled apprentices to help them through their apprenticeship journey."
        },
        {
            "heading": 3,
            "text": "6. Additional funding for employers and training providers"
        },
        {
            "text": "We pay £1,000 to both employers and training providers when they take on any apprentice aged under 19, or apprentices aged 19-24 who have an Education, Health and Care Plan or have been in care."
        },
        {
            "text": "We also fund 100% of the training costs for small employers (fewer than 50 staff) when they take on apprentices aged under 19."
        },
        {
            "text": "This means that more businesses are able to offer apprenticeships to these young people."
        }
    ]
}