{
    "url": "https://deframedia.blog.gov.uk/2023/07/20/asian-hornets-identified-in-dover/",
    "title": "Asian hornets identified in Dover",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-07-20T15:15:08+01:00",
    "content": [
        {
            "text": "There has been widespread coverage across national and regional media outlets, including BBC News, BBC Today Programme, ITV, The Sun, The I, Yorkshire Post, The Daily Star, Kent Online, Kent Live, Doncaster Free Press, and Belfast News Letter, on our announcement yesterday (19 July) that Asian hornets have been confirmed in Dover, Kent. Alongside, Defra Chief Plant Health Officer Nicola Spence has been interviewed by BBC News and the Today Programme to discuss the sightings."
        },
        {
            "text": "Beekeepers and members of the public are being asked to remain vigilant after the National Bee Unit confirmed the sighting of Asian hornets in the Dover area of Kent."
        },
        {
            "text": "The Asian hornet is smaller than our native hornet and poses no greater risk to human health than our native wasps and hornets. However, they do pose a risk to honey bees and monitoring work is underway from the National Bee Unit to monitor for any hornet activity and to identify any nests nearby."
        },
        {
            "text": "There have already been several sightings of Asian hornet this year with this being the sixth confirmed UK sighting since April 2023, when a single Asian hornet was captured near Newcastle-upon-Tyne, Northumberland."
        },
        {
            "text": "Defra’s Chief Plant and Bee Health Officer Nicola Spence said:"
        },
        {
            "text": "It is important to take care not to approach or disturb a nest. Asian hornets are not generally aggressive towards people but an exception to this is when they perceive a threat to their nest."
        },
        {
            "text": "If you suspect you have seen an Asian hornet you should report this using the iPhone and Android app ‘Asian Hornet Watch’ or by using our online report form. Alternatively, e-mail alertnonnative@ceh.ac.uk. Please include a photograph if you can safely obtain one."
        },
        {
            "text": "Identification guides and more information are available and if you keep bees you should keep up to date with the latest situation on the gov.uk sightings page and on BeeBase."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}