{
    "url": "https://defralanduse.blog.gov.uk/2023/07/20/bng-whats-happened-and-whats-coming-next/",
    "title": "BNG: what’s happened and what’s coming next",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "BNG"
    ],
    "pub_date": "2023-07-20T10:45:31+01:00",
    "content": [
        {
            "text": "Here in the Defra Biodiversity Net Gain (BNG) team, we’ve likened BNG to a baby elephant! It’s big, complex and needs a herd to nurture it to adulthood. Feeding into the Environmental Improvement Plan’s nature recovery targets, BNG gives the development industry an opportunity to work with the planning system to make sure development improves and protects our precious biodiversity, rather than further eroding it. It also has the potential to boost green jobs, innovation in habitat mapping and make green space more accessible to the public."
        },
        {
            "heading": 3,
            "text": "When is BNG happening?"
        },
        {
            "text": "Following our consultation on BNG implementations and regulation, we made the decision to phase BNG’s introduction from November 2023, starting with most major developments. More time will be given to small sites (April 2024, see definition in the consultation response) and nationally significant infrastructure projects (NSIPs) (expected in 2025). This will allow developers, landowners and local planning authorities more time to familiarise themselves with the requirements and learn lessons from early practitioners."
        },
        {
            "text": "Mandatory BNG will only apply to new applications for planning permission for major development made after November 2023. We are working with DLUHC on transitional arrangements to ensure that BNG is not applied retrospectively to planning applications that have been submitted or have already been granted permission before the implementation date. For example, applications made under s73 where the earlier permission was submitted or granted before this date. We will set out more detail on these arrangements in due course."
        },
        {
            "heading": 3,
            "text": "What’s been the journey so far in 2023?"
        },
        {
            "text": "We’ve:"
        },
        {
            "heading": 3,
            "text": "What’s the difference between biodiversity units and credits?"
        },
        {
            "text": "In BNG, there is a key difference between biodiversity units and credits:"
        },
        {
            "heading": 3,
            "text": "What can you expect before BNG becomes mandatory? "
        },
        {
            "text": "Secondary Legislation"
        },
        {
            "text": "Following on from our consultation response, we’re drafting the following statutory instruments:"
        },
        {
            "text": "We'll be providing further information on these ahead of BNG becoming mandatory."
        },
        {
            "text": "Case studies"
        },
        {
            "text": "We’re planning on publishing on and off-site examples of BNG on this blog, to help bring BNG to life and aid best practice: make sure to sign up to the Land Use Blog alerts to receive notifications of these!"
        },
        {
            "text": "Written guidance "
        },
        {
            "text": "All guidance will be published on this page on a rolling basis. We are working on the below guidance; this list is not exhaustive and further topics may be added:"
        },
        {
            "text": "Responsible bodies"
        },
        {
            "text": "Prospective responsible bodies will need to apply to Defra to be designated: the designation process is now open. We will publish guidance on applying to become a responsible body when the application process is launched. Official designations will be made 12 weeks after the designation process has closed."
        },
        {
            "text": "Habitat Management Monitoring Plan (HMMP) templates"
        },
        {
            "text": "Natural England will make HMMP templates available before BNG becomes mandatory. These will be suggested for land managers and their responsible bodies/local planning authorities to use."
        },
        {
            "text": "Digital tools"
        },
        {
            "text": "The credit sales service and the biodiversity register will launch when BNG becomes mandatory."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}