{
    "url": "https://movingon.blog.gov.uk/2023/07/20/bus-fire-investigation-reveals-important-lessons-for-industry-to-take-forward/",
    "title": "Bus fire investigation reveals important lessons for industry to take forward",
    "authors": [
        "Ian Bartlett"
    ],
    "categories": [
        "Guides and reports",
        "Maintenance workshop",
        "Vehicle testing"
    ],
    "pub_date": "2023-07-20T09:28:28+01:00",
    "content": [
        {
            "text": "Bus operators provide a vital service for people going to work, school or visiting friends and relatives and rely on being safely delivered to their destination. We know this is a challenging time for you as bus operators and drivers, particularly when the industry is facing pressure to attract drivers and deliver on service commitments."
        },
        {
            "text": "At DVSA, we want to work with you to improve bus safety and as part of that we have a responsibility to investigate bus fires and what can be done to prevent them."
        },
        {
            "text": "We have recently completed a study into a number of bus fires reported to DVSA between 2020 and 2022, to understand if there are any trends or concerns to address – which could help reduce bus fires."
        },
        {
            "text": "The full investigation into bus fires is published on GOV.UK but there are some specific findings we want to share with you, your drivers and the maintenance industry."
        },
        {
            "heading": 2,
            "text": "Timely and detailed reporting of bus fires and issues with components"
        },
        {
            "text": "By law, operators must report a vehicle catching fire. We found that a number of reports about bus fires are submitted to DVSA a long time after the incidents have taken place. They sometimes have little or poor information and no record of any investigation into the root cause of the fire."
        },
        {
            "text": "So we’re asking bus operators to report the incident to us as soon as possible after it has taken place. This will keep it fresh in the minds of those involved."
        },
        {
            "text": "Early reporting can help to explain the sequence of events and often provides valuable information in the diagnosis of what led to the fire. We have also improved our reporting process for bus fire incidents. This will help us identify and analyse trends, and make it easier for operators to report incidents."
        },
        {
            "text": "We also found similar issues with temperature warning lamps in the vehicle. While most drivers – and their employers – are responding to these appropriately, some do not. They either continue to drive or return to base. It’s vital that drivers react to vehicle warning lights at the time they appear."
        },
        {
            "text": "Bus operators must make sure their drivers understand the warning system on a vehicle before they start any journey – and get the right advice from the depot when this is reported."
        },
        {
            "heading": 2,
            "text": "Correct maintenance and repairs is vital to the safe running of buses"
        },
        {
            "text": "All vehicles that run with fuels, oils, and other flammable materials produce heat in the engine bay during service. DVSA assessed temperatures in the engine bay to discover whether we could identify a root cause of the fires."
        },
        {
            "text": "We carried out tests in both winter and summer, under different load capacities and in both urban and rural locations. This was to provide a full picture of bus service operations across the country."
        },
        {
            "text": "Reassuringly we couldn’t find any evidence that when buses are being used correctly and in accordance with their intended design that temperatures are reaching levels that exceed the manufacturer’s limit."
        },
        {
            "text": "Therefore, there is no indication that, by design or manufacture, buses or their parts lead to fires."
        },
        {
            "text": "This makes it even more important that operators have comprehensive and regular maintenance schedules running for all their buses and not rely on reacting when something goes wrong putting them out of action. This can leave customers losing faith in bus companies and question their reliability."
        },
        {
            "text": "To help make sure buses and the components within the vehicle don’t overheat, it is important that operators:"
        },
        {
            "text": "Manufacturers’ technical information should be made available to servicing teams and all repairs and servicing must be documented and signed."
        },
        {
            "heading": 2,
            "text": "Reporting defects as soon as they are identified "
        },
        {
            "text": "Drivers are in control of the vehicle at the time of any incident. We are grateful that training has enabled most drivers to do an excellent job of handling fires on the rare occasions they do occur. The absence of casualties reported demonstrates how well passengers have been evacuated during fires."
        },
        {
            "text": "As the responsible person during a journey, it is important that drivers:"
        },
        {
            "text": "This can all be achieved through comprehensive driver training, which the Confederation of Passenger Transport can offer guidance on."
        },
        {
            "text": "Take some time to look at the study results and give us your feedback in the comments below. This way, we can help you address issues and make sure that together we provide safe bus services for all."
        },
        {
            "text": " "
        }
    ]
}