{
    "url": "https://deframedia.blog.gov.uk/2023/07/20/coverage-of-the-launch-of-six-new-nature-recovery-projects/",
    "title": "Coverage of the launch of six new Nature Recovery Projects",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Natural England",
        "Nature"
    ],
    "pub_date": "2023-07-20T14:11:22+01:00",
    "content": [
        {
            "text": "There has been coverage on BBC News online, The Times, as well as on Farming Today and the Today Programme following the"
        },
        {
            "text": "announcement today (20 July) of six new Nature Recovery Projects which have been launched by Natural England and the government."
        },
        {
            "text": "The new projects cover an area bigger than the size of Hertfordshire – amounting to 176,000 hectares of land across England - and will create improved and better-connected habitats for wildlife and improve public access to nature. The projects will strengthen the national Nature Recovery Network and showcase delivering nature recovery at scale."
        },
        {
            "text": "The projects – supported by £7.4 million funding from Defra and Natural England - will also help to manage flooding and wildfire risks, and improve carbon stores – as well as build diverse habitats for wildlife such as the endangered wart biter cricket and the elusive twite."
        },
        {
            "text": "Tony Juniper, Chair of Natural England, said: "
        },
        {
            "text": "Environment Minister Trudy Harrison said:"
        },
        {
            "text": "Improving and connecting existing strongholds for wildlife, creating new habitats and investing in collaborative action for nature at scale will help achieve our pledge to protect 30% of our land and sea for nature by 2030, and create a sustainable future for people and the planet."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}