{
    "url": "https://homeofficemedia.blog.gov.uk/2023/07/20/electronic-travel-authorisation-eta-scheme-factsheet-june-2023/",
    "title": "Electronic Travel Authorisation (ETA) scheme factsheet – July 2023",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2023-07-20T16:10:37+01:00",
    "content": [
        {
            "text": "The government’s number one priority is keeping the UK safe. To strengthen the security of our border and improve travel, the UK is launching an Electronic Travel Authorisation (ETA) scheme - an ETA is a digital permission to travel to the UK."
        },
        {
            "text": "The ETA scheme is broadly for visitors who do not need a visa for short stays to the UK, or who do not already have a UK immigration status prior to travelling."
        },
        {
            "text": "It will launch for Qatari nationals from 25 October 2023. From 1 February 2024, the scheme will be introduced for nationals of Bahrain, Jordan, Kuwait, Oman, United Arab Emirates and Saudi Arabia."
        },
        {
            "text": "An ETA will cost £10 per applicant when the scheme opens, will permit multiple journeys and be valid for two years or until the holder’s passport expires – whichever is sooner.​​"
        },
        {
            "text": "ETAs will replace Electronic Visa Waivers (EVW) for nationals of Qatar, Bahrain, Kuwait, Oman, United Arab Emirates and Saudi Arabia – improving our offer as ETAs are cheaper and multi-use over a two-year period."
        },
        {
            "text": "By the end of 2024, the scheme will be a requirement worldwide for visitors who do not need a visa for short stays, including those visiting from Europe."
        },
        {
            "text": "How much does an ETA cost to a visitor?"
        },
        {
            "text": "How do people apply for an ETA?"
        },
        {
            "text": "How long is an ETA valid for?"
        },
        {
            "text": "How many visitors will this impact?"
        },
        {
            "text": "How will an ETA help UK border security?"
        },
        {
            "text": "What will happen if someone is refused an ETA?"
        },
        {
            "text": "How will the scheme work in the context of the Ireland-Northern Ireland border?   "
        },
        {
            "text": "Will Electronic Visa Waivers still be valid?"
        }
    ]
}