{
    "url": "https://environmentagency.blog.gov.uk/2023/07/20/improving-environmental-performance-through-our-farming-inspections/",
    "title": "Improving environmental performance through our farming inspections",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture"
    ],
    "pub_date": "2023-07-20T12:43:44+00:00",
    "content": [
        {
            "text": "By Kevin Austin, Head of Agriculture, Environment Agency"
        },
        {
            "text": "A year in numbers"
        },
        {
            "text": "Like most businesses and organisations, as we have passed from spring to summer, the Environment Agency’s farming team has been reflecting on what we have achieved in the last financial year."
        },
        {
            "text": "In the 2022-23 financial year, we were targeted with carrying out 4,000 farm inspections by the government. As the clock ticked around to midnight 1 April 2023, we had recorded 4,137."
        },
        {
            "text": "We are pleased to have met this target – it represents a ten-fold increase on inspections prior to the introduction of funding for our new agriculture regulation officers in 2021. In little over two years, we have created teams of officers around the country, trained them and put in place the systems and resources they need to do their jobs. Headline figures from our year of inspections are:"
        },
        {
            "text": "Agricultural land covers 70% of England and with 100,000 farms across the country, our visits are targeted where we know protected sites are at risk from pollution. To get the most benefit for the environment we need to first deal with the farming practices that pose the biggest threat in the areas that are most vulnerable."
        },
        {
            "text": "Our officers base their inspections around key areas of legislation covering Farming Rules for Water, and Storage of Silage, Slurry and Fuel Oil. Exactly what they cover will vary between inspections, but they will always look for indicators of pollution and any risk of pollution occurring, and that farmers understand the soil profile of their land and plan their use of nutrients properly."
        },
        {
            "text": "Trends we have seen"
        },
        {
            "text": "The chart below shows the top ten types of improvement actions we issued across the year from our inspections."
        },
        {
            "text": " "
        },
        {
            "text": "We use this data to help plan future visits and it gives us a better appreciation of the biggest challenges we have in regulating the sector. It is also an opportunity to engage with the industry about what things need to change to bring about improvements in environmental performance."
        },
        {
            "text": "Actions and outcomes"
        },
        {
            "text": "To give an idea what actually happens on a farm inspection, on a recent visit to a farm in Cheshire one of our officers carried out an inspection of the yard and surrounding areas and identified breaches of Farming Rules for Water and Storage of Silage, Slurry and Fuel Oil regulations. The breaches included dirty water running from the yard, silage effluent escaping, the silage container wall with no perimeter drain, and a non-compliant fuel tank."
        },
        {
            "text": "Our officer specified a number of improvements needed to properly divert dirty water to a slurry lagoon, contain effluent by installing a bund around the perimeter of the silage container as a further measure to minimise leakage and ensure proper separation of clean and dirty water with new drainage, to avoid pollutants leaching into the groundwater and streams. The farmer was also given advice which helped with the installation of new guttering, cross drains and clean water drains."
        },
        {
            "text": "In all such cases, officers write a report on the inspection, documenting the actions required of the farmer. We monitor the implementation of the improvement actions, in some cases agreeing temporary measures to allow time for permanent solutions to be implemented. We continue to follow up until all actions are completed – this may be over a period of several months or longer for major changes to farm infrastructure. Where farmers do not comply within the timescales we set out, we will take enforcement action."
        },
        {
            "text": "Improvements to slurry and silage stores and better soil testing are some of the key actions that we regularly identify and while we expect the agriculture sector to be compliant, we do not expect farmers to go it alone. Catchment Sensitive Farming ­­­— a project run by Natural England in partnership with the Environment Agency and the Department for Environment, Food and Rural Affairs — now provides services across the country and we routinely refer farmers to them for support in making the changes they need to."
        },
        {
            "text": "What’s next"
        },
        {
            "text": "The majority of farmers want to conform with the regulations and protect the environment – it is in their interests, after all. The challenges we face in protecting the environment and water quality are huge and the need to regulate the farming sector and work with farmers to improve environmental outcomes is vital."
        },
        {
            "text": "Over this coming year we will be making more use of digital tools at our disposal. The Environment Agency’s Remote Sensing team provides information to officers on the ground, using drone footage, satellite imagery and other mapping tools, so that inspectors can more effectively pinpoint and targets areas of environmental harm and possible causes, and offer solutions."
        },
        {
            "text": "We will be increasing the work the team does with proactive inspections – initially in the River Wye catchment - where they will be carrying out remote inspections. The team will contact landowners directly about any breaches they identify, with information on what they need to do to rectify the situation. This will then be followed up by one of our officers during their next farm inspection."
        },
        {
            "text": "While our aim as a regulator is to ensure compliance and the associated environmental benefits this brings, it is important to have enforcement as a tool for those who refuse to comply or wilfully cause environmental damage."
        },
        {
            "text": "Our inspection regime has been embedded over the past two years, and our expectation is that more farmers will be compliant without our prompting, enabling us to take a firmer line in cases where environmental damage has occurred. Enforcement activity requires concrete evidence and a solid case to put before the courts. Wherever we have this, we will be taking action."
        }
    ]
}