{
    "url": "https://ruralpayments.blog.gov.uk/2023/07/20/introducing-you-to-19/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2023-07-20T11:50:14+01:00",
    "content": [
        {
            "text": "Hello, I’m Paula and I design and deliver control frameworks which capture all the processes that need to be followed when RPA is administering a new scheme or grant, that enables farmers to receive payments. These controls provide the assurance that schemes meet the Government’s standards and legislation, as well as the requirements for managing public money."
        },
        {
            "text": "I’m currently leading on the control frameworks for the Claims and Monitoring element of the Slurry Infrastructure Grant, and for the 2023/2024 round of the Countryside Stewardship Facilitation Fund."
        },
        {
            "text": "RPA’s Scheme Control Frameworks are designed to ensure we have relevant controls in place to administer the grant or scheme, which in turn leads to accurate payments being made to farmers."
        },
        {
            "text": "Every day can be different in my role, but I usually start my day checking which calls I need to attend (there can be quite a few for the different themes of the Farming Investment Fund I’m involved in) and putting together a to-do list. Then it depends, but there’s usually a lot of engagement across the different parts of RPA to ensure we have the latest information on the grants we’ll be offering in the near future. I work closely with a number of teams within RPA to understand how grants are administered, and then ensure the controls needed are in place."
        },
        {
            "text": "In order to launch any new scheme, the Accounting Officer (our Chief Executive Paul Caldwell) has to be satisfied that it meets the standards set out by the Government and provides value for money. I make sure he’s presented with a balanced representative report of the scheme, including our assessment of its readiness for ‘go-live’ so he’s fully informed before formally agreeing to its launch. Once approved and live, farmers can apply for the scheme, or grants, if they’re eligible."
        },
        {
            "text": "I think the aspect of my role that I enjoy the most is working collaboratively with the range of interested parties across RPA and Defra. I’m a very people-oriented person and it’s a real pleasure engaging with them to achieve our common aims."
        },
        {
            "text": "I’ve worked in many roles at RPA over the years, most recently facilitating EU audits, but I’ve also worked in more customer-facing roles in the past, leading teams processing Single Payment Scheme payments and before that Arable Area Payments."
        },
        {
            "text": "I’m passionate about the environment and anything I can do to inspire others makes me proud. I’m part of RPA’s Net Zero network, and recently wrote an article for our internal website about Environmental Sustainability, where I shared my own journey, encouraged colleagues to join the network and also look at what they could do in their own communities to help the environment."
        },
        {
            "text": "In January last year, after a 34-year career with RPA (and its predecessor, the Intervention Board), I took on a new challenge and started a Degree in Applied Management and Environmental Sustainability in addition to my day-to-day job. It’s a lot of work, and others my age might be eyeing retirement, but I’m thoroughly enjoying the experience and look forward to graduating next year and using the experience I’ve gained to make a real difference in the future."
        },
        {
            "text": "I live near Newcastle with my husband and son, who is back home now after a spell away at university. We don’t drive, so use trains and buses quite a lot to get where we want to go – sometimes it might not be the easiest way but knowing that I’m making less of an impact with my carbon footprint makes it all worthwhile!"
        },
        {
            "text": "I like visiting new places, walking, and exploring with my son who shares my adventurous spirit. I love nothing better than spending time in nature, whether that’s in my local park or further afield. I’m also involved with several community groups locally that are trying to bring environmental benefits to the area. When I’m at home, I spend as much time as I can researching my family history, just to get a little insight into what kind of lives my ancestors lived - I’ve been doing this a long time and have found relatives all over the world."
        }
    ]
}