{
    "url": "https://cspl.blog.gov.uk/2023/07/20/reforming-standards-in-central-government-a-step-forward/",
    "title": "Reforming standards in central government - a step forward",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Standards Matter 2"
    ],
    "pub_date": "2023-07-20T16:14:50+01:00",
    "content": [
        {
            "text": "We welcome the Government’s consideration of and detailed response to our 2021 Upholding Standards in Public Life report and recommendations, as well as those made in the Boardman report and by PACAC, published today."
        },
        {
            "text": "We are pleased that the Government has decided to accept a number of our recommendations, particularly around greater transparency of government departmental returns and the government’s Business Appointment Rules including, for the first time, a deed that will legally commit Ministers to following those Rules and enable sanctions for those that don’t. We also welcome the greater transparency around direct ministerial appointments and agreement to our recommendation that appointments of Non-Executive Directors of government departments will in future be regulated under the Governance Code for Public Appointments. These are steps in the right direction."
        },
        {
            "text": "Our Committee also made a number of other important recommendations about the powers of the Independent Adviser on Ministers’ Interests, the status of the Ministerial Code and placing ethics bodies on a statutory footing but regrettably the Government has not accepted these recommendations."
        },
        {
            "text": "Overall, progress has been made, but it should not be the end of the story.  We would encourage the government to keep the remainder of our recommendations under review. The rules that govern public office require constant attention."
        },
        {
            "text": "The seven Principles of Public Life - honesty, integrity, selflessness, openness, objectivity, accountability and leadership- are the bedrock that underpins and gives meaning to the rules that govern public office- as well as for those companies or charities delivering public services on behalf of the taxpayer.  These principles have stood the test of time, but the rules and processes that express them for particular office holders require regular review to ensure they deal with emerging risks and challenges and take account of public expectations."
        },
        {
            "text": "The last week has also seen new proposals on public standards from the Labour Party."
        },
        {
            "text": "I am pleased that politicians on all sides recognise that standards matter to the public, businesses and to our international reputation and are keen to improve the current system. But there is little room for complacency while the public perception of standards remains low. Standards failures are profoundly damaging to these already low public perceptions."
        },
        {
            "text": "Today’s announcement will improve some aspects of the standards regime in central government. Some repairs have been done but the job is never finished."
        },
        {
            "text": " "
        },
        {
            "text": "CSPL has published a table noting a summary of the government response to each of the Committee's recommendations and our assessment of whether or not the recommendation has been met."
        },
        {
            "text": "Follow the Committee on twitter @PublicStandards"
        },
        {
            "text": "Read previous Committee reports"
        },
        {
            "text": "What are the Nolan Principles?"
        },
        {
            "text": "Watch a short film about the work of the Committee"
        }
    ]
}