{
    "url": "https://nationalscreening.blog.gov.uk/2023/07/20/report-highlights-a-busy-year-of-firsts-for-the-uk-nsc/",
    "title": "Report highlights a busy year of firsts for the UK NSC",
    "authors": [
        "Professor Sir Mike Richards"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-07-20T15:17:25+01:00",
    "content": [
        {
            "text": "Today we publish the UK National Screening Committee’s (UK NSC’s) latest annual report, summarising the work and achievements of the year 1 April 2022 to 31 March 2023."
        },
        {
            "text": "This year, my first as chair, has been an exciting and challenging time for the independent scientific committee that advises the governments and the NHS in all 4 UK countries on screening policy."
        },
        {
            "heading": 2,
            "text": "Expanded remit "
        },
        {
            "text": "This was the first year under the UK NSC’s expanded remit. That meant we could consider, for the first time, targeted screening (identifying people with a higher risk of a condition beyond demographics such as age or gender) and stratified screening (tailoring testing to individual risk) in addition to whole population screening programmes."
        },
        {
            "text": "Under this expanded remit, we recommended the introduction of the country’s first national targeted screening programme, which will be for people aged 55 to 74 years who smoke, or have a history of smoking. Targeted lung cancer screening has the potential to save thousands of lives and planning is now under way to establish how it will be implemented across the UK."
        },
        {
            "text": "We were also delighted to be able to make a positive recommendation that the rare genetic condition tyrosinaemia type 1 (TYR1) should be added to newborn blood spot screening programmes across England, Scotland, Wales and Northern Ireland. Screening should increase the number of babies with TYR1 who are detected before the onset of symptoms, so they can receive timely treatment and avoid the need for liver transplantation."
        },
        {
            "text": "Good quality, evidence-based screening saves lives and reduces illness. But screening can cause harms, including false positive and false negative results, overtreatment, treatment risks and anxiety. That is why the UK NSC continues to set its evidential bar high and why evidence remains at the heart of everything we do. We assess the evidence for screening against internationally recognised criteria and only recommend screening if high quality, peer-reviewed published evidence shows that the benefits outweigh any harms."
        },
        {
            "heading": 2,
            "text": "Busy time for screening"
        },
        {
            "text": "During 2022 to 2023, we reviewed the evidence on screening for 6 conditions and received a record number of 30 proposals under our annual call for new topics."
        },
        {
            "text": "We also established 2 new expert groups – the research and methodology group (RMG), which will help provide clarity on the UK NSC’s research and evidence requirements, and the blood spot task group, which will help identify practical and innovative approaches to the development and evaluation of evidence, and the facilitation of research, in newborn blood spot screening."
        },
        {
            "text": "The annual report highlights many other important projects that have been keeping us busy. These include exploring the potential future use of risk stratification in the breast screening programme and looking at how multiple condition test technologies might be used in screening programmes of the future."
        },
        {
            "heading": 2,
            "text": "Team effort"
        },
        {
            "text": "I think we can look back with great pride on a year of significant achievements and I thoroughly recommend this annual report to you."
        },
        {
            "text": "I would like to say a big thank you to everyone who has contributed to the work summarised in it, including my fellow UK NSC members, the secretariat in the Department of Health and Social Care (DHSC), the devolved governments, the NHS national screening teams and all our stakeholders."
        },
        {
            "heading": 2,
            "text": "Latest minutes published"
        },
        {
            "text": "We have also published the draft minutes of the most recent UK NSC meeting held on 15 June 2023 in Cardiff."
        },
        {
            "text": "The meeting included agenda items on screening for vasa praevia, neonatal diabetes and craniosynostosis."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}