{
    "url": "https://planninginspectorate.blog.gov.uk/2023/07/20/unlocking-the-power-of-volunteering-civil-servants-embrace-team-volunteering-days/",
    "title": "Unlocking the power of volunteering: Civil servants embrace team volunteering days",
    "authors": [
        "Jade Woodger-Bassford",
        "Jessica Jones"
    ],
    "categories": [
        "People",
        "Public service"
    ],
    "pub_date": "2023-07-20T15:15:16+01:00",
    "content": [
        {
            "text": "Teamwork and community engagement are vital aspects of public service, extending far beyond the confines of office walls. Civil servants are increasingly recognising the value of team volunteering days, which provide unique opportunities to give back to society while strengthening team dynamics and fostering a sense of purpose."
        },
        {
            "text": "In this spirit, the Environmental Services Team (EST) within the Planning Inspectorate embarked on a volunteering day at Bristol Hospitality Network (BHN), making good use of the organisation’s special leave policy that allows up to six volunteering days per year."
        },
        {
            "text": "Jessica Jones and Jade Woodger-Bassford, placement students within EST, share the story of their volunteering experience, showcasing the immense potential for civil servants to create positive change and strengthen their commitment to public service."
        },
        {
            "text": "On a spring day, 16 members from the EST eagerly embarked on their volunteering mission at one of BHN's hostels. Embracing their inner DIY enthusiasts, the team engaged in gardening and redecorating communal areas, aiming to create a welcoming and nurturing environment for those seeking refuge."
        },
        {
            "text": "True to their environmentally conscious ethos, the EST team opted for sustainable transportation options, utilising nearby cycle paths and public transport to reach the hostel. Upon arrival, they were greeted warmly by Graham, the BHN maintenance coordinator, and the hostel residents. Following a comprehensive briefing on safety measures and assigned tasks, the team split into three groups, each led by a designated team leader."
        },
        {
            "text": "The gardening team, known as \"Team Garden,\" set to work revitalising the front garden and courtyard. Despite the ominous forecast, luck was on their side as the weather remained dry. They cleared the raised beds of debris and removed accumulated waste, diligently weeding the gravel and scraping away moss from the slabs. After a productive morning in the garden, Team Garden transitioned inside to assist with painting the kitchen and dining room. Their efforts were met with the appreciation of the hostel residents who even joined in."
        },
        {
            "heading": 3,
            "text": "The garden and courtyard before and after"
        },
        {
            "text": "Meanwhile, \"Team Paint\" undertook the challenge of refreshing the hostel's tired communal areas. With two halls and multiple landing areas spanning three floors, the task was no small feat. Equipped with long arm rollers and paintbrushes, the team worked efficiently, impressively finishing their assigned areas by lunchtime. Their dedication was such that Graham had to make an unscheduled shopping trip for more paint. Despite the inevitable challenges of avoiding paint drips, the team worked together to ensure a thorough cleanup, showing their commitment to leaving the space better than they found it."
        },
        {
            "text": "Simultaneously, the initial task for \"Team Sand\" involved sanding down doors and door frames layered with old paint. Once the dust was wiped away, the team eagerly applied fresh white gloss paint, witnessing the remarkable difference it made in restoring the doors' appearance."
        },
        {
            "text": "To express gratitude for their hard work, BHN treated the EST team to a delightful Gambian themed lunch. This well deserved break offered an opportunity to reflect on the morning's accomplishments and share stories of personal achievements."
        },
        {
            "heading": 2,
            "text": "What a difference a day makes"
        },
        {
            "text": "The EST team embraced the volunteering experience, relishing the chance to step away from screens and engage in practical activities that fostered team cohesion. The impact of their efforts was evident not only in the physical transformation of the hostel but also in the positive change it brought to the lives of those residing there. The gratitude expressed by Graham, who lauded the remarkable difference a \"lick of paint\" made, was a testament to the effect of their actions. Inspired by the EST's efforts, BHN is now exploring the possibility of promoting more team volunteering opportunities, amplifying the potential for civil servants to make a lasting impact in their communities."
        },
        {
            "text": "By embracing team volunteering days, civil servants can not only make a difference in the lives of others but also strengthen their commitment to public service and foster a stronger sense of unity within their teams. The inspiring story of the EST's volunteering day at BHN serves as a call to action, urging civil servants to seize the opportunities available to them and contribute to positive change in their communities."
        }
    ]
}