{
    "url": "https://defralanduse.blog.gov.uk/2023/07/20/working-in-land-use-interview-with-land-use-divisional-director-rachel-fisher/",
    "title": "Working in Land Use: interview with Land Use Divisional Director, Rachel Fisher",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Land Use"
    ],
    "pub_date": "2023-07-20T10:45:42+01:00",
    "content": [
        {
            "text": "Rachel Fisher, Defra's Land Use Policy Divisional Director"
        },
        {
            "text": "What is land use policy, what does it mean for England and what do policy makers do day to day? We sat down with the Land Use Policy Team's Divisional Director to find out..."
        },
        {
            "text": "What’s your background, and how did you come to lead the Land Use Policy Team? "
        },
        {
            "text": "I’ve always been fascinated by how humans design and shape the world around them. This led me to study urban history, and then urban regeneration. Most of my career was spent in the ‘government adjacent’ world of professional bodies and quangos, but in 2017 I joined the Cities and Local Growth Unit to lead our work on devolution for housing and infrastructure. I then led the teams focussing on high streets, regeneration, towns and infrastructure investment. It was a brilliant job, but I got increasingly interested in the environmental impacts of development, which is why in 2020 I joined Defra to lead the Land Use Policy team."
        },
        {
            "text": "What does the Land Use team do, and why is it relevant to me? "
        },
        {
            "text": "The work of the team focuses on where development and the environment meet. We work closely with colleagues at the Department for Levelling Up, Homes and Communities to ensure planning reform not only protects but enhances the environment, including work to deliver nutrient mitigation and biodiversity net gain.  We’ve also developed a new programme of work to deliver a national Land Use Framework for England."
        },
        {
            "text": "As a team, we keep in mind the balancing act between delivering infrastructure (like energy, transport, housing) and making sure that we can protect and enhance the natural environment. It’s a tricky one, but one that I think is most usefully understood at a local level. As civil servants, we advise ministers with excellent evidence (whether quantitative or more qualitative) and then they take the decisions on the best course of action."
        },
        {
            "text": "The thing that motivates me in this role, and why Land Use is so publicly relevant, is that we’re looking for solutions to the biodiversity and climate crisis, whilst ensuring vital infrastructure is delivered. Good green infrastructure is not only vital for biodiversity and climate mitigation, we know it has great benefits for human health, both mental and physical."
        },
        {
            "text": "We have a broad base of stakeholders that we engage with regularly to understand how the policies we are developing will work on the ground (quite literally). This includes environmental charities, local authorities, land managers, ecologists and other professionals. It’s important to be able to test out thinking so that the legislation and regulations are fit for purpose."
        },
        {
            "text": "What are they key priorities for the team currently? "
        },
        {
            "text": "I like to think of 2023 as the ‘year of delivery’ for the Land Use team – we spent much of 2021 working on the Environment Act (passed in November) and then 2022 working through the details of implementation, and now we are in 2023 and we have laid the regulations and guidance for Local Nature Recovery Strategies (and have just appointed our Responsible Authorities), Mandatory BNG comes in from November 2023, and we have committed to publishing a Land Use Framework this year."
        },
        {
            "text": "This year we are also working closely with Natural England and DLUHC on delivering a Nutrient Mitigation Scheme to support areas impacted by nutrient pollution to mitigate that pollution (often through nature-based solutions) and then ‘unlock’ housing development."
        },
        {
            "text": "What does a typical day look like for you?"
        },
        {
            "text": "It is an absolute cliché but there isn’t really a typical day. In a week I will be having conversations with stakeholders, meeting with ministers, joining up with other teams in Defra and other government departments, and supporting my team through coaching / management. I also do a lot of reading, whether of advice that is going up to ministers, or external reports, and of course the deluge of emails."
        },
        {
            "text": "On a really lucky day I get to go on a site visit – where we can see biodiversity enhancements in action and that gives me enormous joy to see the wonderful things that are happening in the real world. I also have youngish kids so I spend a lot of my time balancing my work responsibilities with my home life."
        },
        {
            "text": "Sounds like a lot for a day job! What do you do to unwind?"
        },
        {
            "text": "As above.... with a busy job and a young family I don’t have huge downtime but I am love walking and listening to podcasts (or going on adventure walks with the kids where we just ‘notice’ things). We recently got a puppy, so I suspect I’ll have even more time spent on walks."
        }
    ]
}