{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/07/23/cma-proposes-next-steps-for-improving-mobile-platforms-in-the-uk/",
    "title": "CMA proposes next steps for improving mobile platforms in the UK",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "Digital Markets Unit"
    ],
    "pub_date": "2025-07-23T11:34:20+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What’s happening today "
        },
        {
            "text": "Under the new digital markets competition regime, the Competition and Markets Authority (CMA) can take targeted, proportionate action to improve competition in critical digital markets. "
        },
        {
            "text": "Today we’ve announced proposals to designate Apple and Google with strategic market status (SMS) in mobile platforms. To provide greater certainty for the market, we have also published roadmaps of potential actions we would take to deliver better outcomes for businesses, consumers and the UK economy."
        },
        {
            "text": "We are consulting on these provisional designations ahead of final decisions in October. Should Apple or Google be designated, we would expect to begin consulting on a first set of interventions from autumn 2025. "
        },
        {
            "heading": 2,
            "text": "Why mobile platforms matter to the UK "
        },
        {
            "text": "Almost every adult in the UK has access to a mobile device (a smartphone or tablet) and almost all of these will have a ‘mobile platform’ provided by Apple or Google. Mobile platforms include an operating system; a store where people can download apps; and browser capability so people can access the internet on their mobile device. Currently, 90 to 100% of UK mobile devices run on Apple or Google’s mobile platform. "
        },
        {
            "text": "Both Apple and Google also face limited competition on their browsers. Apple’s Safari browser has a 80 to 90% share on Apple’s mobile ecosystem, while Google’s Chrome has a 70 to 80% share of Android users. "
        },
        {
            "text": "As consumers, these platforms help us search for information, make transactions, connect on social networks, watch videos, and play games."
        },
        {
            "text": "For UK businesses, apps are now an important (sometimes sole) route to reach customers – from transport and takeaways, to shopping, finance and fitness."
        },
        {
            "text": "And for app and web developers, these 2 platforms are essential gateways through which they must operate to offer their services."
        },
        {
            "text": "The UK has a vibrant app developer community, representing Europe’s largest app economy by revenue and app developer count. In total, the UK app economy generates an estimated 1.5% of the UK’s GDP and supports around 400,000 jobs here. As a result, the app economy is now an engine of UK growth, particularly in strategically important sectors like financial services and creative industries. Fintech stands out, with over half of all UK unicorns and more than £18 billion in inward investment over the past 3 years. Meanwhile, the gaming sector adds £6 billion in GVA, with its fastest-growing segment – mobile gaming – generating nearly £2 billion annually. "
        },
        {
            "text": "It is essential that this part of the digital economy works well. To ensure UK consumers benefit from the latest innovations and a high-quality user experience, as well as more choice and lower prices. To power the success of businesses across the economy. And to unlock opportunities for all players in mobile platforms (large and small) to invest, innovate and grow – including UK businesses scaling to become globally competitive."
        },
        {
            "heading": 2,
            "text": "What we have heard so far through our investigations"
        },
        {
            "text": "Apple's and Google's mobile platforms hold an effective duopoly, but they have very different business models. Some of the key concerns across both firms include: "
        },
        {
            "text": "In relation to Apple, developers can’t offer their apps through other stores or via direct download (‘sideloading’) or use their own payment systems. Other companies must base alternative browsers on Apple’s own browser engine software. Apple’s restrictions on app developers’ access to features and functionality within its operating system can affect a range of customer offerings – from digital wallets and AI services, to how well smartwatches, gaming headsets or health-tech tools connect with iPhones and iPads. This could disadvantage UK app developers and mean UK users miss out on innovations, as well as facing fewer choices and higher costs. "
        },
        {
            "text": "While Google allows sideloading and alternative app stores, we have heard that friction and warning screens discourage it in practice. Google’s agreements with device manufacturers (like Samsung and Motorola) also influence which apps are pre-installed and set as defaults, giving its own services a head start and limiting visibility for rivals."
        },
        {
            "heading": 2,
            "text": "Action under the digital markets competition regime"
        },
        {
            "text": "To designate a firm with ‘SMS’, the CMA must demonstrate that it meets 2 legal tests: ‘substantial and entrenched market power’ and a ‘position of strategic significance’. We have provisionally found both Apple and Google to have met these tests in relation to mobile platforms."
        },
        {
            "text": "Action is ongoing around the world to address similar issues to those under investigation here. However, if designated, the unique design of the new regime allows the CMA to address specific UK impact through highly targeted, bespoke and flexible measures. Any action we take must be proportionate to tackle the harms and part of a participative process, including the largest firms, broader market participants, and consumer groups."
        },
        {
            "heading": 2,
            "text": "Roadmaps of possible measures to improve competition in mobile platforms"
        },
        {
            "text": "The CMA is also applying our ‘4Ps’ – proportionality, pace, predictability and process – here, to avoid hampering innovation or creating uncertainty which could chill investment. To support pace and predictability, we’re going further than the legislation requires by publishing a roadmap for each investigation. These lay out the phased approach to actions we might take during the first half of any designation period. Measures outlined in the roadmaps focus on the following areas."
        },
        {
            "text": "Given the important role of both Apple and Google in the distribution of apps a key early priority will focus on ensuring fair dealing for app developers in app distribution."
        },
        {
            "text": "For Apple we will focus on interoperability to ensure app developers have access to the functionality they need to innovate and compete:"
        },
        {
            "text": "For both Apple and Google we will focus on consumer choice and ensuring consumers have a genuine choice over the services they use on their devices and are not steered to Apple and Google’s own services."
        },
        {
            "text": "We will also explore the factors likely to be important for the development of AI services like voice assistants on mobile devices, to ensure a level playing field in this rapidly advancing sector."
        },
        {
            "heading": 2,
            "text": "Wider context "
        },
        {
            "text": "In a number of jurisdictions, such as the EU, the US, Japan, and Brazil, action is underway to drive more competition in mobile platforms. Consumers and businesses are already benefitting from this in other jurisdictions. For example, in the US developers can now steer users outside the Apple app store to complete purchases, leading to tangible improvements – like Spotify offering in-app links for audiobooks and Proton announcing that it is cutting prices for its privacy and encryption services by up to 30%. In the EU, consumers can now choose from a variety of digital wallets offering innovative benefits, like integrated cashback and consolidating purchase information."
        },
        {
            "text": "In line with the CMA’s prioritisation principles and the UK government’s strategic steer, we are carefully observing these developments around the world. Our goal is to ensure any action we take here delivers the best possible outcomes for the UK in the most proportionate way possible. We’re also working closely with other regulators in the UK, like the Financial Conduct Authority, to ensure action in areas like digital wallets is well-coordinated."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "In line with our participative approach, we will continue to engage with a broad range of stakeholders as we consult on our proposed designation decisions between now and October. We’re also inviting views on the possible interventions in our roadmaps. If Google or Apple are designated, we would expect to begin consulting on priority interventions from autumn 2025. "
        },
        {
            "text": "We expect to provide updated roadmaps in the first half of 2026, reflecting stakeholder views and relevant international developments."
        }
    ]
}