{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/07/23/trusted-digital-identities-in-financial-services-new-mlr-guidance-announced/",
    "title": "Trusted digital identities in financial services: new MLR guidance announced",
    "authors": [
        "Eleanor Curry",
        "Graham Francis"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-07-23T15:25:37+01:00",
    "content": [
        {
            "text": "Trusted and secure digital identity services have a vital role in enabling productivity and growth within the financial services sector, offering process efficiencies and helping to combat identity fraud. "
        },
        {
            "text": "Over the past few years, we’ve heard from sector firms about a lack of clarity on how digital identities can be used to comply with Money Laundering Regulations (MLRs). This uncertainty has limited adoption. "
        },
        {
            "text": "We are therefore hugely pleased to announce a significant step towards removing this uncertainty: that we’ll be working with HM Treasury to produce new MLR guidance that recognises the role of reliable digital identities. This commitment comes after the role of digital identities to support growth was made clear in the Industrial Strategy.  "
        },
        {
            "heading": 2,
            "text": "Improving the effectiveness of Money Laundering Regulations: the role of digital identities "
        },
        {
            "text": "The announcement of new guidance on use of digital identities came as part of HM Treasury’s wider consultation response on Money Laundering Regulations on 17 July 2025.  "
        },
        {
            "text": "The consultation response, which covers a package of changes that will be made to the MLRs to close loopholes, clarify requirements and ensure customer due diligence, was informed by more than 200 submissions from across industry.  "
        },
        {
            "text": "In recognising sector asks to set up government accreditation and standards for digital identity technologies, the consultation response highlights that these needs are met through the Data (Use and Access) Act. "
        },
        {
            "text": "The Data (Use and Access) Act, passed earlier this year, places digital identity standards on a statutory footing. This includes establishing a legal basis for the UK digital identity and attributes trust framework. The trust framework is supported by a certification process that is recognised by the UK Accreditation Service (UKAS), meaning that certified digital identity services are subject to regular audits. "
        },
        {
            "text": "The announced joint guidance will provide clarity on the definition of a digital identity and give further detail on how digital identities can be used in line with the MLRs’ risk-based approach.  "
        },
        {
            "text": "It will also seek to clarify how MLR requirements interact with the digital identity trust framework set up under the Data (Use and Access) Act.  "
        },
        {
            "heading": 2,
            "text": "Financial services in the Industrial Strategy  "
        },
        {
            "text": "The MLR consultation shows the increasing commitment across government to enabling the use of trusted and secure digital identities in the financial services sector.  This commitment is also clear in the recently published Modern Industrial Strategy. "
        },
        {
            "text": "The Financial Services Growth and Competitiveness Strategy, highlights the role of digital identities in reducing the costs of fraud and compliance, and indicates that the financial services sector could be one of the biggest beneficiaries of the £4.3 billion in economic efficiencies unlocked by the Data (Use and Access) Act.   "
        },
        {
            "text": "The Professional and Business Services Sector Plan published earlier in July recognises the role that digital identities can play in streamlining checks and processes for firms and customers. It highlights how digital identities can help to meet government’s commitment to reduce the costs of regulation for businesses by the end of this Parliament.  "
        },
        {
            "text": "Both strategies highlight the role of digital identities within MLRs, and set out that government will take steps to inform, encourage and reassure financial institutions seeking to use trustworthy digital identities.  "
        },
        {
            "text": "The support for digital identities in the Industrial Strategy follows calls for increased use of digital identities from financial sector bodies, including FCA , CFIT and UK Finance. Similar views are reflected in the recent Technology Adoption Review, published in parallel with the Industrial Strategy, which calls on government to work with the financial services sector to demonstrate best practice on digital identity compliance.  "
        },
        {
            "heading": 2,
            "text": "Moving forward "
        },
        {
            "text": "Digital identities are already being used in the financial services sector, with around 27% of people surveyed in our recent Digital Identity Sectoral Analysis saying they had used a digital identity check to help them open a bank account.   "
        },
        {
            "text": "And consumers are already reporting benefits from this switch to digital, with 75% of individuals in our survey saying that it was a quicker process than verifying identity with a physical document.   "
        },
        {
            "text": "Through building trust in digital identities via our framework of standards and governance, and working across government to produce guidance where needed, OfDIA is working to build the industry confidence that will accelerate the adoption of digital identities, and the realisation of the security and efficiency benefits they offer.  "
        },
        {
            "text": "We’re excited to see how the sector develops and implements digital identity solutions, and will continue to use this blog to update you on our work with HM Treasury and across government. "
        }
    ]
}