{
    "url": "https://deframedia.blog.gov.uk/2024/01/14/coverage-of-environment-agency-enforcement-of-farming-regulations-in-the-river-wye/",
    "title": "Coverage of Environment Agency enforcement of farming regulations in the River Wye",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Pollution",
        "Weekly stories"
    ],
    "pub_date": "2024-01-14T16:41:59+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Today (14 January) there is coverage in the Observer of claims by campaign group River Action about the Environment Agency’s regulation of poultry farms in the River Wye Catchment."
        },
        {
            "text": "River Action is quoted claiming that the Environment Agency has “allowed” run-off from free-range poultry farms to pollute the River Wye. This is untrue. The storage and processing of animal excreta and effluent is closely regulated and where non-compliance is identified, the Environment Agency does not hesitate to take appropriate enforcement action."
        },
        {
            "text": "We regulate agricultural activities which could cause environmental harm through the Farming Rules for Water, the Slurry Silage and Agricultural Fuel Oils (SSAFO) Regulations and the Nitrate Pollution Prevention Regulations, which all apply to all farms."
        },
        {
            "text": "These regulations are set by Defra, and enforced by the Environment Agency, which carries out 4000 farm inspections a year to tackle water pollution from farming. Last year this led to more than 5,000 actions undertaken to improve farm practices."
        },
        {
            "text": "We have been clear that, under the SSAFO Regulations, farmers must not put slurry storage tanks, effluent tanks, channels or reception pits within 10 metres of inland or coastal waters without written agreement from the Environment Agency."
        },
        {
            "text": "Furthermore, it is an offence to cause or knowingly permit a water discharge activity or groundwater activity unless authorised by an environmental permit. Farms with permits are required to comply with the specifics of their permit. Those that fail to comply face enforcement action and revocation."
        },
        {
            "text": "If farms are in a nitrate vulnerable zone (NVZ) there are extra rules and clear guidance for storing organic manures."
        },
        {
            "text": "Wherever anyone, a member of the public or a partner organisation, identifies a concern with pollution they should notify the Environment Agency immediately via its 24-hour incident hotline: 0800 80 70 60."
        },
        {
            "text": "An Environment Agency spokesperson said:   "
        }
    ]
}