{
    "url": "https://aphascience.blog.gov.uk/2021/08/09/2020-science-review/",
    "title": "2020: An insight into our scientific achievements",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2021-08-09T09:00:21+01:00",
    "content": [
        {
            "text": "It is that time of year again when APHA produces a formal review of its science, this year looking back over 2020. You can read the review here on GOV.UK."
        },
        {
            "text": "This summary review sets out a wide range of science highlights achieved in 2020 in support of the Animal and Plant Health Agency (APHA) Science Strategy 2021-2026."
        },
        {
            "text": "It shows the fantastic range of animal and plant health expertise within the agency and demonstrates the importance and value of linking our surveillance and research activities to rapidly investigate and respond to new threats; including those with potential public health impact. It also shows our key role in the protection of animal and plant health and animal welfare; our mission as one of the World’s leading research centres in animal and plant health."
        },
        {
            "text": "The science highlights are grouped around our science portfolios as well as the main scientific disciplines working across APHA."
        },
        {
            "heading": 3,
            "text": "Some of the highlights include:"
        },
        {
            "heading": 3,
            "text": "Our science blog"
        },
        {
            "text": "Important achievements are published regularly on the APHA science blog with the aim to improve the communication of our science to a wider audience. It covers a range of scientific highlights from special interest stories on our scientists through to more detailed reports on the excellent science we do."
        },
        {
            "text": "You can subscribe to the blog or follow the work of APHA via our official social media platforms: Facebook, Twitter and LinkedIn. These are regularly updated with news stories, calls to action and notification of the publication of new science blogs."
        }
    ]
}