{
    "url": "https://nationalscreening.blog.gov.uk/2021/08/09/25-years-on-how-the-uk-nsc-has-transformed-screening-for-the-better/",
    "title": "25 years on: how the UK NSC has transformed screening for the better",
    "authors": [
        "Dr Angela Raffle"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-08-09T16:43:09+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The UK National Screening Committee (UK NSC) first met in July 1996. In this blog article to mark the committee’s 25th anniversary, Dr Angela Raffle explains how the UK NSC has helped transform screening for the better from the ‘bad old days’ of haphazard, ineffective and harmful activities."
        },
        {
            "text": "In 1985, shortly after moving from Birmingham to Bristol as a senior registrar in public health, my boss asked me to help sort out our local cervical screening programme. At medical school I’d been taught that screening was very simple. All you needed to understand was sensitivity and specificity. Coffee-time conversations with Professor George Knox in the Birmingham public health department told a different story: evaluation and organisation were complex and essential, cervical screening was not yet living up to its promise, and screen-detected cytological abnormalities were far more common than the condition we were trying to prevent."
        },
        {
            "text": "I had worked with laboratory scientists and paediatricians in charge of newborn phenylketonuria screening, so had seen what good programme organisation could look like. I fully expected that once we’d established a comprehensive call and recall system for cervical screening in Bristol then deaths from cervical cancer in our area would vanish. How wrong I was."
        },
        {
            "text": "The programme for the Bristol area was, thanks to the work of pathologist Dr Elisabeth Mackenzie, well ahead of the game. Soon we were calling up the entire eligible population, achieving very high uptake, using information for participants in 8 different languages, running a training school and an annual training event for everyone involved, achieving watertight follow-up and failsafe procedures, and meeting all quality standards, including for colposcopy and treatments."
        },
        {
            "text": "Yet we did not see the claimed 90 per cent drop in deaths that had supposedly been achieved in Iceland, parts of Scotland, and British Columbia. Not only that, but the numbers of screened women being referred for colposcopic investigation was enormously high, given that cervical cancer in the UK had been an uncommon and declining cause of death even before screening began – on a par with oral cancer."
        },
        {
            "heading": 2,
            "text": "Honesty essential for informed consent and for learning"
        },
        {
            "text": "It was then I began properly delving into the world literature. This was a sobering experience. The scientific quality of most of the papers claiming to show benefit from screening was appalling. Attention to the full consequences of screening, including all the unintended consequences, was virtually non-existent. The notion that it is unethical to blunder into the life of a healthy person to tell them, on the basis of no evidence at all, that a likely innocent and transient condition is in your view serious and ‘needs’ potentially harmful treatment, seemed to be lost on almost everyone."
        },
        {
            "text": "It struck me that the number of people who really understood the complexities of screening was very small, and the evangelical tone of the discourse surrounding screening at that time meant anyone who spoke honestly risked being branded an ‘anti-screener’. Many times when speaking at meetings or conferences I was told: “What you say is true but you must not say it because it will undermine the programme”. My reply was always:"
        },
        {
            "text": "We are not talking about a religion, we are talking about a tax-funded public health programme that should do more good than harm at affordable cost. Honesty is essential, for informed consent and for learning."
        },
        {
            "text": "What happened next was important. Across the UK, those of us closely involved in cervical screening began to meet up, share experiences and share data. Muir Gray led this ‘network’, bringing an important culture of openness and integrity. Once cervical screening was on the right track Muir then took the lead on rolling out the Forrest Committee recommendations on breast screening."
        },
        {
            "text": "After that, the contrast between the quality-assured national programmes and the hundreds of haphazard, ineffective and harmful opportunistic screening activities taking place unofficially, became too stark to ignore. This enabled the successful establishment in 1996 of the UK NSC. Step by step this transformed, for the better, the policy-making, research, quality of delivery, and user involvement."
        },
        {
            "text": "Attempts to ignore or distort the science and the potential consequences or harms of screening are ever present. Some of these attempts are simply motivated by a well-intentioned belief that early detection must always be right."
        },
        {
            "text": "There is also still the need to ensure good professional and public understanding of screening. This is where I have focused my effort throughout my career both locally and nationally; through research, face to face teaching, working with the media, producing online learning materials, and through publication of our book Screening: evidence and practice1 (now in its second edition)."
        },
        {
            "text": "Given the counterintuitive nature of screening, and the many pressures to ‘sell’ unvalidated screening to well-meaning clinicians and the general public, this work remains essential."
        },
        {
            "text": "1A.E. Raffle, J.A.M. Gray, A Mackie. Screening: Evidence and Practice. 2nd edition. Oxford University Press. June 2019."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}