{
    "url": "https://civilservice.blog.gov.uk/2021/08/09/dont-stagnate-evaluate-to-innovate/",
    "title": "Don’t Stagnate - Evaluate to Innovate!",
    "authors": [
        "Sumayyah Tasnim, Lead Policy Adviser, Evaluation Task Force, Cabinet Office"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-08-09T10:27:25+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Evaluation is a powerful tool to help you investigate the merit and value of Civil Service policy, flag up any flaws, improve its quality and deliver better impact for citizens."
        },
        {
            "text": "Creating an ambitious, innovative and skilled Civil Service that can meet the needs of those we serve requires a greater understanding of what works and what doesn’t.  "
        },
        {
            "text": "Building evaluation into every step of how we design and deliver policy and use it to inform decisions in future will be key, and the Evaluation Task Force, a joint Cabinet Office-HMT unit based in 1 Horse Guards, is here to do just that. Over the past couple of years, there has been renewed interest in evaluation across government, from civil servants and ministers alike. "
        },
        {
            "text": "The recent Spending Review asked departments to provide details of their evaluation plans alongside their bids, in a bid (pardon the pun) to ensure spending decisions are informed by evaluation evidence. "
        },
        {
            "text": "Better evaluation"
        },
        {
            "text": "Key people across government have been debating and pushing for better evaluation. Michael Gove, the Chancellor of the Duchy of Lancaster and Minister for the Cabinet Office, spoke about government’s need to be “rigorous and fearless in its evaluation of policy and projects” at the Ditchley lecture last summer. "
        },
        {
            "text": "Alex Chisholm, Civil Service Chief Operating Officer (left), highlighted the importance of experimentation and evaluating policy to “find solutions that work best,” in the consultation for Civil Service Reform. Ensuring high quality evaluation is now a key action in the Civil Service Modernisation and Reform programme. "
        },
        {
            "text": "You might ask however - how is evaluation new? Surely government has been evaluating before? And why is it not done more?  Well, yes, we have fantastic analysts in government, and there have been some great examples of evaluations that have changed practice. However we need this more consistently carried out  across departments and the evidence made more easily accessible and available at key spending decisions.  "
        },
        {
            "text": "Challenges"
        },
        {
            "text": "Of course, there are often challenges to evaluating – which comes down to a mix of structural and people factors – and evaluations won’t be appropriate for every programme. However, having a dedicated resource to push for proportionate evaluations at the right time, can only be  a step in the right direction. "
        },
        {
            "text": "The new Cabinet Office - HM Treasury Evaluation Task Force (ETF), which was announced by the Chancellor at the Spending Review in November 2020, is set to amplify the voice of the analytical community at key points. The central aim of the ETF is to ensure that evidence of the effectiveness of policies and programmes sits at the heart of spending and operational decisions. "
        },
        {
            "text": "Our team of evaluation experts will support departments to better evaluate their programmes and policies, and advise  spending teams on how to make more informed decisions on the basis of the results. "
        },
        {
            "text": "We will be encouraging teams to find new ways to solve problems by embedding experimentation into their programmes and encourage transparency of data and evaluation results to improve the use and influence of government evaluations. "
        },
        {
            "text": "Supporting and empowering"
        },
        {
            "text": "There are amazing analysts in government departments across the Civil Service championing this agenda, and have been doing so for many years. We will be supporting and empowering them by ensuring they play a central role in the design of programmes and key spending and operational decisions."
        },
        {
            "text": "We all know we should be doing ‘what works,’ just as we all know we should be exercising more, or eating healthy, but behaviour change is hard. "
        },
        {
            "text": "The Evaluation Task Force will need buy-in from everyone across government to have the biggest impact. But the prospect of transforming public services as a result will improve all our lives and wellbeing, so get involved!"
        }
    ]
}