{
    "url": "https://hodigital.blog.gov.uk/2021/08/09/looking-for-a-career-change-go-digital/",
    "title": "Looking for a career change? Go digital",
    "authors": [
        "Huzna, User Researcher"
    ],
    "categories": [
        "Recruitment",
        "User research"
    ],
    "pub_date": "2021-08-09T11:15:35+01:00",
    "content": [
        {
            "text": "At Home Office Digital, Data and Technology (DDaT) we offer career changers the opportunity to explore the user research profession. Career changers learn research methods, how to conduct research ethically and how to create useful research assets as well as the importance of including people with access needs or low digital skills in research."
        },
        {
            "text": "The Digital Career Development Programme is a paid, accelerated learning experience for those with a passion for user-centred digital services. Our work is guided by putting users first and making services accessible for all."
        },
        {
            "text": "Digital is changing the way the Home Office works, building and iterating online convenient and accessible services which focus on the needs of our citizens, and help keep the UK's streets safe and its borders secure."
        },
        {
            "text": "Hi, I’m Huzna. I made a career change to become a user researcher. I now work in the research operations team in the Chief Technology Office within Home Office DDaT."
        },
        {
            "heading": 2,
            "text": "My work experience before my career change"
        },
        {
            "text": "I joined the Home Office in 2019 working as an executive assistant in the HM Passport Office whilst studying a part-time Master’s degree in Human Rights."
        },
        {
            "text": "Eventually I was promoted into Border Force Intelligence as a project support officer in an agile team."
        },
        {
            "heading": 2,
            "text": "Gaining exposure to digital roles through job shadowing"
        },
        {
            "text": "Whilst working in the agile team I kept thinking ‘I want a job like this!’. I want something creative, something that stimulates my brain where I can bounce ideas around with people. I tried to figure out a way to get there."
        },
        {
            "text": "I knew most digital roles were ‘learn by doing’, but I really struggled when it came to landing a job as I had no hands-on experience or relevant qualifications. I did some job shadowing with user researchers, business analysts and product managers."
        },
        {
            "text": "I saw that the Home Office Digital Development Programme had released a Career Changer role."
        },
        {
            "heading": 2,
            "text": "What to expect on the programme"
        },
        {
            "text": "I joined the programme in November 2020 so as well as joining a new field, a new team and a new role I was also joining during lockdown!"
        },
        {
            "text": "I now work with a project mentor from the research operations team who supports me in my day-to-day job. I work closely with a career mentor who helps me plan my career and identify extra opportunities for learning, for example observing usability sessions and taking part in analysis work."
        },
        {
            "text": "As a career changer, this is exactly the support and encouragement I need."
        },
        {
            "text": "I’ve also enjoyed networking with other DDaT colleagues - I’ve been part of the user-centred design community in sharing ideas and best practices and I’ve attended cross-government meet ups to understand how user research is done in central and local government."
        },
        {
            "heading": 2,
            "text": "Using different methodologies to conduct user research"
        },
        {
            "text": "I have reviews every three months so that my performance can be measured and opportunities for me to develop identified."
        },
        {
            "text": "In the past six months I’ve enjoyed conducting research activities, including recruitment, writing discussion guides, conducting research interviews and observations, in-depth analysis and pulling out findings and insights."
        },
        {
            "text": "I use a range of methodologies, techniques and tooling which allow me to be really creative and appreciate the human-centred design element of user research."
        },
        {
            "heading": 2,
            "text": "The programme lets me take control of my career"
        },
        {
            "text": "I like the flexibility I have to manage how and where I do my work."
        },
        {
            "text": "I like that my colleagues encourage me to take on more work from other areas when I have capacity. This lets me be innovative and creative in the workplace which I was yearning for so much previously."
        },
        {
            "heading": 2,
            "text": "What next? The Home Office Digital Development Internship Programme"
        },
        {
            "text": "I look forward to joining the Digital Development Internship Programme as a user researcher in September this year."
        },
        {
            "text": "The User Researcher Career Changer Programme helped confirm the type of work I love doing by giving me the hands-on experience I was lacking."
        },
        {
            "text": "More importantly it has given me the confidence to learn this role at my own pace and to form new, supportive working relationships."
        }
    ]
}