{
    "url": "https://phescreening.blog.gov.uk/2021/08/09/scid-e-learning-resource-launches/",
    "title": "SCID e-learning resource launches",
    "authors": [
        "Liane Powell"
    ],
    "categories": [
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2021-08-09T10:49:45+01:00",
    "content": [
        {
            "text": "Regular readers will know that a formal UK National Screening Committee (UK NSC) in service evaluation will soon begin into screening for severe combined immunodeficiency (SCID) in the NHS."
        },
        {
            "text": "Screening will be offered as part of the existing NHS Newborn Blood Spot (NBS) Screening Programme in about two-thirds of England, from 6 September 2021."
        },
        {
            "text": "The PHE NBS national team has been working with colleagues in the NHS and external stakeholders to get everything ready to support parents and health care professionals during this important evaluation."
        },
        {
            "heading": 2,
            "text": "SCID e-learning"
        },
        {
            "text": "The PHE NBS national team recommends all health care professionals involved in the offer of screening for SCID complete it. It will help them to support parents making their decision about whether or not their baby should be screened for the condition."
        },
        {
            "text": "The e-learning covers:"
        },
        {
            "heading": 2,
            "text": "Collaboration"
        },
        {
            "text": "We developed the resource collaboratively, with clinicians, laboratory staff and parent representatives."
        },
        {
            "text": "We were lucky to have lots of willing volunteers from different staff groups and parent support organisations. Their feedback and suggestions were vital. We hope we’ve created a resource that will be useful, easy to navigate, informative and pitched at the right level."
        },
        {
            "heading": 2,
            "text": "Feedback"
        },
        {
            "text": "This is what some of our e-learning testers have fed back about the new e-learning module."
        },
        {
            "text": "Another of our volunteers told us:"
        },
        {
            "text": "Another person told us they better understood the concept of a national evaluation after completing the resource:"
        },
        {
            "text": "Another of our user testers told us:"
        },
        {
            "heading": 2,
            "text": "More on SCID"
        },
        {
            "text": "We’ll be blogging again on Wednesday (11 August, 2021) to launch the new NHS SCID screening resources for parents and professionals (including the parent and carer information leaflet). This will appear on the existing blood spot resources page on GOV.UK under a separate ‘SCID’ heading."
        },
        {
            "text": "If you have any questions about the SCID evaluation, please contact the PHE Screening Helpdesk."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}