{
    "url": "https://deframedia.blog.gov.uk/2024/05/15/coverage-of-the-farm-to-fork-summit-at-downing-street/",
    "title": "Coverage of the Farm to Fork Summit at Downing Street",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-05-15T14:55:20+01:00",
    "content": [
        {
            "text": "There has been widespread media coverage following a package of new measures to support farmers unveiled at the Farm to Fork Summit at Downing Street."
        },
        {
            "text": "The news was reported by a number of national publications including the Times, Telegraph, Independent, Daily Mail, Mirror, and Guardian and the Prime Minister also conducted a positive interview on the key takeaways of the announcement on the BBC Farming Today programme."
        },
        {
            "text": "Meanwhile, an op-ed from the Environment Secretary ran in the Express, that highlighted continuing government support for farmers in the aftermath of the extreme weather this winter."
        },
        {
            "text": "The national coverage was straight and focussed on the need to reduce reliance on overseas fruit and vegetables, the introduction of the UK Food Security Index and up to £80m a year of funding for horticulture."
        },
        {
            "text": "There was also coverage of the further £15m to boost access to more resilient crop varieties that require less farmer input, and the confirmation that the tenant farming commissioner in the autumn. The Telegraph led on the Prime Minister’s plan to cut red tape around the building of greenhouses."
        },
        {
            "text": "In the trade press, there was coverage in Horticulture Week, Farmers Guardian, Farmers Weekly, edie and The Grocer. The trade coverage was balanced and included a positive quote from the President of the National Farmers Union Tom Bradshaw, who described many of the announcements as “extremely positive”."
        },
        {
            "text": "Environment Secretary Steve Barclay said: "
        },
        {
            "text": " "
        },
        {
            "text": "Farming Minister Mark Spencer said:"
        }
    ]
}