{
    "url": "https://designnotes.blog.gov.uk/2024/05/15/design-in-the-senior-civil-service/",
    "title": "Design in the Senior Civil Service",
    "authors": [
        "Jennifer Staves - Deputy Director, Strategic Design: Making Tax Digital, HMRC"
    ],
    "categories": [
        "Community",
        "Design"
    ],
    "pub_date": "2024-05-15T09:00:31+01:00",
    "content": [
        {
            "text": "If you’re a designer that’s looked at the job listings for Senior Civil Service (SCS) roles (that’s Deputy Director, Director, Director General and Permanent Secretary), you’ve probably noticed there aren’t very many out there – particularly when it comes to user-centred design (UCD). And that’s not ideal – the Civil Service needs user-centred design to work alongside other professions more than ever. "
        },
        {
            "text": "However, there are some roles out there, and I’ve been in one of them for the last year as Deputy Director for Design in Making Tax Digital at HM Revenue and Customs (HMRC). There’s another at HMRC, as well as at the Department for Business and Trade (DBT), the UK Health Security Agency, Department for Environment Food and Rural Affairs and the Home Office that I’m aware of, and perhaps even more than that."
        },
        {
            "text": "I’m often asked what my career path was to SCS. There are many pathways, and I’ll share mine – as well as a few of the challenges and opportunities of working in design at this level, and my top tips if you’re interested in a role like this."
        },
        {
            "heading": 2,
            "text": "My career journey"
        },
        {
            "text": "I joined the Civil Service as a Content Designer at Grade 7 level at what was then the Department for International Trade (now DBT). "
        },
        {
            "text": "Before that, my career was ‘outside’ working on websites, digital products and services. My last role before joining the Civil Service was as Digital Content Manager at Wellcome Collection; a huge part of this role was moving from a web publishing model to a content design-led model. I remember actively using the Service Manual to inform our approach to content (which luckily our Product Manager was fully in support of)."
        },
        {
            "text": "At DBT, I earned my Civil Service content design chops by working on content design for products and services in the lead-up to Brexit. It was not easy at all – with changing policy direction, designing content that helps users ‘do’ things was very challenging. And at first, I struggled to connect with where I could add value to users because we were supporting businesses. Working on great.gov.uk helped me make that connection – many of these businesses were small to medium sized businesses who wanted to export their products but didn’t know how to navigate them. But if we could increase their confidence – and help them build their capability – we could not only help them with their business, but bring more revenue into the UK, which in turn funds more public services. This was a lightbulb moment for me. I would find later my experience gained here designing in an ambiguous policy environment was very valuable to other departments – and not something I’d previously done outside government."
        },
        {
            "text": "I moved to the Department for Education as a Lead Content Designer at Grade 6 Level, before moving into a Head of Profession role as Head of Content Design. Part of my role as a Head of Profession was to build capability for design. I remember looking at the progression frameworks for design and being struck that to move up beyond Grade 6, the most options seemed to be in Product or Delivery – with Content Design it was up and then out to the world of contracting. "
        },
        {
            "text": "Although I absolutely loved my Head of Profession role (and my fellow Heads of Profession), in the Civil Service, with the focus on delivery, I needed to show how I could lead delivery in a design context too. I decided to look for opportunities at the Head level to show how I could deliver UCD at scale. When a secondment to the HM Courts & Tribunals Service as Head of User Centred Design came up, with accountability for two delivery streams and supplier management, I jumped at the chance. This role also gave me the stretch of having accountability across all design disciplines."
        },
        {
            "text": "When the Deputy Director role for Design for Making Tax Digital came up, I was interested. There was potential, though it wasn’t exactly what I imagined SCS design leadership looking like – a heavier focus on design through the lens of business analysis and process design rather than UCD. It made me realise that at SCS level, the word ‘design’ is often used in its more traditional dictionary definition – for example, ‘a plan or drawing produced to show the look and function or workings of a building, garment, or other object before it is made’. "
        },
        {
            "text": "So how could I show how I could operate at this level while making space and creating the right environment for UCD to work well? In my interview I had honest conversations around the direction that I would want to take the role. "
        },
        {
            "text": "I was (and am) lucky to have a supportive Director and Director General that can see the value that UCD can pay to delivering outcomes, but it’s not all plain sailing. "
        },
        {
            "heading": 2,
            "text": "Challenges"
        },
        {
            "heading": 2,
            "text": "Opportunities"
        },
        {
            "heading": 2,
            "text": "Top tips if you’re interested in leading UCD at SCS level"
        },
        {
            "text": " "
        }
    ]
}