{
    "url": "https://insideDIO.blog.gov.uk/2024/05/15/dio-supports-behind-the-scenes-at-the-ten-tors-in-dartmoor/",
    "title": "DIO supports behind the scenes at the Ten Tors in Dartmoor",
    "authors": [
        "Crispin d'Apice"
    ],
    "categories": [
        "British Army",
        "Defence Training Estate (DTE)",
        "Training Estate Public Safety",
        "Working at DIO"
    ],
    "pub_date": "2024-05-15T11:56:32+00:00",
    "content": [
        {
            "text": "As the Training Safety Officer for Dartmoor I cover the Dartmoor Training Area from our office in Okehampton Camp. We've just finished supporting the Ten Tors; one of the busiest weekends in the Dartmoor Training Area's calendar."
        },
        {
            "heading": 2,
            "text": "The teams and Tors route"
        },
        {
            "text": "Ten Tors is an annual event that attracts thousands of teenagers, who set out in small teams to navigate routes of 35, 45 or 55 miles (depending on age) over the northern half of Dartmoor, visiting nominated tors and checkpoints in under two days. Teams must be self-sufficient, carrying all that they need to complete their route and stay out overnight safely."
        },
        {
            "text": "The route covers part of the military training area and DIO staff play a crucial role in supporting what is the largest outdoor youth activity event in the country."
        },
        {
            "heading": 2,
            "text": "DIO's military support and public safety role"
        },
        {
            "text": "Our most important job is to provide the ‘safe place’ for military training and thus help ensure that our personnel and the public don’t come to harm. We ask that the public follow our simple steps when visiting MOD land to help keep themselves and our armed forces safe. You can find out more about how to do that here: Accessing the training estate safely - GOV.UK (www.gov.uk)"
        },
        {
            "text": "We also provide advice to military units on how best to use the training estate to achieve their objectives, maintain the MOD’s consent to train with the local community, manage and develop our infrastructure, and a host of other jobs as well."
        },
        {
            "text": "I’ve been doing the job for seven years and it’s flown by!"
        },
        {
            "text": "My military background is key in this role. TSOs have to have military range qualifications and experience in order to allow us to validate military units’ safety plans. Beyond that, our experience allows us to best allocate facilities and advise units to ensure the MOD gets the best out of the training estate."
        },
        {
            "heading": 2,
            "text": "Dartmoor and the Ten Tors operation"
        },
        {
            "text": "Dartmoor is the 4th biggest training area in the UK and covers 30,000 acres with an additional 80,000 acres of moorland available for non-tactical training. It is a beautiful and historic place and we’re very lucky to be here. We mainly support light role dismounted training - basically troops operating on foot with what they can carry."
        },
        {
            "text": "Ten Tors is a huge operation delivered every year by the Army’s HQ South West. It sees 2,800 teenagers trekking across the moor on a variety of challenges of up to 55 miles in length, and there are other challenges running as part of the event. Over 1,000 enablers make the event happen and help to host around 9,000 participants and supporters who visit Okehampton Camp during the course of the weekend. It’s a real team effort and DIO’s role is to provide the facilities and specialist advice that allows the event to happen."
        },
        {
            "text": "As the only MOD personnel permanently based on Dartmoor, we provide subject matter expertise in a number of areas. One of the most important things we do is to advise on the ground conditions on the moor in the run up to the event as this is a major factor in how it is run - or even if it is run at all."
        },
        {
            "text": "Ten Tors has to be seen to be believed. Thousands of youngsters pushing themselves to discover new limits, proud parents cheering them on, all set in some of the harshest terrain in England. I did it three times as a boy and can still remember every mile!"
        },
        {
            "text": "As you’d expect the Army has an extremely well organised safety system in place throughout the event. Our primary role is to react to any reports of military debris and either remove them (if safe) or call in the Explosive Ordnance Disposal team (if not). Given that the military have been training on Dartmoor for over 140 years there is surprisingly little military debris out there but with 2,800 youngsters walking on the moor something comes up most years."
        },
        {
            "text": "With that many people on the moor there are always a few incidents, but the Army always manage them in an exemplary fashion."
        },
        {
            "heading": 2,
            "text": "Celebrating 75 years of National Parks"
        },
        {
            "text": "This year celebrates 75 Years of National Parks | Campaign for National Parks (cnp.org.uk) and the ‘Right to Roam’ and balancing the needs of military training with keeping the moor accessible to the public is the priority for us. When our ranges are live, we ensure that the public don’t access them - people and bullets don’t mix well. The rest of the time the majority of the training area is fully open to the public: our main role during these times is to react to any reports of military debris including swiftly ‘making safe’ anything hazardous."
        },
        {
            "text": "Dartmoor is hugely important ecologically, historically, and socially. We work closely with the Dartmoor National Park Authority, Natural England, local farmers and landowners, and numerous other organisations and individuals to help manage the moor. Like all rural areas Dartmoor has a complex mix of users and the challenge is to balance their needs and wants whilst maintaining relationships."
        },
        {
            "text": "Ten Tors is an amazing event, which it is a privilege to help support. Planning has already started for 2026!"
        }
    ]
}