{
    "url": "https://defrafarming.blog.gov.uk/2024/05/15/further-funding-to-tackle-endemic-diseases/",
    "title": "Further funding to tackle endemic diseases",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2024-05-15T15:59:37+01:00",
    "content": [
        {
            "text": "By reducing the levels of endemic disease in livestock, we can increase productivity, support businesses and unlock wider benefits too — from reducing greenhouse gas emissions (GHG) to slowing antimicrobial resistance (AMR).  "
        },
        {
            "text": "The very nature of endemic disease means it is an ongoing concern. Managing it requires the sustained effort of livestock keepers, the support of vets and money.  "
        },
        {
            "text": "In recognition of this, we are offering additional financial support to: "
        },
        {
            "text": "Through co-design, farmers and vets helped us shape this extra support. In this post, we’ll give a summary. "
        },
        {
            "heading": 2,
            "text": "A bolt-on to the yearly vet visits "
        },
        {
            "text": "In 2023, we introduced the Annual Health and Welfare Review."
        },
        {
            "text": "Simply put: the review is a fully funded vet visit that happens on a yearly basis. During the review, keepers of cattle, sheep and pigs can access bespoke health and welfare advice and test for endemic diseases and other conditions using a vet of their choice. "
        },
        {
            "text": "The current offer is: "
        },
        {
            "text": "In addition to this, we’re offering: "
        },
        {
            "text": "This money will go towards more in-depth diagnostic testing for PRRS; identifying persistently infected cattle on farms with BVD and advice on how to eliminate the disease from the farm.  "
        },
        {
            "text": "In the case of sheep, the farmer will, in consultation with their vet, choose from a range of health improvement packages. These will target the syndrome that is most prevalent and provides most benefit to treat in each flock. "
        },
        {
            "text": "This extra funding will be available in summer. We’ll roll the offer out gradually. We’ll start with sheep, pig and beef cattle, before expanding to include dairy farmers soon after. "
        },
        {
            "text": "Eligible farmers will also receive funding for the delivery of a biosecurity assessment followed by bespoke advice to help farmers identify how diseases are most likely to spread into their herd or flock, and across their farm. "
        },
        {
            "heading": 2,
            "text": "How to prepare   "
        },
        {
            "text": "To access the additional funding, you first need to have an Annual Health and Welfare Review. Once you’ve had a review, you can access the extra support. "
        },
        {
            "text": "To sign up for a review, you need: "
        },
        {
            "text": "And: "
        },
        {
            "text": "This will make for one seamless service where farmers will be able to apply for a 3-year agreement for carrying out the review annually, with an option to take up the offer of the extra funding. "
        },
        {
            "heading": 2,
            "text": "Making testing less invasive for pigs  "
        },
        {
            "text": "As part of our work to improve the Animal Health and Welfare Pathway, we’ll soon make a change to how pigs can be tested for PRRS. "
        },
        {
            "text": "Livestock keepers and vets told us that making the testing of pigs less stressful for the animals was a priority. As a result, the manner of testing will change from blood sampling to oral fluid sampling by cotton ropes. "
        },
        {
            "text": "We’re always looking for ways to make our service better for vets and farmers and the feedback we get from you helps us to do that "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "As we did with the review, we will continuously improve our offer with your feedback. "
        },
        {
            "text": "Future improvements will allow farmers to apply for multiple species. For example, both sheep and beef cattle and multiple herds/flocks of the same species under one SBI.  "
        },
        {
            "text": "Finally, look out for out for our post on new Laying Hen Housing for Health and Welfare grant."
        }
    ]
}