{
    "url": "https://deframedia.blog.gov.uk/2024/05/15/inaccurate-coverage-of-environment-agency-investigation-at-lake-windermere/",
    "title": "Inaccurate coverage of Environment Agency investigation at Lake Windermere",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "water"
    ],
    "pub_date": "2024-05-15T11:54:28+01:00",
    "content": [
        {
            "text": "There has been inaccurate coverage on the BBC this morning regarding the Environment Agency’s involvement in a pollution incident at Bowness-on-Windermere earlier this year."
        },
        {
            "text": "The coverage alleges the Environment Agency failed to properly inspect the incident before closing the investigation. This is simply not true, and we have informed the BBC of this. A thorough investigation into the incident by the regulator remains ongoing since the incident, which involves examining further evidence from United Utilities."
        },
        {
            "text": "If it is determined that a permit breach has taken place, the Environment Agency will take the appropriate enforcement action up to and including a criminal prosecution."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "We are absolutely committed to improving the water quality in Lake Windermere. That is why we are working closely with the local community and a range of partners to reduce pollution from all sources, as well as reviewing wastewater treatment works permits within the Windermere catchment."
        },
        {
            "text": "The Environment Agency also leads the Love Windermere partnership. This will develop an evidence based, long-term plan that encompasses short and medium-term objectives, seeking outcomes that address water quality improvements whilst balancing the needs of the community and economy"
        },
        {
            "text": "Follow Environment Agency on X, and sign up for email alerts here."
        }
    ]
}