{
    "url": "https://defrafarming.blog.gov.uk/2024/05/15/introducing-laying-hen-housing-for-health-and-welfare-grants/",
    "title": "Introducing Laying Hen Housing for Health and Welfare grants",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2024-05-15T15:53:47+01:00",
    "content": [
        {
            "text": "Next month, a new grant for hen housing will be available to laying hen and pullet farmers in England with flocks of 1,000 birds or more. We've just published the guidance for the grant on GOV.UK."
        },
        {
            "text": "In this post we’ll share an overview of the grant and a link to the guidance."
        },
        {
            "text": "Overview of The Laying Hen Housing for Health and Welfare grant "
        },
        {
            "text": "There is a direct link between the health and welfare of livestock and a farmer’s bottom line.  The challenges faced by the poultry sector in recent years make this clear. We know that ageing housing can make a bad situation worse. "
        },
        {
            "text": "Many farmers tell us that they want to update their housing but struggle to find the funds. "
        },
        {
            "text": "The Laying Hen Housing for Health and Welfare grant supports farmers to undertake infrastructure projects that will not only improve the health and welfare of their animals but also support environmental sustainability and innovation. "
        },
        {
            "text": "There is no ‘one size fits all’ poultry farm. Farmers have different business priorities because they farm on different acreages and in different environments.  That is why the grant has been designed to give farmers options, so they can get funding for a project that best reflects their needs. "
        },
        {
            "text": "Grants are available for 2 types of project:  "
        },
        {
            "heading": 3,
            "text": "1. Building a new veranda  "
        },
        {
            "text": "Grant amount: Between £5,000 and £100,000 is available toward the cost of installing a new veranda on an existing building.   "
        },
        {
            "text": "The additional space offered by a veranda can help to improve welfare issues, for example, feather pecking. Feather pecking is an abnormal behaviour whereby some laying hens peck others sometimes removing feathers, which can result in poor plumage, patches of feather loss, skin damage and even death. Where feather pecking develops into injurious pecking and the protective function of the bird’s plumage is lost, this can trigger cannibalism which is a serious animal welfare problem. "
        },
        {
            "text": "Verandas can reduce crowding within indoor housing, increase range use, and provide access to fresh air and natural light when range access is not possible, including when a housing order is in force. "
        },
        {
            "text": "Grants for these veranda-only projects are going to be awarded on a first come first serve basis, so if you’re interested be sure to look at the guidance so you’re ready to act when it's time to apply.  "
        },
        {
            "heading": 3,
            "text": "2.  Updating housing stock "
        },
        {
            "text": "Grant available: between £15,000 and £500,000 is available toward the cost of refurbishing or replacing existing laying hen and pullet housing. "
        },
        {
            "text": "This is an opportunity to enhance how flocks are housed, with features designed to deliver excellent levels of health and welfare; fixed bio-secure, multi-tier housing with non-flicker LED lighting, mechanical ventilation.  "
        },
        {
            "text": "Funding for roof-mounted solar photovoltaic (PV) systems will also be available as part of these larger projects.  You can also build a veranda as part of this project. "
        },
        {
            "text": "The grant will be available to farmers with any current housing system and will support anyone looking to make the transition from colony cages to high-welfare loose-housing. "
        },
        {
            "heading": 2,
            "text": "Next Steps "
        },
        {
            "text": "We plan to open this grant for applications next month.  "
        },
        {
            "text": "When it’s time to apply, we’ll let you know so if you haven’t already, do subscribe to the Farming blog."
        },
        {
            "text": " It’s a great way to get up to date information on this grant, and the other support available to livestock keepers and land managers. "
        },
        {
            "text": "If you know a keeper who might be interested in applying for a grant, feel free to share this post with them.  "
        },
        {
            "text": "The Laying Hen Housing for Health and Welfare grant is part of the Animal Health and Welfare Pathway. It's delivered through the Farming Investment Fund.    "
        }
    ]
}