{
    "url": "https://naturalengland.blog.gov.uk/2024/05/15/nature-returns-interim-report/",
    "title": "Nature Returns - Interim Report",
    "authors": [
        "Mike Morecroft"
    ],
    "categories": [
        "Climate change",
        "Nature Returns",
        "Nature-based solutions"
    ],
    "pub_date": "2024-05-15T10:03:15+01:00",
    "content": [
        {
            "text": "By Mike Morecroft, Deputy Director, Climate Change Science"
        },
        {
            "text": "We’ve just published an interim report on the Nature Returns programme today (15 May 2024), our flagship £17m programme to build the evidence for nature-based solutions to climate change and biodiversity loss.  It’s been my privilege to chair the steering group for this programme and to lead Natural England’s scientific contribution to it."
        },
        {
            "text": "In this post I’d like to tell you about the progress we are making.  You can read all about the background in this earlier blog post by Tim Hill Nature Returns – Natural England (blog.gov.uk)."
        },
        {
            "text": "Nature-based solutions can help us to tackle climate change in ways that also bring multiple other benefits for people and biodiversity, but realising this potential requires a wide range of different people and skillsets. Nature Returns demonstrates the power of collaborative working, bringing together scientists, land managers, green finance experts and local communities."
        },
        {
            "text": "Natural England leads the programme, working with the Environment Agency, Forestry Commission, Royal Botanic Gardens Kew and a wide range of local partner organisations, including charities, local government and private landowners.  We’re sponsored by Defra, the Department for Energy Security and Net Zero and the Treasury."
        },
        {
            "text": "Over the the two and a half years that the programme has been running we’ve been making progress on a diverse range of fronts."
        },
        {
            "text": "We are learning lessons that will help policymakers, land managers and investors to make better decisions going forward. Some of these lessons are scientific in nature – we are quantifying how much carbon builds up in grasslands over time and how much variation there is between different locations."
        },
        {
            "text": "We are also understanding better how carbon is stored in diverse, semi-natural woodlands: old trees store disproportionately more carbon than young trees and similar amounts of carbon are found in the top 30cm of soil as in the trees themselves."
        },
        {
            "text": "But just as important are the practical lessons we are learning about how local land managers can be supported best by public bodies as they adjust to the new challenges that nature recovery and net zero present."
        },
        {
            "text": "One challenge that we need to work on together is how to manage the consequences of extreme weather events – an increasingly frequent problem with climate change. Even in the relatively short time that Nature Returns has been running, our local partners have had to contend both with a dry spring that made it hard to establish new trees and grasslands and flooding which made it impossible to get machinery onto land over a period of several months."
        },
        {
            "text": "Land managers can adapt and respond, but public financial rules can make it difficult for them to do so. We are also learning more about the the challenges associated with private finance and the factors that facilitate this, including the importance of confidence and trust, facilitation and leadership."
        },
        {
            "text": "Looking ahead the programme is continuing in its present form for at least another year and local partnerships have financial support to maintain the newly created habitats for the next ten years. This will enable scientists to come back and monitor how carbon and biodiversity change over time."
        },
        {
            "text": "Over the next year, we will increasingly be turning our attention to communicating our findings in a variety of ways, ranging from scientific outputs for practical advice to policymakers and land managers."
        },
        {
            "text": "We've made a film to explain what Nature Returns is about, and as the film concludes: only by investing in Nature will we all share in the benefits. "
        },
        {
            "text": "To follow our progress, please visit the following page Nature Returns Programme (naturalengland.org.uk)"
        }
    ]
}