{
    "url": "https://ruralpayments.blog.gov.uk/2024/02/15/delinked-payments-guidance-information-about-transferring-reference-data/",
    "title": "Delinked payments guidance: information about transferring reference data",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Delinked payments"
    ],
    "pub_date": "2024-02-15T11:57:46+00:00",
    "content": [
        {
            "text": "RPA is replacing the Basic Payment Scheme (BPS) in England with delinked payments in 2024. The 2023 scheme year was the last year of BPS."
        },
        {
            "text": "Delinked payments will be paid each year from 2024 to 2027. We plan to make advance payments of around 50% from 1 August and the balance payments from 1 December. The amount you receive will decrease each year as progressive reductions are applied."
        },
        {
            "heading": 2,
            "text": "Information statements"
        },
        {
            "text": "In November and December 2023, to help customers get ready, we sent out Delinked Payments Information Statements for customers to check. This showed their reference amount based on the reference data we held for them at that time. We will use the reference amount to calculate their delinked payments each year."
        },
        {
            "text": "If you claimed BPS in England in any of the years 2020, 2021 or 2022 and you did not get an information statement, please call us on 03000 200 301."
        },
        {
            "heading": 2,
            "text": "Transferring reference data"
        },
        {
            "text": "The transfer window opens today. You can transfer some or all of your reference amount to another business in a 12-week transfer period, until 11.59pm on 10 May 2024. (The 10 May 2024 deadline will not apply in inheritance cases)."
        },
        {
            "text": "In most cases, transfer requests can be made in the Rural Payments service, and we have a ‘how to’ guide to help you do this. For transfers from closed businesses and for inherited land cases, you will need to complete a transfer request form and return it to us by the deadline."
        },
        {
            "text": "We have updated the Delinked payments: replacing the Basic Payment Scheme guidance to include more information about transferring data, closed businesses, and inheritance."
        }
    ]
}