{
    "url": "https://dragonsden.blog.gov.uk/2024/02/15/dragons-den-ip-blog-series-21-episode-7/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 7",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Designs",
        "IP",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2024-02-15T21:00:13+00:00",
    "content": [
        {
            "text": "With innovative ideas comes bold pitches and fiery questioning. This week’s episode of Dragons' Den was no exception, with electric car chargers, sweet snacks and even pet-edible cards brought into the Den."
        },
        {
            "heading": 3,
            "text": "Bone Appétit!"
        },
        {
            "text": "One businesswoman who caught my eye was founder of Scoff Paper, Gemma Connolly. Gemma brought with her the unique concept of pet-edible greetings cards. Perfect for any naughty puppy owners, these cards are designed to be safe for dogs to eat."
        },
        {
            "text": "After a bubbly entrance, Gemma showcased her business, potato-based greetings cards, looking for an investment of £50k for a 10% stake. With stockists including Pets at Home and Aldi, the Dragons were interested in the offering and impressed by Gemma’s confident approach which had previously secured deals."
        },
        {
            "text": "With existing investments in the pet industry, Touker Suleyman was keen to know whether there was potential for more than an annual birthday card before considering an offer. The promise of Valentines, Easter and even 'get well soon' cards from Gemma started to diminish his reservations."
        },
        {
            "text": "Find out more about registering a design:"
        },
        {
            "text": "My anxiety lifted when both Sara Davies and Touker offered Gemma an investment, with Sara’s higher offer cinching the deal."
        },
        {
            "heading": 3,
            "text": "Charged up ideas"
        },
        {
            "text": "Next in the Den were duo Michael Goulden & Benjamin Whitaker, with the Kerbo Charger. As electric vehicles become more and more popular, Michael and Benjamin saw a gap in the market for those who didn’t have a driveway to charge their car."
        },
        {
            "text": "With interest from local authorities and a live trial in place, the Kerbo Charger offers a solution with quick to install cabling under the pavement. Michael and Benjamin also showcased their app which allows users to share their charger with neighbours."
        },
        {
            "text": "Despite Peter Jones’ fierce questions about the practicality of the product, Green Queen Deborah Meaden was on board with the entrepreneurs, impressed by the interest of local authorities."
        },
        {
            "heading": 3,
            "text": "A genius idea or a questionable combination?"
        },
        {
            "text": "Another entrepreneur to make an innovative use of the humble potato was Maria Antoniou, with her unique combination of crisps and chocolate in a Bar of Crisps."
        },
        {
            "text": "My ears were open to see if Maria could find a solution to the question we all ask ourselves when looking for a snack, crisps or chocolate?"
        },
        {
            "text": "Looking for a £50k investment for 20% of her business, Maria demonstrated a range of flavours of crisp chocolate hybrids, from ready salted to cheese and onion. The display of onions and chocolate together raised some eyebrows in the Den, but the Dragons were keen to get tucked in."
        },
        {
            "text": "Steven Bartlett wasn’t so sure on the combination, and despite my initial interest, I had to agree. I like my chocolate and crisps separate. But the other Dragons could see how Maria could tap into both a niche audience and the novelty gifting market."
        },
        {
            "text": "After a sample, the Dragons got down into the detail, asking Maria about her sales so far and the retail price of her product. The Dragons felt the price didn’t match up with her packaging and unfortunately didn’t make an offer today."
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}