{
    "url": "https://publicpolicydesign.blog.gov.uk/2024/02/15/joining-up-whitehall-with-local-places/",
    "title": "Joining-up Whitehall with local places",
    "authors": [
        "Ben Greener"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2024-02-15T12:00:06+00:00",
    "content": [
        {
            "text": "Sitting in a beautiful Victorian church hall, amongst a large group of people – many of whom were experts in community engagement and rooted in their local place – was a pretty daunting experience."
        },
        {
            "text": "This was made even more daunting when I was told that within the hour, I would be out on the streets of Southwark with a clipboard, attempting to strike up conversations with residents and business owners about the issues affecting their lives… !"
        },
        {
            "heading": 2,
            "text": "We are at our best when we collaborate"
        },
        {
            "text": "Joined–up, place–based working between Whitehall, local authorities and communities has always been a central feature of the way that the Civil Service works with local places."
        },
        {
            "text": "Recently, we’ve seen good examples of this in national efforts to tackle Covid-19, through our country’s support for people arriving from Hong Kong, Afghanistan and Ukraine, and during the celebrations around the recent Coronation Weekend – all of which were developed and delivered by central and local teams, working closely together."
        },
        {
            "text": "Clearly, we are at our best when we collaborate."
        },
        {
            "text": "But, while there are many things to celebrate about the strong central-local partnership working which is underway across a range of policy areas and Whitehall departments, there is always room for improvement."
        },
        {
            "heading": 2,
            "text": "Unlocking barriers to partnership"
        },
        {
            "text": "DLUHC’s Partnerships for People and Place (PfPP) programme, emerged from an understanding that many Civil Service departments’ programmes can overlap - in both their reach and outcomes."
        },
        {
            "text": "This can happen both during the development phase, when ideas are being worked up, and the delivery phase, when work is being rolled out on the ground."
        },
        {
            "text": "This can sometimes cause issues for local people and places. On occasions, central government might be working on different priorities, or different timelines to local government and communities."
        },
        {
            "text": "For central government departments, this can mean objectives get repeated across multiple programmes in the same area. For local areas, it can mean that a complex web of centralised funding pots and programmes often doesn’t align with their needs or timescales."
        },
        {
            "text": "PfPP was created to tackle issues like this. To show the benefits on offer when we join up across central and local teams."
        },
        {
            "text": "We wanted to unblock barriers to partnership working and bring place to the centre of our policy – aiming to deliver better outcomes for local people."
        },
        {
            "heading": 2,
            "text": "Tackling hyper-local, thorny policy issues"
        },
        {
            "text": "To do this, we brought together 11 central government departments, all working in the same places, delivering work to improve the lives of residents who live there."
        },
        {
            "text": "The work we were delivering was different, but our overall departmental objectives were all closely aligned."
        },
        {
            "text": "We then selected 13 of these ‘cross-over’ places and funded them to trial projects to tackle the hyper-local, thorny policy issues that they felt held their places back - issues that mattered most to local people."
        },
        {
            "text": "In Hastings, East Sussex, the Department for Energy Security and Net Zero joined a local council pilot to tackle fuel poverty and poor energy efficiency in the private rental sector."
        },
        {
            "text": "In Luton, the Home Office and local partners combined to tackle anti-social behaviour in the town centre."
        },
        {
            "text": "In Bradford, we brought together Health Department colleagues with the local authority and NHS partners, to show how community hubs can support young people and families facing mental health challenges."
        },
        {
            "heading": 2,
            "text": "The comments, energy and insight have stayed with me"
        },
        {
            "text": "A big part of the programme involved getting out and about, to see the issues on the ground."
        },
        {
            "text": "Local meetings and site visits attended by both central departments and local officials have offered a chance to challenge misconceptions, grapple with local issues together and build a shared understanding of what effective delivery in person, in place looks like."
        },
        {
            "text": "I visited the We Walworth programme in Southwark."
        },
        {
            "text": "Attending as part of mass engagement exercise being undertaken as part of Southwark’s pilot which aimed to have conversations with 80% of the neighbourhood, and I took part in face-to-face interviews and meetings with local businesses and residents."
        },
        {
            "text": "While I was certainly nervous as I knocked on the door of a local phone shop, the rich conversation and deep insights that I gained from my 15-minute chat with the owner were utterly invaluable. I learned about his fears for his own business, as well as the opportunities he could see for his children in the local area."
        },
        {
            "text": "This experience was replicated as we visited a range of supermarkets, hairdressers and food shops throughout the afternoon. Suggestions, criticism, ideas, challenges. I left that day with my head spinning, full of new perspectives."
        },
        {
            "text": "As a group, we managed to conduct almost a hundred interviews in a single afternoon. The comments, energy and insight that I took away from the people I met have stayed with me."
        },
        {
            "text": "Even now, more than a year on, I regularly draw on the experience of that day when thinking about how decisions made in Whitehall and town halls play out on the ground, and how we should always strive to make policy that supports people and places, and removes obstacles in their way."
        },
        {
            "heading": 2,
            "text": "Recommendations for change"
        },
        {
            "text": "As our Partnerships for People and Place team programme ramps up to its final report, the team are busy creating policy recommendations to support policymakers and delivery bodies at central and local levels. These are likely to cover:"
        },
        {
            "text": " The Partnerships for People and Place Ipsos UK and Grant Thornton evaluation is due in the coming months. "
        },
        {
            "text": " Contact partnershipsforpeopleandplace@levellingup.gov.uk for more information on the programme."
        }
    ]
}