{
    "url": "https://defraenvironment.blog.gov.uk/2024/02/15/local-strategies-national-ambitions-how-local-nature-recovery-strategies-are-helping-us-achieve-our-national-environmental-targets/",
    "title": "Local strategies, national ambitions: how Local Nature Recovery Strategies are helping us achieve our national environmental targets",
    "authors": [
        "Julian Harlow"
    ],
    "categories": [
        "Access and engagement",
        "Land Use",
        "Local Nature Recovery Strategies"
    ],
    "pub_date": "2024-02-15T15:43:51+00:00",
    "content": [
        {
            "text": "I’m Julian, head of the Local Nature Recovery Strategies team in Defra. Local Nature Recovery Strategies are new strategies being prepared by 48 local authorities (called ‘responsible authorities’) to agree priorities for nature recovery and propose actions in the locations where they will have the greatest impact for nature across England.  "
        },
        {
            "text": "In our previous blog post on Local Nature Recovery Strategies, we explained the importance of local knowledge and leadership in turning the tide on biodiversity loss.  "
        },
        {
            "text": "But nature recovery and environmental improvement are also national challenges that we need to work together to address.  "
        },
        {
            "text": "This is why in designing Local Nature Recovery Strategies, we’ve tried to strike the balance between giving space for responsible authorities to have discretion in identifying and addressing environmental challenges in a way that makes sense for their area, while also recognising that each strategy needs to be part of something bigger.   "
        },
        {
            "text": "Agreeing the priorities that each strategy will address is an important step for those preparing Local Nature Recovery Strategies. Over the coming months many responsible authorities will be working with local partners and communities to complete this step.  "
        },
        {
            "text": "National environmental objectives for local strategies "
        },
        {
            "text": "We provided responsible authorities with a list of national environmental objectives to think about when they are setting priorities locally.  "
        },
        {
            "text": "This list includes biodiversity targets for habitat creation and species recovery. It also steers responsible authorities towards looking for opportunities to improve public access to nature, improve water quality and availability through creating and restoring habitat, and to improving and expanding natural habitats. "
        },
        {
            "text": "Many responsible authorities are working closely with local communities, landowners and businesses to agree priorities and opportunities for nature recovery in their area. Natural England, the Environment Agency and the Forestry Commission are also working together with responsible authorities and Defra to help achieve national consistency in Local Nature Recovery Strategies, whilst leaving room for tailoring strategies to local priorities. "
        },
        {
            "text": "A case study: applying national targets to a local area "
        },
        {
            "text": "We sat down with Sam Evans, Head of Natural Environment at Greater Manchester Combined Authority, to talk about how they will be developing their priorities locally. "
        },
        {
            "text": "How are you considering national level environmental objectives for Greater Manchester’s Local Nature Recovery Strategy?  "
        },
        {
            "text": "In Greater Manchester, we want to play our part in reversing the decline in biodiversity and tackling the joint climate and biodiversity emergencies together. Developing the Greater Manchester Local Nature Recovery Strategy provides us with the opportunity to set out our long-term vision for nature recovery and set out how everyone can work together (landowners, communities, businesses and the public sector) to deliver this vision. "
        },
        {
            "text": "To translate the national level objectives to our local level, we are looking at their applicability to Greater Manchester (including what local data is available to measure progress) and working with stakeholders to discuss the proposals. "
        },
        {
            "text": "This will be supported by the evidence base set out in a forthcoming State of Nature report for the city-region. We will set out our approach and proposals for these when we do a public consultation on our draft strategy later this year.  "
        },
        {
            "text": "Which of the national environmental objectives do you feel are most relevant to the Greater Manchester area? "
        },
        {
            "text": "For the urban areas in our city-region, nature is crucial to people’s health and wellbeing – fair and equitable access to quality greenspace is incredibly important and relevant to our strategy.  "
        },
        {
            "text": "The role of nature in adapting these areas to climate change – through nature-based solutions such as street trees and Sustainable Drainage – is also vital, so we will be looking at how we can increase our tree canopy cover in towns and cities through our Local Nature Recovery Strategy. "
        },
        {
            "text": "This will also have benefit for our city-region’s waterbodies - which suffer the effects of diffuse pollution from urban run-off and agriculture and have been heavily modified as a result of our industrial heritage – and reduce flood risk, particularly from surface water in built-up areas.  "
        },
        {
            "text": "Likewise, large areas of our peatlands have been degraded by human activity and are not providing the range of ecosystem services (particularly storing carbon and mitigating flood risk) as they could do, so restoring them and returning them to good condition will be a key part of our strategy too.  "
        },
        {
            "text": "How are you engaging with local communities and organisations in determining your environmental and nature recovery priorities? "
        },
        {
            "text": "In Greater Manchester, collaboration across the private, public and third sectors is ingrained in the way we do things. We have a broad range of organisations as part of our Local Nature Partnership who also reach into communities and a wider network – so we are more than the sum of our parts.  "
        },
        {
            "text": "Together, we have already engaged a wide range of organisations to develop emerging priorities for nature recovery, hosting a set of workshops at the end of last year to start to co-create these. "
        },
        {
            "text": "We are following this up now with a survey to seek wider views on these emerging priorities. We have also been carrying out targeted engagement with farmers and landowners to help reflect their views and understand how the strategy can support them to do even more for nature recovery on their land. "
        },
        {
            "text": "And over the next few months, we will be engaging businesses, developers and social housing providers to do the same. We publish a regular newsletter to keep everyone up to date with the latest developments and progress in developing the strategy.   "
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "Responsible authorities will continue preparing their Local Nature Recovery Strategies over 2024.  "
        },
        {
            "text": "To follow their progress, you can find more information for each responsible authority on GOV.UK.  "
        },
        {
            "text": "For more future updates on Local Nature Recovery Strategies and similar environmental policies, please subscribe to our blog. "
        }
    ]
}