{
    "url": "https://environmentagency.blog.gov.uk/2024/02/15/porlock-vale-streams-riverlands-project-offers-nature-based-solutions-to-climate-change/",
    "title": "Porlock Vale Streams Riverlands Project offers nature-based solutions to climate change",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Community",
        "Environment Agency",
        "newsdesk",
        "Sustainability"
    ],
    "pub_date": "2024-02-15T13:03:49+00:00",
    "content": [
        {
            "text": "The National Trust, in partnership with the Environment Agency, are continuing work on the Porlock Vale Streams Riverlands (PVSR) Project on Holnicote Estate, West Somerset, and recently completed the River Aller Floodplain Reconnection scheme."
        },
        {
            "text": "The project started in 2018 under the National Riverlands Programme. It aims to deliver nature-based solutions to climate change through unique river restoration and habitat creation techniques."
        },
        {
            "text": "So far, the project has cost approximately £2.4m to carry out. It has been funded by Interreg 2 Seas Co-adapt with contributions from the Environment Agency, the National Trust, Somerset Rivers Authority and the Green Recovery Challenge Fund."
        },
        {
            "text": "The Environment Agency (EA) provided funding from the Water Environment Improvement Fund and Local Levy NFM funding to the project on an annual basis. Local EA teams within the Wessex Area provided support and expertise throughout the project’s lifetime."
        },
        {
            "text": " What changes have been made to the area?"
        },
        {
            "text": "The PVSR project has restored natural processes and ecological function through five main schemes across the Holnicote Estate, covering a 12,500 acre stretch of land and encompassing two river catchments: the River Aller and Horner Water. Many smaller interventions have also been delivered in the area at catchment scale."
        },
        {
            "text": "The River Aller Floodplain Reconnection scheme is the first large main river restoration scheme of this scale implemented in the UK. The work was designed to take the River Aller back to a natural state from being a single thread channel to a system of multiple, cross-connected channels. This technique reconnects the river to its floodplain, helping to hold back floodwater during high flows and protect downstream communities. Groundwater levels are raised to store more water throughout the year. This helps the river become more resilient during times of prolonged dry weather and drought."
        },
        {
            "text": "The National Trust reversed historical land drainage by filling in the ditch network and spreading deadwood across the system, allowing water to flow freely across the meadow. New flow pathways formed naturally, creating channels connected to the floodplain. This ensures the land remains wet for longer periods of time, boosting biodiversity and increasing water storage capacity."
        },
        {
            "text": "On a larger scale, similar work has been undertaken across 125 hectares of Tivington Farm upstream of the River Aller scheme. Several kilometres of ditches were restored using the same techniques deployed at Mudpool Meadow. The farm was also put through arable reversion to reduce the impact of land management on the water environment."
        },
        {
            "text": "Additional projects and local community involvement"
        },
        {
            "text": "Two beaver families were introduced to Holnicote Estate and they have already developed the sites into complex wet woodland habitats. Beavers are nature’s engineers, re-building the lost wetland habitats and offering nature-based solutions to existing environmental problems."
        },
        {
            "text": "Paddocks beaver enclosure"
        },
        {
            "text": "Volunteers from the community surrounding Holnicote Estate assisted in planting 25,000 trees suitable to the wetland environment, including willow, bird cherry and black poplar. In addition to increasing carbon storage capacity and biodiversity, tree planting reduces the risk of flooding."
        },
        {
            "text": "Dr Stewart Clarke, National Trust specialist for Freshwater, Catchments and Estuaries said:"
        },
        {
            "text": "“We are creating the best possible conditions we can for the river to adapt and respond to whatever comes its way in the face of more severe and regular floods and droughts predicted with climate change”."
        },
        {
            "text": "The work continues…"
        },
        {
            "text": "The Porlock Vale Streams Riverlands Project at Holnicote Estate is due to continue over the coming years, helping to strengthen working relationships between the Environment Agency and the National Trust."
        },
        {
            "text": "Further work is planned to restore natural habitats, including in the Lower Hawkcombe area, where the stream and floodplain will be reconnected to extend saltmarsh and wetland habitats on Porlock Marsh."
        },
        {
            "text": "Somerset Rivers Authority chairman Cllr Mike Stanton said: “After so many years of hard work and planning, it is great to see this scheme flourishing”."
        },
        {
            "text": "The work ensures Holnicote Estate is a more climate resilient and sustainable landscape, achieving improvements for the environment, biodiversity, and local residents."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}