{
    "url": "https://space.blog.gov.uk/2024/02/15/super-sized-space-debris/",
    "title": "Super-Sized Space Debris",
    "authors": [
        "Astroscale"
    ],
    "categories": [
        "Space sustainability"
    ],
    "pub_date": "2024-02-15T17:15:43+00:00",
    "content": [
        {
            "text": "Credit: Artwork by Max Alexander/Steve Kelly. This image was created from 250 individual photographs that feature examples of debris in orbit."
        },
        {
            "text": "When we talk about space debris, you may remember the fleck of paint-sized debris that hit the ISS (International Space Station) whilst Tim Peake was onboard in 2016, or more recently, the lost bag of tools which floated away from ISS astronauts on a spacewalk."
        },
        {
            "text": "But a bigger concern is the larger pieces of debris in orbit - such as upper-stage rocket bodies."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Why are spent rocket bodies in space so dangerous? "
        },
        {
            "text": "Most objects in space need to collide with one another to create more debris. Although not ideal, working satellites in space can move out of the way if they are in danger. But with old, retired rocket bodies, there is no way to manoeuvre them easily."
        },
        {
            "text": "The biggest danger with rocket bodies is their batteries and fuel tanks onboard. These can unexpectedly explode with no contact from other space objects, and due to the enormous size of rocket bodies, a large amount of space debris can easily be created."
        },
        {
            "text": "In 2019, the break-up of an upper-stage rocket body caused over 70 pieces of trackable space debris, one of which came dangerously close to the ISS in September 2022 and caused it to make a manoeuvre out of the way. Also remember that small debris (under 10cm) is not trackable from Earth, so there are more pieces of debris than what we can see!"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What can we do about it?   "
        },
        {
            "text": "The last decade has seen a rise in space sustainability companies dedicated to ensuring that space remains accessible for future generations. Headquartered in Japan and with an established UK office, labs and cleanroom at Harwell Campus, Astroscale is working on technologies to help clean up space. The Active Debris Removal by Astroscale-Japan — or ADRAS-J — mission is the start of fully-fledged debris removal services."
        },
        {
            "text": "Astroscale is targeting an actual piece of debris, a Japanese upper-stage rocket body, using tested and enhanced technologies from their ELSA-d mission, working in partnership with JAXA (Japanese Space Agency)."
        },
        {
            "text": "ADRAS-J is the world’s first attempt to safely approach an actual piece of large debris, and it will showcase the essential capabilities for delivering in-orbit services such as Active Debris Removal (ADR), which Astroscale aims to have routine by 2030."
        },
        {
            "text": "ADRAS-J will carry out Phase I of JAXA’s Commercial Removal of Debris Demonstration, or CRD2, mission. Phase II, which has yet to be contracted, will involve capturing and removing space debris."
        },
        {
            "text": "The mission needs to be split into two stages to gather data on the rocket body, such as its condition and spin rate. This data will be vital for successfully capturing and removing the rocket body during Phase II."
        },
        {
            "text": "Astroscale hopes ADRAS-J will kickstart discussions on how to make Active Debris Removal an achievable reality for governments and space businesses worldwide and work towards a cleaner and more sustainable space for us now and for future generations."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "When will ADRAS-J fly? "
        },
        {
            "text": "The mission is set to launch from New Zealand with Rocket Lab on an Electron rocket on 18 February UTC. You can watch the live stream of the launch from this link, which will start 20 minutes before launch."
        },
        {
            "text": "To know more about the ADRAS-J mission, visit Astroscale’s website. Check out our other UK Space Agency blog, which talks about our other ongoing missions to tackle space debris."
        },
        {
            "text": " "
        }
    ]
}