{
    "url": "https://gott.blog.gov.uk/2024/02/15/the-evolution-of-the-knowledge-asset-grant-fund/",
    "title": "The evolution of the Knowledge Asset Grant Fund",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "Knowledge Asset Grant Fund",
        "Knowledge Assets Grant Fund",
        "Met Office"
    ],
    "pub_date": "2024-02-15T07:00:50+00:00",
    "content": [
        {
            "text": "Author: Sarah Staniland"
        },
        {
            "text": "This week the Government Office for Technology Transfer (GOTT) has reached a major milestone of funding over 100 innovative projects from across the public sector."
        },
        {
            "text": "Launched in 2021, the Knowledge Asset Grant Fund has supported exciting projects such as the Geospatial Commission’s Discovery work for their National Underground Asset Register, which is exploring potential opportunities to widen access to their digital map of underground pipes and cables, to reduce disruptions to the public and businesses, by preventing accidental damage to underground pipes and cables; all the way to a framework developed by Health and Safety Executive to improve health and safety outcomes and keep people safe."
        },
        {
            "text": "It’s the first-of-its-kind grant fund in the UK public sector for Knowledge Assets, to support how they can be further developed for new purposes."
        },
        {
            "text": "Below, I reflect on how the grant fund has evolved over the years and what the future might hold."
        },
        {
            "heading": 3,
            "text": "We’ve funded a wider range of projects"
        },
        {
            "text": "The number of projects GOTT is funding is increasing by roughly 50% each year – from 24 in our first year, to 38 in our second year and now 48 in our third year."
        },
        {
            "text": "We’ve introduced additional funding rounds to ensure that funding is available year-round to support more projects. This, along with advertising funding deadlines up to a year in advance, means that we have become a trusted place for those with public sector Knowledge Asset projects to get funding."
        },
        {
            "heading": 3,
            "text": "We’ve built a more diverse grant fund"
        },
        {
            "text": "We’ve introduced themed calls, such as the environment, digital economy, and the next AI call, to align with government priorities and to reach a broader and more diverse number of applicants."
        },
        {
            "text": "Knowledge Assets exist everywhere in the public sector. Our themed calls take account of this by encouraging public sector colleagues to consider what intangible assets they might have in their organisation, and not just in science and technology fields."
        },
        {
            "text": "We’ve also created a new Communities team to foster collaboration within the public sector and to help build a community of best practice when it comes to Knowledge Asset management and exploitation."
        },
        {
            "heading": 3,
            "text": "We’ve created a grant fund with you in mind"
        },
        {
            "text": "We want to make the grant fund as inclusive as possible and remove any barriers for applicants who may have caring responsibilities for instance."
        },
        {
            "text": "I know firsthand how difficult it can be to juggle a busy workload and personal life when funding deadlines fall around school holidays. That’s why it was important to ensure the grant fund deadlines and panel dates do not pose a barrier by falling in school holidays."
        },
        {
            "text": "We also ensure that the panels responsible for judging the grant fund applications, have good representation from women."
        },
        {
            "heading": 3,
            "text": "Looking to the future"
        },
        {
            "text": "We are excited about continuing to fund many more exciting projects and encourage our clients to share their views and experiences of developing Knowledge Assets."
        },
        {
            "text": "We’d really love to be able to celebrate our 200th funded project next year!"
        },
        {
            "text": "Find out more"
        }
    ]
}