{
    "url": "https://environmentagency.blog.gov.uk/2024/02/15/working-to-improve-lincolnshires-chalk-streams/",
    "title": "Working to Improve Lincolnshire’s Chalk Streams",
    "authors": [
        "Sarah Swift"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2024-02-15T16:18:26+00:00",
    "content": [
        {
            "text": "Working to Improve Lincolnshire’s Chalk Streams"
        },
        {
            "text": "As a Catchment Coordinator for the Environment Agency, my role is quite varied. I develop projects to improve our rivers with partner organisations, I support local catchment partnerships - groups of organisations that come together to improve the water environment - and I organise grant funding for projects on our programme. A big part of my job is looking at how we can work with others to improve chalk streams."
        },
        {
            "text": "Chalk streams are a rare and valuable habitat, often referred to as the equivalent of England’s rainforests. The Lincolnshire chalk streams have helped shape the Lincolnshire Wolds landscape over the past 10,000 years. Rain that falls on the Lincolnshire Wolds is filtered through the underlying chalk aquifer. Water then moves through fissures (cracks) in the chalk. The water emerges at ground level, from springs and blow wells, crystal clear and with a constant temperature of 10°C"
        },
        {
            "text": "Through our work with our partners such as the Lincolnshire Chalk Stream Partnership (LCSP) over the last ten years, we have been able to identify the actions and projects to improve our chalk stream habitats. Together we have worked on projects that create and improve in-channel habitat, reduce the amount of excess sediment entering the chalk stream, and lessen the impact of invasive non-native species. All this work helps to improve the water quality, water quantity and habitat of Lincolnshire’s chalk streams. These projects have benefited the Laceby Beck, River Rase and Great Eau. More information can be found on the LCSP’s website: Case Studies - Lincolnshire Chalk Streams Project"
        },
        {
            "text": "The announcement of a dedicated chalk streams fund in 2022 has allowed us to support our partners with projects that deliver a flow benefit to chalk catchments. These projects have been focused on investigation work which develops an evidence base for the impacts of low flows on our chalk streams. Investigations have taken place on Waithe Beck, Laceby Beck, North Beck and Barrow Beck. Further investigations will be completed on Skitter Beck and the Lud in 2023-24. It is hoped that these investigations will highlight areas where we can target our work. For example, we are working with LCSP to develop a river restoration project on the Waithe Beck in an area highlighted as a priority within the investigation. The aim of the project is to restore the river habitat to make it more resilient to low flows."
        },
        {
            "text": "More recently we have supported the LCSP to develop and implement a natural flood management project on the River Waring. Since the start of the project, field bunds, leaky barriers and in-channel features have been installed in the catchment. This has helped to increase space for water in the upper catchment, improve in-channel habitat by creating a more diverse channel, and reduce the amount of excess sediment entering the watercourse. Through the project, the LCSP were also able to engage landowners, volunteers and members of the local community to raise awareness of the special chalk streams habitat."
        },
        {
            "text": "We have worked with LCSP for many years on the Great Eau delivering a variety of projects. Our current project on the Calceby Beck, a tributary of the Great Eau, aims to work with the principles of wetland creation, floodplain reconnection and habitat, and feature improvements, providing a significant wetting diversity across the project site. In addition, the proposed works will also slow the flow of water to the Great Eau, hopefully contributing to natural flood management within the catchment. The project will be delivered in 2024, subject to funding."
        },
        {
            "text": "Looking ahead to the next financial year we will be continuing to support the LCSP and Lincolnshire Chalk Streams Trust with their investigation work. Through this partnership, we are hoping to employ a Northern Becks Project Officer on a fixed term contract to take this work forward. We are also developing projects on the River Waring, River Bain and River Rase."
        },
        {
            "text": "For more information on Chalk streams, please visit our Twitter page: @EnvAgencyMids"
        }
    ]
}