{
    "url": "https://educationhub.blog.gov.uk/2023/02/01/how-we-promote-and-teach-online-safety-in-schools/",
    "title": "How we promote and teach online safety in schools?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "bullying",
        "Curriculum",
        "online safety",
        "Schools"
    ],
    "pub_date": "2023-02-01T10:33:31+00:00",
    "content": [
        {
            "text": "Today’s pupils are growing up in an increasingly complex world, living their lives on and offline. This presents many exciting opportunities – but also challenges."
        },
        {
            "text": "Here’s how we’re supporting schools to help children use the internet safely."
        },
        {
            "heading": 3,
            "text": "What are some of the risks to online safety for children?"
        },
        {
            "text": "There are a range of potential harms that come with using the internet. Categories include:"
        },
        {
            "heading": 3,
            "text": "How are children taught about online safety in school? "
        },
        {
            "text": "As part of mandatory RHSE (Relationship, Health and Sex Education) in primary and secondary schools, pupils are taught about online safety in an age-appropriate way. This includes being taught:"
        },
        {
            "text": "In primary school, children are taught:"
        },
        {
            "text": "In secondary school, children are taught:"
        },
        {
            "heading": 3,
            "text": "How are children educated about things like pornography in school? "
        },
        {
            "text": "Guidance for teaching online safety suggests that secondary school teachers should address the topic of pornography as part of a suitable RSHE curriculum."
        },
        {
            "text": "Pupils should understand that specifically sexually explicit material such as pornography:"
        },
        {
            "heading": 3,
            "text": "How are you making sure teachers are supported to deliver these lessons? These are complicated subjects."
        },
        {
            "text": "We have published a support package to help all schools increase their confidence around and the quality of their RSHE teaching practice. This includes expert-led webinars which focus on some of the areas that are most challenging to teach."
        },
        {
            "text": "In addition, we have recently updated our Teaching online safety in schools guidance, which helps schools to integrate learning about online safety within the curriculum. We are also developing new guidance on teaching about sexual violence and harassment, which will include support for education around pornography and explicit images."
        },
        {
            "heading": 3,
            "text": "And do you make sure that pupils are protected from online risks in schools? "
        },
        {
            "text": "Our Keeping children safe in education (KCSIE) safeguarding guidance provides all school and college staff with information about different types of abuse and harm, including online abuse."
        },
        {
            "text": "The guidance is clear that staff should have safeguarding and child protection training (including online safety) at induction, which should be regularly updated. It also explains that schools and colleges should have an appropriate filtering and monitoring systems in place block harmful or inappropriate material on school IT systems."
        },
        {
            "text": "In addition, schools and colleges should have a strong policy on the use of mobile devices like phones and tablets. It’s up to head teachers to decide whether they want to restrict or prohibit their use in schools – if they do allow access, they should have a clear plan to tackle risks to online safety which could arise."
        },
        {
            "heading": 3,
            "text": "Are there any useful resources to help me talk to my child about safety online? "
        },
        {
            "text": "The following links provide guidance for parents and carers on how to talk to your children about a range of online safety issues. They also show how to set-up child-friendly home filtering and parental controls."
        }
    ]
}