{
    "url": "https://defrafarming.blog.gov.uk/2023/02/01/landscape-recovery-get-ready-for-the-second-round/",
    "title": "Landscape Recovery: get ready for the second round",
    "authors": [
        "Sam Burford"
    ],
    "categories": [
        "environmental land management schemes",
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-02-01T12:01:05+00:00",
    "content": [
        {
            "text": "You may have seen in our recent environmental land management update that the second round of Landscape Recovery will open in spring. "
        },
        {
            "text": "To help you prepare, we’re hosting a series of webinars. In this post, I’ll share a brief overview of Landscape Recovery, our progress so far and the details of those webinars. "
        },
        {
            "heading": 2,
            "text": "Landscape Recovery "
        },
        {
            "text": "Landscape Recovery is one of our environmental land management schemes. "
        },
        {
            "text": "The scheme is for farmers and land managers who want to take a large-scale, long-term approach to producing environmental and climate goods on their land. "
        },
        {
            "text": "It funds ambitious landscape-scale projects through bespoke, long-term agreements. "
        },
        {
            "text": "Over the coming years, these projects will deliver a wide variety of environmental and social outcomes, as well as making an important contribution to national targets. For example, the ambitions of the  25 Year Environment Plan and achieving net zero carbon emissions. "
        },
        {
            "heading": 2,
            "text": "The story so far"
        },
        {
            "text": "Following a successful first round of applications, we announced the 22 selected projects in September."
        },
        {
            "text": "The majority of projects involve groups of land managers and farmers, including tenants, working together to deliver a range of environmental benefits across farmland and rural landscapes."
        },
        {
            "text": " Together, they aim to restore nearly 700km of rivers and protect and enhance 263 species across over 40,000 hectares. "
        },
        {
            "text": "In December, I shared an update on the first round of Landscape Recovery with a spotlight on some of some exciting projects. These include some brilliant examples of projects led by farmer clusters. "
        },
        {
            "text": "We are pleased to say that all of the projects in the first round have now completed enrolment, and most have started project development. "
        },
        {
            "text": "We will support them to complete the development phase and move into implementation as soon as possible.  "
        },
        {
            "text": "Over the coming months, we will share more information about some of the first round projects here on the blog. "
        },
        {
            "heading": 2,
            "text": "Round 2"
        },
        {
            "text": "We will open the second round of Landscape Recovery in spring. It’s worth subscribing to the blog as we’ll publish a post as soon as it opens. "
        },
        {
            "text": "We hope to build on the success of the first round supporting even more projects across the country to instigate large-scale, long-term positive environmental change. "
        },
        {
            "text": "As in the first round, we will select projects through a competitive application process. Selected projects will be awarded a project development grant to support more detailed planning where it's needed. "
        },
        {
            "text": "Successful projects will then proceed to implementation, with agreed funding from government, and the private sector. "
        },
        {
            "text": "We are looking for up to 25 projects in the second round, depending on the quality of applications.  "
        },
        {
            "text": "The second round will focus on projects of at least 500 hectares targeting net zero, protected sites and habitat creation. This could include landscape scale projects creating and enhancing woodland, peatland, nature reserves and protected sites such as ancient woodlands, wetlands and salt marshes. "
        },
        {
            "text": "All projects will be assessed for the benefits they will deliver for a wider range of objectives such as water quality and social outcomes. "
        },
        {
            "heading": 2,
            "text": "Join a webinar "
        },
        {
            "text": "We will provide more information about this exciting opportunity in our webinars.  "
        },
        {
            "text": "We will also seek feedback from potential applicants on our proposals. The full guidance will be provided when we open for applications."
        },
        {
            "text": "To attend a webinar, sign up by clicking on a date below: "
        },
        {
            "text": "The webinars will be the same, so attend whichever one is most convenient for you. "
        },
        {
            "text": "We will record them and add them to this blog post so you can catch up later if you can’t attend on the day."
        },
        {
            "text": "Feel free to share this post and details of the webinars with your contacts.  "
        },
        {
            "text": "If you have any questions about the scheme, join a webinar or comment below."
        }
    ]
}