{
    "url": "https://planninginspectorate.blog.gov.uk/2023/02/01/national-infrastructure-applications-service-improves-user-experience-with-launch-of-examination-stage/",
    "title": "National Infrastructure Applications Service improves user experience with launch of examination stage",
    "authors": [
        "Oliver Blower"
    ],
    "categories": [
        "Applications",
        "Digital",
        "Service improvement"
    ],
    "pub_date": "2023-02-01T15:10:43+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Oliver Blower (Applications Service Manager) leads the improvements to the Inspectorate’s applications service. In this post he explains the developments being made to the online service for nationally significant infrastructure projects."
        },
        {
            "text": "In previous blogs we discussed how the Applications Service aims, amongst other things, to improve how users engage with the national infrastructure process online, making the experience easier, faster and more cost effective."
        },
        {
            "text": "This in large part involves the modernisation of the national infrastructure planning website, which is the key route our users take to view and comment on information. We have taken an agile, phased approach, replacing small elements of the website at a time whilst keeping the existing website as a launching point to the new elements. This allows us to release and iterate faster whilst minimising risk."
        },
        {
            "text": "In April 2022 we launched our new “register to have your say” journey which allows users to submit a relevant representation and become an interested party at the pre-examination stage. The new-look relevant representation journey has simplified the task for users into bite-sized chunks in easily understandable language to meet accessibility standards."
        },
        {
            "text": "This service, as well as the associated webpage to view the submitted relevant representations, has been trialled on seven live national infrastructure projects to date and we continue to monitor and act on feedback. We also continue extending this to new national infrastructure applications in England. Once we have the full service in place we will begin translation work to extend the service to Welsh projects."
        },
        {
            "heading": 2,
            "text": "Launch of the examination stage"
        },
        {
            "text": "We have now reached an important new milestone by moving to the examination stage. We have launched the documents and examination timetable pages and the new “have your say” journey which allows users to make their submissions against examination deadlines. These new pages are being trialled on the Drax Bioenergy with Carbon Capture and Storage Project. They have been developed over months through detailed user testing, design and development. We will also continue to iterate these in response to user feedback."
        },
        {
            "text": "The new journey has accessibility at its core, simplifying how users interact with our service. This will provide a better experience for people who use screen readers, and will enable people new to taking part to fully engage with the application process. The new “have your say” journey also ensures that submissions are made against the relevant deadline item(s), simplifying their collation and so improving efficiency."
        },
        {
            "heading": 2,
            "text": "Feedback"
        },
        {
            "text": "Every one of our new webpages allows for user feedback through a prominent link at the top of the page. We encourage all users of the service to submit their views so that we can continue to improve."
        },
        {
            "text": "The feedback we have received to date has been invaluable in designing further iterations. For instance, we are committed to increasing the number of documents visible per page, to make the location of the examination library more prominent, and to reintroduce the search by date filter to the documents page. The team are working hard on these revisions, amongst others, which will be released in due course."
        },
        {
            "heading": 2,
            "text": "Where next?"
        },
        {
            "heading": 3,
            "text": "Topping and tailing the service"
        },
        {
            "text": "With the major milestones of the pre-examination and examinations stages achieved, we are turning our sights to “topping and tailing” the remainder of our service. Throughout 2023 you will see the old website slowly be replaced with a new look and functionality."
        },
        {
            "text": "We will at the same time continue to improve the elements already launched."
        },
        {
            "heading": 3,
            "text": "Back office"
        },
        {
            "text": "Although our external stakeholders will be familiar with our website, they may not be aware that we are also working on replacing our back-office system. This is a complex endeavour which we aim to largely complete towards the end of 2023. Many of the future improvements to the website we have in store are dependent on the new functionality that will come with this work, so watch this space."
        },
        {
            "heading": 2,
            "text": "See our previous blog posts about this project"
        }
    ]
}