{
    "url": "https://insidedio.blog.gov.uk/2023/02/01/national-storytelling-week-tales-from-the-plain/",
    "title": "National Storytelling Week: Tales from the Plain",
    "authors": [
        "Lt Col Vance Worsley"
    ],
    "categories": [
        "Land Management",
        "Salisbury Plain Training Area",
        "Training Estate Public Safety"
    ],
    "pub_date": "2023-02-01T11:45:46+00:00",
    "content": [
        {
            "text": "It’s National Storytelling Week so I thought it would be a great opportunity to tell you a little bit about myself and my role and to share some stories with you about Salisbury Plain Training Area, the UK’s largest military training area."
        },
        {
            "heading": 2,
            "text": "There are two sides to every story"
        },
        {
            "text": "There are two sides to every story and on Salisbury Plain Training Area (SPTA) that’s more evident than you could ever imagine. On a sunny January morning cattle graze amongst loud bangs, armoured vehicles move noisily over buried prehistoric remains and soldiers train near where people might be walking, driving, cycling or horse riding."
        },
        {
            "text": "I’m Lieutenant Colonel Vance Worsley, and my role at SPTA is also two sided. As Commandant I’m responsible for accommodating, feeding and looking after training troops in our three camps. I’m also the Senior Training Safety Officer for SPTA and me and my team make sure that the training area and ranges are maintained so that they are safe and sustainable for both military users and the public, who use the area for recreational purposes."
        },
        {
            "heading": 2,
            "text": "Enjoy the Plain but stay safe"
        },
        {
            "text": "SPTA is a beautiful landscape, and we’d encourage you to use it. However, it can be a dangerous place if you don’t follow the rules – it can go from calm to combat in an instant, so it’s important that you access the area safely and responsibly."
        },
        {
            "text": "Pictured are soldiers from C Sqn Household Cavalry Regiment and their Scimitar Vehicle driving into standing water during Exercise IRON SCOUT 3. [Crown Copyright / MOD 2021]We ask that you only use the area when it’s safe to do so – drive on Public Rights of Way, pay attention to signs, information displays and red flags, don’t pick up any military debris and stick to public footpaths and bridleways. Always read the online firing times before you visit and read our online guide on how to access the training estate safely. #RespectThe Range"
        },
        {
            "heading": 2,
            "text": "Military training and wildlife go hand in hand"
        },
        {
            "text": "SPTA has been a military training area for over 100 years, and, in that time, it’s been home to many training soldiers and many rounds of ammunition have been fired. At any one time up to 40 units can be out on the Plain, that’s around 4250 soldiers that can be training at once. At the same time the rich grasslands found here are home to a variety of wildlife, including butterflies, bumblebees and other insects, as well as birds such as the stone curlew, barn own and harrier."
        },
        {
            "text": "Cattle grazing in a temporary pen on Salisbury Plain Training Area [Crown Copyright / MOD 2023]Part of my role involves making sure that SPTA is well managed so that it meets the needs of training troops, and at the same time is preserved and conserved. I have a legal statutory requirement to look after the grasslands and these are partly maintained by grazing. Areas of land are grazed in temporary pennings that can be moved. Grazing restrictions are applied to areas important to wildlife.  It’s a fine balancing act meeting the needs of the farmers and the training troops, but it works."
        },
        {
            "heading": 2,
            "text": "My favourite place…"
        },
        {
            "text": "An old armoured vehicle, used to add realism to a street in the urban training facility at Copehill Down on Salisbury Plain Training Area. [Crown Copyright / MOD 2022]My favourite place on the Plain is Copehill Down Village. It’s a purpose-built urban training facility that has been in existence for 36 years. It’s designed to replicate a village so that personnel can practice attacking and defending on various levels. It’s the largest urban training facility on the UK Defence Training Estate. It’s been upgraded recently and it’s so versatile that it can be adapted at short notice to meet the unique training needs of both UK and overseas troops. There are lots of stories hidden within its walls and having trained here myself it brings back lots of memories."
        },
        {
            "heading": 2,
            "text": "The history of what lies beneath"
        },
        {
            "text": "A disc from a necklace, found during an excavation on SPTA [Crown Copyright / MOD 2022]Buried deep beneath the surface of SPTA there are lots of hidden gems. A long and deep history spans the ages. SPTA is home to a wide range of heritage starting way back in prehistoric times: a Paleolithic bi-faced axe, an Early Iron Age to Late Bronze Age midden and a collection of Roman villages have all been found here, and it’s also the site of a Battle of Britain Spitfire crash. DIO plays an important role in conserving, maintaining and preserving this important national heritage across SPTA and the wider Defence estate."
        }
    ]
}