{
    "url": "https://educationinspection.blog.gov.uk/2023/02/01/ofsteds-2023-priorities-for-schools-and-further-education-and-skills/",
    "title": "Ofsted's 2023 priorities for schools and further education and skills",
    "authors": [
        "Lee Owston, Acting National Director Education"
    ],
    "categories": [
        "further education and skills",
        "schools",
        "teachers"
    ],
    "pub_date": "2023-02-01T15:30:32+00:00",
    "content": [
        {
            "text": "2023 is already shaping up to be another busy year for schools and further education (FE) and skills providers. While none of us can quite predict what might be around the corner, our Annual Report, published at the end of last year, did identify several challenges that will undoubtedly continue into this year."
        },
        {
            "text": "We reported on the ongoing issues of the pandemic, including around attendance. Specifically, we highlighted the increasing use by schools of part-time timetables. Schools may be using these with the best of intentions but pupils can too easily move out of sight because they’re absent from education for too much time, and too often it is used to try to avoid the legal requirements around excluding a pupil."
        },
        {
            "text": "We also warned about the number of children in unregistered schools, as well as children with special educational needs and disabilities (SEND), many of whom continue to struggle with inconsistent levels of support and a lack of joined-up provision."
        },
        {
            "text": "Alternative provision (AP) was also an area of focus in the report, particularly unregistered AP, which does not have any direct oversight. It is sometimes used as a shadow SEND system, with pupils referred there indefinitely while they wait for a suitable placement at another school. This is unfair to the child and risks disguising the true level of demand for appropriate SEND support."
        },
        {
            "text": "In the FE and skills sector, we found great variety in learners and providers’ experiences. We found good examples of ambitious curriculums, skilled teachers, and motivated learners. But we also saw:"
        },
        {
            "text": "Workforce pressures"
        },
        {
            "text": "There is clearly a lot of work to do to make sure that young people have the opportunities they deserve. But our report also highlighted the significant workforce pressures the sector is facing. Many schools and colleges are struggling to recruit and retain teachers, tutors, and other staff."
        },
        {
            "text": "We also emphasised the importance of high-quality teacher training and development. It is vital that schools can recruit, train, and retain a highly skilled workforce."
        },
        {
            "text": "What next?"
        },
        {
            "text": "Our report also included our reviews of T-levels and skills bootcamps. We found that many providers are delivering high-quality training and education, but some are finding it difficult to properly implement these new programmes. We will therefore be inspecting skills bootcamps from April and will be revisiting T-level providers in 2023."
        },
        {
            "text": "Perhaps our most reported findings from 2022 were those from our inspections of previously exempt outstanding schools. The exemption was lifted during the pandemic, but we have now been able to inspect 370 formerly exempt schools. We found that 83% were no longer outstanding."
        },
        {
            "text": "However, this may not be representative of all formerly exempt schools. We prioritised the schools that had gone the longest without inspection, an average of 13 years. And very few had been graded under the education inspection framework (EIF), which raised the bar for outstanding. As a result, they are not typical of all exempt schools, and the pattern of inspection outcomes may change later. We will therefore continue this programme and will inspect all previously exempt outstanding schools by the end of July 2025. We will publish a fuller report on previously exempt schools in the coming months."
        },
        {
            "text": "Our annual report also provided an overview of inspection judgements. The proportion of state-funded schools judged good or outstanding is now 88%. This marks an increase from 86% in 2021."
        },
        {
            "text": "It’s important to remember that during the pandemic (2020–21 and into 2022), we inspected with no outcomes data more recent than 2018-2019. However, as part of the Annual Report, we wanted to analyse the relationship between performance data and our judgements during this time. This analysis provided some confidence that there continues to be a relationship between statutory outcomes and inspection judgements. This is because of the clear link between a good quality of education and a school’s outcomes. That said, there is often less of a link for inadequate schools, because these are often judged inadequate for safeguarding rather than for quality of education."
        },
        {
            "text": "Although improvements have been made, pupils’ attendance remains a priority for schools as we recover from the pandemic. Schools that have secured better attendance are characterised by leaders clearly and consistently communicating their high expectations. These leaders analyse any trends carefully to help them target their actions."
        },
        {
            "text": "We look forward to continuing our curriculum insight work in 2023 by publishing further research reviews and the first of our subject reports. Our science subject report will be available soon and will paint a picture of the teaching of the subject across England. We hope that the findings and recommendations in these reports contribute further towards the growing pool of subject expertise."
        },
        {
            "text": "At the end of 2022, we published our new area SEND inspection framework jointly with the Care Quality Commission (CQC). In January, we began carrying out our first inspections. The new framework aims to promote further improvement in the SEND system by strengthening accountability and focusing on the features we know make local area arrangements most effective in improving the lives of children and young people with SEND. We will share the findings and insights from our inspection evidence with government as plans for SEND reform continue to develop."
        },
        {
            "text": "Finally, we’re developing training for all inspectors to help them understand some of the complexities that small schools face in delivering a broad, well-sequenced curriculum. This will help them when they’re inspecting small schools."
        }
    ]
}