{
    "url": "https://socialcareinspection.blog.gov.uk/2023/02/01/ofsteds-2023-priorities-for-social-care/",
    "title": "Ofsted's 2023 priorities for social care",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "Care Review",
        "social care professionals",
        "social care regulation",
        "Uncategorized"
    ],
    "pub_date": "2023-02-01T15:30:56+00:00",
    "content": [
        {
            "text": "2022 saw the publication of several reviews looking at the children’s social care sector. The Care Review, the Competition and Markets Authority market study, and the Child Safeguarding Practice Review Panel all made major recommendations for reform."
        },
        {
            "text": "In our own Annual Report, which we published at the end of the year, we set out the important backdrop for these calls for reform: the social care sector is under significant pressure due to a combination of workforce issues and wider systemic and social issues."
        },
        {
            "text": "We also raised specific concerns around unregistered children’s homes, criminal exploitation, care leavers, supported accommodation and unaccompanied asylum-seeking children."
        },
        {
            "text": "We did, though, identify some remarkable resilience from providers within the sector. Overall, we found the picture for local authorities’ children’s services has improved in very difficult conditions. And for social care providers, especially children’s homes, there has been little change in overall effectiveness. In many ways, this is notable given the pressures they face."
        },
        {
            "text": "What next"
        },
        {
            "text": "However, the sustainability of this picture is under question. The pressures on the sector look likely to increase in 2023 as any further increases in the cost of living are likely to increase the number of families living in poverty. Local authorities may in turn see higher numbers of children in need and more child protection cases."
        },
        {
            "text": "Our report on local authority sufficiency planning found that many are already struggling with a last minute dash to find homes for children coming into care due to the rising demand for places and a lack of suitable accommodation. Any increase in children entering care could overwhelm an already stretched system."
        },
        {
            "text": "As well as this continuing focus on children entering care, in 2023 we will be increasing our scrutiny of children leaving care. From this month, our inspections of local authority children’s services (ILACS) will include a separate judgement on ‘the experiences and progress of care leavers.’ This follows our recent consultation on changes to the framework, which saw over 90% of respondents support our plans for a specific focus on care leavers."
        },
        {
            "text": "In April we will begin registering currently unregulated accommodation providers for 16–17-year-olds in care and begin pilot inspections later in the year. Right touch regulation is one of our strategic priorities and we will make sure this applies to this new role. We will be proportionate and risk-based in our approach to get this right for all children in supported accommodation."
        },
        {
            "text": "Our strategic priorities also include ‘keeping pace with sector changes’ and ‘inspections that raise standards.’ These will also be forefront to us in 2023 as we:"
        }
    ]
}