{
    "url": "https://companieshouse.blog.gov.uk/2023/02/01/our-cancer-network-why-inclusive-support-matters/",
    "title": "Our cancer network: why inclusive support matters",
    "authors": [
        "Sarah Warrilow - Project Support Officer"
    ],
    "categories": [
        "People and culture",
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2023-02-01T11:20:17+00:00",
    "content": [
        {
            "text": "It was a text message that filled me with excitement and dread – when your best mate (who happens to be the Welsh Breast Cancer Lead for Macmillan Cancer Support) asks for a favour:   "
        },
        {
            "text": "As soon as I heard Bami’s name, I knew I wanted to be involved. "
        },
        {
            "text": "I first heard about Bami because of my love for the Maggie’s centre based in Whitchurch, Cardiff.  I used to work for Velindre Cancer Care and watched the construction of the Maggie’s centre in the grounds of the hospital. Bami is an ambassador for this magical place. It provides a home from home ‘kitchen table’ safe space, to catch your breath and talk to someone who really understands cancer."
        },
        {
            "text": "When my mother was diagnosed and quickly passed away from Breast cancer back in the late 90s, this was the safe space I craved and the refuge she needed. It didn’t exist for us then but I’m so grateful that it does now. I guess everything I do to support cancer charities and those with cancer leads me back to this time. It is, and always will be, my ‘why’. "
        },
        {
            "text": "When you hear someone like Bami speak and read her words, you cannot help but listen! Looking to tackle health inequalities experienced by those from ethnic minority backgrounds, Bami is all about giving women the tools to thrive after their cancer diagnosis and working with healthcare bodies to raise awareness for positive change. "
        },
        {
            "text": "There are some people in life that you just know you’ll learn so much from. I grabbed the opportunity to chat with Bami and watching the footage turn into a campaign over the last few months has filled me with so much pride. "
        },
        {
            "text": "The way I look at it – who did you need when you were at a low ebb? Throughout my Mum’s journey with cancer, there were no supportive resources to draw upon. The internet was barely a thing (I’m ancient) and podcasts were the stuff of ‘Tomorrow’s World’ (see, told you I was ancient). I guess there was the occasional cancer related storyline in a TV show – but there was no diversity across the piece and certainly the concept of ‘dying well’ or ‘living well’ with cancer was unheard of."
        },
        {
            "heading": 2,
            "text": "Supporting our colleagues"
        },
        {
            "text": "Cancer can affect people in many ways - physically, emotionally and financially. Things have improved and there’s now lots more support and information available to help people going through a diagnosis or treatment."
        },
        {
            "text": "The Cancer Support Network here at Companies House was started 5 years ago. What began as people with a diagnosis coming together turned into a network to support people across the organisation. From those who have had a personal diagnosis, to line managers and people wanting to support their colleagues, as well as those who have friends and family outside of work going through a diagnosis and or treatment. "
        },
        {
            "text": "The group is a safe space to connect and help our colleagues. It provides advice and desk aids for managers, signposts counselling services, charities and financial help from the Charity for Civil Servants.  "
        },
        {
            "text": "The network is also linked into the wider Cross Government Working through Cancer group, where we’re trying to reach out, hold events, and show that our support networks are for all communities, taking into consideration cultural differences."
        },
        {
            "heading": 2,
            "text": "Representation really does matter"
        },
        {
            "text": "With the stats showing us that 1 in 2 of us will develop cancer in our lifetime (Cancer Research UK, pub. British Journal of Cancer) and the increased odds of people from ethnic minority backgrounds dying from cancer compared to other racial groups – early detection and knowing and loving our bodies is key. "
        },
        {
            "text": "I’m really hoping that people seeing little old me sipping tea with Bami in the MacMillan campaign will bring much needed representation, perhaps offering hope and opportunity to those trapped behind the invisible barriers of stigma, silence, secrecy, and shame. The campaign video has now reached over 4.5 million on social media and is available on the Macmillan website in Urdu, Welsh and Arabic. "
        },
        {
            "text": "Representation really does matter – I remember the first time I saw a plaster for brown skin, my mind was blown! When my friend told me about the work she was doing to obtain lymphoedema compression sleeves for different coloured skins and breast prosthesis in different skin tones, I thought back to my Mum and was so grateful that the women who follow her have the opportunity to receive better, more personalised care. Not just surviving, but thriving. "
        },
        {
            "text": "I don’t have cancer but when you lose a parent early (my mum was 49 when she passed away) you don’t imagine yourself living beyond that time or even being cancer free. "
        },
        {
            "text": "I aim to be the person my family needed during those pretty dark days. So I will champion the Maggie's centres, be part of campaigns that put me out of my comfort zone, support our wonderful and inclusive networks and be a safe space for anyone who needs support to navigate their cancer pathway."
        }
    ]
}