{
    "url": "https://naturalengland.blog.gov.uk/2023/02/01/poseidon-offshore-wind-and-nature/",
    "title": "POSEIDON: Changing the game for offshore wind and nature",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Marine environment"
    ],
    "pub_date": "2023-02-01T09:14:34+00:00",
    "content": [
        {
            "text": "By Alex Fawcett and Victoria Copley, Marine Strategic Solutions Principal Advisers"
        },
        {
            "text": "Offshore wind development is a vitally important part of the UK government approach to tackling the climate crisis and addressing energy security. This priority sits alongside the urgent need to halt and reverse the decline in marine biodiversity and enable nature's recovery. To achieve sustainable offshore wind development alongside a thriving marine environment, offshore planning decisions need to be informed by up-to-date, high-quality data that allows for effective identification of the most appropriate sites for development and mitigation opportunities."
        },
        {
            "text": "In response, Natural England is leading the POSEIDON project (Planning Offshore Wind Strategic Environmental Impact Decisions) which will establish a robust evidence base made accessible through new mapping tools to support the expansion of low impact offshore wind development alongside thriving marine nature. The project is part of the Offshore Wind Evidence and Change Programme (OWEC), led by The Crown Estate which aims to facilitate the sustainable and coordinated expansion of offshore wind to help meet the UK’s commitments to low carbon energy transition whilst supporting clean, healthy, productive and biologically diverse seas.\nPOSEIDON is a multi-year; multi-partner project and aims to create:"
        },
        {
            "text": "Identifying strategic evidence gaps\nSo far, we’ve been collating and assessing existing data about seabirds, marine mammals, and the seabed to understand where there are knowledge gaps which we need to fill. Over 700,000km of existing bird and mammal data have been processed and collated, with additional seabed data acquired and added to the OneBenthic portal. Survey plans were then designed to address the knowledge gaps through collecting new data. Survey planning also factored in other data collection initiatives, confidence in current models and priority areas for offshore wind development."
        },
        {
            "text": "Addressing gaps through collection of new data\nSeabed surveys started in September in the North Sea and Irish Sea and are expected to be complete this year. The POSEIDON Benthic Storyboard provides a real-time summary of data collation and survey progress, and the provisional survey locations for 2023 when we’ll be focusing on the Celtic Sea, the Southwest and the English Channel."
        },
        {
            "text": "Digital Aerial Surveys of seabirds and marine mammals will also start this year, with survey priorities identified through quantitative and qualitative analysis of existing data. This identified areas and seasons with the least available data and identified two clear areas where limited data exists at any time of year for either seabirds or marine mammals. These cover a large area of the central North Sea and a slightly smaller area of the South-West approaches in the Celtic Sea. Four seasonal repeat surveys are planned across these areas from now through to September 2023, and again from 2023 to 2024. The new data collected through POSEIDON will be made publicly available via the Crown Estate's Marine Data Exchange (MDE), the world’s largest database of offshore renewables survey data, research, and evidence."
        },
        {
            "text": "What’s next?\nEarly planning is underway on the design of the mapping and modelling tools which will be the key POSEIDON outputs. These will include updated spatial models for key species and habitats (receptors) that are most vulnerable to offshore wind impact and an environmental risk and opportunity map to help guide future offshore wind development and feed into wider marine planning.\nPOSEIDON is also working closely with Defra and other colleagues to identify opportunities for the project to contribute to the ambitions of the British Energy Security Strategy (BESS) and to ensure that project outputs align with complementary work led by Defra through Offshore Wind Enabling Action Programme (OWEAP).\nNatural England are also delivering a second project part funded by the OWEC programme called MaRePo (Marine Restoration Potential mapping). The project will map the potential for restoration of some of the known threatened and declining marine habitats in English waters. These include kelp, maerl, horse mussel and sea-pen burrowing mega-fauna habitats. The project will provide evidence as to where these habitats could be restored to feed into key policy areas."
        }
    ]
}