{
    "url": "https://civilservice.blog.gov.uk/2023/02/01/world-cancer-day-uniting-our-voices-and-taking-action/",
    "title": "World Cancer Day: Uniting our voices and taking action",
    "authors": [
        "Seonaid Webb is Executive Head of Service (Transformation and Partnerships) at Mole Valley District Council and chair of the Civil Service Working through Cancer network"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-02-01T08:59:08+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To mark World Cancer Day, the Civil Service Working Through Cancer Network is encouraging staff to raise awareness about prevention, detection and treatment of cancer and the significant value of workplace support groups. "
        },
        {
            "text": "This year’s theme for World Cancer Day (4 February 2023) is uniting our voices and taking action. As the campaign suggests when we bring like-minded people together to share concerns and drive positive change, we are a united force, significantly increasing the impact of our actions. "
        },
        {
            "text": "The Civil Service Working Through Cancer Network is now in its fifth year and has representation in more than 30 public sector organisations. Our aim has always been to unite voices so that we can take bigger and more impactful action. "
        },
        {
            "text": "For example, by joining forces we were able to host a series of Know Your Blood Type events with the NHS Blood Team, recruiting more than 1,000 new blood donors. Working with stem cell charity DKMS we then added more than 500 new stem cell donors. "
        },
        {
            "text": "We united our voices to call for better support at work and acted by co-designing a cancer awareness in the workplace session with Macmillan. This popular training continues to be delivered to hundreds of line managers across the Civil Service, improving the lived experience for people with cancer (and their carers) across many organisations. "
        },
        {
            "text": "Over the past five years we’ve been delighted that many senior leaders and ministers have offered to take positive action to support our cause. In October for example, we hosted a conversation with Dame Lynne Owens about her recent cancer diagnosis and treatment and the impact this had on her both in-and outside work. The event attracted nearly 1,000 attendees and we were inundated with positive feedback and requests to join the network."
        },
        {
            "text": "These seemingly simple actions, individually, when combined have created a significant impact. We’re making great headway on our aims to raise awareness and reduce the taboo of talking about cancer, and to improve people’s ability to stay in (or return to) work post treatment.  "
        },
        {
            "text": "This World Cancer Day,  we’re uniting our voices again with a series of virtual events and sessions open to all public servants. We’re delighted to announce some fantastic guest speakers this year, including Professor Sir Chris Whitty, Cathy Brokenshire (widow of minister James Brokenshire), and Dawid Konotey-Ahulu CBE. Join us via Eventbrite - it would be great to see you."
        },
        {
            "text": "So, to close, we’d love it if reading this article has encouraged you to unite with us and take action. If we were all to commit to one action this World Cancer Day, and to support the Working Through Cancer Network – perhaps attending a cancer awareness session, signing up to be a blood or stem cell donor, or becoming a disability ally to colleagues affected by cancer – imagine the impact we will have across the public sector and beyond!"
        },
        {
            "text": "For anyone who’d like to join the network you can contact us here workingthroughcancer@defra.gov.uk or follow us on Twitter: @cscancernetwork"
        }
    ]
}