{
    "url": "https://defrafarming.blog.gov.uk/2022/06/30/apply-for-the-sustainable-farming-incentive/",
    "title": "Apply for the Sustainable Farming Incentive",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to better understand moorland",
        "Payments to improve soil health",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-06-30T12:45:42+01:00",
    "content": [
        {
            "text": "The Sustainable Farming Incentive (SFI) is now open for applications via the Rural Payments service."
        },
        {
            "text": "Through the SFI, farmers will be paid for looking after the natural environment in the course of their farming."
        },
        {
            "text": "This initial offer will pay farmers for taking care of their soil or assessing the condition of moorland. "
        },
        {
            "text": "In future, we’ll add more actions that farmers can get paid to take. "
        },
        {
            "heading": 2,
            "text": "Get ready to apply "
        },
        {
            "text": "Applications are now open; there is no deadline so farmers can apply whenever it makes sense for them."
        },
        {
            "text": "We’ve designed the application process to be as straightforward and quick as possible for farmers."
        },
        {
            "text": "The SFI application service includes some new functionality that will allow us to carry out checks automatically. This will enable us to process applications much faster."
        },
        {
            "text": "We’ll roll out this new functionality in a controlled way during July so that we can make sure we’re able to give everyone the right level of service and support."
        },
        {
            "text": " During this initial period, when you log in, you’ll either be able to apply online straightaway or we’ll ask you to get in touch with the Rural Payments Agency who will support you to apply. "
        },
        {
            "text": "Whenever you choose to apply, make sure your details are up to date before you do. "
        },
        {
            "heading": 3,
            "text": "Check contact details and permissions "
        },
        {
            "text": "Sign into the Rural Payments service to check your business and personal details. "
        },
        {
            "heading": 3,
            "text": "Check your eligibility"
        },
        {
            "text": "The SFI guidance explains the eligibility criteria."
        },
        {
            "heading": 3,
            "text": "Check your land details "
        },
        {
            "text": "When you apply online for SFI in the Rural Payments service, you will see the land parcels currently linked to your Single Business Identifier (SBI). You will also see the available area for SFI in those land parcels, based on registered, eligible land covers. "
        },
        {
            "text": "If these details aren’t up to date, it will affect which land parcels you can select to include in your application. Do check your digital maps too. For more information, read the guidance about checking your land before you apply."
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "You will apply online in the Rural Payments service using your existing sign in details."
        },
        {
            "text": " We’ve published guidance on GOV.UK to help you apply as well as the video below."
        },
        {
            "heading": 2,
            "text": "A note of thanks "
        },
        {
            "text": "Since May, a number of BPS eligible farmers interested in the SFI have helped us by testing the application process. "
        },
        {
            "text": "We want to thank them for their time, insight and feedback."
        },
        {
            "text": "We’d also like to thank our SFI pilot farmers who are testing out an expanded version of the scheme on their farms, including a wider range of standards. We have taken their feedback and applied it to the new service so that it will work better for farmers. "
        },
        {
            "text": "If you’d like to share your application experience with us, let us know in the comments."
        },
        {
            "text": "Finally, we'll blog about how we’ve improved the scheme soon, so do subscribe to the blog."
        }
    ]
}