{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/06/30/apple-and-googles-stranglehold-over-mobile-ecosystems-why-its-important-and-what-were-doing-about-it/",
    "title": "Apple and Google’s stranglehold over mobile ecosystems: Why it’s important and what we’re doing about it",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "CMA Digital",
        "Markets"
    ],
    "pub_date": "2022-06-30T13:02:02+01:00",
    "content": [
        {
            "text": "Few people would doubt just how fundamental smartphones are to our lives. They are increasingly the main way we interact with friends and family, access news, play games, buy products and services online – and now pay for them in shops. Love it or loathe it, our phones have become a key gateway for people and UK businesses alike. Moreover, for some of the poorest households in the country they are the only way to get online and a vital lifeline to essential public resources and services.  This makes the fact that the systems upon which these devices rely are almost entirely controlled by just 2 companies – Apple and Google – concerning. Apple and Google are the gatekeepers to everything coming through our phones, creating a digital stranglehold that is only getting stronger over time."
        },
        {
            "heading": 2,
            "text": "The problems uncovered in our Mobile Ecosystems Market Study"
        },
        {
            "text": "The powerful position Apple and Google have in these markets, and their impact on competition, has been the subject of our year-long study into mobile ecosystems covering operating systems, browsers and apps on our mobile devices. We concluded that it is extremely difficult for rivals such as other browsers or alternative app stores to compete. Tens of thousands of small businesses reliant on these ecosystems, such as app and web developers, are entirely at the whim of the rules and processes set by these 2 companies. Apple and Google are not only their curators, but in many cases also their direct competitors (with their own news, music, payment and many more services)."
        },
        {
            "text": "We’ve heard directly from many businesses - small and large - who are fed up and frustrated. Concerns include instances where apps have been removed from their app stores with no notice or explanation, leading to loss of services for their customers and vital income; pre-installing apps, or setting defaults that favour them over others; and requiring some apps to use their payments systems but then charging high commissions. We have also heard concerns that they can stifle innovations by restricting developments that pose a risk to their own business models – Apple’s restrictions over new cloud gaming services is just one example.  Furthermore, many of the companies we spoke to were reluctant to be identified publicly, due to concerns of being exposed to retributive action from 2 of the most powerful companies in the world. They cannot walk away as there is no other choice. This affects the UK’s wider digital economy, including tech start-ups struggling to get a foothold; we risk missing out on growth and new opportunities across the UK."
        },
        {
            "text": "It’s not all bad news: Apple and Google have brought many benefits to consumers and businesses through their trusted platforms – not only in developing and investing in these digital markets but also the key role they play in protecting our privacy, security and safety online.  There’s no doubt about the importance of these issues. But we looked carefully into this - getting advice from technology and security specialists - and found there are many ways to allow for more competition without compromising safety and security. Many claims made by Apple in particular don’t seem to stack up."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "We don’t intervene in markets unless we have to – and even then we would rather find ways to open up markets than imposing rules and regulations. But in this case unless steps are taken now, we think that both companies are likely to maintain, and even strengthen, their grip, and that may be bad for many other businesses. This is why, following the conclusion on our market study, we have announced that we are:"
        },
        {
            "text": "These cases add to our growing portfolio of work aimed at tackling problems in digital markets while we await new tailored powers proposed by the government to oversee powerful tech firms like these."
        }
    ]
}