{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/06/30/better-policymaking-environments/",
    "title": "Better policymaking environments",
    "authors": [
        "Serena Nϋsing"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign"
    ],
    "pub_date": "2022-06-30T12:00:56+01:00",
    "content": [
        {
            "text": "As part of our work to transform policymaking, we believe there is a real opportunity to help government organisations improve their policymaking environment."
        },
        {
            "text": "Many policymakers will be familiar with their organisation’s work to improve their impact, by considering whether their culture, systems, and processes are helpful for making great policy. Often this happens in form of improvement programmes, a revised strategy or a capability review involving engagement with staff and recommendations for improvement."
        },
        {
            "text": "However, currently there isn’t a shared and systematic way to go about this. ‘Are we bringing in outside perspectives from organisations that have similar challenges? Are we following leading practice across government and beyond? Are we benchmarking ourselves against our peers?’"
        },
        {
            "heading": 2,
            "text": "Improving policymaking environments"
        },
        {
            "text": "We are working with government organisations to answer these questions, and to design a model to support them to think about their environment, and conditions that will enable them to drive better outcomes for citizens."
        },
        {
            "text": "We are a multidisciplinary team based inside the UK Government’s Policy Profession Unit. Our team is made up of a service designer, a user researcher, a delivery and research ops manager, and a policy adviser."
        },
        {
            "heading": 2,
            "text": "What we mean by policymaking environments"
        },
        {
            "text": "By policymaking environment, we mean the way policymakers are supported and go about doing their work and the contextual factors that impact this. For example:"
        },
        {
            "text": "Previous research has found that the environment in which policymakers operate impacts their ability to make policy well. For instance, having access to analysts and subject matter experts can improve or limit the quality of data and evidence used in policymaking."
        },
        {
            "heading": 2,
            "text": "Collaborating across government"
        },
        {
            "text": "Our project aims to take an explorative, iterative, and collaborative approach by partnering directly with departments and conducting open research activities with policymakers from across government. By taking this approach we aim to co-design a model that meets policymakers’ needs and helps them to take an active role in assessing their policymaking environment."
        },
        {
            "text": "Our research approach is made up of 3 components:"
        },
        {
            "heading": 2,
            "text": "How to get involved"
        },
        {
            "text": "We are looking for policymakers from all grades, backgrounds, and policy areas to take part in research and to help us co-design a new model. The project is only open to civil servants, so sign up using your government email address. You can register your interest here."
        }
    ]
}