{
    "url": "https://insidehmcts.blog.gov.uk/2022/06/30/bringing-common-platform-to-more-criminal-courts/",
    "title": "Bringing Common Platform to more criminal courts",
    "authors": [
        "Paula Potter"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Digital services"
    ],
    "pub_date": "2022-06-30T11:00:07+01:00",
    "content": [
        {
            "text": "In my recent blog post in the spring, I updated on how we’ve been working hard to improve and deliver the Common Platform digital case management system."
        },
        {
            "text": "I’m pleased to say we’re now ready to bring Common Platform to more criminal courts."
        },
        {
            "heading": 2,
            "text": "How we got to this point"
        },
        {
            "text": "Before my last post, we’d already delivered a range of upgrades and a full review of the platform to significantly improve system performance, speed and stability. We could then move ahead with introducing the system to criminal courts in Bedfordshire, Cambridgeshire and Hertfordshire."
        },
        {
            "text": "Having completed this phase, we carried out an in-depth review of the implementation process and how well the platform is responding to increased numbers of users and cases. This showed that Common Platform continued to meet all system performance targets, including addressing users’ previous issues with slow processing speeds."
        },
        {
            "heading": 2,
            "text": "Where we are now"
        },
        {
            "text": "Common Platform will now go live in selected criminal courts in the Nottinghamshire, Wiltshire, South Wales and Gwent, Greater Manchester and North Yorkshire in July and August. At the same time, some support and administrative work will move from these courts to our service centres, as has happened in areas where Common Platform is already live."
        },
        {
            "text": "We’re also building short breaks into this phase to minimise operational pressures during peak holiday periods."
        },
        {
            "heading": 2,
            "text": "What’s coming next?"
        },
        {
            "text": "Our incremental approach to developing and improving Common Platform means we’ll put in place more features and functions in the summer and autumn. One significant introduction will be a bespoke tool to make the listing process more efficient and user-friendly."
        },
        {
            "text": "We’re also working with the Crown Prosecution Service to integrate the platform with their case management system, and support improved case progression. This includes:"
        },
        {
            "heading": 2,
            "text": "Working with you"
        },
        {
            "text": "We’ll continue to follow our well-established strategy of engaging and coordinating activity at a local level with our implementation teams of regional stakeholders, which include members of the judiciary, defence professionals and criminal justice partner agencies."
        },
        {
            "text": "We’ll also keep sharing information through our various communications channels about plans for continued development, and introduction of improved features and functions, particularly where this is as a result of user feedback."
        },
        {
            "text": "We’re scheduling more webinars for defence solicitors and barristers – look out for details on how to join by signing up to our email alerts."
        }
    ]
}