{
    "url": "https://teaching.blog.gov.uk/2022/06/30/ensuring-every-student-has-the-opportunity-to-look-after-their-wellbeing/",
    "title": "Ensuring every student has the opportunity to look after their wellbeing",
    "authors": [
        "Lauren Pinney",
        "Rose Scott"
    ],
    "categories": [
        "Pupil wellbeing and behaviour"
    ],
    "pub_date": "2022-06-30T12:01:34+01:00",
    "content": [
        {
            "text": "Lauren Pinney, head of student wellbeing, and Rose Scott, school counsellor, share how they work with secondary students at Hove Park School to embed emotional wellbeing support and ensure every student feels safe, happy and cared for. In January 2020, Hove Park was awarded the Wellbeing Award for Schools.  "
        },
        {
            "text": "At Hove Park, we believe that school is more than just where students come to learn. It’s a place where a community develops and thrives. Whether it’s in the classroom learning, on the sports field competing or on the stage performing - success comes from us all working together and looking after each other."
        },
        {
            "text": "We promote positive mental health in our school community by ensuring everyone has the opportunity to look after and develop their wellbeing – this is the first and most important tier of embedded emotional wellbeing support. Our vision is about identifying the skills, values and attributes that we believe all students should develop during their time with us."
        },
        {
            "heading": 3,
            "text": "Responding to the changing needs of our students"
        },
        {
            "text": "Our vision is to provide a holistic education for all our students which can only be achieved if students feel safe, happy and cared for. Our curriculum supports this through personal, social and health education which is reviewed regularly, and is responsive to the changing needs of our students."
        },
        {
            "text": "Opportunities beyond our curriculum promote active and healthy lifestyles. Where mental health and wellbeing needs are identified for anyone in our community - be it students, staff, parents or carers - our goal is to support access to targeted or specialist support with compassion and without judgement. Celebrating our diversity and committing to kindness supports us all."
        },
        {
            "heading": 3,
            "text": "Making mental health therapies easily accessible for young people"
        },
        {
            "text": "At Hove Park we offer support through our tiered approach to mental health. This is delivered by our skilled pastoral teams and fully integrated counselling service. Our teams work together to support students, parents and teachers across the school in a variety of ways. This might mean working with parents, advising and training teachers on how to support students in the classroom or delivering therapeutic intervention in school. Our dedicated wellbeing team also works with the local schools wellbeing service to facilitate mental health support in school and make onward referrals when needed."
        },
        {
            "text": "We regularly invite parents and carers in to take part in sessions focusing on mental health alongside our curriculum information events to share ideas, tips and resources in short videos presented by the wellbeing team each term."
        },
        {
            "heading": 3,
            "text": "The impact of embedding a wellbeing culture"
        },
        {
            "text": "Having mental health and emotional wellbeing embedded as a priority across the school structure has reduced stigma around mental health, ensured shorter waiting times for counselling and created a team of staff who are supported, skilled and have an increased confidence in offering emotional support to students."
        },
        {
            "text": "We know impact on mental health and wellbeing is often difficult to quantify, but feedback from students and their families is showing us the difference a whole school approach to wellbeing is making. Parents recognise that the school encourages them to speak up about issues impacting their children's feelings, and pupils know that there are many different people who are in a position to listen, and, if need be, help."
        },
        {
            "text": "Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}