{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/06/30/ess-senior-environmental-analyst-b3/",
    "title": "ESS: Senior Environmental Analyst- B3",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-06-30T16:57:26+01:00",
    "content": [
        {
            "text": "Environment Standards Scotland (ESS) has been set up to ensure environmental laws and standards are adhered to in Scotland, replacing the European Union’s scrutiny and enforcement role after Brexit. The remit of ESS covers a broad range of environmental law, including all aspects of environmental protection and harm, particularly in relation to human beings and their enjoyment of the environment."
        },
        {
            "text": "ESS’ role is to scrutinise, investigate and secure improvements in public authorities’ compliance with environmental law, the effectiveness of environmental law, and the way it is being implemented and applied in Scotland."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Job Description"
        },
        {
            "text": "This post sits within the Strategy and Analysis Team at ESS and will report directly to the Principal Scientific Advisor, though will work across both the Science and the Data and Quantitative Analysis teams."
        },
        {
            "text": "The Environmental Analyst will provide advice and expertise to the ESS Executive Team and the Board and undertake research and evaluation activities such as secondary data analysis and reviews of the existing evidence base in Scotland, the rest of the UK, the European Union and beyond."
        },
        {
            "text": "The team is also responsible for the establishment of strong working relationships with stakeholders and partners and the post will be heavily involved in helping to both gather and interpret expert advice, and to promote and explain the role of ESS to establish the organisation as a trusted and effective oversight body in the post-Brexit landscape."
        },
        {
            "text": "This is a key role within the Strategy and Analysis Team. We are seeking an enthusiastic and passionate Senior Environmental Analyst to lead and develop research and scientific evidence projects in ESS. You will work in an interdisciplinary evidence team comprising colleagues with a range of backgrounds including legal, regulation enforcement, statisticians, scientists and policy specialists. You will be responsible for leading and developing high profile projects to collate, synthesise, prioritise and summarise evidence which deliver important insights into environmental compliance and the effectiveness of environmental regulation. You will need to be able to develop research plans, engage senior colleagues and stakeholders, conduct systematic and robust reviews of evidence and clearly communicate key insights to influence the direction of ESS’ work."
        },
        {
            "text": "For more information including the full job description and how to apply, please click here"
        },
        {
            "text": "Apply before 11:55 pm on Sunday 24th July 2022"
        }
    ]
}