{
    "url": "https://companieshouse.blog.gov.uk/2022/06/30/explaining-the-secondary-legislation-for-the-register-of-overseas-entities-part-2/",
    "title": "Explaining the secondary legislation for the Register of Overseas Entities - part 2",
    "authors": [
        "Rachael Watts - Companies House (ROE implementation lead)"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2022-06-30T16:05:29+01:00",
    "content": [
        {
            "text": "Last week, we published a blog post to update you on the progress of the Register of Overseas Entities as the first statutory instrument (SI) was laid in Parliament. This week, we’ve reached another significant milestone as a further two SIs have been laid - The Register of Overseas Entities (Verification and Provision of Information) Regulations 2022 and The Land Registration (Amendment) Rules 2022."
        },
        {
            "text": "Under the new Economic Crime (Transparency and Enforcement) Act, a new Register of Overseas Entities is being created and will be held by Companies House. This new register forms part of the government’s strategy to combat economic crime, while making sure that legitimate businesses continue to see the UK as a great place to invest."
        },
        {
            "text": "The new register will require overseas entities that own UK land or property to declare their beneficial owners and/or managing officers. There will be severe sanctions for those who do not comply, including restrictions on buying, selling, transferring, leasing or charging their land or property in the UK."
        },
        {
            "text": "We expect the commencement order to be laid on 1 August, and our intention is that the register will come into effect on the same date."
        },
        {
            "heading": 2,
            "text": "Secondary legislation"
        },
        {
            "text": "SIs are a form of legislation which provide the practical measures needed for the Act to come into force. They’re often referred to as secondary legislation."
        },
        {
            "text": "This week’s SIs cover the following topics:"
        },
        {
            "heading": 2,
            "text": "Verification"
        },
        {
            "text": "Before an overseas entity registers its beneficial owners or managing officers on the new Register of Overseas Entities, a UK-supervised ‘relevant person’ will need to verify the required information about them - as set out in the Act."
        },
        {
            "text": "These verification checks must be carried out by a UK-based agent that’s supervised under the Money Laundering, Terrorist Financing and Transfer of Funds Regulations 2017 (the MLRs)."
        },
        {
            "text": "These supervised agents, as defined by the MLRs, are:"
        },
        {
            "text": "It’ll be quicker and easier for the supervised agent to register on the overseas entity’s behalf, as well as verifying the required information about their beneficial owners or managing officers. The registration may take longer to process if the overseas entity completes the registration themselves."
        },
        {
            "text": "Supervised agents will need to contact Companies House to get an assurance code before they can verify or file on the overseas entity’s behalf. The assurance code is the equivalent of a signature. We'll share more information on how to get your assurance code very soon."
        },
        {
            "text": "Details about the person who verified the required information about the beneficial owner or managing officer, including their name and the name of their company, will be on the public register. The person verifying the required information about the beneficial owner or managing officer cannot be a family member or a known close associate of the individual, and they cannot verify information about themselves."
        },
        {
            "heading": 2,
            "text": "Provision of information during the transitional period"
        },
        {
            "text": "This part of the SI relates to those overseas entities who have made a ‘relevant disposition of land’ on or after 28 February 2022 – the date the Economic Crime (Transparency and Enforcement) Bill was published. These overseas entities must still register details on the Register of Overseas Entities about their beneficial owners or managing officers at the time of the disposition(s), as well as details about the disposition(s), such as the title number(s) of the land interests. This information will be publicly available for at least 2 years."
        },
        {
            "heading": 2,
            "text": "Changes to HMLR forms"
        },
        {
            "text": "To implement aspects of the new Register of Overseas Entities, this SI makes the amendments to the Land Registration Rules 2003 (S.I. 2003/1417) (‘the 2003 Rules’) necessary to implement the new requirements for applications to register an overseas entity as proprietor of an estate in land or where an application includes some types of disposition made by an overseas entity."
        },
        {
            "text": "The 2003 Rules make detailed provision for keeping the register and for making applications to change the register or create new entries in it. This includes specifying forms for making applications and certain types of disposition (for example, transfers, leases and charges)."
        },
        {
            "text": "This SI is one of several instruments to implement the Register, by:"
        },
        {
            "text": "HM Land Registry will be issuing separate practice guidance which will explain the land registration requirements to register an overseas entity as proprietor of an estate in land or for an application that includes some types of disposition made by an overseas entity."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We’ll shortly be writing to the supervisory bodies to explain how the pre-registration process will work in more detail, and we’ll also publish guidance on GOV.UK within the coming weeks."
        },
        {
            "text": "We’re continuing to work at an incredible pace in conjunction with BEIS and key stakeholders, and we’re proud to be playing such a pivotal role in tackling global economic crime."
        }
    ]
}