{
    "url": "https://forestrycommission.blog.gov.uk/2022/06/30/new-trees-and-peat-guidance-helping-to-inform-where-to-establish-trees-and-where-to-restore-peat/",
    "title": "New trees and peat guidance: helping to inform where to establish trees, and where to restore peat",
    "authors": [
        "Neil Riddle"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-06-30T09:30:14+01:00",
    "content": [
        {
            "text": "Ambitious targets have been set for forest expansion and peat restoration across England supported by the Nature for Climate Fund. This requires effective operational alignment on how these targets are delivered to avoid possible tensions between achievement of targets for woodland creation, nature recovery, and tackling climate change."
        },
        {
            "text": "Forestry Commission has been working with Natural England to produce a decision framework tool and guidance that sets out how the United Kingdom Forestry Standard (UKFS) will be implemented in England for trees and peatland."
        },
        {
            "text": "In June last year we published a decision support framework for peatland protection and the establishment of new woodland.  The interim guidance was developed by Forestry Commission (FC), working closely with Natural England (NE), Forest Research (FR) and Forestry England, to provide an agreed evidence-based decision support framework to guide both landowners and NE/FC regulators on where to establish trees and where to restore peat. A key update being made now is the addition of a decision-making framework on whether to restock woodlands on peat."
        },
        {
            "text": "Mark Owen, Natural England's Principal Adviser Upland Management, led Natural England’s contribution to developing the guidance. Mark said:"
        },
        {
            "text": "Alongside the updated guidance, a new forest-to-bog restoration metric is being launched for a period of user testing. The metric uses environmental data to predict the restorability of peat under forest to help landowners and other decision makers consider the most desirable land use. The metric will be used in beta format for user testing and feedback before release of the full, finalised metric in June 2023."
        },
        {
            "text": "Read the new guidance."
        }
    ]
}