{
    "url": "https://videosurveillance.blog.gov.uk/2022/06/30/survey-launched-on-police-use-of-surveillance-camera-systems/",
    "title": "Survey launched on police use of surveillance camera systems",
    "authors": [
        "frasersampson"
    ],
    "categories": [
        "ANPR",
        "Biometrics and Surveillance Camera Commissioner",
        "Body worn video",
        "CCTV",
        "Drones",
        "Ethics",
        "Facial Recognition Technology",
        "Partnerships",
        "Policing",
        "Surveillance camera code of practice",
        "Uncategorized"
    ],
    "pub_date": "2022-06-30T21:24:20+01:00",
    "content": [
        {
            "text": "The survey covers all facial recognition enabled systems, drone mounted camera systems, helicopters or aeroplane mounted systems, Body Worn Video (cameras on police uniforms), ANPR (automated number plate recognition) systems and any other surveillance camera systems in public places that fall within the definition of section 29(6) of the Protection of Freedoms Act 2012."
        },
        {
            "text": "The survey asks about the capabilities of systems, whether they use equipment from non-UK suppliers about which there have been ethical or security concerns, what due diligence they have undertaken to ensure they are working with trusted partners, and how their systems comply with the Home Secretary’s Surveillance Camera Code which they have a legal duty to observe."
        },
        {
            "text": "About facial recognition in particular, the survey asks forces whether they currently use facial recognition technology and, if so, whether it’s live (real-time) or retrospective, and whether it is initiated by officers using cameras on their mobile phones or some other kind of system.  If none is currently in use, the survey asks whether the force intends to start using facial recognition technology in the future."
        },
        {
            "text": "There is little doubt that the police use of surveillance camera systems in the public sphere has been increasing in recent years. This survey will provide an important snapshot of what kinds of overt surveillance camera systems police are using, what they are being used for, and the extent to which facial recognition technology is now being used. It should also tell us whether police forces are complying with the new Surveillance Camera Code as they should be. It will be very interesting to see how much things have changed since similar surveys were conducted in 2017 and 2019 by my predecessor in the role of Surveillance Camera Commissioner."
        },
        {
            "text": "The government’s revised Surveillance Camera Code of Practice came into force in January this year and emphasises the importance of the legitimate use of technology ‘to a standard that maintains public trust and confidence’."
        }
    ]
}