{
    "url": "https://deframedia.blog.gov.uk/2022/06/30/uk-escalates-support-for-global-marine-environment-at-un-ocean-conference/",
    "title": "UK escalates support for global marine environment at UN Ocean Conference",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-06-30T12:04:19+01:00",
    "content": [
        {
            "text": "New initiatives announced by the UK Government at the UN Ocean Conference this week to progress our mission to protect at least 30% of the global ocean by 2030 have received coverage in outlets including the Independent, Evening Standard and Business Green."
        },
        {
            "text": "The government’s ambitious £500 million Blue Planet Fund is already supporting developing countries and vulnerable coastal communities around the world adapt to climate change and build sustainable, prosperous coastal economies."
        },
        {
            "text": "In the latest instalment of the Fund, we announced a record £150 million will be invested in a new global programme, known as COAST, to protect and restore valuable coastal and marine habitats such as corals, mangroves and seagrasses, improve the sustainability and productivity of small-scale fisheries, and help developing countries unlock aquaculture’s potential."
        },
        {
            "text": "Up to £100 million of Blue Planet funding will also be used to support the implementation, management and enforcement of Marine Protected Areas, which are created to limit potentially damaging activity at sea and support the recovery of key habitats and marine species, and other effective conservation measures in developing countries."
        },
        {
            "text": "Lord Zac Goldsmith, Minister for Pacific and International Environment, said:"
        },
        {
            "text": "The UK government, with Canada and the US, also this week launched a world-first global alliance to tackle illegal, unregulated and unreported (IUU) fishing which poses a threat to ocean ecosystems, coastal communities and global fish stocks by undermining fisheries management and distorting trade."
        },
        {
            "text": "These announcements sit alongside continued support and funding for programmes under the Blue Planet Fund."
        }
    ]
}