{
    "url": "https://prisonjobs.blog.gov.uk/2023/03/02/advice-from-those-in-the-prison-service/",
    "title": "Advice from those in the Prison Service",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Recruitment advice",
        "Ways of working"
    ],
    "pub_date": "2023-03-02T14:08:19+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Thinking about joining the Prison Service but want some advice on what it’s like working in a prison? We’ve brought together some advice from people who work in a range of roles on how to work effectively with offenders."
        },
        {
            "heading": 3,
            "text": "Read on to find out top tips from those working in the Prison Service."
        },
        {
            "text": " "
        },
        {
            "text": "Remember to be yourself. Anyone who’s gotten to the stage of working in the Prison Service has something they can offer to provide support to offenders. If you feel your personal interests or hobbies can bring certain qualities into the role, spot opportunities to use them."
        },
        {
            "text": " "
        },
        {
            "text": "Treat the people you work with as individuals, and how you’d want to be treated yourself. Whatever mistakes they have made in life, we are here to help them turn their lives around. It’s our job to treat people with decency and respect, and to motivate them to want to learn new skills to prepare for their release. You should do everything you can to support them in the hope that once they leave custody, they will turn their back on crime for good."
        },
        {
            "text": " "
        },
        {
            "text": "Be a role-model to those around you. You may never know the effect you've had on a person, but always be a role-model in the same way you would to your own family."
        },
        {
            "text": " "
        },
        {
            "text": "Genuinely interact with others. Offenders are often in a really difficult place, and you may have difficult conversations with someone who might not even want you there. So, try to steer away from superficial conversations and be genuine when asking someone \"are you alright?\"."
        },
        {
            "text": " "
        },
        {
            "text": "Observe more experienced staff, take their ideas, and turn them into your own. You don’t know the ins and outs of the job from your first day and learning from other experienced staff can really help."
        },
        {
            "text": " "
        }
    ]
}