{
    "url": "https://educationhub.blog.gov.uk/2023/03/children-with-send-claire-coutinho-minister-children-wellbeing-families/",
    "title": "Message to parents of children with SEND from Claire Coutinho MP, Minister for Children, Wellbeing and Families",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2023-03-02T13:00:49+00:00",
    "content": [
        {
            "text": "Parents know that their children only get one shot at education. However for some parents of children with Special Educational Needs and disabilities (SEND), getting their child that superb education that every child deserves can feel like a full-time job."
        },
        {
            "text": "Some schools, councils and colleges are brilliant. I’ve met many wonderful teachers who are unbelievably passionate about inclusivity. The outcomes they achieve are clear: happier children who are more confident at school and better prepared for adulthood. But too often, this isn’t the case."
        },
        {
            "text": "I have heard from parents who have been chasing their council for months to get the right support, or battling to get reasonable adjustments made at school. Some can weigh the paperwork relating to their child’s needs by the kilo. The consequence is children and families who are exhausted, frustrated and at worst in distress because they cannot the help they need."
        },
        {
            "text": "The SEND and Alternative Provision (AP) Improvement Plan that we are publishing today is our chance to change this. We will develop new national standards, covering early years, schools, colleges and alternative provision, so that parents and teachers know what should be ordinarily available. We will set out best practice guides based on the strongest evidence starting with early speech and language development, autism and mental health and wellbeing. This will give families confidence on what they can expect and teachers clarity on how to identify and support diverse students."
        },
        {
            "text": "We will couple this with improved teacher training, including training thousands more early years SEN co-ordinators to identify children who need support as soon as possible. We will also be working with health professionals on a joint workforce plan and training 400 more educational psychologists to reduce the wait times for specialist support. We will also look at how we can strengthen the skills and training of local SEND casework teams, and will include guidance on SEND casework services to improve communication with families."
        },
        {
            "text": "And we’ll hold all parts of the system – including councils, health and education partners – accountable for this."
        },
        {
            "text": "Lastly, we want families to spend time with their children, not on pointless bureaucracy, so we are streamlining education, health and care plans and bringing them online so that the process is easier and quicker for families."
        },
        {
            "text": "We know we need funding to deliver this. This is why by next year we’ll have upped the additional ‘high needs’ budget to over £10 billion, which is an increase of more than 50 per cent since 2019. We are spending £2.6 billion between 2022 and 2025 to increase specialist school places across the country on top of the £2 billion funding boost we’re giving to schools in each of the next two years, taking it to real-term historic highs which will help support children with SEND in mainstream and special schools."
        },
        {
            "text": "We’re also confirming that 33 areas of the country from Devon to Darlington have been approved for new special free schools."
        },
        {
            "text": "We owe it to children and their families to make sure their one shot at education is the very best it can be."
        },
        {
            "text": "The Rt Hon Claire Coutinho MP\nMinister for Children, Wellbeing and Families"
        }
    ]
}