{
    "url": "https://deframedia.blog.gov.uk/2023/03/02/coverage-on-vaccination-of-poultry-to-prevent-avian-influenza/",
    "title": "Coverage on vaccination of poultry to prevent avian influenza",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-03-02T15:17:45+00:00",
    "content": [
        {
            "text": "There has been coverage on i news today on the possibility for mass vaccination of poultry to prevent avian influenza spreading between humans."
        },
        {
            "text": "Their reporting states that government officials and scientists are looking at overturning a ban on vaccinating tens of millions of birds as the H5N1 avian influenza outbreak continues. Although we are exploring potential for use of vaccination as a preventive measure, we are not at the point of changing any policy and the use of avian influenza vaccines in poultry and other captive birds is unlikely be a viable option for the 2023/24 high risk season."
        },
        {
            "text": "Further evidence is needed on vaccine effectiveness. We need a better understanding of how far vaccines can prevent infection, rather than just reducing mortality, given the risk of vaccinated birds without clinical signs, spreading the virus undetected. This would increase the time taken to detect and eradicate the virus and some trading partners may not accept the use of vaccination when considering trade in poultry or poultry products. In addition, there are a number of practical, animal welfare and commercial disadvantages relating to the use of currently available vaccines which would present significant logistical and cost challenges to industry."
        },
        {
            "text": "Defra in conjunction with the Veterinary Medicines Directorate (VMD) will continue to monitor the development and availability of vaccines for their utility in preventing and responding to avian influenza outbreaks as they are put forward for market authorisation by vaccine manufacturers. Any future decisions on disease control measures, including the use of emergency or preventive vaccination, will be based upon the latest scientific, ornithological, and veterinary advice."
        },
        {
            "text": "We have established a cross government and poultry industry task force to explore potential for use of vaccination as a preventive measure. The group will meet on a regular basis."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“The vaccination of poultry and captive birds against avian influenza, excluding those in licensed zoos in England, is not currently permitted. We recommend strict biosecurity measures to prevent transmission of the disease."
        },
        {
            "text": "“At present, while authorised vaccines are available in the UK, they are unlikely to provide full protection for the current strains of the virus - it is likely that some vaccinated birds would still be capable of transmitting avian influenza if they became infected."
        },
        {
            "text": "“We continue to invest in avian influenza research and the development of efficacious vaccines aimed at tackling the virus”."
        },
        {
            "text": "The UK has some of the toughest biosecurity measures in the world, and we have taken swift action to protect flocks from the threat of avian influenza. All poultry and captive birds must be housed in England until further notice. Bird keepers are required to house their birds indoors and implement strict biosecurity measures to help protect their flocks from the threat of avian influenza, regardless of whatever type or size. Introducing these steps on farm is the most effective way in reducing the risk of disease spreading."
        },
        {
            "text": "The UK Health Security Agency (UKHSA) advises there is no increased risk to the general public from bird flu and that the avian influenza viruses do not spread easily to people."
        },
        {
            "text": "You can read Defra’s policy on the use of avian influenza vaccines in poultry and other captive birds together with sector-specific guidance for zoos and other collections with a current zoo licence on how to apply for authorisation to vaccinate against avian influenza."
        }
    ]
}