{
    "url": "https://civilservice.blog.gov.uk/2023/03/02/creating-our-countrys-collective-brain/",
    "title": "Creating our Country’s Collective Brain",
    "authors": [
        "Catherine Day"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-03-02T13:58:16+00:00",
    "content": [
        {
            "text": "Frontline Civil Servant Catherine Day explains why the Royal College of Defence Studies’ Global Strategy Programme is an invaluable experience for anyone who aspires to lead."
        },
        {
            "text": "My 25-year career has involved working on some of the UK’s biggest security challenges. I’ve set up new ways to prevent conflict; advised Prime Ministers; and worked on the frontlines in Iraq and Afghanistan. Far too often, this has felt like a decades-long lesson in managing intractable conflicts. The time I’m spending at the Royal College of Defence Studies (RCDS) is a welcome opportunity to turn this around. "
        },
        {
            "heading": 4,
            "text": "Building Strategy Muscle"
        },
        {
            "text": "Every September, civil servants, military officers, parliamentarians and businesspeople from around the world join RCDS’ purpose-designed Global Strategy Programme. They share a single aim: to equip our generation to leave a better legacy. The year-long programme is academic and practical; intense and fun. Above all, it is designed to give our nations the strategy muscle they need to thrive in our ever-more complex world. This year, 120 of us are taking part from 47 different countries. For each of us, the programme is a personal and intellectual journey as much as a professional one. And it’s one of our public sector’s hidden gems."
        },
        {
            "heading": 4,
            "text": "A Personal and Professional Journey"
        },
        {
            "text": "The cliche holds true: that you get out of this course what you put in. But in the case of this programme, you also get out of it what others put in. Four months in, we have discussed the strategic issues of our time with tens of experts. We understand better the trends that will shape our future, from demographics, globalisation and technology to food and water security. We have shared experiences and developed our thinking in seminars and strategic assessments. We have explored and examined our own country, its strengths and fissures. We have probed some of the leaders responsible for shaping the world of which we’re now the stewards. We have tested our own abilities and leadership through a range of strategic exercises and case studies. "
        },
        {
            "text": "The diversity of colleagues’ backgrounds enriches the experience. In particular, our Ukrainian colleagues’ intense, traumatic experiences have given them decades’ worth of wisdom from which we can all benefit. And the whole course is ably supported by King’s College London, which gives us ready access to good scholarship."
        },
        {
            "text": "Already, each of us has a far more detailed grasp of the foundations and realities on which our countries’ various ambitions are based. Each of us understands the strategic opportunities and challenges that face our generation. And we are each engaged in the detail of what will be required to meet them."
        },
        {
            "heading": 4,
            "text": "Personal Highlights"
        },
        {
            "text": "My personal highlights so far have been:"
        },
        {
            "heading": 4,
            "text": "A Critical Mission"
        },
        {
            "text": "RCDS has been on a journey. It started in 1927 as the Imperial Defence College. Its mission was to cultivate the “common brain” that would help to avoid a repeat of the First World War. Now, it is adapting to a future in which ‘defence’ and ‘security’ mean something completely different. This means, they’re as much about securing the economy and protecting people’s health and way of life as they are about defending territory. In which our security at home is entwined with our security abroad. In which our collective future can only be secured by collective endeavour - across nations, borders, sectors and peoples. Governments around the globe must urgently adapt institutions that were invented for an earlier era to a more complex, dynamic future. "
        },
        {
            "text": "Today’s mission is to train the people from across all parts of government who will lead this transformation. This has never been harder or more crucial. If you have ever thought of doing this course - or never thought of it until now - then do it! Our world needs more strategic leaders."
        }
    ]
}