{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/03/02/cyber-in-the-armed-forces-defence-cyber-marvel-2/",
    "title": "Cyber in the Armed Forces | Defence Cyber Marvel 2",
    "authors": [
        "calumjenkins"
    ],
    "categories": [
        "Cyber",
        "Personnel",
        "Technology",
        "Training"
    ],
    "pub_date": "2023-03-02T12:38:15+00:00",
    "content": [
        {
            "text": "This month UK Defence hosted Western Europe’s largest cyber warfare exercise, Defence Cyber Marvel 2 (DCM2). With over 30 teams, comprised of personnel from Defence, government agencies, industry partners as well as other nations, the exercise saw more than 700 cyber specialists descend on Tallinn to test their response to both common and complex cyber threats."
        },
        {
            "text": "Run by volunteers, and inclusive to all Service personnel, the focus of the DCM2 is as much on the development of individual’s cyberspace knowledge and skills as it is on talent identification and recognition. As the leads for the cyber and electromagnetic domain, we’re committed to finding and nurturing individuals with these skills, and this is one of the many reasons why DCM2 is such an important event in the calendar."
        },
        {
            "text": "With the second year of the competition now in the books, we spoke with one of the event organisers to shed a little more light on this unique event:"
        },
        {
            "text": "Despite DCM2 being an annual competition, it is ultimately a training exercise, allowing personnel from across the Armed Forces and partner nations to build their skills within the cyber and electromagnetic domain. Putting these teams into the fast-paced and high-tempo environment of the CyEM domain helps develop their capabilities for Defence in the 21st century."
        },
        {
            "text": "Organised by the Army Cyber Association, the inaugural event took place at Defence Battle Labs, Dorset, last year. Explaining the origins of the exercises, and how it came to be in the first place, we were told:"
        },
        {
            "text": "DCM has certainly come a long way since it was first thought up as an idea. Not only was this year’s event held overseas, taking place in Tallinn, Estonia, but it also had over 700 people taking part. And, with participants from Japan, Singapore, Kenya and Oman, the exercise is the perfect place for sharing ideas and best practices between nations."
        },
        {
            "text": "When asked how this year differs from last year’s event, the organiser explained:"
        },
        {
            "text": "Now, you would be forgiven for thinking the opportunities presented by an exercise titled ‘Defence Cyber Marvel’ were all cyber related."
        },
        {
            "text": "While the competition creates an environment where personnel from allied nations can share ideas and techniques used in the Cyber and Electromagnetic domain, it also judges participating teams on the effectiveness and speed of their response and how quickly they identify and adapt to new threats in fast-paced and demanding arena."
        },
        {
            "text": "However, the benefits of DCM2 are not exclusive to the cyber and electromagnetic domain:"
        },
        {
            "text": " With DCM2 now over, attention will begin to turn towards Defence Cyber Marvel 3. We can only hazard guesses at what lies in store for next year’s participants however, what we do know for certain, is that DCM3, like those before it, will challenge the skills that UK Defence, and our allies, have in the Cyber and Electromagnetic Domain."
        }
    ]
}