{
    "url": "https://dragonsden.blog.gov.uk/2023/03/02/dragons-den-series-20-episode-9/",
    "title": "Dragons Den, Series 20 Episode 9",
    "authors": [
        "Kristian Crowshaw"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Patents"
    ],
    "pub_date": "2023-03-02T21:05:40+00:00",
    "content": [
        {
            "text": "From motorcycle clothing to matcha drinks, there was a range of products to whet everyone's appetite in this week’s Dragons' Den episode!"
        },
        {
            "text": "First up were motorbike loving brothers Damien and Sebastian Harris, with their motorbike clothing company, Bobhead. The brothers believe they have found a niche in the market, claiming the bigger brands have lost touch with the new-age biker, who is looking for style and quality at an affordable price."
        },
        {
            "text": "The brothers were asking for £50k for a 10% equity stake and were hoping the Dragons would breathe fire on their petrol-infused passion."
        },
        {
            "text": "After Deborah Meaden finished trialling the motorbikes on display, it was Steven Bartlett who started the questions. He was impressed by the number of followers, engagement and community the brothers had created on their social media channels."
        },
        {
            "heading": 2,
            "text": "Wheely impressive designs"
        },
        {
            "text": "Deborah was also really impressed by the style of the clothes and was surprised to find out that the brothers created their designs without any design background. After a quick search on the IPO’s ‘find a registered design’ page, it appears the brothers have not registered their designs. This is something they could consider doing to add further value to their business and prevent copycats replicating their creations."
        },
        {
            "text": "Unregistered designs are automatic and protect the shape and configuration of your product for either 10 years after it was first sold or 15 years after being created. They also protect the physical appearance of your product for three years from when you go public with your design. There isn’t a register for these rights, however. You can prove your design protection by registering your designs or you can ask a solicitor to keep certified copies of your unregistered design as a record."
        },
        {
            "text": "Despite an impressive pitch, Deborah thought she would be likely to introduce obstacles than assistance for the brothers (due to issues around the provenance of the leather) and declared herself out. This decision was shortly followed by Steven and Sara Davies, leaving just Touker Suleyman and Peter Jones to battle it out."
        },
        {
            "text": "Peter saw an opportunity to build on the brand and offered half of the money (£25k) in return for 15% of the business, as he thought it needed a lot of work. Touker matched this offer and after the brothers had a short discussion with the wall, the offer was accepted."
        },
        {
            "heading": 2,
            "text": "Things don’t measure up"
        },
        {
            "text": "Next into the Den were Steve Capon and Mark Sheahan.  Steve created the product ‘Matey Measure’ and was looking for £80k for 10% of the business."
        },
        {
            "text": "As someone who regularly uses DIY equipment, I have a new-found appreciation for any tools which can make the task as quick, accurate and pain-free as possible. So, when I saw the Matey Measure, which helps make tape measures accurate on corners, I was already sold on the idea!"
        },
        {
            "text": "The same however couldn’t be said for Touker, who questioned the value of the company at £800k with the turnover just 10% of that. Mark explained that they spent £26k on patenting their product for the future, which is where the valuation mainly stems from."
        },
        {
            "heading": 2,
            "text": "Adding value to your business"
        },
        {
            "text": "Intellectual property can add a huge amount of value to a company and can be considered as one of your business assets, as confirmed by Deborah:"
        },
        {
            "text": "Mark agreed with Deborah and explained that their invention is patent pending, which is the term used to describe a patent application that has been filed, but not yet been granted."
        },
        {
            "text": "If you have a patent pending, you can add ‘UK patent pending’ or ‘UK patent applied for’ on the invention itself, or on your packaging or marketing materials. You are also encouraged to show the application number or give a web address where details of your invention and patent application number are clearly displayed."
        },
        {
            "text": "Although the inventor doesn’t have full legal rights until the patent is granted, the term patent pending makes people aware of the inventor’s intention to protect the idea. It also serves as a warning to competitors and copycats that if they were to copy the invention, they could be liable for infringement if the patent is granted."
        },
        {
            "text": "Despite the patent pending, this wasn’t enough to sway Touker to invest and he was first to declare himself out. He was followed shortly by the rest of the Dragons who didn’t see this as an investment opportunity, but loved the idea nonetheless."
        },
        {
            "text": "Congratulations to all of tonight’s entrepreneurs, especially those who secured investment. We wish you all luck."
        }
    ]
}