{
    "url": "https://traderemedies.blog.gov.uk/2023/03/02/economics-in-action-what-being-an-economic-analyst-intern-at-the-tra-entails/",
    "title": "Economics in action: what being an Economic Analyst Intern at the TRA entails",
    "authors": [
        "Olivia Vail, Economic Analyst Intern",
        "Rahil Patel, Economic Analyst Intern",
        "Lucas Gibbard, Economist Analyst Intern"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-03-02T14:38:47+00:00",
    "content": [
        {
            "text": "Last summer, the TRA’s analyst team had the pleasure of being joined by three summer interns. We’ll be recruiting again for these positions soon so keep an eye on our website and on our social media."
        },
        {
            "text": "Here’s a little bit about what the role entails from Olivia, Rahil and Lucas – last year’s TRA Economic Analyst Interns."
        },
        {
            "heading": 3,
            "text": "Olivia"
        },
        {
            "text": "It has been a great summer seeing ‘real world’ economics in action. The best part of joining the TRA is getting to use the economics I studied at undergraduate level in a practical setting. Price elasticities, tariff and quota diagrams, consumer surplus - it’s all been put to good use!"
        },
        {
            "text": "As an intern Economic Analyst, I have been assigned to a case team. This is where the trade remedies investigations happen. We investigate cases of import dumping and export subsidies from foreign countries into the UK market. The products we investigate can range from ironing boards to different types of steel. One of the best things about being on case teams is the chance to work with lawyers, policy advisors and investigators as well as other analysts. The team comes together to produce a final report with the TRA’s recommendation."
        },
        {
            "text": "The analysts at the TRA work on Economic Interest Tests for the case team. Here we decide whether the particular trade practice being investigated is truly in the economic interest for the UK as a whole. I have been working on the Heavy Plate Steel case this summer. When part of the European Union, we had a measure in place against Heavy Plate imports from China. Now we are evaluating, using all the evidence available, whether we should keep this measure in place. This means considering the interests of UK producers, downstream businesses and upstream businesses."
        },
        {
            "text": "Outside of cases, I’ve worked with the other interns to deliver an inflation update presentation to TRA staff. I’ve also had plenty of opportunity to massively improve my Excel skills! I loved listening to the various guest speakers invited to present to the TRA - we had a particularly informative talk from an LSE professor. This internship has proved to be a highly enjoyable experience!"
        },
        {
            "text": "You can also read my co-authored blog on the Economic Interest Test here."
        },
        {
            "heading": 3,
            "text": "Rahil"
        },
        {
            "text": "My internship at the TRA has been fulfilling."
        },
        {
            "text": "An important aspect of the job is hybrid working, and I mainly work from home. I come into the office on Thursdays for an opportunity to catch up with all my workmates in person, but I also like the quiet and comfort of home where I can be productive, especially when it comes to tasks that require me to focus."
        },
        {
            "text": "Most of my work is designated from my line manager who has always been supportive and makes sure that my workload is manageable. My work mainly consists of research tasks, whether that be for a new investigation being published or for part of a presentation. This research work is varied, covering topics such as inflation, employment, import sales and key materials for relevant goods. There is always something that can appeal to you when working here. My timetable also has at least one meeting each day, with some weeks including seminars from staff in other departments. I also like to reach out to senior co-workers about any projects I can work on when my workload is light; this allows me to socialise with team members I spend less time with, as well as develop my skills further."
        },
        {
            "heading": 3,
            "text": "Lucas"
        },
        {
            "text": "My day spent in Port Talbot for a verification visit to a steel producer showcased all the best bits about my summer internship at the TRA."
        },
        {
            "text": "I was part of a multi-disciplinary team including accountants and investigators. The objective of our visit was to verify key pieces of information that would enable us to build an accurate picture of the industry and therefore evaluate whether measures would be in the economic interests of the UK."
        },
        {
            "text": "To prepare for the day, I had been working with other analysts to identify what pieces of evidence we were going to rely on in our analysis and had formulated questions that we wanted to ask the management team. This used some of the economic theory I had learnt at university but doing it in a real-world context was a great way to practise my spreadsheet and application skills."
        },
        {
            "text": "The day itself began with a tour of the plant which was really useful in order to understand how integrated production processes can be and therefore how complex the impact of measures might be. It was valuable to see how the real-world production processes diverge from the simple assumptions of the textbook! We then met with finance managers, and I had the opportunity to ask questions about evidence they had submitted."
        },
        {
            "text": "All this data will be analysed and inform conclusions of the review. To see the start of the analytical process in a such tangible way was a very valuable experience."
        },
        {
            "text": "Find out more about working for the Trade Remedies Authority."
        }
    ]
}