{
    "url": "https://defrafarming.blog.gov.uk/2023/03/02/grants-available-in-2023/",
    "title": "Grants available in 2023",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments for research and innovation",
        "Payments to improve animal health and welfare",
        "Payments to improve tree health"
    ],
    "pub_date": "2023-03-02T13:32:37+00:00",
    "content": [
        {
            "text": "In 2023, more than £168m of funding will be available through a variety of grants.  "
        },
        {
            "text": "We’ve shared quite a few blog posts on grants recently. To make it easier for you to see what’s available and plan, we’ll give you a roundup of all the grants on offer in 2023 in this post. "
        },
        {
            "text": "Under each grant, we’ll share a short summary of: "
        },
        {
            "heading": 2,
            "text": "Grants available at time of publication "
        },
        {
            "heading": 3,
            "text": "Grants to start a research project "
        },
        {
            "text": "What it is and who it’s for "
        },
        {
            "text": "Through the Research Starter Competition, farmers, growers and forestry businesses based in England can apply for a grant to improve productivity, sustainability, resilience and move the agricultural sector to net zero.   "
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "At the full application stage, your project’s total costs must be between £28,000 and £56,000. "
        },
        {
            "text": "Dates "
        },
        {
            "text": "The third round of this competition will close Wednesday 8 March 2023 at 11:00am."
        },
        {
            "text": "Fund "
        },
        {
            "text": "The Research Starter Competition is part of the Farming Innovation Programme. "
        },
        {
            "text": "Learn more "
        },
        {
            "text": "Read the official guidance and apply for the Farming Innovation Programme: Research Starter (Round 3)."
        },
        {
            "text": "Read our blog post on the Research Starter Competition."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Grants for automation and robotics   "
        },
        {
            "text": "What it is and who it’s for "
        },
        {
            "text": "Through the Farming Futures R&D Fund competition, UK registered businesses can apply for grants under the following strands:"
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "Collaborative industry-led research projects offer grants for project costs between £500,000 and £1 million over 36-48 months "
        },
        {
            "text": "Collaborative, experimental development projects offer grants for project costs between £750,000-£1.5 million over 24-36 months "
        },
        {
            "text": "Dates "
        },
        {
            "text": "Available until 15 March 2023.   "
        },
        {
            "text": "Fund "
        },
        {
            "text": "The Farming Futures R&D Fund competition is part of the Farming Innovation Programme. "
        },
        {
            "text": "Learn more  "
        },
        {
            "text": "Read the official guidance on Collaborative industry-led research projects and apply. "
        },
        {
            "text": "Read the official guidance on collaborative, experimental development projectsand apply. "
        },
        {
            "text": "Read our blog posts on the Farming Futures R&D competition."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Grants for research and development to develop a new technology or service "
        },
        {
            "text": "What it is and who it’s for "
        },
        {
            "text": "The Large R&D Partnerships competition offers funding for Industrial Research and Experimental Development projects. These range from those that will accelerate the development and demonstration of new agricultural solutions, to those that can be integrated into existing agricultural practices.   "
        },
        {
            "text": "They should help address major challenges and opportunities on-farm, or those immediately post farmgate.   "
        },
        {
            "text": "Your project must address a significant industry challenge or opportunity in at least one of the areas below:      "
        },
        {
            "text": "Your solutions or project outputs must also significantly improve:  "
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "You can get between £3 million and £5 million. Businesses will be expected to provide match funding for the projects.  "
        },
        {
            "text": "Dates "
        },
        {
            "text": "The competition closes on 19 April 2023. "
        },
        {
            "text": "Fund "
        },
        {
            "text": "The large R&D partnerships projects competition is part of the Industry-led R&D Partnerships Fund, which is part of the Farming Innovation Programme. "
        },
        {
            "text": "Learn more "
        },
        {
            "text": "Read the official guidance on the large R&D partnership projects competition and apply. "
        },
        {
            "text": "Read our posts on the Farming Innovation Programme. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Grants for equipment to support productivity and slurry management "
        },
        {
            "text": "What it is and who it’s for "
        },
        {
            "text": "Productivity and slurry grants are available through the Farming Equipment and Technology Fund. "
        },
        {
            "text": "With farmers and other experts, we’ve compiled a list of items which will help improve agricultural sustainability and productivity in horticulture and forestry.  These will help farmers use less inputs, reduce emissions and cut waste. "
        },
        {
            "text": "You can apply for a grant if your business is in England and you’re a: "
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "The minimum grant amount is £1,000. The maximum is £25,000. We’ve reduced the minimum grant after receiving feedback that a lower level allows more farmers to benefit. "
        },
        {
            "text": "Dates "
        },
        {
            "text": "The Productivity and Slurry grant is available now until 4 April 2023. "
        },
        {
            "text": "Fund "
        },
        {
            "text": "This grant is offered through the Farming Equipment and Technology Fund, which in turn, is part of the Farming Investment Fund. "
        },
        {
            "text": "Learn more"
        },
        {
            "text": "Read the official guidance  for productivity and slurry grants  and apply for a grant through the portal."
        },
        {
            "text": "Read our most recent post on the on the productivity and slurry grants."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Grants to support tree health "
        },
        {
            "text": "What it is and who it’s for "
        },
        {
            "text": "The tree health pilot tests different ways of slowing the spread of pests and diseases affecting trees in England. What we learn from the pilot will inform the design of the future Tree Health Scheme. Through the pilot, you can get grants for: "
        },
        {
            "text": "Forestry Commission will help with identification of particular pests or diseases. The trees or woodlands you manage must be in one of these regions of England: "
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "Grant amounts vary. More information can be found on the specific grant pages: "
        },
        {
            "text": "The Statutory Plant Health Notice (SPHN) advice grant is a £475 standard cost package. "
        },
        {
            "text": "Dates "
        },
        {
            "text": "Grants are available through the pilot until it ends in 2024.  "
        },
        {
            "text": "Fund "
        },
        {
            "text": "This grant is offered through the tree health pilot scheme. "
        },
        {
            "text": "Learn more "
        },
        {
            "text": "Read the official guidance on the tree health pilot and apply. "
        },
        {
            "text": "Read our blog posts on the tree health pilot. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Grants to fund a yearly vet visit "
        },
        {
            "text": "What it is and who it’s for "
        },
        {
            "text": "The Annual Health and Welfare Review is a funded annual visit from your chosen vet or team of vets. It will allow you and your vet to concentrate on your animals’ specific health and welfare priorities. "
        },
        {
            "text": "Initially, only farmers who are eligible for the Basic Payment Scheme can register. We’ll expand this gradually. "
        },
        {
            "text": "Right now, to be eligible to apply, you must have one of the following: "
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "Dates "
        },
        {
            "text": "You can register for a vet visit now. "
        },
        {
            "text": "Fund "
        },
        {
            "text": "The Annual Health and Welfare Review is part of the Animal Health and Welfare Pathway "
        },
        {
            "text": "Learn more "
        },
        {
            "text": "Read the official guidance on the Annual Health and Welfare Review and register your interest. "
        },
        {
            "text": "Read our recent blog post on the roll out of the Annual Health and Welfare Review. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Grants to support farming in protected landscapes "
        },
        {
            "text": "What it is and who it’s for: "
        },
        {
            "text": "This grant is for farmers and land managers in Areas of Outstanding Natural Beauty (AONB), National Parks and the Broads.  "
        },
        {
            "text": "Grants are available to support: "
        },
        {
            "text": "How much you can get "
        },
        {
            "text": "You could get up to 100% of the costs of a project if you will not make a commercial gain from it. If you will benefit commercially from a project, then we'll fund a proportion of the costs. The amount will depend on how much the project will benefit your business. "
        },
        {
            "text": "Dates "
        },
        {
            "text": "You can apply now until March 2025 based on the successful first year and a half. "
        },
        {
            "text": "Fund "
        },
        {
            "text": "This grant is offered through the Farming in Protected Landscapes programme. "
        },
        {
            "text": "Learn more "
        },
        {
            "text": "Read the official guidance for farming in protected landscapes. "
        },
        {
            "text": "Read our blog posts on farming in protected landscapes. "
        },
        {
            "text": "Watch this video on the Farming In Protected Landscapes programme."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Grants available through Countryside Stewardship"
        },
        {
            "heading": 3,
            "text": "Grants to improve boundaries, trees and orchards, water quality, air quality and natural flood management"
        },
        {
            "text": "You can apply for standalone capital grants under Countryside Stewardship (CS) Capital Grants 2023 to help you improve:"
        },
        {
            "text": "You can apply for these grants at any time of the year."
        },
        {
            "text": "Read the official guidance on Countryside Stewardship (CS) Capital Grants and apply."
        },
        {
            "heading": 3,
            "text": "Grants to improve environmentally significant sites and woodlands"
        },
        {
            "text": "CS Higher Tier Capital Grants offer standalone capital grants to improve environmentally significant sites and woodlands."
        },
        {
            "text": "You can apply for these grants at any time of year."
        },
        {
            "text": "Read the official guidance on CS Higher Tier Capital Grants and apply."
        },
        {
            "heading": 3,
            "text": "Grants to improve woodland infrastructure and protection from beaver activity"
        },
        {
            "text": "You can apply for CS Protection and Infrastructure Grants, which offer standalone capital grants to:"
        },
        {
            "text": "You can apply for these grants at any time of year."
        },
        {
            "text": "Read the official guidance on CS Protection and Infrastructure Grants."
        },
        {
            "heading": 3,
            "text": "Grants to improve the management of woodlands"
        },
        {
            "text": "The CS Woodland Management Plan grant 2023 offers a one-off payment to create a 10-year Woodland Management Plan that complies with the UK Forestry Standard."
        },
        {
            "text": "Your plan must be approved by the Forestry Commission before you can apply for ongoing payments to deliver your plan under CS Higher Tier."
        },
        {
            "text": "You can apply for this one-off payment at any time of the year."
        },
        {
            "text": "Read the official guidance on the CS Woodland Management Plan grant and apply."
        },
        {
            "heading": 3,
            "text": "Grants to improve the health of trees"
        },
        {
            "text": "CS Woodland Tree Health Grants offers one-off payments to support:"
        },
        {
            "text": "You can apply for these one-off payments at any time of year."
        },
        {
            "text": "Read the official guidance on the CS Woodland Tree Health Grant."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Grants coming this year: a forward look "
        },
        {
            "heading": 3,
            "text": "Grants to support animal health and welfare "
        },
        {
            "text": "As part of the Animal Health and Welfare Pathway, several grants will be available to support farmers to achieve higher levels of animal health and welfare, by co-funding investments in equipment, technology and transformational infrastructure projects.  "
        },
        {
            "text": "Grants will go towards equipment and technology that improve the health and welfare of livestock.  We worked closely with farmers, academics and industry groups to compile the list of items.  "
        },
        {
            "text": "You can get a minimum of £1,000 and a maximum of £25,000. "
        },
        {
            "text": "This grant will be available in March 2023. "
        },
        {
            "text": "This grant will be available through the Farming Equipment and Technology Fund, which is part of the Farming Investment Fund. "
        },
        {
            "text": "Read the official guidance on the animal health and welfare grant and the list of items. "
        },
        {
            "text": "Read our most recent post on the animal health and welfare grants. "
        },
        {
            "text": "Infrastructure grants will be available for housing to support farmers to improve cattle health, welfare and productivity.  "
        },
        {
            "text": "The initial offer will co-fund new and upgrades to calf housing that improves social contact and the ambient environment.  "
        },
        {
            "text": "This is to support farmers to produce healthy calves that are likely to be more resilient and productive in later life.  "
        },
        {
            "text": "We intend to expand the offer to include funding for adult cattle in future. "
        },
        {
            "text": "It will be available in summer 2023. "
        },
        {
            "text": " This grant will be available through the Farming Transformation Fund. "
        },
        {
            "text": "Animal Health and Welfare infrastructure grants for other livestock sectors will be available in future. The next will fund next pig and poultry farmers to improve health and welfare of their livestock through upgrades to housing.  "
        },
        {
            "text": "This grant will be available later this year.  "
        },
        {
            "text": "This grant will be available through the Farming Transformation Fund.  "
        },
        {
            "heading": 3,
            "text": "Grants to support slurry infrastructure  "
        },
        {
            "text": "The Slurry Infrastructure grant is designed to help you improve or expand your slurry storage capacity.   "
        },
        {
            "text": "Sufficient high-quality covered slurry storage is crucial in enabling farmers to best use the nutrients they have and reduce air and water pollution."
        },
        {
            "text": "The first round of the Slurry Infrastructure grant closed for applications in January. We plan to open another round later this year. "
        },
        {
            "text": "Read the official guidance on the Slurry Infrastructure grant. "
        },
        {
            "text": "Read our blog posts about previous rounds of the Slurry Infrastructure grant. "
        },
        {
            "heading": 3,
            "text": "Grants to support water management "
        },
        {
            "text": "Water Management grants will be available for capital items to support the construction of on-farm reservoirs and the adoption of best practice irrigation application equipment.  "
        },
        {
            "text": "These will improve farm productivity and deliver environmental benefits through more efficient use of water, reduce use of water from summer abstraction and mains, and improve irrigation.  "
        },
        {
            "text": "You might for example use funding to move from rain guns to trickle and boom application. "
        },
        {
            "text": "Grants will be available in spring 2023. "
        },
        {
            "text": "These grants will be offered through the Farming Investment Fund. "
        },
        {
            "text": "Read the official manual for the Water Management grant."
        },
        {
            "text": "Read our blog post on the Water Management grant. "
        },
        {
            "heading": 3,
            "text": "Grants to work on long-term farming innovation "
        },
        {
            "text": "In May, we plan to launch the fourth round of our Farming Futures R&D competition. "
        },
        {
            "text": "We’re looking to fund products and innovations that help solve longer-term social challenges. Your ideas can be further away from market readiness than typical R&D projects. "
        },
        {
            "text": "You will be able to apply for a share of £12.5 million. "
        },
        {
            "text": "Each competition has a different theme. We’ll share the next theme as soon as we can. Previous competition themes were ‘climate smart farming’ which aimed to reduce carbon emissions and ‘sustainable farm-based proteins’ which aimed to improve the sustainability of protein sources. "
        },
        {
            "text": "The competition will open in May 2023.  "
        },
        {
            "text": "The Farming Futures R&D competition is part of the Farming Innovation Programme. "
        },
        {
            "heading": 3,
            "text": "Grants for research and development, to develop a new technology or service "
        },
        {
            "text": "This summer, we plan to launch the third round of the Small R&D partnerships competition. "
        },
        {
            "text": "The aim of this competition is to fund industrial research studies developing new solutions that will address major on-farm or immediate post farmgate challenges or opportunities. Businesses within a supply chain are encouraged to come together as a partnership to solve major challenges or opportunities. "
        },
        {
            "text": "Your project must be able to demonstrate how the project will benefit farmers, growers or foresters in England. "
        },
        {
            "text": "Your project’s total costs must be between £1 million and £3 million.  "
        },
        {
            "text": "The competition will open in August. "
        },
        {
            "text": "The Small R&D Partnerships competition is part of the Farming Innovation Programme. "
        },
        {
            "text": "Visit the Farming Innovation Programme website to find out more about this type of competition. "
        },
        {
            "heading": 3,
            "text": "Grants for research and development to check if an innovative idea works in practice "
        },
        {
            "text": "In September, we plan to launch the third round of the Feasibility Studies competition."
        },
        {
            "text": "If you’ve been researching an idea that could improve farming, you can apply for funding to check if it will work in practice.   "
        },
        {
            "text": "You’ll need to be a business registered in the UK to lead on a ‘Feasibility Studies’ project. Research organisations, farmers and growers, and other businesses can collaborate as part of the project team to successfully deliver these projects. "
        },
        {
            "text": "The total project costs are between £200,000 and £500,000. The amount of funding you can claim depends on the size of your business. "
        },
        {
            "text": "This competition will open in September 2023."
        },
        {
            "text": "The Feasibility Studies competition is part of the Farming Innovation Programme.  "
        },
        {
            "text": "Learn more about Farming Innovation Programme and read our previous posts on the Feasibility Studies competition. "
        },
        {
            "heading": 3,
            "text": "Grants to run on-farm trials assessing the viability of new technology, processes and practices "
        },
        {
            "text": "These grants will support farmers, growers and foresters to lead and deliver smaller-scale, on-farm trials to test potential solutions to practical problems and therefore improve productivity and sustainability. This might include using existing equipment, processes and practices in novel ways or testing innovative ideas and technology.   "
        },
        {
            "text": "If you have an idea in mind, you will be able to apply for funding to field testing to establish if it works in practice, across a number of years. Projects involving multiple producers working together can also be funded.   "
        },
        {
            "text": "You’ll need to be a farmer, grower or forester in England to lead a project. Research institutes, other producers or businesses and other organisations can be part of the project team as collaborators. A specialist support service will also be available to help applicants design and execute their plans, as well as share findings.  "
        },
        {
            "text": "During the first round of this fund, you will be able to apply for a share of £1 million. "
        },
        {
            "text": "This grant will be available in autumn 2023. "
        },
        {
            "text": "This grant is offered through the Farming Innovation Programme.  "
        },
        {
            "heading": 2,
            "text": "Stay informed"
        },
        {
            "text": "Please note that blog posts do go out of date. For the definitive, up-to-date list of all farming payments and guidance in England, bookmark Funding for Farmers and Land Managers on GOV.UK. The Funding for Farmers and Land Managers page contains both our one-off grants and our ongoing payments."
        },
        {
            "text": "It also includes Countryside Stewardship grants."
        },
        {
            "text": "The page is updated regularly and you can request a notification whenever it is. Just click on the button with the bell icon that says, ‘Get emails about this page’. It’s circled in the image below. "
        },
        {
            "text": "For updates from the team, subscribe to the blog."
        }
    ]
}