{
    "url": "https://educationhub.blog.gov.uk/2023/03/how-improving-support-children-special-educational-needs-sendd/",
    "title": "How we are improving support for children with Special Educational Needs and Disabilities (SEND)",
    "authors": [
        "media officer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2023-03-02T14:18:32+00:00",
    "content": [
        {
            "text": "We want all children and young people to have the same opportunity to meet their potential – including children and young people with special educational needs and disabilities (SEND)."
        },
        {
            "text": "Our ambitious new plan will create consistent, high standards of support for families no matter where in the country they live."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "How will children with SEND benefit from this additional support?"
        },
        {
            "text": "Every child is unique and deserves support that meets their needs – never more so than in the developmental years."
        },
        {
            "text": "Some councils and local areas do an incredible job of this, but it’s not the same for everyone, with families in some areas facing a daily battle fighting the system for their children’s needs."
        },
        {
            "text": "This new plan hopes to change that. We’re making sure we deliver the funding and school places that are needed."
        },
        {
            "text": "For those children who will have the best experience in a mainstream school, we’re increasing additional ‘high needs’ funding, on top of the core school budget, to over £10 billion by 24/25."
        },
        {
            "text": "We’re also building 33 new special free schools for children who need more intensive support."
        },
        {
            "heading": 3,
            "text": "Will there be more training for teachers? "
        },
        {
            "text": "Under the new plans there will be further training for staff, ranging from up to 5,000 early years special educational needs coordinators to 400 educational psychologists, covering a wide range of educational needs."
        },
        {
            "text": "The Institute for Apprenticeships and Technical Education will also develop an apprenticeship for teachers of sensory impairments, such as deafness and blindness."
        },
        {
            "heading": 3,
            "text": "Will there be more support for families with children with SEND? "
        },
        {
            "text": "Yes. We will be developing new approaches for short breaks for children and young people with complex needs and their families, providing important respite for families."
        },
        {
            "text": "This will help local areas to test new services including play, sports, arts and independent living activities, allowing parents time to themselves while their child enjoys learning new skills."
        },
        {
            "text": "New national standards will also make clear to parents, schools, local authorities, and other providers what support should be offered at every stage of a child’s journey across education, health and care."
        },
        {
            "text": "The plan will improve parents’ and carers’ experiences of accessing support, with a digital-first process for obtaining Education Health and Care Plans (EHCP) where they are needed."
        }
    ]
}