{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/03/02/inspiring-change-through-lived-experience-of-send/",
    "title": "Inspiring change through lived experience of SEND",
    "authors": [
        "Nandi Caine"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2023-03-02T09:41:54+00:00",
    "content": [
        {
            "text": "Nandi Caine is the chair of Lincolnshire Young Voices (LYV); a pan-disability group of children and young people with a shared desire to inspire change based upon lived experiences. Funded and supported by Lincolnshire County Council and the Integrated Care Board (ICB), the group works together to improve service delivery for children and young people with Special Educational Needs and Disabilities (SEND). "
        },
        {
            "heading": 3,
            "text": "The role of Lincolnshire Young Voices"
        },
        {
            "text": "LYV was established in September 2017; the result of a local partnership pilot programme offering young people with SEND the opportunity to share their experiences with Lincolnshire County Council."
        },
        {
            "text": "The group has 13 members across a range of ages and disabilities, each offering differing viewpoints and experiences. Members are invited to join the group via social media and word of mouth, attending meetings in person every other month. Committee members remain in post until they reach the age of 25. After this time, they have the option to stay on as mentors to younger members of the group."
        },
        {
            "heading": 3,
            "text": "Supporting practitioners to support those with SEND"
        },
        {
            "text": "As a council staff member and chair, I support the group to raise awareness of their SEND experiences across education, health and care, and more broadly inspiring other young people with SEND to have a voice. In 2020, NHS England provided funding to each local area to support service provision for children and young people with SEND. In response, the group used their own experience of local services to inform a proposal for an online training resource for professionals; a guide for those working across the Lincolnshire SEND system in how to better communicate with those with SEND."
        },
        {
            "text": "Working with the group, we knew we wanted to change current ways of working and felt communication was a key success factor to that change. I helped the team connect with organisations across education, health and care in Lincolnshire and nationally to draft course content and commissioned a media company to oversee production. As part of this experience, members had the opportunity to work with the company to finesse their script writing skills and video recordings."
        },
        {
            "text": "Wanting to ensure the resource be used by professionals, in the summer of 2022, the team launched ‘A rough guide to not putting your foot in it’ at a Lincolnshire based education, health and care service event. Attended by practitioners, the Lincolnshire Parent Carer Forum, SEND charities and partners across Lincolnshire, the team presented their work and secured a commitment from those in attendance to promote and use the resource. To date there has been over 600 training completions, helping improve practitioner confidence across health, education and care to communicate with people with SEND."
        },
        {
            "text": "In recognition of the online training resource, at the 2022 NASEN Awards, LYV and Lincolnshire County Council received the Co-Production with Families award, which recognises effective use of person-centred working with children, young people and their families."
        },
        {
            "heading": 3,
            "text": "Below are some tips for creating a young people led advisory group:"
        },
        {
            "text": " "
        }
    ]
}