{
    "url": "https://ruralpayments.blog.gov.uk/2023/03/02/launch-of-rpa-web-chat-pilot-for-british-cattle-movement-service-and-pet-travel-helpline/",
    "title": "Launch of RPA web chat pilot for British Cattle Movement Service and Pet Travel helpline",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2023-03-02T14:13:48+00:00",
    "content": [
        {
            "text": "Over the next six months we will be trialling a live web chat service, providing an additional contact route for users of the British Cattle Movement Service (BCMS) English livestock service and Pet Travel helpline.  "
        },
        {
            "text": "The live web chat service will be available to users of these services, for support with general enquiries, during our helpline opening hours, 8.30am - 5pm Monday – Friday. "
        },
        {
            "text": "Why is this happening now? "
        },
        {
            "text": "Feedback suggests that people who use our services would like fast and easy access to gain information they require. The webchat function will be able to offer this. "
        },
        {
            "text": "What happens during the pilot? "
        },
        {
            "text": "We’ll review how the live web chat service is being used and how effective it is in helping users find the information they need. We will then decide on the future of the new web chat tool and if we can make this available for our other services. "
        },
        {
            "text": "How can I access the live web chat service for BCMS and Pet Travel? "
        },
        {
            "text": "You will just need to click on the ‘start chat’ button available on the Pet Travel and BCMS pages on GOV.UK and you will  be connected to a customer services agent. "
        },
        {
            "text": "Pam Graham, our Customer Contact Centre Lead explains why we are trying out this new channel; "
        },
        {
            "text": " “We’re always looking for ways to make things simpler and improve the experience people have when accessing our services. We want to make contacting us easy and to give people options on how to do this, which is why we are trialling a new webchat tool for some of our services. "
        },
        {
            "text": "“We’ve introduced this function initially to give users an alternative channel for assistance with generic advice and guidance. For support with case specific queries users will still need to contact us via the BCMS helpline or email address, or the Pet Travel helpline, but our aim is that anyone needing general advice can opt to use the webchat to talk to one of our advisors and get real time responses and access to guidance.” "
        },
        {
            "text": "BCMS maintain an online database of all bovine animals in Great Britain called the Cattle Tracing System (CTS) which animal keepers use to report births, deaths and movements of their bovine animals. We maintain and process this information and issue cattle passports. "
        },
        {
            "text": "On the Pet Travel Scheme helpline we provide advice on a range of topics, including pet passports, vaccinations, and travel outside the EU. "
        },
        {
            "text": "We’ll use all customer feedback from the web chat pilot, as well as our other customer service channels, to continue to improve our services. "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}