{
    "url": "https://educationinspection.blog.gov.uk/2023/03/02/pupils-with-special-educational-needs-and-or-disabilities-who-have-fallen-behind-with-reading/",
    "title": "Pupils with special educational needs and/or disabilities who have fallen behind with reading",
    "authors": [
        "Lee Owston, Acting National Director Education"
    ],
    "categories": [
        "reading",
        "SEND",
        "special educational needs"
    ],
    "pub_date": "2023-03-02T14:00:59+00:00",
    "content": [
        {
            "text": "This blogpost focuses on pupils with special educational needs and/or disabilities (SEND) who are not reading fluently."
        },
        {
            "text": "Learning to read is essential for all pupils because it helps them to:"
        },
        {
            "text": "That is why our education inspection framework (EIF) places a strong emphasis on how well all pupils, including disadvantaged pupils and those with SEND, are taught to read."
        },
        {
            "heading": 3,
            "text": "All pupils need the same knowledge of the alphabetic code to become independent readers and spellers"
        },
        {
            "text": "Extensive research shows how important teaching systematic synthetic phonics (SSP) is until children can decode automatically."
        },
        {
            "text": "SSP represents a body of knowledge needed for word reading (and spelling). Without the knowledge they build through being taught SSP, pupils will struggle to read unfamiliar words."
        },
        {
            "text": "This is true for all pupils who are learning to read, including those with SEND. Broadly speaking, it will only be those pupils with severe cognitive difficulties that cannot be taught the alphabetic code."
        },
        {
            "heading": 3,
            "text": "The curriculum remains the same but the pedagogy might be different"
        },
        {
            "text": "We know that sometimes, schools assume – mistakenly - that if pupils are struggling with reading, then phonics has not worked and pupils must need something different. But understanding the alphabetic code, that the letters on the page represent the sounds in spoken words, is the basis of successful word reading. Study upon study show that children who have been diagnosed with developmental conditions learn to decode words by relying on the same processes as other readers."
        },
        {
            "text": "A different curriculum, such as teaching pupils to read whole words by sight, may appear to offer short-term success but it will not provide a long-term strategy for decoding unfamiliar words."
        },
        {
            "text": "Teaching sight words (where pupils need to memorise words without phonics) relies on an adult to tell the pupil every word. So it does not work when there is no adult present. Nor are pupils able to learn enough words by sight to access the curriculum effectively."
        },
        {
            "text": "Teaching sight words alongside phonics is confusing to pupils because they are then unclear about which strategy to apply, often resorting to guessing."
        },
        {
            "text": "Some pupils with SEND will probably need a lot more practice to secure important phonic knowledge. This does not mean phonics is not working. It just means we need to think really carefully about how best to help pupils secure this knowledge – what pedagogy we are using."
        },
        {
            "text": "For example, it may be more helpful for pupils to be in a small group that is free from distractions. They may also benefit if teachers break the learning down into smaller steps, and repeat the steps more to increase overlearning."
        },
        {
            "text": "Older pupils may need more age-appropriate resources."
        },
        {
            "text": "Schools also need to make sure that pupils with SEND get high-quality teaching from the staff who are early reading experts."
        },
        {
            "heading": 3,
            "text": "Making reasonable adjustments to help pupils access the same phonics curriculum as their peers"
        },
        {
            "text": "Pupils with SEND may have a range of difficulties that affect how easily they are able to access the curriculum. Under the Equality Act 2010, schools must make reasonable adjustments to enable pupils with SEND to have full access to the curriculum and to be able to participate in it. This includes making appropriate phonics instruction available for children with complex needs."
        },
        {
            "text": "When leaders are thinking about how to help pupils with SEND access the same phonics curriculum as their peers, it’s important that they assess the individual pupil’s needs. Knowing each individual’s learning needs then plays an important part in helping staff to choose the most effective pedagogy to secure the knowledge being taught. Assessment should identify the precise knowledge which pupils need in order to progress through the curriculum. Teaching can then target this knowledge precisely."
        },
        {
            "heading": 3,
            "text": "What effective schools do"
        },
        {
            "text": " Inspection evidence shows us that the most effective schools teach all pupils to read, despite disadvantage or special educational need. These schools know that pupils’ understanding of the alphabetic code underpins successful reading and spelling. They make sure adults read to children, they teach SSP well and they give children time to practise and consolidate their growing knowledge."
        },
        {
            "heading": 3,
            "text": "More information "
        },
        {
            "text": "Sign up to our webinar on ‘Secondary pupils who need to catch up with reading’, which is taking place on 22 March, 4:30 to 5:30 pm: https://bit.ly/OfstedWebinars. (You can sign up to as many of the webinars as you like.)"
        },
        {
            "heading": 4,
            "text": "You can also read the reports and blogs below"
        },
        {
            "text": "English research review Research review series: English - GOV.UK (www.gov.uk)"
        },
        {
            "text": "The general principles from this research are applicable to pupils with SEND. There is also a short section on pedagogical considerations for pupils with SEND."
        },
        {
            "text": "The DfE’s reading framework includes a section which relates to good practice for pupils with moderate to severe SEND and complex needs."
        },
        {
            "text": "The reading framework - teaching the foundations of literacy (publishing.service.gov.uk)"
        },
        {
            "text": "‘Supporting secondary school pupils who are behind with reading’: https://educationinspection.blog.gov.uk/2022/04/28/supporting-secondary-school-pupils-who-are-behind-with-reading/"
        },
        {
            "text": "‘Thousands of year 7s struggle with reading’: https://educationinspection.blog.gov.uk/2022/09/05/thousands-of-year-7s-struggle-with-reading/"
        },
        {
            "text": " "
        }
    ]
}