{
    "url": "https://dvladigital.blog.gov.uk/2023/03/02/set-up-a-direct-debit-to-tax-your-vehicle-today/",
    "title": "Set up a Direct Debit to tax your vehicle today",
    "authors": [
        "DVLA External Communications"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2023-03-02T14:59:10+01:00",
    "content": [
        {
            "text": "We’ve recently launched our latest vehicle tax evasion campaign, ‘Tax it, don’t risk it’, to remind our customers of the importance of taxing their vehicle on time."
        },
        {
            "text": "Did you know that you can set up a Direct Debit when you tax your vehicle online or at a Post Office? It’s never been easier to tax your vehicle and with the option to spread your payments out throughout the year, you can be sure that your vehicle is taxed at all times."
        },
        {
            "text": "Still have questions? Don’t worry, we’ve answered some of the most frequently asked questions about renewing vehicle tax with Direct Debit."
        },
        {
            "heading": 2,
            "text": "How do I set up Direct Debit?"
        },
        {
            "text": "You can set up a Direct Debit when you tax your vehicle online or at a Post Office."
        },
        {
            "text": "You do not need to be the vehicle’s registered keeper to set up a Direct Debit. Emails and letters about Direct Debit payments are sent to the account holder."
        },
        {
            "heading": 2,
            "text": "What will I need?"
        },
        {
            "text": "You need:"
        },
        {
            "text": "You cannot set up a Direct Debit for an account that needs 2 signatures."
        },
        {
            "heading": 2,
            "text": "Do I need to do anything once it’s set up?"
        },
        {
            "text": "No, once your Direct Debit is set up you’re good to go and it will automatically renew - one less thing to remember!"
        },
        {
            "heading": 2,
            "text": "What happens if I change my vehicle?"
        },
        {
            "text": "Once you’ve told us you’ve changed your vehicle, we’ll cancel your Direct Debit and you’ll get a refund for any full months of remaining tax."
        },
        {
            "heading": 2,
            "text": "How much does it cost and how often do I need to pay?"
        },
        {
            "text": "The amount you pay depends on how often you want to make a payment."
        },
        {
            "text": "There’s a 5% surcharge if you pay monthly or 6 monthly."
        },
        {
            "heading": 2,
            "text": "What are the benefits of setting up Direct Debit?"
        },
        {
            "text": "Your vehicle tax is automatically renewed when it’s due. It’s a helpful way to spread the cost, making sure you don’t forget and risk financial penalties, court action, clamping and even the loss of a car. It's also flexible, simple to do, saves time and gives you peace of mind."
        },
        {
            "heading": 2,
            "text": "How do I stop paying by Direct Debit?"
        },
        {
            "text": "Cancel your Direct Debit with your bank or building society and tax your vehicle again selecting the payment method of your choice."
        },
        {
            "heading": 2,
            "text": "I’ve changed my debit card, how do I let you know?"
        },
        {
            "text": "If you need to change your bank details, go to: www.gov.uk/vehicle-tax-direct-debit/change-accounts for more information."
        },
        {
            "text": " "
        },
        {
            "text": "Spread the cost of your vehicle tax with Direct Debit. Tax it, don’t risk it!"
        },
        {
            "text": "Full details and everything you need to know on paying your vehicle tax by Direct Debit can be found here: www.gov.uk/vehicle-tax-direct-debit"
        }
    ]
}