{
    "url": "https://teaching.blog.gov.uk/2023/03/02/the-importance-of-relationships-when-providing-sen-support/",
    "title": "The importance of relationships when providing SEN support",
    "authors": [
        "Abby Williams"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2023-03-02T09:41:56+00:00",
    "content": [
        {
            "text": "Abby Williams is the KS2 Special Educational Needs (SEN) Coordinator at St Peters Church of England Primary School in Wirral. Here she shares her advice for providing quality SEN support in school."
        },
        {
            "text": "I know it’s a cliche, but I've always wanted to teach. What I didn't know is how much I would love working with SEN children and their families from the moment I had my first class."
        },
        {
            "text": "I have a passion for building relationships with SEN children. When providing SEN support, whether in the classroom or across the whole school, the most important aspect of support is being able to create key relationships for children. They often have higher anxiety levels and lower tolerance levels than neurotypical children. Building relationships with members of staff helps the child to feel safe and challenge themselves to make progress. My belief is that a school could buy into every SEN resource available but if they don't have those key relationships children just won't thrive."
        },
        {
            "heading": 3,
            "text": "Start with quality first teaching"
        },
        {
            "text": "At St Peter’s we apply a 3-wave model of support; wave 1 is about quality first teaching, wave 2 focuses on intervention support and wave 3 is about individualised support. As a school we prioritise wave 1. I believe in always starting with quality first teaching strategies. All children, especially those with SEN, will learn best in a classroom environment. It promotes teamwork, socialising with peers and learning from each other."
        },
        {
            "text": "As an inclusive practice, we provide resources that allow all children a chance to understand and manage their own behaviour. This includes classroom apparatus, such as a wobble cushion or therabands for sensory seeking children, or the chance for daily (or sometimes multiple) debriefs for children with anxiety."
        },
        {
            "heading": 3,
            "text": "Tools at your disposal"
        },
        {
            "text": "I recommend having a variety of tools at your disposal that can be catered to a child’s individual needs. Below are some quick tools and activities I find particularly effective in supporting children with SEN:"
        }
    ]
}