{
    "url": "https://prisonjobs.blog.gov.uk/2023/03/02/things-i-wish-id-known-when-starting-pqip/",
    "title": "Things I wish I’d known when starting PQiP",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-02T16:59:45+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Joining the trainee probation officer programme (PQiP) can be the start of a rewarding career in the Probation Service. You will receive support at every step of the way but, as with most courses, there are always a few things worth knowing beforehand. Reflecting on her experience, probation officer Cleopatra highlights the things she wishes she had known before enrolling. "
        },
        {
            "text": "Academic side "
        },
        {
            "text": "When I started PQiP, I had not done any type of academic study for about 10 years. I was super keen to start learning again – it was part of the appeal of the whole programme. I was also a bit concerned about the time it would take to retrain my brain to read academic texts and critically examine theories again. I figured it would take some time. I developed a bit of anxiety about my essay writing ability midway through the programme. I think that was in part linked to my feeling quite engaged with all the learning, in the office and from theory books, and not wanting to have to leave PQiP because I did not have confidence to write an essay. However, with time and practice, I developed my essay writing skills and was very happy with my end result."
        },
        {
            "text": "What the job actually is  "
        },
        {
            "text": "I remember on my first day in the office, having completed essays, group work, written tests and face to face interviews as part of my assessment for the role, I still didn’t have a clear idea of what the actual goal of the job was. I’d seen the marketing videos and completing the assessments had motivated me to continue the application process. But I had to ask my manager on my first day, “what is it that we actually do?”. They responded with “we manage risk”. It’s funny that I did not really understand that until my first day. I feel it’s a shame that the public do not have a clearer perception of probation’s important role within society. Risk management is now the credo which underpins all my day-to-day work, and every decision I make.  "
        },
        {
            "text": "Work life balance  "
        },
        {
            "text": "I was aware that when I started PQiP, I was in a most advantageous position. I was single, had no dependents, no mortgage, and no other considerations that would use valuable energy that is required when starting the training. It was similar when I have started other jobs in the past. New roles always take up a lot of energy in the beginning due to the new routine, environment and approach that a new job presents. However, this role was so different to anything I’d done previously, and it being an academic as well as vocational challenge, I felt that I wanted to give it even more energy. I guess it’s important to know how you best support yourself when starting a new challenge. I have spoken to a colleague who felt that they needed the support of their partner to complete the training. Prioritising yourself, your mental wellbeing and health is of course the most important factor. "
        },
        {
            "text": "So many acronyms!   "
        },
        {
            "text": "During my first few weeks, I not only felt as if I was in a new job and a new office, but also in a new country, with a language completely unfamiliar to me. There were so many acronyms for everything – meetings, forms, people (who knew there are SPOC’s in probation as well as Star Trek?!). I felt like I would never learn this new language of probation. However, like with anything, time and practise made it easier. I would not say that I’m fluent now, but I’d like to think I have a pretty good hold on the vocabulary. "
        }
    ]
}