{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/08/14/event-14-september-untapped-potential-for-public-policy-from-design-research/",
    "title": "Event 14 September: Untapped potential for public policy from design research",
    "authors": [
        "Liz Richardson",
        "Lucy Kimbell",
        "Andrew Knight"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-08-14T12:00:44+01:00",
    "content": [
        {
            "text": "Ever wondered how ideas from design research could be used in policy development?"
        },
        {
            "text": "In this, the second of four events hosted by our new Design and Policy Network, we'll explore opportunities for policy from design approaches."
        },
        {
            "text": "We aim to map some of the untapped potential for the use of design in relation to public policy processes, grounded in concepts from design research."
        },
        {
            "text": "Each of our events begins with invited provocations from three guest speakers each from different backgrounds in design research, policy practice, and political science. This time, provocations will come from: Carl DiSalvo (Georgia Institute of Technology), Professor Catherine Durose (Heseltine Institute for Public Policy, Practice and Place at the University of Liverpool), and Andrew Knight (Head of UK Policy Design community, UK Civil Service). The session will be co-chaired by Professor Lucy Kimbell (University of Arts London) and Professor Liz Richardson (University of Manchester)."
        },
        {
            "text": "This roundtable follows a successful first event in June where we examined Tensions and resistances in the field of design in policy. Do watch the film of the provocations."
        },
        {
            "text": "The Design and Policy Network provides a space for researchers and PhD students in studies of design, political science, public administration, the humanities and practitioners working in  government public policy and services and related organisations (such as thinktanks) to engage, discuss, explore potential collaborations and develop new understandings of the potential and limitations of design in public policy."
        },
        {
            "text": "Funded by the Arts and Humanities Research Council, the network is based jointly at the Social Design Institute of the University of the Arts London and in the politics department of the University of Manchester, and parternered with the UK Government's Policy Design Community."
        },
        {
            "text": "Join the event on 14 September 2022, 13:00-15:00. You can attend online or in person (limited places available) at University of Manchester, Oxford Road, M13 9PL. Book your place at: AHRC Design and Policy Network Roundtable: untapped potential Tickets, Wed 14 Sep 2022 at 13:00 | Eventbrite"
        }
    ]
}