{
    "url": "https://phescreening.blog.gov.uk/2021/08/27/fourth-quarterly-kpi-data-for-2020-to-2021-published/",
    "title": "Fourth quarterly KPI data for 2020 to 2021 published",
    "authors": [
        "Lizzie Tempest"
    ],
    "categories": [
        "General information",
        "NHS Abdominal Aortic Aneurysm Screening Programme",
        "NHS Bowel Cancer Screening Programme",
        "NHS Breast Screening Programme",
        "NHS Cervical Screening Programme",
        "NHS Diabetic Eye Screening Programme",
        "NHS Fetal Anomaly Screening Programme",
        "NHS Infectious Diseases in Pregnancy Screening Programme",
        "NHS Newborn and Infant Physical Examination",
        "NHS Newborn Blood Spot Screening Programme",
        "NHS Newborn Hearing Screening Programme",
        "NHS Sickle Cell and Thalassaemia Screening Programme"
    ],
    "pub_date": "2021-08-27T13:47:30+01:00",
    "content": [
        {
            "text": "KPIs measure how NHS screening programmes are performing and aim to give an overview of programme quality."
        },
        {
            "heading": 2,
            "text": "Latest data"
        },
        {
            "text": "The latest data covers quarter 4 (Q4), 1 January to 31 March 2021, and is split into publications for:"
        },
        {
            "text": "Data for some KPIs is collected later than the others, so we have also updated the Q3 KPI data files for:"
        },
        {
            "heading": 2,
            "text": "Data highlights"
        },
        {
            "text": "National performance reached or remained at record highs of performance nationally in 6 of the KPIs in Q4 2020 to 2021."
        },
        {
            "text": "These were the:"
        },
        {
            "heading": 2,
            "text": "COVID-19"
        },
        {
            "text": "We are seeing variations in the data caused by COVID and expect these to continue for some time."
        },
        {
            "text": "We recommend screening providers and commissioners follow these 3 steps when studying the data."
        },
        {
            "heading": 2,
            "text": "Summary factsheets\n"
        },
        {
            "text": "The data is accompanied by our latest KPI summary factsheet reports and national screening dashboard, which include:"
        },
        {
            "text": "Please send any feedback to the PHE Screening helpdesk. We look forward to hearing from you."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}