{
    "url": "https://food.blog.gov.uk/2021/08/27/how-greggs-prepared-for-the-new-prepacked-for-direct-sale-ppds-food-legislation/",
    "title": "How Greggs prepared for the new Prepacked for Direct Sale (PPDS) food legislation",
    "authors": [
        "Claire Florey, Food Safety and Regulatory Affairs Manager at Greggs"
    ],
    "categories": [
        "Business guidance",
        "Case studies"
    ],
    "pub_date": "2021-08-27T11:25:45+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Allergen labelling laws for prepacked for direct sale (PPDS) foods change on 1 October 2021. This means that prepacked for direct sale food will need to have ingredient and allergen information provided on the label."
        },
        {
            "text": "To help businesses prepare we hosted a webinar for small and micro food businesses. Feedback from the webinar showed that 90% of businesses who attended the event rated it as good or excellent and would recommend it to a colleague."
        },
        {
            "text": "At the webinar, we heard from the Natasha Allergy Research Foundation who gave us a background on why this law is needed. There was further information on the new allergen labelling changes, also known as Natasha’s Law and we heard from Greggs who shared helpful tips for businesses on becoming PPDS compliant."
        },
        {
            "heading": 3,
            "text": "Here's Claire Florey, Food Safety and Regulatory Affairs Manager at Greggs who discusses learnings from their preparation for the PPDS change and examples that might be of help to smaller businesses."
        },
        {
            "heading": 3,
            "text": "Claire is responsible for supporting the rollout of Prepacked for Direct Sale (PPDS) food legislation, also known as Natasha’s Law."
        },
        {
            "text": "The tragic death of Natasha Ednan-Laperouse really touched me - not only on a personal level but because of the role I do at Greggs. I am a member of the Food Safety Team which involves ensuring we are compliant with legislation, retail food safety standards and customer safety."
        },
        {
            "text": "Our customers are at the very heart of our business, and so it’s no surprise that Greggs was fully supportive of the change in legislation from the very first consultation, believing strongly that the availability of information and the safety of our customers is paramount. We want to ensure that all consumers have accurate allergen information available, so they can make an informed decision when shopping with us."
        },
        {
            "text": "So, starting at the very beginning – the first thing we did was to assemble an ‘Allergen working group’ with a multidisciplinary team to continuously review emerging factors and risks and implement changes as required."
        },
        {
            "text": "One of the difficult parts of this process was deciding which of our products were PPDS. Through many discussions internally, with other retailers, and with the help of the FSA guidance we were able to cover our full range."
        },
        {
            "text": "Some of our products were quite easy to agree on, such as:"
        },
        {
            "text": "However, we do have some products that can be both. For example, soup placed in our hot units is PPDS, however, if we sell this as the customer orders it from our soup kettles it is considered non-prepacked food and therefore doesn’t require a label. We know that this could be very confusing for our customers so we continue to work through how we can improve allergen information."
        },
        {
            "text": "The COVID-19 pandemic took hold and while it certainly brought with it a unique set of challenges for us as a business, our focus on allergens and preparing for PPDS changes remained a key business priority."
        },
        {
            "text": "Prior to the pandemic, we had started to label sandwiches in a couple of our shops to understand how we would roll this out across our shops; however, this was temporarily put on hold when we had to close our shops. So, during this time, we continued to work on our systems and processes to provide accurate information in the simplest way possible."
        },
        {
            "text": "We also focussed on allergen management across the business as a change or movement of a product or ingredient could have a significant impact. As part of this, we reviewed the way we conduct our allergen risk assessments and applied an ‘end-to-end’ approach, incorporating risk information into one format from our suppliers, through to our manufacturing sites, our logistics operations and retail shops, to ensure the information we provide to our customers is accurate."
        },
        {
            "text": "We also moved away from our paper allergen guide to a digital tablet, ensuring that we had up to date and accurate information in all of our shops.  To facilitate the changes to allergen labelling we also developed a production system that supports our ability to do this, make it simpler for our teams, and automatically prints the right number of labels for the right sandwich. We have received fantastic feedback from our teams so far and the remaining shops are eager to start using it."
        },
        {
            "text": "My colleague Mark Cowley and I presented the above information, our top tips for getting ready for the 1st October and so much more as part of the ‘FSA PPDS Webinar’ recently, including why colleague engagement is so important, clear communication and training, simplifying our processes so that it is incredibly difficult to get it wrong, and cross functional working across the business. We want to ensure everyone has an understanding of their part to play in keeping our customers safe."
        },
        {
            "heading": 1,
            "text": "Sut aeth Greggs ati i baratoi ar gyfer y ddeddfwriaeth newydd ar gyfer bwyd Wedi’i Becynnu Ymlaen Llaw i’w Werthu’n Uniongyrchol (PPDS)"
        },
        {
            "text": "Mae deddfau labelu alergenau ar gyfer bwyd wedi'i becynnu ymlaen llaw i'w werthu'n uniongyrchol (PPDS) yn newid ar 1 Hydref 2021. Mae hyn yn golygu y bydd angen darparu gwybodaeth am gynhwysion ac alergenau ar y label ar gyfer bwyd PPDS."
        },
        {
            "text": "Er mwyn helpu busnesau i baratoi, fe wnaethom gynnal gweminar ar gyfer busnesau bwyd bach a micro. Dangosodd adborth o'r weminar fod 90% o'r busnesau a oedd yn bresennol o’r farn bod y digwyddiad yn dda neu'n rhagorol ac y byddent yn ei argymell i gydweithiwr."
        },
        {
            "text": "Yn y weminar, clywsom gan Sefydliad Ymchwil Alergedd Natasha a esboniodd pam mae angen y gyfraith hon. Cafwyd gwybodaeth bellach am y newidiadau labelu alergenau newydd, a elwir hefyd yn Gyfraith Natasha a chlywsom gan Greggs a rannodd awgrymiadau defnyddiol i fusnesau ar gydymffurfio â rheolau PPDS."
        },
        {
            "heading": 3,
            "text": "Dyma Claire Florey, rheolwr Diogelwch Bwyd a Materion Rheoleiddiol yn Greggs, sy’n gyfrifol am gefnogi cyflwyno deddfwriaeth Bwyd wedi’i Becynnu Ymlaen Llaw i’w Werthu’n Uniongyrchol (PPDS) a elwir hefyd yn Gyfraith Natasha, yn trafod yr hyn y mae hi wedi’i ddysgu wrth baratoi ar gyfer y newid i reolau PPDS ac enghreifftiau a allai fod o gymorth i fusnesau llai."
        },
        {
            "text": "Fe wnaeth marwolaeth drasig Natasha Ednan-Laperouse fy nghyffwrdd yn fawr – nid yn unig ar lefel bersonol, ond oherwydd fy rôl yn Greggs. Rwy'n aelod o'r Tîm Diogelwch Bwyd, ac mae fy ngwaith yn cynnwys sicrhau ein bod ni’n cydymffurfio â deddfwriaeth, safonau diogelwch bwyd manwerthu a diogelwch cwsmeriaid."
        },
        {
            "text": "Mae ein cwsmeriaid wrth wraidd ein busnes, ac felly nid yw'n syndod bod Greggs yn gwbl gefnogol i’r newid mewn deddfwriaeth, a hynny o'r ymgynghoriad cyntaf, gan gredu'n gryf bod argaeledd gwybodaeth a diogelwch ein cwsmeriaid yn hollbwysig. Rydym ni am sicrhau bod gan bob defnyddiwr wybodaeth gywir am alergenau, fel y gallant wneud penderfyniad gwybodus wrth siopa gyda ni."
        },
        {
            "text": "Felly, y peth cyntaf a wnaethom oedd sefydlu 'gweithgor Alergenau' gyda thîm amlddisgyblaethol a fyddai’n adolygu ffactorau a risgiau sy'n dod i'r amlwg yn barhaus a gweithredu newidiadau yn ôl yr angen."
        },
        {
            "text": "Un peth anodd am y broses hon oedd penderfynu pa rai o'n cynhyrchion oedd yn fwyd PPDS. Trwy gynnal llawer o drafodaethau yn fewnol, gyda manwerthwyr eraill, a gyda chymorth canllawiau’r Asiantaeth Safonau Bwyd (ASB), roeddem wedi gallu penderfynu ar ein hystod lawn o gynhyrchion."
        },
        {
            "text": "Roedd rhai o'n cynhyrchion yn eithaf hawdd cytuno arnynt, er enghraifft, gwnaethom bennu:"
        },
        {
            "text": "Fodd bynnag, mae gennym ni rai cynhyrchion a all fod yn fwyd PPDS ac yn fwyd heb ei becynnu ymlaen llaw. Er enghraifft, mae cawl sy’n cael ei gadw yn ein hunedau poeth yn fwyd PPDS. Fodd bynnag, os ydym ni’n ei werthu gan fod y cwsmer yn ei archebu o'n tegelli cawl, fe'i hystyrir yn fwyd heb ei becynnu ymlaen llaw ac felly nid oes angen label arno. Rydym ni’n gwybod y gallai hyn fod yn ddryslyd iawn i'n cwsmeriaid felly rydym ni’n parhau i weithio ar sut y gallwn ni wella gwybodaeth am alergenau."
        },
        {
            "text": "Wedyn, daeth pandemig COVID-19 ac er ei fod yn sicr wedi cyflwyno set unigryw o heriau i ni fel busnes, roedd ein ffocws ar alergenau a pharatoi ar gyfer newidiadau bwyd PPDS yn parhau i fod yn flaenoriaeth fusnes allweddol."
        },
        {
            "text": "Cyn y pandemig, roeddem wedi dechrau labelu brechdanau mewn rhai o'n siopau i ddeall sut y byddem yn cyflwyno hyn ar draws ein holl siopau; fodd bynnag, gohiriwyd hyn dros dro pan oedd yn rhaid i ni gau ein drysau. Felly, yn ystod yr amser hwn, gwnaethom barhau i weithio ar ein systemau a'n prosesau i ddarparu gwybodaeth gywir yn y ffordd symlaf bosibl."
        },
        {
            "text": "Fe wnaethom ganolbwyntio hefyd ar reoli alergenau ar draws y busnes gan y gallai newid neu symud cynnyrch neu gynhwysyn gael effaith sylweddol. Fel rhan o hyn, gwnaethom adolygu'r ffordd yr ydym yn cynnal ein hasesiadau risg alergenau a chymhwyso dull 'o'r dechrau i'r diwedd', gan ymgorffori gwybodaeth risg mewn un fformat gan ein cyflenwyr, hyd at ein safleoedd gweithgynhyrchu, ein gweithrediadau logisteg a'n siopau adwerthu, i sicrhau bod yr wybodaeth a ddarparwn i'n cwsmeriaid yn gywir."
        },
        {
            "text": "Fe wnaethom hefyd symud i ffwrdd o'n canllawiau alergenau papur i e-lechen ddigidol, er mwyn sicrhau bod gennym ni’r wybodaeth gyfoes a chywir ym mhob un o'n siopau. Er mwyn hwyluso'r newidiadau i reolau labelu alergenau, fe wnaethom hefyd ddatblygu system gynhyrchu sy'n cefnogi ein gallu i wneud hyn, sy’n ei gwneud yn symlach i'n timau, ac sy’n argraffu'r nifer cywir o labeli ar gyfer y frechdan gywir yn awtomatig. Rydym ni wedi cael adborth gwych gan ein timau hyd yn hyn ac mae'r siopau sy'n weddill yn awyddus i ddechrau defnyddio’r system."
        },
        {
            "text": "Fe wnaeth fy nghydweithiwr Mark Cowley a minnau gyflwyno’r wybodaeth uchod, ein awgrymiadau ar gyfer paratoi at 1 Hydref a llawer mwy yn rhan o 'Weminar PPDS yr ASB' yn ddiweddar, gan gynnwys esbonio pam bod y pwyntiau canlynol mor bwysig, ymgysylltu â chydweithiwr, cyfathrebu a hyfforddiant clir, symleiddio ein prosesau fel ei bod yn anhygoel o anodd ei gael yn anghywir, a gweithio traws swyddogaethol ar draws y busnes. Rydym ni am sicrhau bod pawb yn deall eu rôl wrth ddiogelu ein cwsmeriaid."
        }
    ]
}