{
    "url": "https://naturalengland.blog.gov.uk/2021/08/27/shaping-the-future-of-nature-recovery-developing-local-nature-recovery-strategies/",
    "title": "Shaping the future of Nature Recovery: Developing Local Nature Recovery Strategies",
    "authors": [
        "Jo Traill-Thompson"
    ],
    "categories": [
        "Biodiversity",
        "Nature Recovery Network"
    ],
    "pub_date": "2021-08-27T13:30:20+01:00",
    "content": [
        {
            "text": "Local Nature Recovery Strategy Pilots"
        },
        {
            "text": "Local Nature Recovery Strategies (LNRS) are a flagship measure in the Environment Bill.  They are a new system of spatial strategies for nature which will plan, map, and help drive more coordinated, practical, focussed action and investment in nature’s recovery to build the national Nature Recovery Network."
        },
        {
            "text": "I’ve been lucky enough to lead the Local Nature Recovery Strategy (LNRS) pilots for Natural England, working with Cornwall Council, Greater Manchester Combined Authority, Buckinghamshire Council, Cumbria County Council and Northumberland County Council. Throughout, their fantastic interest and commitment has impressed, encouraged, reassured, and inspired me in equal measure."
        },
        {
            "text": "Their positive and consistent engagement to explore and challenge this new policy, sharing insights with us over the short nine months of the pilots’ duration convinced me LNRSs are the natural next step in establishing a locally owned and strategic way to plan nature recovery. The more I understand about LNRSs the more significant, and game changing I think this legislation will be. This is the first time we are putting planning for nature recovery on a statutory footing! LNRSs will drive action for nature recovery to grow and develop our national Nature Recovery Network. This is our most important policy goal."
        },
        {
            "text": "Such significant change and at this scale is not straightforward, and will require a tremendous amount of working through together, but what a great start we’ve made through the pilots."
        },
        {
            "text": "Some people involved with biodiversity opportunity mapping felt the LNRS process was familiar. In some ways it is, but there are critical aspects that are different such as a broader focus to include wider environmental benefits and the collaborative and the community engagement aspects. Responsible Authorities (RAs) need to keep these differences central in their approach to putting an LNRS delivery team together making sure they line up the right skills and project management."
        },
        {
            "text": "Linking into existing networks reduces the need to build new relationships. This was particularly true where the Local Authority and Local Nature Partnerships have a good track record of collaboration. Again though, this new collaborative approach requires inclusion of the widest range of stakeholders. These include local rural and urban communities, the farming community, plus biodiversity and natural environment experts. LNRSs will link people to places and will investigate how the climate and biodiversity crises impacts them, enabling them to work together to explore priorities and agree what measures can be taken."
        },
        {
            "text": "Tensions were inevitable, and not all were resolved within the pilot time frame. These highlighted both the need for independent facilitation to handle difficult conversations, and the importance of partnership working, good governance and clear remits."
        },
        {
            "text": "Lessons Learned"
        },
        {
            "text": "Rattling along with our pilots, the biggest lessons for me are:"
        },
        {
            "text": "The environment sector has an excellent track record in Biodiversity Action Planning and partnership working. Local Authorities and their partners will want to draw on these skills and expertise to create Local Nature Recovery Strategies."
        },
        {
            "text": "See Defra’s lessons learned report for further information."
        },
        {
            "text": "The LNRS Consultation"
        },
        {
            "text": "These have been, and continue to be, exciting times. With the public consultation now open which will inform the regulations and statutory guidance, that will implement LNRS across England, we need people to think about what it will mean to our communities to plan strategically and collaboratively for nature recovery at such a scale and consistently across the whole of England. This includes thinking of LNRSs as a new way of working, that brings land use planning together with land management to drive action for nature recovery."
        },
        {
            "text": "LNRS will develop our national Nature Recovery Network and deliver our most important policy goal, to become nature positive in this country. The positive lead given by the pilot Local Authorities leaves me excited to see how we all respond. The Defra led LNRS consultation is the next very important step in this journey. Please take this opportunity to respond and shape the future of nature recovery in this country."
        },
        {
            "text": "The consultation will close on Tuesday 2 November. Please do submit your consultation response using the online survey provided on Citizen Space. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}