{
    "url": "https://nationalscreening.blog.gov.uk/2021/08/27/the-uk-nsc-is-recruiting-for-members/",
    "title": "The UK NSC is recruiting for members!",
    "authors": [
        "Zeenat Mauthoor"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-08-27T10:52:36+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is looking for 12 new members to help it continue to make high-quality and well-considered evidence-based advice to ministers and the NHS in all 4 UK countries. If you're interested, you could play a vital role in shaping UK NSC recommendations and keeping the screening programmes delivered across the UK at the cutting edge of international research."
        },
        {
            "text": "We are looking for 11 expert members who are recognised experts, with a track record of national achievements in one of the following fields:"
        },
        {
            "text": "We are also looking for one additional lay member to strengthen the existing patient and public voice representation. Lay members should have the desire to make an effective contribution as a representative of all patients, carers and members of the general public."
        },
        {
            "text": "As well as specialist skills in their own particular area, UK NSC members should be able to take on board and critically consider complex information and scientific/medical data and have great communication skills. Post holders will not be paid but do get travel and other related expenses."
        },
        {
            "text": "The UK NSC meets 3 times a year, currently online, though face-to-face meetings are expected to restart when appropriate."
        },
        {
            "text": "Appointments are usually made for 3 years."
        },
        {
            "text": "Hilary Goodman, the current UK NSC member for midwifery, explained what it's like to be part of the committee:"
        },
        {
            "text": "If you have any questions, please get in touch via the UK NSC helpdesk."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}