{
    "url": "https://defrafarming.blog.gov.uk/2021/08/27/things-we-learned-at-this-summers-agricultural-shows/",
    "title": "Things we learned at this summer's agricultural shows",
    "authors": [
        "Jeeves Sidhu"
    ],
    "categories": [
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2021-08-27T10:57:32+01:00",
    "content": [
        {
            "text": "Come rain or shine, members of the Future Farming team enjoyed speaking to you at agricultural shows around the country during the summer."
        },
        {
            "text": "We went along to:"
        },
        {
            "text": "We went to these shows intending to talk about the changes coming in the farming sector, but just as importantly, to listen to concerns and learn from different experiences. Farmers and land managers, yes, but also agricultural businesses, campaigners, students, researchers, you name it."
        },
        {
            "text": "As you'll know if you're a regular reader of this blog, our focus is on co-design. We're not making new policy for people, we're making it with people."
        },
        {
            "text": "So, listening to what people have to say is vital. The summer shows were a chance to listen, and pass on what we’d heard to the right policy teams at Defra so those views become part of the policy design process."
        },
        {
            "text": "At some shows, we were joined by colleagues from the Rural Payments Agency and the Catchment Sensitive Farming team who were on hand with specific technical advice when it was needed. This worked really well, so we shall try to keep doing this at future shows."
        },
        {
            "text": "Some themes emerged from the conversations we had. This post is about what we heard, and how we're responding. We spoke to hundreds of people, and these are the themes and topics that seemed to strike a chord with most of them."
        },
        {
            "heading": 3,
            "text": "Farmers are keen co-designers"
        },
        {
            "text": "Everywhere we went, show attendees were keen to find out more about co-design, and volunteer to take part in co-design sessions. Some people joined workshops that we ran at shows, others signed up to join our co-design panel (a pool of people we can invite to take part in future co-design activities)."
        },
        {
            "text": "We see co-design as an essential part of our work and helpful for everyone. It helps farmers and land managers understand our thinking better, and get some insight into our plans."
        },
        {
            "text": "We covered topics such as animal health and welfare, pilot schemes for the Sustainable Farming Incentive, and regulation and enforcement (among other things)."
        },
        {
            "text": "It helps us, too. We can be more transparent about work-in-progress, which means we get rapid feedback on what works and what doesn't. That helps us change plans faster and avoid taking wrong turns."
        },
        {
            "text": "We will be talking more about the feedback and what we learnt from the co-design sessions with farmers at the shows soon,  so look out for that."
        },
        {
            "heading": 3,
            "text": "Some people still have questions about moving to the Sustainable Farming Incentive"
        },
        {
            "text": "The Sustainable Farming Incentive was announced by the Secretary of State, George Eustice, at the Cereals 2021 show. It's an environmental land management scheme that rewards farmers for adopting more sustainable farming approaches."
        },
        {
            "text": "People wanted more detail about transitioning from the existing Countryside Stewardship scheme to the Sustainable Farming Incentive - once it's fully up and running. The most common question was: “can I use Sustainable Farming Incentive and Countryside Stewardship together on my farm?” And the answer is yes you can, but not on the same parcel of land, so people aren’t getting rewarded twice for the same outcome."
        },
        {
            "text": "Others wanted more detail about the different standards that the  Sustainable Farming Incentive is based on, which we’ll publish more information on later this year"
        },
        {
            "heading": 3,
            "text": "There’s plenty of interest in lump sum payments"
        },
        {
            "text": "We took a lot of questions about our proposed schemes to help people either leaving or starting in the industry. This attracted interest and prompted questions about precise details. For example: if a member of a farmer's family takes over a farming business, does the parent still qualify for a lump sum payment? Does the new owner still qualify for our scheme for new entrants?"
        },
        {
            "text": "We've been running a consultation on this, which has just closed. We’re now analysing the data; we’ll publish a summary of responses on GOV.UK soon, and information about the scheme’s rules by the end of October this year."
        },
        {
            "heading": 3,
            "text": "The need to make applications easier for everyone"
        },
        {
            "text": "Some people said that having many different schemes with different names was confusing; and that they were concerned about having to go through many different application processes for each one."
        },
        {
            "text": "Avoiding this is a priority for us. We want to make the process of applying for support as simple as possible, so we're working hard to design something that meets the needs of the people who will end up using it."
        },
        {
            "text": "We're doing user research on this right now, as part of the Sustainable Farming Incentive pilot. We'll publish more information on GOV.UK soon."
        },
        {
            "heading": 3,
            "text": "People want more detail"
        },
        {
            "text": "Lots of people were asking for details about the proposed schemes and grants that will be rolled out in the coming years. They wanted to know more about eligibility criteria, about application processes, and about timelines for rollout."
        },
        {
            "text": "This wasn't a surprise to us, and of course  people need to know the granular detail. However, this is a 7 year transition and one that will see schemes come on stream over the next couple of years (as set out in both the Agricultural Transition Plan and the Farming Is Changing Leaflet), so we don’t have all the detail for all of the schemes quite yet, as we’re designing many of them with your input right now."
        },
        {
            "text": "But it was really useful to speak to people face-to-face, and understand their specific concerns, and why getting this level of detail in good time is really important. With that in mind, we’ve been adding updates on this blog when we have detailed information to share. This is the most recent one, from a couple of weeks ago."
        },
        {
            "text": "To play a part in designing schemes that work for you, send an email to ffcpcodesign@defra.gov.uk."
        },
        {
            "heading": 3,
            "text": "On to the winter Ag Show tour…"
        },
        {
            "text": "After months of lockdown, it was a real treat for the team to go out and meet people face-to-face. All of us enjoyed fantastic, positive conversations, especially about environmental issues."
        },
        {
            "text": "From September, we’ll attend the next batch of shows. We're planning to be at the Westmorland Show, Dairy Day and the Dairy Show, to name just a few, and will be providing more details about shows we’ll be at in future posts. If you’re going to any of these – do drop by the stand and say hello, as we’d love to speak to you and get your thoughts."
        },
        {
            "text": "Look out for us in our Defra green tops (which I'm sporting below) at our stand with the big \"Farming is Changing\" banners."
        },
        {
            "text": "Get involved in our co-design activity and don't forget to subscribe to the Future Farming Blog."
        }
    ]
}