{
    "url": "https://teaching.blog.gov.uk/2020/05/19/leading-by-laptop-flexible-working-is-happening-in-every-school-right-now-what-can-we-learn-from-this-experience/",
    "title": "Leading by laptop: flexible working is happening in every school right now – what can we learn from this experience?",
    "authors": [
        "Sue Plant"
    ],
    "categories": [
        "COVID-19 support",
        "Flexible working",
        "School leadership",
        "Secondary schools",
        "Teacher mental health",
        "Teacher wellbeing"
    ],
    "pub_date": "2020-05-19T15:17:20+01:00",
    "content": [
        {
            "text": "Sue Plant is Head of School at John Taylor Free School in Staffordshire. She’s long been a champion of flexible working, and now reflects on the lessons school leaders might learn from navigating the COVID-19 outbreak."
        },
        {
            "text": "Leading by laptop is definitely not my style. I am a people person. Until last month, I only sent emails when absolutely necessary and held meetings when essential information had to be shared. I would much rather pop into someone’s classroom for a quick chat, speak to them over the table at lunchtime or in the corridor. It is so easy to say “Yes I am fine thanks” in an email; so much harder to look someone in the eye when you’re feeling terrible and say the same thing."
        },
        {
            "text": "In today’s world, we have had to adapt, to change, be flexible and resilient. The hardest of all the ethical leadership values for me to role model has been optimism – how do you exude hope and optimism when the world around you is gloomy and dark?"
        },
        {
            "text": "I would describe myself as a resilient person and one who is eternally optimistic so here, I draw on my experience and think about the positives of leading from a laptop."
        },
        {
            "heading": 2,
            "text": "Finding work/life balance through flexibility"
        },
        {
            "text": "I have long since been a champion of flexible working. Roles within my school are advertised with the line “applications are welcome from candidates who want to work flexibly”. Now more than ever, teachers are working creatively and flexibly and this should be celebrated. Most recently, the online meetings I have organised are scheduled carefully so that staff can juggle the rest of their life as well as contribute to the meeting."
        },
        {
            "text": "Leading from a laptop means that we need to know which of our staff have very young children, and who is looking after elderly or vulnerable parents. It’s up to me to know who is struggling emotionally with the uncertain world and who is in a position where their partner could be made redundant. When you are face to face with your colleagues, this is often easier to do. Long distance remote working is very difficult to do. But in these uncertain times it is absolutely essential that we make time to know our colleagues well. One of the positives from this situation is the honesty and trust that has developed from some really difficult conversations. The team know that I am on their side, I have their back and trust them to do their job."
        },
        {
            "text": "We have to appreciate that not everyone is available all of the time. My own children are 13 and 15 and very independent. However, there were days last week when I moved from staff recruitment, to helping with geography homework, from school budgets to science homework, equations to school risk assessments, recovery planning and it goes on…  We all have our own challenges and as a leader we must be flexible and adaptable enough to respond to the needs of our staff. Constant communication, respect for others and trust are the key ingredients to making this work."
        },
        {
            "heading": 2,
            "text": "Making the technology work for you"
        },
        {
            "text": "We have used Microsoft 365 as a way of ensuring effective communication. Schemes of learning are planned collaboratively on SharePoint, Teams allows us to chat, discuss and share documents within and between subjects. All remote learning is set on Go4Schools so that students and their parents are all seeing the same resources and the same instructions – this keeps the message consistent and clear.  Meetings take place via Teams so that face to face communication isn’t lost. We have even planned a virtual staff Friday night social so that people don’t feel isolated! Sometimes you just need a glass of something and a good natter, even if it is through a computer screen."
        },
        {
            "text": "Line managers check in with their colleagues to see how they are doing and if any support is required. This is a check in not a check up – we are trusting staff to do their job. It may be in a different way and sometimes at a different time, but I know my colleagues are doing their best to support each other and their students."
        },
        {
            "heading": 2,
            "text": "So, what should remain and what is a temporary measure?"
        },
        {
            "text": "I would hope to see flexibility, online communication, and increased trust remain once this current period changes once more. These 3 elements will support all our colleagues, but for those who don’t want to work a traditional 5-day week it has demonstrated that there is another way. I think we have shown that some meetings can be just as purposeful and effective via Teams or Zoom, that work can be completed at various times and still be high quality, that collaboration is better than working in isolation, whatever the means of sharing. However, the continuous lack of face to face human contact I sincerely hope is a temporary measure – at times, there is no substitute for an individual conversation when you’re both in the same room and not separated by a screen."
        },
        {
            "text": "Leading by laptop – it can be done but I cannot wait to lead in person once again."
        },
        {
            "heading": 2,
            "text": "Looking for flexible working support?"
        },
        {
            "text": "To support school leaders to offer effective flexible working options, the DfE has published guidance, case studies, and resources. "
        },
        {
            "text": "Schools can also access the interim results of a research project on flexible working in schools here. We will publish further support later in the year."
        }
    ]
}