{
    "url": "https://technology.blog.gov.uk/2026/02/06/celebrating-one-year-of-the-cross-government-low-code-community-a-people-first-approach/",
    "title": "Celebrating one year of the cross-government low code community: a people-first approach",
    "authors": [
        "Katherine Bhambra, Senior Content Designer, GDS"
    ],
    "categories": [
        "Technology",
        "Tools",
        "Transformation"
    ],
    "pub_date": "2026-02-06T11:01:00+00:00",
    "content": [
        {
            "text": "Five years ago, a handful of individuals across government started chatting about the challenges we faced with low code tools. What began as informal conversations which were often sparked by questions such as ‘does anyone know how to do this?’, grew organically into a vibrant, grassroots community focused on sharing best practice and lessons learnt.  "
        },
        {
            "text": "Today, our low code community is nearly 700 strong, and spans a wide landscape of departments, agencies, and roles. One year ago, we launched our community page in the GOV.UK Service Manual, so now is a good time to reflect on past successes and future challenges for the community.  "
        },
        {
            "heading": 2,
            "text": "What is low code, and why does it matter? "
        },
        {
            "text": "Low code is a way of building digital services and applications using visual tools and minimal manual coding. It allows people to create and adapt software quickly, through drag-and-drop interfaces or configuration rather than traditional programming. This makes it especially suitable for people from a non-IT background. "
        },
        {
            "text": "The technology is constantly evolving, and over the past couple of years, AI has taken low-code platforms to a new level. Natural language can now be used to suggest designs, and even generate apps and workflows automatically, which lowers the barrier to entry for aspiring developers. "
        },
        {
            "text": "The low code approach is especially useful in government, where teams need to respond quickly to changing user needs, policy updates and operational challenges. It also supports the plans set out in the blueprint for modern digital government by helping with joined-up public services and replicable processes. "
        },
        {
            "text": "Low code platforms themselves can offer a range benefits, including: "
        },
        {
            "text": "By making development more accessible, low code helps us to more efficiently build better services for our users.  "
        },
        {
            "heading": 2,
            "text": "A grassroots movement with strong foundations "
        },
        {
            "text": "The low code community has been around for over five years, operating as separate grassroots groups. We made the decision to merge last year to form a single cross government community called xGov low code. "
        },
        {
            "text": "Our members range from complete beginners to experienced low code developers. We encourage anyone in the public sector with an interest in problem-solving to join, as we benefit from having as wide and diverse a pool of experience as possible.  "
        },
        {
            "text": "More than anything, we’re proud of our inclusivity and openness. You don't need to be an expert to join in as our members range from those just starting out to those leading automation in their organisations. We help each other, share what works, what doesn’t, and celebrate the small wins, such as someone building their first flow or finding a workaround that saves hours of manual work.  "
        },
        {
            "heading": 2,
            "text": "Identifying our aims"
        },
        {
            "text": "Our community isn’t about polished best practice or endorsing strategy from the top down. We came together because we needed practical answers and a place to learn from each other. There are no barriers, just a shared belief that anyone in the public sector can build, experiment, and solve problems with the right support. "
        },
        {
            "text": "We use low code tools to help people across government turn ideas into impact, whether that’s by streamlining a personal task, or deploying a scalable digital service. Our aim is to make low code accessible, collaborative, and human-focused. "
        },
        {
            "text": "Together, we’ve identified the most important objectives for the community. These are to: "
        },
        {
            "heading": 2,
            "text": "Successes and the year ahead"
        },
        {
            "text": "This year has been full of activity and progress. We held our first in-person community conference at the Microsoft campus in Reading to bring together our members to share ideas and learn from each other. We also ran a successful low code workshop in London in September. "
        },
        {
            "text": "In the last year, we’ve launched two major community projects. The first is a shared GitHub repository to promote collaboration and reuse, and the second is focused on low code standards and best practice. Both projects aim to share our experiences so that government organisations at the beginning of their low code journey can build on what’s already been done, rather than starting from scratch.  "
        },
        {
            "text": "We run weekly virtual sessions and use our Teams channel to help solve problems and share updates. Our weekly content includes demonstrations of low-code solutions, technical deep dives, a ‘Low Code for Beginners’ track and regular guest speakers on topics such as governance, good design and accessibility. We’re also passionate about automating the processes needed to run a large community, so as to be exemplars of our own automation approach! "
        },
        {
            "text": "Our plans are even more ambitious for 2026. We’ll continue work on our shared repository as well as sharing solutions, code and best practice. We also hope to organize and attend more in-person events, such as Civil Service Live, so that we can reach more departments. We want to make it easier for people across government to get involved with low code and to benefit from the experience and support of others. "
        },
        {
            "heading": 2,
            "text": "Join us"
        },
        {
            "text": "If you work in government and are interested in low code, you’re welcome to join our community. Whether you’re just starting out or have years of experience, you can become a member by completing this form. "
        },
        {
            "text": "Alternatively, you can contact the low code community committee by emailing xgovlowcode@ics.gov.uk. "
        }
    ]
}