{
    "url": "https://mhclgmedia.blog.gov.uk/2026/02/06/coverage-of-pride-in-place-expansion-announcement/",
    "title": "Coverage of Pride in Place expansion announcement ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Local government",
        "Uncategorized"
    ],
    "pub_date": "2026-02-06T15:50:26+00:00",
    "content": [
        {
            "text": "There has been some national and local media coverage of a major expansion of the Pride in Place scheme, announced by the government yesterday.  "
        },
        {
            "text": "The new package is worth up to £800 million, allowing 40 new areas across England to decide where to invest £20 million in their neighbourhood, whether that is rejuvenating their high streets, restoring community spaces, or launching local events.  "
        },
        {
            "text": "The Secretary of State was on the morning round to discuss the announcement on location in Hastings and was interviewed by Times Radio, Sky News, BBC Breakfast, LBC, ITV’s Good Morning Britain, and GB News,  and the announcement was referenced by the Prime Minister in his speech. "
        },
        {
            "text": "There has been further coverage on BBC South East Today, BBC PoliticsLive, BBC News, The Sun, Sky News, LocalGov, SME Magazine and regional publications like EastSussexNews  "
        },
        {
            "text": "There was also radio reporting nationally on BBC Radio 5 Live, Radio 4, Radio 2 and LBC News as well as regional coverage on BBC Stoke, BBC Wiltshire, BBC Sussex, BBC Kent and BBC Cornwall which referenced the announcement and the wider programme.  "
        },
        {
            "text": "Communities Secretary Steve Reed said: “Pride in Place is about giving power to local people who know best what needs to change in their area. "
        },
        {
            "text": "“The ambitious plans we’re seeing take shape in communities across the country is proof that when you give local people the tools to do the job – things get better.” "
        },
        {
            "text": "More details can be found here: Pride in Place: 40 neighbourhoods join transformational programme - GOV.UK. "
        }
    ]
}