{
    "url": "https://defradigital.blog.gov.uk/2026/02/06/defras-t-level-pilot-investing-in-young-people-and-building-digital-capability-in-government/",
    "title": "Defra’s T Level pilot: investing in young people and building digital capability in government",
    "authors": [
        "Hermionie Blake"
    ],
    "categories": [
        "Careers in Digital",
        "Learning and Development"
    ],
    "pub_date": "2026-02-06T15:21:51+00:00",
    "content": [
        {
            "text": "By Hermione Blake and Zoe Whitfield"
        },
        {
            "text": "Over the past few months, we’ve been running a T Level pilot programme in partnership with Newcastle College, and we’re incredibly proud of the role the programme has been able to play in developing the next generation of digital professionals. We’ve welcomed a group of enthusiastic students, aged 17 to 19, into our Digital, Data, Technology and Security team, and given them hands on experience of real projects that support Defra’s mission and wider government priorities. It’s been great to see them explore, contribute and grow. "
        },
        {
            "heading": 2,
            "text": "Experience different digital roles"
        },
        {
            "text": "After a busy 2 week induction, they rotated through areas such as user research, architecture, business analysis, and content design. Their placement will finish with a challenge: designing a digital service that allows users to apply for a wind turbine grant. It’s an ambitious brief, but they’ve already shown they’re more than up to it.This pilot is a brilliant way to showcase the breadth of digital roles within Defra, and to help young people understand the technologies and approaches we use every day. Our hope is that we’re not only giving them valuable experience – we’re also inspiring them to consider careers in the Civil Service.We are passionate about making Defra a diverse, inclusive, and supportive place to work. Through this pilot, we’ve offered opportunities to students from a range of backgrounds, helping them feel welcome, valued and hopefully more confident about their futures. Many have told us that the experience has helped challenge the idea that the Civil Service isn’t for “people like them” – and that’s something we hope we can help change for good through this programme."
        },
        {
            "heading": 2,
            "text": "Supporting government goals"
        },
        {
            "text": "This pilot directly supports key government priorities, including:"
        },
        {
            "text": "We’ve also strengthened relationships with education providers and industry partners along the way. By working together, we’re helping bridge the gap between classroom learning and real world digital delivery. At a time when many young people are navigating a competitive jobs market and have reduced access to early career opportunities, programmes like this are really important, and it’s something we will look to repeat given the success we’ve had with this pilot. "
        }
    ]
}