{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2026/02/06/national-apprenticeship-week-2026-apprentice-to-crisis-management-lead/",
    "title": "National Apprenticeship Week 2026 -  Apprentice to Crisis Management Lead ",
    "authors": [
        "gseprofession",
        "Sue Richards"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Learning & Development"
    ],
    "pub_date": "2026-02-06T11:29:47+00:00",
    "content": [
        {
            "text": "Sue Richards – Crisis Management Lead and Chartered Engineer and Member of the Institution of Engineering and Technology (CEng MIET) "
        },
        {
            "text": "For National Apprenticeship Week 2026, Sue Richards, Crisis Management Lead for Ofgem, started her career as an apprentice and strongly supports alternative pathways into engineering and the Civil Service. Sue explains the benefits of learning and earning. "
        },
        {
            "text": "Starting out: the apprenticeship advantage"
        },
        {
            "text": "I started my career as an apprentice and am a huge advocate for anyone joining the Engineering Profession via that route. I am well known for championing different routes into the profession and into the Civil Service."
        },
        {
            "text": "For me, the apprenticeship route suited my learning needs and my drive to be learning and earning. I have never lost sight of what an amazing, solid foundation an apprenticeship has given me."
        },
        {
            "text": "Networking and career opportunities"
        },
        {
            "text": "Networking opportunities – As an apprentice, I got to meet so many different people in the industries that I worked in, meet great people and make friends and contacts for life. It is a great way to really see how an organisation works and the people who make that happen."
        },
        {
            "text": "Career opportunities – As part of my apprenticeship, my placements took me to areas of work and inspired my creativity that I would never have found left to my own devices. As a result, I have worked for great organisations and delivered some high-profile projects in Great Britain."
        },
        {
            "text": "Building confidence and achievement"
        },
        {
            "text": "Learning that there is no limit – The fostering environment of an apprenticeship, really helped me with my confidence and self-belief. I have been able to use the great foundation of my apprenticeship to build a career I am proud of and there is no limit to what you can achieve! Including becoming a Chartered Engineer."
        },
        {
            "text": "Today: making an impact"
        },
        {
            "text": "And now… now I work as the Crisis Management Lead for Ofgem and get to support some of the most vulnerable consumers at the most important time when they need our support. I am also helping shape the future policy of how we will use the energy system in the mission to deliver Net Zero."
        },
        {
            "text": "Find out more about the Government Science and Engineering (GSE) profession!  "
        },
        {
            "text": "Visit the Government Science and Engineering careers website to explore the diverse expertise shaping government.  "
        }
    ]
}