{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2026/02/06/national-apprenticeship-week-2026-from-apprentice-to-leader-a-42-year-journey-in-engineering/",
    "title": "National Apprenticeship Week 2026 - From Apprentice to Leader: A 42-year journey in engineering.  ",
    "authors": [
        "gseprofession",
        "Nick Jones"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Learning & Development"
    ],
    "pub_date": "2026-02-06T11:21:56+00:00",
    "content": [
        {
            "text": "Nick Jones - Engineering People Coach, Defence Equipment & Support (DE&S) Ministry of Defence"
        },
        {
            "text": "For National Apprenticeship Week 2026, Nick Jones, [Engineering People Coach, Defence Equipment & Support (DE&S) Ministry of Defence] outlines how an apprenticeship can open doors you never imagined- shaping not just a career, but a mindset for lifelong learning and leadership. "
        },
        {
            "text": "Starting out: learning the how and the why"
        },
        {
            "text": "I remember starting my apprenticeship at the Royal Naval Aircraft Yard Fleetlands as if it was yesterday, surprising now that I'm almost 42 years into my career. As a 16-year-old with imposter syndrome daunted by my peer group, overwhelmed by the types of aircraft that I was expected to work on and understand in detail, I would never have guessed that I would have travelled the world. I didn’t think I’d work with such amazing people, experience incredible moments that remain unforgettable. Then within Defence, be responsible, as a Project Manager then a Chief Engineer, and latterly Deputy Head for the DE&S Airworthiness Team. When I look at my peer group now, all of whom are successful professionals, my reflection on the training we received as young adults is that it not only taught the basics (the how) but taught us to really understand 'the why'. Of course, all apprenticeships teach you that, but it's not until later in life when you appreciate that trained inquisitiveness becomes your superpower when looking for better outcomes or improvements to products and services."
        },
        {
            "text": "Building a career: from experience to Chartered Engineer"
        },
        {
            "text": "Those early years formed the foundation of experiences that supported my journey in becoming a Chartered Engineer, especially as one who has stepped through the experiential route proving that academic achievement is just another path to success. As one of many mentors within our department, I volunteer to support the Engineering Apprentice and Graduate programmes, with the aim of helping them gain not just the developmental opportunities for becoming the future Chief Engineers but understanding why we do the things we do. And of course, hopefully some of those exciting, ‘money can’t buy’ experiences that only Defence can offer."
        },
        {
            "text": "Giving back: mentoring, coaching, and lifelong learning"
        },
        {
            "text": "I took a step into the unknown earlier this year to become a People Coach within DE&S, with a job title that includes the words ‘Human Resources’, those skills learnt as an apprentice are just as relevant now. Helping colleagues where I can, demystify requirements to determine intent, challenge when appropriate, simplify and mature activity to make work achievable, all whilst continuing to learn, are things that fortunately for myself come relatively naturally. If you’re starting your career or thinking about mentoring, take that step - you never know where it might lead. When does that apprenticeship stop; possibly never, that’s the fun part. What would be really fun is to go back to my roots, get my overalls on then go and get my hands dirty, I miss that!"
        },
        {
            "text": "Find out more about the Government Science and Engineering (GSE) profession!  "
        },
        {
            "text": "Visit the Government Science and Engineering careers website to explore the diverse expertise shaping government.  "
        }
    ]
}