{
    "url": "https://ukhsa.blog.gov.uk/2026/02/06/stomach-bugs-a-brief-guide-to-their-causes-and-treatment/",
    "title": "Stomach bugs: A brief guide to their causes and treatment",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health and Wellbeing"
    ],
    "pub_date": "2026-02-06T18:27:36+01:00",
    "content": [
        {
            "text": "Gastrointestinal illness - the kind of illness that makes us feel sick, vomit or have diarrhoea - affects people of all ages and is one of the most common health complaints in the United Kingdom. It is also one of the most common health issues that people experience when travelling abroad."
        },
        {
            "text": "While diarrhoea and vomiting are typically short-lived, they can be serious for some. Understanding their causes can help you take appropriate steps to protect yourself and your family."
        },
        {
            "heading": 2,
            "text": "Viral infections"
        },
        {
            "text": "Viruses are one of the most common causes of gastrointestinal illness, spreading easily in environments where individuals have close contact, such as hospitals, care homes, schools and nurseries."
        },
        {
            "text": "Norovirus is perhaps the most widely recognised cause, commonly known as the ‘winter vomiting bug’, although infections can occur at any point in the year. The virus is mostly spread person to person but can also be spread by contaminated food or water. It is possible to catch norovirus more than once within a short period, as multiple strains circulate at any given time. The incubation period, which is the time between catching an illness and showing symptoms, is typically 12 to 48 hours. Most people recover after a few days’ rest, but vulnerable groups are at risk of complications including dehydration, which can cause hospitalisation."
        },
        {
            "text": "Rotavirus is the most common cause of gastroenteritis in infants and very young children, producing severe watery diarrhoea alongside vomiting, fever and stomach cramps. Since the introduction of the rotavirus vaccine to the national vaccination schedule in 2013, the incidence among infants has declined considerably. Infants receive 2 doses at 8 and 16 weeks of age."
        },
        {
            "text": "Adenovirus is a group of viruses that usually cause symptoms like a common cold but can cause various infections including gastroenteritis. It does not follow a seasonal pattern and infections may occur at any time of year. Although most common in infants and young children, individuals of any age may be affected. Symptoms are generally mild, though infections can prove more severe in those with weakened immune systems."
        },
        {
            "heading": 2,
            "text": "Bacterial infections"
        },
        {
            "text": "Bacteria are another significant cause of gastrointestinal illness, frequently associated with food poisoning. Illness caused by a bacterial infection typically lasts longer than that due to a virus."
        },
        {
            "text": "Campylobacter are the most common bacterial causes of food poisoning globally. You typically catch the infection from raw or undercooked meat (particularly poultry), unpasteurised milk, or untreated water. Poor hygiene during food preparation can cause it to spread through cross-contamination, and it is also passed on through contact with an infected animal or its environment, for example pets suffering from diarrhoea. The incubation period is generally 2 to 5 days."
        },
        {
            "text": "Shigella can cause severe diarrhoea (which is sometimes bloody), fever and stomach cramps. Transmission occurs through contact with contaminated poo, either directly from person to person, or indirectly through contaminated food, water or surfaces. Travellers to regions with inadequate sanitation face particular risk, although it is present in the UK. Globally, most cases of shigellosis are in children younger than 5 years of age, but all ages can be affected. There is also a risk of Shigella transmission through sexual contact, which is more likely among men who have sex with men. "
        },
        {
            "text": "Salmonella may be present in eggs, chicken, pork and dairy products, as well as fruit and vegetables that have come into contact with livestock, manure or untreated water. Symptoms including diarrhoea, stomach cramps, nausea, vomiting and fever typically develop in the 12 to 72 hours following infection. The illness usually persists for 4 to 7 days."
        },
        {
            "text": "E. coli (Escherichia coli) bacteria are commonly found in the intestines of humans and animals. While many strains exist harmlessly in the digestive system, others may cause infections, including gastrointestinal illness. The bacterium is present in poo and can survive in the environment."
        },
        {
            "text": "STEC (Shiga toxin-producing Escherichia coli) can cause diarrhoea, often bloody, with abdominal pain. In some cases, particularly in young children and older adults, infection can lead to haemolytic uraemic syndrome (HUS), a serious kidney complication. Spread mostly occurs through contaminated food, water and contact with farm animals. Common food sources may include undercooked minced beef, unpasteurised milk and dairy products, and raw leafy greens."
        },
        {
            "heading": 2,
            "text": "Parasitic infections"
        },
        {
            "text": "Cryptosporidium is a microscopic parasite responsible for an illness known as cryptosporidiosis. This organism lives in the intestines of infected humans and animals and often spreads through contaminated drinking water and other water sources such as swimming pools, lakes and rivers, as well as through raw milk and vegetables. Children under 5 years are particularly susceptible, with infections often associated with animal contact at petting farms or lambing events."
        },
        {
            "heading": 2,
            "text": "Treatment and management"
        },
        {
            "text": "Diarrhoea and vomiting can typically be managed at home. The primary concern is ensuring you take in enough fluids to prevent dehydration."
        },
        {
            "text": "Recommended actions:"
        },
        {
            "text": "Actions to avoid:"
        },
        {
            "text": "Diarrhoea typically resolves within 5 to 7 days, while vomiting usually stops within 1 to 2 days. Seek healthcare advice if symptoms continue after this or you experience severe illness."
        },
        {
            "text": "Individuals should consult a pharmacist if they or their child show signs of dehydration, such as dark-coloured urine or reduced urination frequency. Pharmacists may recommend oral rehydration solutions or, for adults, temporary anti-diarrhoeal medication."
        },
        {
            "heading": 2,
            "text": "How to prevent spreading a stomach bug"
        },
        {
            "text": "To prevent transmission of a viral or bacterial infection:"
        }
    ]
}