{
    "url": "https://skillsengland.blog.gov.uk/2026/02/06/strengthening-assessment-without-compromising-quality-by-carmel-grant/",
    "title": "Strengthening assessment without compromising quality, by Carmel Grant",
    "authors": [
        "Skills England Communications"
    ],
    "categories": [
        "Apprenticeship assessment",
        "News and announcements"
    ],
    "pub_date": "2026-02-06T12:34:20+00:00",
    "content": [
        {
            "text": "In our December 2025 blog, Deputy Chief Executive Gemma Marsh set out why apprenticeship assessment reform matters – we explained how simplifying and strengthening assessment can better serve apprentices, employers and the wider skills system."
        },
        {
            "text": "Since then, we’ve moved into the first phase of implementation, working closely with employer sector experts, assessment organisations and training providers to get the new assessment plans right."
        },
        {
            "text": "Delivery experience shows that there is an opportunity to strengthen assessment by making it clearer and more proportionate, while continuing to provide strong assurance of competence. A more streamlined approach can maintain high quality and reinforce confidence that apprentices are fully occupationally competent."
        },
        {
            "text": "The reforms give us the flexibility to make these improvements – but assessment cannot be designed to a one-size-fits-all approach. Apprenticeships span very different occupations, levels of risk and professional expectations. What works for one standard will not work for all."
        },
        {
            "text": "Our approach is therefore deliberately flexible – proportionate where it can be, rigorous where it must be, and always grounded in sector expertise and employer confidence."
        },
        {
            "text": "In this update, I want to share what we’re hearing, what we’ve achieved so far and what comes next."
        },
        {
            "heading": 2,
            "text": "We are listening to your concerns"
        },
        {
            "text": "Last year, we deliberately selected a small number of apprenticeships to test the assessment reform process. These standards were chosen to surface risks and reflect different sector characteristics."
        },
        {
            "text": "As intended, the tests generated valuable learning – including strong messages about the importance of protecting quality and employer confidence."
        },
        {
            "text": "While many employers and apprentices support more proportionate assessment, they have been equally clear that change must be handled carefully. This means working in full partnership with employers, ensuring assessments demonstrate full occupational competence, and maintaining rigour – particularly in safety-critical roles."
        },
        {
            "text": "We have heard clear asks to:"
        },
        {
            "text": "We have also heard concerns about pace. We are committed to delivering reform so benefits are realised as early as possible – but we are equally committed to taking the time needed to get this right."
        },
        {
            "heading": 2,
            "text": "Progress so far - working with sector experts"
        },
        {
            "text": "In December, we published the first 93 standards selected for assessment plan reform. Since then, we’ve been working with stakeholders to revise these plans, and this work will continue over the coming months as we update all assessment plans."
        },
        {
            "text": "Once approved, revised plans will be published on individual standard pages on the Skills England Apprenticeship Finder. A full list of approved and published revised plans is also available via the Revisions and Adjustments status report, which includes revised plans we are publishing today, with thanks to our external panels for their expert contributions. "
        },
        {
            "text": "Where revised plans have been published but are not yet available for delivery, current end-point assessment plans remain in place. Information banners on the Apprenticeship Finder will make clear when apprentices can begin assessment under the new arrangements."
        },
        {
            "heading": 2,
            "text": "Construction and safety-critical sectors"
        },
        {
            "text": "During the testing phase, construction employers told us they are working hard to meet workforce competence expectations set by the Building Safety Regulator. Following the Grenfell tragedy, there is rightly a renewed focus on rigour and safe practice."
        },
        {
            "text": "In response, we are working with a dedicated construction taskforce to ensure sector-specific needs are fully reflected. We will take a similar approach in other sectors where risks and regulatory requirements demand it."
        },
        {
            "text": "This is a clear example of how we are adapting our approach in response to what employers have told us."
        },
        {
            "heading": 2,
            "text": "Making a positive difference"
        },
        {
            "text": "Alongside challenge, we have also heard strong support for the reforms and the difference they can make."
        },
        {
            "text": "Shelley Jeffery FIA C.Act, Head of Pensions Operations, The Core, XPS Group"
        },
        {
            "text": "Maurice Porter, Head of Learning, Development & Apprenticeships, HepcoMotion"
        },
        {
            "text": "Lydia Wright, Managing Director, Little Pearls Nursery"
        },
        {
            "heading": 2,
            "text": "How to get involved "
        },
        {
            "text": "We recognise there are a range of views on assessment reform, and we value all feedback. That’s why we run apprenticeship assessment surveys on plans in development."
        },
        {
            "text": "To be notified when a survey is released, email submissionsurvey.skillsengland@education.gov.uk with the standard and route you’re interested in."
        },
        {
            "text": "For general queries, contact apprenticeshipassessment.skillsengland@education.gov.uk."
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "Today, we have updated the Revisions and Adjustments status report with further standards scheduled for assessment plan revision. The report will be updated regularly, and you can subscribe to receive email alerts."
        },
        {
            "text": "Next steps include:"
        },
        {
            "text": "Carmel Grant"
        },
        {
            "text": "Deputy Director, Skills England"
        }
    ]
}