{
    "url": "https://nationalscreening.blog.gov.uk/2026/02/06/uk-nsc-stakeholder-engagement-strategy-updated/",
    "title": "UK NSC stakeholder engagement strategy updated",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2026-02-06T07:56:11+00:00",
    "content": [
        {
            "text": "Today we have published the updated UK NSC stakeholder engagement strategy after conducting a comprehensive review in 2025."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "The UK National Screening Committee (UK NSC) could not do its work without drawing on the research, expertise, opinions, and experiences of a wide range of individuals and organisations, including:"
        },
        {
            "text": "Effective engagement with these stakeholders helps the UK NSC make informed, evidence-based, practicable recommendations and keep up to date with developments on screening topics."
        },
        {
            "text": "The UK NSC first published its stakeholder engagement strategy in 2022 following a recommendation from the UK’s 4 chief medical officers (Recommendation 6a of CMOs’ recommendations for the expanded remit of the UK NSC published with the minutes of the March 2022 UK NSC meeting)."
        },
        {
            "heading": 2,
            "text": "Review findings"
        },
        {
            "text": "Last year, the secretariat that supports the UK NSC carried out a thorough review of the strategy and associated stakeholder engagement activities."
        },
        {
            "text": "This review included an online survey and 3 focused discussion groups in which stakeholders provided a wealth of valuable insights."
        },
        {
            "text": "There was praise for the UK NSC’s evidence-based approach and processes while concerns were raised on the themes of:"
        },
        {
            "text": "Stakeholder feedback also highlighted common misunderstandings about the UK NSC’s role and remit, as well as when and how it needs to engage with stakeholders during evidence review processes."
        },
        {
            "heading": 2,
            "text": "How we are responding"
        },
        {
            "text": "Analysis of the feedback received from stakeholders, and from patient and public voice (PPV) members of the UK NSC and its expert groups, highlighted ways in which we could enhance the strategy and engagement activities."
        },
        {
            "text": "The UK NSC’s updated stakeholder engagement strategy more clearly explains how and when the committee engages with stakeholders to optimise their input."
        },
        {
            "text": "Other steps we are taking to improve the way we communicate with stakeholders include:"
        },
        {
            "text": "We will you keep you updated on all these activities via this blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}