{
    "url": "https://naturalengland.blog.gov.uk/2025/02/03/green-infrastructure-the-catalyst-for-urban-greening/",
    "title": "Green Infrastructure: the catalyst for Urban Greening ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Connecting People with Nature",
        "Development",
        "Environmental Improvement Plan",
        "Flood Management",
        "Green Infrastructure",
        "Landscape",
        "Landscapes and access",
        "Local Nature Recovery Strategy (LNRS)",
        "Mapping",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Tree Planting",
        "Wildlife"
    ],
    "pub_date": "2025-02-03T08:05:00+00:00",
    "content": [
        {
            "text": "It’s two years since Natural England launched the Green Infrastructure (GI) Framework to support the creation of good quality Green Infrastructure. It’s well documented that we need to build a more sustainable future, and at the forefront of this movement is the integration of green infrastructure within the pulsating heart of development. Parks, green roofs, rain gardens, and street trees play multiple roles in helping us make our towns and cities fit for the future, for people and for nature. Last August, we mentioned how the GI framework is being used in preparation of GI Strategies in Local Plans and how it was referenced in the consultation on the revisions of the National Planning Policy Framework. In these two years, there has been some significant momentum towards building green arteries in our towns and cities, including: "
        },
        {
            "text": "Embedding GI in Local Plans "
        },
        {
            "text": "National Policy: "
        },
        {
            "text": "The GI Framework is now included within the National Planning Policy Framework in connection with the Golden Rules for Green Belt land release. Inclusion of the GI Framework will help to ensure the Government’s housebuilding target of 1.5 million homes over the next 5 years delivers high-quality places that benefit both people and nature. "
        },
        {
            "text": "International Recognition: "
        },
        {
            "text": "Natural England and the Ministry of Housing Communities and Local Government provided a case study on the GI Framework to a G7 Summit on Sustainable Urban Development in Italy. GI Framework was recognised as an example of good practice.    "
        },
        {
            "text": "Evaluation: "
        },
        {
            "text": "A core focus of the GI team is to continue to build on existing GI products. To help us understand what would be most relevant for our stakeholders, Natural England recently commissioned an evaluation of the GI Framework. We received a wealth of feedback; this is currently being analysed. Here’s a snapshot: "
        },
        {
            "text": "New research  "
        },
        {
            "text": "Natural England collaborated with academics on an academic journal in Frontiers in Environmental Science. The paper describes a draft comprehensive menu of standards for green infrastructure in England, (Developed by Birmingham University with the University of Oxford), which could be used by stakeholders to support application of the Headline Standards and help deliver green space that is accessible, connected, multifunctional, and reflects local character. Natural England will consult on and test the draft Menu with local authorities and other stakeholders over the next year. "
        },
        {
            "text": "GI in action: From Hospital Gardens to City-Wide Strategies "
        },
        {
            "text": "The Landscape Institute’s Winter member magazine focused on the healing power of landscape featuring an article, “Green Infrastructure and the NHS Estate” by Esther Smith, Natural England’s Senior Officer for Health and the Environment for the Northeast and Yorkshire, (see pages 56-57). The article mentions how Natural England Green Infrastructure Planning and Design Guide 2023 has been a useful resource supporting dialogue with NHS partners. "
        },
        {
            "text": "New tools: "
        },
        {
            "text": "In October we updated GI Mapping with new datasets, along with incorporating the Environmental Benefits from Nature Tool, which calculates the likely impact of new developments on local nature, health and wellbeing, and climate resilience.   "
        },
        {
            "text": "We know that we need to go further than providing tools; to help build understanding, Natural England has supported over 121 local authorities and other stakeholders by delivering multiple training webinars. These are freely available on the GI website. We have also provided bespoke support to seventy-four local authorities resulting in improved access to greenspaces, supporting nature recovery, enhancing wellbeing and building resilience to climate change through their Local Plans and GI strategies.    "
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "Natural England is working in partnership with the National Trust and The National Lottery Heritage Fund on the Nature Towns and Cities Programme. This initiative is designed to support towns and cities to deliver greener, fairer, healthier and more connected neighbourhoods so millions more people can enjoy nature close to home. Last year the programme launched the expressions of interest for the grant element and started to build the network.  "
        },
        {
            "text": "We have been working behind the scenes to build and test the accreditation criteria which will be piloted in England. The Nature Towns and Cities accreditation scheme will recognise and reward places that are working to place nature and green infrastructure at the heart of decision-making in towns and cities, for the benefit of people, place, nature, and climate. The accreditation scheme will align closely to the Green Infrastructure Framework and Standards. For more information visit the NTAC website or watch last week’s accreditation webinar to find out more.  "
        },
        {
            "text": "Delivering at every scale, from a hospital or community garden to influencing national policy, the GI Framework provides practical tools for building nature and climate resilience, and much-needed green space for our increasingly urban population. "
        }
    ]
}