{
    "url": "https://mattersoftesting.blog.gov.uk/how-were-combating-fraud-and-error-within-the-mot/",
    "title": "How we’re combating fraud and error within the MOT",
    "authors": [
        "Chris Price"
    ],
    "categories": [
        "Changes to the MOT test",
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2025-02-03T14:57:07+00:00",
    "content": [
        {
            "text": "When we set out our strategy in 2023 for the next few years, combating fraud and making it easier to identify and support those getting things wrong was one of the key areas we looked at. Connected equipment has been a part of that – as will other initiatives in the future. Much of our recent focus has been on how capturing photos at the time of a test can play its part.  "
        },
        {
            "text": "Whilst it’s only a small number of testers who bring disrepute to the industry by committing fraudulent MOTs, it does happen, and this undermines the important work the rest of you do every day to keep vehicles safe. And of course, even errors at the test – even though not deliberate – can cause issues for motorists. For example where MOTs may be logged against the wrong vehicle.  "
        },
        {
            "text": "We want to create a level playing field for all, where high quality is the default, and the scourge of fraudulent or substandard testing is minimised. Of course, there is no one thing that will achieve that – but we believe that having a photo at test could be a really helpful enabler.  "
        },
        {
            "heading": 2,
            "text": "Taking photos in garages "
        },
        {
            "text": "Some of you might remember, or have been part of, the original trials to see how capturing photos of the vehicle during the test might work. We’d hoped to integrate this into the service last year, but came across a few issues that we needed to solve first – hence more trials with much to work through!"
        },
        {
            "text": "We’ve been able to look again and simplify how this could work to make it more safe and secure, and also easy for you all to use. We’ve moved away from capturing just the number plate and recording that in MTS, and instead we want to get a photo of the whole vehicle in the testing bay."
        },
        {
            "text": "Our original aim with capturing images of vehicles was to ultimately prevent fraudulent, ghost MOTs happening, and we think this method will be a better way of allowing us to do this.  "
        },
        {
            "text": "Although we’re focusing on the image capture of the whole vehicle right now, we still want to see how we might be able to use technology to interpret the image capture – for example checking the location, the registration plate or vehicle type. However, we are taking this one step at a time – we know many of you found this useful last time, but we want to start with getting the basics working!"
        },
        {
            "heading": 2,
            "text": "How it will work "
        },
        {
            "text": "The new prototype feature will prompt you to take a photo of the vehicle in a testing bay, after you’ve entered the number plate or VIN.  "
        },
        {
            "text": "You will need to do this on a phone or a tablet. You can start the test on a computer, but you will still need to take a photo of the vehicle with a phone or tablet; you won’t be able to do this using a webcam. "
        },
        {
            "text": "The service will give you prompts on how to capture the photo and what we’re looking for. It’ll then be saved against the record, and you’ll be able to carry out the rest of the MOT as normal. You will not be able to upload images stored on your device before or after the test, we only allow images taken from the camera through the MTS at that time. "
        },
        {
            "text": "The prototype feature looks like this. It will then give you advice and examples on what to take a photo of. "
        },
        {
            "heading": 2,
            "text": "Trialling the new changes "
        },
        {
            "text": "Now we’ve redesigned how capturing images will work, we want to go out and trial this new design with as many of you as possible, in different testing set-ups. We’ll then review the feedback and see whether this is something we want to bring into the service for everyone. "
        },
        {
            "text": "If you’d like to help us test this new feature please fill out our form and give us your contact information. If you meet the requirements, a member of the team will be in touch. Whilst we’d like to trial the feature with as many of you as possible, we need to make sure we’re testing features with a broad range of different garages and set-ups, so we will be selecting participating garages on that basis.  "
        },
        {
            "text": "Sign up: https://forms.office.com/e/zgEzns9XQ6"
        },
        {
            "heading": 2,
            "text": "Why this is important "
        },
        {
            "text": "We know ghost MOTs account for nearly 80% of all fraudulent MOTs, making it a clear area for us to tackle. Knowing if a vehicle is where it should be at the time of test should reduce the number of MOTs carried out when the vehicle isn’t present, or isn’t the same vehicle as the details being entered into MTS.  "
        },
        {
            "text": "Potentially, both authorised examiners and DVSA will be able to see the images stored against the test record, and this will help all of us to crack down on fraud. It will enable us to focus our efforts on helping garages do the right thing, but also free up time to focus on those who are not and deal with them accordingly. "
        },
        {
            "heading": 2,
            "text": "Keeping your MTS account secure"
        },
        {
            "text": "Alongside our images in garages work, we also want to focus on keeping the MTS platform as secure as possible and all of us who use the system can help with that. Last year we saw a few MTS accounts compromised because testers had their details hacked.  "
        },
        {
            "text": "We found this was because the testers' email or social accounts, that used the same email and password as MTS, had been hacked, and this information was then used to gain access to MTS. "
        },
        {
            "text": "As we start the new year, I wanted to remind you of some easy things you can do to help keep your account safe and prevent this happening to you.  "
        },
        {
            "heading": 3,
            "text": "Use a strong password"
        },
        {
            "text": "Creating a strong password that doesn’t use easy to guess information like pet names or birth dates is important. It’s a good idea to have a separate password for work purposes too. Multi-factor authentication is also a great way to stay secure – which is where you use another platform or device to confirm it’s you logging into a service.  "
        },
        {
            "text": "We’d encourage you to use a 2FA (two factor authentication) app like google authenticator when logging into MTS so that you don’t need to log into your private email accounts on a shared work computer.  "
        },
        {
            "heading": 3,
            "text": "Stay aware of phishing emails "
        },
        {
            "text": "Phishing emails may appear genuine but are in fact fake. They might try and trick you into revealing sensitive information or contain links to a scam website or an infected attachment. It’s a good idea to keep your personal information private so they can’t make their emails seem as convincing.  "
        },
        {
            "heading": 3,
            "text": "Secure your devices "
        },
        {
            "text": "It might seem obvious, but we know it’s easy to forget to lock your device or log out of things on a shared computer when you’re busy. Not doing so can make it much easier for someone to access your personal information. You are responsible for any information accessed, changed or stored through your log in. "
        },
        {
            "heading": 2,
            "text": "Keeping you updated "
        },
        {
            "text": "We’ll keep you updated on how the trial for  images in garages is going once we’ve rolled it out in the next few months. Your feedback and views will be really important to make sure this works within the test."
        }
    ]
}