{
    "url": "https://defrafmp.blog.gov.uk/2025/02/03/science-and-fmps-event-progress-made-and-exploring-the-future/",
    "title": "Science and FMPs event: progress made and exploring the future",
    "authors": [
        "​​Jennifer Scott - Fisheries Science Advisor, Defra​"
    ],
    "categories": [
        "Bass FMP",
        "Channel demersal non-quota FMP",
        "Cockle FMP",
        "Crab and lobster FMP",
        "King scallop FMP",
        "North Sea and Channel sprat FMP",
        "Queen scallop FMP",
        "Southern North Sea and Channel skates and rays FMP",
        "Southern North Sea and Eastern Channel mixed flatfish FMP",
        "Southern North Sea demersal non-quota FMP",
        "Whelks in English waters FMP"
    ],
    "pub_date": "2025-02-03T10:00:08+00:00",
    "content": [
        {
            "text": "How are fisheries management Plans (FMPs) delivering sustainable fisheries for the UK? What is the role of science, research and collaboration in delivering the evidence that underpins FMPs?  "
        },
        {
            "text": "Find out at our upcoming event: Science and FMPs: progress made and exploring the future   "
        },
        {
            "text": "Join us for an interactive event hosted by Defra that will share updates and insights from different Research & Development (R&D) projects which are currently working to address evidence gaps within the UK’s FMPs.    "
        },
        {
            "text": "Shining a spotlight on the innovative projects and collaborations between scientists, policymakers and fishers, we will highlight the positive outcomes, challenges encountered, and the plans for future research to support FMPs. "
        },
        {
            "heading": 2,
            "text": "Information for your diary "
        },
        {
            "text": "Date: Tuesday 18 March 2025 "
        },
        {
            "text": "Time: 14:00 – 17:30 "
        },
        {
            "text": "Location: Hybrid - Wellcome Collection, London and online "
        },
        {
            "text": "Throughout the event, attendees will have the chance to ask questions, hear from researchers working on FMP related projects, and explore the future direction of collaborative science for FMPs. "
        },
        {
            "heading": 2,
            "text": "To book your spot please sign up here: "
        }
    ]
}