{
    "url": "https://ssac.blog.gov.uk/2025/02/03/the-importance-of-diversity-when-developing-high-quality-advice/",
    "title": "The importance of diversity when developing high quality advice",
    "authors": [
        "Dr Suzy Walton"
    ],
    "categories": [
        "About the Committee",
        "Department for Communities (Northern Ireland)",
        "DWP",
        "HMRC",
        "Independent advice",
        "Legislation"
    ],
    "pub_date": "2025-02-03T09:56:30+00:00",
    "content": [
        {
            "text": "I joined the Social Security Advisory Committee (SSAC) in January 2025 and it is an extremely rewarding role. We get involved in many aspects of the welfare system, not just scrutinising secondary legislation but receiving updates on various aspects of social security. We also do some of our own independent research and you can see some examples of our work on our website. We work not only with the Department for Work and Pensions (DWP) but the Department for Communities in Northern Ireland and HM Revenue and Customs also. You really do feel that you contribute to some important issues."
        },
        {
            "text": "Early in my tenure I went to spend a day at a Job Centre. I was humbled by having the opportunity to see ‘policy in action’ and how the DWP staff interact with claimants at various stages of their journey."
        },
        {
            "text": "I have a background as a former Senior Civil Servant and a board director in many different settings. I do not have a background in the welfare system. However, that has proved to be a strength not a weakness for SSAC. We are a diverse group of people and that is an advantage. We each add value by giving our thoughts and opinions on various issues before us. That means the quality of our work is high as we have truly had input from a whole range of perspectives before we reach recommendations."
        },
        {
            "text": "If you are thinking of applying to become a SSAC member,  I would urge you to give it a go. If you have looked at some of our work on our website and it interests you and you feel your skills map well onto out current gaps – please apply! If you are appointed and you join us you will find it an extremely interesting and rewarding role."
        },
        {
            "text": "One of the best aspects of the role for me is the opportunity to play a part in making sure our welfare and benefits system does not have unintended consequences, and that each new piece of legislation fits in with the bigger picture. We work closely with officials in DWP and sometimes with officials in other government departments. The constructive dialogue we have with officials helps us deliver our recommendations. We meet in London and also virtually and as mentioned above we also have an opportunity to ‘get out of the office’ and see the welfare system in operation."
        },
        {
            "text": "The range of people we assist through our scrutiny of welfare system legislation is very diverse. Hundreds of thousands of people from all walks of life engage with benefits in one way or another. It is an honour and a privilege to work on such an important agenda. Most of all I get a lot of satisfaction from knowing that we are helping to make the system work well – both for the public and the government. If you have an interest in SSAC, do please step forward."
        },
        {
            "text": "More information about SSAC's current vacancies and how to apply can be found here. The closing date for applications is 10 February 2025."
        }
    ]
}