{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/01/07/cmas-digital-markets-unit-exciting-opportunities-to-influence-the-regulation-of-big-tech/",
    "title": "CMA's Digital Markets Unit: exciting opportunities to influence the regulation of big tech",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA",
        "Markets"
    ],
    "pub_date": "2022-01-07T12:59:38+00:00",
    "content": [
        {
            "text": "Digital markets have come to play a central role in our personal, economic and social lives. For many people, this trend has substantially quickened over the last couple of years, as the pandemic has led us to live, work and consume online more than ever before. The large digital firms which dominate these markets influence our lives every day, their algorithms shaping the content, goods and services we choose. These choices also affect thousands of businesses across the UK, which rely on the large digital firms to advertise, distribute and sell. It is therefore crucial that digital markets operate effectively."
        },
        {
            "text": "In recent years it has become apparent that action is needed to meet this aim and the Government is embarking on a programme of reforms to address this. These reforms include the new online safety regime, reforms to data protection law, as well as the new pro-competition regime for digital markets, for which the CMA’s Digital Markets Unit will be responsible. The future regulatory landscape for big tech is one of the biggest challenges facing governments across the globe – now is your chance to join us and play a part in shaping it."
        },
        {
            "text": "The role of the newly created Digital Markets Unit (DMU) is to promote greater competition and innovation in digital markets, in the interests of consumers. It will oversee the most powerful digital firms – those with Strategic Market Status – setting and enforcing a code of conduct as well as implementing pro-competitive interventions like access to data and interoperability to open up greater opportunities for competition and innovation. The DMU is currently operating in shadow form, pending legislation. The government has committed to legislating as soon as Parliamentary time allows."
        },
        {
            "text": "We are currently recruiting for a Director for the DMU, alongside 3 Assistant Directors, 2 Principal Policy Advisers and one Digital Markets Adviser."
        },
        {
            "text": "All roles will provide the opportunity to get involved with a range of different work including:"
        },
        {
            "heading": 2,
            "text": "Why join the Digital Markets Unit?"
        },
        {
            "heading": 2,
            "text": "How can I apply?"
        },
        {
            "text": "Applications must be submitted through the Civil Service jobs page. You just need to submit a CV and a 1 to 2 page personal statement. If you are interested in joining the team, please see the individual Civil Service job pages linked above."
        },
        {
            "text": "The deadline is 11.55pm on Monday 17 January."
        },
        {
            "text": "To help you find out more about the roles and give you a more in-depth understanding of the DMU, CMA and our work, we're hosting an Open house session on Wednesday 12 January at 5pm. To register visit our event page."
        },
        {
            "text": "We look forward to receiving your application!"
        }
    ]
}