{
    "url": "https://educationhub.blog.gov.uk/2022/01/everything-you-need-to-know-about-face-coverings-in-schools-and-colleges-who-must-wear-them-why-theyre-important-and-when-will-they-stop-having-to-wear-them/",
    "title": "Everything you need to know about face coverings in schools and colleges – who must wear them, why they’re important and when will they stop having to wear them",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Colleges",
        "Coronavirus",
        "Primary Schools",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2022-01-07T16:56:13+00:00",
    "content": [
        {
            "text": "To maximise the number of children in school and college, the Government is temporarily recommending that face coverings are worn in classrooms and teaching spaces for pupils and students in year 7 or above, in light of the Omicron variant surge."
        },
        {
            "text": "The advice is short term only to support pupils and teachers as they return to schools this term. It builds on the existing proportionate guidance that recommends face coverings for all adults, as well as pupils and students in year 7 or above, in communal areas of all settings."
        },
        {
            "text": "Here we have outlined everything you may not know about face coverings in schools and colleges."
        },
        {
            "heading": 3,
            "text": "Who has to wear face coverings in class?"
        },
        {
            "text": "All pupils in secondary schools and their teachers unless they are exempt."
        },
        {
            "heading": 3,
            "text": "Ok, where else do they have to wear masks? "
        },
        {
            "text": "In addition to the classroom, face coverings should be worn in communal areas in all settings by staff, visitors and pupils or students in year 7 and above, unless they are exempt."
        },
        {
            "text": "Pupils or students (in year 7 or above) must also continue to wear face coverings on public transport and should wear them on dedicated school transport, unless they are exempt."
        },
        {
            "heading": 3,
            "text": "When don’t they have to wear masks?"
        },
        {
            "text": "Those who are exempt don’t have to wear masks."
        },
        {
            "text": "For children in primary schools, health advice is that under 11s are exempt from wearing face coverings in national guidance – in all settings, including education."
        },
        {
            "text": "There are some additional circumstances where people may not be able to wear a face covering, and schools should be mindful and respectful of such circumstances. Some people are less able to wear face coverings, and the reasons for this may not be visible to others."
        },
        {
            "text": "These circumstances include (but are not limited to):"
        },
        {
            "text": "We also recognise that it’s impractical for pupils to wear them in situations where wearing a face covering would impact on the ability to take part in exercise or strenuous activity, for example in PE lessons."
        },
        {
            "text": "We would not ordinarily expect teachers to wear a face covering in the classroom if they are primarily at the front of the class delivering the lesson, although schools should be sensitive to the needs of individual teachers."
        },
        {
            "heading": 3,
            "text": "Why have you taken this decision now?"
        },
        {
            "text": "We’ve taken this decision on the recommendation of the UK Health Security Agency (UKHSA) and based on a range of evidence."
        },
        {
            "text": "The aim is to maximise in person attendance and minimise disruption for pupils. It’s one of a range of measures that will help protect pupils’ education alongside the vaccination programme, regular testing, ventilation in schools and more."
        },
        {
            "heading": 3,
            "text": "How long will pupils have to wear masks for? "
        },
        {
            "text": "We will review the advice on face coverings on 26 January and will not keep them in place a day longer than is necessary."
        },
        {
            "heading": 3,
            "text": "So what is the evidence you’re basing all this on?"
        },
        {
            "text": "A range of evidence indicates that face coverings can be effective in contributing to reducing transmission of COVID-19 in public and community settings."
        },
        {
            "text": "It’s important to be clear that the evidence we have specifically in education settings is somewhat limited by the fact that face coverings have only been required in classrooms in this country for a short period so far – in September and October 2020. That means the evidence we have is largely not based on studies in English schools."
        },
        {
            "text": "There are, however, a number of scientific studies which consider the association between COVID-19 and the use of face coverings in education settings."
        },
        {
            "text": "A review of evidence conducted by the UKHSA included evidence from studies in schools and summer camp settings. The results were mixed but taken together support the conclusion that the use of face coverings in schools can reduce COVID-19 transmission."
        },
        {
            "text": "There have also been several studies in the United States of America (USA), comparing schools in USA counties with and without mask requirements for students and include two recent studies from the US Centres for Disease Control and Prevention. These studies were excluded from the latest UKHSA review (due to the type of study design or published after the cut-off date) but generally find higher rates of COVID-19 in schools without mask requirements."
        },
        {
            "text": "There are also modelling studies looking at the potential impact of face coverings – for example, assessing impacts in September-October 2020, which suggest that mandating face coverings in secondary schools, in addition to other parts of society, could reduce the number of infections."
        },
        {
            "text": "Our evidence summary is published in detail here: Evidence summary: COVID-19 - children, young people and education settings - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 3,
            "text": "What do the experts say about face coverings in classrooms? "
        },
        {
            "text": "Susan Hopkins, Chief Medical Advisor to the UK Health Security Agency, said:"
        }
    ]
}