{
    "url": "https://educationhub.blog.gov.uk/2022/01/07/universities-minister-michelle-donelan-what-i-wish-i-knew-about-uni-before-i-started/",
    "title": "Universities Minister Michelle Donelan: What I wish I knew about uni before I started",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2022-01-07T16:57:05+00:00",
    "content": [
        {
            "text": "As universities reopen following the Christmas break, Universities Minister Michelle Donelan has been looking at the things she wishes she knew before she started university."
        },
        {
            "text": "She spoke about her thoughts with What I Wish I Knew About University. Here are some of the highlights. You can watch the full video here:"
        },
        {
            "heading": 3,
            "text": "UCAS Deadlines"
        },
        {
            "heading": 4,
            "text": "Once you’ve submitted your UCAS application the main thing to focus on is getting your grades."
        },
        {
            "text": "This is an understandably nerve-wracking time but you should wait to hear back once you submit your application. There’s some useful tips and information on the UCAS website and you can continue to research those institutions you do apply to, so that you are in a more informed position to decide what your first and second choices are. At this stage, the best thing to do is focus on getting those all-important grades to unlock those next steps."
        },
        {
            "heading": 4,
            "text": "Your mental health is important and if you are experiencing any issues or you have any concerns you should include them in your application so that your chosen University can support you. "
        },
        {
            "text": "You’re not alone. A lot of people are probably wondering whether to put down their mental health issues or not. My advice is definitely put this information down as then the University or institution you have chosen is in a good place to look after and support you and provide you with additional reassurance not just for when you start, but beforehand too."
        },
        {
            "text": "The Government has provided additional support to Universities to be able to ensure they can support you too. Universities cannot penalise you for putting down that you have mental health issues. What they can and should do, is let you know about all the different support they can offer you to make sure you have as seamless a transition as possible to university."
        },
        {
            "heading": 4,
            "text": "The Government is backing universities to help students with their mental health."
        },
        {
            "text": "We know that university can be a stressful time for students. For most, it’s the first time they’ve lived away from home and the first time they have had to do things like cooking and laundry whilst having to make new friends. Combined with the pandemic, I sympathise with all young people dealing with mental health problems."
        },
        {
            "text": "We remain committed to helping students and have given £15 million to universities to help them support students transitioning from A-Level or vocational qualifications. We’ve also worked with the Office for Students (OfS), the regulator for all of our higher education institutions in the UK. The OfS set up a body called Student Space, in collaboration with Student Minds. Student Space is an online chat facility, designed to give an additional layer of support for students."
        },
        {
            "text": "We work hand-in-hand with universities to ensure that mental health is at the top of the agenda and that’s something I have made sure is a priority throughout this pandemic. Students should feel that their wellbeing is looked after as that enables them to have a good and fulfilling time at university."
        },
        {
            "heading": 3,
            "text": "Funding"
        },
        {
            "heading": 4,
            "text": "There is support for students to help them pay for key things such as living costs and accommodation if they’re in hardship."
        },
        {
            "text": "Last year the Government gave an additional £85 million to universities to distribute to students in particular hardship. That was on top of an existing £256 million student hardship funds that universities could draw from to help support towards student."
        },
        {
            "text": "Almost all universities have a hardship fund in any given year, so if a student finds themselves struggling, whether it be due to the pandemic or otherwise, I would urge them to go and talk to their university and apply for some hardship funding."
        },
        {
            "text": "There should be no limit on how many times students can apply. The average payment is estimated at about £1,000 so we’re talking about a substantial amount of support that should be available. There should be no stigma in students asking for and getting help when needed."
        },
        {
            "heading": 3,
            "text": "International Issues"
        },
        {
            "heading": 4,
            "text": "Support is there for students who want to study abroad."
        },
        {
            "text": "Earlier this year, we launched The Turing Scheme, which replaces the old Erasmus scheme. The Erasmus scheme was in essence an exchange scheme for students to be able to go across the EU to study for a term or a year."
        },
        {
            "text": "Our Turing Scheme, however, is worldwide and we’ve got 40,000 individuals that will be going or have already gone across the globe. The scheme is particularly focused on helping those students from disadvantaged backgrounds, giving them much more support financially and pastorally to be able to go abroad. We felt these opportunities should be available to everybody, so the scheme is a great success story."
        },
        {
            "text": "Of course, Covid has impacted this scheme a little, with some students having their travel pushed back a term. First of all, I’d say if there are any difficulties, talk to your university and see what else can be done for flexibility."
        },
        {
            "text": "The issue outlined in the question was raised with me and it was an issue to do with the Spanish authorities and their processing of VISAs. Unfortunately, that’s out of our hands as it’s down to the authorities however, the Foreign Commonwealth and Development Office did liaise with them and expediated it as much as they possibly could. We are continuing to monitor this and any other delays. We want to make sure that year on year, we are growing those international opportunities into some of the word’s very best universities so that young people have fantastic options."
        },
        {
            "text": "For further information about the latest Covid updates for University settings, please see: What to expect when schools, colleges, universities and early years settings return after the Christmas break - The Education Hub (blog.gov.uk)."
        }
    ]
}