{
    "url": "https://ipo.blog.gov.uk/2022/10/04/accessibility-matters-to-us-all-at-the-ipo/",
    "title": "Accessibility matters to us all at the IPO ",
    "authors": [
        "Amy Price"
    ],
    "categories": [
        "Digital",
        "Inclusion and diversity",
        "Transformation"
    ],
    "pub_date": "2022-10-04T13:21:24+01:00",
    "content": [
        {
            "text": "Following National Inclusion Week (26 Sep – 2 Oct) it’s now National Dyslexia Week and we’re reflecting on our accessibility progress here at the Intellectual Property Office (IPO)."
        },
        {
            "text": "As I browsed through the archives, I came across a blog written in 2016 by an IPO colleague. In ‘Researching the realms of accessibility’, Sarah describes the brilliant work undertaken with the Digital Accessibility Centre (DAC) ‘to ensure our services are accessible to all our customers’."
        },
        {
            "text": "This was before my time here, so it was really interesting to read. I’m proud to say that we’ve continued in this good vein with our work on accessible and inclusive content."
        },
        {
            "heading": 3,
            "text": "Accessible by default"
        },
        {
            "text": "Like other Government departments, we had a focus on moving away from inaccessible content formats. We offered alternative versions of documents and made use of our in-house user research team to test content and identify accessibility problems that we needed to address."
        },
        {
            "text": "In 2018, the Public Sector Bodies Accessibility Regulations were put in place to ensure that all public sector content is accessible. Once we were happy that we had met the legislation for our external customers, we began to turn our focus inward and review our internal content to ensure that was inclusive too."
        },
        {
            "text": "I joined the accessibility project team and began work on making inclusive content part of our culture. As reflected in our accessibility statement, we really do want as many people as possible to be able to access our services and content. The question we asked ourselves at this point was ‘how do we go about achieving this and becoming accessible by default in all that we do?’"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "IPO Accessibility champions: changing our culture"
        },
        {
            "text": " In 2021, I set up an accessibility champions network, attracting almost 50 representatives from various areas within our business who now fly the flag for accessibility in their areas. The Digital Accessibility Centre helped us once again, providing training to all of our champions."
        },
        {
            "text": "As a network, we then set out to support the rest of our people in their learning. Our in-house creative team have made a set of animated resources based on the Worcester Council SCULPT framework and we’ve brought in more training for IPO people to learn   about creating accessible documents and content."
        },
        {
            "text": "As we learn more and more about how to be inclusive in our information and services, we’re making small and frequent improvements to what we do and most importantly, how we do it."
        },
        {
            "text": "Some of the improvements our network members have initiated include:"
        },
        {
            "text": "We’ve also commissioned third parties to audit our content for accessibility. We’re working on fixing a small list of recommendations to our intranet pages and customer letters."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Creating an environment where we are all supported to do our best work "
        },
        {
            "text": "Anne-Marie Switzer, our Diversity and Inclusion Manager says:"
        },
        {
            "text": "“We aim for our workforce to be truly representative of all parts of society and for each employee to feel respected and confident that they have everything necessary for fulfilling their role. "
        },
        {
            "text": "“We hope to achieve our ambitious goal to become the best intellectual property office in the world and to provide outstanding customer service. This can only be done if we give people the right tools and support them in everything they do.”"
        },
        {
            "text": "Our areas for focus this year are:"
        },
        {
            "text": "One thing we all agree on is that accessibility matters to everyone. We’re not claiming to be perfect, but we’re certainly making great strides every day to continue our learning and improve our information."
        }
    ]
}