{
    "url": "https://civilservice.blog.gov.uk/2022/10/04/helping-to-put-friendship-first/",
    "title": "Helping to put friendship first",
    "authors": [
        "Bartholomew Oram"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Health & Wellbeing",
        "Uncategorized"
    ],
    "pub_date": "2022-10-04T08:40:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Civil servant Bartholomew Oram reflects on volunteering with the Civil Service Retirement Fellowship (CSRF), a charity dedicated to supporting former civil servants and their dependants."
        },
        {
            "text": "Loneliness can affect every one of us at some point in our life. A study by the Office for National Statistics in 2020 found that 2.6 million adults in the UK feel lonely “often” or “always”, whilst more than half of those aged over 75 in the UK live alone. "
        },
        {
            "text": "I’ve been particularly struck by the stories from people who have felt lonely and isolated in recent years, something exacerbated by the pandemic. I vividly recall watching the BBC story where Dan Walker gave a gentleman called Terrence a Christmas tree a couple of years ago. The impact of his own story of handling loneliness and his emotional reaction really touched me. (Certainly worth watching if you haven’t seen it, but have a tissue box close to hand!)"
        },
        {
            "text": "This was one of the main reasons I signed up to volunteer for the CSRF’s befriending schemes, virtually as soon as I had heard about the charitable services they offered. "
        },
        {
            "heading": 4,
            "text": "CSRF’s befriending scheme"
        },
        {
            "text": "The CSRF is a national charity created more than 50 years ago, dedicated to helping former civil servants and their dependants make the most of their retirement. Their services include befriending schemes which help ensure that older people, who may be experiencing loneliness or social isolation, are provided with companionship via home visits, regular phone calls or letters from a penpal. These are national services delivered across the UK to provide friends and support, and can offer a link for those who may have restricted mobility, lack of accessibility to the public or who may not have regular visitors."
        },
        {
            "heading": 4,
            "text": "My experience as a befriender"
        },
        {
            "text": "I currently volunteer as part of the home visits and penpal schemes. I signed up as I was keen to provide a listening ear and regular contact to those in need of some companionship. But I soon discovered that I gain just as much out of it as I hope my befriend-ees do. "
        },
        {
            "text": "I’ve found the home visits a fantastic way to connect to someone locally, especially as I’d only relatively recently moved to the area, whilst they’d lived there for decades. We often connect over things we have in common – such as keeping up with Wimbledon or our favourite TV gameshows. We’ve also helped each other learn about things entirely new to both of us. For example, they educated me about the competitiveness of the local lawn bowls circuit whilst I introduced them to the wonders of Wordle. We try to schedule visits once or twice a month, and they certainly give me something to look forward to on a Sunday morning."
        },
        {
            "text": "I’ve enjoyed getting to know my penpal just as much. We both love films – albeit with slightly different tastes and genres. Their favourites are Brighton Rock and Great Expectations, whilst Memento and Inception are among mine. I’d dare anyone to try and explain a Christopher Nolan plot concisely and clearly within a letter! We’re also both big history buffs, and I felt honoured when they shared details about their own family history and in particular their lived experience during the Blitz. "
        },
        {
            "text": "In a world of WhatsApps and emails, I find that taking the time to craft a letter to my penpal can be an almost therapeutic experience, whilst reading about their own memories can feel like looking into a unique portal to the past. My partner knows whenever I’ve received a letter from my penpal as I come back from the mailbox with a big smile – especially given our other mail is typically our council tax bill or the latest pizza delivery menu."
        },
        {
            "heading": 4,
            "text": "Beyond befriending"
        },
        {
            "text": "I am just one of many volunteers – the CSRF made 2,400 visits and calls in 2021 – but the charity is always on the lookout for new volunteers. As well as befriending, the CSRF offers local community group networks via 64 local community groups which provide companionship, and trips. They also have a networking relationship with other organisations to provide advice to members on a range of topics, from finance to bereavement."
        },
        {
            "text": "This is all possible thanks to public donations and the generosity of volunteers. I recently attended the CSRF’s AGM, and it was brilliant hearing about the real sense of community the CSRF can bring retired civil servants across all corners of the UK. It was actually a conversation over lunch at the AGM with our Chair, the Northern Ireland Office’s Madeleine Alessandri, which prompted me to write this piece."
        },
        {
            "text": "If you’re a current civil servant and volunteering as a befriender sounds like something you may be interested in, I’d strongly encourage you to reach out to befriending@csrf.org.uk. If you’re approaching retirement or know of retired civil servants or their dependants who may benefit from the CSRF’s services, likewise please get in touch via email at enquiries@csrf.org.uk or visit www.csrf.org.uk."
        }
    ]
}