{
    "url": "https://educationhub.blog.gov.uk/2022/10/04/how-we-will-reduce-crime-by-supporting-people-to-get-jobs-after-prison-through-apprenticeships/",
    "title": "How we will reduce crime by supporting people to get jobs after prison through apprenticeships",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2022-10-04T13:30:56+01:00",
    "content": [
        {
            "text": "Apprenticeships help people get the skills that employers want and need, and we know employment is one of the best tools in reducing reoffending.  "
        },
        {
            "text": "Prisoners across England who are eligible for release on temporary licence and nearing the end of their sentence can now take advantage of apprenticeships. The ground-breaking new scheme, announced earlier this year, will help more prisoners kickstart rewarding careers in vital industries including hospitality and construction while helping to cut reoffending rates and crime. "
        },
        {
            "heading": 3,
            "text": "Why are we allowing prisoners to access apprenticeships? "
        },
        {
            "text": "Prisoners are already able to study, train and work while in prison, and thousands are already doing vital work in the community.  "
        },
        {
            "text": "However, until now prisoners in England have been unable to take advantage of apprenticeships, which are a proven route to supporting more people to secure great jobs.  "
        },
        {
            "text": "We have changed the law so prisoners eligible for release on temporary licence and nearing the end of their sentence can access high quality apprenticeship opportunities and gain the skills needed to secure work on their release. "
        },
        {
            "text": "Evidence highlighted that prison leavers who are in work are significantly less likely to re-offend. "
        },
        {
            "text": "Allowing prisoners to access apprenticeship is an important step in helping to break the cycle of crime and support prisoner reintegration into society.  Learning new skills and becoming a valued member of the workforce will help to lower rates of reoffending, making our streets safer and reducing pressure on our police and criminal justice system. "
        },
        {
            "heading": 3,
            "text": "How will it work? "
        },
        {
            "text": "We are working with a number of employers across a range of sectors, including Sheffield City Council, Co-op and Premier Foods to support up to 300 prisoners to start their apprenticeship journey by March 2025. "
        },
        {
            "text": "The first prisoners have already started their apprenticeships with Timpson, Greene King and Kier in roles including cheffing and highway maintenance. As with all apprenticeships, the new apprentices will earn while they learn, benefiting from high quality on and off the job training. "
        },
        {
            "text": "This new opportunity to start working and earning before the end of their sentence offers prisoners the chance to get a head start at a brighter future and a better chance at transforming their lives. "
        },
        {
            "heading": 3,
            "text": "Should employers be worried about taking on prisoners as apprentices? "
        },
        {
            "text": "Research by Kantar, commissioned by the Ministry of Justice, found that prisoners make trustworthy, hardworking and punctual employees who are an asset to the company they work for.  "
        },
        {
            "text": "Those who fail to show up for work could risk being sent back to prison, which is a strong incentive for offenders to dedicate themselves to their new life as reliable and committed employees. "
        },
        {
            "text": "James Timpson, Chief Executive of the Timpson Group, said:  "
        },
        {
            "text": "Nick Mackenzie, Chief Executive of Greene King, said: "
        },
        {
            "heading": 3,
            "text": "How will this impact my local community? "
        },
        {
            "text": "Giving prisoners the opportunity to start an apprenticeship is a fantastic way to support them to learn the skills they need to gain employment after they are released, assisting their rehabilitation, reducing the likelihood of reoffending, and helping to keep our communities safe.  "
        },
        {
            "text": "It is also a great way for employers to develop the skilled workforce they need, helping to plug skills gaps, particularly in industries suffering from a labour shortage. Communities will also benefit from the boost to the local economy. "
        }
    ]
}