{
    "url": "https://ukhsa.blog.gov.uk/2022/10/04/stis-get-tested-get-treated/",
    "title": "STIs: Get tested, get treated",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-10-04T13:44:37+01:00",
    "content": [
        {
            "text": "In 2021 a total of 311,604 new STIs were diagnosed in England, an increase of 1,683 compared to 2020."
        },
        {
            "text": "While still lower than pre-COVID-19 pandemic levels, the overall number of STIs newly diagnosed in England remains high, so it’s important to get tested and prescribed effective treatment if needed. Ignoring STIs can lead to long term problems, such as infertility."
        },
        {
            "text": "Here we discuss and summarise the key findings from our report Sexually transmitted infections and screening for chlamydia in England, 2021 which we need to know to understand the risks, along with some simple steps we can take to stay in good sexual health."
        },
        {
            "heading": 3,
            "text": "Who is most at risk of STIs?"
        },
        {
            "text": "Everyone who has condomless sex with new or casual partners is at risk of catching an STI."
        },
        {
            "text": "As in previous years, the highest rates of STI diagnoses were seen in gay, bisexual and other men who have sex with men (GBMSM); young people 15 to 24 years; and people of Black ethnicity."
        },
        {
            "text": "Compared to people 25 and older, young people aged 15 to 24 years remain at the highest risk of the most common STIs, and this may be due to more frequent changes of sexual partners."
        },
        {
            "text": "While the number (133,342) of new STI diagnoses in 2021 among young people aged 15 to 24 years decreased overall by 5.8% compared to 2020, reductions in testing during the COVID-19 pandemic may be behind this, prompting concerns that more infections could unknowingly be going untreated."
        },
        {
            "text": "STI diagnoses in GBMSM increased between 2020 and 2021 - including diagnoses of gonorrhoea, chlamydia and syphilis."
        },
        {
            "text": "Diagnoses of gonorrhoea increased by 9.0%, from 24,784 to 27,123, chlamydia increased by 5.5%, from 14,191 to 14,980, and diagnoses of infectious syphilis increased by 2.6%, from 5,118 to 5,254."
        },
        {
            "text": "Compared to other ethnic groups, the rates of STI diagnoses remained highest among people of Black Caribbean ethnicity in 2021."
        },
        {
            "text": "Previous research has found no unique clinical or behavioural factors explaining the higher rates of STI diagnoses among people of Black Caribbean ethnicity. This disparity is likely influenced by underlying social and economic factors and the role they play in the health inequalities experienced by this community."
        },
        {
            "heading": 3,
            "text": "HIV – what’s the latest data telling us?"
        },
        {
            "text": "In 2021, new HIV diagnoses rose by 1%, to 2,955, with increases seen in GBMSM and heterosexual and bisexual women."
        },
        {
            "text": "The proportion of those diagnosed late rose from 44% to 46%. The rise in late diagnoses is likely a consequence of the COVID-19 pandemic leading to reduced numbers of people testing in 2020, affecting heterosexual men and women in particular."
        },
        {
            "text": "HIV testing is the route into accessing HIV pre-exposure prophylaxis (PrEP) which has been proven to reduce HIV transmission. If you are diagnosed with HIV, treatment is effective and people diagnosed promptly can expect long, healthy lives."
        },
        {
            "text": "Effective treatment of HIV leads to undetectable levels of virus, which also means HIV cannot be passed on through sex (“undetectable= untransmittable” or “U=U”)."
        },
        {
            "heading": 3,
            "text": "How can I protect myself against STIs?"
        },
        {
            "text": "STIs can pose serious consequences to your own health and that of your current or future sexual partners."
        },
        {
            "text": "Using condoms is important to prevent spread of STIs and HIV, and is a key tool in looking after our sexual health and wellbeing."
        },
        {
            "text": "If you are having sex with new or casual partners, use a condom and get tested - if you have any unusual symptoms, don’t have sex until you are tested."
        },
        {
            "heading": 3,
            "text": "Get tested regularly for STIs"
        },
        {
            "text": "Regular testing for STIs and HIV is essential to maintain good sexual health."
        },
        {
            "text": "Everyone should get an STI screen including an HIV test at least once a year if having condomless sex with new or casual partners – even if they don’t have any symptoms."
        },
        {
            "text": "Those at risk of STIs and HIV can access testing through sexual health services."
        },
        {
            "text": "Many services offer online testing, which means people can order self-sampling kits using sexual health services’ websites, take them in the privacy of their own home, send them off to a laboratory for testing and receive results either by text, phone call or post."
        },
        {
            "text": "Local sexual health services can be found online at NHS.UK."
        },
        {
            "heading": 3,
            "text": "If I test positive for an STI, where do I get treatment?"
        },
        {
            "text": "Sexual health services are free and confidential and offer treatment as well as testing for HIV and STIs."
        },
        {
            "text": "Sexual health services also provide condoms, vaccination, HIV PrEP, and HIV post-exposure prophylaxis (PEP)."
        },
        {
            "text": "Information and advice about sexual health including how to access services is available at Sexwise and from the national sexual health helpline on 0300 123 7123."
        }
    ]
}