{
    "url": "https://deframedia.blog.gov.uk/2022/10/04/water-companies-face-new-civil-penalties-up-to-250million/",
    "title": "Water companies face new civil penalties up to £250million",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2022-10-04T15:38:02+01:00",
    "content": [
        {
            "text": "There has been widespread media coverage of the Environment Secretary’s announcement that he will bring forward proposals to raise the civil penalty for water companies who pollute the environment by 1,000-fold - from £250,000 to up to £250 million."
        },
        {
            "text": "The proposal – covered by The Telegraph, Daily Express, Times, Daily Mail, Evening Standard, Daily Mirror, Independent and ITV News - comes as part of the government’s ongoing action to push for water companies to invest more in infrastructure that will minimise pollution incidents and secure our water supply for future generations."
        },
        {
            "text": "Whilst fines handed out by the courts to water companies through criminal prosecutions are unlimited, these can be a lengthy and costly process. Using civil sanctions – Variable Monetary Penalties (VMPs) – which can be imposed directly by the EA can offer a quicker method of enforcement."
        },
        {
            "text": "The current limit for VMPs handed out by the EA for individual breaches of the rules is £250,000. Increasing the cap for fines up to £250 million will simplify and speed up the process of enforcement by allowing the EA to directly hand out penalties to water companies."
        },
        {
            "text": "Last month the Environment Secretary asked water companies to write to him, setting out their plans for improving environmental performance and infrastructure. Responses have been received from all water companies and are currently being scrutinised as part of the ongoing work by the government, the Environment Agency and the regulator Ofwat to drive up water companies’ performance and increase accountability."
        },
        {
            "text": "Environment Secretary Ranil Jayawardena said:"
        },
        {
            "text": "Environment Agency Chief Executive Sir James Bevan said:"
        },
        {
            "text": "Today’s proposal will be subject to consultation."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}