{
    "url": "https://hmlandregistry.blog.gov.uk/2021/09/14/automation-in-land-registration/",
    "title": "Automation in land registration",
    "authors": [
        "Mike Harlow, General Counsel, Deputy Chief Executive and Deputy Chief Land Registrar"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services"
    ],
    "pub_date": "2021-09-14T10:51:22+01:00",
    "content": [
        {
            "text": "Over the last 18 months we have introduced electronic signatures in land registration and published our Standard promoting the use of digital ID checks. All of these are moving us a little closer to the ultimate goal – an improved, faster, data-led conveyancing process."
        },
        {
            "text": "Automation of some aspects of land registration is part of this vision. The automated tasks will be completed immediately and allow our expert caseworkers to focus on the more technical aspects of processing applications. The customer will receive services that are increasingly near instant or real-time."
        },
        {
            "text": "There are several land registries around the world, such as New Zealand and Australia, with similar land law who have partly or wholly automated applications to register a change of ownership. This has resulted in a majority of applications being returned within seconds."
        },
        {
            "text": "It is obviously essential that any automated process can be trusted without question. This means that the systems we are building to achieve this (a digital application process, machine readable register and casework processing engine) need to have the highest integrity in the way they make land registration decisions. Moreover, we must keep in mind an obvious principle of computing – the output can only be as trusted as the inputs."
        },
        {
            "text": "There needs to be a handover of that trust in the inputs at the point at which the conveyancer submits the information about what has happened in the transaction. Without that trust, we cannot sensibly automate changes to the register and all gain the conveyancing efficiency advantages that will flow from that."
        },
        {
            "heading": 2,
            "text": "The importance of the professional conveyancer"
        },
        {
            "text": "Conveyancers know what has happened in a transaction. To automate our side of the transaction, HM Land Registry needs to be passed that information in a reliable way. As experience elsewhere shows, the most secure means of achieving that is for a regulated lawyer (legal executive, conveyancer or solicitor) to give a personal confirmation of the truth of the facts as they or their colleagues know them. This sort of assurance is familiar already, as lawyer certificates are already given in many cases."
        },
        {
            "text": "We referred to this work as a “lawyer certification pilot” in our recent Business Plan – it is an evolution of the information and lawyer assurance we receive today. Getting this right and making this easy is a critical component in a future digital service and conveyancing process."
        },
        {
            "text": "We are currently thinking through the details of how this will work, and of course we cannot do that without testing it thoroughly first. We intend to run a small-scale pilot with a few firms in the coming months. We are directly reaching out to a number of companies. However, if you would like to take part please fill in our sign-up form."
        },
        {
            "text": "We will share progress on the pilot as we go along."
        },
        {
            "heading": 2,
            "text": "Increasing speed of service"
        },
        {
            "text": "As you will probably be aware, we are focusing a great deal of effort at the moment on increasing our caseworker capacity to improve the speed of our non-urgent casework."
        },
        {
            "text": "We have been hiring and training hundreds more casework staff to give us more immediate resource. But we are also looking ahead. We need to invest effort now to deliver a more efficient service in the future. The pilot and our wider work around automation does not detract from our short-term efforts to improve our service today, which remains our absolute priority. It seeks to amplify our efforts in the future."
        },
        {
            "text": "Making the most of digital technology in the way we provide our land registration services is a key way in which we can contribute to and enable a simpler and faster conveyancing process. Developing ways of working with electronic signatures and remote digital ID checking are all part of the same transformation journey. We cannot hope to do this successfully without the collaboration and support of all our partners and customers."
        }
    ]
}