{
    "url": "https://educationinspection.blog.gov.uk/2021/09/14/curious-about-whats-it-like-being-an-inspector/",
    "title": "Curious about what’s it like being an Inspector?",
    "authors": [
        "External Relations"
    ],
    "categories": [
        "inspection",
        "recruitment"
    ],
    "pub_date": "2021-09-14T17:46:02+01:00",
    "content": [
        {
            "text": "Curious about what’s it like being an Inspector (also known as Her Majesty’s Inspectors)? Two school HMI talk about their journey into the role and what the job involves.  "
        },
        {
            "text": "Sue Costello HMI"
        },
        {
            "text": "Ahmed Marika’s perspective"
        },
        {
            "heading": 3,
            "text": "Why work for Ofsted?  "
        },
        {
            "text": " Ofsted’s work is fulfilling and varied. Working from home in between inspections and face-to-face meetings, you will benefit from the freedom and flexibility that comes with working independently, while supported by a network of colleagues who share your passion for making a difference in England’s schools.  "
        },
        {
            "text": "Under our education inspection framework (EIF) you will have a full day allocated to write up your inspection report, as well as increased time to prepare for inspection.  "
        },
        {
            "text": "HMI’s support each other. Each HMI is allocated to a regional team and supported by an experienced senior leader in that region. After a comprehensive induction and training period, regional team colleagues stay in regular contact, providing advice and support. This means they form close bonds that prove invaluable throughout their careers.  "
        },
        {
            "text": "You may also in future become a specialist adviser, move into inspector training, join a policy team or become a senior HMI leading a team. You could take on additional research work or manage a project. We want inspectors to have the best current knowledge  and practice in subjects as part of our development programme.  "
        },
        {
            "heading": 3,
            "text": "Future leaders "
        },
        {
            "text": "We welcome applications from a variety of backgrounds and have run regional shadowing programmes in the past. As we return to inspection fully, we hope to start these programmes up again.  "
        },
        {
            "text": "Here, our Regional Director for London, Mike Sheridan, reflects on why these programmes matter.  "
        },
        {
            "heading": 3,
            "text": "Benefits "
        },
        {
            "text": "We offer a generous salary, starting at £70,500 rising quickly to £75,500 after probation, paid travel and expenses, an excellent pension, generous holiday entitlement of 32.5 days and in-year performance rewards along with other attractive benefits.  "
        },
        {
            "text": "You’ll need a degree-level qualification or equivalent and hold Qualified Teacher Status. You’ll have minimum 5 years’ experience of successful leadership at middle or senior level with responsibility for people and resource management, and a proven track record of achieving consistent improvement in the education sector  "
        },
        {
            "text": " Apply at our recruitment site: https://resourcing.ofsted.gov.uk/"
        }
    ]
}