{
    "url": "https://ipa.blog.gov.uk/2021/09/14/governments-vision-building-back-better-and-transforming-infrastructure-performance/",
    "title": "Government’s Vision: Building Back Better and Transforming Infrastructure Performance",
    "authors": [
        "Nick Smallwood"
    ],
    "categories": [
        "Construction",
        "digital infrastructure",
        "Infrastructure",
        "Major projects",
        "Modern Methods of Construction",
        "National Infrastructure and Construction Pipeline",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2021-09-14T10:25:46+01:00",
    "content": [
        {
            "text": "Commitment to progress"
        },
        {
            "text": "There is no doubt that the construction sector is vital to the economy, being one of the largest UK sectors and a key source of the employment. "
        },
        {
            "text": "However, low levels of investment, insufficient focus on a move towards net zero emissions and not enough modernisation of skills and innovation has meant that the sector has failed to live up to its potential. This was further hampered by the COVID-19 pandemic, which at times reduced the workforce, created issues with supply chains and diminished productivity."
        },
        {
            "text": "However, as we recover from the pandemic, there is an opportunity to do things differently; to address the issues that have held back the construction sector for so long, and to create a more efficient, productive and sustainable industry."
        },
        {
            "text": "That is why, the Infrastructure and Projects Authority (IPA) has published two key infrastructure publications, the National Infrastructure and Construction Pipeline 2021 and Transforming Infrastructure Performance: Roadmap to 2030, both of which demonstrate a clear commitment to build back better and to fulfil the ambition set out in the National Infrastructure Strategy, published in December 2020."
        },
        {
            "text": "These publications set out government’s vision for the UK’s infrastructure, together with the most comprehensive infrastructure pipeline ever published."
        },
        {
            "text": "Building back better and transforming infrastructure performance"
        },
        {
            "text": "The National Infrastructure and Construction Pipeline sets out an ambitious pipeline of investment totalling almost £650bn, the highest figure ever reported. This investment will be delivered over the next decade, building back and delivering thriving regions, cities, towns and communities right across the country. "
        },
        {
            "text": " "
        },
        {
            "text": "Transforming Infrastructure Performance: Roadmap to 2030 supports the effective delivery of this investment by setting out a vision that puts societal outcomes, digital technology and innovation at the heart of our approach to infrastructure investment and delivery. This transformation will be critical to improving the delivery of the government’s infrastructure portfolio and to achieving long-term objectives such as building back and levelling up the country."
        },
        {
            "text": "Infrastructure will not, of course, level up the UK on its own. There must also be a focus on supporting jobs and investment in skills. That is why, for the first time, the pipeline sets out the annual average workforce requirement to deliver the planned investment. This includes 425,000 jobs that will be supported annually between 2021/22 and 2024/25 through the pipeline investment."
        },
        {
            "text": "Delivering this ambitious infrastructure pipeline will also mean bringing more workers into the construction industry and retraining and up-skilling the existing workforce. That is why both the publications focus on a shift in the culture and makeup of the construction sector workforce, by leveraging new tech, skilled jobs and robust data to modernise our approach and drive greater benefits for citizens"
        },
        {
            "text": "And we must not forget the greatest challenge of our time - now is the time to invest in green infrastructure, green skills, and carbon friendly solutions to reach net-zero by 2050.  Government is already driving us towards this commitment by using its position as the single largest construction client to support and encourage the adoption of more productive and sustainable practices within the UK construction sector. And, Transforming Infrastructure Performance sets out a vision where decision making at every stage is informed by the environmental impact, ensuring that the UK is on the path to net zero emissions by 2050."
        },
        {
            "text": "Now is the time to step up"
        },
        {
            "text": "With the publication of the National Infrastructure and Construction Pipeline and Transforming Infrastructure Performance: Roadmap to 2030, the pipeline of investment is certain and the vision of how this should be delivered is clear. "
        },
        {
            "text": "But, government will not be able to fulfil this ambition alone. We must harness the power of collaboration and levels of commitment that we’ve witnessed over the past year and a half. "
        },
        {
            "text": "Together, we need to step up and rise to these challenges, meeting them head on and bringing innovative solutions and actions to the table. This means being greener, investing more into what matters, and prioritising the skills of the future."
        },
        {
            "text": "It is crucial that we act now and that we act together in order to achieve the best possible outcomes for the infrastructure sector."
        }
    ]
}