{
    "url": "https://companieshouse.blog.gov.uk/2021/09/14/how-to-avoid-a-late-filing-penalty-2/",
    "title": "How to avoid a late filing penalty",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-09-14T12:22:58+01:00",
    "content": [
        {
            "text": "High on the list of enquiries that our contact centre receives, are questions about late filing penalties. What are they, when do you get them and how do you deal with them?"
        },
        {
            "text": "As a limited company you need to file your accounts with us every year. Whether you’re trading or dormant, they must be delivered by the deadline calculated from your accounting reference date."
        },
        {
            "text": "Failure to meet the deadline will result in an automatic penalty."
        },
        {
            "heading": 2,
            "text": "What is a late filing penalty?"
        },
        {
            "text": "If you’re a new company and you’re filing your first set of accounts, they must be delivered within 21 months of your incorporation date. Thereafter, your accounts must be delivered within 9 months after your company’s financial year ends."
        },
        {
            "text": "It’s important to note that ‘delivered’ means when Companies House receives the document, not when posting or handing to a courier."
        },
        {
            "text": "Your accounts will only be considered as delivered once they have complied with the requirements of the Companies Act. If for any reason the accounts are rejected, they would not be considered as delivered. If you fail to deliver your accounts by the due date, then an automatic late filing penalty will be triggered."
        },
        {
            "text": "How late your accounts reach us will determine the amount of penalty you will receive. The penalties are:"
        },
        {
            "text": "In all cases these fees double if you file your accounts late in 2 successive financial years."
        },
        {
            "heading": 2,
            "text": "When is a late filing penalty applied?"
        },
        {
            "text": "A late filing penalty notice will be issued after your accounts have been filed late. The penalty notice will give details of:"
        },
        {
            "text": "You can pay the penalty by BACS by clearly stating the company number on the bank transfer and using it as the reference. You should email your remittance to lfpfinance@companieshouse.gov.uk on the same date as the payment is sent, clearly indicating the company name and number."
        },
        {
            "text": "It may be possible to pay your late filing penalty online and a link will be found on the penalty notice. We’re not able to take credit card payments over the phone."
        },
        {
            "heading": 2,
            "text": "How to appeal a late filing penalty"
        },
        {
            "text": "In exceptional circumstances it may be possible to appeal against a late filing penalty. We have very little discretion not to collect a penalty but if you think you have a sufficient reason, the appeal can be made online. You’ll need:"
        },
        {
            "text": "Reasons such as the company is dormant, the accounts were delayed in the post or you did not know how or when to file the accounts will not be accepted."
        },
        {
            "heading": 2,
            "text": "How to avoid a late filing penalty"
        },
        {
            "text": "To make sure your accounts are filed in good time, you should:"
        },
        {
            "text": "Our email reminder service is free, and you choose up to 4 people to receive the reminder."
        },
        {
            "text": "By filing your accounts online, you can benefit from the built-in checks, to help you avoid errors and rejection. It’s cheaper and you’ll know quickly whether they’ve been accepted with an online confirmation."
        }
    ]
}