{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/09/14/join-the-next-event-for-people-who-want-to-transform-uk-policymaking/",
    "title": "Join the next event for people who want to transform UK policymaking",
    "authors": [
        "Patrick Gallagher",
        "Laura Cheshire",
        "Jessica Riley",
        "Annie Crabtree"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2021-09-14T13:28:35+01:00",
    "content": [
        {
            "text": "We’re relaunching the cross-government community for multidisciplinary policy design, bringing together innovators and changemakers from across government, starting with our next event on Thursday 21 October."
        },
        {
            "text": "This community is for anyone in central or local government who is working to transform UK policymaking and create better outcomes for citizens. We hope to make it a place where we can meet and learn from each other."
        },
        {
            "heading": 2,
            "text": "Starting from a shared purpose"
        },
        {
            "text": "Our starting point lies in our shared purpose. We welcome all professions and methods. We’re here for you if you’re working to transform and challenge policymaking, to better understand the end-to-end journeys of policies and their risks and impacts. We have problems and priorities in common – we aren’t prescriptive about solutions."
        },
        {
            "text": "Some of you are already based in multidisciplinary policy design teams, as part of the growing network of policy labs. Or you may work in a policy, design or technology department in a central or local government department or an arm’s-length body."
        },
        {
            "text": "You may think of your work in design-focused terms like user-centred policy design. Or perhaps you are new to thinking in this way, or are interested in moving into this space in the future."
        },
        {
            "text": "We’re connecting people from across departments and professions and we hope you’ll join us."
        },
        {
            "heading": 2,
            "text": "Why this matters now"
        },
        {
            "text": "Government is increasingly working on multi-faceted, cross-cutting problems. To change how policy is made in the UK, we need to find and create opportunities to connect and collaborate with each other across departments and beyond."
        },
        {
            "text": "This is why our recent report on policymaking reform emphasises the need to work collaboratively and openly within the policymaking community and beyond. We hope reviving this community will help us to do this."
        },
        {
            "heading": 2,
            "text": "What we’ve learned so far"
        },
        {
            "text": "We’ve gathered feedback through surveys and we’re using this to help shape the future of the community. People have told us they value opportunities to do things like:"
        },
        {
            "text": "We hope to meet these needs through a range of activities involving varying levels of engagement, from case study presentations to interactive workshops and hackathons."
        },
        {
            "heading": 2,
            "text": "Join our next event on 21 October"
        },
        {
            "text": "We plan to:"
        },
        {
            "text": "We’ll continue to have a remote option for our events so more people can access them."
        },
        {
            "text": "If your work involves user-centred policy design, or you’d like to do this kind of work in the future, we hope you’ll sign up for the event."
        }
    ]
}