{
    "url": "https://defrafarming.blog.gov.uk/2021/09/14/things-we-learned-about-co-design-at-this-summers-agricultural-shows/",
    "title": "Things we learned about co-design at this summer's agricultural shows ",
    "authors": [
        "Abigayle Adamson",
        "Neville Cavendish"
    ],
    "categories": [
        "Conversations we're having",
        "Things we've learned",
        "Ways to get involved"
    ],
    "pub_date": "2021-09-14T12:00:02+01:00",
    "content": [
        {
            "text": "We recently published a blog post about the things we learned at this summer’s agricultural shows which took place up and down the country.  "
        },
        {
            "text": "At most of those shows, we ran co-design taster sessions for members of the farming community, so they could get a sense, first-hand, of how they could shape our policies. "
        },
        {
            "text": "In this post, we're going to talk about some other things we learned that directly relate to co-design. "
        },
        {
            "heading": 3,
            "text": "Learning as we go, in the open"
        },
        {
            "text": "Attending these shows was really valuable for us. It gave us a terrific opportunity to talk to the community directly about what we are doing, how they can be part of it, and learn about the issues that matter to them most. "
        },
        {
            "text": "More than 50 new people signed up  for our co-design panel, a pool of people who are willing to help out with future research and co-design. You can still join the panel, simply sign up here. "
        },
        {
            "text": "Since the shows, we’ve been reviewing all the information that we received and the comments we heard, and grouped them into 6 themes: "
        },
        {
            "heading": 4,
            "text": "1. Peer-to-peer and local learning  "
        },
        {
            "text": "The most useful advice is the sort that understands and is relevant to a farm's type and local area. Many people we spoke to were keen to work in partnership with local neighbours on schemes and projects that would benefit all. They're also keen to share what they learn with others. "
        },
        {
            "heading": 4,
            "text": "2. Making feedback visible "
        },
        {
            "text": "To help them make better, evidence-based decisions, farmers want to hear more details about the design and outcomes of the various tests and trials that are underway. This will help them decide whether or not to opt in to a particular service or scheme.  "
        },
        {
            "heading": 4,
            "text": "3. Communication is key "
        },
        {
            "text": "Most people we spoke to rely on trade media for their news and updates; but that said, a lot of them asked if we could be more active on social media. Some felt that information on GOV.UK isn't always as helpful as it could be, and not all farmers use the internet often, which forces them to consult third-party advisers to find out the latest.  "
        },
        {
            "heading": 4,
            "text": "4. Advisers play an important role "
        },
        {
            "text": "Farmers often contact advisers to get a clearer understanding of new schemes, and which ones are right for them. They also look for advice on new ideas in the industry, market changes, and tips for spotting signs of trouble on their farm. "
        },
        {
            "heading": 4,
            "text": "5. Building trusting relationships "
        },
        {
            "text": "Defra-accredited advisers tend to earn more trust; they are seen as well qualified and impartial. Farmers prefer to seek advice from expert advisers where they can. "
        },
        {
            "heading": 4,
            "text": "6. Financial concerns are real "
        },
        {
            "text": " It's not always easy to make a profit, and some farmers have depended on Basic Payments for years as a way to make ends meet. The new schemes being developed and launched provide critical support to many people and farming businesses, and its important to time them to start as BPS reductions begin. "
        },
        {
            "heading": 3,
            "text": "Addressing concerns "
        },
        {
            "text": "Going to the summer shows was a positive experience for all of us, but not every conversation was all positive, all of the time. We also learned about some of the things that members of the community are most worried about.  "
        },
        {
            "heading": 4,
            "text": "People said relevant pages on GOV.UK could be clearer and easier to find. "
        },
        {
            "text": "People are confused about the various different schemes, who is eligible for what, and so on. We’re already working on providing information that’s clearer and easier to find. Some early steps include:"
        },
        {
            "text": "We know there is more to do and we'll be posting more about our GOV.UK content work soon. "
        },
        {
            "heading": 4,
            "text": "And some people don’t believe that Defra wants to make policy and design schemes that work for the farming community."
        },
        {
            "text": "We genuinely do, and co-design sessions are an important technique we use to make it happen. As I mentioned earlier, you can be part of it. Sign up to join our co-design panel."
        },
        {
            "text": " Your voice is important, and your views matter. Co-design means nothing without input from members of the farming community.  It’s at the heart of our approach. "
        }
    ]
}