{
    "url": "https://cddo.blog.gov.uk/2022/10/31/building-a-government-cloud-technical-community/",
    "title": "Building a Government Cloud Technical Community",
    "authors": [
        "Phil Chatterton, Chief Enterprise Architect, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT community",
        "Digital transformation"
    ],
    "pub_date": "2022-10-31T09:58:11+00:00",
    "content": [
        {
            "text": "\nThe Central Digital and Data Office (CDDO) is seeking to build a government technical Cloud community of practice - and we’d love to hear from any, and all, Civil Servants, who work in this specialist area - architects, engineers, developers and all interested parties. "
        },
        {
            "text": "We’re holding our first hybrid event on Friday 9 November and would love for you to join us.\n"
        },
        {
            "heading": 3,
            "text": "A common cloud community"
        },
        {
            "text": "Communities of practice allow us to share skills, best practice, common problems and experience. Working together in informal settings, we can generate ideas, share solutions, build code and create outputs which enhance our own work, whilst adding to a common body of knowledge across government. "
        },
        {
            "text": "CDDO are committed to building out Government Skills at Scale, as described in Mission 5 of our Transforming for a Digital Future Strategy. We seek to develop efficient, secure and scalable technology: addressing legacy, reducing duplicated effort, and ensuring our key systems have the right and proper platforms for their continued operation. Technical communities are key to this, leaning on the skills, expertise, experience and learning we have in government. "
        },
        {
            "text": "In challenging ourselves, and mobilising our shared expertise, we can stimulate professional growth and build out our technical capabilities to better drive digital transformation. This new, and exciting, Cloud community is open to any employee with a .gov.uk email address, we also hope to encourage cross-government support, under the sponsorship of the Chief Technology Officer Council."
        },
        {
            "text": "This vibrant and vocal community of individuals will strive to generate creative solutions to problems, such as code sharing, common tooling and standardising architectures and patterns - developing the best technical cloud solutions for UK citizens. "
        },
        {
            "heading": 3,
            "text": "One Government Community Services group"
        },
        {
            "text": "We’re collaborating with the One Government Community Services group (OGCS) who were formed to help drive the Cloud agenda forward, as well as Crown Commercial Services (CCS) who are tasked with supporting and building out the right commercial and strategic platform choices for government. "
        },
        {
            "text": "To date conversations around Cloud have been driven by commercial interests, and whilst of course we absolutely need to deliver best value to taxpayers, we too need to ensure that Cloud technical capabilities are agile and best fit for purpose. The technical decisions, the tools and platforms we choose, and why we select one, over another, are key to ensuring we have a fit for purpose Cloud offering in government. "
        },
        {
            "text": " "
        }
    ]
}