{
    "url": "https://ipa.blog.gov.uk/2022/10/31/building-the-future-the-school-rebuilding-programme-site-visit/",
    "title": "Building the Future - The School Rebuilding Programme Site Visit",
    "authors": [
        "Chloe Bonnington"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Major Projects",
        "Modern Methods of Construction",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2022-10-31T15:03:01+00:00",
    "content": [
        {
            "text": "Fast Streamer, Chloe Bonnington, from the Infrastructure and Projects Authority (IPA) shares her insights from an engaging visit to the School Rebuilding Programme with IPA Chief Executive Officer, Nick Smallwood. "
        },
        {
            "text": " "
        },
        {
            "text": "What is the School Rebuilding Programme?"
        },
        {
            "text": "Announced in 2020, the School Rebuilding Programme (SRP) is a decade-long scheme that will see 500 schools rebuilt or refurbished in an effort to modernise the nation’s education estate in a sustainable way and provide new facilities for the school communities most in need. The first 50 schools were selected to be part of the programme in February 2021, with 50 more chosen in July that year, and a further 61 in July 2022 following a public consultation. I had the opportunity to visit two schools that are currently in the construction phase along with Nick Smallwood, Chief Executive Officer of the Infrastructure and Projects Authority (IPA), and Alison Baptiste, Director of Public and Security Services (IPA). "
        },
        {
            "text": " "
        },
        {
            "text": "Littleborough Community Primary School "
        },
        {
            "text": "Our first visit was to Littleborough Community Primary School in Rochdale, accompanied by the Head of Programme Management Office for the SRP, Matt Bulmer. We met with Headteacher Louise Woodman who talked us through the challenges that staff and students are facing in the current building, and the excitement that the project has generated within the community now that the new school is almost complete. Students have been engaged in the process throughout, taking part in steel signing, creating posters and burying time capsules, with the Eco Club and School Council being consulted on designs for the outdoor spaces as well. "
        },
        {
            "text": "During the tour around the construction site managed by Wates, the team explained how the use of Modern Methods of Construction (MMC) for elements of the build has led to invaluable time saving in the construction process. MMC involves manufacturing sections of the building off site which are subsequently installed in a modular fashion, meaning that Wates has been less dependent on favourable weather conditions and local concrete supply, allowing them to deliver the building project on schedule."
        },
        {
            "text": " "
        },
        {
            "text": "Whitworth Community High School"
        },
        {
            "text": "Following our visit to Littleborough we went to Whitworth Community High School, a secondary school of 750 students, where we were joined by HM Treasury and Department for Education colleagues. The visit began with an explanation from the school's Headteacher, Gill Middlemas, on the complications with the current building and how the new school will be a landmark in the heart of the community. Students were similarly involved throughout the process, with taking part in the initial breaking of ground on the construction site. We were shown around the current school building and then donned our hardhats and boots to enter the construction site. The site follows a similar construction plan to the new Littleborough building, using a blend of MMC and traditional methods. Our tour finished with an excursion onto the roof to see the installation of the photovoltaic panels and the preparation of the soil for the green roof."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Building for the future"
        },
        {
            "text": "The projects we visited had many of the same features: partly due to the scale of the SRP allowing for knowledge and best practice to be shared across the programme, and also due to similarities in the current buildings occupied by these two school communities. Both the original schools were built using the Laingspan construction method (a flexible modular system of frame construction using precast pre-stressed concrete units), which a number of public buildings from the 1950s and 60s used, and have since come to the end of their lifespan. The interior layout of Laingspan buildings cannot be modified, as this would alter the tension of the concrete and cause further structural weaknesses. As such, these buildings require entirely new replacements. "
        },
        {
            "text": "The use of MMC in the two new schools has resulted in a time and cost efficient build and allowed for modular construction, a standard that will be implemented where possible  across the SRP. Furthermore, all schools built under the SRP are designed to be net zero carbon in operation. The new buildings for Littleborough and Whitworth have living roofs and enough photovoltaic panels to power the schools. Local insight and expertise has also been shared across the two construction projects to bolster them on the path to success. There has also been engagement with the local communities, taking on T Level placement students (post-16 technical qualifications) from Hopwood Hall College in Rochdale to be involved in the projects, and arranging food bank donations in collaboration with the school students."
        },
        {
            "text": "The sites we visited will be the first in the School Rebuilding Programme (SRP) to be handed back to the school communities, with both new buildings opening early in 2023 and designed to require little intervention in the decades to come. "
        },
        {
            "text": "Providing external advice, expertise, assurance and challenge, the IPA works alongside the Department for Education to ensure that programmes such as the SRP deliver on time and within budget forecasts, as well as to secure the maximum benefit for the public. It was wonderful to see this in practice and witness the positive change that well-executed programmes can bring to communities, both local and national. "
        }
    ]
}