{
    "url": "https://food.blog.gov.uk/2022/10/31/chairs-stakeholder-update-food-safety-must-be-carefully-considered-in-brexit-freedoms-bill/",
    "title": "Chair's stakeholder update - Food safety must be carefully considered in Brexit Freedoms Bill",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Business guidance",
        "Our mission"
    ],
    "pub_date": "2022-10-31T10:42:04+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The Brexit Freedoms Bill is a piece of legislation that could have profound implications for public health and businesses alike."
        },
        {
            "text": "This bill, also known as the Retained EU Law (Revocation and Reform) Bill, has been introduced to allow ministers to replace EU regulations and directives with new domestic legislation. It will ‘sunset’ any remaining laws at the end of 2023, meaning they will be repealed automatically unless it’s decided to extend, preserve, or replace them beforehand."
        },
        {
            "text": "In the FSA, we are clear that we cannot simply sunset the laws on food safety and authenticity without a decline in UK food standards and a significant risk to public health. While I’m sure this is not the Government’s intention with these plans, the current timeframe does cause me some concern. We will need to work through more than 150 pieces of retained EU law very quickly and to advise ministers on how best to incorporate important rules that safeguard food safety and public health within our domestic legislation. This is a very challenging task, and it inevitably means that we will have to deprioritise other important work."
        },
        {
            "text": "Ensuring that people have food they can trust remains our number one priority.  We also recognise this is an opportunity to review and reform these laws so that businesses have the right regulation to enable them to provide safe and trusted food, to trade internationally and to grow."
        },
        {
            "text": "In due course, we think a new UK Food and Feed Bill would provide the best opportunity for a comprehensive rethink, tailored to the needs of the UK. Our experience tells us that developing policy in an evidence-based, open and transparent way is better for consumers and for businesses, but this takes time to get it right."
        },
        {
            "text": "If you have any thoughts on the Retained EU Law Bill and its potential effects on food law, please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "Rhaid ystyried diogelwch bwyd yn ofalus yn Y Bil Rhyddid yn sgil Brexit"
        },
        {
            "text": "Mae Bil Rhyddid yn sgil Brexit yn ddarn o ddeddfwriaeth a allai gael goblygiadau dwys i iechyd y cyhoedd a busnesau fel ei gilydd."
        },
        {
            "text": "Mae’r bil hwn, a elwir hefyd yn Fil Cyfraith yr UE a Ddargedwir (Diwygio a Dirymu), wedi’i gyflwyno i ganiatáu i weinidogion ddisodli rheoliadau a chyfarwyddebau’r UE â deddfwriaeth ddomestig newydd. Bydd yn dirwyn i ben unrhyw ddeddfau sy’n weddill ar ddiwedd 2023, sy’n golygu y cânt eu diddymu’n awtomatig oni bai y penderfynir eu hestyn, eu cadw, neu eu disodli ymlaen llaw."
        },
        {
            "text": "Yn yr Asiantaeth Safonau Bwyd, rydym yn glir na allwn ddirwyn i ben y deddfau ar ddiogelwch a dilysrwydd bwyd heb beri dirywiad yn safonau bwyd y DU a risg sylweddol i iechyd y cyhoedd. Er fy mod yn siŵr nad dyma yw bwriad y Llywodraeth gyda’r cynlluniau hyn, mae’r amserlen bresennol yn peri peth pryder i mi. Bydd angen i ni weithio drwy fwy na 150 o ddarnau o gyfraith yr UE a ddargedwir yn gyflym iawn a chynghori gweinidogion ar y ffordd orau o ymgorffori rheolau pwysig sy’n diogelu diogelwch bwyd ac iechyd y cyhoedd yn ein deddfwriaeth ddomestig. Mae hon yn dasg heriol iawn, ac mae’n anochel yn golygu y bydd yn rhaid i ni ddad-flaenoriaethu gwaith pwysig arall."
        },
        {
            "text": "Ein prif flaenoriaeth o hyd yw sicrhau bod gan bobl fwyd y gallant ymddiried ynddo.  Rydym hefyd yn cydnabod bod hwn yn gyfle i adolygu a diwygio’r cyfreithiau hyn fel bod busnesau’n cael eu rheoleiddio yn y ffordd gywir i’w galluogi i ddarparu bwyd diogel y gellir ymddiried ynddo, i fasnachu’n rhyngwladol, ac i dyfu."
        },
        {
            "text": "Maes o law credwn mai Bil Bwyd a Bwyd Anifeiliaid newydd y DU fyddai’r cyfle gorau i ailfeddwl yn gynhwysfawr, gan deilwra i anghenion y DU. Mae ein profiad yn dweud wrthym fod datblygu polisi mewn ffordd agored a thryloyw sydd wedi’i seilio ar dystiolaeth yn well i ddefnyddwyr ac i fusnesau, ond mae hyn yn cymryd amser i’w gael yn iawn."
        },
        {
            "text": "Os oes gennych unrhyw syniadau am Fil Cyfraith yr UE a Ddargedwir (Diwygio a Dirymu) a’i effeithiau posib ar gyfraith bwyd, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}