{
    "url": "https://teaching.blog.gov.uk/2022/10/31/four-flexible-ways-to-make-ecf-training-work-for-you-and-your-early-career-teachers/",
    "title": "Four flexible ways to make ECF training work for you and your early career teachers",
    "authors": [
        "Various authors"
    ],
    "categories": [
        "Professional Development",
        "Support for ECTs"
    ],
    "pub_date": "2022-10-31T15:57:44+00:00",
    "content": [
        {
            "text": "The Early Career Framework (ECF) reforms were rolled out nationally in September 2021. We invited practitioners to share how they support their early career teachers (ECTs) to apply the content of the provider-led ECF based training programmes to their school’s context. "
        },
        {
            "text": "“If there is an area where the mentor has established their ECT is stronger, they will drip feed in other skills that may be a current priority to help their development. Since mentors can access all the ECF training modules in advance, they can use any of the lead provider resources they need to do this. We have also built up a bank of resources mentors can use including recordings of training sessions and exemplar lessons. ECTs are encouraged to film themselves teaching and critique in discussion with their mentors. This can negate the need for live observations if timetabling is a challenge.” "
        },
        {
            "text": "Samantha Morris, Assistant Principal, Ercall Wood Academy, Telford & Wrekin "
        },
        {
            "text": "“It’s so important that ECTs have a solid understanding of the core principles that are covered in the ECF, so revisiting them frequently is key. We make sure to discuss them often and help them see how to apply their knowledge in different contexts. This helps mentors too – our school has an established culture of lifelong learning and participating in ECF training is a vital aspect of that.” "
        },
        {
            "text": "Lyndsey Evans, Induction Tutor, Great Marlow School, Buckinghamshire. "
        },
        {
            "text": "“I work with my ECT to tailor the materials to the context of our school. We use the concepts as a base and explain how they look in our setting. For example, our pupils typically perform great in class but freeze up in a formal test setting. Our ECTs now have the confidence to explore how assessment evidence can be drawn from EYFS style explorations and outdoor curriculums.” "
        },
        {
            "text": "Adam Reay, Mentor, The Link School Springwell Dene Alternative Provision, Sunderland. "
        },
        {
            "text": "“I meet with mentors to talk, but more importantly to listen. We understand the importance of retaining mentors as they are experienced members of staff who often fulfil additional responsibilities. I feed back to the lead providers where necessary and work with them to address mentors’ concerns. Our mentors feel listened to, well represented, and know that they are valued.” "
        },
        {
            "text": "Lyndsey Evans, Induction Tutor, Great Marlow School, Buckinghamshire "
        },
        {
            "text": " "
        }
    ]
}