{
    "url": "https://dcmslibraries.blog.gov.uk/2022/10/31/libraries-celebrating-black-history-month/",
    "title": "Libraries Celebrating Black History Month",
    "authors": [
        "Scott Whitehouse, Libraries Development Officer, Staffordshire Libraries",
        "Jen Bell, Manager, Gateshead Archives",
        "Anna Dawes, Books, Reading and Culture Librarian, West Sussex Libraries"
    ],
    "categories": [
        "Case study",
        "Outcome: communities"
    ],
    "pub_date": "2022-10-31T09:38:50+00:00",
    "content": [
        {
            "text": "Each October, libraries across the country mark Black History Month through events and recommended reading.  Here are just a few examples.  It is a longer read than usual but we wanted to highlight the variety of activities libraries run to bring together their communities."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Staffordshire bringing stories of Black British History to a wider audience (Scott Whitehouse, Libraries Development Officer)"
        },
        {
            "text": "For the past three years, Staffordshire libraries have worked in partnership with director/producer Jason Young to share a series of short films, animations, radio plays and documentaries with library members and social media followers."
        },
        {
            "text": "Jason’s content focuses on the black British experience, much of it in the early nineteenth century, around the time of the abolition of slavery, and adds a new layer of depth to the narrative of black people in Britain at this time. The programmes, over two years, have included a radio drama, ‘The History of Mary Prince’, the story of first black woman, an abolitionist, to publish an account of her life in Britain. There was also the animated short feature ‘Tunstall’, the story of Samuel Barber, the first black British preacher in primitive methodism in Staffordshire. This slotted into our annual Staffordshire History Festival programme and drew attention to Staffordshire’s own place in the history of black people in Britain. The film seasons have also explored ‘The Horrors of Slavery’ in an experimental animation and ‘The Cato Street Conspiracy. There have also been films exploring the life of ‘The Chartist’ William Cuffay and ‘William Sharpe’, leader of the 1831 Christmas Rebellion in Jamaica and the life of the radical black preacher, Robert Wedderburn."
        },
        {
            "text": "Across 2020 and 2021 Jason’s films were viewed 300 times."
        },
        {
            "text": "This year, we worked with Jason to promote a new documentary, ‘William Cuffay: The London Chartist Leader.’ Jason says;"
        },
        {
            "text": "‘William Cuffay: The London Chartist Leader’ is still available to view until the end of October at https://youtu.be/ekwIRQ_FGAE and has had over 70 views so far."
        },
        {
            "text": "Jason recently wrote to us, explaining the significance of our partnership:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Black History Month at the Gateshead Archive (Jen Bell, Gateshead Archive)"
        },
        {
            "text": "Over the past three years Gateshead Archive has been working with partners to acknowledge Gateshead’s African and African-descended residents throughout the ages."
        },
        {
            "text": "In one of the least diverse regions in the country it was clear at Gateshead from the outset that we would need the right partners to guide our work …"
        },
        {
            "text": "In 2020, we engaged African and Caribbean genealogist Paul Crooks to run a series of events to staff and customers. Paul’s sessions gave us invaluable guidance and context about using historic records both here and in the Caribbean. Paul provided insight into British and Jamaican parish records, British Slave Registers and the role of resistance in the Caribbean in finally abolishing enslavement."
        },
        {
            "text": "Using existing Lottery funding we embarked on research to identify residents of African and Caribbean descent within Gateshead’s parish records during the 17th, 18th and 19th centuries. The research into the earliest records revealed people who were enslaved or who had sought freedom from enslavement."
        },
        {
            "text": "Slowly we began to build a picture of Gateshead’s links with people and places in the Caribbean – specifically in Jamaica. Connections emerged between Gateshead’s clergy (largely men from landed estates in Northumberland) and ownership of plantations in Jamaica where thousands of people were enslaved."
        },
        {
            "text": "At the same time, the Society of Antiquaries published its ‘African Lives in the Northern England’ booklet and we were able to reach out to editor Beverley Prevatt Goldstein, an academic, community activist and author."
        },
        {
            "text": "Bev challenged us to consider the questions and assumptions our research might raise. How would we distribute the research? Who would access it? What did it mean in terms of the broader picture of the region’s black history? Bev worked with us to edit a school pack about our initial findings. Both Bev and Paul were clear in helping us understand the importance of our findings representing a very narrow period and experience of black history."
        },
        {
            "text": "Three years on, in September this year, we visited a local secondary school with Paul where he described the period of enslavement as an ‘interruption’ to a long and proud African history.  He presented a new picture of African history to pupils, ranging from powerful African empires and the Egyptians to hundreds of years of successful trade across Europe – long before enslavement. This broader picture of black history was so very different to the usual taught curriculum the pupils had encountered."
        },
        {
            "text": "Bev penned an introduction to our school pack which made clear our next publication will provide balance to the findings by focusing on later residents and visitors with lives much broader than that of enslavement."
        },
        {
            "text": "Our work is ongoing and for this Black History Month, we presented our research with Bev to audiences through our annual History Festival. Paul continued to run sessions for us through local schools. A second calendar of ‘African Lives in the North’ was published by the Society of Antiquaries featuring one of the Gateshead residents identified through our research."
        },
        {
            "text": "But what next? What about the histories of the 20th century – what role did Gateshead’s black residents play in the World Wars, in Coal Mining (a key historic industry) and in our local NHS? For this we will need to make new links, find new sources and more experts to help us explore and interpret our collections."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "West Sussex film screening (Anna Dawes, Books, Reading and Culture Librarian)"
        },
        {
            "text": "On Wednesday 26 October West Sussex Libraries hosted the South London arts company Oxygen Arts for a screening of their film ‘Two and a Half Questions’. The film screening took place at Crawley Library as part of our events celebrating Black History Month."
        },
        {
            "text": "‘Two and a Half Questions’ is an exploration of the lives and aspirations of the Windrush generation and those who came after them. Working with a group of young people, the filmmaker, Clovis Lowe, captured interviews with people of Caribbean and African heritage from all walks of life, from lawyers and dancers to politicians, social workers and entrepreneurs."
        },
        {
            "text": "The film was a chance for young people in Lambeth to learn how to make a documentary-style film and learn practical skills such as camerawork, editing and sound. This was all taught by director Clovis Lowe and producer Marsha Lowe, through their work in their arts organisation Oxygen Arts. The project started just before the COVID-19 pandemic hit, meaning the timeline was longer than expected due to the various lockdowns. The end result is a film that is authentic, eye opening and incredibly important."
        },
        {
            "text": "‘Two and a Half Questions’ is simply shot, making the interviewees’ stories stand out and speak for themselves. Black people of all ages are asked the same two and a half questions (plus a bonus one) – How has your race shaped who you are? What is your hope for the future? How old are you? What do you do? Each person has a story to tell, from 14 year olds to 86 year olds. A shared experience from the people interviewed seemed to be a shift in awareness of their race when they came to Britain for the first time; “it was only in Britain that I became Black”. It was something they had not had to think of before. The interviewees in the film shared their experiences from school, the workplace, some even looking at their children’s experiences today. The film gave real insight into the harsh realities faced; the racism experienced, the need to work twice as hard to get anywhere, the idea that they will always be seen as being ‘other’."
        },
        {
            "text": "After the film screening, we were joined by Clovis and Marsha for a question and answer session with the audience about the thought-provoking topics raised by the film. By hosting the film screening in our library, it sparked organic conversations to be had around the themes of the film. A captivating discussion ensued about education, awareness and how important it is for stories and experiences to be heard."
        },
        {
            "text": "It is our passion at the Library Service to create a welcoming place for all, a safe space for people to come to. Our aim is to continue putting on more events which raise awareness of important issues and allow for powerful conversations to be had in order to grow and learn from each other."
        },
        {
            "text": "Want to read more stories by Black authors? We have created a Black Stories Matter reading list which is available on our West Sussex Libraries website, showcasing our favourite fiction and non-fiction books by black authors."
        },
        {
            "text": " "
        }
    ]
}