{
    "url": "https://charitycommission.blog.gov.uk/2022/10/31/making-a-difference-in-changing-times/",
    "title": "Making a difference in changing times",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Governance",
        "News"
    ],
    "pub_date": "2022-10-31T16:12:22+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Changing, and challenging, times "
        },
        {
            "text": "The backdrop against which we mark Trustees’ Week this year feels especially poignant. We are living through a period of considerable economic challenge, with rising costs placing many households in acute financial distress. As so often during difficult times, charities will be a central part of the collective response, helping those in desperate need, and offering community, courage and hope to us all. But charities themselves face pressures: rising demand on their services, increased costs, and the real risk of declining donations as many who were previously able to give are forced to tighten their belts. Coming so close on the heels of a global pandemic, which took some charities close to the brink, these pressures represent a huge challenge for many organisations."
        },
        {
            "heading": 2,
            "text": "Thank you "
        },
        {
            "text": "Trustees are ultimately responsible for seeing their charities through those difficulties – and in some cases making tough decisions about the charity’s future. It’s a significant responsibility, a real public service, and the majority are volunteers. Collectively, trusteeship is not given the platform it deserves. Trustees are too often unsung. Trustees’ Week is an opportunity to redress that – to celebrate the work of trustees and to acknowledge their contribution, passion, skill and commitment. So, I want to say a huge thank you, on behalf of the Commission, to trustees across England and Wales. What you do might not always be ‘seen’ in society at large, but we at the Commission know the difference you can make."
        },
        {
            "heading": 2,
            "text": "Guidance and support "
        },
        {
            "text": "I encourage trustees to take advantage of the opportunities that Trustees’ Week 2022 offers. There are scores of learning opportunities and resources available to trustees, made available by a wide range of partners. I also encourage trustees who are not yet familiar with our suite of 5-minute guides to seek these out. They offer the ‘core syllabus’ of topics that trustees need to get to grips with and are designed to meet the needs of busy trustees, whose time is precious and limited. We recently expanded the series with a new 5-minute guide on political activity."
        },
        {
            "heading": 2,
            "text": "Trustees of the future "
        },
        {
            "text": "While Trustees’ Week is principally about celebrating and supporting those who already volunteer, it’s also an opportunity to encourage more people to the role. We know, for example, that younger people, women, and people from diverse ethnic backgrounds can be underrepresented on charity boards. Charities are therefore missing out on a wider range of skills, talents, experiences, and perspectives. We want more people to consider what they might be able to give to – and indeed gain from – trusteeship. The rewards are many – from a sense of personal purpose and fulfilment to the acquisition of leadership skills, strategic understanding, experience of making decisions on finance, fundraising, governance, communications and much more. Our research with trustees indicates that most feel confident about their role, and many have a huge sense of pride in their responsibilities and enjoy dedicating time to being a trustee. We want to ensure more people have access to those benefits, so that charities in turn benefit from the talent and energy of people from all walks of life."
        },
        {
            "heading": 2,
            "text": "Hope during changing times "
        },
        {
            "text": "While the period we are living through is in many ways bleak, and many trustees must feel their responsibilities weigh heavily on their shoulders, I am not pessimistic. It is often in the face of serious challenge that charities demonstrate their resilience, and their capacity for innovation. Positive change can arise from difficulty – we saw this during the pandemic, when many charities made innovative and enduring changes to their services in response to restrictions. I am confident that, overall, the charitable sector will again demonstrate the invaluable contribution it makes to every community, and the whole of society – led, as always, by an exceptional army of unpaid volunteers – charity trustees."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}