{
    "url": "https://defradigital.blog.gov.uk/2022/10/31/rose-grant-why-my-family-history-is-important-to-me/",
    "title": "Rose Grant: Why my family history is important to me",
    "authors": [
        "Rose Grant"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-10-31T07:30:07+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "In Black History Month, Rose Grant shares some very personal reflections of her family’s journey from the Caribbean to London as part of the Windrush generation and how this has made her the person she is today."
        },
        {
            "text": "I am the youngest daughter of Mr and Mrs Grant, who left their sunshine paradise island of Jamaica back in the late 1950s and arrived by ship into the port of Southampton, as part of the Windrush generation of that era."
        },
        {
            "text": "My parents were married at Battersea Town Hall, in the Borough of Wandsworth, London. Dad was a skilled carpenter, with a passion for politics, who worked in building and construction. One of his jobs was fitting brass locks and doorknobs in the Houses of Parliament – they’re probably still there!"
        },
        {
            "text": "Mum was an auxiliary nurse, who worked nights and was always home in the mornings to get us all set off for school and Dad off to work. My super woman and role model, she never complained and always manged to keep the household in order with her traditional Jamaican principles in our British home."
        },
        {
            "heading": 3,
            "text": "Five years turned into 70 years"
        },
        {
            "text": "I always asked my parents why they left Jamaica, and their response was that they had a five-year plan to make a better life here in Britain and to help their family back home. Well, that five-year plan manifested into 70 plus years, and they even planned to return to Jamaica in their retirement."
        },
        {
            "text": "Mum loved her island and did return on many occasions before she passed away in Kingston Hospital, Surrey in May 2004.  Dad never got to return to his paradise island or pursue his political passion, but he was able to say he’d worked in the Houses of Parliament!"
        },
        {
            "text": "So, for me, they are my very first black British heroes. They managed, despite all the racial abuse, to keep an open door. They welcomed others into our family home and wherever we lived, all our neighbours, regardless of their origins, became a part of our extended family. Mum would always have a plate of Jamaican cuisine ready to share with them."
        },
        {
            "heading": 3,
            "text": "The things that shaped me"
        },
        {
            "text": "Do I think my family background has shaped who I am? One hundred percent! As I’ve shared, both my parents were of Jamaican heritage and brought the positive aspects of their own families into our lives here in the UK."
        },
        {
            "text": "They worked together to make sure they filled our home with unconditional love, not just for us but for anyone whom they encountered. Growing up, our home was very much a place of love where friends would come to sample my mum’s Jamaican dish of the day – there was always enough available to share."
        },
        {
            "text": "Do I feel my family background has impacted my time in Defra? Strangely enough, as I have matured and learned so many lessons during my Civil Service career path of 20 plus years, I feel that my family background has had a positive impact on my time in Defra."
        },
        {
            "text": "My Dad was a union man and political activist in his time. Despite not getting into politics, he really hoped that one day he could be a candidate for the local Labour party; he followed the politics in both Jamaica and the UK. Our local Labour MP often dropped by, and Mum would feed him with a plate of curry goat and rice."
        },
        {
            "text": "My grandparents were farmers and landowners in Jamaica. Having spent lots of time with them, I can relate to British farmers, as they work the land and supply natural food for others. From moving around the department, I recognise just how important it is to the lives of people in the UK, and the part Defra plays in protecting and improving agriculture and the environment, making the UK a better place for its citizens."
        },
        {
            "text": "This year’s Black History Month theme is ‘Time For Change: Action Not Words’. I think, being able to open our minds and share the positive things that are happening across our department, we can all find the things that make us proud to be Defra staff. In turn this means we are all contributing to improving the inclusive culture of our workplace."
        }
    ]
}