{
    "url": "https://civilservice.blog.gov.uk/2022/10/31/the-mental-health-and-wellbeing-conference-2022/",
    "title": "The Mental Health and Wellbeing Conference 2022  ",
    "authors": [
        "Flavia Gapper"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-10-31T17:19:54+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Flavia Gapper from The Charity for Civil Servants explains how this month’s conference is set to make a significant difference to improving mental health conversations at work."
        },
        {
            "text": "Now in its fourth year, more than 10,000 civil servants registered for this year's successful Mental Health and Wellbeing conference, which took place on 10th to 12th October. "
        },
        {
            "text": "As Director of Help, Advice and Services at the charity, I lead the team delivering in-house services including financial grants, debt advice, and wellbeing conversations. We also commission services from experts, enabling us to provide a range of wellbeing support for all civil servants and their dependents. Working with Civil Service HR and the staff networks has been brilliant. It’s helped us gain insight on the changing needs of civil servants, and with the workplace provision, we can complement workplace support, and offer the right mix of help. "
        },
        {
            "text": "Planning  "
        },
        {
            "text": "The last three conferences have taken place online, enabling us to reach even more civil servants. Although virtual appears to be a simpler channel to deliver, it does take a lot of work behind the scenes.  "
        },
        {
            "text": "As soon as the 2021 conference was over, we began planning for 2022, reviewing the feedback and our learnings. This year, we used a new platform to maximise our technology to access even more people for each session.  "
        },
        {
            "text": "We considered wellbeing challenges across the horizon, such as money health, and explored new developments such as the Women’s Health Strategy. We also explored issues raised frequently, such as support for autism, and the rise of domestic abuse cited by the people we help and the rise in long COVID.   "
        },
        {
            "text": "Alongside very present but evolving topics such as work-life balance, we focused on some new areas, including menopause and understanding trauma.    "
        },
        {
            "text": "We were delighted that  Sarah Healey, Permanent Secretary at the Department for Digital, Culture, Media and Sport and Civil Service Wellbeing and Disability Champion, opened our conference. Forging a working relationship with the organisation mainly through the Civil Service HR team, really does help support the conference, by promoting it across government. It also helps add to the rich variety of speakers really helps us underpin the importance of this event. "
        },
        {
            "text": "The charity’s Chief Executive, Graham Hooper, highlighted the importance of this event and our unwavering commitment to the wellbeing of civil servants past and present: “This year, more than 10,000 colleagues across the Civil Service joined the 2022 Mental Health and Wellbeing Conference, in partnership with Civil Service HR. Civil Service HR was, again, amazing at helping us organise one of the most important events in the calendar. Thanks to all our speakers, both from within and external to the Civil Service, who delivered excellent sessions to best support people.”  "
        },
        {
            "heading": 4,
            "text": "The conference "
        },
        {
            "text": "The menopause session was chaired by Angela MacDonald, Permanent Secretary at HM Revenue & Customs, one of several senior civil servants who raises support for menopause in the workplace. The panel shared their personal experiences, breaking the stigma of talking about menopause, and signposting support. People talked frankly about how they felt and their experiences, bringing home the importance of approachability for managers. As one panelist said, “You’ll never have all the answers, you just need to kickstart the conversation.” "
        },
        {
            "text": "The session on domestic abuse shared a moving lived experience from Fiona Bowman of the Employers’ Initiative on Domestic Abuse, underlying  just how difficult this issue can be for everyone. "
        },
        {
            "text": "Increasingly with cost of living pressures, our finances have a major impact on our wellbeing and the final session focused on practical solutions to tackle money worries.  "
        },
        {
            "text": "All the sessions included a live Q&A session led by Andy Jones, Help and Advice Administrator at the charity, who did a wonderful job of making sure as many questions as possible were put to the speakers."
        },
        {
            "text": "Graham Hooper added: “I’d like to say a special thank you to the tens of thousands of donors who continue to support The Charity for Civil Servants, without whom none of this would have been possible. We’re an independent charity, funded entirely by donations. We can only provide free help and events like this because of people like you, who donate and fundraise for the charity.   "
        },
        {
            "text": "The charity responds to a request for help every minute from colleagues across the Civil Service, but we can only continue to provide this help with your support. Whether signing up to donate £5 through payroll giving, raising money in your office, taking part in initiatives like festive fundraising, or playing the community lottery, your donations mean we can help colleagues get the help they need to overcome life’s challenges, and thrive.”  "
        },
        {
            "text": "Each of the six sessions has been pre-recorded and are available to watch on our website"
        },
        {
            "text": "I’m proud to be part of a dynamic charity that always has the people we help at its heart. We’re so appreciative of the support offered by civil servants to each other. The conference sessions are testimony to working together through change and remind us to keep looking after each other. "
        },
        {
            "text": "We hope there was something for everyone to take away from the conference, and look forward to your feedback to help us plan for next year.   "
        },
        {
            "text": "For information on  how you can access help or donate, please visit The Charity for Civil Servants’ website. "
        }
    ]
}