{
    "url": "https://space.blog.gov.uk/2025/11/06/blue-skies-space-to-launch-mauve-satellite-demonstrating-a-new-model-for-delivering-space-science-data/",
    "title": "Blue Skies Space to launch Mauve satellite, demonstrating a new model for delivering space science data",
    "authors": [
        "Blue Skies Space"
    ],
    "categories": [
        "Astronomy",
        "Delivering Missions and Capabilities"
    ],
    "pub_date": "2025-11-06T12:25:19+00:00",
    "content": [
        {
            "text": "Blue Skies Space, a UK-based company, is gearing up to launch its first science satellite, Mauve, aboard SpaceX’s Transporter-15 in November 2025."
        },
        {
            "text": "This innovative small satellite will observe stars in the near-ultraviolet and visible spectrum, providing valuable new insights into stellar activity and its impact on surrounding planetary systems."
        },
        {
            "heading": 2,
            "text": "A new model for space science delivery"
        },
        {
            "text": "Blue Skies Space aims to harness advances in the commercial space sector to accelerate and increase the supply of scientific datasets from space. "
        },
        {
            "text": "Space-based observations are fundamental to understanding the Universe, from the formation of galaxies to the conditions on potentially habitable planets. "
        },
        {
            "text": "Traditionally, such data has been delivered by flagship observatories like the James Webb Space Telescope and the Hubble Space Telescope, which continue to deliver groundbreaking discoveries but face high demand and limited availability. "
        },
        {
            "text": "Founded by researchers, Blue Skies Space’s vision is to complement major observatories with a fleet of small, agile, and cost-effective satellites. "
        },
        {
            "text": "By using off-the-shelf components, they can dramatically reduce both development costs and timelines. "
        },
        {
            "text": "For instance, Mauve has progressed from concept to launch in under three years; a fast pace for a space science satellite."
        },
        {
            "heading": 2,
            "text": "Understanding stars through time"
        },
        {
            "text": "Mauve will study a large population of stars in ultraviolet and visible light to better understand their magnetic activity, flares, and influence on the habitability of nearby exoplanets.Focusing on time-domain astronomy, the mission will reveal how stellar behaviour changes over time, uncovering phenomena invisible in single snapshots, such as energy bursts and transient emissions."
        },
        {
            "text": "Construction of the spacecraft was completed in June 2025, followed by a series of environmental tests to prepare for launch. It is now at the launch site awaiting a November launch aboard SpaceX’s Transporter-15. "
        },
        {
            "text": "Designed for a three-year mission, Mauve aims to demonstrate that small satellites can deliver high-impact science at low cost, made possible by advances in commercial launch and reusable space technologies."
        },
        {
            "heading": 2,
            "text": "Building a fleet of science satellites"
        },
        {
            "text": "Following Mauve, Blue Skies Space plans to launch Twinkle, a more complex satellite that will study exoplanets, planetary systems, and solar system bodies using visible and infrared spectroscopy. "
        },
        {
            "text": "Twinkle has been supported by the UK Space Agency as part of the European Space Agency’s ARTES programme. "
        },
        {
            "text": "The company is also exploring a larger ultraviolet telescope and, through a contract study funded by the Italian Space Agency, designing a fleet of satellites around the Moon to study radio signals from the cosmic dark ages."
        },
        {
            "text": "Data from these missions will be made available to the global research community through a membership access model, similar to ground-based observatories. "
        },
        {
            "text": "Researchers and institutions can subscribe for one or more years, gaining access to thousands of hours of observation time. "
        },
        {
            "text": "To date, over 20 institutions from around the world have already joined our programmes, demonstrating strong international support for this new science data delivery model."
        },
        {
            "text": "To learn more, visit https://bssl.space/"
        },
        {
            "heading": 3,
            "text": "Acknowledgement"
        },
        {
            "text": "This project has received funding from the UK Research and Innovation (UKRI)’s Horizon Europe Guarantee Scheme and the European Union’s Horizon Europe research and innovation programme under grant agreement No. 101082738."
        }
    ]
}