{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/06/going-dutch-to-strengthen-international-collaboration-on-screening-challenges-and-opportunities/",
    "title": "Going Dutch to strengthen international collaboration on screening challenges and opportunities",
    "authors": [
        "Andrew Anderson"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-06T17:10:40+00:00",
    "content": [
        {
            "text": "The charming Dutch city of Utrecht, renowned for its bell tower and picturesque canals, provided the perfect backdrop for the annual Nordic Screening Network meeting."
        },
        {
            "text": "Experts from the Netherlands, Denmark, Sweden, Iceland, Norway, the UK, and the Republic of Ireland gathered to share knowledge, discuss challenges, and explore innovative approaches to screening programmes."
        },
        {
            "text": "Individual and group conversations over the 2 days were as important as the formal presentations, giving everyone the chance to pick the brains of colleagues who are tackling similar challenges in other countries."
        },
        {
            "heading": 2,
            "text": "Knowledge exchange"
        },
        {
            "text": "Day one began with a welcome from our Dutch hosts Jerom van Geffen, from the Ministry of Health, Welfare and Sport, and Rob Riesmeijer, Head of the Centre for Population Screening at RIVM (Dutch National Institute for Public Health and the Environment)."
        },
        {
            "text": "Each delegation then gave a presentation about their respective national screening programmes using specially prepared posters. These provided valuable insights into the similarities and differences in the screening approaches between countries."
        },
        {
            "text": "A highlight of the first day was an interactive session on accessibility and people-centred approaches, led by RIVM’s Karin Honig."
        },
        {
            "text": "Then Professor Anne Mackie, Deputy Director of Screening at the Department of Health and Social Care which hosts the UK National Screening Committee (UK NSC), looked into her crystal ball to deliver a presentation on what the future might hold for screening, including multi-cancer detection tests (MCDs) and more tailored screening based on individual risk factors."
        },
        {
            "heading": 2,
            "text": "Practical collaboration"
        },
        {
            "text": "Day 2 was even more interactive, with parallel sessions that enabled delegates to dive deeper into specific topics of interest. Topics included:"
        },
        {
            "text": "There was a timely discussion on adapting cervical screening programmes for HPV-vaccinated populations. And the Swedish delegation led a fascinating session on artificial intelligence (AI) in screenings, highlighting the impact this technology is already having in shaping the future of population health programmes."
        },
        {
            "heading": 2,
            "text": "Building on strong foundations"
        },
        {
            "text": "The Nordic Screening Network demonstrates the power of international collaboration. It provides a platform where common challenges can be discussed and scrutinised and screening experts from different countries can learn from each other."
        },
        {
            "text": "The UK NSC is active and highly respected on the international stage. Other countries are keen to learn from the UK’s evidence-based approach to population screening."
        },
        {
            "text": "This year, we have already hosted screening delegations from Norway, Japan and China, held online meetings with experts from the US and Australia, and attended an international discussion on newborn genetics. These conversations demonstrate the value of cross-border collaboration in advancing screening programmes worldwide."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}