{
    "url": "https://companieshouse.blog.gov.uk/2025/11/06/how-companies-house-is-helping-businesses-prepare-for-identity-verification/",
    "title": "How Companies House is helping businesses prepare for identity verification",
    "authors": [
        "Esme Turner - Head of Campaigns, Insight and Education"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2025-11-06T14:27:18+00:00",
    "content": [
        {
            "text": "If you’re a business owner, you’ve probably heard about identity verification and the Economic Crime and Corporate Transparency Act. "
        },
        {
            "text": "Change is not always easy, especially when it comes to new rules and requirements. That’s why we’ve focussed on keeping our communications about identity verification simple and straightforward. We’re explaining:"
        },
        {
            "text": "From 18 November 2025, identity verification becomes a legal requirement. This date is not a deadline. It marks the start of a 12-month transition period, giving your company time to make sure all directors and people with significant control (PSCs) have verified their identity by their due dates. Any new director will need to verify their identity to incorporate a company or be appointed to an existing company."
        },
        {
            "text": "To help companies prepare, we’ve been running an awareness campaign across our communication channels to make sure everyone understands what’s changing and how to get ready. Since launching the voluntary verification period on 8 April 2025, we’ve seen a strong response with over one million people already verifying their identity."
        },
        {
            "text": "You’ll receive a personal code once you’ve successfully verified your identity. From 18 November, directors will need to provide their personal code as part of their company’s annual confirmation statement. Verifying early gives you plenty of time to get everything in order and avoid any last-minute stress. It also means that if an agent or accountant usually files on your company’s behalf, there’s time to share your code with them before it’s needed."
        },
        {
            "heading": 2,
            "text": "Keeping companies informed"
        },
        {
            "text": "Since 4 March 2024, all companies have been required to provide us with a registered email address. This is how we send important updates directly to your company, so you should check that you’re receiving our emails. If your registered email address is an agent’s or accountant’s email, make sure they’re passing everything on to you."
        },
        {
            "text": "If you need to update your company’s registered email address, it’s quick and easy. Providing a correct email address means you won’t miss important updates about identity verification or other company law changes."
        },
        {
            "heading": 2,
            "text": "Supporting identity verification"
        },
        {
            "text": "Our emails, guidance and videos have been designed to break everything down into clear, easy-to-follow steps. We’re helping companies to understand:"
        },
        {
            "text": "This approach is helping companies of all sizes to understand what they need to do, when to do it, and how to comply with the new legal requirements."
        },
        {
            "heading": 2,
            "text": "Reaching the right people at the right time"
        },
        {
            "text": "To reach as many people as possible, we’re sharing information in lots of different ways."
        },
        {
            "text": "Our Changes to UK company law campaign site is the central hub for all updates relating to the act. It's had over 700,000 views, which shows just how many businesses are keen to get it right."
        },
        {
            "text": "We’re sending direct emails to company registered email addresses and using the email reminder service many businesses already rely on. You’ll also see messages when using our online services, and updates across our website and social media channels. We’re working closely with trusted business organisations and networks to help share information, and using press and trade media to make our messages go further."
        },
        {
            "text": "We’re keeping a close eye on how our communications are performing to understand awareness and engagement. Insights from this monitoring are helping us to refine our messages, so that they're as clear and effective as possible as we progress into the transition year."
        },
        {
            "heading": 2,
            "text": "What to do next"
        },
        {
            "text": "If you’re a director or PSC, you should:"
        }
    ]
}