{
    "url": "https://mhclgdigital.blog.gov.uk/2025/11/06/introducing-the-mayoral-data-council-making-data-work-for-devolution/",
    "title": "Introducing the Mayoral Data Council: making data work for devolution ",
    "authors": [
        "Nick Webster, Mayoral Data Council Lead"
    ],
    "categories": [
        "Data",
        "Mayoral Data Council"
    ],
    "pub_date": "2025-11-06T13:57:40+00:00",
    "content": [
        {
            "text": "The Ministry of Housing, Communities and Local Government (MHCLG) is working with England's Mayoral Strategic Authorities (MSAs) to help ensure data drives effective devolution. We are bringing together local data leaders through the newly formed Mayoral Data Council (MDC) to influence national thinking and turn insight into impact for communities across England. "
        },
        {
            "heading": 2,
            "text": "Establishing the MDC "
        },
        {
            "text": "The MDC met for the first time earlier this year. It was created following the English Devolution White Paper, recognising that data must be front and centre as powers shift from Whitehall to local communities.  "
        },
        {
            "text": "MSAs are uniquely placed to deliver locally tailored solutions, but to do so effectively, they need robust data, shared expertise and a strong collective voice.  "
        },
        {
            "text": "This is where the MDC comes in and makes a difference. As a council of senior data leaders from all mayoral areas, it can champion better data, improve data sharing and build capability across government layers. "
        },
        {
            "heading": 2,
            "text": "The MDC in action "
        },
        {
            "text": "The MDC’s work falls into 3 areas: "
        },
        {
            "text": "The MDC regularly feeds the expert data view into senior forums like the Mayoral Council and Council of Nations and Regions, ensuring that data remains at the heart of devolution.  "
        },
        {
            "text": "With a 12-month plan and ways of working now established, the MDC is keen to start making a difference. "
        },
        {
            "heading": 2,
            "text": "The 12-month plan: ambition, collaboration and impact"
        },
        {
            "text": "For its foundational year, the MDC is focused on high-value, high-impact priorities. By the end of 2026, the MDC aims to: "
        },
        {
            "text": "And it’s not just about the data – it’s about people. The MDC wants senior leaders to become data champions, fostering a culture where evidence drives action. "
        },
        {
            "heading": 2,
            "text": "Why it's a game-changer for local government"
        },
        {
            "text": "In an era where data drives everything from bin collections to economic development strategies, the MDC represents something genuinely innovative – a forum where local expertise informs national policy, and where the people delivering services have a voice in shaping the tools they need to succeed. "
        },
        {
            "text": "For data professionals and local government workers, the MDC offers a glimpse of what collaborative government looks like when it's working at its best – ensuring devolution delivers real benefits for communities across England. "
        },
        {
            "heading": 2,
            "text": "Get involved and find out more about the MDC "
        },
        {
            "text": "The MDC wants to hear from data professionals, local government workers and anyone curious about how AI and data can transform public services. Contact us at AIforLG@communities.gov.uk. "
        },
        {
            "text": "Look out for future updates about the work of the MDC on the MHCLG Digital blog.  "
        }
    ]
}