{
    "url": "https://defraenvironment.blog.gov.uk/2025/11/06/meet-the-first-organisations-piloting-nature-investment-standards/",
    "title": "Meet the first organisations piloting Nature Investment Standards ",
    "authors": [
        "Meg Patel"
    ],
    "categories": [
        "Green finance"
    ],
    "pub_date": "2025-11-06T08:46:49+00:00",
    "content": [
        {
            "text": "I work in Defra’s Green Finance team, and our work involves mobilising private investment into nature restoration projects. These projects don’t just help the environment – they also create financial returns by selling benefits that ecosystems provide.   "
        },
        {
            "text": "For example, projects can create value by improving flood protection, enhancing carbon storage, or improving water quality. "
        },
        {
            "text": "A key part of our work is in scaling these markets and we have been working with our national standards setting body - the British Standards Institution (BSI) to develop the Nature Investment Standards to help.  "
        },
        {
            "text": "In this post, I want to tell you about how we're working with pioneering organisations to put the BSI Nature Investment Standards into practice through our early adopter pilot programme.  "
        },
        {
            "text": "Why we need standards  "
        },
        {
            "text": "Protecting and restoring nature in the UK needs both public funding and private investment. As nature markets have emerged – selling everything from carbon credits generated by peatland restoration to biodiversity credits from creating new habitats – we've realised something crucial: people need to trust what they're buying. "
        },
        {
            "text": "That's why we partnered with BSI to create the Nature Investment Standards Programme. In March 2025, BSI launched its first standard (BSI Flex 701), which sets out the core principles all UK nature market projects should follow. These include being transparent, measuring results properly, having good governance, and delivering real environmental benefits. You can find more details on the BSI Nature Investment Standards webpage. "
        },
        {
            "text": "But here's the thing – we needed to understand how these principles would work across all the different types of nature markets operating in the UK. That's where our early adopter pilot comes in. "
        },
        {
            "text": "Testing the standards in the real world  "
        },
        {
            "text": "The response to our pilot was incredible - we had over 50 organisations apply to try out the standards. Between now and March 2026, we will be working with a group of carefully selected organisations across different types of market participants from crediting programmes (providing design and supply requirements), project developers, market intermediaries and consultancies. They’re working across carbon, biodiversity, and nutrients markets. "
        },
        {
            "text": "Recognising the benefits to their organisation, these early adopters have committed to work with BSI experts as part of the pilot to identify what they need to do to meet the standards’ requirements. "
        },
        {
            "text": "Organisations involved  "
        },
        {
            "text": "The UK is a hot bed of innovation with early adopters listed below exploring new approaches to delivering environmental outcomes.  "
        },
        {
            "text": "Each of these organisations brings unique insights.  "
        },
        {
            "text": "Together, they're helping us understand how a single set of overarching principles can provide consistency across these markets and help bring much needed private investment into the natural environment.  "
        },
        {
            "text": "In the carbon space, the Peatland Code and Woodland Carbon Code continue their essential work quality-assuring peatland restoration and woodland planting that stores carbon. "
        },
        {
            "text": "Wilder Carbon is pioneering projects that restore multiple habitats and deliver both carbon and biodiversity benefits. We're also working with Ridge Carbon Structure and Zulu Ecosystem, who are bringing fresh approaches to carbon projects under the Peatland Code. "
        },
        {
            "text": "For biodiversity, organisations like Nattergal and Environment Bank are developing robust ways to measure and deliver biodiversity gains, making sure voluntary credits represent real improvements for nature. "
        },
        {
            "text": "In nutrient markets, EnTrade operates catchment-based trading platforms in places like Somerset, where farmers can generate credits by creating wetlands and changing how they manage their land. Carmarthenshire County Council will observe so they can take lessons into account when designing their own water quality markets.  "
        },
        {
            "text": "Evenlode works across multiple markets, connecting with farmers and land managers – essential work for building the supply side of nature markets.  "
        },
        {
            "text": "And in marine environments, Native Aqua is pioneering high-integrity credits from regenerative aquaculture, delivering benefits including improved marine biodiversity, nutrient reduction, carbon storage, and better water quality. "
        },
        {
            "text": "What happens next "
        },
        {
            "text": "By spring 2026, we'll have practical case studies and guidance showing how diverse organisations have put the standards into practice, making it easier for others to follow.  "
        },
        {
            "text": "If you would like to get involved, you can review the draft assessment guidance which is available for consultation until early December.  "
        },
        {
            "text": "Please visit the BSI Nature Investment Standards hub to sign up to receive updates on the upcoming and access the BSI’s standards navigation tool. "
        }
    ]
}