{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/11/06/patterns-for-the-global-public-sector/",
    "title": "Patterns for the global public sector",
    "authors": [
        "Andrew Knight",
        "Nicolás Rebolledo"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2025-11-06T12:00:00+00:00",
    "content": [
        {
            "text": "Patterns are one of the oldest design technologies, and yet they hold huge potential for the future of governments."
        },
        {
            "text": "In summer 2025, 48 government design teams from around the world came together to examine this potential through a series of mini-conferences focused on different sectors—Education, Health, Justice, Business & Trade, Local Places, Cross-Government Services, Welfare, Policing, and Tax."
        },
        {
            "text": "The global Public Design Conference, jointly hosted by the UK Civil Service and the Royal College of Art, brought together over 200 participants in London to explore how design patterns could transform public services worldwide. "
        },
        {
            "text": "The conference was part of the World Design Congress's Design Safari, bringing together over 200 participants — both in-person and online — to explore how design patterns could transform public services worldwide."
        },
        {
            "heading": 2,
            "text": "The oldest design technology"
        },
        {
            "text": "When we discuss patterns in government, it can seem like a relatively modern concept. But the idea of codifying and reusing what works runs deep in human history."
        },
        {
            "text": "Consider the Clovis points of prehistoric North America—fluted stone spearheads made 13,000 years ago, spread across vast distances in almost identical form. The point itself was the pattern, passed from maker to maker. Ancient Egypt used cubit rods—state-issued measuring sticks that ensured everyone worked to the same standard. Medieval guilds transmitted design knowledge through apprenticeships, guaranteeing quality and protecting craft reputations. Edo Japan's printed kimono catalogues enabled ordinary customers to browse designs and commission garments, scaling choice while allowing for local adaptation."
        },
        {
            "text": "In 1837, patterns became explicit government business. Britain established the Government School of Design (which became the Royal College of Art) to teach artisans how to apply patterns to ceramics and textiles. This was an industrial strategy—patterns as statecraft to make British goods competitive."
        },
        {
            "text": "In the 1960s, architect Christopher Alexander formalised this practice into \"pattern languages\"—documented, repeatable solutions for complex design challenges. This laid the foundation for how we think about design patterns today across architecture, software development, and service design."
        },
        {
            "text": "Patterns are among the oldest design technologies we have, carrying values that have always shaped how societies create, share, and govern."
        },
        {
            "heading": 2,
            "text": "Taking patterns into the future"
        },
        {
            "text": "The conference explored design patterns as \"evidence-based solutions to common design problems\" - reusable building blocks that help governments avoid reinventing the wheel and learn from each other's experiences. Our goal was to identify emerging patterns across different governments and explore opportunities for international collaboration in developing and sharing them."
        },
        {
            "text": "A key insight emerged: design patterns in government operate at multiple levels simultaneously. They exist as nested hierarchies - from micro-level digital interactions to macro-level life event journeys that span multiple agencies. Patterns function as containers within containers, offering reusable solutions that can scale from individual user actions to systemic reforms."
        },
        {
            "text": "The conference featured presentations from Christian Bason (Transition Collective), Sabine Junginger (Northumbria School of Design), and Nikola Goger and Martin Forde-Downs (Ministry of Justice). Teams from our summer mini-conferences shared their insights, and audience members participated in activities led by designer volunteers."
        },
        {
            "text": "You can watch this video to see what public design leaders say about the potential of patterns in government."
        },
        {
            "heading": 2,
            "text": "Introducing our blog series on patterns"
        },
        {
            "text": "Over the coming weeks, we'll publish blog posts from the international teams that formed during our conference season. These sector-specific public design teams explored what patterns are and how they might be used in the future. Each team developed a distinct vision of what that future could look like."
        },
        {
            "heading": 2,
            "text": "A volunteer-powered event"
        },
        {
            "text": "Congratulations to everyone who made this happen."
        },
        {
            "text": "The event was coordinated by a dedicated team of volunteers led by Gael Welstead (HMRC), Mandy Gao (HMRC), Helen Simpson (GLA), Jessica Bergs (DSIT), Julie Aberdein (Defra), Tessa Fearnley (HMRC), Dejana Dragnic (HMRC), Komal Pahwa (HMRC), Stuart Bolton (DfE), Yemi Medeyinlo (MHCLG), Samuel Akintunde (Cabinet Office), Sam Villis (DHSC), Sally Stephens (UKHSA), Elli-ana Morley (MOD), Qing Wang (Defra), and Zara Bobat (HMRC), alongside community leaders who served as points of contact for each mini-conference."
        },
        {
            "text": "We're grateful to the School of Design at the Royal College of Art: Prof. Kerry Curtis (Dean), Prof. Qian Sun (Head of Service Design), Peter Christian (Head of Executive Education), Dr Nick de Leon (Knowledge Exchange), and Sophia March (Admin support), plus more than ten RCA Service Design graduates who contributed their expertise."
        },
        {
            "text": "We are proud to be part of a brilliant series of events organised by World Design Organization and Design Council."
        },
        {
            "text": "And finally, thank you to the participating government design teams from the UK and around the world."
        }
    ]
}