{
    "url": "https://publicguardian.blog.gov.uk/2017/08/23/lasting-powers-of-attorney-a-powerful-tool-and-an-important-choice/",
    "title": "Lasting powers of attorney: a powerful tool and an important choice",
    "authors": [
        "Shaun Elliott"
    ],
    "categories": [
        "Attorneys",
        "Digital",
        "Future planning",
        "General",
        "Guidance",
        "health and welfare",
        "lasting power of attorney",
        "LPA",
        "Mental Capacity Act"
    ],
    "pub_date": "2017-08-23T14:34:54+01:00",
    "content": [
        {
            "text": "Shaun Elliott, Customer Service Manager at OPG, outlines a few things to think about when completing a lasting power of attorney (LPA) application."
        },
        {
            "text": "An LPA is the only way that someone can choose who they trust to manage their affairs if they lose mental capacity and aren’t able to do so themselves."
        },
        {
            "text": "Deciding to take out an LPA is a very important decision. So it’s important to know that there’s plenty of help and guidance available, from how to choose someone you trust (the most important step), to setting out how you want your affairs to be taken care of."
        },
        {
            "text": "If your affairs are straightforward, you may prefer to fill in an application yourself or with a partner, family member or trusted friend. You may also choose to take specialist advice at additional cost."
        },
        {
            "text": "Our online application process gets great user feedback, with a 90%+ approval rating. We’ve found that even professionals use it as it helps prevent errors by giving the right prompts and advice at each stage."
        },
        {
            "text": "Sheila, a donor, discusses who she chose to act as her attorneys and how she went about applying."
        },
        {
            "text": "Here are some things to remember."
        },
        {
            "text": "For instance, you might have to go into hospital and want a family member or a friend to sort things out for a few weeks. You may choose to do some things yourself but allow someone else to do others. This can be set out in advance."
        },
        {
            "text": "In one of our recent guest blogs Giles Meyers, Interim CEO at Carers Trust, discussed the importance of LPAs. He shared a carer’s experience that without an LPA they had problems and financial hardship in supporting their father. Also that the benefits of an LPA outweigh the cost in time, money and stress later on."
        },
        {
            "text": "There’s lots more information available on GOV.UK to help you make and register LPAs, and learn more about making decisions on behalf of others."
        }
    ]
}