{
    "url": "https://gfie.blog.gov.uk/2022/08/11/breaking-down-walls/",
    "title": "Breaking Down Walls",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-08-11T12:57:08+01:00",
    "content": [
        {
            "text": "Engaging with people is a huge part of what we do as a Going Forward Into Employment team, in fact it's pretty much key to our success."
        },
        {
            "text": "We know that people leaving prisons or with unspent convictions can face barriers to employment, and many of these are related to what people think or how they feel - whether it is a manager who has misconceptions about people who have been in prison, or someone with lived experience believing that the Civil Service isn’t a potential employer for them because of their backgrounds. "
        },
        {
            "text": "Virtual meetings and networking are great, and have helped us to keep conversations going during the pandemic, but nothing beats making new connections in person and giving people the opportunity to find out more about each other. This is particularly important when it comes to prisons, when the people inside are separated from the community and there is a physical barrier in the shape of the walls. "
        },
        {
            "text": "We recently led two visits to HMP Sudbury and HMP Berwyn, bringing together colleagues from across the Civil Service to see the prisons, and meet with staff and prisoners, and all with one shared objective - to break down some walls and start making the links that lead to employment opportunities (and in turn hope) for people on release. Read on if you’d like to find out how we got on!"
        },
        {
            "heading": 2,
            "text": "More about our visits"
        },
        {
            "text": "HMP Sudbury is a Category D prison, which means that it is an open prison and the men there are progressing towards release. Many of these men go out to work each day, with numerous prisoners leaving the grounds to work and returning in the evening each day. "
        },
        {
            "text": " "
        },
        {
            "text": "As a Category C prison, HMP Berwyn similarly has a strong focus on employment and resettlement for those nearing the end of their sentence.  Opening in 2017, it is the largest prison in the UK, with 20-30 men released from the prison each week "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "We were joined by colleagues from the Department for Business, Energy and Industrial Strategy, Her Majesty’s Revenue and Customs, Food Standards Agency, Cabinet Office, Office of National Statistics, Ministry of Justice and New Futures Network. Many colleagues hadn’t been in a working prison before, so part of the visit aims to demystify life behind the walls. "
        },
        {
            "text": "Each visit featured a tour of the prison and its facilities, with both HMP Sudbury and HMP Berwyn showcasing the support that was on offer - HMP Sudbury with an on-site garden centre selling produce from the market garden tended to by the prisoners, and HMP Berwyn with an Resettlement Hub which brought together all the key services such as Housing, Benefits and Employment support. We saw vibrant Education departments, offering courses in a variety of subjects for those who wanted to improve their prospects via qualifications. "
        },
        {
            "text": "We also held information sessions for groups of prisoners who wanted to hear more about the Civil Service opportunities on offer. Many of our visitors said this was the best part of their day, and we enjoyed hearing from the men about what interested them about working for the Civil Service and their hopes for the future. There was a common theme from many about wanting to make a difference and help people, particularly when they had faced difficult experiences in their lives and felt this could be channelled in a positive way."
        },
        {
            "text": "It was great to see opportunities we had provided displayed in the employment hub and prisoners asking us about the work and roles to find out more - after all, the Civil Service does have a massive range of different departments and roles!"
        },
        {
            "heading": 2,
            "text": "What we heard"
        },
        {
            "text": "We asked people who were involved in the visits to tell us their thoughts on the day, and wanted to share some snippets.."
        },
        {
            "text": "‘Overall, the visit helped me to understand the importance, both individually and at a societal level, of positive and secure employment options for prison leavers. Among the group of prisoners we met it was clear that they had a strong desire to work after release.’"
        },
        {
            "text": "‘It will help me to challenge people’s conceptions of prisoners and their ability to find gainful employment.’"
        },
        {
            "text": "'I have had so many approach me to thank us and let me know how excited they are about the potential for it.  You have all started to spread some hope for the guys, which is so important.  Word spreads around the Prison so fast, and with it, this hope also.'"
        },
        {
            "text": "'The fact you all came to visit meant so much.  To see and listen to you meant that these were not just ‘vacancies’ on the wall.  It shows that they really are genuine opportunities.'"
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "It's important to build on these visits and maintain our engagement, making sure that the hope becomes a reality for those we met.  We have plans to go back to provide support to staff and people in prison - so keep an eye out for a future blog to follow us on our journey to what happens next!"
        },
        {
            "text": "In the meantime if you want to know more about GFiE then take a look at our recent series of 'All About GFiE' blogs and follow us on Twitter @CS_GFiE."
        },
        {
            "text": "If your a departmental representative who would like to come on one of other visits later this year then drop us an email at GFiE@cabinetoffice.gov.uk."
        },
        {
            "text": " "
        }
    ]
}