{
    "url": "https://defrafarming.blog.gov.uk/2022/08/11/environmental-land-management-a-forward-look/",
    "title": "Environmental land management: a forward look ",
    "authors": [
        "Ellen Brown"
    ],
    "categories": [
        "Payments to make space for nature",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-08-11T12:10:34+01:00",
    "content": [
        {
            "text": "Through our new environmental land management schemes, we will pay farmers and land managers to enhance the natural environment alongside food production."
        },
        {
            "text": "We recently opened the Sustainable Farming Incentive for applications. This year, we're offering 3 standards. Over the next 3 years, we will expand the scheme. We will add more standards and levels of ambition as more money is released from basic payments (BPS)."
        },
        {
            "text": "Next year, we will roll out an early version of our new Local Nature Recovery scheme to a limited number of people. Local Nature Recovery builds on Countryside Stewardship."
        },
        {
            "text": "Through these 2 schemes, along with the large-scale bespoke Landscape Recovery projects, farmers and land managers will make a significant contribution to biodiversity, air quality, water quality and climate change mitigation and adaptation. "
        },
        {
            "text": "For example, improving soil health or making space for nature alongside farming by creating, maintaining and enhancing habitats on less productive or more difficult to manage areas of their farm. "
        },
        {
            "text": "These actions help us to reach our environmental targets. They will also contribute to the sustainability of farming for future generations. We are also considering how to maintain investment in heritage, access and engagement as part of our new schemes. "
        },
        {
            "text": "To plan ahead, farmers need to know what will be available through these schemes. We blogged about our plan to expand the Sustainable Farming Incentive over the next 3 years. "
        },
        {
            "text": "Later this year, we will publish full details of the 2023 Sustainable Farming Incentive standards and payment rates. We will also provide more detail on those to be rolled out."
        },
        {
            "text": "This post gives more information about how we expect Local Nature Recovery to work. Later this year we will publish more details of the options that will be available and the early roll out."
        },
        {
            "heading": 2,
            "text": "How agreements will work "
        },
        {
            "text": "Local Nature Recovery agreements will be with individuals, businesses or entities such as commons associations. "
        },
        {
            "text": "There is no requirement to work with others in your area, or any other organisations.  However, we want to encourage, enable and reward people to work together in local areas and take joined-up action to achieve bigger and better impact where that’s possible and appropriate. "
        },
        {
            "text": "For example, joining up agreements for land along rivers could maximise efficiencies for farmers and environmental outcomes. "
        },
        {
            "text": "We are testing ways of doing this through our tests and trials and will use the learning from those to inform the design of the scheme. "
        },
        {
            "text": "As 70% of land in England is agricultural, we expect most of the participants in the scheme to be farmers, though other land managers are eligible —  as they are in existing schemes. "
        },
        {
            "text": "We want all types of farmers to take part, including commoners and tenant farmers, small farms, and those with a Site of Special Scientific Interest (SSSI) on their land. We are designing the scheme to actively enable this. "
        },
        {
            "text": "We’re looking at how we can apply some of the flexibility we’ve built into the Sustainable Farming Incentive to Local Nature Recovery.  This includes considering how to make changes mid-agreement and flexible application windows so agreements begin when it works best for you. "
        },
        {
            "text": "As is the case with the Sustainable Farming Incentive, it will be possible to enter part of your land into Local Nature Recovery —  we don’t plan to include a requirement for the agreement to cover the whole farm. "
        },
        {
            "text": "It will be possible to have both Sustainable Farming Incentive standards and Local Nature Recovery options, so long as the actions are compatible and we’re not paying you twice for the same actions.  "
        },
        {
            "text": "We are working to make our new schemes accessible and less bureaucratic."
        },
        {
            "text": " You’ll be able to access Sustainable Farming Incentive standards and Local Nature Recovery options through a single service, and this service will also be the place to find capital grants and information about regulations. We'll blog about the single service approach in more detail soon. "
        },
        {
            "text": "All standards and options will be presented in a clear and straightforward way. "
        },
        {
            "heading": 2,
            "text": "What we’ll pay for "
        },
        {
            "text": "Sustainable Farming Incentive standards pay for actions that can be taken by any farmer to enhance the natural environment in the course of their farming activities. The scheme is designed to be straightforward, widely accessible and applicable. "
        },
        {
            "text": "Local Nature Recovery will provide further, more targeted options. It will pay farmers and land managers to create, maintain and enhance habitats and other environmental features alongside farming, either in small, less productive or difficult to manage areas of the farm, or on a larger scale where that’s appropriate.  "
        },
        {
            "text": "Local Nature Recovery will pay for options, like Countryside Stewardship, and will operate in a similar way but with improvements that address feedback from previous schemes. "
        },
        {
            "text": "Farmers and land managers will be able to select the range of options that works for them. As well as many of the options currently available in Countryside Stewardship, we’ll also add new options to help us meet our ambitious environmental targets. "
        },
        {
            "text": "For those already in Countryside Stewardship or Higher Level Stewardship, you’ll be able to continue the work you’ve started in those schemes through a combination of Sustainable Farming Incentive standards and Local Nature Recovery options. You'll also be able to add in more ambitious actions. "
        },
        {
            "text": "We plan to make this transition as seamless as possible. Entering into a Countryside Stewardship agreement now will provide a good stepping stone to both the Sustainable Farming Incentive and Local Nature Recovery. "
        },
        {
            "text": "There are already around 30,000 farmers in existing schemes and we have reviewed the payment rates and revised them up, on average, by around 30%.  "
        },
        {
            "text": "We don’t plan to restrict the options available in any particular area, other than where they might cause damage or will not be capable of achieving their aims. For example: tree planting on established floodplain meadows or habitat creation for certain species that is outside their natural range, respectively. "
        },
        {
            "text": "However, we do want to encourage and reward action in places where there is the potential to maximise impact, and we are testing ways of doing this. "
        },
        {
            "text": "We plan to provide a mix of one-off and ongoing payments, to support capital investment and creation as well as the ongoing costs of maintaining and enhancing the natural environment.  "
        },
        {
            "text": "We are working collaboratively with farmers and other land managers to design the options. We’re making them less prescriptive and more flexible than existing schemes so that they are easier to work with across a range of farm settings.  "
        },
        {
            "text": "A few months ago, we shared more information on what Local Nature Recovery will pay for. "
        },
        {
            "text": "We will publish more information on the options and payment rates later this year, along with information about how those in existing schemes will be able to transfer across to Local Nature Recovery. "
        },
        {
            "heading": 2,
            "text": "Payment rates "
        },
        {
            "text": "We expect to base payment rates for options on an updated calculation of income foregone plus costs. This is the fairest way to set consistent prices and provide a predictable and stable income from schemes.  "
        },
        {
            "text": "We are continuing to test how we could pay more to incentivise really ambitious actions and additional results, doing the right things in the right places where this delivers better outcomes, and local join-up to achieve greater impact. "
        },
        {
            "text": "We may introduce some or all of these features into the scheme, depending on what we learn in our ongoing testing and early rollout of the scheme. "
        },
        {
            "heading": 2,
            "text": "Local Support "
        },
        {
            "text": "Through our tests and trials work and conversations with farmers, we have consistently heard about the importance of local advice and facilitation. We want farmers to be able to work together to deliver bigger and better outcomes, and local advisers can play an important part in making that happen. "
        },
        {
            "text": "We’re also looking at what we can learn and replicate from Catchment Sensitive Farming and Farming in Protected Landscapes, where there has been positive feedback about the way advice and support are provided.  "
        },
        {
            "text": "More information about our plan for advisers will be published later this year. In the meantime, we want to encourage farmers to take up existing offers of support through the Future Farming Resilience Fund to work through how they can best position themselves for the future.   "
        },
        {
            "text": "We’ll also have a new facilitation offer building on what we’ve learned from the Countryside Stewardship Facilitation Fund. We are working on how we can make this more flexible and straightforward than the existing offer, as well as potentially adding new features such as advice. "
        },
        {
            "heading": 2,
            "text": "Rollout plan "
        },
        {
            "text": "We will continue to design and test the more innovative elements of the new scheme throughout 2022 and into 2023. This will complement what we learn from tests and trials.  "
        },
        {
            "text": "We plan to make core elements of the scheme available to a limited number of people from 2023, and will roll out the full scheme to all by the end of 2024.  "
        },
        {
            "text": "Similar to the Sustainable Farming Incentive, we will iterate and improve the scheme over time in response to feedback and learning about what works.  "
        },
        {
            "text": "Together the Sustainable Farming Incentive standards and Local Nature Recovery options will form a complete offer to farmers to get paid for producing environmental outcomes alongside food production. "
        },
        {
            "text": "We are working with farmers to design the standards and options together to make sure they complement each other and work on the ground. "
        },
        {
            "text": "We’ll continue that co-design work as we roll out the schemes so that we can improve them as we go.  "
        },
        {
            "heading": 2,
            "text": "Next Steps "
        },
        {
            "text": "Later this year, we will publish more details on the Sustainable Farming Incentive standards and Local Nature Recovery options."
        },
        {
            "text": " We will also provide more information on how farmers in Countryside Stewardship and Higher Level Stewardship agreements can move into the new environmental land management schemes. "
        },
        {
            "text": "Following this:   "
        },
        {
            "text": "If you have any questions about our approach, do leave a comment below."
        }
    ]
}