{
    "url": "https://environmentagency.blog.gov.uk/2022/08/11/environment-agency-takes-action-to-rescue-fish-during-dry-weather/",
    "title": "Environment Agency takes action to rescue fish during dry weather",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Fisheries and biodiversity",
        "Water"
    ],
    "pub_date": "2022-08-11T13:46:20+00:00",
    "content": [
        {
            "text": "The prolonged dry weather is affecting many rivers and lakes across much of central, south-west, south-east and eastern England."
        },
        {
            "text": "The dry weather and hot temperatures have taken their toll on the water environment. Already this year we have received reports of over 200 dry weather incidents, and we expect this figure to increase.  These incidents will be far greater than in 2021 and likely to be greater than at any time during the last period of dry weather (2017-2020). While we are awaiting confirmation of the long term environmental impact of some of these events, we are seeing abnormally low river flows, ponds drying out, fish in distress and an increase in algal blooms."
        },
        {
            "text": "Fish are an excellent barometer of the health of our waterways and often the first casualties when conditions deteriorate. Not only are fish a major component of our aquatic biodiversity, but they support important recreational fisheries, enjoyed by 1 million anglers across the country."
        },
        {
            "text": "Low river flows can mean migratory salmon and sea trout, known for their ability to leap waterfalls and weirs, now face more challenges as they make their epic journey upstream to spawn. As water levels fall and temperatures rise in both still and flowing waters, algal blooms can develop quickly and sap the dissolved oxygen from the water, putting large numbers of fish at risk. In some waters, an increase in water temperature alone can kill large and sensitive fish species."
        },
        {
            "text": "We will see more summers like this, as the changing climate continues to affect our weather. So, it is important that we - the Environment Agency, our partners, the angling community and the wider public – act early to safeguard our precious aquatic biodiversity."
        },
        {
            "text": "The Environment Agency’s fisheries service is 100% funded by fishing licence income – you can get a fishing licence here. The unique way we are funded allows us to protect and enhance fisheries for people, the environment and, of course, angling. Every year, the Environment Agency reminds fishery owners to prepare for dry and warm weather, to make sure they have done what they can to avoid or minimise the risks of fish deaths in their waters. Through written advice and guidance, workshops and social media, we advise on managing water levels to maintain cooler deep water for fish to take refuge in and to carry out any fishery management work early in the year to avoid placing extra stress on fish. It’s important for fishery operators to take dissolved oxygen readings to get an early warning of an incident developing and to have access to aerators if they suddenly find they need to react. In many cases, we have used the income we receive from fishing licence sales to part-fund this equipment for clubs. Some angling clubs are taking full advantage of mobile technology, linking their remote oxygen meters directly to a mobile phone so they get instant alerts. Over time, more and more fisheries have invested significantly in the equipment and infrastructure to offset the worse impacts."
        },
        {
            "text": "Fishery owners and anglers are also increasingly ready to choose not to fish during severe conditions. Fisheries on the Hampshire Avon routinely close when the river water temperature exceeds 19°C at 09.00 in the morning. On the Herefordshire Wye, a voluntary agreement not to fish on many stretches is in place until conditions for the fish improve. And on the Norfolk Broads, we and local angling interests are encouraging anglers not to fish for pike during the summer months. Many other angling clubs and individuals are taking similar measures."
        },
        {
            "text": "Environment Agency fisheries officers also work with their partners to prepare for and mitigate the impacts of prolonged warm and dry weather. This may be working with landowners to provide greater shade by planting more riverside trees or with a local river trust to build and maintain fish passes to give already vulnerable salmon a better chance of reaching their spawning grounds (and to all their progeny to migrate downstream to the sea). Many of our projects to restore river and still water habitats will also include measures to mitigate for the increased risk of dry weather."
        },
        {
            "text": "But perhaps our most visible work in response to the extreme weather is our “emergency” service. Every year, we respond to hundreds of reports of fish in distress because of dry and warm conditions. Where fish are trapped in drying sections of river, we need to act quickly to catch and transfer them to neighbouring reaches. They will wait here until autumn when rainfall allows them to recolonise upstream. Where a still water coarse fishery shows signs of an algal bloom developing or where fish are already in distress, we will deploy emergency aeration to boost dissolved oxygen levels. Aeration comes in all shapes and sizes, from propeller and paddlewheel aerators to injecting hydrogen peroxide directly into the water. Usually, aeration simply provides a refuge where fish can congregate until more favourable conditions return. We only have a limited number of aerators and, in a warm summer, sometimes not enough to go around. We always encourage fishery operators to buy or even to make their own – see how to here."
        },
        {
            "text": "Less visible is how we manage river flows to sustain conditions for fish and other wildlife. River augmentation schemes - releases from reservoirs and from groundwater – keep flows from falling below critical levels and are often timed to help migrating fish upstream or to sustain them and other species until natural flows return. A good example of this, as reported in our last blog, is the River Severn Regulation, where reservoir and groundwater releases are used in combination to maintain flows in the lower river. Similar schemes operate on other rivers around the country."
        },
        {
            "text": "Our work doesn’t stop once the immediate incidents have receded. We will advise angling clubs and fishery owners on managing the number and weight of fish in their water and how to reduce or prevent algae blooms, enhancing the habitat to make rivers and still waters more resilient to the impacts of warm weather, including providing shade for fish and other wildlife. Cropping the number of fish in a still water helps avoid future problems and provides a ready source of fish for stocking elsewhere."
        },
        {
            "text": "Being prepared is a great start in the response to any incident."
        },
        {
            "text": "We encourage all water users to take care when in and around rivers, to avoid disturbing fish and other wildlife that are already under pressure from the warm, dry conditions. If you see any fish in distress or suspect a fish disease outbreak, please tell us immediately by calling the Environment Agency’s National Incident Hotline on 0800 80 70 60."
        }
    ]
}