{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/08/11/its-complex-not-complicated/",
    "title": "It’s complex, not complicated",
    "authors": [
        "Jeffrey Allen"
    ],
    "categories": [
        "Case study",
        "Thought leadership"
    ],
    "pub_date": "2022-08-11T12:00:01+01:00",
    "content": [
        {
            "text": "Most of the insufficiencies of government can be traced back to a fundamental misunderstanding about how to ‘solve’ the problems society faces."
        },
        {
            "text": "As humans, we seem to be hard-wired to see the world in terms of discrete problems we can solve. Our brains are always breaking things down to their component parts, looking for ways to fix them. We are constantly seeking greater and greater simplicity."
        },
        {
            "text": "And that works for math problems, or engineering problems. You solve the component parts of the problem — no matter how many there are — until the whole fits together perfectly. We can do that to make a concrete block, or to build a wall from those blocks, or to build a prison from those walls."
        },
        {
            "text": "But building a prison system that keeps people safe and creates a healthier society — that is another matter. It’s not simply a question of compiling all the right parts and assembling them in the right way. A prison system — one that ensures safety and promotes rehabilitation — has an infinite number of component elements, all of which are interrelated and continuously changing, often in unpredictable ways. That is what we call a ‘complex’ (or ‘wicked’) problem."
        },
        {
            "text": "The vast majority of problems government addresses are these kinds of ‘complex’ problems. How to reduce crime. How to educate our children. How to increase prosperity and keep people healthy. There is no one right answer to these problems — there are just better or worse situations we find ourselves in."
        },
        {
            "text": "Complexity theory tells us that the way to tackle complex problems is completely different from how we tackle discrete problems with a finite number of variables. For those kinds of problems — even the most complicated ones — we bring in the experts and let them analyse the situation and draw up a blueprint for how to best fix it. Think of a skyscraper — you hire an architect to map out exactly how everything will fit together, and then building engineers with expertise in each step of the process. But in that case, you are able to map out exactly what the end solution will look like from the beginning. The ground is not shifting beneath you."
        },
        {
            "text": "In complex situations, however, there are no tried and tested answers and everything keeps changing. This is what architect Ann Pendleton-Jullian and scientist John Seely Brown call living “in a white-water world”. We must tackle those challenges differently, through a process of probing, sensing how things change, and reacting to those changes — in other words, a process of quick, continuous, and never-ending experimentation. You want to reduce crime and make communities safer in this particular society at this particular moment in its cultural, economic, and political history… you want to educate young people more effectively, improve people’s health, make work more rewarding… there is no blueprint for any of these, the ‘answers’ will only be found through continuous rapid experimentation."
        },
        {
            "text": "And I put ‘answers’ in quotation marks because we must get comfortable with uncertainty. In fact, there are no right or wrong answers — in complex situations we are constantly operating in uncertain waters. But what we can do is stubbornly work to improve things, incrementally and continuously, by experimenting with approaches that are safe to fail but designed to teach us what can work at that moment, in those circumstances."
        },
        {
            "text": "Business consultants David Snowden and Mary Boone say that in situations of flux and unpredictability, where there are no right answers, many unknown unknowns, and many competing ideas, the only useful approach is to experiment in ways that probe the system, then sense changes in the environment and respond proactively to those changes."
        },
        {
            "text": "Unfortunately, I think we’re currently taking the wrong approach to solving most of the issues we’re faced with. We rely on experts even when there’s no blueprint they could possibly create for us — they do their best, but the domain of uncertainty is not the domain of experts."
        },
        {
            "text": "We’re using a hammer to bang in a screw, and we don’t understand why it won’t stay in."
        },
        {
            "heading": 2,
            "text": "Complex problems will never be fully solved"
        },
        {
            "text": "Since there are no right or wrong answers to complex problems, we must acknowledge that what we are trying to achieve is not solutions, but continuous improvement."
        },
        {
            "text": "For those of us who work in the prison system, our goals are to improve the safety and security of prisons, protect the public from harm, reduce re-offending, and deliver swift access to justice. None of these are problems that will ever be ‘solved’ — they are not items to tick off a to-do list, and then move on. All the projects our teams work on, the services we design and deliver, the policy decisions we make — they’re all trying to move us as a society just a little bit closer to those goals."
        },
        {
            "text": "During the first wave of COVID in early-2020, our teams were asked to implement on a wide scale the prison video-call service we had been testing in a few prisons. After understanding how the service could function, identifying what technologies existed, going through procurement exercises, and building out and testing the online and offline aspects of the service, we had to then tackle complicated technological and policy questions around cost and security. Now that we’ve fully rolled out the service to all 100+ prisons and ironed out many of the kinks, other questions will surely arise. How might we use the service to achieve wider goals around safety, building people’s skills, and helping secure accommodation before people are released from prison. As technology changes in the future, will our cost and security models need to change too?"
        },
        {
            "text": "Policy and service design questions will continue to arise, as long as the service exists and the policy objective (to connect people in prison with people in the community) persists. The service will never be ‘finished’. The policy objective will never be completely ‘achieved’."
        },
        {
            "text": "And remember, all of this work is simply improving how people in prison connect with their loved ones, or access training or other support. It doesn’t ‘solve’ the larger problems of how to create safe and secure prisons, or reduce re-offending — it’s just a contributing factor. That wider work will also continue, forever. We need teams that are in it for the long haul — managing (or ‘stewarding’) systems to continuously perform more efficiently and achieve society’s goals."
        },
        {
            "heading": 2,
            "text": "Agile and systems thinking are not fads"
        },
        {
            "text": "The only way to achieve the goals we set for teams tackling complex problems is to develop a deep understanding of the issues, test improvement ideas, learn from those tests, and adapt our approaches — continuously."
        },
        {
            "text": "And those processes must be done quickly, because if we wait months or years to see the impacts of our changes, it will be impossible to disentangle the impact of our changes from everything else that’s happened around them."
        },
        {
            "text": "That is why policy and service design teams that see the whole system and work in agile ways to improve it — and organisations that adopt this agile mindset of continuously learning and adapting and improving, and design their org structure to enable that process — will be more successful than those that tend to see the world in terms of discrete problems to be solved."
        },
        {
            "text": "Organisations that acknowledge the uncertainty they’re operating within and humbly work to make things better day-by-day, year-by-year, and decade-by-decade are the ones that will, over the long run, help us achieve the results we want to see in society."
        }
    ]
}