{
    "url": "https://civilservice.blog.gov.uk/2022/08/11/meet-nicola-a-volunteer-at-the-commonwealth-games/",
    "title": "Nicola scores a net win at the Commonwealth Games",
    "authors": [
        "Nicola Lazenby"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-08-11T11:07:44+00:00",
    "content": [
        {
            "heading": 3,
            "text": "After 12 days helping to make the Commonwealth Games go like clockwork, how has life been for our volunteers? Civil servant Nicola Lazenby from the Department for Business, Energy and Industrial Strategy joined the volunteers (aka the Commonwealth Collective) as Team Leader for the Netball Athletes Services. Here’s her diary."
        },
        {
            "heading": 4,
            "text": "Monday 25 July"
        },
        {
            "text": "I rise at an ungodly hour to catch the early train and it’s a thrill wearing my Games uniform. A rucksack full of snacks - and Birmingham here I come! It’s my third Commonwealth Games – I can’t wait. Today is venue training and I collect my all-important accreditation. Not only will it get me into the venue – it also secures my packed lunch! Very important."
        },
        {
            "heading": 4,
            "text": "Wednesday 27 July"
        },
        {
            "text": "Today I have a shift at the netball training venue. As a netball coach, I always find it fascinating watching the players train. I definitely picked up some tips to take back to my own club. We have a few teams in having friendlies, and the competition is definitely hotting up."
        },
        {
            "heading": 4,
            "text": "Saturday 6 August"
        },
        {
            "text": "Semi-finals Day. By now, I really know my volunteer team and camaraderie is at its highest. Personality differences have been ironed out and we’re performing as a well-oiled machine – managing to turn around changing rooms and ice baths in record times, enabling us to glimpse the semi-final action."
        },
        {
            "heading": 4,
            "text": "Monday 8 August"
        },
        {
            "text": "My last day and I’m chuffed to bits to receive my Birmingham 2022 baton as a thank you for my contribution to the games. After breakfast with friends, it’s time to catch the train home to watch the closing ceremony on my sofa before returning to work the next day. It’s been a truly rewarding experience to play a tiny part at the heart of a global sports event."
        },
        {
            "text": "My favourite moment was witnessing the crowd during the gold medal match of Jamaica vs Australia, a real goosebumps game!"
        },
        {
            "text": "Volunteering wise, I’ll never forget the time when, whilst cleaning and refilling the ice baths, the hose sprung out, showering the whole volunteer team! Definitely a ‘you’ve been framed’ moment."
        },
        {
            "text": "What keeps me volunteering is the whole games experience, gaining a snapshot into the lives of world-class athletes, whilst catching up with old volunteer friends and meeting new ones. We forged a sense of family with talented, enthusiastic volunteers and shared memorable conversations. They ranged from our love of netball to the menopause, mental health, right through to sustainability, our carbon footprints and heat pumps (of course!)"
        }
    ]
}