{
    "url": "https://defradigital.blog.gov.uk/2022/08/11/moving-from-social-media-to-content-design-transferable-skills-and-approaches/",
    "title": "Moving from social media to content design: transferable skills and attitudes",
    "authors": [
        "Emily Ch'ng",
        "Anna Scott"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2022-08-11T13:30:42+01:00",
    "content": [
        {
            "text": "Do you work in social media but have an interest in content design? Or maybe you’re a content designer and wonder what social media is like? Having worked in both, Defra content designer Emily Ch’ng shares the transferable skills and how she made the move. With contributions and editing from Anna Scott."
        },
        {
            "text": "I didn’t know I could become a content designer when I started my 6-year career in social media. But when I decided I wanted a career change, I reflected on my skills and experience, and realised that content design was a natural fit."
        },
        {
            "text": "Saying that, while there is some crossover between social media and content design, they are entirely different disciplines. For example, in government, social media roles tend to sit in a department’s communications directorates and content design sits in digital and technology branches. They’re similar, but separate."
        },
        {
            "text": "This post will cover how I moved from social media into content design, and the skills they have in common."
        },
        {
            "heading": 2,
            "text": "How it started: my career in social media"
        },
        {
            "heading": 6,
            "text": "Credit: GDS"
        },
        {
            "text": "My first government job was as Digital Engagement Manager at the Government Digital Service (GDS). I was a part of Communications, but I was embedded in a service team. I didn’t realise it then, but this job was where I first developed some of the skills needed to become a content designer."
        },
        {
            "text": "I ran the service’s social media account and GOV.UK blog, where I did a lot of writing and answered user queries. This meant I had to really know the ins and outs of the service and  turn complex technical jargon into simple terms for its users. This was my first experience of writing in plain English - something content designers do every day."
        },
        {
            "text": "I worked in a multi-disciplinary team of developers, delivery managers, user researchers and content designers. I learnt about agile methodology, sat in on user research sessions, and learnt about the all important principle of user-centred design (UCD)."
        },
        {
            "text": "I absorbed all of this for a year, before moving to be a Senior Digital Content Manager at the Ministry of Justice (MoJ). My main responsibilities in this role were communicating news or campaigns related to prisons and probation on the MoJ’s social media accounts."
        },
        {
            "heading": 2,
            "text": "Taking a user-first approach to digital communications"
        },
        {
            "text": "While this new role focussed less on agile working, I still followed the principle I learnt from GDS: creating content that gives audiences what they needed to know."
        },
        {
            "text": "I set up and ran the Working in the Prison and Probation Service blog. Its main readers were people who had applied to become prison officers but were struggling with the lengthy recruitment process."
        },
        {
            "text": "Before setting it up, I had found that there wasn’t enough easy-to-understand information on official government channels. So, applicants were searching for information on unofficial forums or blogs. This meant they wouldn’t always get the most up to date information. There was a clear content gap."
        },
        {
            "text": "Before I even became a content designer, I approached this problem like one:"
        },
        {
            "text": "This allowed me to create an official government online resource that helped users to complete their recruitment journey, meeting both their needs and the department’s."
        },
        {
            "text": "When writing for social media channels, I also took a user-first approach by asking myself “great, but so what?” to make sure content was either interesting or useful to our audience."
        },
        {
            "text": "I carried these principles with me to my next role in the Digital Engagement and Creative Content team at Defra. This was my last comms job before I decided it was time for a change and I applied for a content design role at Defra."
        },
        {
            "heading": 2,
            "text": "Making the move"
        },
        {
            "text": "While a career change felt like a scary challenge, it felt easier once I could spot similarities between the two professions. Content design attracted me because I already held values that help make a good content designer. I’m also passionate about helping people, and user-centred design is fundamentally about creating content that helps people do what they need to do online."
        },
        {
            "text": "But I didn’t have experience in a ‘content design’ role. So I prepared for the move by speaking to content designers, and doing a lot of reading. From books to blogposts, there are masses of resources for understanding content design, such as:"
        },
        {
            "text": "Once I felt like I could map my skills to content design, the only thing left was to hope the interview panel could see my potential. Thankfully Defra’s content design recruitment team does exactly that, and I got the job! To find out more, read Lead Content Designer Jeni Street's blogpost on applying for content design roles at Defra."
        },
        {
            "heading": 2,
            "text": "Transferable skills between social media and content design"
        },
        {
            "text": "If you’re interested in moving from social media to content design or vice versa, here are the skills and approaches that you can carry across."
        },
        {
            "heading": 3,
            "text": "Using data to make decisions"
        },
        {
            "text": "Both social media and content design are data-driven disciplines. You need to be able to digest data, analyse user feedback and draw conclusions from published content to understand what works for your audience."
        },
        {
            "text": "In social media you can see data immediately. Shares, likes and comments tell you how well a post has performed. Data helps show what kind of content is and isn’t popular or useful with an audience. You can then make decisions or strategies based on this, and learn lessons if things flop."
        },
        {
            "text": "Content designers also analyse data, such as web traffic metrics, page views, clicks and direct user feedback. This helps us see if people are having trouble understanding or navigating a page. We might notice a link is broken, or that lots of people are clicking ‘contact us’ on a guidance page because they’re struggling to complete a task. The solution could be as simple as fixing the broken link, or re-writing the entire guidance page to make it clearer."
        },
        {
            "text": "User data can also help inform policy colleagues of how digital audiences or users interact with their content. This feedback is invaluable in helping the government publish targeted content that can serve its citizens better."
        },
        {
            "heading": 3,
            "text": "Writing in plain English"
        },
        {
            "text": "Government content should be written in a way that’s simple, clear and fast to read. The average UK reading age is 9. So to make content as accessible as possible, we write in plain English to help people find what they need quickly and absorb it effortlessly."
        },
        {
            "text": "A tweet only has 280 characters. So people working in social media do the hard work to write clearly and simply in as few words as possible, while still keeping the original content's meaning (what content designers call “source material”)."
        },
        {
            "text": "The GDS ‘Writing for GOV.UK’ guidance says that “good online content [should be] easy to read and understand.” Online content could be a tweet telling people the single-use plastic bag charge has increased to 10p. Or it could be guidance pages explaining what you can and can’t do under the Ivory Act 2018. Either way, people working in both professions need to use short sentences and simple vocabulary to communicate content that is:"
        },
        {
            "heading": 3,
            "text": "Attention to detail"
        },
        {
            "text": "You need good attention to detail in both content design and social media. You also need to follow style guides, be an excellent proof-reader and be passionate about consistency."
        },
        {
            "text": "An organisation’s reputation and credibility can rely on content that is:"
        },
        {
            "text": "Both professions follow rigorous ‘two-eye’ checks'. In social media, a post should be reviewed by a second pair of eyes (someone who didn’t write it) to make sure it is clear of mistakes."
        },
        {
            "text": "Similarly, content designers in government don’t publish their own work. Once something has been written and approved, another content designer must check and then publish it."
        },
        {
            "heading": 3,
            "text": "Caring about accessibility"
        },
        {
            "text": "Statista estimate that 95% of the UK population accessed the internet in 2020. Also, at least one in five people have a long-term illness, an impairment or a disability. So, it’s non-negotiable that digital content should be accessible for everyone to use."
        },
        {
            "text": "Social media is visual. Video content dominates, as well as trending images, memes or sounds. So whether you’re providing alternative text to images or subtitling videos, social media should be accessible."
        },
        {
            "text": "Content designers also work with different content formats, such as text, tables, headings or start buttons, to design content that’s the most accessible for their users."
        },
        {
            "text": "Social media managers and content designers should both write accessible content and challenge anyone who tries to publish something that would exclude anyone from being able to consume it."
        },
        {
            "heading": 2,
            "text": "It’s never too late to change your career"
        },
        {
            "text": "I hope the transferable skills I’ve set out here help to show that making the move from social media to content design, or vice versa, is possible."
        },
        {
            "text": "Although I had the benefit of experience at GDS and learnt about user-centred design early in my career, this isn’t essential. If you want to change your career and have a passion for making content work best for users then I encourage you to follow your goals!"
        },
        {
            "text": "I’m more than happy to talk to anyone, inside or outside of government, about moving into content design or taking the plunge in changing your career."
        }
    ]
}