{
    "url": "https://dwpdigital.blog.gov.uk/2022/08/11/the-strategic-architecture-behind-our-digital-future/",
    "title": "The strategic architecture behind our Digital Future",
    "authors": [
        "Jack Hanson, deputy director, Citizen Information, DWP Digital"
    ],
    "categories": [
        "Architecture",
        "Digital transformation"
    ],
    "pub_date": "2022-08-11T10:16:06+01:00",
    "content": [
        {
            "text": "Earlier this year we launched our new ‘Digital Future’ strategy, setting out how we aim to significantly transform the way we work over the next three years and help achieve our digital ambitions. "
        },
        {
            "text": " That might sound like a daunting task, but we believe our goals are achievable within the timeframe and will have a significant impact on both customers and colleagues. "
        },
        {
            "heading": 3,
            "text": " Shifting to a common shared approach  "
        },
        {
            "text": "Within our Digital Future plans, we set out our Strategic Reference Architecture. This focuses on the reuse of business capabilities and digital products with better data sharing, improved self-service and increased trust to provide a holistic customer and colleague experience. "
        },
        {
            "text": " The Strategic Reference Architecture encompasses a number of different architectures. There’s the Technical Reference Architecture, the Data Reference Architecture and the Business Reference Architecture, each of which will have a significant impact on our ways of working.  "
        },
        {
            "text": "But what do each of these actually mean?  "
        },
        {
            "text": "The Application Reference Architecture is built around the adoption of common components that will release value in the digital services we provide. Using and reusing these shared components and processes will help to transform our ways of working by helping us to build bridges across our various functions, encouraging collaboration and breaking down siloes. "
        },
        {
            "text": " The Technical Reference Architecture defines the core tech services that underpin our applications. Reuse here is a massive opportunity for us to achieve significant savings, and to improve quality across the department. The good news is that almost all of this is already in place. "
        },
        {
            "text": " The Data Reference Architecture is focused on modernising how we will collect, manage, store and use the data we work with in order to meet our strategic goals. We’ve already made significant progress in this area with the establishment of the Chief Data Office and with the publication of our Data Strategy, and it all comes down to the idea of making better use of data.  "
        },
        {
            "text": " We can do this by making data available in one place, so that colleagues can access it more easily; by reusing data so that customers only need to provide it once; by using the data to provide better answers for customers and to avoid duplication; and by sharing our data securely across government to reduce costs, fraud and error. "
        },
        {
            "text": "While we modernise the services we provide, we also need to make sure that we’re transforming our business capabilities at the same time, which is where the Business Reference Architecture comes in. That means identifying any changes we need to make in order to deliver on our goals by finding commonalities across organisational siloes and enabling teams to take a holistic approach to achieving transformation. "
        },
        {
            "text": "Our Digital Future focuses on how these elements will impact on our day-to-day work, which involves a shift in our mindset and how we approach our work. "
        },
        {
            "heading": 3,
            "text": "Making an impact "
        },
        {
            "text": " Over the last two years, we’ve developed a wealth of knowledge that shows that this is the right approach for us to accelerate delivery of our goals, and now we need to focus more on how we do so. "
        },
        {
            "text": " One of the ways we’re looking to do that is by moving towards what we’re terming a ‘value release’ model, where the common components underpin value release goals in services. This means that instead of focusing solely on our own service or product, we need to focus on creating the building blocks that can be interconnected in different ways, to deliver on DWP’s goals and to release value for customers and colleagues.  "
        },
        {
            "text": " This will require us to align sequencing of our work and to create integrated roadmaps, so that we get the right components, at the right time. "
        },
        {
            "text": " Alongside this, we need to consider how we make the best use of the resources at our disposal, so we have less of a ‘build it ourselves’ approach from individual teams, and more of a ‘how do we apply common solutions?’ attitude across the whole department. "
        },
        {
            "text": "We can’t waste effort by building the same thing multiple times across different teams. Instead, we need to focus our efforts and simplify our processes to apply common solutions.   "
        },
        {
            "heading": 3,
            "text": "Collaborating for success "
        },
        {
            "text": "The new ways of working are built around the idea of collaboration, moving from working mostly within an individual team to collaborating across teams and functions.  "
        },
        {
            "text": "To deliver better services, we need to take that broader view to ensure we’re making the best use of the talents and resources available to us. It means being proactive in identifying opportunities for common approaches, so that we can deliver service modernisation right across the department. "
        },
        {
            "text": " Our Digital Future and these new ways of working are a challenge for everyone in DWP Digital but one that myself and the rest of our leadership team believe we can achieve. It will require a shift in our mindset and a commitment, but ultimately this will help us to make a significant improvement to the lives of our customers, and to the experiences of our colleagues. "
        },
        {
            "text": " We’re at a really exciting time in our transformation. If you’d like to join us on our journey, check out some of the roles currently available: DWP Digital Careers "
        }
    ]
}