{
    "url": "https://queensawards.blog.gov.uk/2021/08/31/celebrations-for-innovation-winners-nims-fruit-crisps-as-they-receive-their-queens-awards-trophy/",
    "title": "Celebrations for Innovation winners, Nim’s Fruit Crisps, as they receive their Queen's Awards trophy",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Enterprise promotion",
        "Innovation",
        "Queen's Award",
        "queensawards"
    ],
    "pub_date": "2021-08-31T11:23:16+01:00",
    "content": [
        {
            "text": "Queen's Award for Innovation winners 2020, Nim's Fruit Crisps, were delighted to receive their Queen's Awards trophy and Grant of Appointment scroll, from their local Lord Lieutenant and Deputy Lord Lieutenant."
        },
        {
            "text": "Due to restrictions, our 2020 winners presentations have been on hold; however, we are thrilled to see that our winners are now able to host these fantastic celebratory events!"
        },
        {
            "text": "Read below to hear just how special this day was, and what it meant to Nimisha Raja, founder of Nim’s Fruit Crisps."
        },
        {
            "text": "Transforming the snack market with a healthy ‘crisp’ alternative has seen a Kent manufacturer recognised with its first ever Queen’s Award for Innovation."
        },
        {
            "text": "Nim’s Fruit Crisps, which employs 18 people at its bespoke A-Grade BRC accredited facility in Sittingbourne, joins an elite firm of businesses to receive this prestigious accolade after enjoying significant retail success with the UK’s only air-dried fruit and vegetable crisps and range of edible teas."
        },
        {
            "text": "Read more on their website here: https://nimsfruitcrisps.com/queens-award/"
        },
        {
            "text": "Feel inspired? Apply for the new Queen's Awards round now: https://www.gov.uk/queens-awards-for-enterprise"
        },
        {
            "text": "Follow the Queen's Awards Office on Twitter "
        },
        {
            "text": " "
        }
    ]
}