{
    "url": "https://socialcare.blog.gov.uk/2021/08/31/ive-made-my-choice-so-whats-yours/",
    "title": "I’ve made my choice, so what’s yours?",
    "authors": [
        "Raf Hamaizia"
    ],
    "categories": [
        "coronavirus",
        "Viewpoint",
        "Workforce"
    ],
    "pub_date": "2021-08-31T11:37:01+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making sense of it all"
        },
        {
            "text": "We live in a day and age where the internet is awash with misinformation, including conspiracy theories about coronavirus, lockdowns, and vaccinations. That’s why the thought of receiving the COVID-19  vaccine was a little bit scary to begin with. Like many of us, I had to sift through and make sense of information pouring in from all directions."
        },
        {
            "text": "It took a bit of persuasion from my friends and family, as well as my own research on how vaccines actually work, to have the courage to take the step."
        },
        {
            "text": "The real deal breaker was the fact this is not only about me and my health, but the impact not having the vaccine can have on society and the wider public. Ultimately, we are all in this together and everyone should play their part, especially when working with vulnerable people who may have pre-existing medical conditions."
        },
        {
            "text": "During the second lockdown in March this year, Cygnet Health Care launched a video campaign called #ihadthevaccine, urging ethnic minority communities to have the vaccine. The campaign, set up by the Cygnet Multicultural Network, has been vital in providing colleagues and care staff across the sector with an alternative reliable source of information. This has included positive personal experiences to counter the misinformation rife among some ethnic minority communities."
        },
        {
            "text": "The video features Cygnet Health Care staff of different nationalities, reinforcing the message in their own languages, including Shona, Gujarati, Twi, Swahili, Igbo, Sinhalese and Lugandan."
        },
        {
            "heading": 2,
            "text": "We're getting there, but work to do"
        },
        {
            "text": "Vaccine uptake among ethnic minorities throughout England is steadily rising, compared to the beginning of the vaccine rollout. However, the numbers of white versus minority ethnic people who have received the COVID-19 jab remains disproportionate, according to data published by Open SAFELY, the analytics platform."
        },
        {
            "text": "Taking part in this co-produced campaign has been both meaningful and illuminating. This was filmed by people with lived experience from ethnic minority backgrounds, talking to staff from the same backgrounds about an important issue that impacts us all."
        },
        {
            "text": "My personal conversations with staff found that, aside from misinformation around the vaccine, they had personal mistrust issues stemming from entrenched health inequalities and historical injustices which have eroded trust in the health system."
        },
        {
            "text": "For me, it is important people have these discussions and explore these issues. Through dialogue, we can engage in understanding these feelings, talk about the science and build trust in the medical experts and evidence."
        },
        {
            "text": "It is crucial to listen to concerns and help individuals understand the science, so they can make an informed decision, rather than basing decisions on social media. Having the vaccine is ultimately going to save their lives and the lives of others and that is the fundamental point of this video."
        },
        {
            "text": "I want everyone to reflect on their choices and consider taking the vaccine, because that’s what you do when you care for people, when you love them."
        },
        {
            "text": "I’ve made my choice, so what’s yours?"
        }
    ]
}