{
    "url": "https://medregs.blog.gov.uk/2021/08/31/major-milestone-reached-in-the-combined-review-journey/",
    "title": "Major milestone reached in the combined review journey",
    "authors": [
        "Martin O'Kane"
    ],
    "categories": [
        "Innovation"
    ],
    "pub_date": "2021-08-31T14:06:09+01:00",
    "content": [
        {
            "text": "On 31 August 2021 we launched new systems functionality to support the combined review of Clinical Trials of Investigational Medicinal Products, or “CTIMPs”."
        },
        {
            "text": "For those unfamiliar, the combined review service (previously known as ‘combined ways of working’) offers a single application submission route and a co-ordinated review for CTIMPs, resulting in a combined regulatory and ethics decision on a clinical trial."
        },
        {
            "text": "Combined review was established by the MHRA and the Health Research Authority (HRA) and has involved collaborative working with the National Institute for Health Research (NIHR) and the devolved administrations. This work directly contributes to the UK-wide vision for the future of clinical research delivery: Saving and improving lives: the future of UK clinical research delivery by offering more streamlined and more efficient clinical research approvals."
        },
        {
            "text": "End-to-end lifecycle management via IRAS"
        },
        {
            "text": "Our new system release is a major milestone in creating one seamless online resource for applicants via the Integrated Research Application System (IRAS).  From 31 August, trial sponsors can manage their complete trial lifecycle via combined review using IRAS – from initial application through to amendments, safety reporting, end of trial notification and submission of summary results."
        },
        {
            "text": "From next year, combined review will become the only way to apply for CTIMP approvals and this new functionality greatly facilitates scale-up to enable all applicants to take advantage of the new process.  Last month about 40% of all CTIMP submissions came in via combined review."
        },
        {
            "text": "If you have not yet used combined review and are planning a CTIMP application over the coming months, please get in touch.  From setting up an account in the new part of IRAS to submitting your first CTIMP via the system, the team can provide help and support - simply email cwow@hra.nhs.uk . More information about the combined review process can be found on the dedicated combined review webpage."
        },
        {
            "text": "Getting to this stage has been a huge collaborative effort and I’d like to say thank you to colleagues in MHRA, HRA, NIHR and DHSC and the devolved administrations for their support and enthusiasm in driving forward our ambition for the UK to be the best place in the world to conduct clinical trials."
        },
        {
            "text": " Next steps"
        },
        {
            "text": "Of course, the work doesn’t stop here.  We will continue to deliver enhancements based on your feedback and will work with HRA and IRAS partners to create a world-class hub for health and social care research in the UK, offering smooth and intuitive access to research approval, study management, best practice guidance and lay-friendly information about the results of research."
        },
        {
            "text": "As part of our vision to improve the speed and efficiency of clinical research approvals, we will soon be calling on developers running studies involving both a medicine and a medical device to contact us to help develop a new streamlined route for these studies within the combined review process. Watch this space for more information!"
        }
    ]
}