{
    "url": "https://civilservice.blog.gov.uk/2021/08/31/minding-your-ps-and-qs/",
    "title": "Minding your Ps and Qs",
    "authors": [
        "Alexander Bellis, Parliamentary Capability Officer for the Parliamentary Capability Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-08-31T15:09:23+00:00",
    "content": [
        {
            "text": "How written parliamentary questions shine a light into the work of government"
        },
        {
            "text": "Holding the government to account is a vital part of our democracy. This duty falls to the 650 MPs of the House of Commons and nearly 800 peers in the House of Lords. Every day that the Houses of Parliament are sitting (most Mondays to Thursdays and some Fridays), parliamentarians use all the tools at their disposal to analyse the work of departments."
        },
        {
            "text": "Most UK citizens are aware of some parliamentary scrutiny tools. You might read about a select committee report in a newspaper. You may watch a news clip of ministers questioned in the Commons Chamber (famously known as ‘Question Time’). "
        },
        {
            "text": "Yet it’s rare to hear about the most commonly-used scrutiny procedure: the humble written parliamentary question (or WPQ for short). They are, however, taken just as seriously."
        },
        {
            "text": "What are written questions?"
        },
        {
            "text": "Written questions are just that: questions posed by parliamentarians to the government in writing. Below are two examples:"
        },
        {
            "text": " "
        },
        {
            "text": "To submit a WPQ, MPs or peers approach the Commons or Lords Table Offices with a question they want to ask. These are checked to see if they meet the House’s rules, then sent to government departments. Civil servants provide a written response usually within three to 10 working days, depending on the exact type of written question. Both question and answer are published online."
        },
        {
            "text": "So, how common are written questions? "
        },
        {
            "text": "MPs can submit as many written questions as they like. In the 2019-21 Parliament, there were on average over 300 written questions asked per sitting day in the Commons. In contrast, only around 60-80 oral questions will be asked in the Chamber, due to the limited time available."
        },
        {
            "text": "While a peer in the House of Lords can only ask up to 12 written questions per week, WPQs nonetheless provide parliamentarians in both Houses with the much-needed capacity to cover a broad swathe of policy areas. "
        },
        {
            "text": "Written questions have other advantages. In contrast to oral questions, where answers are just a few sentences long, departments can provide much more detail in a written answer. WPQs are also an ideal way for a parliamentarian to request data, some of which may not yet be publicly available."
        },
        {
            "text": "Providing both quantity and quality, MPs and peers value WPQs as a vital scrutiny tool. And, as they are published on Parliament’s website, the answers are also an important part of government transparency. You never know: your answer could be quoted in a report from an important stakeholder or used to inform a wider debate in society. "
        },
        {
            "text": "Parliamentarians can raise concerns about written answers, which can reflect badly on a department. MPs use the weekly business statement to highlight delayed responses to the Leader of the House of Commons, Rt Hon Jacob Rees-Mogg MP. He takes these cases up directly with his ministerial colleagues. Concerns about delays and quality have also been the subject of a recent debate in the Lords chamber and an urgent question in the Commons. "
        },
        {
            "text": "The House of Commons Procedure Committee monitors responses, flagging its concerns in reports and ministerial correspondence, as well as, on occasion, calling ministers and senior civil servants into Parliament to explain poor performance.    One recent example took place on 7 December 2020, when the Procedure Committee questioned a minister and a director from the Department of Health and Social Care about slow response times.          "
        },
        {
            "text": "Answering written questions well"
        },
        {
            "text": "On the other hand, a department that provides useful and timely responses to WPQs can potentially enhance its relationship with Parliament. Getting this process right is therefore an important priority."
        },
        {
            "text": "All departments have a parliamentary, PQ or correspondence team which coordinates responses to parliamentary questions. Policy officials draft much of the answers but a range of civil servants may be called upon to help. From analysts and lawyers, to those responsible for service delivery, any civil servant could be asked to contribute. "
        },
        {
            "text": "With so many people involved, civil servants need to be responsive to tight deadlines. You may need to reprioritise your workload to handle an incoming question. You may need to assist other departments with a cross-cutting or wrongly-assigned question to be transferred across. Plan ahead where possible: having some pre-prepared lines to hand can help. "
        },
        {
            "text": "But this isn’t just about knowing your policy area inside out: it’s about getting to know your audience and balancing key messages from the department with the needs of the MP or peer asking the question. "
        },
        {
            "text": "Want to learn more?     "
        },
        {
            "text": "The Parliamentary Capability Team has put together training and resources on written questions (now part of the new Government Campus) which can help. You also might want to talk to your department’s parliamentary team about any advice or training your department can offer."
        },
        {
            "text": "Departments need to have the skills and processes in place to quickly research and draft quality answers to written questions. As Parliament returns from recess on 6 September, now is perhaps the time to think about building your, or your department’s, parliamentary capability."
        }
    ]
}