{
    "url": "https://queensawards.blog.gov.uk/2021/08/31/queens-award-winners-luminary-bakery-are-creating-opportunities-through-entrepreneurship/",
    "title": "Queen's Award winners Luminary Bakery are Creating Opportunities Through Entrepreneurship",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "London",
        "Promoting opportunity",
        "social mobility"
    ],
    "pub_date": "2021-08-31T12:31:07+01:00",
    "content": [
        {
            "text": "Luminary Bakery is a community of strength and solace where women gather to be equipped, trained, and empowered in reaching their full potential. Founded in 2014, this social enterprise bakery was envisioned after the founding members came into contact with women who were experiencing multiple disadvantages, and the lack of opportunities were perpetuating cycles of poverty. Bringing together their skill sets and passion, the founding members began to offer baking classes to the women they were meeting, and through that, support and community grew. After what started in the kitchen of an East London church, Luminary has grown into what it is today - two cafe and bakery locations across London (Camden & Stoke Newington) and a training centre. As of summer 2021,  107 women have enrolled in the Employability and Independence Programme."
        },
        {
            "text": "The diversity in experiences and backgrounds vary between all the women that enter Luminary’s training programme, but one common factor is present: gender-based violence. This can be anything from human trafficking to domestic violence, on top of homelessness and coming into contact with the criminal justice system. Therefore, providing a safe space and a sense of community is an essential part of Luminary’s work as they train and support each cohort."
        },
        {
            "text": "The opportunities that Luminary offers to these women lie within their Employability Course and Progression Support programmes. Women are not only taught about baking, but life-skills and entrepreneurship. Following the 6-month baking programme, graduates move on to 18 months of support as they seek to further their education and/or experience. Some have gone on to start their own businesses and work in other bakeries across the city, while others have apprenticed in Luminary’s very own bakeries and have joined their staff. The overall opportunities are vast and expand as each woman is empowered and, therefore, empowers others through this resilient community."
        },
        {
            "text": "This is why Luminary Bakery is incredibly grateful to be honoured with a Queen’s Award for Enterprise, in the category of promoting opportunity. This particular category is exciting because it recognizes the reason Luminary started in the first place - promoting opportunities for women. As a 2020 Luminary Graduate shared, “I believed I was a failure and had lost all of my good qualities. Luminary was the first time I had experienced freedom and respect - now I will live as an independent woman.”"
        },
        {
            "text": "Luminary continues to seek growth to offer more opportunities to women around London and the UK. After successfully launching their first cookbook in August 2020, Rising Hope: Inspiring life stories and recipes from Luminary Bakery, and navigating the impact of COVID, they are seeking out more opportunities to start yet another bakery within the next five years before dreams of expanding outside London."
        },
        {
            "text": "As a whole, Luminary is built on the foundation of empowering women to reach their full potential. This is the heartbeat behind everything they do and as the saying goes, empowered women empower women. Let the opportunities unfold!"
        },
        {
            "text": "Make a purchase or donate to Luminary Bakery on their website. Every purchase made helps Luminary offer more opportunities to women facing multiple disadvantages."
        },
        {
            "text": "For more information, follow them on Instagram, Twitter and Facebook, or sign up for their newsletter."
        },
        {
            "text": "Follow @QueensAwards on Twitter or apply online today https://www.gov.uk/queens-awards-for-enterprise"
        },
        {
            "text": " "
        },
        {
            "text": "https://twitter.com/TheQueensAwards"
        },
        {
            "text": " "
        }
    ]
}