{
    "url": "https://queensawards.blog.gov.uk/2021/08/31/watson-gym-equipment-celebrate-their-queens-award-for-enterprise/",
    "title": "Watson Gym Equipment celebrate their Queen's Award for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "International trade",
        "Queen's Award",
        "queensawards"
    ],
    "pub_date": "2021-08-31T14:13:47+01:00",
    "content": [
        {
            "text": "Watson Gym Equipment are immensely proud to have won the 2021 Queen's Award for Enterprise in the category for International Trade."
        },
        {
            "text": "It is a huge achievement to win this prestigious Award and to be able to fly the Queen's Award flag at their businesses premises. Head of Sales, Eben Mortimer-Taylor, tells us about their experience below."
        },
        {
            "text": "\"Winning the Queens Awards for Enterprise 2021 is an unbelievable achievement and something I hadn’t of imagined I’d have the honour to be involved in. I first started my journey at Watson Gym Equipment when I was just 19 and I’m still very early on in my career being only 24 now."
        },
        {
            "text": "In that time, I have seen the company grow to whole new levels. As the head of sales, I’m responsible that our sales team are ensuring sales are coming in while all customers’ needs being met and dealt with correctly. I also handle some of our biggest clients and deal with celebrities and high net worth individuals."
        },
        {
            "text": "Since starting it’s always been obvious that our kit is in high demand but working closely with the Owner/Founder Simon Watson over the past years and passing back customer feedback and recommendations from some of the world’s most elite athletes and trainers our kit has developed month after month. With this so has the demand. In the last 2 years our order book has more than tripled worldwide."
        },
        {
            "text": "With this we needed to expand. So that’s exactly what Simon Watson did. Building our brand-new state of the art machine shop/steel processing plant which has doubled our size and should double capacity. The aim of this is to be able to keep up with the rapidly growing demand for our world renown brand. With several delays regarding power supply, we are finally in. I’m super excited to see how our unique and quality equipment continues to improve and where we can take the company in the next few years.\""
        },
        {
            "text": "Watson Gym was established in 1999, when founder Simon Watson began manufacturing gym equipment by hand. The equipment is all manufactured in Frome out of 100 % British steel and includes heavy duty machines, bars, and accessories."
        },
        {
            "text": "Its target market is specialist gyms and training facilities and it’s also currently expanding into niche high net worth individuals and bespoke facilities for personal gyms in homes and on boats/yachts. The company now employs over 50 people and has a goal to achieve £20 million turnover in the next three years. Over three years, the company’s international sales have grown from £1.9 million to £2.7 million and make up 57.5% of sales with its top markets being the US, Australia, Netherlands, France, and Germany.\""
        },
        {
            "text": "Visit their website to find out more https://watsongym.co.uk/"
        }
    ]
}