{
    "url": "https://hmlandregistry.blog.gov.uk/2021/08/31/whats-happening-with-electronic-signatures-in-the-property-market/",
    "title": "What’s happening with electronic signatures in the property market? ",
    "authors": [
        "Michael Abraham, Product Owner"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2021-08-31T10:35:12+01:00",
    "content": [
        {
            "text": "One year ago, we took a revolutionary step that allows deeds signed using an electronic signature to be registered. This was the first time in the history of HM Land Registry that non-mortgage deeds signed using electronic signatures could be registered and we have been encouraged by the developments being made by signature platforms and technology firms to design products that meet the requirements of practice guide 8 section 13 and facilitate their use."
        },
        {
            "text": "Accepting electronic signatures also complements our digital mortgage service Sign your mortgage deed, which helped many homeowners quickly remortgage during 2020."
        },
        {
            "heading": 2,
            "text": "An end to lockdown, but just the beginning for electronic signatures"
        },
        {
            "text": "During the pandemic, the convenience of signing a deed without needing to handle paper or visit an office was clear, but electronic signatures have a larger role to play in the future of land registration."
        },
        {
            "text": "When combined with a digitally produced deed, and digitally validated identity check where necessary, they could really streamline the application and registration process."
        },
        {
            "heading": 2,
            "text": "Exploring qualified electronic signatures "
        },
        {
            "text": "We know that electronic signatures in isolation cannot change the whole process. While they remove the need to post documents, and allow documents to be signed in minutes, if applied to deeds then, like any other signatures, they still require a witness."
        },
        {
            "text": "However, there is a more advanced type of electronic signature which could be the real gamechanger…"
        },
        {
            "text": "Last year, we talked about a type of electronic signature called a ’qualified electronic signature’ and which could provide a solution to the need for witnessing. Section 91 of the Land Registration Act 2002 allows for a sophisticated electronic signature of this nature to be used in a document that operates as if it were a deed but, not being an actual deed, the document can be signed without the need for a witness."
        },
        {
            "text": "When you sign a document using a qualified electronic signature, your identity is verified by a ‘qualified trust service provider’, which could be seen as replacing the assurance that is usually provided by the witness. When verifying your identity and creating the signature, the qualified trust service provider must meet a strict set of standards outlined in legislation known as eIDAS."
        },
        {
            "text": "We have continued to explore this solution and made excellent progress in understanding what criteria might need to be met for HM Land Registry to be able to accept them. We have also identified areas that require development if qualified electronic signatures are to become a practical solution for conveyancers and their clients."
        },
        {
            "text": "Crucially, we want providers to make the identity verification process as easy as possible, and to offer products that meet the needs of conveyancers and their clients, whether a single signature is being used for a one-off transfer, or they are dealing with a multi-use signature for a commercial user signing multiple documents a day."
        },
        {
            "text": "Earlier this month the UK’s first qualified trust service provider was approved by the Information Commissioner’s Office – opening up more opportunities for those developing the digital tools."
        },
        {
            "text": "As qualified electronic signatures are a relatively new technology, we want to ensure those in the property market can use it. We need to ensure that our standard supports interoperability between providers, so everyone can trust the security and usability of their signature, regardless of which platform they wish to use for signing."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We are keen to test the use of qualified electronic signatures with a small number of firms. From this we can learn more about the benefits they offer and any constraints we need to consider before wider publication of our draft practice."
        },
        {
            "text": "We will bring you more on this very soon, but for now you can read about the types of applications that can be signed using electronic signatures and watch our video on the key difference between witnessed electronic signatures and qualified electronic signatures."
        },
        {
            "text": "If you are interested in finding out more about the pilot, get in touch at QES_Pilot@landregistry.gov.uk."
        }
    ]
}