{
    "url": "https://deframedia.blog.gov.uk/2021/12/14/fisheries-catch-limits-agreed-and-licencing-discussions-conclude/",
    "title": "Fisheries catch limits agreed and licencing discussions conclude",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-14T09:53:08+00:00",
    "content": [
        {
            "text": "On Friday 10th December, we announced that agreement with Norway and the European Union on catch limits for 2022 for six jointly managed fish stocks in the North Sea had been reached. This received coverage across national and trade media outlets, including BBC News online, the Independent, Daily Express and Business Leader."
        },
        {
            "text": "Negotiating as an independent coastal State, the UK has secured fishing opportunities estimated to be worth around £190 million to the UK fishing industry and has provided certainty and stability ahead of the new year."
        },
        {
            "text": "Fisheries Minister Victoria Prentis said:"
        },
        {
            "text": "I am pleased to announce we have concluded trilateral negotiations between the UK, EU and Norway."
        },
        {
            "text": "We are proud to have led discussion to a positive conclusion as we seek to set a gold standard for the entire fishing industry."
        },
        {
            "text": "We are confident that this agreement has struck a balance that will benefit both our fishing industry and ensure our marine environment is healthy and viable long into the future."
        },
        {
            "text": "UK Government Minister for Scotland Malcolm Offord said:"
        },
        {
            "text": "As an independent coastal State the UK has agreed catch levels that provide opportunities estimated to be worth around £190 million to our fishing industry. I welcome the outcome of these negotiations as they provide certainty and stability for fishermen in Scotland and the rest of the UK while championing sustainability."
        },
        {
            "text": "Throughout negotiations the UK, as chair, has advocated for fish stock management decisions based on the best science available to ensure sustainable agreements are made and stocks are protected for the interests of our industry and a healthy, viable marine environment."
        },
        {
            "text": "On Friday, Environment Secretary George Eustice also met with European Commissioner Virginijus Sinkevičius regarding ongoing discussions around licensing of EU vessels seeking to fish in UK waters. Following receipt of additional evidence, further licences have been granted. Our latest statement was published after this meeting, with talks receiving coverage in the Telegraph, Guardian, Express, ITV and I news."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}