{
    "url": "https://educationhub.blog.gov.uk/2021/12/five-ways-were-protecting-education-against-the-omicron-covid-variant/",
    "title": "Five ways we’re protecting education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2021-12-14T10:58:19+00:00",
    "content": [
        {
            "text": "Being in school and early years settings is vital for protecting young people’s education and preventing pupils from falling behind. It’s also really important that children are able to be among their peers and teachers for both their mental health and for safeguarding purposes."
        },
        {
            "text": "We want to make sure disruption in schools, early years settings and colleges is kept to a minimum as we tackle the Omicron variant."
        },
        {
            "text": "Here are five key ways we are protecting education:"
        },
        {
            "heading": 3,
            "text": "1. Vaccinations"
        },
        {
            "text": "Children remain at much lower risk of serious illness from COVID-19 than adults, and we want both to protect their education and to safeguard those who are you most vulnerable."
        },
        {
            "text": "That’s why everyone over the age of 12 can get vaccinated. You can find out more and book via the NHS website. As the Chief Medical Officers of the four home nations have made clear, it is important that all those eligible for a booster dose of the vaccine get themselves jabbed."
        },
        {
            "text": "Read more about the importance of getting the booster jab here."
        },
        {
            "heading": 3,
            "text": "2. Testing"
        },
        {
            "text": "Secondary age pupils, as well as all school staff, should be testing themselves at home twice weekly – and that’s regardless of whether they have symptoms. They should use lateral flow device (LFD) test kits, available online, from secondary schools/colleges or from your GP or pharmacist."
        },
        {
            "text": "As of Tuesday 14 December, all contacts of someone with a positive case of COVID-19 – whether Omicron or not – should take an LFD test every day for 7 days. This includes all adults who are fully vaccinated and children aged 5-18 years and 6 months. Daily testing by close contacts will help to slow the spread of COVID-19 without meaning people have to isolate."
        },
        {
            "text": "Research on daily testing from the summer showed it was as effective as self-isolation at keeping cases out of school, and much more effective at keeping children who were well in school."
        },
        {
            "text": "Pupils should only stay away from school if they have symptoms or they get a positive test result.   They can still attend if undertaking daily contact testing."
        },
        {
            "text": "If you have any of the main symptoms of COVID-19 (a high temperature, a new, continuous cough, or a loss or change to your sense of smell or taste) even if they're mild you should:"
        },
        {
            "heading": 3,
            "text": "3. Hygiene"
        },
        {
            "text": "People should continue to follow the basic rules of good hygiene. This will help to protect individuals and others from COVID-19. These are:"
        },
        {
            "heading": 3,
            "text": "4. Face coverings and masks"
        },
        {
            "text": "On top of practising good hygiene, face coverings and masks are proven to help stop the spread of COVID-19."
        },
        {
            "text": "We are strongly advising that face coverings should be worn in communal areas in all settings by staff, visitors and pupils or students in year 7 and above, unless they are exempt. Face coverings do not need to be worn in classrooms."
        },
        {
            "text": "Pupils or students (in year 7 or above) should continue to wear face coverings on public and dedicated school transport, unless they are exempt."
        },
        {
            "heading": 3,
            "text": "5. Ventilation"
        },
        {
            "text": "Schools, colleges and early years settings should continue to ensure there is good ventilation in classrooms. This prevents the virus hanging in the air and infecting people."
        },
        {
            "text": "We are providing schools with CO2 monitors to help them identify areas in need of extra ventilation. So far more than 300,000 CO2 monitors have been delivered to schools, early years settings and colleges."
        },
        {
            "text": "We have also opened a special Marketplace where schools and other education settings can buy air purifiers at a reduced rate."
        },
        {
            "text": "More information on our guidance for educational and childcare settings is available on gov.uk: Guidance for schools: coronavirus (COVID-19) - GOV.UK (www.gov.uk)."
        },
        {
            "text": "Our contingency framework sets out the principles of managing local outbreaks of COVID-19 (including responding to variants of concern) in education and childcare settings."
        }
    ]
}