{
    "url": "https://educationhub.blog.gov.uk/2021/12/14/how-getting-a-covid-booster-will-help-protect-education/",
    "title": "How getting a booster will help protect education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Colleges",
        "early years",
        "Schools",
        "Universities"
    ],
    "pub_date": "2021-12-14T10:56:21+00:00",
    "content": [
        {
            "text": "The new Omicron COVID-19 variant is spreading fast. Anyone who is unvaccinated or who hasn’t had their booster is at even greater risk from COVID-19 and more serious illness."
        },
        {
            "text": "On Sunday 12 December, the Prime Minister, together with the NHS launched an urgent national appeal calling for everyone to get the vaccines they are eligible for, including boosters as they offer a higher level of protection against the new variant."
        },
        {
            "text": "As a result, all adults will now be offered a booster jab by the New Year, bringing the target forward by one month."
        },
        {
            "text": "It is important that everyone gets their booster jab but especially so for parents of school-age children and education staff."
        },
        {
            "text": "Here we outline how people can book their boosters and why they are important for protecting education."
        },
        {
            "heading": 3,
            "text": "How do I get my booster?"
        },
        {
            "text": "Booking your booster is simple. Just visit the NHS website or speak to your GP."
        },
        {
            "heading": 3,
            "text": "Why is it so important for parents, young people and education staff to get boosted?"
        },
        {
            "text": "Vaccines are the best way we can protect ourselves. Getting vaccinated is critically important for keeping us, our friends, family members and teachers safe. A booster will strengthen your protection from serious illness from COVID-19 and give you the best possible defence for you and your family."
        },
        {
            "text": "Vaccinating children should also help to reduce the need for children to have time off school and should reduce the risk of spread of COVID-19 within schools. Vaccines provide protection to the children who are vaccinated and help reduce disruption to face to face education."
        },
        {
            "text": "Keeping education and childcare settings open has been our top priority. We know that being in school is vital both for protecting young people’s education and for their mental health, as well as for safeguarding."
        },
        {
            "heading": 3,
            "text": "I’ve had two jabs – why do I need a third? "
        },
        {
            "text": "The Prime Minister said that two jabs aren’t enough to offer the level of protection we need against the new variant meaning those with only two jabs but no booster are more likely to get seriously ill from COVID-19."
        },
        {
            "heading": 3,
            "text": "OK but what are the experts saying?"
        },
        {
            "text": "On Sunday 12 December, the UK’s Chief Medical Officers said that:"
        },
        {
            "heading": 3,
            "text": "What else can we do?"
        },
        {
            "text": "All educational and childcare settings should continue to encourage staff and students to test twice weekly using lateral flow device (LFD) tests."
        },
        {
            "text": "As of Tuesday 14 December, all contacts of someone with a positive case of COVID-19 – whether Omicron or not – should take an LFD test every day for 7 days. This includes all adults who are fully vaccinated and children aged 5-18 years and 6 months. Daily testing by close contacts will help to slow the spread of COVID-19 without meaning people have to isolate."
        },
        {
            "text": "Research on daily contact testing from the summer showed it was as effective as self-isolation at keeping cases out of school, and much more effective at keeping children who were well in school"
        },
        {
            "text": "It is also not too late for people to get their first or second vaccine dose and parents can help by encouraging their school/college age children to get vaccinated. Parents of children aged 12-15 that have not yet had their first vaccine can book their child’s first vaccination slot over the winter break via the national booking system."
        },
        {
            "text": "We have already advised that staff, visitors and pupils or students in year 7 and above should wear a face covering in communal areas. This includes FE and HE settings. Face coverings do not need to be worn in the classroom."
        },
        {
            "text": "In early years settings and primary schools, we already recommend that face coverings should be worn by staff and adults (including visitors) when moving around in corridors and communal areas."
        },
        {
            "text": "We should all continue to follow the basic rules of good hygiene. This will help to protect individuals and others from COVID-19."
        },
        {
            "text": "More information on the rules on testing and face coverings is available here: What does Covid Plan B mean for schools, colleges, universities and early years? - The Education Hub (blog.gov.uk)."
        }
    ]
}