{
    "url": "https://educationhub.blog.gov.uk/2021/12/14/how-were-supporting-students-with-their-mental-health/",
    "title": "How we’re supporting students with their mental health",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Mental Health",
        "Universities"
    ],
    "pub_date": "2021-12-14T15:51:29+00:00",
    "content": [
        {
            "text": "Going to university is a fun and exciting time for most students – but it comes with unique challenges and stresses and can be extremely difficult for many who choose to go."
        },
        {
            "text": "But we want all students to get the support they need so that they can benefit from the opportunities that university offers – that’s why we’re encouraging all universities to sign up to the University Mental Health Charter Programme."
        },
        {
            "text": "But what is the charter and how can it actually help? Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "What is the University Mental Health Charter Programme? "
        },
        {
            "text": "The University Mental Health Charter was created by the charity Student Minds, in partnership with leading higher education organisations, including the Department for Education, using insight from thousands of staff and students to shape a future in which everyone in higher education can thrive."
        },
        {
            "text": "The Charter is a document outlining a set of principles that universities can commit to working towards in order to improve the mental health and wellbeing of their communities. Alongside the charter, Student Minds run the Universities Charter Programme, which gives 40 universities a year the chance to build their skills and understanding of mental health best practice, through shared knowledge and student/staff focused learning."
        },
        {
            "text": "Signing up to the programme means students can feel assured that if their University is signed up to the Charter Programme then they receive consistent and effective mental health and wellbeing support, that is driven by the latest shared best practice."
        },
        {
            "heading": 3,
            "text": "What sort of thing does it include? "
        },
        {
            "text": "​The University Mental Health Charter framework provides a set of evidence-informed principles to support universities to adopt a whole-university approach to mental health and wellbeing."
        },
        {
            "text": "A whole-university approach must include both adequately resourced, effective and accessible mental health services and proactive interventions. It must provide an environment and culture that reduces poor mental health, as well as supporting good mental health, and facilitating staff and students to develop insight, understanding and skills to manage and maintain their own wellbeing."
        },
        {
            "text": "It covers everything from the transition to university, setting standards for student accommodation, how universities should be as workplaces and even  encouraging universities to continue research into mental health."
        },
        {
            "text": "More information is available here."
        },
        {
            "heading": 3,
            "text": "How many universities are signed up to the Charter Programme? "
        },
        {
            "text": "40 Higher Education providers have signed up to the first cohort of the Programme in this academic year. We want all universities to sign up to take part over the next five years, so they can benefit from this invaluable mental health training. You can see which universities have taken part this year here."
        },
        {
            "heading": 3,
            "text": "What if my university or my preferred choice of university isn’t signed up? "
        },
        {
            "text": "Participation in the programme is voluntary, but we want all HE Providers to sign up and this week Universities Minister Michelle Donelan wrote to all Vice Chancellors to make clear her personal passion for protecting student mental health, and encouraging universities to sign up. She said:"
        },
        {
            "heading": 3,
            "text": "What else is available for students?"
        },
        {
            "text": "There are a wide range of resources available for university students and staff – we’ve pulled many of them together here."
        },
        {
            "text": "We have worked with the Office for Students to provide up to £3 million funding for Student Space. Student Space is a mental health and wellbeing platform designed to bridge any gaps in support for students arising from this unprecedented situation and is designed to work alongside existing services. This resource provides dedicated one-to-one phone, text and web chat facilities as well as a collaborative online platform providing vital mental health and wellbeing resources. Over 200,000 people have accessed the platform’s resources since its launch in August 2020, with increasing numbers of students and staff accessing the site each month."
        },
        {
            "heading": 3,
            "text": "Is the Government doing anything else?"
        },
        {
            "text": "This government is investing £2.3 billion extra funding into mental health services by 2023/24 through the NHS Long Term Plan, and an additional £500 million this year to address NHS waiting times. £13 million has been allocated to support young adults (18-25 years), including HE students, to help bridge the gap between children’s and adult mental health services."
        },
        {
            "text": "The OfS has invested £9 million in projects to develop innovative practice, and an additional £15 million has been allocated in the 21/22 academic year to help address the challenges to student mental health posed by the transition to HE, given the increasing demand for mental health services."
        },
        {
            "text": "Through its strategic guidance to the OfS, February 2021, DfE asked that it continue to support initiatives in relation to mental health in the short and long term."
        },
        {
            "text": "The OfS are leading work to establish and disseminate ‘what works’ across the sector to understand and share effective practice, including from innovative projects funded by the OfS."
        }
    ]
}