{
    "url": "https://insidehmcts.blog.gov.uk/2025/04/01/all-of-us-might-need-the-justice-system-one-day-what-can-you-expect-and-how-has-hmcts-reform-made-things-better/",
    "title": "All of us might need the justice system one day: what can you expect and how has HMCTS reform made things better?",
    "authors": [
        "Rachel Hunt, Civil, Family and Tribunals Programme Director"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Family",
        "Tribunals"
    ],
    "pub_date": "2025-04-01T09:30:13+01:00",
    "content": [
        {
            "text": "If the justice system makes you think of criminals, victims, witnesses and juries, you’re not alone. Our criminal courts are a high-profile part of our justice system. We often read about them in the press or see them depicted on TV. Fortunately, our criminal courts are an area that most of us will hope to avoid during our lifetimes. "
        },
        {
            "text": "But we may need to use other justice services at some point in our lives. It may come at a time when we least expect it. We may suffer the sad loss of a loved one and find ourselves dealing with their estate. In this situation, using our probate service becomes a reality. We might find ourselves owed money by a person or business and need the help of our civil money claims service to resolve the problem. Or through tribunals, we could need to appeal life changing decisions like unfair dismissal at work or about the benefits we rely on to provide for our families and those close to us. At times like these we all deserve to access efficient services that won’t make a tough situation more difficult."
        },
        {
            "text": "As our Reform Programme draws to a close, I want to explain some of the ways we’ve improved these services and others, across our civil and family courts and tribunals."
        },
        {
            "heading": 2,
            "text": "What we set out to achieve"
        },
        {
            "text": "We needed to break down the barriers that many people felt and experienced when they used our civil and family courts and tribunals. Reform called time on people feeling alienated by an outdated system, moving away from paper-based forms, towards modern digital systems that are straightforward to access and navigate."
        },
        {
            "text": "We’ve changed what we ask of people using our services, moving away from long paper forms with unfathomable language. And reduced the need for people to make journeys to and from our buildings, increasing use of technology to hear cases remotely, where a judge approves."
        },
        {
            "heading": 2,
            "text": "People like you helped through modernisation"
        },
        {
            "text": "Take online divorce. Before Reform, one user told us she nearly gave up on the process. The stress, complexity and cost of applying nearly became too much. In her own words, she felt ‘like an outsider in a system that spoke a different language’."
        },
        {
            "text": "Contrast this with another user – Crispin – and his partner who took the difficult decision to separate, when our digital divorce service was available. While of course still a difficult time, he described the ‘smooth process’ as ‘one of the more positive parts of the divorce because everything went as it should’."
        },
        {
            "text": "It’s so heartening to hear stories like Crispin’s, because I remember how far we’ve come in making the experience better for people rather than adding to their stress. Since 2019, Crispin’s application is one of over 500,000 applications made digitally. He and so many others benefit from a more accessible and modernised service. 24/7 access to their online applications, clear intuitive guidance, consistent support available directly from our knowledgeable Service Centre staff. This is how it should be for the people we serve."
        },
        {
            "text": "It’s not just our family courts we’ve modernised. If you’ve ever tried to get money back owed from a business or contractor, you’ll know the last thing you need in those circumstances is a slow, outdated system."
        },
        {
            "text": "It’s made the process three times faster than it was before. A free mediation service is also helping our users resolve disputes earlier and more cheaply. One solicitor told us a modernised service meant it took just 10 weeks to resolve a client’s case, meaning she could hire a new builder to fix a botched extension and enjoy her home once more."
        },
        {
            "text": "For those who may be facing a desperate situation and need to seek asylum in the UK, resolve a dispute with their employer or appeal a crucial benefits decision, our tribunals act as a lifeline. Before we reformed these services, people challenging decisions made by powerful organisations or agencies described a hard, slow process. For those where English wasn’t their first language it was worst. These were very real barriers to accessing justice. Over 600,000 tribunal users have benefitted from modernised services that have transformed a range of tribunals appeals process."
        },
        {
            "heading": 2,
            "text": "Consistent services with satisfied users"
        },
        {
            "text": "User satisfaction rates across our digital services have consistently remained high across civil, family and tribunals services. For example, they’re at 80% in online divorce and 85% for social security and child support appeals."
        },
        {
            "text": "This is partly due to a more consistent service delivered across our five national Service Centres. Everyone involved in delivering a service are centrally located and under one roof. Issues can be identified, addressed and resolved far more quickly and efficiently. It has put an end for the need to send information and instructions across multiple locations. Our Service Centre and National Business Centres dealt with over 2.8 million calls during  2024, many from people looking for support and information about civil, family or tribunals cases."
        },
        {
            "text": "Reforming so many services has certainly been a challenge and we’ve listened, learned and adapted along the way. We’ve worked with our users and partners to inform change and make things better. We can see the results of this engagement - in January 2024 there was a backlog of 76,500 probate applications which we reduced to 37,200 in January 2025. This is thanks to a modern service and innovative working with experts in the field."
        },
        {
            "heading": 2,
            "text": "What are we doing next to improve our services?"
        },
        {
            "text": "Our improvements are far from over. We’ll keep developing our services. We will roll out the reformed private family law service and finish a more focused range of services in the civil courts. We will be developing new features in the money claims and damages claims services and designing a digital service for housing possession claims."
        },
        {
            "text": "In years to come I want to be able to share more stories like Crispin’s who experienced a smooth, supportive service. And never again do I want to hear stories of outdated processes meaning people nearly give up on the process. Experiences like this must firmly stay in the past."
        },
        {
            "text": "To find out more about our civil, family and tribunals reformed services, visit our GOV.UK pages. Or subscribe and listen to the HMCTS Podcast series to hear first-hand from people using and delivering our services."
        }
    ]
}