{
    "url": "https://valuationoffice.blog.gov.uk/2025/04/01/how-we-value-properties-for-business-rates-the-receipts-and-expenditure-method/",
    "title": "How we value properties for business rates: the receipts and expenditure method",
    "authors": [
        "Alan Colston - Chief Valuer and Head of Surveying Profession"
    ],
    "categories": [
        "Business Rates",
        "How We Value",
        "Valuation Methods"
    ],
    "pub_date": "2025-04-01T13:51:46+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "In the first part of our series, we explained that most properties are valued based on their annual rental value. But if you run a hotel, self-catering accommodation, or another specialist business property, you might be wondering how we calculate your business rates when similar properties aren't often rented out. "
        },
        {
            "text": "At the Valuation Office Agency (VOA), we use what's called the receipts and expenditure method. This approach is used when there is little or no evidence of rents and the property’s main purpose is to make a profit."
        },
        {
            "heading": 2,
            "text": "What is the receipts and expenditure method?"
        },
        {
            "text": "While we prefer to use rental evidence whenever possible, some properties are rarely rented on the open market. These include places like:"
        },
        {
            "text": "Instead of relying on information about the rent these businesses pay, which might not exist for these types of properties; we look at the amount of income the property generates and the costs involved in running it to work out the rental value. Think of this method as working backwards from your property’s income to figure out what a reasonable rent would be.   To do this, we start by:"
        },
        {
            "text": "The remainder represents what could reasonably be paid in rent."
        },
        {
            "heading": 2,
            "text": "Making it practical: shortened receipts and expenditure"
        },
        {
            "text": "With the number of these types of properties valued across England and Wales, it wouldn’t be practical to review the full financial accounts of every single one. Instead, we take a representative sample of each type of property to analyse in full."
        },
        {
            "text": "Once we’ve calculated a reasonable rent for our sample properties, we compare each figure to the gross receipts, which is its total income. This gives us a percentage that shows how much of the income goes towards the rent."
        },
        {
            "text": "This is quite complex, so let’s use an example to bring it to life. If the gross receipts of a property were £1 million, and the remainder (the reasonable rent) was £100,000, we can predict that the rent of a similar property would be 10% of its total receipts.  "
        },
        {
            "text": "By analysing a sample of properties in full, we can establish a range of percentages to use as benchmarks. These percentages allow us to estimate a fair rental value for similar properties without needing their full financial information."
        },
        {
            "text": "For example, when valuing large hotels, we categorise them based on type and location. Each category will have its own percentage. Hotel categories could include:"
        },
        {
            "text": "This ensures that the rental value reflects the specific characteristics and earning potential of each property type."
        },
        {
            "heading": 2,
            "text": "How can I find out more? "
        },
        {
            "text": "You can sign up for a business rates valuation account to find out more about how your rateable value has been calculated. . "
        },
        {
            "text": "Further information on the receipts and expenditure method of valuation can be found in the VOA Rating Manual Rating Manual section 4: valuation methods - Part 2: the receipts and expenditure method - Guidance - GOV.UK."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Sut rydym yn prisio eiddo ar gyfer ardrethi busnes: y dull derbyniadau a gwariant"
        },
        {
            "text": "Yn rhan gyntaf ein cyfres, fe wnaethom esbonio bod y rhan fwyaf o eiddo yn cael eu prisio yn seiliedig ar eu gwerth rhent blynyddol. Ond os ydych chi'n rhedeg gwesty, llety hunanarlwyo, neu eiddo busnes arbenigol arall, efallai y byddwch chi'n meddwl tybed sut rydym yn cyfrifo eich ardrethi busnes pan nad yw eiddo tebyg yn cael eu rhentu yn aml."
        },
        {
            "text": "Yn Asiantaeth y Swyddfa Brisio (VOA), rydym yn defnyddio'r hyn a elwir yn ddull derbyniadau a gwariant. Defnyddir y dull hwn pan nad oes llawer o dystiolaeth o renti a phrif bwrpas yr eiddo yw gwneud elw."
        },
        {
            "heading": 2,
            "text": "Beth yw'r dull derbyniadau a gwariant?"
        },
        {
            "text": "Beth yw'r dull derbyniadau a gwariant?"
        },
        {
            "text": "Er bod yn well gennym ddefnyddio tystiolaeth rhent pryd bynnag y bo modd, anaml y caiff rhai eiddo eu rhentu ar y farchnad agored. Mae'r rhain yn cynnwys lleoedd fel:"
        },
        {
            "text": "Yn hytrach na dibynnu ar wybodaeth am y rhent y mae'r busnesau hyn yn ei dalu, rhywbeth efallai na fydd yn bodoli ar gyfer y mathau hyn o eiddo; rydym yn edrych ar faint o incwm y mae'r eiddo yn ei gynhyrchu a'r costau sy'n gysylltiedig â'i redeg i gyfrif y gwerth rhent. Meddyliwch am y dull hwn fel gweithio yn ôl o incwm eich eiddo i ddarganfod beth fyddai rhent rhesymol. I wneud hyn, rydym yn dechrau trwy:"
        },
        {
            "text": "Mae'r gweddill yn cynrychioli'r hyn y gellid ei dalu'n rhesymol mewn rhent."
        },
        {
            "heading": 2,
            "text": "Deall hyn yn ymarferol: derbyniadau a gwariant byrrach"
        },
        {
            "text": "Gyda nifer y mathau hyn o eiddo yn cael eu prisio ledled Cymru a Lloegr, ni fyddai'n ymarferol adolygu cyfrifon ariannol llawn pob un ohonynt. Yn lle hynny, rydym yn cymryd sampl gynrychioliadol o bob math o eiddo ac yn eu dadansoddi'n llawn."
        },
        {
            "text": "Ar ôl i ni gyfrifo rhent rhesymol ar gyfer ein heiddo sampl, rydym yn cymharu pob ffigur â'r derbyniadau gros, sef cyfanswm eu hincwm. Mae hyn yn rhoi canran i ni sy'n dangos faint o'r incwm sy'n mynd tuag at y rhent."
        },
        {
            "text": "Mae hyn yn eithaf cymhleth, felly gadewch i ni ddefnyddio enghraifft er mwyn ei wneud yn fwy real. Pe bai derbyniadau gros eiddo yn £1 miliwn, a'r gweddill (y rhent rhesymol) yn £100,000, gallwn ragweld y byddai rhent eiddo tebyg yn 10% o gyfanswm ei dderbyniadau. "
        },
        {
            "text": "Trwy ddadansoddi sampl o eiddo yn llawn, gallwn sefydlu ystod o ganrannau i'w defnyddio fel meincnodau. Mae'r canrannau hyn yn caniatáu inni amcangyfrif gwerth rhent teg ar gyfer eiddo tebyg heb fod angen eu gwybodaeth ariannol lawn."
        },
        {
            "text": "Er enghraifft, wrth brisio gwestai mawr, rydym yn eu categoreiddio yn seiliedig ar fath a lleoliad. Bydd gan bob categori ei ganran ei hun. Gall categorïau gwestai gynnwys:"
        },
        {
            "text": "Mae hyn yn sicrhau bod y gwerth rhent yn adlewyrchu nodweddion penodol a photensial ennill pob math o eiddo."
        },
        {
            "heading": 2,
            "text": "Sut alla i ddarganfod mwy?"
        },
        {
            "text": "Gallwch gofrestru ar gyfer cyfrif prisio ardrethu busnes i ddarganfod mwy am sut mae eich gwerth ardrethol wedi'i gyfrifo"
        },
        {
            "text": "Gellir dod o hyd i fwy o wybodaeth am y dull derbyniadau a gwariant yn llawlyfr ardrethu Asiantaeth y Swyddfa Brisio Rating Manual section 4: valuation methods - Part 2: the receipts and expenditure method - Guidance - GOV.UK."
        }
    ]
}