{
    "url": "https://mhclgmedia.blog.gov.uk/2025/04/01/making-work-pay-inflation-beating-minimum-wage-increases-from-1-april/",
    "title": "Making work pay: inflation-beating minimum wage increases from 1 April",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2025-04-01T15:53:52+01:00",
    "content": [
        {
            "text": "Over 3 million workers across the UK including 1 million in hospitality and retail will benefit from minimum pay increases from 1 April – a government intervention to make work pay by ensuring the cost of living is accounted for in new rates."
        },
        {
            "text": "These boosts to the National Living Wage and National Minimum Wages are featured prominently in national and regional news today (1 April), highlighting the vast number of workers set to benefit, including young workers and apprentices."
        },
        {
            "text": "Today’s I Paper front page - also picked up by The Telegraph - splashes on the Deputy Prime Minister Angela Rayner’s words that her new rights for workers and drive to push up pay for those on lower incomes are a personal mission which will help the economy. Speaking exclusively to the I, she said:"
        },
        {
            "text": "“Like many of you, I started my working life on low pay, never sure if I would be able to make ends meet by the end of the month…from today, our changes will mean that the lowest paid will see their pay rise by more than twice the rate of inflation. It is a record rise too for 18 to 20-year-olds and apprentices, representing a giant leap in bringing all adults onto the same pay rate.”"
        },
        {
            "text": "In The Mirror, the Business Secretary Jonathan Reynolds highlights how the minimum pay rises will mean the “lowest paid aren’t left behind”. And talking to The Metro, the Deputy PM reiterated the government’s focus “on turning the page for good” with these pay increases, by providing “better job security, more money in working people’s pockets and more cash being spent in our economy.”"
        },
        {
            "text": "In other national and consumer news, The Sun, Express and LadBible run explainer stories breaking down the new bumped up hourly rates across all age groups."
        },
        {
            "text": "In Scotland, The Daily Record carries the Deputy PM’s statement on 220,000 Scots “getting the pay rise they desperately deserve”, with further coverage in The Glasgow Times, Herald Scotland, STV News and more. In Wales, news outlets including the Nation Cymru, Deeside.com, The Wales Online and Noth Wales Pioneer also highlight the 160,000 Welsh workers set to benefit, while the BBC online Northern Ireland reports on the 170,000 workers benefitting in its region."
        },
        {
            "text": "Speaking to Jeremy Vine on his BBC Radio 2 show today, the Deputy PM highlighted other government work to protect people and families against wider cost of living challenges, including free breakfast clubs in primary schools from this month putting £450 a year in working parents’ pockets."
        },
        {
            "text": "Today’s coverage follows on from the weekend reporting in The Mirror and regional papers marking the extra rises to support young people and improve their job prospects through better-paid apprenticeships."
        }
    ]
}