{
    "url": "https://environmentagency.blog.gov.uk/2025/04/01/making-a-difference-what-is-it-it-like-be-an-ea-environment-officer/",
    "title": "Making a difference: What is it it like be an EA Environment Officer?",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Cleaner Seas",
        "Cleaner Seas",
        "Regulated industry",
        "Rivers",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2025-04-01T16:00:35+00:00",
    "content": [
        {
            "text": "Christopher Clayton joined the Environment Agency in January 2025 as an Environment Officer with one of the newly formed Water Industry Regulation teams in Lincolnshire. He shares an insight into his role and the reasons why he is so passionate about the environment and his chance to make a difference."
        },
        {
            "text": "Why I Joined the Environment Agency"
        },
        {
            "text": "As someone who has grown up in around the countryside, I have always had a keen interest in the environment and its impact on my life. As a triathlete and open water swimmer, the quality of bathing waters and regulation of the water industry has never been far from my mind. As such, the opportunity to make a difference in the Water Industry Regulation team was something that I was very passionate to undertake."
        },
        {
            "text": "The start to my role as an Environment Officer"
        },
        {
            "text": "There are three key points that have really struck me in my first few months in my role as an Environment Officer. The first is that there are passionate individuals across all forms of the organisation who want to make a difference. Through my training and networking, I have met various people from Deputy Directors to fellow officers.  Amongst them there is a genuine commitment to acting on the Water Industry Regulation Transformation Programme. Many people, like me, have a drive to continuously improve the water environment by holding water companies to account and ensuring there is continuous improvement."
        },
        {
            "text": "The second is that there is a real focus on the training of the new Environment Officers. I have a mentor, an experienced Environment Officer who supports my technical development, as well as my team leader who supports my personal development."
        },
        {
            "text": "To help and facilitate my learning I have also had access to a training programme that has mixed classroom-based learning with hands on learning. This has included a week at the Environment Officer Academy learning about water regulation, permitting and various causes of poor water quality. It has also included an introduction to regulation session where the organisation’s plans to regulate were shown. These were attended by newly recruited Environment Officers."
        },
        {
            "text": "The third and perhaps most pertinent is that inspections are already happening across our new Water Industry Regulation teams increasing the number that was previously possible.  In my first month I have already been on 3 days of inspections across various water company assets. Assets are the physical infrastructure owned by a company, in this case Anglian Water. I have learnt that the inspections themselves can be very challenging but are also educational. It is extremely rewarding to play a part in keeping our watercourses as healthy as possible and begin to make a difference in tackling issues."
        },
        {
            "text": "Preparation for an inspection at a wastewater treatment works will begin in the days leading up to the inspection. I will spend time going over the site’s environmental permit. The environmental permit sets out the conditions under which the site should operate. I will then study previous Compliance Assessment Report forms and any previous pollution incidents in the area. I will also research the general site area, and the local water catchment area."
        },
        {
            "text": "Once I have completed any pre-inspection checks I will get my personal protective equipment (PPE) and sampling equipment ready and head out to the site. I have been shadowing my mentor and other Environment Officers to observe the inspection process but also to see how various assets work."
        },
        {
            "text": "The majority of our inspections at water company assets are unannounced. On site we will meet representatives from the water company and then inspect the wastewater treatment works and assess compliance against the site’s environmental permit. We will take photographs as supporting evidence during our inspection and refer to the permit. It is a great opportunity for me to ask questions to both my colleagues and the water company representative, for my own development about on-site operations and maintenance. Whilst on site we will look for any breaches of the conditions within the permit. This might include problems with infrastructure or site operations which could potentially lead to a pollution incident or future compliance issues."
        },
        {
            "text": "Once we have finished the inspection, we will make sure all the relevant on-site paperwork is completed and return to the office for post-inspection tasks."
        },
        {
            "text": "Within 14 days we will complete a Compliance Assessment Report which is then sent to the water company and uploaded to a national database for public viewing. These will identify any corrective actions that need to be taken by the water company to bring the site back into compliance with the permit."
        },
        {
            "text": "As an Environment Officer I have also been responding to any incidents that are reported, here I am in responding to reports of black algae on the Lincolnshire Coast."
        },
        {
            "text": "These algal blooms were reported in early September by a member of the public. Environment officers from various teams attended and took algae samples. Analysis of these algae samples was carried out by colleagues in our Analysis and Reporting team, and CEFAS. The algae was identified as an exceedingly intense bloom of Attheya Armata, a non-toxic variety, but one with potential to cause skin and eye irritation."
        },
        {
            "text": "This was raised as an incident on Swimfo, (our online portal where the public can find out more about the water quality at bathing waters) resulting in our partners in local authority putting up signage at the beach to advise against bathing."
        },
        {
            "text": "Due to the long duration of this incident, numerous confirmation samples were required to be taken by Environment Officers. The local authority also provided support with regular visual checks of the beach to confirm the algae’s continued presence."
        },
        {
            "text": "During February 2025, a colleague and I attended and were finally able to confirm that the algae was no longer present."
        },
        {
            "text": "It has been a great first two months as an Environment Officer in the Environment Agency. Although the work has only just started, it is great to be able to be helping to make a difference so early. I am looking forward to improving the water environment for years to come."
        }
    ]
}