{
    "url": "https://rpc.blog.gov.uk/2025/04/01/regulatory-policy-committee-says-thank-you-and-farewell-to-four-existing-members-and-welcomes-four-new-appointees/",
    "title": "Regulatory Policy Committee says thank you and farewell to four existing members and welcomes four new appointees",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2025-04-01T09:09:21+01:00",
    "content": [
        {
            "text": "April sees the RPC losing four of its members who reach the end of their terms of office and the arrival of four new members. All 12 current and future members were able to join the recent March committee meeting."
        },
        {
            "text": "Departing are Daniel Dalton, Stephen Gifford, John Longworth and Andrew Williams-Fry."
        },
        {
            "text": "The new arrivals are John Davies, Allan Little, Caroline Turnbull-Hall and Frances Warburton – biographies below."
        },
        {
            "text": "Stephen Gibson, RPC Chair, said “It is important for an advisory body like the RPC that the membership changes periodically. I am sorry to say goodbye to Dan, John, Stephen and Andrew, who have made important contributions to the work of the RPC and I would like to thank them for their support and hard work for the committee. I am, at the same time, delighted to welcome Caroline, Frances, Allan and John. I am sure they will quickly become key members of the team as we help the Government in ensuring that regulation achieves its objectives and supports growth.”"
        },
        {
            "text": "The new members are:"
        },
        {
            "text": "John Davies"
        },
        {
            "text": "John Davies is an independent economist specialising in the economics of competition and regulation.  He has been Chief Economist of the UK Competition Commission, founding Executive Director of the Competition Commission of Mauritius and Head of Competition Policy (and for a time acting Head of Investment Policy) at the OECD.  He has also worked as a consulting economist, most recently for Compass Lexecon, where he jointly headed the London office until 2023.  He is a Member of the Competition Appeal Tribunal in the UK; an Associate and member of the advisory board of the Centre for Competition Policy at the University of East Anglia and an Advisor to the Competition Commission of Mauritius."
        },
        {
            "text": "Allan Little"
        },
        {
            "text": "Dr Allan Little spent 18 years in the Government Economic Service, specialising in policy appraisal and evaluation. In 2024, he left the Civil Service to set up Mission Economics, a consultancy focused on social value, economic research, and digital technology. He is also contracted as Chief Economist at State of Life, a wellbeing research consultancy."
        },
        {
            "text": "During his time in government, Allan held several analytical roles supporting and scrutinising regulatory policy. He was Head of Economic Appraisal at the Department for Education and Head of the Carbon Centre of Excellence at the Department for Transport. He also served as Principal Economist at ONE North East (Regional Development Agency) and Economic Adviser at the Department for Work and Pensions, following an early career in academia."
        },
        {
            "text": "Caroline Turnbull-Hall"
        },
        {
            "text": "Caroline has recently served as a member of the ICAEW Regulatory Board and is a Warden of the Worshipful Company of Tax Advisers. She holds the position of Senior Regulatory Policy Advisor at ICAEW and also works as an Independent Trade and Regulatory Adviser. Previously, Caroline was a Director of Regulatory Affairs and Trade at PwC UK, with considerable experience in regulatory policy, especially in relation to professional services and tax. Additionally, she has experience as a Policy Adviser at the Office of Tax Simplification and is both a qualified barrister and charted accountant. "
        },
        {
            "text": "Frances Warburton"
        },
        {
            "text": "Frances is a senior leader and regulatory expert with almost 30 years experience working across the public and private sectors.  Her experience includes working as a Competition Investigation Director at the OFT, as a Director at Ofgem and as a Partner in the Economic Advisory practice at Ernst & Young.  She has been an expert witness in several high profile regulatory decisions and market enquiries, and has advised on a wide range of regulatory matters. "
        }
    ]
}