{
    "url": "https://publicguardian.blog.gov.uk/2025/04/01/your-questions-answered-finding-searching-and-viewing-lasting-powers-of-attorney-lpa/",
    "title": "Your questions answered: Finding, searching and viewing lasting powers of attorney (LPA)",
    "authors": [
        "dquill"
    ],
    "categories": [
        "FAQs",
        "Guidance",
        "lasting power of attorney",
        "LPA",
        "Your questions answered"
    ],
    "pub_date": "2025-04-01T10:45:12+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We receive thousands of calls and emails each week from people and organisations requesting to view or search for lasting powers of attorney (LPAs).  You might work for a bank, healthcare provider or local authority and need to verify that an LPA is in place so an attorney can make decisions on behalf of a donor.   This blog is part of a series, answering your questions by breaking down the different stages of an LPA journey. Here we look at common questions about finding, searching and viewing them.    "
        },
        {
            "text": "View also:"
        },
        {
            "heading": 3,
            "text": "Completing forms"
        },
        {
            "text": "Includes signing forms in order"
        },
        {
            "heading": 3,
            "text": "Payments and fees"
        },
        {
            "text": "Includes cheques and applying for remissions and exemptions"
        },
        {
            "heading": 3,
            "text": "Attorneys, witnesses and certificate providers"
        },
        {
            "text": "Includes making a start and who to involve"
        },
        {
            "heading": 3,
            "text": "Using your LPA"
        },
        {
            "text": "Includes reference numbers, activation keys and access codes"
        },
        {
            "heading": 3,
            "text": "Reporting and making changes to your LPA"
        },
        {
            "text": "Includes reporting a death and changing address"
        },
        {
            "heading": 3,
            "text": "I already know there is an LPA in place – how do I view it?  "
        },
        {
            "text": "If you already know there is an LPA in place you can use the ‘View an LPA’ service. You will need an access code to use it.   An attorney or donor will need to create an account to set up access codes using our ‘Use an LPA’ service. There is more information about how to do this on our ‘using your LPA’ blog.  "
        },
        {
            "heading": 3,
            "text": "I’m not sure if there is an LPA in place – how do I find out?   "
        },
        {
            "text": "If you’re not sure if there is an LPA in place the best thing to do is ask the donor or attorney first and see if you can use the ‘View an LPA service’. If this isn’t possible, you can request to search the OPG registers."
        },
        {
            "heading": 3,
            "text": "What’s the difference between searching for an LPA and ‘View an LPA’?"
        },
        {
            "text": "View an LPA is the quickest, easiest and most secure way to view a summary of an LPA that you know exists.  Searching our OPG registers takes longer and can be used when you can’t get an access code from the attorney or donor, or you’re not sure if an LPA is in place.  "
        },
        {
            "text": "View an LPA provides an immediate summary. Searching the OPG registers can take up to 15 working days.  "
        },
        {
            "text": "View an LPA is for LPAs only. You can search the OPG registers for LPAs, enduring powers of attorney (EPAs), deputyships and guardianships. "
        },
        {
            "heading": 3,
            "text": "What are OPG’s registers?"
        },
        {
            "text": "Our registers are lists related to legal authority and decision-making for individuals who may lack mental capacity. OPG’s registers include: "
        },
        {
            "text": "Register of Lasting Power of Attorney (LPA) This lists individuals who have made and registered an LPA, appointing someone to make decisions on their behalf.  "
        },
        {
            "text": "Register of Enduring Power of Attorney (EPA) This contains details of EPAs made and registered before the LPA system was introduced and put in place (before 2007). "
        },
        {
            "text": "Register of Court-Appointed DeputiesThis lists individuals appointed by the Court of Protection to make decisions for those who lack mental capacity (local authorities, professionals – solicitors or lay people for example: family member etc)."
        },
        {
            "text": "Register of Guardianship OrdersThis contains details of individuals appointed as a Guardian by the High Court to look after the financial affairs of someone who is missing, is in prison abroad and cannot communicate, or has been taken hostage or kidnapped.  "
        },
        {
            "heading": 3,
            "text": "How do I request a search of the OPG registers?"
        },
        {
            "text": "You will need to complete an OPG100 form and send it to OPG. It is best to complete this digitally and submit it to the email address given on the form.  Forms that are printed and posted will take longer to process.  You will find information about completing and sending the form on the form itself. The form also shows a a list of what you can find out by searching our registers.  It may be quicker to use our View an LPA service."
        },
        {
            "heading": 3,
            "text": "I need to send an OPG100 form. Do I need to complete it all?   "
        },
        {
            "text": "All mandatory sections must be completed, but not necessarily every section. An incomplete form submission will result in the OPG100 form being returned to the sender."
        },
        {
            "heading": 3,
            "text": "Should I password protect the OPG100 form?"
        },
        {
            "text": "No. The inbox is secure and adding passwords can delay access and the response. "
        },
        {
            "heading": 3,
            "text": "I need to search or view more than one LPA at the same time. How do I do this?  "
        },
        {
            "text": "The View an LPA service will allow you to view one LPA at a time. You will need a different access code for each LPA.  If you have requested to search our registers instead of using ‘View an LPA’, all search requests will need to be on an individual OPG100 form. You could do this by sending separate emails or attaching multiple forms as attachments. If attaching multiple forms, it works best if there are fewer than 25."
        },
        {
            "heading": 3,
            "text": "I need to find a power of attorney registered in Scotland or Northern Ireland. Can you help?  "
        },
        {
            "text": "No. We are responsible for LPAs and EPAs registered in England and Wales only."
        },
        {
            "heading": 3,
            "text": "How do I find out if a missing person has a guardianship in place? "
        },
        {
            "text": "A guardianship relates to the Missing Persons Act 2017. You will need to complete a GS4 form to search our guardianship register."
        },
        {
            "heading": 3,
            "text": "I work for the police, social services or NHS. How do I conduct a search related to a safeguarding enquiry?"
        },
        {
            "text": "If you are making decisions about an adult at risk or are involved in a safeguarding investigation, you may need information urgently."
        },
        {
            "text": "Please refer to the guidance on GOV.UK: Urgent enquiries: check if someone has an attorney or deputy."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Dod o hyd i, chwilio a gweld atwrneiaeth arhosol (LPA) "
        },
        {
            "text": "Rydym yn derbyn miloedd o alwadau ac e-byst bob wythnos gan bobl a sefydliadau sy'n gwneud cais i weld neu chwilio am atwrneiaeth arhosol (LPA).  Efallai eich bod yn gweithio i fanc, darparwr gofal iechyd neu awdurdod lleol a bod angen i chi wirio bod atwrneiaeth arhosol ar gael fel y gall atwrnai wneud penderfyniadau ar ran rhoddwr.   Mae'r blog hwn yn rhan o gyfres, sy'n ateb eich cwestiynau trwy fynd trwy wahanol gamau proses LPA. Yma edrychwn ar gwestiynau cyffredin am ddod o hyd i, chwilio a gweld LPA.    Gweler hefyd: "
        },
        {
            "heading": 3,
            "text": "Llenwi ffurflenni"
        },
        {
            "text": "Yn cynnwys llofnodi ffurflenni mewn trefn"
        },
        {
            "heading": 3,
            "text": "Taliadau a ffioedd"
        },
        {
            "text": "Yn cynnwys sieciau a gwneud cais am ostyngiadau ac esemptiadau"
        },
        {
            "heading": 3,
            "text": "Atwrneiod, tystion a darparwyr tystysgrif"
        },
        {
            "text": "Mae’n cynnwys dechrau arni a phwy i’w gynnwys"
        },
        {
            "heading": 3,
            "text": "Defnyddio eich LPA"
        },
        {
            "text": "Yn cynnwys cyfeirnodau, allweddi ysgogi a chodau mynediad"
        },
        {
            "heading": 3,
            "text": "Adrodd a gwneud newidiadau i’ch LPA"
        },
        {
            "text": "Yn cynnwys rhoi gwybod am farwolaeth a newid cyfeiriad"
        },
        {
            "heading": 3,
            "text": "Rwy'n gwybod eisoes bod LPA ar gael – sut ydw i'n ei gweld?"
        },
        {
            "text": "Os ydych chi eisoes yn gwybod bod LPA ar gael, gallwch ddefnyddio'r gwasanaeth 'Gweld LPA'. Bydd angen cod mynediad arnoch i'w ddefnyddio.   Bydd angen i atwrnai neu roddwr greu cyfrif i sefydlu codau mynediad gan ddefnyddio ein gwasanaeth 'Defnyddio LPA'. Mae mwy o wybodaeth am sut i wneud hyn ar ein blog 'defnyddio'ch LPA'."
        },
        {
            "heading": 3,
            "text": "Dydw i ddim yn siŵr a oes LPA ar gael – sut ydw i'n cael gwybod?"
        },
        {
            "text": "Os nad ydych chi'n siŵr a oes LPA, y peth gorau i'w wneud yw gofyn i'r rhoddwr neu'r atwrnai yn gyntaf a gweld os oes modd i chi ddefnyddio'r gwasanaeth 'Gweld LPA'. Os nad yw hyn yn bosibl, gallwch wneud cais ichwilio'r cofrestri Swyddfa’r Gwarcheidwad Cyhoeddus (OPG)."
        },
        {
            "heading": 3,
            "text": "Beth yw'r gwahaniaeth rhwng chwilio am LPA a 'Gweld LPA'?"
        },
        {
            "text": "Gweld LPA yw'r ffordd gyflymaf, hawsaf a mwyaf diogel o weld crynodeb o LPA rydych chi'n gwybod sy’n bodoli.  Mae chwilio ein cofrestri OPG yn cymryd mwy o amser a gellir eu defnyddio pan na allwch gael cod mynediad gan yr atwrnai neu'r rhoddwr, neu os nad ydych yn siŵr os oes yna LPA.  "
        },
        {
            "text": "Mae Gweld LPA yn rhoi crynodeb yn syth i chi. Gall chwilio cofrestri OPG gymryd hyd at 15 diwrnod gwaith.  "
        },
        {
            "text": "Mae Gweld LPA ar gyfer LPA yn unig. Gallwch chwilio cofrestri OPG am LPA, atwrneiaeth barhaus (ETA), dirprwy a gwarcheidwad."
        },
        {
            "heading": 3,
            "text": "Beth yw cofrestri Swyddfa’r Gwarcheidwad Cyhoeddus?"
        },
        {
            "text": "Rhestrau yw ein cofrestri sy'n ymwneud ag awdurdod cyfreithiol a gwneud penderfyniadau ar gyfer unigolion sydd efallai heb allu meddyliol. Mae cofrestri Swyddfa’r Gwarcheidwad Cyhoeddus yn cynnwys: "
        },
        {
            "text": "Cofrestr Atwrneiaeth Arhosol (LPA) Mae hon yn rhestru unigolion sydd wedi gwneud a chofrestru LPA, gan benodi rhywun i wneud penderfyniadau ar eu rhan.  "
        },
        {
            "text": "Cofrestr Atwrneiaeth Barhaus (EPA) Mae hon yn cynnwys manylion EPA a wnaed ac a gofrestrwyd cyn i'r system LPA gael ei chyflwyno a'i sefydlu (cyn 2007). "
        },
        {
            "text": "Cofrestr Dirprwyon a Benodwyd gan y LlysMae hon yn rhestru unigolion a benodwyd gan y Llys Gwarchod i wneud penderfyniadau ar gyfer y rhai sydd heb alluedd meddyliol (awdurdodau lleol, gweithwyr proffesiynol – cyfreithwyr neu bobl leyg er enghraifft: aelod o'r teulu ac ati). "
        },
        {
            "text": "Cofrestr Gorchmynion GwarcheidiaethMae hon yn cynnwys manylion unigolion a benodwyd yn Warcheidwad gan yr Uchel Lys i ofalu am faterion ariannol rhywun sydd ar goll, sydd yn y carchar dramor ac nad yw'n gallu cyfathrebu, neu a gymerwyd yn wystl neu a herwgipiwyd. "
        },
        {
            "heading": 3,
            "text": "Sut ydw i'n gwneud cais i chwilio cofrestri Swyddfa’r Gwarcheidwad Cyhoeddus? "
        },
        {
            "text": "Bydd angen i chi lenwi ffurflen OPG100 a'i hanfon at Swyddfa’r Gwarcheidwad Cyhoeddus. Mae'n well i chi lenwi hon yn ddigidol a'i hanfon i'r cyfeiriad e-bost a roddir ar y ffurflen.  Bydd ffurflenni sy'n cael eu hargraffu a'u postio yn cymryd mwy o amser i'w prosesu.  Fe welwch wybodaeth am lenwi ac anfon y ffurflen ar y ffurflen ei hun. Mae'r ffurflen hefyd yn dangos rhestr o'r hyn y gallwch ei ddarganfod trwy chwilio ein cofrestri.  Efallai y bydd yn gyflymach defnyddio ein gwasanaeth Gweld LPA."
        },
        {
            "heading": 3,
            "text": "Mae angen i mi anfon ffurflen OPG100. Oes angen i mi ei chwblhau i gyd?"
        },
        {
            "text": "Rhaid cwblhau pob adran orfodol, ond nid o reidrwydd pob adran. Os byddwch yn anfon ffurflen anghyflawn mae’n bosibl y bydd y ffurflen OPG100 yn cael ei hanfon yn ôl atoch. "
        },
        {
            "heading": 3,
            "text": "Oes angen defnyddio cyfrinair i ddiogelu'r ffurflen OPG100?"
        },
        {
            "text": "Nac oes. Mae'r mewnflwch yn ddiogel a gall ychwanegu cyfrineiriau oedi mynediad a'r ymateb. "
        },
        {
            "heading": 3,
            "text": "Mae angen i mi chwilio neu weld mwy nag un LPA ar yr un pryd. Sut ydw i'n gwneud hyn?"
        },
        {
            "text": "Bydd y gwasanaeth Gweld LPA yn caniatáu ichi weld un LPA ar y tro. Bydd angen cod mynediad gwahanol arnoch ar gyfer pob LPA.  Os ydych chi wedi gwneud cais i chwilio ein cofrestri yn hytrach na defnyddio 'Gweld LPA', bydd angen i bob cais chwilio fod ar ffurflen OPG100 unigol. Gallech wneud hyn trwy anfon negeseuon e-bost ar wahân neu atodi mwy nag un ffurflen fel atodiadau. Os ydych chi'n atodi sawl ffurflen, mae'n gweithio orau os oes llai na 25. "
        },
        {
            "heading": 3,
            "text": "Mae angen i mi ddod o hyd i atwrneiaeth arhosol sydd wedi'i gofrestru yn yr Alban neu Ogledd Iwerddon. Ydych chi’n gallu helpu?"
        },
        {
            "text": "Nac ydym. Rydyn ni’n gyfrifol am LPA ac EPA sydd wedi'u cofrestru yng Nghymru a Lloegr yn unig."
        },
        {
            "heading": 3,
            "text": "Sut ydw i'n darganfod a oes gan berson coll warcheidiaeth?"
        },
        {
            "text": "Mae gwarcheidiaeth yn ymwneud â Deddf Personau Coll 2017. Bydd angen i chi lenwi ffurflen GS4 i chwilio ein cofrestr gwarcheidiaeth. "
        },
        {
            "heading": 3,
            "text": "Rwy'n gweithio i'r heddlu, gwasanaethau cymdeithasol neu'r GIG. Sut ydw i'n cynnal chwiliad yn ymwneud ag ymholiad diogelu?"
        },
        {
            "text": "Os ydych chi'n gwneud penderfyniadau am oedolyn mewn perygl neu'n ymwneud ag ymchwiliad diogelu, efallai y bydd angen gwybodaeth arnoch ar frys.  Edrychwch ar y canllawiau ar GOV.UK: Ymholiadau brys: gwirio a oes gan rywun atwrnai neu ddirprwy."
        },
        {
            "heading": 4,
            "text": "We can’t comment on specific applications and cases here and won’t publish questions containing personal information."
        },
        {
            "text": "You can contact customerservices@publicguardian.gov.uk / 0300 456 0300."
        },
        {
            "text": "It will help to have your LPA information to hand so we can help you as quickly as possible. A list of what to include is available in the ‘reporting and making changes to your LPA’ blog."
        },
        {
            "heading": 4,
            "text": "Ni allwn roi sylwadau ar geisiadau ac achosion penodol yma ac ni fyddwn yn cyhoeddi cwestiynau sy’n cynnwys gwybodaeth bersonol."
        },
        {
            "text": "Gallwch gysylltu â ni ar: customerservices@publicguardian.gov.uk / 0300 456 0300."
        },
        {
            "text": "Bydd yn help os bydd yr wybodaeth am yr LPA gennych wrth law er mwyn i ni allu eich helpu mor gyflym â phosibl. Mae rhestr o’r hyn i’w gynnwys ar gael yn y blog ‘adrodd a gwneud newidiadau i’ch LPA’."
        }
    ]
}