{
    "url": "https://educationhub.blog.gov.uk/2022/04/a-year-on-from-the-launch-of-the-ofsted-review-into-sexual-abuse-in-schools-and-colleges/",
    "title": "A year on from the launch of the Ofsted review into sexual abuse in schools and colleges",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Child protection"
    ],
    "pub_date": "2022-04-08T10:08:23+01:00",
    "content": [
        {
            "text": "In response to the murder of Sarah Everard, and the release of thousands of testimonies of incidents of sexual harassment via the Everyone’s Invited website, we rapidly put funding in place for the NSPCC to create a bespoke helpline to support victims and survivors."
        },
        {
            "text": "Alongside this we commissioned Ofsted to undertake an immediate review of sexual abuse in schools and colleges."
        },
        {
            "text": "Now, a year on from the commissioning of that review, we look at the progress that has been made to tackle these difficult issues."
        },
        {
            "heading": 3,
            "text": "What were the key findings the Ofsted review?"
        },
        {
            "text": "On 31 March 2021, we asked Ofsted to undertake an immediate review into sexual abuse across state and independent schools, and the NSPCC-run ‘Report Abuse in Education’ helpline was launched very shortly after."
        },
        {
            "text": "Ofsted visited 32 state and private schools and colleges and spoke to over 900 children and young people about their experiences."
        },
        {
            "text": "The review, published on 10 June 2021, found that the frequency of harmful sexual behaviours meant that some children and young people consider them to be ‘normal’, and that around 90% of the girls interviewed said that sexist name calling and being sent unwanted explicit pictures or videos happened ‘a lot’ or ‘sometimes’."
        },
        {
            "text": "The review found, among other things, that:"
        },
        {
            "heading": 3,
            "text": "How are you teaching about these issues in schools and keeping children safe?"
        },
        {
            "text": "We have taken a number of steps to ensure children and young people are taught about these issues at school."
        },
        {
            "text": "Making RSHE compulsory subjects in 2020 was a significant step, and we are confident that the content of the new curriculum will have a direct effect on pupils’ ability to develop mutually respectful relationships in all contexts. Through RSHE, pupils will gain an understanding of key issues like sexual consent, sexual exploitation, abuse, grooming, coercion, harassment, rape, domestic abuse, forced marriage, so-called ‘honour’-based violence, and female genital mutilation (FGM), and how these can affect current and future relationships."
        },
        {
            "text": "In 2021, following Ofsted’s review, we sent a strong message to schools that delivery of the full RSHE curriculum must be prioritised in 2021-22, and we strongly encouraged them to devote some of their in-service training time to RSHE."
        },
        {
            "heading": 3,
            "text": "How are you supporting teachers and professionals?"
        },
        {
            "text": "We are developing a supplementary package of support to help build teacher’s confidence in teaching about sexual abuse and harassment. In March we ran a series of expert-led webinars on the subjects that teachers have told us are the most challenging to teach: Home | DFE (orcula.co.uk)."
        },
        {
            "text": "We are also developing new, non-statutory guidance for schools, which will cover the specific topics mentioned by the Ofsted review. This will build on the existing RSHE guidance and provide more detail on when specific content around harassment and abuse, including online forms of sexual abuse, should be taught."
        },
        {
            "text": "We published the updated Keeping Children Safe in Education (KCSIE) statutory guidance in September 2021 after a full review of guidance had been undertaken."
        },
        {
            "text": "The strengthened guidance better supports schools and colleges to prevent abuse and appropriately respond when reported, specifically highlighting the importance of acknowledging and understanding the scale of harassment and abuse. We made it explicitly clear that it should be read in conjunction with the Sexual Violence and Sexual Harassment Between Children in Schools and Colleges guidance."
        },
        {
            "text": "At the same time we published updated Sexual Violence and Sexual Harassment between children in schools and colleges guidance to strengthen role of school."
        },
        {
            "text": "Advice and guidance for safeguarding children and young people is already published on GOV.UK and co-ordinated through the Safeguarding children: detailed information collection page."
        },
        {
            "text": "In November and December 2021, we held a series of events with statutory safeguarding partners and schools to identify emerging practice and barriers to effective working. This will form part of a broader piece of work this year to improve how teachers and professionals work together and support children and young people."
        },
        {
            "text": "We are developing a new online hub for designated safeguarding leads (DSLs) to provide information/support for DSLs in schools and colleges. Resources for the hub will be co-developed with DSLs and subject matter experts."
        },
        {
            "text": "We have also worked closely with the Home Office on the development of the Harmful Sexual Behaviour Support Service to assist professionals in tackling harmful sexual behaviours. The helpline can be contacted by calling 0344 2250623 or emailing hsbsupport@swgfl.org.uk."
        },
        {
            "heading": 3,
            "text": "What about support for university students? "
        },
        {
            "text": "We are working with Office for Students to ensure expectations regarding preventing sexual misconduct can be tied to a condition of registration for higher education providers."
        },
        {
            "text": "We are also working with sector leaders, to ensure higher education providers are doing everything they can to reduce sexual harassment and sexual misconduct on campuses."
        },
        {
            "text": "In January 2022, we announced the universities pledge to end use of non-disclosure agreements. Minister Donelan urged all vice-chancellors to sign up to the pledge and 45 have so far with over 1.1 million students covered."
        },
        {
            "heading": 3,
            "text": "Is anything being done regarding safeguarding on social media platforms? "
        },
        {
            "text": "We are working closely with the Department for Digital, Culture, Media and Sport on the upcoming Online Safety Bill so it can strengthen safeguarding controls for children and young people to protect them from viewing online explicit material and engaging in harmful sexual behaviour using social media platforms."
        },
        {
            "text": "In addition, a Children’s Commissioner/Ministerial meeting with tech companies was held in December 2021, where the tech companies pledged to work with the Children’s Commissioner to identify further information which they can usefully share to protect children, and to continue to make available resources to parents, teachers, and children."
        },
        {
            "heading": 3,
            "text": "What support is there for children and young people that have been affected by these issues? "
        },
        {
            "text": "The NSPCC’s Report Abuse in Education helpline continues to provide support and practical guidance to anyone who has suffered sexual abuse or harassment in an educational setting, both recent and historic, and for those who have concerns for someone else."
        },
        {
            "text": "The helpline can be contacted by calling 0800 136 663, or emailing help@nspcc.org.uk."
        }
    ]
}