{
    "url": "https://educationhub.blog.gov.uk/2022/04/08/british-universities-ranked-as-the-best-in-the-world-in-a-range-of-subjects/",
    "title": "British Universities ranked as the best in the world in a range of subjects",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2022-04-08T13:09:45+01:00",
    "content": [
        {
            "text": "The UK is proud to have so many world-class universities that look outward and think beyond conventional boundaries. 57 of the world’s Premiers, Prime Ministers and Presidents were educated in British universities and, on average, our system has produced a Nobel prize winner every year for the last two decades. "
        },
        {
            "text": "The QS World University Rankings by Subject 2022 have shone a light on the quality of the British higher education system with our universities being ranked among the best in the world across several subjects. In over a quarter of subjects, a British department is ranked the best in the world."
        },
        {
            "text": "Across broad subject areas, the University of Oxford and the University of Cambridge have been ranked first and second respectively for Humanities and Arts. The pair are second (Cambridge) and third (Oxford) in Engineering and Technology, Oxford ranks second in life Sciences and Medicine, Cambridge is third in Natural Sciences, and the University of Oxford and London School of Economics (LSE) are second and third respectively in Social Studies and Management."
        },
        {
            "text": "There are lots of success stories across specific subjects too with London’s Royal College of Music ranking top for Performing Arts, the Royal College of Art (London) and University of the Arts London ranking first and second respectively in Art and Design, the University of Sussex coming top in Development Studies followed by SOAS University of London and the University of Oxford, University College London (UCL) coming top in Education and Training, the University of Sheffield ranking top in Library and Information Management, Loughborough University top for sports related subjects, and the Royal Veterinary College (London) ranked top for Veterinary Science."
        },
        {
            "text": "Universities Minister Michelle Donelan said:"
        },
        {
            "text": "The QS World University Rankings by Subject are based upon academic reputation, employer reputation and research impact. You can learn more by reading the methodology."
        }
    ]
}