{
    "url": "https://gott.blog.gov.uk/2022/04/08/knowledge-assets-spring-showcase/",
    "title": "Knowledge Assets Spring Showcase",
    "authors": [
        "Christopher Allen",
        "Michael Rignall"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2022-04-08T13:27:15+01:00",
    "content": [
        {
            "text": "If there is one season that is synonymous with novelty, innovation and the bringing forward of new ideas, then surely, it’s springtime. And as we begin to emerge from another winter, the green shoots of innovation were more welcome than ever at the Knowledge Assets Spring Showcase, where we got a sneak preview of some amazing new technologies and other fantastic developments from the knowledge assets arena."
        },
        {
            "text": "The showcase was held online on 29th March 2022 and was attended by a wide range of people from across government and the wider UK innovation landscape. Please view here.  "
        },
        {
            "text": "Knowledge assets range from intellectual property to innovation, to datasets, to new ideas, processes, or methods. Sometimes the secondary product of a primary activity, such as research and development, project delivery or managing physical assets. We were welcomed by Deputy Directors, Charles Price and Rachel Egan from the Knowledge Assets Team who gave an overview of the project’s achievements this year and a look forward for the next 12 months."
        },
        {
            "text": "Open Data with Transport for London"
        },
        {
            "text": "Lauren Sager-Weinstein, the Chief Data Officer for Transport for London (TfL) spoke about transport activity of one of the world’s busiest cities. With its interconnected networks of rail, buses, tubes, roadways, taxis, boats and more, London’s systems generate terabytes of data."
        },
        {
            "text": "Lauren showed us how TfL has used this rich pool of accumulated data to create a resource: Open Data, which was first created in 2014."
        },
        {
            "text": "Nearly nine thousand registered developers use TfL’s unified Application Programme Interface (API) (which is only one part of TfL’s Open Data offering), to deliver a wealth of apps, maps and resources to millions of residents and visitors. TfL also have a tech forum to allow them to engage with developers and to facilitate the exchange of insight and information."
        },
        {
            "text": "TfL continuously work with new partners to understand how best to share valuable data that can enhance the transport network for all."
        },
        {
            "text": "Lauren also showed us how TfL data can be built into dashboards. Whilst this data isn’t publicly available through the unified API, the example below illustrates the dramatic changes in usage of the transport network that different groups of users made during the pandemic."
        },
        {
            "text": " "
        },
        {
            "text": "Support for Business against the UN Sustainable Development Goals"
        },
        {
            "text": "Silvia Manclossi is head of the Sustainable Development Goals (SDGs) team in the Office for National Statistics (ONS). ONS has used its Knowledge Assets Grant to fund some work to explore a new service ONS could offer to businesses to help them engage with the United Nations (UN)’s SDGs."
        },
        {
            "text": "SDGs are a comprehensive framework of ambitious targets the world has agreed to achieve by 2030. It’s the role of ONS, as the UK’s national statistical office, to report data on the UN global goals which reflect not just environmental sustainability but the five pillars of people, planet, prosperity, peace, and partnership. The goals cover a wide range of issues including gender equality, responsible consumption, innovation and the quality of education. These topics are high on the agenda – not just for Government and policymakers – but for commercial businesses too. The public and customers are interested in how businesses demonstrate their performance in areas such as sustainability and diversity - showing with hard data that they are living these values."
        },
        {
            "text": "What knowledge assets does the ONS SDG team have? First, the Open SDG reporting platform, an online webpage which is open source and free to use and already been implemented in over 30 countries, cities and places around the world. The team’s second asset is their non-official sources protocol, a methodology which looks at SDG data, comparing it against a number of criteria to evaluate its robustness, timeliness and overall quality. The ONS team could help businesses identify the SDGs that are most relevant to them and evaluate which goals they can best contribute to. This would be done by applying the ONS SDG team’s knowledge and standards to ensure high quality data is used to report the goals and help to set the highest possible standards in sustainability reporting for businesses."
        },
        {
            "text": "The funding allowed the team to work on the design of their service offering and to test the market with business customers as well as raising the profile of the opportunities ONS can offer to the business sector."
        },
        {
            "text": "Three New Initiatives within the National Physical Laboratory"
        },
        {
            "text": "Christian Saville, a Product Manager in Life Sciences and Health at the National Physical Laboratory (NPL) spoke about developing a number of projects thanks to funding from the Knowledge Assets Grant Fund and we heard about three of these."
        },
        {
            "text": "The first is a thermal imaging system which NPL have developed to assist with early diagnosis of foot ulcers in diabetic patients. This pioneering work is a real breakthrough in diagnostic technology and aims, through early detection to reduce the number of amputations that patients with diabetes unfortunately endure. The grant funding allowed the team to overcome a key regulatory hurdle in getting the first UKCA marked device approved, which will allow for an initial rollout of devices for use by clinicians."
        },
        {
            "text": "The second development is a new application for ultrasound in the use of breast cancer screening. This technology avoids the use of harmful radiation in detecting cancers and promises safe and early diagnosis for millions of people. With the knowledge assets funding, the team could increase the resolution of the technology and focus on patient wellbeing by making the device more comfortable during scans, which will allow rollout into clinical environments which is so important for an early-stage medical device."
        },
        {
            "text": "The third application makes use of graphene, a novel form of carbon which has myriad applications in science and technology and medicine. NPL created biosensors which can detect antigens including coronavirus particles, and then realised the potential in repurposing this to test for all manner of diseases. We heard how the grant funding allowed NPL to work with a testing partner to optimise and validate a new prototype putting them in a great position to attract development partners and secure future funding."
        },
        {
            "text": "Moving Forward"
        },
        {
            "text": "If we need reasons to be optimistic about the future, then the Spring Showcase certainly provided many. Charles Price closed the event by announcing that the Knowledge Assets Grant Fund will soon be reopening its doors to applications for funding for yet more exciting prospects and I think we all went away with a little more spring in our step."
        }
    ]
}