{
    "url": "https://mojdigital.blog.gov.uk/2022/04/08/simpler-faster-and-better-services-moj-digital-strategy-2025/",
    "title": "Simpler, faster and better services: MoJ Digital Strategy 2025",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "MoJ Digital Strategy 2025"
    ],
    "pub_date": "2022-04-08T11:30:49+01:00",
    "content": [
        {
            "text": "When I first took up the post of CDIO (Chief Digital and Information Officer) I spoke to colleagues across the organisation to hear their views and was very grateful to receive a lot of very honest feedback and insights."
        },
        {
            "text": "Some of that feedback was about the technology that colleagues use every day - good, bad, and ugly I think is an apt summary. They had questions about why we were prioritising particular projects, systems, or parts of the organisation from a delivery perspective. And the overwhelming feedback from colleagues in Justice Digital (formerly Digital & Technology or Digitech) was that we didn’t have a clear purpose or set of priorities as a team. It later came to light that there are 40 different strategies across the MoJ and wider Government that make commitments that we are responsible for delivering - so hardly surprising that there was confusion!"
        },
        {
            "text": "To address these questions we kicked off a piece of work to set out the vision for digital at the MoJ, our priorities for the next 3 years, and the outcomes we hope to work with colleagues across the MoJ to achieve. And to make sure that our digital spend is strategic and intentional, and that there is transparency about where our money is spent."
        },
        {
            "text": "The point wasn’t to stop the work that we’re already doing or to change the many individual agency strategies that have a digital element, but to be clear and open about what we’re doing and why we’re doing it. So there shouldn’t be any surprises and I hope we have struck the right balance between taking care of and improving our existing technology and building new things."
        },
        {
            "text": "Our vision is to make the experience of all of our users simpler, faster, and better. We will do this by reducing technical debt and automating where we can to help the MoJ to be more flexible and responsive to change; making sure the right data is available at the right time and for the right people to improve decision making, and working with operational and policy colleagues to make sure that users are at the heart of all the services we provide. All of this will be underpinned by strong digital capability across the MoJ."
        },
        {
            "text": "I’m genuinely excited about our strategy and plans, and eager to make our services better for all of our users whether they be colleagues, prisoners, solicitors, or victims of crime. And I’m lucky to have so many talented and dedicated colleagues in Justice Digital supporting each other (and me!) in the delivery of this mission."
        },
        {
            "text": "I am absolutely delighted to be able to share the MoJ Digital Strategy 2025 with you today. You can read about the outcomes and watch this short animation which brings to life what we want to achieve over the next three years."
        }
    ]
}