{
    "url": "https://environmentagency.blog.gov.uk/2022/04/08/using-a-virtual-preston-to-teach-young-people-about-flooding/",
    "title": "Using a virtual Preston to teach young people about flooding",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-04-08T16:51:07+00:00",
    "content": [
        {
            "text": "How do we inspire the next generation of environmental champions and ignite the passion for students to take Science Technology, Engineering and Maths (STEM) subjects and careers within the Environment Agency (EA)? "
        },
        {
            "text": "Pupils at a school in Preston, England, have been helping to answer that question by testing specially-themed Minecraft games virtually created to match their local towns flood defences. "
        },
        {
            "text": "Anne-Marie Quibell, Flood & Coastal Risk Management Senior Advisor, explains more about the new game taking the North West and the world by storm.    "
        },
        {
            "text": "Last year, I was contacted about an opportunity within the EA’s Flood Digital Innovation Programme. The team had been working with Microsoft who are the EA’s new technology partners for cloud storage."
        },
        {
            "text": "I was approached to develop a \"unique and immersive virtual learning experience\" which would see the city of Preston transformed into a virtual world within Minecraft. Working on the £55M Preston and South Ribble Flood Risk Management Scheme and engaging with our local communities means that any opportunities to extend the understanding of flood risk are very welcome."
        },
        {
            "text": "Minecraft is hugely popular across the world; most people have heard of it even if they haven’t played it. It is the most successful game of all time. When Microsoft purchased the rights to the game in 2014, they introduced the concept of an ‘education edition’ and today, schools and education establishments use it to teach, (though only if teachers are confident to do so)!"
        },
        {
            "text": "In September 2021, I started working directly with Microsoft and colleagues around the world, as well as Block Builders (a not-for-profit company based in Brighton) and schools and teaching staff in England. I designed the “Preston World” which became the game we can play today."
        },
        {
            "text": "We named it ‘RiverCraft’ and created three games within a virtual Preston world which is hosted by Microsoft on their global Climate and Sustainability Minecraft Education site."
        },
        {
            "text": "Game 1: Managing Flood Risk"
        },
        {
            "text": "Game 2: Climate Change and Flooding "
        },
        {
            "text": "Game 3: Environment and Wellbeing "
        },
        {
            "text": "As part of Rivercraft, children (and adults!) get to defend the city of Preston from flooding through the construction of ‘hard’ flood defences (including walls and glass panels) and developing Natural Flood Risk Management techniques. Players will also learn about the all the different types of flooding."
        },
        {
            "text": "Just like in other versions of Minecraft, players can teleport from place to place around the city while spotting some of Preston’s most famous landmarks. The other games allow users to carry out an Environmental Assessment and reduce their own impact on Climate Change."
        },
        {
            "text": " "
        },
        {
            "text": "Excitingly, the work that we have done in Rivercraft now sits alongside work with the WWF and the United Nations!"
        },
        {
            "text": "There are teaching packs with accompany each game and the games themselves are designed around the Year 7 Geography curriculum and are suitable for Key Stages 2 and 3. We have specifically looked to target this age group as we know young people, especially girls, who often drop out of STEM subjects around year 9 and currently only around 12% of the UK engineering workforce is female so whatever we can do to encourage participation in these subjects in early years, the better!"
        },
        {
            "text": "In November 2021, the games concept was presented at COP26 and the games completed a few months later. With our local schools on board, we took over Year 7 for a day at Archbishop Temple School in Preston and delivered live Rivercraft lessons. Students completed online feedback for us, and the results blew me away with pupils proclaiming: “I found the games themselves very realistic and taught me about the changes we need to make in society”."
        },
        {
            "text": "We asked them to try and break the games and really put them to test. Some of the students were able to drown in the River Ribble and fall off rooftops but best of all, one of our future coders was able to hack into the back of the game, import a sword and chop up the Water Voles for lunch… that was certainly an interesting career highlight for me! Needless to say, all of the issue were quickly fixed. The teachers noted that they also needed training on how to play the games, especially after #watervolegate. We will be providing some training in the coming weeks."
        },
        {
            "text": "Rivercraft officially launched on the 5 April and media have covered it extensively. After less than 24 hours it had become the most viewed video on the BBC and had reached as far as Germany, France and Spain."
        },
        {
            "text": "As amazing as the project is it just would not have happened without partners but most importantly, our wider project team. Or as I like to think of them, our ‘heroes of Rivercraft.’"
        },
        {
            "text": "Many of the team who devote their careers to Flood and Coastal Risk Management within Lancashire have been recreated as Minecraft characters within the Preston world.  As you navigate through Rivercraft, they will be on hand to guide you through each game and offer advice. Just like we all do in real life as part of Team EA when we are working for the benefit our local communities."
        },
        {
            "text": "But don’t just take my word for it…try Rivercraft out for yourself and see where your drive, passion and enthusiasm for the environment can take you RiverCraft | Minecraft Education Edition."
        }
    ]
}