{
    "url": "https://veteranstoday.blog.gov.uk/2023/02/24/5million-funding-for-cutting-edge-veteran-healthcare-projects/",
    "title": "£5million funding for cutting-edge veteran healthcare projects",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Armed Forces",
        "Veterans",
        "Veterans Support",
        "Veterans Today",
        "Veterans Welfare and Support"
    ],
    "pub_date": "2023-02-24T14:18:03+00:00",
    "content": [
        {
            "text": "Projects across the nation have won a share of more than £5million in funding to save and enhance lives for veterans."
        },
        {
            "text": "The 22 innovative healthcare schemes will bring advancements in technologies, interventions and treatments to better meet veterans’ physical and mental health needs."
        },
        {
            "text": "Financial support has been achieved from the Veterans’ Health Innovation Fund through a competition run by the Office for Veterans’ Affairs with the Defence and Security Accelerator (DASA)."
        },
        {
            "text": "Proposals submitted addressed the challenge areas of digital, data and technology, surgical technology, bioengineering and rehabilitation with blast injuries and public health, pain management, hearing loss and visual impairment."
        },
        {
            "text": "Initiatives to help identify and/or provide solutions to disparities in female veterans’ health and healthcare were also submitted."
        },
        {
            "text": "The winners awarded funding to fast-track their innovative solutions are:"
        },
        {
            "text": "Blesma: The Limbless Veterans Charity"
        },
        {
            "text": "This project aims to explore the lived experience of injured veterans who are wheelchair and electronic powered vehicle users, and to provide a comparison of the effectiveness of selected categories of assistive technologies."
        },
        {
            "text": "Imperial College London (x4)"
        },
        {
            "text": "Four separate, yet complementary projects looking at further research to improve prosthetics for amputee veterans."
        },
        {
            "text": "Imperial College London and Anglia Ruskin University"
        },
        {
            "text": "This project aims to evaluate the Veterans Trauma Network (an NHS England treatment pathway for veterans with physical health needs), with a view to supporting its future growth and development."
        },
        {
            "text": "Umio"
        },
        {
            "text": "This project aims to develop veteran chronic pain peer-support and self-learning/management platform, to help veterans to live better and well with long-term pain."
        },
        {
            "text": "NuTissu ltd"
        },
        {
            "text": "This project aims to develop E-Plasters that can be wirelessly, intuitively activated with a patient’s smart phone or a laptop, to enable the self-management of rapid and complete wound healing."
        },
        {
            "text": "University of Birmingham"
        },
        {
            "text": "This project aims to evaluate blood biomarkers against visual and clinical assessments from veterans who have suffered traumatic brain injury to help develop an algorithm to predict prognosis in veterans."
        },
        {
            "text": "Forward Assist"
        },
        {
            "text": "This project aims to look at and develop a clear understanding of the multiple and complex issues faced by military veterans with lived experience of sexual assault, and identify gaps in service provision."
        },
        {
            "text": "Cardiff University"
        },
        {
            "text": "This project aims to develop online military-focused cognitive behavioural therapy to support veterans with PTSD."
        },
        {
            "text": "Radii Devices Ltd"
        },
        {
            "text": "This project aims to improve residual limb management and rehabilitation through user-reported data, via a digital application"
        },
        {
            "text": "King’s College London and Combat Stress"
        },
        {
            "text": "This project aims to develop a digital application so it can better support female veterans with problem drinking."
        },
        {
            "text": "St John and Red Cross Defence Medical Welfare Service, NHS Lanarkshire and the University of the West of Scotland"
        },
        {
            "text": "This project aims to bring together welfare support and technology to benefit isolated veterans in Lanarkshire in collaboration with Technology Enabled Care."
        },
        {
            "text": "Anglia Ruskin University, Leeds Beckett University, The King’s Centre for Military Health Research, the Veterans’ Trauma Network and Defence Medical Welfare Services"
        },
        {
            "text": "This project aims to co-design recommendations for improving service delivery and care pathways for female veterans’ physical health."
        },
        {
            "text": "University of Exeter and IonaMind"
        },
        {
            "text": "This project aims to develop and evaluate an artificial intelligence-supported intervention to treat depression and anxiety in female veterans."
        },
        {
            "text": "Bravo Victor working with Esme’s Umbrella and Moorfields Eye Hospital"
        },
        {
            "text": "This project aims to improve our understanding of visual hallucinations in military veterans through a programme of research on prevalence, phenomenology, practice patterns, and a novel therapeutic intervention."
        },
        {
            "text": "University of Leicester"
        },
        {
            "text": "This project aims to develop an online test of executive dysfunctions as a marker of PTSD in UK service veterans, to enable fast, economical and accurate diagnosis of PTSD and improve the sensitivity of diagnosis and evaluation of clinical treatments."
        },
        {
            "text": "Swansea University"
        },
        {
            "text": "This project aims to evaluate the efficacy and cost-effectiveness of a smartphone-based app to reduce harmful gambling and PTSD symptoms among veterans."
        },
        {
            "text": "Imperial College London and Northumbria University"
        },
        {
            "text": "This project aims to create a comprehensive evidence base for the physical health needs of the veteran community."
        },
        {
            "text": "Northumbria University"
        },
        {
            "text": "This project aims to assess the impacts of, and risks associated with, military service on brain health in female veteran"
        },
        {
            "text": "Imperial College London to the ADVANCE study, the Defence Medical Rehabilitation Centre, Welcome Trust and Defence Medical Services"
        },
        {
            "text": "This project aims to investigate the characteristics of combat injury, and key medical and surgical interventions to evaluate whether these have a beneficial effect on the long-term outcomes in UK veterans."
        },
        {
            "text": "Minister for Veterans’ Affairs Johnny Mercer (pictured at NuTissu) said: ‘I’m delighted that we’re providing funding to these projects. Utilising the latest developments in research and clinical care, these initiatives will spur innovation and new techniques to treat veterans - both with physical and mental health conditions - who have been injured in the line of duty.’"
        },
        {
            "text": " "
        }
    ]
}