{
    "url": "https://aphascience.blog.gov.uk/2023/02/24/avian-science-day-2022/",
    "title": "APHA hosts conference on poultry health",
    "authors": [
        "Zoe Treharne"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2023-02-24T11:49:48+00:00",
    "content": [
        {
            "text": "Zoe Treharne, APHA's Avian Species Expert Group Lead, talks about our first face-to-face annual Avian Science Day event held in three years. Learn more about the event and how to register your interest in attending future events."
        },
        {
            "text": "On Wednesday 12 October of last year, I was proud to present APHA’s ninth annual Avian Science Day. Although an annual event, the last Avian Science Day was held in 2019, with subsequent events cancelled due to COVID-19. Our desire to have a face-to-face conference led to this year’s conference being held in Birmingham and the meeting was ‘blended’ with the option to participate using Microsoft Teams."
        },
        {
            "text": "The day was well attended with approximately 53 in-person delegates and 80 online from industry, academia, and government. The blended approach had its benefits as it allowed people to join online if their plans changed, as was the case for one speaker."
        },
        {
            "heading": 3,
            "text": "Endemic virology"
        },
        {
            "text": "Marco Falchieri is the veterinary lead for avian virology at APHA Weybridge and gave a brief introduction into the capabilities of the avian virology department and the work that he carries out. He started at APHA mid-2022 and part of his time is dedicated to avian endemic viral disease. Marco previously completed a PhD on avian respiratory viruses with the University of Liverpool and is well placed to help develop our capabilities in this area."
        },
        {
            "heading": 3,
            "text": "Infectious Bronchitis in the Netherlands"
        },
        {
            "text": "Robert Jan Molenaar, from the Animal Health Services in the Netherlands, presented his work on a strain of Infectious Bronchitis virus that has been detected in the Netherlands."
        },
        {
            "text": "It was very interesting to hear about the work the Animal Health Services have done to characterise the virus, identifying the pathogenesis (the process of disease development) and clinical signs associated with infection."
        },
        {
            "heading": 3,
            "text": "Salmonella Infantis"
        },
        {
            "text": "Francesca Martelli gave a good overview of Salmonella Infantis (S. Infantis) and why it is important to stop it entering our production systems. Francesca detailed work done to clean and disinfect a broiler farm where S. Infantis was detected."
        },
        {
            "text": "Of particular interest were her take-home findings which included the importance of thorough cleaning and disinfection of outside spaces, where S. Infantis can persist."
        },
        {
            "heading": 3,
            "text": "Using technology to detect disease in hens"
        },
        {
            "text": "Hyungwook Kang, a second year PhD student gave a presentation detailing the initial findings of his research. His PhD is looking at the use of technology to detect disease in hens. Specifically, part of his PhD project is looking at whether technology can detect changes in behaviour patterns which would correlate with illness, such as reduced movement."
        },
        {
            "text": "It will be interesting to see the practical applications from his work in future."
        },
        {
            "heading": 3,
            "text": "Avian Influenza"
        },
        {
            "text": "Ian Brown is APHA’s Director of Scientific Services, and the Director of World Organisation for Animal Health (WOAH)/Food and Agriculture Organization of the United Nations (FAO) International Reference Laboratory for Avian Influenza and Newcastle Disease."
        },
        {
            "text": "Ian gave a good introduction on the current avian influenza outbreak and detailed some of the ways that APHA has worked during the outbreak to improve processes. Ian was also able to share some preliminary data from unpublished studies looking at transmission of the current highly pathogenic H5N1 strain of avian influenza between different avian species."
        },
        {
            "text": "It was very interesting to learn the research being conducted into the current strain and I look forward to the publication of the findings."
        },
        {
            "heading": 3,
            "text": "Enterococcus caecorum"
        },
        {
            "text": "Alex Shock is the senior avian pathologist and team leader at APHA Lasswade. Alex was unable to join us in person and so gave her presentation via Microsoft Teams. She gave some updates on a project to improve our understanding of Enterococcus caecorum, a bacterium causing disease in broiler chickens."
        },
        {
            "text": "The project, which is part funded by a grant from the Biotechnology and Biological Sciences Research Council (BBSRC), has the following aims: to characterise the bacteria with whole genome sequencing; to understand transmission and persistence; and to identify any behavioural changes linked to infection."
        },
        {
            "text": "The project initially has funding for a year, with the potential for further work as part of a PhD project. The Avian Expert Group welcomes information on any new cases."
        },
        {
            "heading": 3,
            "text": "Expanding surveillance in poultry"
        },
        {
            "text": "David Welchman was the veterinary lead to the Avian Expert Group until his retirement in May 2022. David gave a presentation detailing the work he led, prior to his retirement, on expanding surveillance in the poultry sector. This work centres around obtaining useful surveillance data from private poultry practitioners."
        },
        {
            "text": "The hope is that in the future we will be able to use this data to identify quantifiable changes in endemic disease, allowing interventions to be carried out sooner by poultry owners and vets for the betterment of poultry health and welfare."
        },
        {
            "text": "Much work is still to be done on this project which I am now leading within APHA, and I hope to be able to assist the poultry industry as part of this endeavour."
        },
        {
            "text": "I thoroughly enjoyed planning and hosting the event, and it was wonderful to see some of the work that has been done to understand, diagnose and prevent disease in poultry and gamebirds. I wish to thank everyone involved in the day and to those that attended and have welcomed me into my current role."
        },
        {
            "text": "If you’re interested in these topics and would like to attend future Avian Science Day events, please email APHA events."
        },
        {
            "heading": 3,
            "text": "Find out more about avian surveillance"
        },
        {
            "text": "You can find out more about current disease trends in poultry by reading the most recent avian disease surveillance and emerging threats quarterly report. Reports are also available for cattle, small ruminants, pigs, miscellaneous and exotic species and wildlife on GOV.UK."
        },
        {
            "text": "There is also a dedicated web page for avian scanning surveillance. This includes links to an interactive dashboard for disease issues in small and backyard poultry flocks."
        },
        {
            "heading": 3,
            "text": "Subscribe to our science blog"
        },
        {
            "text": "Throughout the year, we publish blogs which highlight the breadth of scientific work we are involved in as well as sharing our latest news and events we have attended."
        },
        {
            "text": "Subscribing to our blog takes seconds and you will receive instant email alerts as soon as new blogs are published so why not subscribe today!"
        },
        {
            "text": " "
        }
    ]
}