{
    "url": "https://dwpdigital.blog.gov.uk/2023/02/24/celebrating-lgbt-history-month/",
    "title": "Celebrating LGBT+ History Month",
    "authors": [
        "Joe Tetley, IT Service Manager"
    ],
    "categories": [
        "Diversity",
        "LGBT*",
        "Service Manager"
    ],
    "pub_date": "2023-02-24T16:50:15+00:00",
    "content": [
        {
            "text": "Joe Tetley, IT Service Manager, DWP Digital"
        },
        {
            "text": "Embracing our history helps us all understand our past. Unless you know where you come from, it’s very difficult to plan where you’re going. As an openly gay man working in DWP Digital, I feel the history of the LGBT+ community is important.  "
        },
        {
            "text": "So much of our history hasn’t been documented or recorded in any way, and there’s a real danger that we repeat the same mistakes, and people won’t learn fully from what’s happened in the past. "
        },
        {
            "heading": 2,
            "text": "Celebrating LGBT+ History Month "
        },
        {
            "text": "I celebrate LGBT+ History Month by trying to make sure my friends and people in my networks are aware of things that have previously happened in our history – and where we have come from. "
        },
        {
            "text": "The Stonewall riots were a pivotal moment in LGBT+ history, and happened at the end of the 60s, following on from the US civil rights movement. "
        },
        {
            "text": "Bayard Rustin spent his life fighting for people's rights and was instrumental in organising the March on Washington for jobs and freedom. This is where Martin Luther King Jr delivered his rousing ‘I have a dream’ speech.  "
        },
        {
            "text": "Into the 1980s, Rustin spoke at gay rights events and was posthumously awarded the Presidential Medal of Freedom in 2013 by Barack Obama. Not a lot of people know about Rustin and his contribution to history. It’s important we remember him and other historical members of our LGBT+ community, the discrimination they faced and all they have given us. "
        },
        {
            "heading": 2,
            "text": "Being inclusive at work "
        },
        {
            "text": "An inclusive work environment is important, as it allows me the creative freedom to work to the best of my ability. In society there are still a lot of areas where I feel restricted and don’t feel I can be my true self with my partner. For example, if we’re out in the pub or at a restaurant. "
        },
        {
            "text": "When it comes to work, I just want to be able to perform at my best, and I don’t want to worry about unnecessary things related to my sexuality. "
        },
        {
            "text": "At work, people can do simple things like adding pronouns to their signatures, and supporting colleagues to be themselves, so that everyone feels included whether they’re LGBT+ or not. Where you’re in a position of privilege, you can be an ally and support those around you. "
        },
        {
            "heading": 2,
            "text": "My LGBT+ hero "
        },
        {
            "text": "My LGBT+ hero isn’t anyone famous. It’s my friend George. He’s older than me and he reminds me that there’s a lot of LGBT+ people from his generation who aren’t still here with us.  "
        },
        {
            "text": "This is a sad part of our history that’s often never spoken about. But in recent years, programmes such as ‘It’s a Sin’ have shone a light on what it was like for people as recently as 30 years ago. George is very outspoken and fought for rights and injustice over the years. He’s been in a loving relationship for over twenty years, which is something to be greatly admired. "
        },
        {
            "text": "Be proud. "
        },
        {
            "text": "To finish, I’d like to share the end of a poem I wrote called ‘Ghosts’. "
        },
        {
            "text": "But History’s less kind, "
        },
        {
            "text": "And if I don’t write it down, "
        },
        {
            "text": "There’ll be people who say, "
        },
        {
            "text": "That my memory’s not sound. "
        },
        {
            "text": "The young will forget,  "
        },
        {
            "text": "All the trouble there’s been, "
        },
        {
            "text": "And our dispose of our recounts  "
        },
        {
            "text": "Just like a bad dream. "
        },
        {
            "text": "So never forget, "
        },
        {
            "text": "The battles we’ve witnessed, "
        },
        {
            "text": "The people we’ve lost, "
        },
        {
            "text": "And their unwritten histories. "
        },
        {
            "text": "Because time heals nothing, "
        },
        {
            "text": "When society has forgot "
        },
        {
            "text": "What the people who had much "
        },
        {
            "text": "Did to those who had not. "
        }
    ]
}