{
    "url": "https://marinedevelopments.blog.gov.uk/2023/02/24/habit-focus-the-importance-of-rocky-and-biogenic-reefs/",
    "title": "Habit focus – the importance of rocky and biogenic reefs",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2023-02-24T12:36:26+00:00",
    "content": [
        {
            "text": "Why do reefs need protection?"
        },
        {
            "text": "Most people are unaware of the many vitally important habitats which lie offshore beneath the surface of English coastal waters. Rocky and biogenic reefs are two of these important habitats, which need our consideration and may require protection."
        },
        {
            "text": "That’s why we’re enthusiastic to share more information about the types of reef found in English waters. We also need your input to help ensure suitable protection is in place for the future."
        },
        {
            "text": "What are rocky and biogenic reefs? "
        },
        {
            "text": "Rocky reefs are subtidal habitats created by outcrops of rock located within the part of the seabed always covered by water. They provide important hard surfaces for a variety of interesting animals to attach to. This includes spectacular pink sea-fans and communities of sponges. Rocky reefs also provide shelter for an array of animals, including commercially valuable fish, lobsters and crabs."
        },
        {
            "text": "Biogenic reefs are physical structures formed by animals. In the UK, examples include reefs formed by Ross worms, blue mussels, honeycomb worms and cold-water corals. Ross worms and honeycomb worms can build networks of tubes that stabilise the seafloor and create complex habitats. Biogenic reefs can support a variety of life, including sponges, fish, lobsters and crabs."
        },
        {
            "text": "Both rocky and biogenic reefs have been identified within our marine protected areas (MPAs) and so it is important that we consider impacts of activities, such as fishing, on these habitats. Reefs support the wider food chain and with the right protection in place, overflow of benefits from MPAs have the potential to support commercial fish stocks across much larger areas. Reefs also provide opportunities for activities such as SCUBA diving and recreational angling. This supports marine businesses all around the country."
        },
        {
            "text": "How your input can help"
        },
        {
            "text": "Reef habitats are vulnerable to damage from bottom towed fishing. As part of our work managing England’s offshore MPAs, we need you to share your views on a proposed byelaw to manage bottom towed fishing in 13 MPAs. This byelaw aims to protect rocky and biogenic reefs."
        },
        {
            "text": "We also encourage you to submit additional evidence and share your views on our fishing gear MPA impacts evidence documents which we have shared in our current call for evidence. These documents collate best available evidence on fishing gear impacts on a range of seabed habitats and species, including rocky and biogenic reef."
        },
        {
            "text": "We need your help and participation. Both our formal consultation on the proposed byelaw to manage bottom towed fishing in 13 MPAs and call for evidence will close on 28 March 2023. So don’t miss this chance to have your say and take part!"
        },
        {
            "text": " "
        }
    ]
}