{
    "url": "https://securityprofession.blog.gov.uk/2023/02/24/how-to-be-an-lgbtq-ally-all-year-round/",
    "title": "How to be an LGBTQ+ ally all year round",
    "authors": [
        "Angela Fisher",
        "Birju Sonigra"
    ],
    "categories": [
        "Government Security",
        "Security and Diversity"
    ],
    "pub_date": "2023-02-24T16:27:52+00:00",
    "content": [
        {
            "text": "As LGBT+ History Month 2023 draws to a close on Tuesday 28 February, we spoke to Mike, a Senior Investigator for the National Crime Agency (NCA) about what we can do to keep that awareness alive throughout the year. Mike is the Membership and Communications Secretary within EMBRACE, the NCA’s LBGT+ network."
        },
        {
            "text": "Headline events which happen throughout the year are a great time to remind ourselves of why allies are needed, to celebrate the diverse LGBT+ community, and emphasise why the community needs to stay vocal - but it shouldn't be the sole focus of the conversation around the community."
        },
        {
            "heading": 3,
            "text": "What does a good ally look like? What sort of qualities do you think they need to bring with them so that you feel comfortable in the workplace?"
        },
        {
            "text": "Mike's view is very much this: you don't necessarily need to do too much to be an incredible ally. Being a strong ally can just simply be listening to your colleagues, learning about them and the communities they come from. That's not just in the LGBT+ community either, that's generally across the board in the whole spectrum of diversity that makes up our profession and the wider Civil Service."
        },
        {
            "text": "It is important to understand where your colleagues come from. What does their lived experience look like? And how does that affect the way that they work? What positives can it bring to the workplace? But also what are the unique challenges they may be facing and how might this also affect their work? Just listening and engaging with that and just showing that open mindedness is a step in the right direction to being an ally."
        },
        {
            "heading": 3,
            "text": "Microaggressions"
        },
        {
            "text": "A microaggression, as defined in the Oxford Dictionary, is “a statement, action or incident regarded as an instance of indirect, subtle or unintentional discrimination against members of a marginalised group such as a racial or ethnic minority”."
        },
        {
            "text": "Sadly these do still exist in the workplace. Mike could name countless times even in the last few months where having a heterosexual relationship is still considered the norm and he  met new people at work who asked “oh so, do you have a girlfriend/a wife.” Even when he uses gender neutral terms like ‘my partner’, people will ask him “what does she do?”, “is she in the job?” and “how long have you known her for?”."
        },
        {
            "text": "There are scenarios where it is known Mike has a male partner, and he has been asked “who is the man and who is the woman in the relationship” – a stereotypical question frequently asked of same sex couples. He says that he genuinely does not feel like any of these questions have been asked maliciously, but they do represent the need to have a systematic change in inclusivity in the way we engage with our colleagues."
        },
        {
            "text": "Mike says this is something that is also reflected outside of the workplaces as well, a general challenge faced by the LGBT+ community around the feeling of having to check yourself as they go about their daily life. Consider this; when you greet your partner outside of work, if you're in heterosexual relationship, how do you do this? Do you use the affection you greet them - hold their hand, kiss them, for example? This isn’t a freedom that homosexual couples necessarily experience."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Visible support at a senior level"
        },
        {
            "text": "A lot of our diverse communities have different points in the year where things are celebrated, whether that's faith around a religious holiday, history or reflective months. Whilst that can be used as an opportunity to really show that a senior leader and the senior leadership team are really behind the community – this needs to leak out over the rest of the year."
        },
        {
            "text": "Have you got the right staff networks? and are they very visible and active? Are you active with them?"
        },
        {
            "heading": 3,
            "text": "What might you say to someone who wants to be an ally but doesn’t feel like it's their space to do so?"
        },
        {
            "text": "It’s everyone’s space to do so. Some of the best allies that I’ve had in my career are those who are cisgender and heterosexual, but they're willing to advocate for LGBT+ people and step up and challenge homophobia, biphobia, transphobia when it's happening."
        },
        {
            "text": "Mike says if you had watched someone use the incorrect pronoun towards someone, there's ways to challenge that without making it uncomfortable for the person that's impacted, or confrontational towards the person who you’re challenging. He'd always advocate that if you want to step up, but you don't necessarily feel like you could do it in the public forum, speak to the parties in private."
        },
        {
            "text": "Focus on the person affected -  start that conversation by approaching the person in a safe space and saying “Look I watched this happen and I wanted to step up, but I didn't feel like I necessarily could have done so. If this situation happens again, how would you like me to address it?”. That way you’re able to be proactive should it happen again, but also not taking all of the control out of that situation for the member of the community."
        },
        {
            "heading": 3,
            "text": "What do you think your colleagues and your managers can do, make you feel make you and others feel more supported, and more included?"
        },
        {
            "heading": 3,
            "text": "Don’t be afraid to ask but also don't take it personally if someone doesn't want to share with you."
        },
        {
            "text": "Some years ago, whilst working in a public protection investigation team, there was a case that involved offending involving those of the same sex. The Detective Inspector (DI) of the case wanted to ask Mike about elements of the case which centred around gay culture/gay relationships."
        },
        {
            "text": "Mike says sexuality isn’t a massive part of his personality, but it is a part of him that's unique and he can bring this to work. He is grateful to the DI that she quietly and privately asked if he would be comfortable talking about it and he felt confident that he could safely refuse to talk about it if he wanted."
        },
        {
            "heading": 3,
            "text": "Where can people go to learn more?"
        },
        {
            "text": "GALOP is a support service for LGBT+ people who have/are experiencing abuse in all forms. They recently launched the first LGBT+ helpline, contactable on 0800 999 5428. More can be found at http://www.galop.org.uk/get-help/."
        },
        {
            "text": "Switchboard is an LGBT+ helpline provides a safe space for anyone to discuss anything, including sexuality, gender identity, sexual health and emotional wellbeing. They can be contacted on 0300 330 0630. More can be found at https://switchboard.lgbt/."
        },
        {
            "text": "LGBT+ networks are a fantastic resource for entire workforces at whatever grade you are. If you're practitioner/supervisor level they're great places to network with other members of the community and show that strong allyship, but also gain invaluable experience and knowledge from committees. Often LGBT+ networks will have access to masses of resources and knowledge, especially around transitioning in the workplace or supporting people who are coming out."
        },
        {
            "text": "Similarly, you have the voluntary sector – of note Stonewall and Employers Network for Equality and Inclusion (ENEI), all have really great pools of information. This can help with that personal responsibility to go away and learn a bit more about that so that you can understand the challenges."
        },
        {
            "text": " "
        },
        {
            "text": "We’d like to offer our immense thanks to Mike for sharing his experience, and we hope it has been useful to our readers."
        }
    ]
}