{
    "url": "https://educationhub.blog.gov.uk/2023/02/24/school-attendance-important-risks-missing-day/",
    "title": "Why is school attendance so important and what are the risks of missing a day?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "school absence",
        "Schools"
    ],
    "pub_date": "2023-02-24T11:49:30+00:00",
    "content": [
        {
            "text": "Being around teachers and friends in a school or college environment is the best way for pupils to learn and reach their potential. Time in school also keeps children safe and provides access to extra-curricular opportunities and pastoral care.  "
        },
        {
            "text": "That’s why school attendance is so important and why the Government is committed to tackling the issues that might cause some children to miss school unnecessarily.  "
        },
        {
            "text": "Here’s what you need to know about school attendance. "
        },
        {
            "heading": 3,
            "text": "Why is school attendance so important and what are the risks of missing a day?  "
        },
        {
            "text": "Being around teachers and friends in a school or college environment is the best way for pupils to learn and reach their potential. Time in school also keeps children safe and provides access to extra-curricular opportunities and pastoral care.  "
        },
        {
            "text": "That’s why school attendance is so important and why the Government is committed to tackling the issues that might cause some children to miss school unnecessarily.  "
        },
        {
            "text": "Here’s what you need to know about school attendance. "
        },
        {
            "heading": 3,
            "text": "What does the data tell us about school attendance? "
        },
        {
            "text": "The attendance rate across all schools in England was 92.6% in the week commencing 6th February 2023, up from the Autumn term average of 92.1%.  "
        },
        {
            "text": "National teachers’ strikes that took place on 1st February 2023 had a negative effect on attendance rates. On this day, attendance dropped to 43%, despite 90% of schools remaining open in some capacity.  "
        },
        {
            "text": "The latest data also shows the proportion of students who were persistently absent (those who missed 10% or more of their possible sessions). Across the year to date, 23.4% of students were persistently absent – this was driven by high rates of illness towards the end of the Autumn term. "
        },
        {
            "heading": 3,
            "text": "How does attendance affect outcomes for pupils?  "
        },
        {
            "text": "Being in school is important to your child’s achievement, wellbeing, and wider development. Evidence shows that the students with the highest attendance throughout their time in school gain the best GCSE and A Level results. "
        },
        {
            "text": "Our research found that pupils who performed better both at the end of primary and secondary school missed fewer days than those who didn’t perform as well.  "
        },
        {
            "text": "The data also shows that in 2019, primary school children in Key Stage 2 who didn’t achieve the expected standard in reading, writing and maths missed on average four more days per school year than those whose performance exceeded the expected standard.  "
        },
        {
            "text": "Similarly, in the same year, secondary school pupils who didn’t achieve grade 9 to 4 in English and maths missed on 10 more days on average over the key stage than those who achieved grade 9 to 5 in both English and maths.  "
        },
        {
            "heading": 3,
            "text": "What are the risks of missing a day of school?  "
        },
        {
            "text": "Every moment in school counts, and days missed add up quickly. For example, a child in Year 10 who is absent for three days over a half term could miss 15 lessons in total.  "
        },
        {
            "text": "The higher a pupil’s attendance, the more they are likely to learn, and the better they are likely to perform in exams and formal assessments.  "
        },
        {
            "text": "Data from 2019 shows that 84% of Key Stage 2 pupils who had 100% attendance achieved the expected standard, compared to 40% of pupils who were persistently absent across the key stage. "
        },
        {
            "heading": 3,
            "text": "What if my child needs to miss school? "
        },
        {
            "text": "Parents and carers have a legal duty to ensure your child gets a full time-education. Usually, that means going into school from the age of 5 to 16. "
        },
        {
            "text": "There are only a small number of circumstances where missing a school day is permitted. Your child must attend every day that the school is open, unless: "
        },
        {
            "text": "These are the only circumstances where schools can permit your child to be absent. "
        },
        {
            "heading": 3,
            "text": "What counts as an exceptional circumstance? "
        },
        {
            "text": "School leaders are responsible for deciding what counts as an exceptional circumstance when it comes to a child missing school.   "
        },
        {
            "text": "They should look at each application individually, considering the specific facts and background context. If a leave of absence is granted, the school will decide how long the pupil can be away from school. "
        },
        {
            "text": "Holidays are very rarely an acceptable reason for a school absence and are unlikely to be treated as an exceptional circumstance.  "
        },
        {
            "heading": 3,
            "text": "What are you doing to improve school attendance? "
        },
        {
            "text": "We've published new guidance on how schools, trusts and local authorities should work together to provide better whole-family support to tackle the reasons for absence. "
        },
        {
            "text": "As of September 2022, schools, academy trusts, local authorities and the government now have access to a data visualisation tool to make it easier for teachers to analyse attendance,  spot issues and intervene more quickly.  "
        },
        {
            "text": "We've also established an alliance of national leaders from education, children’s social care and related services to work together to raise school attendance and reduce persistent absence. "
        },
        {
            "text": "This year we launched a 1-2-1 mentoring pilot in Middlesbrough aimed at tackling the factors behind non-attendance. The pilot will expand to provide tailored support to over 1,600 persistently and severely absent pupils over a three-year period. "
        },
        {
            "heading": 3,
            "text": "Where can I get support to help my child attend school? "
        },
        {
            "text": "If your child is struggling to go to school, both their school and your local authority have a responsibility to help you to support your child’s attendance. "
        },
        {
            "text": "In most cases, if your child’s attendance level is falling, their school will contact you to explore the reasons and discuss what help can be put in place. You can expect the school to meet with you and your child if they are old enough.   "
        },
        {
            "text": "If the barriers to your child’s attendance are in school, the school is responsible for working with you to help overcome the issues. Information on who in school you can contact for help, including the school’s senior leader responsible for attendance, can be found in the school’s policy on its website or available in hard copy from the school itself. "
        },
        {
            "text": "If the barriers to attendance you or your child are facing go beyond the remit of the school, both the school and local authority have a responsibility to help you. This includes helping you to access the wider support you might need, for example from the school nurse or from local housing or transport teams. "
        },
        {
            "text": "Further guidance on how to help your child to attend school is available here. "
        }
    ]
}