{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/01/23/citizenship-community-equality-and-liberty/",
    "title": "Citizenship: community, equality and liberty",
    "authors": [
        "Simon Duffy",
        "Lyn Romeo"
    ],
    "categories": [
        "Learning disabilities",
        "Our profession",
        "Personalisation",
        "Safeguarding",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2024-01-23T14:19:55+00:00",
    "content": [
        {
            "heading": 2,
            "text": "No justice without equality"
        },
        {
            "text": "Laura Jane Addams, a disabled woman and a founder of the social work movement, wrote:"
        },
        {
            "text": "This vision has inspired the best achievements of the social work profession: deinstitutionalisation, a commitment to tackle systemic injustice and the ongoing work to help people establish their place in the life of the community. Too many forces outside our control can stymie these efforts, but social work remains a profession defined by its commitment to social justice."
        },
        {
            "text": "Social justice demands we treat each other as equals. This starts with seeing each other as citizens, each with diverse gifts and needs and bringing something special to the community."
        },
        {
            "text": "Equal citizenship offers us the respect and dignity at the heart of human rights. But it is also by acting as citizens that we can come together to tackle the extreme problems the world faces today. Citizenship is not simply the goal of social justice, it is the means for achieving that goal."
        },
        {
            "text": "That’s why I and Wendy Perez, a friend and colleague with learning disabilities, wrote Everyday Citizenship, a radically revised and accessible version of Keys to Citizenship (2003). 'Keys...' is my most widely cited publication but, as Wendy told me:"
        },
        {
            "heading": 2,
            "text": "Bring sexuality back"
        },
        {
            "text": "Wendy also pointed out what was missing:"
        },
        {
            "text": "Wendy appreciated that 'Keys...' showed how people could be equal citizens enjoying the same rights and making the same contributions. So, we worked together to create a new (and hopefully better) book that describes citizenship from the perspective of people with learning disabilities. It also has wonderful illustrations by our Spanish colleague, Ester Ortega, and editorial guidance from the talented Clare Tarling, an expert in Easy Read."
        },
        {
            "text": "But while more accessible, I hope the book remains interesting and challenging. Citizenship is a way of describing how can be both equal and different. Citizenship also demands we share the practical work of equipping each other with the stuff of citizenship. Some of these things may be obvious – help, money, home, community – but there are other things that may seem more difficult."
        },
        {
            "heading": 2,
            "text": "Being open and finding meaning"
        },
        {
            "text": "Freedom is an essential right that demands creativity and clarity to make real. Freedom is social; it begins when we listen to each other. This means that some people need communication systems while others need systems of support and decision-making to liberate their agency. Social workers need to offer practical support to make sure people can express how they want to shape their lives."
        },
        {
            "text": "We also, as Wendy reminds us, need to be unafraid of discussing sex—and more broadly love, friendship and relationships. We know that love is the fundamental stuff of life, we know that loneliness is a dangerous poison—yet we struggle to accept that strengthening relationships is essential to good social work. It’s often easier to focus on the practical help we organise."
        },
        {
            "text": "At the heart of Everyday Citizenship is the search for meaning. Life without a sense of purpose is difficult. A personal budget or a support package is meaningless unless it enables us to do something that’s meaningful for us, and this is a very personal matter. What is meaningful for me won’t be meaningful for you. This has always been at the heart of that rather over-used word “personalisation”."
        },
        {
            "text": "Everyday Citizenship is a guide for social work, written from the perspective of a woman with learning disabilities. It’s also a guide for life, offering a vision where everyone has life that’s well lived, equal and wonderfully unique. I hope social workers will read and share it with the fellow citizens they support."
        }
    ]
}