{
    "url": "https://dluhcmedia.blog.gov.uk/2024/01/23/financial-times-interview-with-the-chair-of-the-electoral-commission-on-voter-id/",
    "title": "Financial Times interview with the chair of the Electoral Commission on Voter ID",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2024-01-23T12:14:34+00:00",
    "content": [
        {
            "text": "An article in the Financial Times today reports on comments made by the Chair of the Electoral Commission, John Pullinger, that the government’s Voter ID scheme could disenfranchise groups at this year’s general election and that it is ‘more of a barrier’ to some people than others."
        },
        {
            "text": "As recommended by the election watchdog itself since at least 2014, we have introduced identification for voting in person across Great Britain, in line with the longstanding arrangements in Northern Ireland which has had photo identification to vote in elections since 2003."
        },
        {
            "text": "Showing ID to vote is a reasonable approach to combat the inexcusable potential for voter fraud in our current system. The Electoral Commission has previously called for ‘sustained action’ to prevent fraud from taking place."
        },
        {
            "text": "We disagree with the assessment that the ID scheme creates a barrier for some. The vast majority of voters in the polling station - 99.75% - cast their vote successfully at the local elections in England in May, following a number of successful pilots of this process in previous elections."
        },
        {
            "text": "A broad range of ID can be accepted which includes passports (and expired passports), driving licences, Blue Badges, Voter Authority Certificates and a number of other forms of identification. A full list can be found here."
        },
        {
            "text": "Our research shows that 96% of electors already own one of the broad list of accepted photographic identifications, and the free Voter Authority Certificate is available for those who don’t."
        },
        {
            "text": "Following May’s elections, officials undertook a thorough review of the list of accepted forms of identification and could not identify any additions that would succeed in significantly increasing coverage."
        },
        {
            "text": "The Government is continuing to work closely with local authorities and other partners to raise awareness for those who do not, including a widespread public information campaign led by the Electoral Commission."
        },
        {
            "text": "The Government has always been confident in the ability of local authorities to implement the voter identification changes, whilst continuing to deliver our elections robustly and securely."
        }
    ]
}