{
    "url": "https://cddo.blog.gov.uk/2024/01/23/introducing-the-digital-readiness-check-for-government/",
    "title": "Introducing the Digital Readiness Check for government",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "CDDO"
    ],
    "pub_date": "2024-01-23T12:18:31+00:00",
    "content": [
        {
            "text": "As civil servants, we’re all here to implement the government’s policy objectives. Every day, in many different ways, we all play a part in turning policy into outcomes for citizens. And as the pace of technological advance continues to increase, digital and data-driven approaches will become ever more vital in delivering those policy priorities.  "
        },
        {
            "text": "That’s why, for example, we’re focusing on raising our collective data capabilities through One Big Thing. It’s also why the former Minister for the Cabinet Office, Jeremy Quin, spoke of the importance of modernising not just our technology estate, but also our processes, structures and ways of working in government in a speech last year at Policy Exchange. That includes the processes and techniques we use to make policy and legislation, and the ways we work across professional and functional lines to get to the right outcome."
        },
        {
            "text": "The importance of working together"
        },
        {
            "text": "Policymakers and digital specialists have distinct, specialist skills, but we don’t always work as effectively together as we might.  Sometimes earlier collaboration between our disciplines might have made a good idea better, or found a more effective and practical way to achieve an objective."
        },
        {
            "text": "When policy, operational and digital colleagues work together in multidisciplinary teams from an early stage in the process, we achieve great results that deliver objectives in ways that are effective, efficient and user-focused. "
        },
        {
            "text": "The Policy Profession continues to develop and grow, setting standards for excellence and promoting multidisciplinary ways of working. The Government Digital and Data function is doing likewise - for example through our recently relaunched functional standard, our work with the Top 75 government services and our development of Government Digital and Data capability in government. "
        },
        {
            "text": "Introducing the Digital Readiness Check"
        },
        {
            "text": "We all need to work collaboratively to develop digitally-deliverable policy. To support this - working with colleagues across government and drawing on experience from overseas - the Central Digital and Data Office has developed a set of key principles and questions to work through when developing policy or legislation. We’re calling it a Digital Readiness Check."
        },
        {
            "text": "The questions are quite detailed and might not all be relevant to every policymaking situation at the start of the policymaking process. Policymakers might even be fairly confident a policy does not have a digital delivery dimension. But nearly everything we do in government nowadays will involve digital and data at some point - so there are a few key principles we all need to keep at the front of our mind when working up a new policy idea or initiative:"
        },
        {
            "text": "The Central Digital and Data Office, as head of the Government Digital and Data function, is working with colleagues across government to test these principles and highlight examples of good practice in collaborative working. We’ll be writing more on this topic over the coming months. In the meantime, you can find the Digital Readiness Check online, and if you’d like to discuss this topic we’d love to hear from you - please get in touch at digitalfunction@digital.cabinet-office.gov.uk."
        }
    ]
}