{
    "url": "https://insidehmcts.blog.gov.uk/2024/01/23/sharing-an-insight-into-the-work-of-scotlands-immigration-and-asylum-tribunals/",
    "title": "Sharing an insight into the work of our Immigration and Asylum tribunals in Scotland",
    "authors": [
        "Sharon MacArthur, Immigration and Asylum Delivery Manager"
    ],
    "categories": [
        "General",
        "Tribunals"
    ],
    "pub_date": "2024-01-23T13:00:07+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "In September last year we were approached by the law schools of both The University of Glasgow and The University of Edinburgh about the possibility of facilitating visits from their students to observe immigration hearings."
        },
        {
            "text": "Being keen to support students to better understand the work of the First-tier Tribunal (Immigration and Asylum Chamber), and the way in which hearings are conducted, we agreed to assist."
        },
        {
            "text": "We began a fact-finding mission to establish how many students would be involved, the time frame for the visits and the types of hearings they would be most interested in observing."
        },
        {
            "text": "Each university expected around 30 students to attend and to observe at least one hearing.  The University of Edinburgh hoped to have their students complete the observations between October and December. In contrast, The University of Glasgow wished to complete all the visits during one week in November."
        },
        {
            "text": "The co-ordinating professors from both universities advised that asylum and protection hearings would be the most relevant to their course work and they felt that observing these would be of most benefit to their students."
        },
        {
            "text": "Having completed our groundwork, we then provided each university co-ordinator with some additional information in terms of the number of courts we run each day and the maximum number of students we could accommodate in each of our court rooms."
        },
        {
            "text": "We provided a link to the on-line court lists to allow students to check which hearings were running the following day and shared some guidance in terms of how they could identify which of these were asylum and protection cases."
        },
        {
            "text": "Our Resident Immigration Judge was kept updated on the plans and was very supportive of the visits taking place, and our tribunal clerks were also fully briefed on the plans so that they were prepared for the influx of students and could keep the judiciary updated on who would be observing in their courts."
        },
        {
            "text": "Where cases were adjourned or withdrawn on the day, our clerks worked hard to ensure that the students were swapped to another court where an asylum and protection hearing was due to take place."
        },
        {
            "text": "For those that would find it difficult to make the journey to the Glasgow Tribunals Centre to watch the hearings in person, we also provided joining instructions to allow them to join the hearings remotely through Cloud Video Platform (CVP)."
        },
        {
            "text": "All in all, the observations went well, with all students managing to observe at least one hearing."
        },
        {
            "text": "Professor Cowan from The University of Edinburgh, said:"
        },
        {
            "text": "And there was similarly positive feedback from The University of Glasgow's Professor Fletcher:"
        },
        {
            "text": "It was great to receive such positive feedback and we will no doubt be called upon again, when the next group of students reach that stage of their course later in 2024!"
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Rhannu cipolwg ar waith ein tribiwnlysoedd Mewnfudo a Lloches yn yr Alban"
        },
        {
            "text": "Ym mis Medi y llynedd cysylltodd Ysgolion y Gyfraith Prifysgol Glasgow a Phrifysgol Caeredin â ni i holi ynglŷn â'r posibilrwydd o hwyluso ymweliadau gan eu myfyrwyr i arsylwi gwrandawiadau mewnfudo."
        },
        {
            "text": "Gan ein bod yn awyddus i gefnogi myfyrwyr i gael gwell dealltwriaeth o waith y Tribiwnlys Haen Gyntaf (Siambr Mewnfudo a Lloches), a’r ffordd y cynhelir gwrandawiadau, cytunwyd i gynorthwyo."
        },
        {
            "text": "Dechreuon ni ar genhadaeth canfod ffeithiau i sefydlu faint o fyfyrwyr fyddai'n cymryd rhan, yr amserlen ar gyfer yr ymweliadau a'r mathau o wrandawiadau y byddai ganddynt fwyaf o ddiddordeb mewn arsylwi."
        },
        {
            "text": "Roedd pob prifysgol yn disgwyl tua 30 o fyfyrwyr i fynychu ac arsylwi o leiaf un gwrandawiad. Roedd Prifysgol Caeredin yn gobeithio cael eu myfyrwyr i gwblhau'r arsylwadau rhwng Hydref a Rhagfyr. Mewn cyferbyniad, roedd Prifysgol Glasgow yn dymuno cwblhau'r holl ymweliadau yn ystod un wythnos ym mis Tachwedd."
        },
        {
            "text": "Dywedodd yr athrawon a oedd yn cydlynu o'r ddwy brifysgol mai gwrandawiadau lloches ac amddiffyn fyddai'r mwyaf perthnasol i'w gwaith cwrs a theimlent y byddai arsylwi'r rhain o'r budd mwyaf i'w myfyrwyr."
        },
        {
            "text": "Ar ôl cwblhau ein gwaith sylfaen, fe wnaethom wedyn roi rhywfaint o wybodaeth ychwanegol i bob cydlynydd prifysgol o ran nifer y llysoedd rydym yn eu cynnal bob dydd ac uchafswm nifer y myfyrwyr y gallem eu cynnwys ym mhob un o'n hystafelloedd llys."
        },
        {
            "text": "Fe wnaethom ddarparu dolen i restrau’r llysoedd ar-lein i alluogi myfyrwyr i wirio pa wrandawiadau oedd yn cael eu cynnal y diwrnod canlynol a rhannu rhywfaint o gyfarwyddyd o ran sut y gallent adnabod pa rai o’r rhain oedd yn achosion lloches ac amddiffyn."
        },
        {
            "text": "Cafodd ein Barnwr Mewnfudo Preswyl ei ddiweddaru ar y cynlluniau ac roedd yn gefnogol iawn i’r ymweliadau a oedd yn cael eu cynnal, a chafodd ein clercod tribiwnlysoedd hefyd eu briffio’n llawn ar y cynlluniau fel eu bod yn barod ar gyfer y mewnlifiad o fyfyrwyr ac yn gallu rhoi’r wybodaeth ddiweddaraf i’r farnwriaeth ynghylch pwy fyddai’n arsylwi yn eu llysoedd."
        },
        {
            "text": "Pan gafodd achosion eu gohirio neu eu tynnu'n ôl ar y diwrnod, gweithiodd ein clercod yn galed i sicrhau bod y myfyrwyr yn cael eu symud i lys arall lle'r oedd gwrandawiad lloches ac amddiffyn i fod i gael ei gynnal."
        },
        {
            "text": "I'r rhai a fyddai'n ei chael hi'n anodd teithio i Ganolfan Tribiwnlysoedd Glasgow i wylio'r gwrandawiadau wyneb yn wyneb, fe wnaethom hefyd ddarparu cyfarwyddiadau ymuno i'w galluogi i ymuno â'r gwrandawiadau o bell trwy Platfform Fideo’r Cwmwl (CVP)."
        },
        {
            "text": "Ar y cyfan, aeth yr arsylwadau yn dda, gyda phob myfyriwr yn llwyddo i arsylwi o leiaf un gwrandawiad."
        },
        {
            "text": "Dywedodd yr Athro Cowan o Brifysgol Caeredin:"
        },
        {
            "text": "Cafwyd adborth cadarnhaol tebyg hefyd gan yr Athro Fletcher o Brifysgol Glasgow:"
        },
        {
            "text": "Roedd yn wych cael adborth mor gadarnhaol ac mae’n siŵr y byddant yn galw arnom eto, pan fydd y grŵp nesaf o fyfyrwyr yn cyrraedd y cam hwnnw o’u cwrs yn ddiweddarach yn 2024!"
        }
    ]
}