{
    "url": "https://defrafarming.blog.gov.uk/2024/01/23/spotlight-on-new-actions-agroforestry-and-improvements-to-our-trees-and-woodland-offer/",
    "title": "Spotlight on new actions: agroforestry and improvements to our trees and woodland offer",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to plant trees and manage woodland",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-23T13:43:45+00:00",
    "content": [
        {
            "text": "The Agricultural Transition Plan update includes the full range of new and updated Sustainable Farming Incentive (SFI) actions and the payment rates available in 2024.      "
        },
        {
            "text": "In this post, we will focus on the new agroforestry actions. Agroforestry is tree planting that is deliberately combined with food production on the same land. It can: "
        },
        {
            "text": "Through these actions, we want farmers and land managers to consider planting more trees in suitable places and manage more of our woodlands. "
        },
        {
            "text": "In this post, we’ll also include improvements to the Countryside Stewardship (CS) offer for trees and woodlands."
        },
        {
            "heading": 2,
            "text": "New agroforestry actions  "
        },
        {
            "text": "We’re introducing in-field agroforestry actions across various tree densities to encourage more trees in the farmed landscape. "
        },
        {
            "text": "The agroforestry actions are a vital part of our work to meet our ambitious net zero, biodiversity and environmental objectives. "
        },
        {
            "text": "To that end, the actions have been designed to appeal to the widest range of farmers and are applicable on the widest range of land types. "
        },
        {
            "text": "Everyone’s situation is different, so we want to provide as much choice as possible.  "
        },
        {
            "text": "We are introducing new actions to create and maintain in-field agroforestry systems of which there are 2 main types:"
        },
        {
            "text": "The arrangements and densities of trees is flexible to allow you to decide what is best for your circumstances.  "
        },
        {
            "text": "For example, silvoarable tree planting arrangements traditionally use widely spaced rows of trees, but you could use this design equally in a silvopasture setting, especially when managing grass for grazing and silage cutting. "
        },
        {
            "text": "The lower tree density actions enable agroforestry to be carried out on land with low sensitivity to tree planting without requiring Environmental Impact Assessments EIA. For example, land managers who want to do a basic level of tree planting with a small number of trees on the land they farm. "
        },
        {
            "text": "This makes agroforestry accessible to those that want to try this innovative approach and to tenant farmers too. Tenant farmers should check their tenancy agreement before including agroforestry actions in their SFI agreement.  "
        },
        {
            "text": "The higher tree density actions provide for those who want to maximise the benefits from agroforestry planting, including those who are already confident implementing agroforestry practices.  We will release more details on these offers and EIA requirements in due course.  "
        },
        {
            "text": "These new agroforestry actions complement agroforestry offers already available in CS, providing land managers with more flexibility and more ways to integrate trees on their land, including hedgerow, wood pasture and parkland and traditional orchard. "
        },
        {
            "text": "We’re continuing to support woodland creation through the England Woodland Creation Offer (EWCO) which supports, among a wide range of other things, riparian planting. "
        },
        {
            "text": "The full list of agroforestry actions are:"
        },
        {
            "heading": 2,
            "text": "Improvements in our offer for trees and woodland "
        },
        {
            "text": "As well as adding new actions to our environmental land management schemes, we made several improvements to our existing offer for trees and woodland within Countryside Stewardship.  "
        },
        {
            "text": "We are improving the existing woodland management offer by:"
        },
        {
            "text": "We are improving our offer on wood pasture by:"
        },
        {
            "text": "We are improving our species management support to protect trees, woodland habitats and threatened woodland species by:"
        },
        {
            "text": "We will improve our tree health support offer by expanding the tree health support in Countryside Stewardship using learning from the Tree Health Pilot. The current Tree Health Pilot grants will continue until the full, revised tree health scheme launches, ensuring there is no gap in support for land managers and tree owners with tree health issues. "
        },
        {
            "text": "Finally, we are improving public access and engagement with woodlands to benefit public health and wellbeing by adding new actions for permissive access, and expanding the current educational access option so that more people can visit woodlands to learn about woodland management and forestry. "
        },
        {
            "heading": 2,
            "text": "Learn more and apply for SFI"
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the 23 actions currently available. "
        },
        {
            "text": "By waiting for the 2024 actions, you could be losing out on funding. If you apply now, you'll be able to add actions to your agreement annually — or have multiple agreements — if you'd like to carry out further actions. You can view the full list of actions available in the combined SFI and CS offer on GOV.UK.  "
        },
        {
            "heading": 3,
            "text": "Webinar"
        },
        {
            "text": "On 26 January at 10am, we’re hosting a webinar about the farming offer in England with the Farming Advice Service. Register to attend. "
        },
        {
            "heading": 3,
            "text": "Funding for farmers, growers and land managers"
        },
        {
            "text": "The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK.   "
        }
    ]
}