{
    "url": "https://naturalengland.blog.gov.uk/2024/10/16/biodiversity-net-gain-delivering-benefits-for-health/",
    "title": "Biodiversity Net Gain: delivering benefits for health",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Connecting People with Nature",
        "Development",
        "Mental health and wellbeing",
        "Natural Capital",
        "Uncategorized"
    ],
    "pub_date": "2024-10-16T10:45:36+01:00",
    "content": [
        {
            "text": "This Biodiversity Net Gain (BNG) guest blog explores the essential role of nature in promoting overall health. Experts highlight its benefits for mental and physical well-being. They also discuss the broader benefits of integrating BNG into project planning from the outset. They emphasise the value of strategic thinking in delivering successful outcomes for both people and nature. Our contributors include: "
        },
        {
            "text": "By Alexis Percival - Yorkshire Ambulance Service NHS Trust "
        },
        {
            "text": "We in the health system know that biodiversity can help everyone. It benefits our staff, patients and surrounding communities. Biodiversity is vital for mental and physical health. It cleans the air, prevents floods, and cools the environment. We need to avoid building on these green spaces where possible and work to preserve them. In recent years, we found rare orchids and endangered invertebrates on our UK healthcare sites. They show the value of a small oasis in our urban spaces. These green spaces play a vital role in SUDs (sustainable urban drainage). They aid climate adaptation and boost health and well-being. We must, therefore, preserve biodiversity where we can and increase species in those areas. "
        },
        {
            "text": "The NHS, as a whole, has a legal obligation to comply with the Biodiversity Duty. However, this is not a solitary journey. There are opportunities to collaborate with Local Nature Recovery Strategies (LNRS).  We need to create rich, biodiverse spaces within our estate.  Where we must develop, we need to understand BNG’s positive impact on our local environment.  BNG could be critical as we enter a new phase of hospital building development on green spaces within the health system space.   "
        },
        {
            "text": "As we navigate the complexities of BNG, we all must understand its implications. BNG ensures that if a habitat is lost to development, it must be recreated either on-site or if not feasible, nearby, with associated costs. The BNG assessment should be carried out by a qualified ecologist and quantified according to the Statutory Biodiversity Metric. It needs to be beneficial to the environment, multiplied by the value of the lost space and protected for 30 years.  This new space must be protected.  We can develop awareness among staff, estate teams, contractors and the public on the importance of biodiversity and its role in our health system.  We also need the ecological and environmental skills to protect and maintain it. "
        },
        {
            "text": "By Peter Leighton-Jones - Mid Yorkshire Teaching NHS Trust "
        },
        {
            "text": "Biodiversity Net Gain (BNG) is a concept that promotes leaving the natural environment in a better state than before development. Applying BNG principles to hospital design can create healing environments supporting human health and the ecosystem. As large institutions, hospitals often involve significant construction, which can disrupt local ecosystems. However, integrating BNG into these projects can mitigate the environmental impact and enhance patient care.  "
        },
        {
            "text": "Green roofs, native plant gardens, and wildlife corridors are just a few examples of how biodiversity can be preserved or enhanced within hospital grounds. They demonstrate our commitment to responsible development. These elements support local flora and fauna.  They also provide patients and staff access to nature, which has been proven to reduce stress, improve mood, and even accelerate healing. Designing hospitals with BNG in mind goes beyond aesthetics. This could include planting pollinator-friendly gardens to support bees, creating wetlands that manage stormwater, or incorporating natural light and views of greenery into the hospital's design.  "
        },
        {
            "text": "Studies have shown that patients with access to nature experience faster recovery times.  In addition, healthcare staff benefit from reduced burnout and improved well-being. Moreover, BNG initiatives align with broad sustainability goals.  They improve air quality, reduce the urban heat island effect, and promote biodiversity resilience. By integrating nature into hospital design, we can develop spaces that heal both people and the planet, fostering a sustainable future for healthcare. "
        },
        {
            "text": "By Stuart Lane, University Hospitals Dorset NHS Foundation Trust (FT) and Beverley Lagden, Dorset County Hospital NHS FT "
        },
        {
            "text": "Dorset NHS Partners have several building developments in the pipeline. They commissioned training for their Capital Project Managers to ensure the Trusts are fully prepared for the requirement of a minimum 10% biodiversity net gain (BNG).  "
        },
        {
            "text": "The key take-aways from the course include: "
        },
        {
            "text": "A fragmented approach to project development and BNG can limit options and lead to higher project costs. It is better to look at the entire site or estate and create a BNG strategy that allows mitigation efforts to be delivered over a wider area. Due to the specialised nature of BNG evaluation and planning, it is likely that external expertise will be needed to develop a robust plan and provide ongoing support. "
        },
        {
            "text": "Another key finding was that Trust stakeholders had not yet accounted for BNG-related costs in their future development plans. BNG should be assessed early, with appropriate budgets allocated within developments.  Alternatively, they can be mitigated through actions defined in a BNG strategy. Evaluating BNG requirements at an early stage of development can help ensure that valuable natural assets are incorporated into the plans. This can avoid loss of biodiversity and the associated liabilities. "
        },
        {
            "text": "The training highlighted the financial and reputational risks trusts face if they reduce biodiversity value of land, before development.  This applies whether it is done intentionally or not and applies even to areas that may not appear valuable to project planners. As a result, early training for stakeholders is crucial. This training initiative has helped Dorset NHS Partners take a proactive step towards meeting BNG requirements and ensuring that biodiversity remains a priority in their future developments. "
        }
    ]
}