{
    "url": "https://earlyyears.blog.gov.uk/2024/10/16/new-changes-for-childminders-coming-soon/",
    "title": "New changes for childminders coming soon",
    "authors": [
        "Jayne Coward, Deputy Director for Early Years Regulatory Policy and Practice"
    ],
    "categories": [
        "Childminder registration",
        "Early years"
    ],
    "pub_date": "2024-10-16T16:43:06+01:00",
    "content": [
        {
            "text": "In May, we published a blog about the upcoming changes for childminders this autumn.  "
        },
        {
            "text": "The Department for Education is now bringing in these changes on 1 November 2024 to give the early years sector (in particular childminders) more flexibility. These changes will see a new type of childminder introduced and give existing childminders and childcare on domestic premises providers more scope in terms of where they spend their time and base their childcare.  "
        },
        {
            "text": "This last change will allow for existing registered ‘childcare on domestic premises’ providers to continue operating with a minimum of 4 people, as part of a legacy group. But if you are submitting a new registration for this type of provision after 1 November 2024, you will need to have a minimum of 5 people; otherwise, you will need to register as a childminder. If you’re in the process of registering on 1 November, you can continue to apply with 4 or more people. "
        },
        {
            "text": "Childminder without domestic premises "
        },
        {
            "text": "This new category of childminder can only work from non-domestic premises. They will not be able to work from any home at any time, even during pick-up and drop-off time. A domestic premises is any home or place where someone lives. "
        },
        {
            "text": "You can confirm whether your premises is domestic by looking at what local authority council tax rates are paid. An indication that it is non-domestic is if business rates are paid.  "
        },
        {
            "text": "If you want to choose this model, you must register as a childminder without domestic premises, unless you have an exemption from compulsory registration. "
        },
        {
            "text": "What you will need when applying to be a childminder without domestic premises "
        },
        {
            "text": "Childminders without domestic premises will still need to follow the early years foundation stage statutory framework for childminders. This document will be republished nearer the time. We will also soon be publishing guidance on how to apply to provide this new type of childcare. In the meantime, you may want to start thinking about what you will need before you are ready to apply.  "
        },
        {
            "text": "You should consider if: "
        },
        {
            "text": "Applying to add an additional premises to your current registration "
        },
        {
            "text": "You can already apply to add an additional premises to your current registration. If you want to apply now you can operate up to 50% on non-domestic premises.  "
        },
        {
            "text": "On 1 November, the government will remove this limit, but you will still need to spend at least some of your time on domestic premises. It is your decision how you divide your time between settings. You can split your time hourly, daily, weekly or monthly.  "
        },
        {
            "text": "You can find all of the information about this type of flexibility in our guidance. We will update this guidance once the changes come into effect.  "
        },
        {
            "text": "If you have already applied, you will need to let us know if you decide to change the way you divide your time. "
        },
        {
            "text": "Changes to the way childminders can work together  "
        },
        {
            "text": "The government’s planned changes will also mean that more childminders or assistants can work together without needing to register as group provision. "
        },
        {
            "text": "The number of people working together under one single childminder registration will increase from 3 to 4.  "
        },
        {
            "text": "This will also mean that childminders who want to work with 4 or more other adults (5+ in total) will need to register as ‘childcare on domestic premises’. Information about childcare on domestic premises provision can be found in our guidance. For childminders without domestic premises, if you work with 5 or more people in total and wish to continue to work at a non-domestic address, you will need to register as childcare on non-domestic premises. "
        },
        {
            "text": "Find out more "
        },
        {
            "text": "We will soon be publishing guidance about childminders without domestic premises and will tell you about these additional flexibilities across our communication channels. This will help you to decide on the best options available for you.  "
        },
        {
            "text": "If you are already registered and do not want to change the way you are operating, you do not need to do anything at all.  "
        },
        {
            "text": "Childminder agencies will also be offering these options and if you want to consider registering with them, you should contact them directly. The full list of childminder agencies who are accepting applications is available on the GOV.UK website."
        }
    ]
}