{
    "url": "https://gds.blog.gov.uk/2024/10/16/ringing-in-success-with-the-gov-uk-one-login-contact-centre/",
    "title": "Ringing in success with the GOV.UK One Login contact centre",
    "authors": [
        "Stephen Allington - Contact Centre Manager, Government Digital Service"
    ],
    "categories": [
        "GOV.UK One Login"
    ],
    "pub_date": "2024-10-16T09:13:22+01:00",
    "content": [
        {
            "text": "The Government Digital Service (GDS) is on a mission to help the government make brilliant public services for everyone. As part of this, GOV.UK One Login lets users sign in and prove their identity so they can access central government services quickly and easily."
        },
        {
            "text": "More and more, we are seeing everyday services move online, from shopping to banking to food. It can be taken for granted that people automatically understand how to perform these tasks online, even as those tasks grow in complexity. "
        },
        {
            "text": "As government, we need to ensure that as our services move online, we provide support for people who are less confident. Whether it's seeking assistance with an account, resolving an issue, or simply needing guidance, the ability to connect can make all the difference. GOV.UK One Login’s contact centre is marking one year, and has expanded our offer to provide round-the-clock support."
        },
        {
            "text": "Through the contact centre you can:"
        },
        {
            "heading": 2,
            "text": "New services in the GOV.UK One Login contact centre"
        },
        {
            "text": "We've recently introduced two new features to the contact centre: a live web chat, where our agents can interact directly with users, and a 24/7 chatbot, an automated service that quickly and efficiently handles initial user queries. These two services work together to provide a seamless user experience.The web chat has evolved as the programme has grown and the agents are now able to manage multiple chats with users. The chatbot has also increased the number of tasks it can handle at any one time. This enables users to quickly resolve straightforward issues through a chatbot, meaning our agents are able to dedicate their time to more complex issues."
        },
        {
            "heading": 2,
            "text": "Using the right channels"
        },
        {
            "text": "Introducing web chat and the chatbot were decisions that came out of the contact centre’s Right Channel Strategy, aimed at making the service fit the needs of our users. This strategy is underpinned by four principles: "
        },
        {
            "heading": 3,
            "text": "Intelligent Channel Route"
        },
        {
            "text": "An Intelligent Channel Route ensures customer inquiries are directed to the most appropriate channel and agent based on complexity, urgency and availability. For example, in an instance of suspected fraud, a user will be immediately routed to a live agent. However if someone wanted to raise a Freedom of Information (FOI) request, they would be routed to webform as FOIs need to be written to be responded to. "
        },
        {
            "heading": 3,
            "text": "Ability to scale up at busy times"
        },
        {
            "text": "This strategy allows the service to scale up at busier times, such as major deadlines. As the strategy is in motion the contact centre will continuously monitor and measure its performance and tweak the service as it grows. "
        },
        {
            "heading": 3,
            "text": "Enabling self-serve"
        },
        {
            "text": "There has also been a significant amount of work on the self help guidance pages. These pages provide self-help guidance which empowers users to find solutions to their problems independently. Instead of relying solely on customer support or assistance, users can access resources and information to address their needs promptly. "
        },
        {
            "text": "The self-help guidance pages offer a convenient way for users to troubleshoot issues or learn how to use a One Login without needing to contact customer support or navigate through different menus. User research has found that users appreciate the ability to find answers quickly and easily on their own time, without waiting for assistance."
        },
        {
            "heading": 3,
            "text": "Contact centre feedback loop"
        },
        {
            "text": "Users get the opportunity at the end of the call to complete a short customer satisfaction survey. On average, nearly 50% of users complete this which is above standard industry benchmarks. From these surveys the contact centre averaged an 85% satisfaction rating with ‘Agent knowledge’ and ‘Professionalism’ scored at 90% or above. Users state that we resolve their query around 75% of the time at first point of contact. "
        },
        {
            "text": "It is our aim that this user satisfaction score will grow over time and more resources are added. By incorporating customer feedback and usage data, we're able to continuously refine and enhance our service, ensuring it meets users' needs more effectively over time."
        }
    ]
}