{
    "url": "https://marinescience.blog.gov.uk/2024/10/16/the-one-food-programme-at-the-world-one-health-congress-south-africa/",
    "title": "The One Food programme at the World One Health Congress, South Africa",
    "authors": [
        "Julie Bremner"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "Fisheries",
        "International",
        "Seafood Hazards",
        "Uncategorized"
    ],
    "pub_date": "2024-10-16T10:58:50+01:00",
    "content": [
        {
            "text": "Authors: Julie Bremner (Cefas), Grant Stentiford (Cefas), Flavie Vial (APHA), Essa Suleman (CSIR)"
        },
        {
            "text": "The UK government’s Animal and Plant Health Agency (APHA) and Centre for Environment, Fisheries and Aquaculture Science (Cefas) recently attended the 8th World One Health Congress (WOHC)  in South Africa. The Congress took place over four days in the Cape Town International Conference Centre and focussed on how the One Health concept can help tackle the world’s pressing challenges of food safety and security, environmental pollution, human health, climate change, antimicrobial resistance and zoonotic disease. The event provided the opportunity to look at global One Health science and policy from the perspectives of African colleagues."
        },
        {
            "heading": 2,
            "text": "Transforming food systems for healthy people and planet"
        },
        {
            "text": "The APHA and Cefas team joined the congress under the umbrella of the UK government-funded One Food programme, an Official Development Assistance transformative project to champion a safe and sustainable food future. At the project’s core are integrated One Health principles, which seek to balance and optimise the health of humans, animals/plants and ecosystems, known as the three One Health ‘pillars’."
        },
        {
            "text": "The Cefas and APHA team organised a Special Morning Session ‘One Food: A One Health approach for food systems transformation’ chaired by Professor Grant Stentiford, Cefas’ Chief Scientist and Dr Essa Suleman, Council for Scientific and Industrial Research, South Africa (CSIR) Principal Researcher and One Food programme co-lead. The session, with over 100 attendees, explored the challenges and opportunities for a One Health approach to food systems. The panel, comprising representatives of the United Nations Food and Agriculture Organisation (FAO), United  Nations Environment Programme (UNEP), World Health Organisation (WHO), World Organisation for Animal Health (WOAH), World Bank and the South African Department of Science and Innovation (DSI), discussed key questions on integrating across the three One Health pillars for food systems transformation, embedding the One Food approach into ‘business as usual’ and what a healthy food system could look like in the future."
        },
        {
            "text": "Professor Stentiford commented “Food systems on land and in the water offer tremendous potential to act as a focal point for policies aimed to embed One Health – making healthier plants and animals that benefit people, and which have much reduced burden on nature and climate change. The One Food programme is looking to place hazard control [e.g., diseases, contaminants etc) at the centre of this new approach – reducing production losses, avoiding waste in the supply chain, making food safer to eat and ultimately, reducing the footprint of the food system to realise One Health benefits. The quadripartite [FAO, UNEP, WHO and WOAH] are already looking at this kind of systems approach via their Joint Plan of Action – programmes such as One Food developing the methods and approaches needed to make this collaborative approach a working reality.”"
        },
        {
            "text": "The UK-South Africa team promoted the One Food concept and project from a dedicated booth outside the main auditorium throughout the four days of the congress. This interactive space created an opportunity for deeper dialogue between the experts present at WOHC and to advocate for shared learning to improve our ability to work together and optimise One Health outcomes. There were visitors from government, academic and research institutions and international visitors who were interested in One Food. All were encouraged to join the One Food Community of Practice, which brings previously disparate deep specialisms together around a shared belief – better, safer foods that have less impact on the environment. The community co-develops science, policy and societal solutions to the pressing challenge of sufficient, accessible, appropriate, safe, resilient and environmentally positive food for all."
        },
        {
            "text": "Dr Julie Bremner, One Food co-lead explained “We need a whole-system approach to the world’s pressing problems. It’s really challenging to work across diverse disciplines because we speak different technical languages and hold different worldviews; one person’s ecosystem to conserve is another’s natural resource to utilise. The One Health approach gives us a banner under which we can frame our common goals, and the World One Health Congress is the place to have those cross-pollinating conversations.”"
        },
        {
            "heading": 2,
            "text": "The One Food Anatomy"
        },
        {
            "text": "The One Food project is funded through the UK government’s Department for the Environment, Food and Rural Affairs (Defra) Global Centre on Biodiversity for Climate programme and is co-led by the UK’s Cefas and APHA, and South Africa’s DSI, CSIR and Human Sciences Research Council (HSRC). The programme includes 21 UK, South African and global partners drawn from government, academia and non-profit, and is organised around three main themes of ‘food system evidence’, a ‘One Food Risk Tool’ and ‘enabling change’."
        },
        {
            "text": "The One Food approach is rooted in the principles of economic, environmental, and social sustainability. One of the central outputs of the programme is the ‘One Food Risk Tool’, a whole-food system risk assessment tool, developed on the template of the earlier Seafood Risk Tool, which seeks to estimate the impact of all hazards (i.e. problems) acting on, or created by, food systems. The tool assesses the impact of chemical, biological, physical and societal along different stages of the food value chain across all food sectors; allowing the relative risk of the hazards to be compared and in doing so facilitating collective decisions on priority interventions."
        },
        {
            "text": "Dr Essa Suleman, Principal Researcher and Research Group Leader at CSIR explained the One Food Risk Tool (OFRT) further, “The CSIR, together with Cefas and APHA, are leading development of the OFRT, which aims to provide scientists and policymakers with a means to support evidence-based decision making when evaluating the risks and impacts of hazards on food systems value chains. A functional prototype of the OFRT will be demonstrated at an upcoming workshop in November 2024.”"
        },
        {
            "text": "Transforming food systems in this way requires us to understand the structure and arrangement of the whole system. One Food seeks to create a framework for mapping a country’s food system and is implementing this in South Africa, as well as filling knowledge gaps on the role of informality in the food system, on food system interventions, on food loss and waste and on nutrition, amongst others."
        },
        {
            "text": "A robust evidence base is a necessary pre-condition to achieve climate resilient, sustainable, nature-positive food systems for all."
        },
        {
            "text": "Dr Flavie Vial from the Animal and Plant Health Agency elaborates: “Paradigm shifts are required to address fragmentation in systemic research. One Food’s participatory research approach – in which research is carried out in a collaborative and iterative process of shared learning- has high potential for both academic and societal impact. Our research outputs and the community of practitioners we have built are key to influencing the development of policy and changing practices.\""
        },
        {
            "heading": 2,
            "text": "Cross Government support for the WOHC"
        },
        {
            "text": "The UK and South African governments both recognise the value of the One Health approach. Cefas partnered with CSIR for the Panel Discussion and Exhibition Booth at the Congress, the Human Sciences Research Council (HSRC) and Agricultural Research Council attended, with the One Food team and the Department of Science and Innovation participating on the One Food panel."
        },
        {
            "text": "From the UK, Defra’s One Health team and the Veterinary Medicines Directorate were represented, taking part in various ways, such as APHA speaking about antimicrobial resistance."
        },
        {
            "text": "Other contributions at the congress from the UK government included presenting, chairing sessions and sitting on panels, from a range of departments including: the UK Department of Health and Social Care, UK Health Security Agency, Department for Business and Trade, Foreign and Commonwealth Development Office and the Department for Environment, Food and Rural Affairs."
        }
    ]
}