{
    "url": "https://defraenvironment.blog.gov.uk/2024/10/16/why-monitoring-matters-showcasing-the-natural-capital-and-ecosystem-assessment-programme/",
    "title": "Why monitoring matters: showcasing the Natural Capital and Ecosystem Assessment programme",
    "authors": [
        "David Jones"
    ],
    "categories": [
        "Nature",
        "NCEA programme",
        "Research and data analysis"
    ],
    "pub_date": "2024-10-16T11:16:25+01:00",
    "content": [
        {
            "text": "I’m David Jones and I’m the Senior Responsible Owner for the terrestrial arm of Defra’s largest research and development programme, the Natural Capital and Ecosystem Assessment (NCEA) programme. "
        },
        {
            "text": "Earlier in the year, I shared a blog post about the programme and how it ensures we can make better decisions about our environment.  "
        },
        {
            "text": "The NCEA programme maps the size, location and condition of our natural capital and ecosystems. "
        },
        {
            "text": "The programme’s unique partnership model means we will be able to monitor England’s environment and nature long term. The resulting environmental data, maps and other products will be publicly accessible. "
        },
        {
            "text": "This public access is key. It will ensure businesses, central and local governments, the public and charitable organisations can use our products to evaluate their progress. The data can also be used to address gaps in planning, and for greening, restoration and rewilding.  "
        },
        {
            "text": "In this post, I’ll tell you about our recent stakeholder event to exhibit our work. "
        },
        {
            "text": "Introducing our stakeholder showcase "
        },
        {
            "text": "Thursday 12 September was a big moment for the programme, as we held our first ever cross-government NCEA stakeholder showcase at the Royal Society, London. "
        },
        {
            "text": "The showcase brought together around 100 senior delegates from government departments, non-departmental public bodies including our programme delivery partners, research councils and regulatory bodies, devolved administrations, and a small number of external stakeholders. All of them with an interest in natural capital, nature recovery and environmental decision-making. "
        },
        {
            "text": "It is the first time we have formally shared the exciting work of the NCEA in this way and, as Senior Responsible Owner for the tNCEA, it was a proud – and I must admit, slightly anxious - occasion.  "
        },
        {
            "text": "Our agenda featured an array of expert speakers. There was a thought-provoking panel discussion on ‘modern evidence to enable modern decision-making' and policy-focused showcase sessions covering important topics such as water, environmental land management, nature recovery, planning and land use. Minister for Nature, Mary Creagh, delivered the closing remarks and shared her vision for nature recovery. "
        },
        {
            "text": "The importance of leadership "
        },
        {
            "text": "I believe that as leaders and decision makers, we have a critical role to play in ensuring we understand, account for, and address the impact our policy and planning decisions have on our natural world. This is only possible if we understand the state of our natural assets and how they are changing.  "
        },
        {
            "text": "The NCEA stakeholder showcase encouraged senior leaders to consider how the programme can support their areas, now and in the future. It created a fertile space for collaboration and join-up across government and beyond. "
        },
        {
            "text": "The NCEA Stakeholder Showcase is a major milestone for the programme and the start of our journey to raise awareness of the information on the natural environment that the NCEA is delivering. "
        },
        {
            "text": "I would like to thank everyone who attended the showcase. It was a privilege to connect with so many like-minded individuals in one room.  "
        },
        {
            "text": "I am excited about the road ahead and welcome the opportunity to grow this engagement and collaboration as we move forward. "
        },
        {
            "text": "Next steps "
        },
        {
            "text": "Moving forward, NCEA is developing an enduring service delivery model for natural capital data. By increasing access to an environmental-socio-economic evidence base, we will enable greater insights on the environment, and the services and benefits it provides.  This will improve decision-making and increase innovation in protecting and enhancing the environment.  "
        },
        {
            "text": "We regularly release new and updated products, tools and data sets. For instance, over the last few weeks we have released updates for Living England, a national scale habitat map, and the Green Infrastructure map, a key tool to support government’s commitment for everyone to live within 15 minutes’ walk of a green space.  We aim to publish all our data via Open Government Licence. "
        },
        {
            "text": "We continue to work closely and build relationships with existing and new customers to ensure that the data, tools and products we are generating are used to deliver real-life value. If you would like to learn more about the NCEA programme, please contact NCEAcomms@defra.gov.uk. "
        },
        {
            "text": "For more highlights from the stakeholder showcase, watch our video below. "
        },
        {
            "text": "You can also watch the video on YouTube.  "
        }
    ]
}