{
    "url": "https://cspl.blog.gov.uk/2021/07/26/an-opportunity-to-reform-election-finance/",
    "title": "An opportunity to reform election finance",
    "authors": [
        "Dame Shirley Pearce"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2021-07-26T10:00:03+01:00",
    "content": [
        {
            "text": "This month we published a report with a package of practical recommendations to modernise and improve the system for regulating the money spent to influence the outcome of elections and referendums. "
        },
        {
            "text": "Encouraging compliance"
        },
        {
            "text": "A key theme of our report is on encouraging better compliance with the rules. Those involved in raising and spending money in elections should be accountable for their actions and there needs to be a proportionate response to breaches of the law. The system must be able to accommodate the diversity of players – from the candidate standing at a local election for the first time, to the established major political party, charity or other organisation. And it must meet the needs of the public, who deserve to understand how money is being spent to get them to vote one way or the other and who will want to have confidence that failure to comply with the rules is addressed appropriately."
        },
        {
            "text": "Our report focuses on encouraging compliance through developing the system of civil sanctions overseen by a strong and independent Electoral Commission."
        },
        {
            "text": "We recognise that the Commission endeavours to support parties and campaigners to comply with the rules but we think there are some areas where the Commission could be more helpful. We think it should learn to understand better how campaigning works and we propose that it makes greater use of the politically nominated commissioners who sit on the Commission’s Board.  We also heard a need for it to give more definitive advice."
        },
        {
            "text": "To be fully effective the Commission must have the powers it needs to deliver the responsibilities it has been tasked with by Parliament. We make recommendations with this in mind. For example, the Commission’s powers to compel the provision of information outside an investigation should be extended to include any person who may hold relevant material. This will allow the Commission to obtain information from unregistered third parties and social media platforms and enable them to act quickly to prevent the rules from being broken. And we propose an increase in the maximum fine the Commission may impose to 4% of a campaign’s total spend or £500,000, whichever is higher. When you consider that the maximum spending limit for parties fielding candidates in every constituency is around £19m, a £20,000 fine simply does not provide a meaningful deterrent."
        },
        {
            "text": "We believe the civil sanctions regime administered by the Electoral Commission should be extended to include candidate finance laws and that offences relating to essentially administrative requirements should be decriminalised. This would provide a way of addressing breaches of the law that are not serious enough to warrant a criminal prosecution. It would also reassure volunteers that there is no risk of a mistake on their part leading to a criminal conviction. The Commission would have more joined-up oversight of how money is spent by parties, campaigners and candidates. This responsibility should go hand-in-hand with managing an online process for receiving and publishing candidate spending returns. Spending returns from parties, campaigners and candidates should be available for all to view on-line in a single, centralised database."
        },
        {
            "text": "We have also recommended new timeframes for Electoral Commission investigations to govern both the period during which an investigation may be opened and the duration of an investigation. These periods may be extended on application to a court, in exceptional circumstances. This will ensure investigations happen as swiftly as possible and improve public confidence in the enforcement process."
        },
        {
            "text": "The Elections Bill"
        },
        {
            "text": "Our report was published in the same week as the Government’s Elections Bill.  We welcome a number of the campaign finance measures in the Bill as a step in the right direction and were pleased to see digital imprints included."
        },
        {
            "text": "We make a wide range of recommendations in our report which would enhance the regime for regulating election finance and make it more effective, transparent and proportionate. The Elections Bill presents an immediate opportunity to incorporate our recommendations. It is an opportunity that we urge the government to take."
        },
        {
            "text": " "
        }
    ]
}