{
    "url": "https://civilservice.blog.gov.uk/2021/07/26/from-fossil-fuels-to-clean-and-green/",
    "title": "From Fossil Fuels to Clean and Green",
    "authors": [
        "Katherine Wright, Deputy Director Public Sector and Local Energy, BEIS"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-07-26T13:33:28+00:00",
    "content": [
        {
            "text": "The story so far! How £1bn government funding is transforming public buildings on the way to the UK’s goal of net zero ready. "
        },
        {
            "text": "Across the UK work is underway to improve hundreds of buildings at the heart of our communities, making them greener, warmer and more energy efficient. From tiny village schools to urban academies with thousands of pupils, heritage buildings to multi-site NHS Trusts, our public buildings are undergoing a green transformation. The dramatic improvements are thanks to successful bids for grants through the Public Sector Decarbonisation Scheme. "
        },
        {
            "text": "Now, having led the brilliant team behind the launch of the scheme on 30th September 2020, I’m incredibly proud of the positive impact this work is having on people’s lives. "
        },
        {
            "text": "We’re already hearing from grant recipients who have completed their upgrades. Changes include roof insulation, installing heat pumps or replacing old fluorescent lighting with energy-saving LEDs. Others, such as Greater Manchester Combined Authority, are planning large scale projects across multiple sites including leisure centres, schools and offices. "
        },
        {
            "text": "Commitment to reach net zero"
        },
        {
            "text": "I’m particularly proud and excited that every completed project moves us one step closer to achieving the Government’s national commitment to achieve net zero by 2050. "
        },
        {
            "text": "Net zero means that you’re putting no more greenhouse gases into the atmosphere than you’re taking out of it, so becoming ‘carbon neutral.’"
        },
        {
            "text": "Direct emissions from public sector buildings currently account for 2% of UK greenhouse gas emissions, so cutting emissions from the public sector is a vital piece of the jigsaw.   "
        },
        {
            "text": "It’s been so encouraging to see the commitment and drive from the public sector to play its part in this. Our scheme - part of the Chancellor’s ‘Plan for Jobs 2020’ to support the UK recovery from COVID-19 - launched last September. Public bodies could apply for a share of a £1 billion pot to install low-carbon technologies. They include; heat pumps, energy saving measures such as insulation or double glazing, or measures enabling low carbon technologies to be installed, such as metering or electrical infrastructure.  Funding has been allocated to more than 400 projects which are now underway, and which in some cases have already been completed."
        },
        {
            "text": "Greener school buildings"
        },
        {
            "text": "A 19th century former hunting lodge and stable block used as classrooms and administration offices at Royal Latin school in Buckingham lacked any insulation and had only single glazed windows. Funding of £273,000 from the scheme enabled the school to install triple glazed windows, roof insulation and solar panels which will reduce emissions and help keep the building warm."
        },
        {
            "text": "Greener NHS"
        },
        {
            "text": "Hospitals across the country are now becoming more energy efficient, cutting their carbon emissions thanks to the scheme. Charing Cross Hospital and Hammersmith Hospital are both on track to becoming more environmentally friendly thanks to £27 million funding to Imperial College Healthcare NHS Trust. "
        },
        {
            "text": "The funding is enabling heat pumps and solar panels to be installed at both hospitals alongside a range of supporting energy efficiency measures such as LED lighting and insulation. These measures aim to reduce the energy consumption of each site by 20%."
        },
        {
            "text": "Restoring heritage"
        },
        {
            "text": "We’re hearing too about ways funding is being used to restore heritage sites with energy efficient and low carbon solutions.  Cleveland Pools in Bath is the UK’s oldest outdoor public swimming pool. Built in the 1800s but unused and derelict since the 1980s, it’s going through a major restoration programme and will be installing a water source heat pump as part of a £999,000 grant to Bath and North-East Somerset Council from the scheme. "
        },
        {
            "text": "Making the most of every opportunity…"
        },
        {
            "text": "There are some really creative projects being implemented. Salt Ayre Leisure Centre in Lancaster will use its £6.8 million funding to replace gas boilers with low carbon air source heat pumps – and to install solar panels on a nearby landfill site, connected to the leisure centre, to power the heat pumps.  We’re looking forward to hearing an update on the energy savings this solution will bring! "
        },
        {
            "text": "This is the first phase of activity for the Public Sector Decarbonisation Scheme which will deliver carbon savings equivalent to taking 45,000 cars off the road, while supporting up to 30,000 green jobs. "
        },
        {
            "text": "More information on the Public Sector Decarbonisation Scheme and the projects it is funding is available here. These projects will be completing later this year, and I look forward to sharing news of how much more we will have achieved over the coming months.  "
        }
    ]
}