{
    "url": "https://planninginspectorate.blog.gov.uk/2021/07/26/improving-our-appeals-service-working-wider/",
    "title": "Improving our appeals service: Working wider",
    "authors": [
        "Stephen Read"
    ],
    "categories": [
        "Appeals",
        "Digital",
        "Service improvement"
    ],
    "pub_date": "2021-07-26T15:37:15+01:00",
    "content": [
        {
            "text": "At the Planning Inspectorate, one of the current areas of work is developing our appeals service, where our vision is ‘planning decision appeals made easier, faster and more cost effective’."
        },
        {
            "text": "You may have read the previous blog introducing the 3 services."
        },
        {
            "text": "In this post, I’m going to explain how we have developed the service to look at the planning appeal journey and the work we are doing to link up with other projects in the wider planning sector."
        },
        {
            "text": "Our work on the Appeals service originally started with a focus on our systems in the Planning Inspectorate – both those for our staff and also to replace the current Appeals Casework Portal that is used by appellants, agents and local planning authorities. We were an island, looking after those systems and services that we provided."
        },
        {
            "text": "Over the last 12 months, we have started to build closer links with those involved in the wider planning journey and this blog is an update on that work – and also an ask to help build that engagement!"
        },
        {
            "text": "The diagram below shows how we see our Appeals service now – at the end of the journey after an applicant \\ appellant has used other systems such as the planning portal and also the systems of a local planning authority."
        },
        {
            "heading": 3,
            "text": "User research: Key to developing our appeals service"
        },
        {
            "text": "We have put user-centred design at the heart of what we do and user research is something that is core to what we are doing, gathering what the users need but also involving users in testing what we develop. This includes users from all the groups I’ve mentioned above."
        },
        {
            "text": "Working closer with local planning authorities is a key area we are developing. We have a group of Beta authorities who are working with us to test the service, provide feedback on how best we implement this such as training and guidance but also help us understand how they communicate with agents. Each authority we have spoken to has provided really useful insight and this isn’t just a one-off conversation – we want to keep working with them as we continue to develop the Appeals service."
        },
        {
            "text": "An area that we have looked at is the decision notice. This is something that is owned by each authority but user research confirmed that this is the place that appellants will often start from. We have worked with our Beta authorities to understand whether (and what) we might be able to change based on the research – watch out for a future blog on this area."
        },
        {
            "text": "There are a number of different projects going on with local planning authorities right now – the Reducing Invalid Planning Applications (RIPA) and Back Office Planning System (BOPS) projects that are led by Lambeth, Southwark and Buckinghamshire councils as well as the Local Plans Pathfinder project led by MHCLG. Although we are looking at different elements of the wider planning journey, we are looking at opportunities to join up and also share experiences."
        },
        {
            "heading": 3,
            "text": "Widening user research with more planning agents"
        },
        {
            "text": "One of the elements that we have recognised is that we wanted to build a deeper knowledge of how agents use our service."
        },
        {
            "text": "Looking at our data, we knew that there was a group of agents that produced a lot of appeals and then a group of agents that may only be involved with 1 or 2 a year. Our assumption that the needs may differ dependent on the regularity of using our system is something that we are testing through our user research. We want to build a network of agents that we can work with on an ongoing basis so if you would be willing to help, please let us know at appeals.feedback@planninginspectorate.gov.uk."
        },
        {
            "text": "We have built stronger relationships with colleagues in MHCLG Planning and Digital teams. This is a time of significant change in the planning sector and we are keen to build the Appeals service in a way that supports the future."
        },
        {
            "text": "Finally, I wanted to finish this blog with a quick view of what the new service looks like – you will see the consistent look and feel with other government services and by the time that you read this blog, the service may well have changed – part of the way that we are responding to feedback."
        },
        {
            "heading": 3,
            "text": "Keep tuned for more about our service improvements"
        },
        {
            "text": "We will be blogging more about our service improvements over the coming months. Subscribe to keep updated about all of our blog posts."
        },
        {
            "text": " "
        }
    ]
}