{
    "url": "https://hmlandregistry.blog.gov.uk/2021/07/26/in-form-ed-consent/",
    "title": "In-form-ed consent",
    "authors": [
        "Pascal Lalande, Central Operations Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2021-07-26T09:58:40+01:00",
    "content": [
        {
            "text": "The story: You’ve been working for months on a deal that required the cooperation of the seller’s ex-husband, the management company or a risk-averse mortgagee. It’s been fraught with difficulty, you’ve finally completed it and submitted the disposition for registration, only to be told the consent or certificate it took you so much time and effort to obtain is not sufficient to get past the restriction in the register."
        },
        {
            "text": "I can imagine the sinking feeling you experience at such times and, unfortunately, it happens all too often. Indeed, during the past year of lockdown HM Land Registry sent more than three times the number of requests for information (requisitions) relating to such consents or certificates compared to the previous year."
        },
        {
            "text": "You tell us these requests are often the most difficult to comply with. If the seller’s representatives sent you the consent or certificate before completion do you go back to them, or contact the person directly whose consent or certificate you need? Will anyone be interested? Will they ask you to pay their costs or an extra fee and, if so, what will your client say?"
        },
        {
            "text": "We sympathise and have been looking for solutions to help you (and those asked to provide consents and certificates) get these documents right first time."
        },
        {
            "heading": 2,
            "text": "So, what’s been going wrong?"
        },
        {
            "text": "The trouble is, while the requirements of a restriction are precise, the consents and certificates sent to us often aren’t."
        },
        {
            "text": "Although we use our expert knowledge, experience and judgement to make informed decisions, sometimes we are accused of not being consistent. Why did we accept one certificate but not another? The answer is that, in each individual case we assess, the risk of a consent or certificate later being successfully challenged may be quite small but scaled up over thousands of similar applications problems can arise. Occasionally people lose valuable interests they have protected and seek indemnity for their loss. The safest solution for all concerned is to make sure the consent or certificate is exactly what is required."
        },
        {
            "heading": 2,
            "text": "A reliable way to comply "
        },
        {
            "text": "So, after consulting widely, we have devised form RXC to use when a consent or a certificate is needed to comply with a restriction in the register. You can find it on the GOV.UK website. Use of the form is optional but has the advantage of ensuring consents and certificates are correct first time."
        },
        {
            "text": "Form RXC has three main sections, requiring specific information that will prevent ambiguity:"
        },
        {
            "text": "Based on feedback, we anticipate conveyancers will fill in the panels before sending the form for signing and return, making it quick, clear and easy for the signatory to deal with."
        },
        {
            "text": "You may think HM Land Registry has quite enough forms already and ask why another is needed, especially at a time when we are increasingly encouraging our customers to interact with us digitally. It is, however, a question of finding the right tool for the job, and in this case, the new form will help customers provide a consent or a certificate required for a restriction that is correct first time."
        },
        {
            "text": "Remember, the form RXC is optional, but we believe many will choose to use it to help minimise the risk of receiving a requisition which, as we know, leads to frustration and delays all round."
        },
        {
            "heading": 2,
            "text": "Let us know what you think"
        },
        {
            "text": "We always welcome your feedback. Please complete our quick survey, adding any comments or suggestions about form RXC."
        }
    ]
}