{
    "url": "https://foresightprojects.blog.gov.uk/2021/07/26/participatory-futures-integrating-public-voices-in-futures-thinking/",
    "title": "Participatory Futures: Integrating Public Voices in Futures Thinking",
    "authors": [
        "Bethan Morgan"
    ],
    "categories": [
        "Futures Capability & Resource"
    ],
    "pub_date": "2021-07-26T14:06:46+01:00",
    "content": [
        {
            "text": "Public voices are increasingly being integrated into government’s foresight processes. This was one of the findings from GO-Science’s recent report with the School of International Futures, Features of effective systemic foresight in governments globally. Participatory Futures enables this integration and it was also a popular topic in this year’s Global Foresight Summit. We recently had Laurie Smith from Nesta host a masterclass on participatory futures techniques for the UK government’s Heads of Horizon Scanning network. This is what Laurie said about participatory futures:  "
        },
        {
            "text": "\"In the distant past before Covid-19, the UK innovation agency Nesta commissioned a survey of what the British public thought about innovation and the future. It found that even then, nearly two thirds of the UK population felt uncertain about the future and more than half thought that the world was changing too quickly."
        },
        {
            "text": "What can be done when citizens increasingly see the future as something to be afraid of and want to take refuge in the past?"
        },
        {
            "text": "Part of the solution lies in participatory futures - a range of approaches for involving citizens in exploring or shaping potential futures. These aim to democratise and encourage long-term thinking, and inform collective actions in the present. "
        },
        {
            "text": "Participatory futures exercises go beyond dry, traditional workshops and surveys to harness digital technologies and involve new players like artists, game developers and designers."
        },
        {
            "text": "Examples include: GhostFood, a food truck from the future that allowed the public to smell foods lost to climate change and the ground-breaking massive multiplayer game World Without Oil."
        },
        {
            "text": "Participatory futures can help create collective images of the future around which people can organise in times of disruption, prevent blind spots by considering different perspectives and catalyse more inclusive innovation. "
        },
        {
            "text": "Our report on participatory futures, co-authored by Kathy Peach, John Sweeney and Jose Ramos, provides an overview of the field and includes tips on how to commission or conduct this sort of work, including: "
        },
        {
            "text": "Thank you, Laurie, for his useful overview and interesting case studies. How do you think Participatory Futures could benefit UK long-term policy-making? Let us know in the comments. "
        }
    ]
}