{
    "url": "https://dcmslibraries.blog.gov.uk/2021/07/26/rediscover-reading-this-summer-with-your-local-library/",
    "title": "Rediscover Reading this summer with your local library",
    "authors": [
        "Cheryl Shorter, Libraries Team, DCMS"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2021-07-26T12:59:18+01:00",
    "content": [
        {
            "text": "I know that, for many children and young people, the past year has been full of missed opportunities. That’s why we’re encouraging families to rediscover summer and make the most of the brilliant activities that are happening across the country during the school holidays. "
        },
        {
            "text": "I have always loved reading, and I believe it is a great activity that can be enjoyed by  everyone regardless of your age or ability. It’s creative, can be done anywhere and, if you use your local library, it’s free. "
        },
        {
            "text": "A lifelong love of reading is one of the best gifts a parent can give their children. Libraries have always been an anchor in my own life – from visits to Waterlooville Library with my dad when I was a kid, to taking my own sons to Gosport Discovery Centre."
        },
        {
            "text": "Libraries will play an important role in keeping children reading this summer with the return of The Reading Agency’s annual Summer Reading Challenge, with its Wild World Heroes theme and it’s Summer of Reading. "
        },
        {
            "text": "During summer recess for Parliament, I’m looking forward to doing more reading myself.  While international travel may still be limited, reading can take us anywhere in the world – we can visit another place and meet new people without actually going very far at all.   I usually alternate between fiction and non fiction books, I’ve just started The Anarchy by William Dalrymple about the history of the British East India company – which I look forward to getting into over summer when I have more time to sit on Gosport’s beaches while (hopefully) enjoying some sunshine!"
        },
        {
            "text": "I’m a great believer in the power of reading to excite, inspire, reassure and support people of all ages, as well as providing hours of enjoyment. I’d encourage every family to go and visit your library, and join in with the fun!"
        }
    ]
}