{
    "url": "https://environmentagency.blog.gov.uk/2021/07/26/sun-sea-and-samples/",
    "title": "Sun, sea and samples",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-07-26T14:52:51+00:00",
    "content": [
        {
            "text": "By Lucy, Environment Officer in the Field Monitoring Team"
        },
        {
            "text": "There aren’t many who can boast a daily trip to the seaside as part of their job, but during the summer months that’s what I get to do, as my job consists of sampling the water along one of England’s longest coastlines – Essex."
        },
        {
            "text": "The county of Essex has a coastline spanning more than 350 miles and has nine bathing waters dotted along this length. But while it may be the second longest coastline in England, topped only by Cornwall, the number of bathing waters is just a fraction of the 400+ bathing waters in England."
        },
        {
            "text": "My daily routine starts with turning the fridge on in my van and placing freezer blocks in it so that the fridge is good and cold to keep the bathing water samples in the best possible condition for arriving at the lab."
        },
        {
            "text": "With the ever-increasing popularity of wild swimming and recreational activities on the water, we know that people like to get out there and enjoy coastal and inland waters, even when the sun doesn’t make an appearance. The fact that I’m out there in a range of weather conditions means the samples I collect provide an accurate reflection of the water conditions people experience on a day-to-day basis."
        },
        {
            "text": "Samples aren’t taken from the water’s edge, but at about a metre’s depth, so I wear waders and a life vest when going in the water. I need to be really conscious of tide times for summer bathing water sampling as some bathing waters can be difficult or dangerous to access at certain states of the tide."
        },
        {
            "text": "When taking the sample, I have to go about knee height into the sea and then fill the sample bottle by throwing it out on a secure line and letting it fill as it sinks. I then put the sample bottle the fridge in my van where it remains until I get back to the depot and it is collected by the courier and taken for analysis at our laboratory near Exeter."
        },
        {
            "text": "Once the courier has collected the samples it’s over to my colleagues in the lab. Our scientists in the Microbiology and Molecular team test for two types of bacteria that can indicate pollution in the water; E coli and intestinal enterococci. The lab can receive between 100 and 200 bottles of bathing water every day and uses specialist techniques to make the bacteria show up in samples. Once the results are in, they wing their way over to another team whose job it is to upload them onto our Swimfo website so the public can get regular updates on water quality throughout the bathing season."
        },
        {
            "text": "As well as collecting a sample of sea water, I also note down other information, such as the number of bathers and beach users, the salinity of the water, animal faeces, and litter on the beach. I get asked a fair few questions by members of the public, who are interested to know what I’m doing and it’s good to be able to explain. Often people aren’t aware that we do this sort of work in the Environment Agency and I think it is good that they are able to see us as a very real presence on the ground."
        },
        {
            "text": "The job that I do makes a real difference to the environment. Bathing water quality has improved so much over the last 20 years, and the majority of bathing waters in England are of a really high standard. There’s always more to do though and everyone can do their bit. Just a few simple steps, even if you’re nowhere near a beach, can help make a difference:"
        },
        {
            "text": "Know before you go – check Swimfo for details of over 400 bathing waters in England."
        },
        {
            "text": "Join Lucy at Holland Haven beach to collect a bathing water sample over on our YouTube channel - Monitoring England's bathing waters - YouTube."
        }
    ]
}