{
    "url": "https://mhrainspectorate.blog.gov.uk/2021/07/26/too-good-to-be-true-how-to-play-your-part-in-protecting-the-uk-medicines-supply-chain/",
    "title": "Too good to be true? How to play your part in protecting the UK medicines supply chain (updated)",
    "authors": [
        "Emanuela Krasteva"
    ],
    "categories": [
        "Compliance matters",
        "Events and symposia",
        "Good distribution practice"
    ],
    "pub_date": "2021-07-26T10:52:53+01:00",
    "content": [
        {
            "text": "Preventing falsified medicines entering the legal supply chain is a fundamental objective of good distribution practice (GDP) for distributors of medicinal products. We have previously covered qualification of suppliers, customers, phishing emails, and fraudulent websites , however, the risk to the supply chain remains present. We intend to provide further guidance on how you can remain vigilant so you can identify examples of the types of products and offers that are high risk. The MHRA is committed to providing guidance to industry and to supporting our stakeholders."
        },
        {
            "text": "MHRA held a webinar to provide information and guidance around the challenges we all face and real case studies of incidents we have been addressing.  A recording of the webinar can be viewed on our MHRAgovuk YouTube channel."
        },
        {
            "text": "GDP requires companies to implement effective procedures for the qualification and re-qualification of suppliers and customers. Robust qualification checks provide reassurance that medicinal products are being procured from reputable sources and are only supplied to customers who themselves are authorised to be in possession of medicines. So, what due diligence, as a licence holder, should you be considering when wholesaling medicines?"
        },
        {
            "text": "There is always an element of risk involved when adding a new supplier, or even when an existing supplier is expanding their line range. We expect that potential risks are identified and mitigated using robust supplier qualification checks, which take into consideration the suppliers themselves as well as the products on offer. For example, high-value low-turnover products may pose a particularly high risk. Often those are products that we would only expect to see in a hospital environment or intended for supply to hospitals. Recent non-urgent information requests issued to distributors highlighted products - including Betmiga, Eliquis, Entyvio, Flutiform, Gilenya, Isentress, Privigen, Seretide, Somatuline Autogel, Stelara, Xarelto, Symbicort, Synagis, Tysabri, and Zebinix – which had left the legitimate supply chain and been reintroduced."
        },
        {
            "text": "As distributors, we expect you to remain vigilant to any activity that may constitute fraud or attempt to breach the supply chain integrity. Any unsolicited offers for products should be treated with extra caution, particularly a cold call approach where a supplier appears eager or rushed to sell the stock on."
        },
        {
            "text": "Whenever you are offered high-value stock, always consider:"
        },
        {
            "text": "While many offers will be genuine, it is essential to conduct due diligence checks to ensure the authenticity of the medicines you are procuring. Weak due diligence checks increase the risk of introduction of falsified medicines into the supply chain. Failure to identify and report suspicious activity to the MHRA will lead to regulatory action being taken against your licence, which may lead to licence suspension and/or removal of the responsible person (RP)."
        },
        {
            "text": "Case Referrals, within our Enforcement team, is the responsible team at the MHRA and they will be able to provide support if you need to raise a report. If you suspect something, they can be reached using the contact details below:"
        },
        {
            "text": "Following the webinar, a number of questions were asked on the section on overseas-based call centres and home workers and we have updated the blog to answer those points."
        },
        {
            "heading": 3,
            "text": "Overseas call centres"
        },
        {
            "text": "Human medicines legislation and Good Distribution Practice (GDP) require that anyone with a wholesale dealer’s licence who is selling or supplying or procuring medicines should do so in accordance with a licence. GDP defines procuring as obtaining, acquiring, purchasing or buying medicinal products from manufacturers, importers or other wholesale distributors. Supplying is defined as all activities of providing, selling, donating medicinal products to wholesalers, pharmacists, or persons authorised or entitled to supply medicinal products to the public."
        },
        {
            "text": "Any activities of procurement and supplying must take place on sites named on a wholesale dealer’s licence. This means that procurement and sales offices cannot be based in third countries such as India, as GDP activities for GB wholesalers must be conducted within the UK."
        },
        {
            "heading": 3,
            "text": "Homeworkers"
        },
        {
            "text": "Where a company is using its own staff based at home then, as outlined above, if those staff are involved in activities of procuring or supplying medicinal products then that must be at a licensed premises. It then follows that the home address should be named on the wholesale dealer’s licence. As a matter of course, all home-based staff should be included in training in relation to their activities and the requirements of GDP and be subject to review by the Responsible Person on the self-inspection programme. All sites named on a Wholesale Distribution Authorisation (WDA) are subject to MHRA inspection."
        },
        {
            "text": "With the impact of Covid, many companies are operating hybrid models with staff located at home or the office. Provided the home working element is an interim measure and not full time, the home address would not be required to be named on a WDA."
        },
        {
            "text": " "
        }
    ]
}