{
    "url": "https://environmentagency.blog.gov.uk/2025/03/14/helping-our-fish-to-thrive-why-the-close-season-is-so-important/",
    "title": "Helping our fish to thrive: why the close season is so important",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Fisheries and biodiversity",
        "Nature",
        "Rivers"
    ],
    "pub_date": "2025-03-14T13:54:08+00:00",
    "content": [
        {
            "text": "The evenings are getting lighter, and spring is very much upon us and this is the time of year that coarse fish up and down the country turn their attention to spawning. Adult fish will be spawning, or recovering from spawning, and emerging eggs and juvenile fish are also vulnerable. As a result, from 15 March to 15 June inclusive, the statutory coarse fish close season comes into place on rivers, streams, drains and some protected stillwaters and canals."
        },
        {
            "text": "The three month close season is a vital time for coarse fish, and the break in angling activity allows them added protection. Being a fish at this time of year is quite an exhausting and stressful business, so any measures to protect them benefit fish populations now and into the future."
        },
        {
            "text": "To help protect fish stocks our Fisheries Enforcement and Technical Officers, alongside Angling Trust volunteer bailiffs and the Police, will be patrolling river banks as part of Operation Clampdown. This is to ensure people aren’t fishing illegally where the close season applies. Anyone caught fishing on protected waters at this time could face a hefty fine. During last year’s close season, the Environment Agency carried out 933 close season patrols resulting in 106 close season offences and 203 other fishing related offences."
        },
        {
            "text": "Dean Jones is a Fisheries Technical Officer in our Lincolnshire and Northamptonshire Area, covering the river Nene and Lincolnshire drains. He explains the importance of our enforcement work, especially during the close season."
        },
        {
            "text": "“Protecting fisheries is hugely important to angling. It’s why I wanted to be a Fisheries Officer. I am a keen match angler and used to run my own fishery, so I am invested in fishing and have seen the sport from different sides.“What I love about my work is that it allows me to help all those with an interest in angling and fisheries.  I also have a role in enforcing fisheries laws, an essential part of my work and one I really enjoy."
        },
        {
            "text": "“I particularly enjoy interacting with anglers on the bank and seeing first hand the benefits of fishing for mental health. I get the chance to explain how important it is to buy a fishing licence and love sharing examples of how fishing licence income helps maintain and improve our fisheries and angling."
        },
        {
            "text": "“Over the coming months, I will be working with the Angling Trust Volunteer Bailiff Service (VBS) and local rural police forces to ensure the close season on rivers and streams is enforced."
        },
        {
            "text": "“Please remember that the season is in place to give fish a chance to spawn and have plenty of time to recover, including delicate eggs and young fry.  To do this effectively we rely heavily on reports from the public. If you see any incidents of illegal fishing or suspicious activity, you can report it to the Environment Agency 24-hour incident number on 0800 80 70 60.”"
        },
        {
            "text": "Finally, whilst the rivers are closed to fishing for the next three months, there are still plenty of opportunities to get out fishing on canals and stillwaters, but remember you’ll need a fishing licence. You can get yours here - Buy a rod fishing licence: Buy a rod fishing licence for England and Wales - GOV.UK"
        },
        {
            "text": "If you are new to fishing or are a returning angler and fancy giving it a go, the Angling Trust are running their ‘Spring into Fishing’  campaign throughout the close season."
        }
    ]
}