{
    "url": "https://food.blog.gov.uk/2025/03/14/path-safe-changing-the-way-we-approach-surveillance/",
    "title": "PATH-SAFE: Changing the way we approach surveillance",
    "authors": [
        "Elaine Kinsella, Senior Project Manager"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2025-03-14T16:28:25+00:00",
    "content": [
        {
            "text": "The ability to detect and identify harmful pathogens early and to accurately trace foodborne disease (FBD) outbreaks to their source is critical to ensuring public health is protected and economic impact is limited."
        },
        {
            "text": "Initiated in 2021 and funded through the Shared Outcome Fund, the Pathogen Surveillance in Agriculture, Food and the Environment (PATH-SAFE) programme sought to find new ways of tackling and managing FBD and antimicrobial resistance (AMR) in the agri-food system and create a step change in the biosurveillance landscape."
        },
        {
            "text": "Over the last four years, through cross-sector collaboration, the programme has achieved that ambition.  "
        },
        {
            "heading": 2,
            "text": "Adapting our ways of working: Taking a One Health Approach "
        },
        {
            "text": "The incredible network created by the programme is just one of the many jewels in the crown of its successes. The PATH-SAFE collaboration has been led by the Food Standards Agency and delivered in partnership with eight core government partners:"
        },
        {
            "text": "Since its inception, PATH-SAFE has taken an open and inclusive, One Health approach, working across all four nations. Through this approach, the 65+ organisation strong cross-sector network supporting the programme has been formed, which has ultimately underpinned and enabled its success. "
        },
        {
            "text": "In this spirit of collaboration, the programme has sought to support and align with synergistic initiatives in the wider biosurveillance landscape.  PATH-SAFE was delivered amongst a backdrop of ongoing change, including the refresh of the UK Biological Security Strategy in 2023 and release of the UK’s second AMR National Action plan in 2024. It also coincided with the initiation of the GAPDC-II programme and National Biosurveillance Network, creating a strong need for community connection to maximise opportunities and value for money. The enhanced biosurveillance community connectivity PATH-SAFE has supported and championed is intended to be a key aspect of the programme’s lasting legacy.  "
        },
        {
            "heading": 2,
            "text": "Enabling change: Breaking new ground in biosurveillance  "
        },
        {
            "text": "Through over 30 different projects, spanning the programme’s four thematic areas of work (Data Sharing and Analysis, Foodborne Disease, Antimicrobial Resistance and On-Site Diagnostics), PATH-SAFE has broken new ground scientifically and has challenged the status quo.  The collaboration has developed innovative new tools and models, identified and filled crucial knowledge gaps and enhanced ways of working in the biosurveillance space.  We have written about the individual areas of the programme’s work in our Future Microbiology article (published October 2024) if you would like to find out more. Please also see the programme website which contains links to all of the programme’s publications so far, collated by theme for ease.  "
        },
        {
            "text": "PATH-SAFE’s achievements have also been acknowledged more widely and the programme has informed and been cited in strategies such as the UK Biological Security Strategy and the AMR National Action Plan 2024-2029, as well as in major research reports such as the most recent Veterinary Antimicrobial Resistance and Sales Surveillance report. "
        },
        {
            "text": "Though the programme is still ongoing and major impacts will be seen in years to come, PATH-SAFE’s representation in high profile UK government papers such as these highlights the programme’s position and its alignment within wider ambitions for biosurveillance and biosecurity in the UK and offers early indication of the impact the programme is striving to achieve.  "
        },
        {
            "heading": 2,
            "text": "An integrated surveillance system for the future "
        },
        {
            "text": "Our long-term ambition is to build an integrated national food surveillance system and the pilots developed in PATH-SAFE have firmly put us on a pathway to success.  We have generated new knowledge (pillar 1), brought data together (pillar 2) and developed new methodologies, approaches and tools (pillar 3).  These pillars are interconnected and create feedback loops to inform need within the system. "
        },
        {
            "text": "Many of the PATH-SAFE pilot programme outputs are ready to be deployed and a key next step for programme partners is the dissemination and embedding of outputs in a One Health approach into the surveillance infrastructure to improve the detection and management of foodborne pathogenic threats and improve public health protection.  "
        },
        {
            "text": "Where outputs are not ready for deployment or where research conducted has unearthed new questions or lines of inquiry, partners are exploring opportunities to capitalise on and build on PATH-SAFE achievements to take the work forwards.   "
        },
        {
            "text": "The programme will conclude at the end of March 2025. There is however a strong desire within the partnership to continue to utilise the interdisciplinary, One Health, four nation approach that has been taken by PATH-SAFE.  Looking to the future, the programme’s original vision, to enhance biosurveillance in the agri-food environment, remains and there is more to do. "
        },
        {
            "text": "In the coming year, as we embark upon further work, we will continue to work closely with the PATH-SAFE community involved in ongoing synergistic initiatives, enabling change by innovating and adapting together.  "
        },
        {
            "heading": 2,
            "text": "Where to find out more "
        },
        {
            "text": "Links to all of the PATH-SAFE publications produced so far (grouped by theme), plus other resources like recordings of our programme webinar series and talks from our March 2024 conference, can be found on the PATH-SAFE website. "
        }
    ]
}