{
    "url": "https://moderncivilservice.blog.gov.uk/2025/03/14/the-humanoid-project-how-robot-education-is-inspiring-young-minds/",
    "title": "Children embrace the future with the Humanoid School Project ",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Data science",
        "Digital and data",
        "Innovation",
        "Policy",
        "Proud Civil Servants",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-03-14T14:21:15+00:00",
    "content": [
        {
            "text": "British Science Week 2025 marked the launch of an exciting new initiative, where primary school children across the UK were introduced to the world of humanoid robots. The aim of this pilot project, led by the Government Office for Science and the Association for Science and Discovery Centres (ASDC), was to spark enthusiasm in schools about science and technology. "
        },
        {
            "text": "Government Chief Scientific Adviser Professor Dame Angela McLean shared her excitement about the pilot: “The school outreach project is an exciting opportunity to prompt young people to think about important new ideas, how these will affect their lives, and how they can get involved in science and technology for the good of our collective future. I hope it helps to raise the next generation of enthusiastic scientists and engineers!” "
        },
        {
            "heading": 2,
            "text": "What are humanoid robots?"
        },
        {
            "text": "As their name suggests, humanoid robots are robots that physically resemble humans and can work alongside us to improve productivity. These robots are capable of performing a range of tasks, including lifting or moving objects, unloading boxes or working in dangerous settings that are unsafe for humans."
        },
        {
            "heading": 2,
            "text": "Bringing technology into the classroom"
        },
        {
            "text": "The humanoid pilot is currently running in schools in Oxfordshire, Buckinghamshire, Leicestershire and Nottinghamshire and aims to spark interest among Year 5 and 6 children. The Government Office for Science has designed a futuristic poster to serve as a conversation starter in classrooms, whilst the ASDC has distributed materials to schools through the network of Science and Discovery Centres and conducted focus groups to gather feedback from teachers and pupils. "
        },
        {
            "text": "Chief Executive of ASDC Shaaron Leverment said: \"These posters aim to spark curiosity, imagination and aspiration. We're achieving this by working closely with regional science centres – through their trusted relationships with local schools and teachers, their understanding of regional diversity and close adherence to evidenced approaches to accessible and impactful STEM engagement.\""
        },
        {
            "heading": 2,
            "text": "A promising start for science education"
        },
        {
            "text": "This pilot initiative is the first step into what’s hoped to be a longer term, UK-wide project. Future phases aim to introduce more analysis on emerging technologies and tools, to get children excited about STEM! "
        },
        {
            "text": "You can find out more in the Government Office for Science press release."
        }
    ]
}