{
    "url": "https://ukhsa.blog.gov.uk/2022/06/16/clean-air-day-how-ukhsa-is-tackling-air-pollution-and-how-you-can-help/",
    "title": "Clean Air Day – how UKHSA is tackling air pollution, and how you can help",
    "authors": [
        "Karen Exley",
        "Robie Kamanyire",
        "Stuart Aldridge"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-06-16T13:02:23+01:00",
    "content": [
        {
            "text": "Breathing in polluted air affects our health, reduces our life expectancy, and costs our society billions of pounds each year. It is estimated that two million healthy life years are lost in Europe due to the impacts of poor air quality, making the need to improve air we breathe in and reduce the pollution we produce a clear priority."
        },
        {
            "text": "Despite improvements in air quality over previous decades, air pollution remains a significant environmental risk factor, which is why the UK Health Security Agency (UKHSA) through its Cleaner Air Programme is aiming to reduce people’s exposure, therefore tackling existing health inequalities, and improving outcomes for all."
        },
        {
            "heading": 2,
            "text": "Increasing the evidence base"
        },
        {
            "text": "UKHSA’s programme is organised around three core outcomes: Increasing the evidence base, influencing, and supporting stakeholders and improving awareness and understanding."
        },
        {
            "text": "We build this evidence base by publishing journals, reports and policy briefs on a range of topics and review the effectiveness of interventions. Key to the research we carry out are our Health Protection Research Units (HPRUs), which are existing partnerships between academia and UKHSA, funded by the National Institute of Health Research (NIHR)."
        },
        {
            "text": "Between 2014 and 2020 one such HPRU, ‘Health impacts of Environmental Hazards’ focussed its research on air quality, spanning from in vitro laboratory studies through to epidemiology studies. From 2020, four new HPRUs – which include partnerships with the University of Leicester, Imperial College London and the London School of Hygiene and Tropical Medicine – will continue to research and answer the key questions on air pollution, namely:"
        },
        {
            "heading": 2,
            "text": "Influencing and supporting stakeholders"
        },
        {
            "text": "It is vitally important that in order to support our stakeholders, UKHSA Air Quality representatives offer their expertise on air pollution in order to improve understanding of the issue across the country."
        },
        {
            "text": "In preparation for Clean Air day, Amanda Craswell from Environmental Hazards and Emergencies (EHE) department joined the Leeds City Council’s public health and environmental health team to encourage actions for reducing emissions improve better health, whilst Charlotte Landeg-Cox will be leading discussions on public consultation and engagement at the Transition Clean Air network event ‘Beyond the Clean Air Zone’ in Birmingham."
        },
        {
            "text": "To mark National Clean Air Day, the London Air Quality and Health Programme Office, hosted by UKHSA, has presented a paper to the London Clinical Executive Group asking that they:"
        },
        {
            "heading": 2,
            "text": "Improving awareness and understanding"
        },
        {
            "text": "Continuing on from Public Health England, the UKHSA continues to conduct environmental public health tracking and surveillance of air pollution."
        },
        {
            "text": "A new pilot surveillance system aims to consider both ambient and indoor aspects of exposure to air pollution and is a tool that will be usable to stakeholders for evaluation of interventions that aim to reduce this exposure at population level. In time, the system should have the potential to incorporate linkages to health behaviours and outcomes."
        },
        {
            "heading": 2,
            "text": "What can you do?"
        },
        {
            "text": "Air pollution is a problem that affects all of us, but it is almost always the most socioeconomically disadvantaged that suffer the most from its effects, as well as the most vulnerable in our society such as children and people with underlying conditions."
        },
        {
            "text": "We can all do our bit to improve air quality. By walking or cycling to work and school we can improve our health through exercise and subsequently help to limit air pollution – where you can, walk those short distance trips and leave your car at home."
        },
        {
            "text": "Talking is also vital – ask local and national decision makers what would make it easier for you to walk more in your local community, and speak to friends, family and colleagues about the harms of air pollution."
        },
        {
            "text": "According to the Global Action Plan, 82% of people think that air pollution should be a priority for the UK, an increase of 11% over the last three years, while 90% now report doing at least one thing to help reduce outdoor air pollution."
        },
        {
            "text": "The consensus around the need for clean air is clear, and each individual step combined with the impact of actions taken by local and national government will see the air we breathe in improve immeasurably in the future."
        },
        {
            "text": "You can read more about what the UKHSA is doing to tackle air pollution in the latest edition of our Chemical hazards and Poisons report, published on 16 June."
        },
        {
            "text": "The Global Action Plan team have collected everything you need to know about air pollution in one place, published here."
        }
    ]
}