{
    "url": "https://environmentagency.blog.gov.uk/2022/06/16/enforcement-undertaking-donations/",
    "title": "Enforcement Undertaking Donations",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Other areas of our work"
    ],
    "pub_date": "2022-06-16T13:49:57+00:00",
    "content": [
        {
            "text": "The Environment Agency is committed to tackling various waste offences and companies that are in breach of the current regulations. One of the ways we achieve this is by issuing a Civil Sanction via an Enforcement Undertaking."
        },
        {
            "text": "The aim of the Enforcement Undertaking is to bring the company to the point financially where they would have been, had they been registered. Other than the recovery of our costs, the rest of the money raised goes straight to a charity of their choice as a donation."
        },
        {
            "text": "Following prosecution of companies for breach of regulations, two donations were recently made to some fantastic projects across England."
        },
        {
            "text": "A donation of £22,000 was made to the Bee Friendly Trust in June 2021. Bee Friendly Trust’s main aim is to increase the forage for urban bees, recognising their importance to the global eco-system."
        },
        {
            "text": "The donation was used for a project that would promote bee conservation around local railway stations. The creation of new wildlife habitats took place at five railway stations in the north of England and the midlands including Chesterfield, Cromford, Ilkeston, Whatstandwell, Woburn Sands, Tutbury & Hatton."
        },
        {
            "text": "A variety of floral planters were installed across the various stations including herb beds and the clearing of overgrown beds and borders."
        },
        {
            "text": "A donation was also made of £35,200 to Planet Patrol in November 2020. Planet Patrol, a leading environmental non-profit, is redefining what can be achieved through collective action and citizen science by placing power in the hands of the people to tackle environmental issues."
        },
        {
            "text": "Since the donation was received in 2020, it has contributed towards Planet Patrol's clean up programme in which they have run over 185 activity based clean up events across more than 110 towns and cities in the UK. Over 6,800 volunteers have taken part in paddle boarding, yoga, HIIT fitness or parkour events, combined with clean ups in 2021 alone, removing more than 85,000 pieces of litter from nature all of which has been recorded in the Planet Patrol app, gathering vital data to help create meaningful change."
        },
        {
            "text": "As of June 2022, Planet Patrol had recorded 412,250 pieces of litter data through its citizen science based programmes and work isn't stopping there."
        },
        {
            "text": "The Environment Agency takes all waste offences very seriously and will continue to work hard to bring those in breach of the regulations into compliance. Check you have the right environmental permits in place and are following the permit conditions: Environmental management : Environmental permits - detailed information - GOV.UK (www.gov.uk)"
        }
    ]
}