{
    "url": "https://educationhub.blog.gov.uk/2022/06/16/how-will-rail-strikes-affect-schools/",
    "title": "How will rail strikes affect schools?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-06-16T16:45:09+01:00",
    "content": [
        {
            "text": "Rail strikes are planned for the 21st, 23rd, and 25th June while the London Underground plans to strike on 21st June. The Secretary of State has called the plans a “crying shame” and said that he hopes these strikes will not go ahead because there is a risk that they could affect children and teachers who may not be able to get to school."
        },
        {
            "text": "Only a small number of pupils rely on trains to get them to school but if the strikes do go ahead, we advise pupils and teachers who may use trains to consider alternative travel arrangements on these days. We know the classroom is the best place for children and young people – as the Secretary of State has said, that’s one of the key lessons we’ve taken from the pandemic – and that’s why we want to see face to face learning maintained rather than defaulting to online teaching."
        },
        {
            "text": "Many pupils are taking GCSE, A level, T Level, VTQ and other formal assessments next week – we do not expect exams to be rescheduled because of the strike. This would not be fair on students. We know that schools and colleges will make every effort to ensure that examinations for all pupils go ahead as usual and, will draw on their existing contingency arrangements in place to manage any possible disruption, including late arrival of staff or students. The Joint Council for Qualifications has published guidance for schools that outlines existing flexibilities and changes to the normal rules for conducting examinations to support centres experiencing disruption. The guidance includes additional flexibility around invigilation numbers and published start times, which could be used if an invigilator is delayed by transport disruption."
        }
    ]
}