{
    "url": "https://cspl.blog.gov.uk/2022/06/16/independent-adviser-role-should-be-strengthened/",
    "title": "Independent Adviser role should be strengthened",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Ethical standards",
        "Nolan Principles"
    ],
    "pub_date": "2022-06-16T17:49:02+01:00",
    "content": [
        {
            "text": "Following the resignation of Lord Geidt as the Independent Adviser on Ministers’ Interests, it has been suggested that there may be no need for this role, or that the administration of the Ministerial Code could be handled differently.  "
        },
        {
            "text": "This may be driven by concerns about the difficulty of finding a successor for this sensitive and important role, but removing this independent voice on standards issues at the heart of government would risk further damage to public perceptions of standards. "
        },
        {
            "text": "Since 2006, there has been an Independent Adviser on Ministers’ Interests to give confidential advice on request from Ministers; to conduct investigations at the request of the Prime Minister; and to provide advice on the registration of Ministers’ private financial interests."
        },
        {
            "text": "The role was first recommended by our predecessors on the Committee after they heard evidence about the undesirability of investigations under the Ministerial Code being carried out by either the Cabinet Secretary or individuals appointed to investigate allegations on an ad hoc basis.  The government accepted this recommendation recognising the need for Ministers to have advice on compliance with relevant sections of the Code."
        },
        {
            "text": "The Committee has long called for the Independent Adviser’s role to live up to its name – most recently, in our Upholding Standards in Public Life report, we recommended the Adviser be appointed through an open process with the power to initiate his or her own investigations and with the authority to determine breaches of the Ministerial Code. At present, only the Prime Minister can determine whether a breach has occurred, a situation that has led to recent problems and the resignation of the previous adviser, Sir Alex Allen."
        },
        {
            "text": "At a time of heightened concern about standards in public life, any change to the oversight of Ministerial behaviour must be stronger, not weaker, than we have now.  And there should be an Independent Adviser in place while any such proposals are developed, someone with sufficient independence and integrity to provide Ministers with advice on the administration of the Ministerial Code and on upholding the Nolan Principles.  Anything less would be a backward step.  "
        }
    ]
}