{
    "url": "https://naturalengland.blog.gov.uk/2022/06/16/springing-into-action-with-protected-site-strategies-for-natures-recovery/",
    "title": "Springing into Action with Protected Site Strategies for Nature’s Recovery",
    "authors": [
        "Caroline Cotterell"
    ],
    "categories": [
        "Biodiversity",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species"
    ],
    "pub_date": "2022-06-16T12:06:26+01:00",
    "content": [
        {
            "text": "The Environment Act 2021 sets out the Government’s aim to put nature on the road to recovery for future generations. It has given us some of the tools needed to deliver for our environment, from cleaning up the country’s air, restoring natural habitats, increasing biodiversity, reducing waste, and making better use of our resources."
        },
        {
            "text": "Protected Site Strategies will play an important part in this.  These aim to bring together key stakeholders to address on and offsite pressures on protected sites (such as Sites of Special Scientific Interest) to help restore our most precious habitats, species and geodiversity."
        },
        {
            "text": "Protected Site Strategies will support the delivery of other Environment Act policies, including Local Nature Recovery Strategies, along with the Nature Recovery Network. They will also provide opportunities for Green Finance and Biodiversity Net Gain. Local Nature Recovery Strategies will provide consistent spatial plans for nature across England which Protected Site Strategies can help realise with packages of measures designed to address challenges faced by particular protected sites."
        },
        {
            "text": "Coastal squeeze (intertidal habitat loss), nutrient, air, and water pollution, climate change impacts and overgrazing are just some of the pressures a Protected Site Strategy could make a difference to. They will be most valuable where there are complex off-site issues affecting site condition and where the solution involves different operators. Key to success will be putting together successful partnerships to help deliver improvements. Currently most of our policies are focused on minimising harm to protected sites. Protected Site Strategies will be more ambitious, addressing impacts in ways that build nature’s recovery beyond its current state."
        },
        {
            "text": "Collaborative plans are not a new concept, but Protected Site Strategies, built through well-planned and executed consultation, have the potential to give partners the confidence to ensure everyone involved has a shared sense of ownership and clarity of the individual contributions necessary to make sure these deliver for nature."
        },
        {
            "text": "To test the full potential for Protected Site Strategies, we recently announced five pilot projects:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Evaluation will be a crucial element of the Protected Site Strategy pilots. We will be reviewing and learning the lessons from existing related projects such as tackling nutrient impacts on the Solent. Evaluation will also inform future statutory guidance for Protected Site Strategies and accompanying advisory toolkits."
        },
        {
            "text": "We will be utilising the latest insights from social science to ensure that these Strategies deliver in the long term. We will also be testing whether Protected Site Strategies have the potential to win business confidence to invest in nature-based solutions and new technologies that will address the root causes of impacts. For example, could a common vision to address nutrient impacts in a river catchment brought together in a Protected Site Strategy be the catalyst for investment in resurgent native woodland enterprises that follow from increased new woodland creation to reduce nutrients?"
        },
        {
            "text": "We look forward to working with local and national stakeholders to gather evidence, design, and test these new powers."
        },
        {
            "text": "For more information on our developmental work on Protected Site Strategies please contact david.burton@naturalengland.org.uk or post your comments under this Blog."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}