{
    "url": "https://deframedia.blog.gov.uk/2022/06/16/sussex-wine-to-receive-protected-status/",
    "title": "Sussex wine to receive protected status",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-06-16T11:21:49+01:00",
    "content": [
        {
            "text": "There has been widespread coverage including in the Sun, Times, Telegraph, Daily Mail, the i, Independent, BBC and Sussex Express of our announcement that Sussex wine will be designated as a UK Geographical Indication (GI)."
        },
        {
            "text": "The move, possible thanks to our departure from the European Union, will encompass Sussex sparkling, still and origin wines. GI status provides a guarantee to consumers that the product they are buying is the real thing and prevents imitation products."
        },
        {
            "text": "As part of the announcement, Food and Farming Minister Victoria Prentis was interviewed by BBC South East Today and BBC Radio Sussex, where she outlined how the move will help wine producers in the region grow their reputation both at home and internationally."
        },
        {
            "text": "The recognition means Sussex wine joins the family of Protected Designation of Origin (PDO) and Protected Geographical Indication (PGI) registered products from across the UK and beyond, and will help Sussex PDO wine producers communicate the excellence of their product to consumers. Sussex wine would be joining the family of special products which includes Scotch Whisky, Welsh Lamb and Herefordshire Cider."
        },
        {
            "text": "Sussex is home to Plumpton College who are training the next generation of UK wine growers, and this will further boost jobs, skills and the local economy. This follows on from the launch of the Government’s Food Strategy earlier this week, which highlighted the contribution of the food and drink sector to the levelling-up agenda and measures to encourage consumers to buy more local produce."
        },
        {
            "text": "Food and Farming Minister, Victoria Prentis, said: "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}