{
    "url": "https://prisonjobs.blog.gov.uk/2022/06/16/top-tips-for-completing-the-pqip-application-form/",
    "title": "Top tips for completing the PQiP application form",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "PQiP",
        "Probation",
        "Recruitment advice"
    ],
    "pub_date": "2022-06-16T13:55:30+01:00",
    "content": [
        {
            "text": "Are you looking to become a trainee probation officer but feel like applying can be quite long or daunting? Tracey Fuller, PQiP Resourcing Lead, has some helpful hints and tips to get you through the application form."
        },
        {
            "text": "The online application form is the first stage of the PQiP application process. Along with providing your personal information and details of your education and career, you will need to complete four behaviour-based questions and one experience question. Behaviour-based questions are looking for the actions and activities that people do which result in effective job performance."
        },
        {
            "text": "These questions are your first opportunity to showcase why you are a good fit for the programme. It is important you make the most of your answers as they will determine whether you progress in the application process."
        },
        {
            "text": "Providing a good answer that will get you the marks isn’t always easy and is something many applicants struggle with, particularly those applying to the Civil Service for the first time. Whilst your answers ultimately depend on your behaviours and experience, the below ‘top tips’ offer advice and simple techniques to help improve you answers."
        },
        {
            "text": "The Success Profiles Framework is used to assess you against a range of elements using different selection methods."
        },
        {
            "text": "This framework showcases all behaviours we look for in Civil Service staff. For PQiP, please view Level 2 definitions on page 3."
        },
        {
            "text": "You will be asked four behaviour questions during your application. For example, for the question on managing a quality service, take a look at the definition given in the framework; a really strong answer would demonstrate all of the points in this definition."
        },
        {
            "text": "Keep the Situation answer quite short as this is out of your control, focus on the Task, Action and Result. The STAR approach is commonly used in the Civil Service. If you are unfamiliar with this approach, take a look online as there is plenty of information about it."
        },
        {
            "text": "Each question requires a 250-word count answer. Make sure you keep within the word count but don’t go too far under either. Use the limit to your advantage as an opportunity to demonstrate evidence of what you did to showcase the behaviour/experience."
        },
        {
            "text": "Review your answer and see if you’re able to summarise it further and still get your point across."
        },
        {
            "text": "Avoid using jargon or acronyms that may not be understood by everyone."
        },
        {
            "text": "If you are struggling with your answers, ask your family, friends, or colleagues to see if they could help. They might tell you things about yourself that you hadn’t thought of."
        },
        {
            "text": "Think carefully about your answers and ensure you’re happy with the quality before you submit them. You may find it useful to draft your answers in a Word document before submitting the final versions."
        },
        {
            "text": "The experience question will ask you to provide an example of an experience of working with those whose lives are chaotic or have complex needs."
        },
        {
            "text": "Don’t forget that experience can also be skills gained from a non-work environment through voluntary work or a hobby. For example, voluntary work in a homeless shelter or working with those with drug issues, survivors of abuse, those with learning difficulties, etc."
        }
    ]
}