{
    "url": "https://ruralpayments.blog.gov.uk/2022/06/16/what-is-countryside-stewardship/",
    "title": "What is Countryside Stewardship?",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Rural Payments service"
    ],
    "pub_date": "2022-06-16T10:10:11+01:00",
    "content": [
        {
            "text": "In the second episode of The RPA Podcast Rozanne Kidd, RPA Director, talked about the Countryside Stewardship Mid Tier scheme. In this blog, we respond to the most frequently asked questions we get about Countryside Stewardship Mid Tier and Higher Tier schemes, and where to find further information."
        },
        {
            "text": "Why Countryside Stewardship?"
        },
        {
            "text": "Countryside Stewardship (CS) schemes provide funding to farmers and land managers to improve their local environment. CS supports a range of enhanced environmental outcomes from restoring wildlife habitats and creating woodlands, to managing flood risk."
        },
        {
            "text": "So, what’s the difference between Mid Tier and Higher Tier?"
        },
        {
            "text": "Whilst the environmental ambitions and outcomes are aligned, Mid Tier is a scheme for the majority of farmers and land managers to help them protect and enhance the environment. Higher Tier involves more complex environmental management schemes which offer significant benefits to high-priority areas."
        },
        {
            "text": "CS schemes such as Mid Tier and Higher Tier help to support the preservation of the countryside for future generations. By applying to create new habitats, for example, you will be helping enhance the natural environment through supporting biodiversity. This is all part of supporting Defra’s 25 Year Environment Plan ‘for our country to be the healthiest, most beautiful place in the world to live, work and bring up a family’."
        },
        {
            "text": "Do I have to be invited to apply for Higher Tier?"
        },
        {
            "text": "No. Higher Tier applications can be submitted by anyone who fits the eligibility criteria. Whilst this year’s application window for Higher Tier has now closed, you can contact Natural England to discuss applications for 2024 agreements."
        },
        {
            "text": "How do I apply for Mid Tier for 2023?"
        },
        {
            "text": "The application window for Mid Tier and Wildlife Offers is open until 29 July 2022. Applying online is easy and you can also track the status of your claims through the Rural Payments service. Our blog in February provides further information. Rozanne Kidd, Agricultural Transition Director at the RPA, commented,"
        },
        {
            "text": "What other grants fall under Countryside Stewardship?"
        },
        {
            "text": "Capital grants offer standalone capital items within three groups: boundaries, trees and orchard; water quality; and air quality. Applications for capital grants also opened on 8 February 2022 and, while there is no closing date at the moment, we do recommend applying early as we may need to close the scheme for this year depending on the volume of applications we receive."
        },
        {
            "text": "Other grants that fall under Countryside Stewardship include:"
        },
        {
            "text": "You can find out more about CS grants by reading our Countryside Stewardship: How To Apply guide on GOV.UK."
        },
        {
            "text": "Why do I need to provide so much evidence?"
        },
        {
            "text": "We hope the changes we’ve made to the application process will mean a quicker and more straightforward approach for farmers and land managers. However, we appreciate that participating in an agri-environment scheme is a significant commitment. The purpose of asking for evidence may vary depending on the scheme, but the overarching reason is to ensure public money is spent appropriately. We continue to work on making the evidence submission process as streamlined as possible."
        },
        {
            "text": "How does Countryside Stewardship work with new schemes?"
        },
        {
            "text": "Farmers and land managers who are participating in CS can also consider schemes like the Sustainable Farming Incentive (SFI) scheme. The SFI scheme will be open to farmers who are eligible for the Basic Payment Scheme and who already have an agreement under an existing agri-environment scheme - such as CS and Environmental Stewardship – provided the SFI standard they choose is compatible with their existing agreement and doesn’t result in them being paid twice for similar activities. For further information, please read the Sustainable Farming Incentive guidance on GOV.UK."
        },
        {
            "text": "As part of the Agricultural Transition Plan, Defra are also launching two other new schemes: Local Nature Recovery and Landscape Recovery. Local Nature Recovery will be a successor to CS - so that farmers can choose the right combination for their setting and preferences. Defra will publish more details on the full list of options later this year, alongside more details on scheme rules and proposed payment rates. But CS is a solid option for now and farmers really should regard the scheme as a bridge to Local Nature Recovery."
        },
        {
            "text": "Find out more about the Countryside Stewardship scheme by reading our Countryside Stewardship: How To Apply guide on GOV.UK along with the full guide to the key dates for all schemes and the new payment rates for Countryside Stewardship revenue options that apply to CS agreements from 1 January 2022."
        },
        {
            "text": "Follow us on social media for the latest updates and information:"
        }
    ]
}