{
    "url": "https://nda.blog.gov.uk/why-pride-month-is-still-so-important-blog-by-ross-donnan-nuclear-transport-solutions/",
    "title": "Ross Donnan, Nuclear Transport Solutions, talks about why Pride Month is still so important today",
    "authors": [
        "NDA group"
    ],
    "categories": [
        "diversity"
    ],
    "pub_date": "2022-06-16T09:00:19+01:00",
    "content": [
        {
            "text": "When discussing this opportunity to be vocal about LGBT+, Pride and my experiences, I had two choices."
        },
        {
            "text": "The first was to be informative and repeat some text from Google on what Pride means. The second was to use this platform to be brutally honest about how I got to the point where I feel comfortable enough to write this open letter and why Pride is so important."
        },
        {
            "heading": 2,
            "text": "Coming out as LGBT+"
        },
        {
            "text": "Coming out as LGBT+ is not easy. I’m 32 years old now and it had taken me until I was 27 to be honest with anyone including myself."
        },
        {
            "text": "Growing up, I realised I wasn’t the same as everyone else. I wasn’t interested in football, I didn’t care about playing sports like all my friends, I think I chose the path of reading books and watching TV to fill in the gaps and cover up any type of shortcomings in the ‘normal’ aspects of male society.​​​​​​​"
        },
        {
            "text": "Fast forward to my 20s and I’d had a couple of girlfriends. When I broke up with my last girlfriend, I eventually came out to my friends and family. It was intense to say the least. I had all these embedded negative thoughts buried in my brain from passing comments during the early years of my life."
        },
        {
            "text": "“Oh my god that’s so gay” “oh yeah, do you know him he’s gay eh, sick”, “how can anyone be gay? It’s disgusting”"
        },
        {
            "text": "Although these were mostly passing comments from friends and family, to me, they meant everything."
        },
        {
            "text": "The response from my family was very supportive and I think they’d always known. My dad in particular said “well, we knew this didn’t we Anne (my mum)”."
        },
        {
            "text": "​​​​​​​I can’t help but think why I allowed so much time and energy being so concerned about what other people thought of me. What were those 17 years of worrying all about?"
        },
        {
            "text": "What I quickly realised was that nobody cares who you like or don’t like. All that matters is that you are happy."
        },
        {
            "text": "However, being LGBT+ in this world is not easy. Coming out is even harder. From religious preconceptions to uneducated upbringings mixed with small-minded views and opinions, it’s little wonder there has been so many sad endings for many LGBT+ people."
        },
        {
            "heading": 2,
            "text": "Pride Month"
        },
        {
            "text": "Pride is important to help show the people who are confused about their sexuality, because of these preconceived ideas that it’s normal to have these feelings towards someone of the same sex. That it’s okay to love and have feelings towards someone of the same sex. That holding hands in public with someone you love shouldn’t matter whether you’re straight, gay, bisexual, transgender or even alien."
        },
        {
            "text": "All that matters is you, how you feel, who you are and who you love."
        },
        {
            "text": "But we still have a long way to go as a society. We know that there is still stigma which sometimes leads to bias, and even worse hate crimes, against the LGBT+ community today. Pride acts as a reminder of the importance of equality throughout the world, as well as helping to change negative perceptions and views."
        },
        {
            "text": "Although this blog was not easy for me to write, being so public and personal, I’m happy that I've been able to get to this point and been allowed to be so vocal about the difficulties of what it means to identify as LGBT+. If this blog, at the very least educates one person, or brings comfort to someone who is struggling as I was once, then it has been worth it."
        },
        {
            "text": "Remember, you can’t achieve greatness or happiness by being dishonest to yourself. Be true to yourself. You will be much, much happier. I promise"
        }
    ]
}