{
    "url": "https://socialcare.blog.gov.uk/2021/06/22/care-home-open-week-preview-beacons-of-hope/",
    "title": "Care Home Open Week preview: Beacons of hope",
    "authors": [
        "Mitesh Dhanak"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "coronavirus",
        "Events"
    ],
    "pub_date": "2021-06-22T10:18:09+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Maintaining tradition in trying times"
        },
        {
            "text": "For almost a decade, care home open days have seen care homes all over the country open their doors to families, friends and local communities."
        },
        {
            "text": "This year’s event, which takes place across a week (28 June - 4 July), has particular significance, providing an opportunity to reunite care homes with their local communities, while celebrating the incredible care colleagues who have remained on the frontline throughout the pandemic."
        },
        {
            "text": "The arrival of the coronavirus pandemic at the start of 2020 hit the nation unaware. It highlighted the resilience and selfless contribution of the social care sector and the frailty of the people we care for in our homes."
        },
        {
            "text": "For care home residents, being isolated from friends and loved ones has been incredibly tough. For the elderly, who should be focused on quality of life, on enjoying old memories and making new ones, the pandemic has sadly created both fear and isolation, with care homes working hard to fight against a wave of infections hitting vulnerable residents."
        },
        {
            "text": "At Precious Homes, where we support autistic people and those with complex needs, the impact has been immense. With many of the people we support thriving on routine and familiarity, the disruption, uncertainty and change of pace triggered huge levels of anxiety."
        },
        {
            "heading": 2,
            "text": "In praise of resilient care colleagues"
        },
        {
            "text": "Despite all of this, our amazing support staff took all this in their stride, guiding people through challenging times with a commitment and creativity that never ceased to amaze me. In addition to accommodating new guidelines and policies, staff were given the almost impossible task of striking a balance between protecting vulnerable residents and minimising the adverse outcomes of isolation."
        },
        {
            "text": "They also had the unenviable task of adjusting to the rapid reconfiguration - or ceasing, in some cases - of external support services they would normally depend upon for support. All of this while dealing with the impact of COVID-19 in their own lives."
        },
        {
            "text": "As lockdown started to ease, the team at Championing Social Care began the planning process for Care Home Open Week."
        },
        {
            "text": "With restrictions still in place, and COVID-19 safety absolutely paramount, the team approached the event with cautious excitement."
        },
        {
            "text": "For us, making the event a success has never been more important. It represents a beacon of hope for us all. These are welcome, but tentative steps towards ‘normality,’ an opportunity to encourage social interaction and community cohesion so sadly lacking from everyone’s lives."
        },
        {
            "text": "We want to show the wider community what goes on behind the doors of their local care home, introduce them to some of the truly amazing characters who live and work there and celebrate the increasingly confident hope an end to lockdown is finally in sight."
        },
        {
            "text": "It is fair to say the planning hasn’t been without its hurdles. Care home managers have been tasked with organising COVID-19 risk assessments, with the majority of events now taking place virtually."
        },
        {
            "text": "Those who had planned to invite family and friends for outdoor BBQs and garden parties have been forced to revisit plans, following the recent extension of lockdown until mid-July."
        },
        {
            "heading": 2,
            "text": "Reconnecting communities"
        },
        {
            "text": "As has become the norm during the pandemic, we’ve had to adjust to changing and challenging circumstances, but our enthusiasm has never waned. The pandemic has forced people to live in silos and we firmly believe putting care homes back at the heart of communities can help the social care sector deliver better outcomes and enrich all our lives."
        },
        {
            "text": "As well as allowing care homes to showcase what they have to offer, Care Home Open Week is a great opportunity for individuals considering careers in the sector."
        },
        {
            "text": "They can discover, first hand, how rewarding working in care can be and how building a career is based as much on passion, shared values and vocation, as it is experience, skills and qualifications."
        },
        {
            "text": "Click here for more information about Care Home Open Week."
        }
    ]
}