{
    "url": "https://deframedia.blog.gov.uk/2021/06/22/coverage-of-amazon-waste-allegations/",
    "title": "Coverage of Amazon waste allegations",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-06-22T11:00:16+01:00",
    "content": [
        {
            "text": "There has been widespread coverage this morning of allegations that Amazon has been sending millions of unsold products to recycling and incineration, including electronics, books and face masks."
        },
        {
            "text": "Following an ITV News investigation which was aired yesterday, further coverage has landed today in the Daily Mail, The Daily Telegraph, The Times, the Metro and the Scottish Sun."
        },
        {
            "text": "It’s imperative that we end the “throwaway culture” and recycle more of our waste - and by 2035 we want to be recycling at least 65% of our municipal waste with a maximum of 10% going to landfill."
        },
        {
            "text": "When handling or disposing of waste, businesses have a legal duty to adhere to the waste hierarchy. This means businesses should firstly seek to prevent waste (via donations for example), and if that is not feasible, then they should try to prepare the waste for re-use, or failing that, for recycling. Only if none of these options are viable should waste be sent to energy-recovery or landfill."
        },
        {
            "text": "Failure to meet the legal obligation to take all reasonable steps to apply the waste hierarchy on the transfer of waste can lead to enforcement action."
        },
        {
            "text": "Current regulations require sellers of electrical equipment to offer a free take-back service for waste electricals or join the Distributor Takeback Scheme to help fund local authority recycling services, and we are reviewing the regulations to see how we make sure all retailers – including online marketplaces - take greater responsibility for electricals."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "More widely, through our 25 Year Environment Plan, we are committed to leaving the environment in a better state than we inherited it. We will help do this by transforming the way we use our waste and resources, and by 2042 we want to have eliminated all avoidable plastic waste, with all avoidable waste being stopped by 2050."
        },
        {
            "text": "As also set out in our landmark Resources and Waste Strategy, we will go further and faster to reduce, reuse, and recycle more of our waste and resources, and leave the environment in a better state than we found it for future generations."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}