{
    "url": "https://socialworkers.blog.gov.uk/2021/06/22/expanding-the-teaching-partnerships-programme-creating-the-right-environments-for-excellent-practice-and-innovation/",
    "title": "Expanding the Teaching Partnerships Programme: Creating the right environments for excellent practice and innovation",
    "authors": [
        "Rebecca Hewitt",
        "Colin Gale",
        "Dorothy Smith",
        "Liz Maslen"
    ],
    "categories": [
        "CPD",
        "Social Work Students"
    ],
    "pub_date": "2021-06-22T11:23:24+01:00",
    "content": [
        {
            "heading": 4,
            "text": "The Department for Education (DfE) is expanding the Social Work Teaching Partnership Programme, inviting local authorities (LAs) and universities, not already involved in the programme, to apply to take part for 2021/2022."
        },
        {
            "heading": 4,
            "text": "The programme aims to strengthen collaborations between LAs and universities to ensure a steady stream of high-calibre social workers to the frontline, working with children, families and adults."
        },
        {
            "heading": 4,
            "text": "We hear from 4 of the 23 Teaching Partnerships (TPs) already running successfully. They share the aims of their programmes and advice for any LAs considering applying."
        },
        {
            "heading": 2,
            "text": "Rebecca Hewitt, Senior Business Partner, Organisational and Workforce Development, Leeds Council"
        },
        {
            "text": "The Leeds & Wakefield Social Work Teaching Partnership was officially formed in November 2016 and over the last 5 years, we’ve taken a flexible approach to governance to ensure we are ready for sustainability and meeting the national, regional and local contexts."
        },
        {
            "heading": 3,
            "text": "Responding to the pandemic"
        },
        {
            "text": "When COVID-19 hit in March 2020, our immediate response was to support students on placement. We created new ways of working with more flexible approaches; meetings were more ad hoc and became virtual, and CPD courses were paused before also becoming virtual. Our placement solutions ensured continuity for final year students and supported the development of an alternative curriculum and virtual admissions."
        },
        {
            "text": "There have been challenges but, on the whole, the pandemic has strengthened partner relationships. Placements this year continued as “business as usual” and we will be building on our initial achievements to further strengthen and embed a robust, sustainable model for future social work."
        },
        {
            "heading": 4,
            "text": "My tips for anyone considering joining the programme:"
        },
        {
            "heading": 2,
            "text": "Colin Gale, Teaching Partnership Programme Manager, London Borough of Havering"
        },
        {
            "text": "The North East London Social Work Teaching Partnership (NELTP) emerged from an established sub regional grouping of LAs and universities who had worked together across children’s and adult services to coordinate practice education, placements and CPD."
        },
        {
            "heading": 3,
            "text": "Forecasting the future workforce"
        },
        {
            "text": "One distinctive aspect of our partnership work has been in the area of workforce and labour market planning. We developed a model for forecasting future workforce requirements to:"
        },
        {
            "text": "Our analytics tools generate visualisations mapped against different workforce characteristics, such as adult and children’s workforce, LA, gender and ethnicity, which allows us to consider disparities in career progression trends in relation to these categories."
        },
        {
            "heading": 3,
            "text": "When starting out as a Teaching Partnership, concentrate resources"
        },
        {
            "text": "We found more success concentrating resources in a central support hub, rather than distributing roles across the partnership. For example, the appointment of support staff with a range of experience and expertise has been key, including:"
        },
        {
            "text": "In the future, we would consider committing more resources to professional development programmes; there is potential to create a greater level of focus on areas such as management and leadership."
        },
        {
            "heading": 2,
            "text": "Dorothy Smith, Senior Manager, Quality Assurance and Involvement Team, Sheffield City Council"
        },
        {
            "text": "The South Yorkshire Teaching Partnership (SYTP) was one of the first TPs to be created in 2015. Back then our theme was, and still is today, to provide the “purest\" statutory placements for all our students so that they are ready to practise in frontline services."
        },
        {
            "heading": 3,
            "text": "Our partnership feels like one big organisation"
        },
        {
            "text": "The SYTP partnership feels like one big organisation, with representatives from our LAs and universities working together to train, recruit and retain high-calibre students."
        },
        {
            "text": "Attending monthly strategic stakeholder board meetings, we discuss CPD requirements and innovative practice in support of the changing needs of the social work profession. Our focus is to support them on a career pathway for the future, developing the skills they need to work effectively in frontline statutory services. We do this through ongoing research with social workers, led by the universities, placing frontline practitioners at the heart of the rigorous admissions process as well as teaching, provision of student workshops as an addition to the curriculum and securing guaranteed interviews for social work roles."
        },
        {
            "text": "To any LA starting out on the TP programme, my advice would be to build up good working relationships with your partner universities. Understanding each other’s roles and service demands will allow you to realise your potential together."
        },
        {
            "heading": 2,
            "text": "Liz Maslen, Children’s Workforce Development Manager & D2N2 Teaching Partnership Project Manager, Nottinghamshire County Council"
        },
        {
            "text": "The D2N2 Teaching Partnership was set up in the East Midlands in November 2016, with a focus on a holistic approach that recognises the importance of:"
        },
        {
            "heading": 3,
            "text": "Benefitting social work practitioners and university academics"
        },
        {
            "text": "We have a small, funded project team who support the TP’s activities, and an enthusiastic cohort of around 50 social work and academic managers. Our managers give their time “in kind” to this work, keeping us sustainable and in touch with our frontline workforce and students."
        },
        {
            "text": "Much of our work is reciprocal, with our social work practitioners providing input to our university courses to help students understand and prepare for practice. Likewise, our academic staff engage with frontline practitioners to keep one foot embedded at the frontline, which ensures they can build in a “real world” perspective between theory and practice."
        },
        {
            "heading": 3,
            "text": "A genuine appetite to stick together and work as a collective"
        },
        {
            "text": "Prior to accessing our DfE funding, as individual organisations, we didn’t really have the resources to facilitate any grand ambitions that we might have had about improving social work education and training. However, with the TP Programme funds we’ve been able to take on a small project team with a focus specifically on key workstreams, facilitate better engagement with our service user organisations and through both, provide the voice of lived experience within our social work training."
        },
        {
            "text": "Much of the work that we accomplished in our first 4 years is now “business as usual”. It is embedded into our everyday practice and supported by our governance groups and hubs on an on-going basis. We have a roadmap of activity through to March 2024 with a smaller project team, and new ambitions for the coming year."
        }
    ]
}