{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/22/gse-opportunities-systems-thinking-level-7-apprenticeship/",
    "title": "GSE Opportunities: Systems Thinking Level 7 Apprenticeship",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-06-22T11:18:12+01:00",
    "content": [
        {
            "text": "A new two-year, blended approach apprenticeship starting in January 2022 is being delivered by the University of Exeter. The apprenticeship has been designed for the public service to improve the quality and use of evidence-based scientific advice to government, and upon successful completion candidates will be awarded an MSc in Systems Thinking in the Public Sector. This programme will help you to understand how systems thinking methods can complement evidence-based approaches and are integral to the success of policy making in modern government. These skills are essential learning for generalists, policy makers and technical specialists alike."
        },
        {
            "text": "By undertaking this scheme, you can :"
        },
        {
            "text": "Sir Patrick Vallance, the Government Chief Scientific Advisor, fully supports this opportunity, saying :"
        },
        {
            "text": "This apprenticeship will provide you with an awareness of applying systems approaches to complex multi-partner problems; and through two strategic problem focused work-based projects, provide you with an opportunity to deliver impact within your department and to develop long-lasting, collaborative relationships across government."
        },
        {
            "text": "To help ensure the real-world problems apprentices solve will be as impactful as possible, the GSE Profession will be approaching senior scientists, engineers and policymakers across government to identify real world, cross departmental problems for apprentices to tackle using their new system thinking skills."
        },
        {
            "text": "Applications will be open in October and November 2021 for a January 2022 start date. If you are interested in applying, please contact your departmental apprenticeship lead in the first instance. You can find more specific course information here."
        }
    ]
}