{
    "url": "https://dwpdigital.blog.gov.uk/2021/06/22/hack2work-help-dwp-customers-return-to-employment-following-the-pandemic/",
    "title": "Hack2Work: Help DWP customers return to employment following the pandemic",
    "authors": [
        "Rachel Poole, DWP Digital, Digital Engagement team"
    ],
    "categories": [
        "DWP Digital",
        "Hacks"
    ],
    "pub_date": "2021-06-22T08:27:02+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Return of the hack"
        },
        {
            "text": "Our next DWP Digital hack, Hack2Work, will take place from Tuesday 6 July over 3 days. This is our 5th digital hack, but in line with social distancing, our first online. And we’re excited about the possibilities this opens up. Registration is open until Wednesday 23 June, so make sure you don’t miss out and sign up for your place now."
        },
        {
            "text": "The pandemic has had a major impact on the UK jobs market, resulting in millions of people being left unemployed. So this year’s hack will focus on how we can help DWP customers return to employment following the coronavirus (COVID-19) pandemic."
        },
        {
            "heading": 2,
            "text": "Meet our sponsors"
        },
        {
            "text": "Using innovation and new technologies, hackers will be invited to work on solutions that could help jobseekers identify and access employment provision. And this year we’ve got lots of support from our tech sponsors!"
        },
        {
            "text": "Read on to find out why they’re joining us on our hack and what they hope we can achieve together."
        },
        {
            "heading": 2,
            "text": "MongoDB"
        },
        {
            "text": "Nick Ophoff, Account Director Government, MongoDB, said:"
        },
        {
            "text": "“After partnering with DWP for almost a decade, MongoDB is thrilled to sponsor this year’s Hack2Work. Since the onset of COVID-19, we have seen data and technology provide new opportunities to help solve society's most challenging obstacles. This hackathon will build on that momentum and gather teams from across the country, to build solutions that help the UK get back to work."
        },
        {
            "text": "“MongoDB is the leading modern, general purpose database platform. It’s designed to unleash the power of software and data for developers and the applications they build. Our database platform has been downloaded over 175 million times and there have been more than 1.5 million MongoDB University registrations."
        },
        {
            "text": " "
        },
        {
            "text": "“At the hack, you’ll have the chance to collaborate with peers and learn from MongoDB experts how to create modern applications in an ever-changing world. Our workshop will introduce the key concepts of MongoDB and our database-as-a-service, MongoDB Atlas. We believe that making data easy to work with gives people the opportunity to free their genius and create something world-changing. We look forward to doing exactly that with hackers at Hack2Work!”"
        },
        {
            "heading": 2,
            "text": "Opencast "
        },
        {
            "text": "Sam Manson, client experience director, Opencast, said:"
        },
        {
            "text": "“We’ve worked at the sharp end of the digital response to the pandemic, in partnership with government agencies including DWP  and NHS BSA, to deliver the services and support that citizens need."
        },
        {
            "text": "“Opencast is a growing team of specialists, with a range of digital consultancy and tech services, and we’re proud to be supporting and joining the Hack2Work."
        },
        {
            "text": "“We'll be adding our technical expertise and sector knowledge as part of the hack effort to boost post-pandemic employment opportunities through digital innovation. We want to help the hack to develop tools that have a real impact on enabling job seekers to identify and access work."
        },
        {
            "text": "“We’ll be running a workshop that will share some of the lessons from a recent project with DWP, where we helped design a service to support and influence the decision-making of UK employers to prevent avoidable health-related job loss."
        },
        {
            "text": "“We're committed to sharing what we’re doing whenever we can and that’s why we’re so keen to join this hack effort. We’re excited about the possibilities that technology can open up for helping citizens return to work.”"
        },
        {
            "heading": 2,
            "text": "Red Hat"
        },
        {
            "text": "Mustafa Musaji, DWP aligned Solutions Architect, Red Hat, said:"
        },
        {
            "text": "“Red Hat are delighted to be supporting Hack2Work. We hope to enable teams to create and foster innovative ideas. By using Red Hat software, we hope teams will take an idea and turn it into a reality, ultimately providing solutions that can help citizens in the UK back to work."
        },
        {
            "text": "“Red Hat is a world leading provider of enterprise open source software solutions, using a community-powered approach to deliver reliable and high-performing Linux, hybrid cloud, container and Kubernetes technologies. During the hack, I’ll be available for technical support along with a couple of other Red Hat specialists. The team will be on-hand to help hackers with any questions they may have around cloud-native application development, container technologies and automation. Hackers will also have the option to use a Red Hat OpenShift cluster to support them."
        },
        {
            "text": "“The hack is a fantastic way to use your skills and create a solution that supports those who have been adversely affected by the recent pandemic and are looking for employment.”"
        },
        {
            "heading": 2,
            "text": "Scott Logic"
        },
        {
            "text": "Rob Smith, Client Relationships Director, Scott Logic"
        },
        {
            "text": "“Scott Logic is delighted to be involved in DWP’s hackathon, both as an active contributor and sponsor. As a technology consultancy that specialises in solving problems in complex organisations, we’ve been working with DWP for the last few years to help extend and improve the services it provides to its customers. We see the hackathon as a natural extension of this work. Having a positive impact on society has always been important to Scott Logic."
        },
        {
            "text": "With the increase in claims to DWP services, the potential value of technical innovation to address their needs cannot be overstated. It’s not often that technical specialists get to work directly and intensively with customers, and the hackathon provides this opportunity. It should be a hotbed of innovation, and we’re looking forward to seeing the value it propagates over the coming months. The Scott Logic team will be bringing a wealth of experience and skills in data science, open APIs and service design which we are excited to share."
        },
        {
            "text": "After a couple of long days of hard work, the hackathon teams are going to need a well-earned rest, and Scott Logic is delighted to be sponsoring the evening entertainment on the second night. We think the magician, Maddox Dixon, will be just what’s required – it should be a magical event all-round!”"
        },
        {
            "heading": 2,
            "text": "IBM"
        },
        {
            "text": "Erfan Isa, Public Sector Client Partner, IBM Global Business Services, said:"
        },
        {
            "text": "“IBM GBS is the consulting arm of IBM and is a leader in its field of delivering solutions that help both public and private sector organisations change the way people work and live. We co-innovate and co-create with clients and we help them put the human experience, be that citizen, customer or employee, at the centre of their business and their transformative thinking."
        },
        {
            "text": "“The IBM technical workshop will focus on design thinking, an innovative problem-solving process that fosters creativity and innovation. It helps teams rapidly bring human problems into focus in a way that enables them to ideate, create and iterate solutions that effectively tackle the core human problems. The learnings in this workshop will help teams better analyse, understand and solve the core challenges being considered in this hackathon."
        },
        {
            "text": "“IBM specialises in defining and building open source solutions that use the power of hybrid cloud and Artificial Intelligence to deliver human experience and business transformation outcomes at scale. At the hack we will be focusing on the design thinking and human experience design elements of the problem statement, providing coaching and guidance on how to analyse and capture problem statements empathetically and how to rapidly define and iterate solutions to solve them."
        },
        {
            "text": "“Join us at Hack2Work to create a fun learning environment for all involved and to help surface some good ideas that can be taken forward as viable solutions to the underlying problem statement. It’s a great way to meet new people and experientially develop new skills as well as having an opportunity to share and direct the skills and knowledge that you have towards a good cause.”"
        },
        {
            "heading": 2,
            "text": "Kong"
        },
        {
            "text": "Simon Wolfenden, UK Government Account Director, Kong, said:"
        },
        {
            "text": "“Kong prides itself as a contributor to social initiatives and we’re delighted to be able to collaborate with DWP at Hack2Work, to help people find a return to work. We have experience in helping organisations make data available via APIs that developers need to create innovative citizen experiences."
        },
        {
            "text": "“Kong provides products to help organisations connect APIs and services across their entire ecosystem with high levels of security, resilience, performance and scale. Organisations are striving to create end-to-end cloud connectivity to allow them to rapidly innovate and Kong provides the technology to enable this."
        },
        {
            "text": "“Melissa and Min will be at the hack. They have extensive experience of working with large organisations to understand the value of APIs and microservices, including modern ways of working and the technology required to enable innovation and the organisational changes required."
        },
        {
            "text": "“83% of web traffic is through APIs, and digitising business processes to provide enriched, joined up citizen experiences depends on them.  In our increasingly distributed IT landscapes however, building, managing, and consuming APIs gets harder and harder to do properly.  In our workshop we’ll explore how DWP use Kong to make it easier for engineers to innovate and improve the lives of UK citizens."
        },
        {
            "text": "“People should come to Hack2Work because they’ll be helping to create solutions to the return to work challenge. On top of that, hackathons are fun and a great place to learn about technology trends and innovation.”"
        },
        {
            "heading": 2,
            "text": "Join us at the hack"
        },
        {
            "text": "We’ll also be working first hand with jobcentre colleagues, policy colleagues and employment organisations to share insights and identify gaps to inspire our hackers. And that could ultimately help jobseekers to find work."
        },
        {
            "text": "This is a fantastic opportunity to engage with us on the biggest problem currently affecting society. And, to work with a range of creative minds to explore how technology and innovation can be used to support people looking for work."
        }
    ]
}