{
    "url": "https://civilservice.blog.gov.uk/2021/06/22/happy-world-humanist-day/",
    "title": "Happy World Humanist Day",
    "authors": [
        "Liz Lutgendorff, Liz Lutgendorff, Lead Insight and Analysis Advisor, Government Digital Service"
    ],
    "categories": [
        "A great place to work"
    ],
    "pub_date": "2021-06-22T08:32:34+00:00",
    "content": [
        {
            "text": "What is humanism? Humanists hold a naturalistic worldview. To mark World Humanist Day on 21 June, Liz Lutgendorff  sheds light on what it means to live without following a traditional religion."
        },
        {
            "text": "Even though non-religious people make up more than half the population in the UK, sometimes our values are misunderstood or seen in a negative light. "
        },
        {
            "text": "It’s fair to say that many Brits know little about humanism. Perhaps you’ve attended a humanist wedding or funeral, which will feature more personal reflections on someone’s life, including more poetry, literature and secular music rather than sermons and hymns."
        },
        {
            "text": "Humanism isn't new"
        },
        {
            "text": "In a nutshell, Humanists believe that people have one life, and as a result, they value science and reason to explain the world. "
        },
        {
            "text": "But humanism isn’t a new fad.  Far from it."
        },
        {
            "text": "In fact, the history of humanism goes back hundreds of years (or thousands, if you read classicist Tim Whitmarsh) when sadly non-religious people were often viewed negatively. This was reflected by the pejorative words to describe non-religious individuals such as ‘infidel’ or ‘blasphemer’. Yet back in the 19th century, the non-religious would adopt these names as a badge of  pride. They would often be used ironically to advertise events or in publications as non-religious people campaigned for some important rights that we today take for granted."
        },
        {
            "text": "For example, it wasn’t until 1888 that it was possible to take a seat in Parliament or testify in court without swearing an oath to God as a non-religious person. You could still affirm before then if your religious belief didn’t allow you to swear oaths. Most famously, this bar prevented the Northampton MP Charles Bradlaugh from taking his seat after he was elected in 1880."
        },
        {
            "text": "In 2018 I completed a PhD in humanist and secular history. My thesis focussed on what happened after these battles had been won. The conventional wisdom was that the humanist and secular movements went into decline. "
        },
        {
            "text": "Death penalty"
        },
        {
            "text": "However my research instead revealed that it was in the early 20th century that humanists went on to campaign on a range of seminal issues of the day, such the death penalty, women’s right to vote and bodily autonomy, and in favour of peace and internationalism."
        },
        {
            "text": "There were also more humanist MPs, like Ernest Thurtle, J M Robertson and Henry Snell who had a much easier time entering parliament than Bradlaugh.  "
        },
        {
            "text": "Inalienable human rights"
        },
        {
            "text": "This evolution is neatly captured in the Amsterdam declaration, which articulates a positive view of what humanism means, based on the idea that we all have inalienable human rights. And although we’re not imprisoned for our beliefs in this country anymore, that’s not the same everywhere."
        },
        {
            "text": "For me, humanism means:"
        },
        {
            "text": "The Humanist in Government network aims to ensure that when non-religious colleagues come across descriptions of their deeply held personal convictions in their departments, it’s not one of negative stereotyping. "
        },
        {
            "text": "Instead, we want atheists, humanists, secularists or however someone might describe their worldview to know that their departments and the Civil Service understands and values their perspectives. And just like other networks, we  just wanted to meet other people like us at work."
        },
        {
            "text": "Integrity and impartiality"
        },
        {
            "text": "The good news is, we find it easy to be humanists in the Civil Service as the values of integrity and impartiality align so closely with our worldview. We believe that it takes human ingenuity and creativity to solve the most difficult problems, and often those problems need to be tackled carefully by civil servants. "
        }
    ]
}