{
    "url": "https://lifeathmrc.blog.gov.uk/2021/06/22/pride-at-hmrc-harrys-story/",
    "title": "Pride at HMRC, Harry's Story",
    "authors": [
        "Mems Bangura"
    ],
    "categories": [
        "General",
        "Inclusion"
    ],
    "pub_date": "2021-06-22T12:25:42+00:00",
    "content": [
        {
            "text": "We celebrate Pride Month every June to recognise the progress made for Lesbian, Gay, Bisexual and Transgender (LGBT+) people, as well as marking the anniversary of the Stonewall Riots. In June of 1969, a police raid of the Stonewall Inn, a gay club in New York, resulted in a six-day movement led by Marsha P. Johnson, demanding the LGBT+ community were given a safe space to be open with their sexual orientation. The following year, the very first Pride Month was established and it is now observed annually by LGBT+ people and allies globally."
        },
        {
            "text": "We’re committed to championing our people and their voices, so this year, we’re focusing on the lived experiences of our LGBT employees. Harry Price is a Team Leader within Customer Services, who has worked for us for almost 6 years and is an LGBT+ champion at our organisation. We spoke to Harry to gain an understanding of his experiences, as a gay person, working at HMRC and what Pride really means to him."
        },
        {
            "heading": 2,
            "text": "Working at HMRC while LGBT+  "
        },
        {
            "text": "HMRC is a really diverse workforce in lots of different respects. I’ve seen support for various forms of diversity, including sexual orientation and different genders and it’s fantastic. The big initiative I’m aware of at HMRC is called the Prism network. It’s a network for anyone that identifies with LGBT+ and allies too. A prism is not only symbolic but is also representative of the network; it is something with many different sides, as well as the rainbow prisms form when refracting the light. The network brings attention to work related matters impacted by LGBT+ issues. It hosts events with speakers and stalls to let you know what’s happening within the community throughout the year. For instance, across June, they’ve hosted a series of virtual events such as HIV Awareness and Visibility, and positive stories from the LGBT+ Network."
        },
        {
            "text": "Part of being a Prism member means you wear a rainbow lanyard and it shows people that you are a visible role model from the LGBT+ community or are an ally passionate about creating and maintaining an inclusive organisation.  Lots of people wear them. From my own experience people who are trans, different sexual orientations and allies wear them and it’s a really interesting and gratifying experience for me."
        },
        {
            "text": "I’ve been lucky to find myself in places of work where I’ve been supported and HMRC is one of them. I’ve been able to hold seminars on LGBT+ and homophobia in the workplace. One of my favourite things about working here is the opportunity to learn about different people. I really enjoy getting to know people different from myself in life and in the workplace."
        },
        {
            "heading": 2,
            "text": "What does Pride mean to you?"
        },
        {
            "text": "For me, it’s about history, so don’t take for granted how we have it now because it wasn’t that long ago that we didn’t have equal opportunities and now as we’re seeing things progress, we need to know we’re all different but we’re all people. I think it’s important to see it’s not an exclusive party, it’s an opportunity to bring people together and show support."
        },
        {
            "text": "My favourite part of pride this year has been representing the underrepresented. It has been about evolving and standing up for the smaller groups within the community. I’ve tried to champion things for smaller parts of the community such as LGBT+ people of ethnic minorities, that’s been a big focus for me."
        },
        {
            "heading": 2,
            "text": "How can people show support for the LGBT+ community? "
        },
        {
            "text": "Don’t shy away from LGBT+ or Pride. People sometimes get worried they might offend someone so don’t be afraid to ask questions to learn more. Things are not as linear as people may assume, it’s important to be open minded and continue to be eager to develop and evolve."
        },
        {
            "text": "Don’t shy away from the difficult questions. It’s about being part of these conversations and being part of the world. Let’s all help to continue to develop a culture of acceptance and mutual respect."
        }
    ]
}