{
    "url": "https://queensawards.blog.gov.uk/2021/06/22/queens-award-for-enterprise-double-winner/",
    "title": "Queen’s Award for Enterprise – Double Winner!",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Winners"
    ],
    "pub_date": "2021-06-22T16:12:03+01:00",
    "content": [
        {
            "text": "Pi has been awarded 2 Queen’s Awards for Enterprise, one for International Trade and the other for Innovation."
        },
        {
            "heading": 2,
            "text": "Queen’s Award for Enterprise – International Trade"
        },
        {
            "text": "At Pi we don’t have ‘customers’ and ‘export customers’, we just have customers. Every customer who buys our products and sensors is special to us, but today, 29 April 2021, we are particularly celebrating our customers who live and work outside the United Kingdom."
        },
        {
            "text": "Why? Because today, Process Instruments (UK) Ltd. has been awarded the Queen’s Award for Enterprise – International Trade. Every year, the Queen’s Awards for Enterprise office in London evaluates companies in the UK who have shown particularly merit worthy growth in sales to other countries and Pi has been selected to receive this award which it can use in its own marketing for the next 5 years."
        },
        {
            "heading": 2,
            "text": "Queen’s Award for Enterprise – Innovation – Goes to CRIUS®!"
        },
        {
            "text": "Pi has been developing its CRIUS® controller since 2005. There have been 3 changes in form and hardware, 9 smaller changes in hardware and more than 50 firmware releases in that time culminating in the CRIUS®4.0, possibly the world’s most advanced water quality instrument controller. With more than 500,000 lines of code, the CRIUS® is leading the field in capability, from PID control algorithms to all MQTT comms packages and world leading remote access solutions."
        },
        {
            "text": "Every year the Queen’s representatives evaluate innovations that are truly worthy of the Queen’s Award for Enterprise (Innovation) and the CRIUS® is one of those few innovations."
        },
        {
            "text": " "
        },
        {
            "text": "The Queen’s Awards are the UK’s most coveted business awards as they are awarded by Her Majesty, The Queen to businesses that are most deserving of recognition."
        },
        {
            "text": "Process Instruments is 1 of just 5 companies in 2021 to be awarded more than one Queen’s Award and have earned the right to display the Queen’s Awards logos for 5 years."
        },
        {
            "text": "Being awarded both awards in a single year is especially pleasing. Managing Director, Mike Riding said:"
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about Process Instruments on their website here: www.processinstruments.co.uk"
        },
        {
            "text": "Or visit The Queen's Awards website to apply: https://www.gov.uk/queens-awards-for-enterprise"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}