{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/06/22/retail-banking-how-weve-made-switching-easier/",
    "title": "Retail banking: how we’ve made switching easier",
    "authors": [
        "Peter Hill"
    ],
    "categories": [
        "Consumer protection",
        "Markets",
        "Remedies"
    ],
    "pub_date": "2021-06-22T10:11:32+01:00",
    "content": [
        {
            "text": "There are benefits to switching your current account to another bank or building society, such as saving you money on interest rates or having access to your money in the way which suits you best."
        },
        {
            "text": "However, people are often put off switching for fear that it could be a complicated and frustrating experience and might risk your payments not arriving or being made on time. Will it be hard to decide which bank to switch to, or which type of current account is right for you? Will there be a lot of admin, phone calls and paperwork involved? Or will it be more difficult to access financial services such as loans? These are all questions you could be asking yourself."
        },
        {
            "text": "At the Competition and Markets Authority (CMA), we’ve required banks to make the process of switching smoother and easier, so that you can get the benefits without the added hassle. Read on to find out more on the advantages switching could give you and the CMA’s requirements on banks to make the process easier."
        },
        {
            "heading": 2,
            "text": "The benefits of switching"
        },
        {
            "text": "The obvious benefit to switching to a different bank is that it could save you money, as different banks have different interest rates depending on how you use your account. But there are also other benefits to switching."
        },
        {
            "text": "For example, banks differ in the range of services and packages they offer, so there might be a combination offered by an alternative bank which could better suit your spending patterns and banking needs."
        },
        {
            "text": "In addition to benefits to individuals, there are also other benefits to all of us. Active switching drives competition between banks so that they try harder to come up with innovative, good value products and top-quality services that match your needs. This increases the choice and value available to you and makes switching even easier as banks compete to attract customers."
        },
        {
            "heading": 2,
            "text": "What the CMA has done to make switching easier"
        },
        {
            "text": "The CMA has introduced requirements on banks to make switching simpler and easier. The main ones in this area are designed to:"
        },
        {
            "heading": 3,
            "text": "Helping you choose who to bank with"
        },
        {
            "text": "To help you make the decision on which bank to select, we require banks to publish information on how good the service they provide is in comparison with other banks. This is called Service Quality Indicators (SQIs), which is a simple customer satisfaction report which the banks publish. These are published separately for personal current accounts and business current accounts and it should be easy to find SQIs on bank and building society websites and displayed in branches."
        },
        {
            "text": "We also introduced Open Banking in 2018, which allows customers to have better control of their finances and be able to better analyse their spending habits."
        },
        {
            "text": "Open banking enables you to use other applications to look into the various financial products offered by different banks, so you can easily compare the costs to you of using different providers, for example their overdraft charges and rates of interest paid on credit balances. This way you can identify which current account and which bank best fits your personalised spending patterns and behaviours."
        },
        {
            "heading": 3,
            "text": "Making the switching process easy and simple"
        },
        {
            "text": "We have also required improvements to be made to the Current Account Switching Service (CASS). This service means that banks have to transfer your financial arrangements from the old bank to the new one for you, so you don’t have the hassle of having to sort that out yourself."
        },
        {
            "heading": 3,
            "text": "Switching without damaging your ability to get a loan"
        },
        {
            "text": "Banks are also required to provide you with a record of your transactions if you leave that bank. These are similar to bank statements and are called Transaction Histories. These can be important in helping you to get a better deal on credit or a loan in future, as you will more easily be able to demonstrate your current account history."
        },
        {
            "text": "We’ve recently taken enforcement action against four banks (Monzo, Bank of Ireland, NatWest Group and Virgin Money) for failing to provide Transactions Histories to customers that should have received them. You can read more about this enforcement work here."
        },
        {
            "text": "We’re continuing to monitor banks to make sure that they are complying with our rules and take robust enforcement action where appropriate, so that you can be secure in the knowledge that switching banks remains a simple and straightforward experience."
        }
    ]
}