{
    "url": "https://planninginspectorate.blog.gov.uk/2021/06/22/transforming-our-services-appeals-applications-and-examinations/",
    "title": "Transforming our services: Appeals, applications and examinations",
    "authors": [
        "Stephen Read"
    ],
    "categories": [
        "Appeals",
        "Applications",
        "Digital",
        "Examinations",
        "Service improvement"
    ],
    "pub_date": "2021-06-22T14:22:39+01:00",
    "content": [
        {
            "text": "Stephen Read introduces the work to improve our 3 service areas and how it will make it easier for customers to do business with us."
        },
        {
            "text": "Here at the Planning Inspectorate we group the services we provide into 3 areas:"
        },
        {
            "text": "Transforming our services is critical to our goals as an organisation, and my role at the Inspectorate is to lead the work in redesigning our services across the 3 areas."
        },
        {
            "text": "The aims are to:"
        },
        {
            "text": "Over the coming months you can expect to see blog posts from the teams as we talk about the fast pace of work going on to bring improvements to our customers."
        },
        {
            "text": "In this post, I’m going to set the scene and explain what’s been happening across the 3 areas."
        },
        {
            "heading": 2,
            "text": "1. Appeals service"
        },
        {
            "text": "Our vision for the appeals service is ‘planning decision appeals made easier, faster and more cost effective’."
        },
        {
            "text": "We deal with many different types of appeals at the Planning Inspectorate, with a range of complexity. To realise our vision, we needed to start with a narrow focus and gradually expand outwards to other types of appeals."
        },
        {
            "text": "Our current focus is on transforming the householder appeals service which allows householders to appeal if their planning application is refused by their local council. From a digital perspective, it’s a live service that was built around a decade ago and has become out of step with modern service design and ways of working."
        },
        {
            "text": "A lot of work has already taken place and we are now at the Beta stage. We are working with Bradford and Hillingdon local planning authorities (LPAs) and testing the service with appellants (parties who submit an appeal) in their area."
        },
        {
            "text": "We have recently completed our assessment against the Government Service Standard and have been confirmed as meeting the standard. This is a key part in our development as it means we are building a great service. It also means that we can expand the number of appeals into the new service, which enables us to increase our learning."
        },
        {
            "text": "The feedback has been really useful and has already led to changes we can implement now and ideas for future developments. This includes things like revising the planning decision notice for householder planning applications to make it clearer about the options for an applicant, and changes that avoid LPAs having to send copies of their policies to us for each appeal."
        },
        {
            "text": "Gathering user research and feedback from all those involved in the appeals process is at the heart of developing the service – we have inspectors, case officers, validators and our customer service team involved from within the Planning Inspectorate, but we are also ensuring that appellants, agents and interested parties are involved in the research and testing."
        },
        {
            "heading": 3,
            "text": "What have we been working on?"
        },
        {
            "text": "Our next major release will include:"
        },
        {
            "text": "For appellants, we are building in the elements needed that will allow them to see the progress of their appeal through the process."
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "We want to increase the number of appeals through the new service and are talking to additional LPAs about potentially becoming part of the beta. This will provide additional insight into how LPAs may process appeals differently."
        },
        {
            "heading": 2,
            "text": "2. Applications service"
        },
        {
            "text": "We also provide applications services, with nationally significant infrastructure projects being the most common. These projects include road, railway, power station and airport projects that meet or exceed the criteria set out in the Planning Act 2008."
        },
        {
            "text": "Our vision for the service is 'a clear, easy to understand process, providing the right information to the right people, at the right time'."
        },
        {
            "text": "In a similar vein to the appeals service improvements, we want to ensure that we have an inclusive service which:"
        },
        {
            "text": "We are currently in the Alpha stage with our service assessment planned for mid-July and our plan is to have our first application in Beta phase by late autumn."
        },
        {
            "heading": 2,
            "text": "3. Examinations service"
        },
        {
            "text": "Most of the examinations service work is where our independent Inspectors examine LPAs’ local plans."
        },
        {
            "text": "Our work on the examinations service is planned to start later in 2021. This will allow us to link to the current local plans pathfinder that is being led by the Ministry for Housing, Communities & Local Government. In addition, our work on the appeals and applications services above will create elements that we can re-use to reduce the development needed in this area."
        },
        {
            "heading": 2,
            "text": "Keep tuned for more about our service improvements"
        },
        {
            "text": "We will be blogging more about our service improvements over the coming months. Subscribe to keep updated about all of our blog posts."
        }
    ]
}