{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/22/women-in-engineering-day-2021/",
    "title": "Women in Engineering Day 2021",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2021-06-22T16:42:17+01:00",
    "content": [
        {
            "text": "Nishtha Chopra, Higher Radiation Protection Scientist, discusses her career in science as we look to celebrate International Women in Engineering Day on Wednesday 23rd June 2021."
        },
        {
            "text": "As an Electromagnetic Field (EMF) Dosimetry Scientist, my main area of research is to develop methodologies to investigate the underlying mechanisms of how EMF interacts with the tissues of the human body. The objective is to make sure that members of the public are protected from existing and emerging sources of EMF such as power lines, mobile phones, smart meters, and 5G technologies."
        },
        {
            "heading": 3,
            "text": "Electromagnetic radiation in healthcare"
        },
        {
            "text": "The field of research gripped me initially from my interest in the possible benefits of EM radiation in healthcare, leading to the development of instrumentation and methodologies for diagnostic and therapeutic applications. I work in a small of team of highly experienced scientists with specialisation in physics and engineering. The projects are usually interdisciplinary in nature and this makes the engineering aspects of the work even more interesting. Daily tasks include designing experiments, developing instrumentation, studying new sources of EMF and analysing complex measurement data. These complex yet rewarding problem-solving activities usually lead to research publications, which are used, in turn, to develop PHE’s advice and guidance on EMF health effects. Apart from core scientific work usually limited to my group, I was interested in the different research activities of the Centre for Radiation, Chemical and Environmental Hazards (CRCE)  and therefore, with the support my colleagues, I co-founded the ‘Science Converge’ forum for civil servant scientists, engineers and early career professionals. The inspiration to start the forum came from one of the Government Science and Engineering and Scientific (GSE) Careers workshop event held at CRCE, highlighting the benefits of increasing interactions among our scientists."
        },
        {
            "heading": 3,
            "text": "Nano technology for health monitoring"
        },
        {
            "text": "Prior to my role at PHE, I completed a PhD in Electronics Engineering from Queen Mary University of London. During this period, I worked in an interdisciplinary area combining Terahertz spectroscopy, bioengineering and numerical modelling to characterise human skin and devising a technique to study viability of in-vivo nanodevices for health monitoring and diagnostic applications. The dermis layer alone is highly complicated, it can be thought of as an intelligent sensor with lots of intricate features that provides, in some cases, visual cues for human health. With this idea as a motivation, my PhD work concluded in leveraging our understanding on “in-vivo communication” for network of nanodevices working in the Terahertz range when restricted to the dermis layer of the skin."
        },
        {
            "text": "My research base is at PHE’s CRCE and this is a unique organisation where physicists, engineers, mathematicians, chemists and biologists work in collaboration, with the common goal of developing reliable evidence-based public health advice. On this occasion of Women in Engineering Day, I would like to virtually send a ‘pat on the back’ to all the engineers because it is definitely a lot of hard work."
        },
        {
            "text": " "
        },
        {
            "text": "Liz Ainsbury & Sandra Lai (Chairs PHE WISE) and (Vicki Chalker Head of Science and Engineering Profession) Public Health England"
        }
    ]
}