{
    "url": "https://companieshouse.blog.gov.uk/2021/06/22/working-for-companies-house-sophies-story/",
    "title": "Working for Companies House: Sophie's story",
    "authors": [
        "Sophie Horton - Content Designer",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-06-22T10:30:38+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our new series of features in which employees reflect on what makes Companies House so special continues with Content Designer Sophie Horton."
        },
        {
            "text": "“I always thought, and I still do, that it’s really important to be happy in the job that you’re doing,” says Sophie Horton, Content Designer at Companies House."
        },
        {
            "text": "“Let’s face it, you’re going to be doing that job for a third of your life for the foreseeable future, possibly until you retire. You want to be fulfilled during that time. You really don’t want to be unhappy for a third of your life, do you?”"
        },
        {
            "text": "Sophie is someone who has put a lot of thought into her career, along with the need to be happy at work. Which, by her own admission, explains why her career so far has come in 3 phases."
        },
        {
            "text": "Phase 1 was all about retail. Having graduated with an English Language degree from Cardiff University, Sophie started out on a management scheme for a well-known high street fashion retailer, one she’d worked for part-time while studying."
        },
        {
            "text": "Sophie was forced to reassess what she was going to do with her life, and she started phase 2 of her career – teaching."
        },
        {
            "text": "“It seemed the perfect way to combine my love of words, my love of English and my love of children. I did my Postgraduate Certificate in Education (PGCE) and went into teaching in primary education convinced it was the right path. Unfortunately, it turned out not to be the right fit in the end."
        },
        {
            "text": "“The kids were wonderful but there were elements of the job that made me unhappy. As I said, I’m someone who believes that it’s really important to be happy in the job that you’re doing. Life’s too short not to be.”"
        },
        {
            "text": "Cut to phase 3. “I wanted that next thing to be ‘the’ thing, something that I loved doing, something to do with writing. A good friend of mine who worked for a copywriting agency helped me get some work experience there which, in turn, led me to do some freelance work for them. That helped rekindle my love of writing."
        },
        {
            "text": "“Another friend of mine was working at Companies House and I knew how happy and contented he was in his job. I also knew through him that Companies House was somewhere that really cared about its employees and their wellbeing, and that the opportunity to progress career-wise was there. It wasn’t going to be a dead-end, in other words."
        },
        {
            "text": "“To cut a long story short, he sent me a link to some positions that Companies House were advertising for administrative officers. I applied, and I got one of them."
        },
        {
            "text": "“I started off in a group of 6 people in the post room, just to get familiarised with how the place works, before we were then sent off to work in different departments."
        },
        {
            "text": "“Initially I worked in the Restoration Department before moving to a temporary maternity cover role in Customer Care. While I was there, the opportunity came along to do some work shadowing as a content designer – that’s someone who creates content for digital services allowing information to be communicated in the best way possible."
        },
        {
            "text": "“Then, before I even had the chance to do the shadowing placement, an actual job as a content designer came up. I just couldn’t believe it. I’d come to Companies House for my wellbeing, to be happy and intending ultimately to do a job where I’d be using my writing and English language skills – and here it was!”"
        },
        {
            "text": "Sophie applied for the content designer job but still completed her work shadowing placement anyway, just to make sure it was the right role for her. It proved to be everything she hoped it would be."
        },
        {
            "text": "Even better, her job application was successful!"
        },
        {
            "text": "“I absolutely adore it,” she says. “This is the job I want to do forever. It took me 3 attempts, or 3 phases as I call it, but I’ve finally found my passion."
        },
        {
            "text": "“I feel so lucky that I’m not only working in a place that cares so much for its employees, but that I’m also doing a job that I’m passionate about and I love. It took me 3 goes to find my vocation, but I got there in the end."
        },
        {
            "text": "“I’m not the first person who’s started down the road in one career, only to discover that it’s perhaps not for them. And I won’t be the last. There’s no shame in admitting that you may have taken a wrong turn. The important thing though is to be honest with yourself and try to do something about it. It's a third of your life that we’re talking about, after all.”"
        }
    ]
}