{
    "url": "https://socialcare.blog.gov.uk/2021/12/16/a-heartfelt-thank-you/",
    "title": "A heartfelt thank you",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Recognition",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2021-12-16T10:08:44+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Awe inspiring care colleagues"
        },
        {
            "text": "The words ‘thank you’ do not seem enough to express my gratitude for the incredible work you have all done to keep residents, colleagues and communities safe, both as individuals and teams, throughout 2021. They are, however, deeply heartfelt."
        },
        {
            "text": "From my own experiences working on the frontline of the pandemic, I know the difference you all make, and how your herculean efforts are appreciated by those in your care, their families and friends."
        },
        {
            "text": "I have been in awe of those I have met this year when visiting services, including recipients of the Chief Nurse for Adult Social Care Awards, our social care colleagues who became Queen’s Nurses, winners of the first Nursing Times Social Care Award."
        },
        {
            "text": "These exceptional people all think they do ordinary things. It is why they are so successful and why their recognition is so deserved. In fact, it is the ordinary things which make someone’s life special, enabling them to live independently, achieve their ambitions and feel fulfilled. This is why so many of you keep coming to work and making a real difference. You’re not just performing a role, you’re demonstrating the transformative powers of a skilled, talented and empathic professional workforce, and you should all stand tall with pride in this knowledge."
        },
        {
            "text": "As we approach the festive season, we will reflect upon the year just gone, remember with love and respect those we lost, and look ahead with hope to the year to come."
        },
        {
            "heading": 2,
            "text": "Looking forward with hope"
        },
        {
            "text": "I believe in looking forwards in life, and I hope 2022 gives us the space we need to begin implementing the reforms set out in ‘People at the heart of care’, the Government’s white paper on adult social care reform."
        },
        {
            "text": "£500 million to develop skills, create a baseline of learning for all, and continual professional development (CPD) monies for our registered workforce will, for the first time, allow us to level up with NHS colleagues and have equity for our professional development. We are building solid foundations for the future growth of our workforce, stronger partnerships across the health and social care system, and forging a new era of mutual respect."
        },
        {
            "text": "I feel immense gratitude to each and every one of you for what you do, protecting yourselves, your loved ones and those in your care by having your winter vaccinations – including flu and COVID-19 boosters. I know by doing the right thing to protect everyone you will understand why we are all being asked to come forward for our third vaccine, so we can maintain our defences."
        },
        {
            "text": "I also applaud your immense efforts in the use of infection prevention and control (IPC) measures during these challenging times. The IPC Champions Network launched earlier this year will help us all redouble our efforts to make care settings the safest they can be for all who live and work in them."
        },
        {
            "text": "I feel proud to be working in social care, even in the hardest of times our workforce has been triumphant in its achievements. I wish you and your families a happy holiday season and a healthy 2022."
        }
    ]
}