{
    "url": "https://aphascience.blog.gov.uk/2021/12/16/bird-flu-outbreak-2021/",
    "title": "APHA at the heart of the biggest ever outbreak of bird flu in GB",
    "authors": [
        "Ian Brown"
    ],
    "categories": [
        "Viral diseases"
    ],
    "pub_date": "2021-12-16T12:03:40+00:00",
    "content": [
        {
            "text": "Bird ‘flu season is upon us once again. Unfortunately, already this winter season we have diagnosed more cases than in any previous UK outbreak; 55 cases of high pathogenicity H5N1 avian influenza (bird flu) cases have now been confirmed on sites across Great Britain (GB) at the time of blog publication.  A GB wide avian influenza (AI) prevention zone to reduce risk of spread from wild birds to poultry was imposed on 3 November followed by the requirement to house all poultry on 29 November."
        },
        {
            "text": "APHA has been at the heart of the response, from a science perspective, providing all the testing and diagnoses, offering the science evidence in order for disease confirmation and undertaking the epidemiological response to the disease in the field. All these activities support decisions to enable fast and effective control. Surveillance has also started to start the process for GB becoming disease free again. In this blog, learn how APHA has responded to this emergency and actions you can take to help."
        },
        {
            "heading": 3,
            "text": "Action stations"
        },
        {
            "text": "APHA have rapidly assembled expert Virologists, Epidemiologists, Pathologists, Veterinarians, field staff, Risk Analysts and Scientific Project managers to coordinate our scientific response to help stop further spread of this disease."
        },
        {
            "text": "We are testing round the clock seven days a week with enhanced capacity, to meet the rapid increase in cases."
        },
        {
            "text": "The arrival of AI is connected to wild bird migration in the autumn and winter months. We would usually expect to see the first cases in late autumn with the peak risk occurring between December and February. This year, the first case was confirmed by APHA even earlier at the end of October. Subsequently, to date, we have confirmed infection in over 320 wild birds from across GB. It appears that the timing and scale of this event in wild birds is earlier and on a greater scale than previous years. This higher risk for infection of poultry as a result has translated into the large number of cases."
        },
        {
            "text": "APHA maintains UK National Reference Laboratory (RL) status for 49 diseases, of which 23 are international status. These reference laboratories cover a wide range of animal health science specialisms, including AI. Through these RLs we provide specialist disease testing capability and we have been working with international colleagues to track the new AI viruses as they travel across Eurasia to the UK."
        },
        {
            "text": "Our highly skilled scientific staff have taken this science intelligence and have been continually reviewing the risk to our bird populations. We have been working through EpiRisk in this space which results in preliminary outbreak assessments that updates and alerts keepers of birds."
        },
        {
            "heading": 3,
            "text": "Risk level across GB"
        },
        {
            "text": "At the time of publication, the risk of incursion in wild birds in the UK is very high, with the risk in captive birds (including poultry), either medium (where good biosecurity on premises is applied to keep infection out) or high (where biosecurity on premises is below the required standard). From a food safety perspective, this risk remains very low to UK consumers. The risk to public health is very low."
        },
        {
            "heading": 3,
            "text": "Poultry keepers: it is time to act"
        },
        {
            "text": "We would encourage all keepers to register their flocks with us. This is a legal requirement if you have 50 birds or more. Registering with us means that we will be able to contact you with information or action required should an outbreak happen near you."
        },
        {
            "text": "As is the case with many other diseases, good biosecurity is the first line of defence against AI. It is imperative that all bird keepers are adhering to strict biosecurity measures to help stop the spread of AI on and off property. This is especially important as we are in a period of heightened risk that will last for several months. Please see the most up-to-date biosecurity advice on GOV.UK and consider joining one of the Defra webinars being organised."
        },
        {
            "text": "Quick action is needed should AI be suspected in poultry and other captive birds. Bird keepers should remain highly vigilant and report any suspicions of disease straight away to the Defra Rural Services Helpline on 03000 200 301. Please be aware that it is an offence if you fail to do this."
        },
        {
            "heading": 3,
            "text": "Reporting dead wild birds"
        },
        {
            "text": "APHA has made changes to the reporting of dead wild birds. We are now looking for reports of three or more dead birds from target species (i.e. those more likely to be infected with the virus namely ducks, geese, swans, gulls and raptors) to continue our surveillance and track how the virus is being maintained across GB. We expect the infection risk will reduce with time but is expected to remain till the spring."
        },
        {
            "text": "Should you find visibly sick or dead wild birds, first and foremost please do not touch them!"
        },
        {
            "text": "If you live in GB and you discover swans, geese, ducks or other dead wild birds, these should be reported to the Defra helpline on 03459 33 55 77."
        },
        {
            "heading": 3,
            "text": "Keep updated"
        },
        {
            "text": "APHA is providing science expertise and advice drawing on previous and existing programmes of research. We plan to provide update blogs on our blog site so please subscribe to receive immediate alerts when new blogs are published throughout the winter months."
        },
        {
            "text": "Further information about AI and for the most up-to-date outbreak advice and guidance can be found on GOV.UK."
        },
        {
            "text": " "
        }
    ]
}