{
    "url": "https://civilservice.blog.gov.uk/2021/12/16/civil-service-announce-their-top-10-blogs-of-2021/",
    "title": "Civil Service announce their top 10 blogs of 2021",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-12-16T15:00:07+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Forget who won Bakeoff or I’m a Celeb. The real burning issue is: who topped the Civil Service’s most-read blog posts this year? Time to reveal all!"
        },
        {
            "text": "As we reach the end of 2021, we want to take this opportunity to look back at our top 10 most popular blog posts from the past 12 months. How to break through in the Civil Service by Amy Tsang (DIT) topped the charts for views across the year."
        },
        {
            "text": "It proved the biggest hit with its mix of down-to-earth tips and work wisdom on how to climb the career ladder. If you’ve ever felt stuck in a career cul-de-sac, this one’s for you."
        },
        {
            "text": "Amy said: “I’m pleasantly surprised - it shows people want to know more about career progression. When you’re writing a blog post, it’s important to keep the reader in mind and think about what they want to know. I tried to make the blog post relevant whilst also reporting on our event and highlighting useful information from others on the team.”"
        },
        {
            "heading": 4,
            "text": "New pen"
        },
        {
            "text": "How will she celebrate? In the short-term, Amy plans to share her success with mentors and her team who helped steer it through the publishing process. “I may even buy myself a new pen to remind myself that I’m good at writing, and probably a caramel chocolate shortbread too!”"
        },
        {
            "text": "So why does Amy think it struck a chord? “It’s my first role in the Civil Service, and I noticed that everyone is very motivated in their work, but there seemed to be concerns about progressing. I wanted to work on the problem around progression and demystify worries and concerns around it. "
        },
        {
            "heading": 4,
            "text": "Room for growth"
        },
        {
            "text": "“It’s particularly important if you want to be promoted within your current department, plus if you’re thinking of applying to the Civil Service, you want to know there’s room for growth. I think tackling both of these concerns made the blog post popular.”"
        },
        {
            "text": "Now that we’ve all worked through another year dominated by COVID-19, it’s unsurprising that a blog about stress prevention by Nathalie Dinnick took second spot."
        },
        {
            "heading": 4,
            "text": "Happy but humbled "
        },
        {
            "text": "Natalie, a Wellbeing Officer and Mental Health Network Lead at Companies House, said: “My mantra has always been ‘if you don’t make time for your wellness, you’ll be forced to make time for your illness’. I felt humbled by colleagues wanting to read my story, and by those who reached out. My hope was to connect to people who might relate to my experience and recognise the signs of burnout. "
        },
        {
            "text": "“I’m delighted with the response, particularly if I’ve managed to get people thinking about symptoms early, and to hopefully feel safe in the knowledge they can find their way to recovery. Burnout isn’t just a problem for senior executives but something that everyone should be mindful of - my story demonstrates that.”"
        },
        {
            "text": "Brian Stanislas has a knack for writing career-themed blog posts that captivate readers. "
        },
        {
            "text": "Brian took the third and fifth spots for his blogs on the Civil Service’s career matching tool as well for the Government Recruitment Information Database (GRID), a handy data tool aimed at harvesting valuable insights to build a more inclusive organisation. "
        },
        {
            "text": "“Yippeee!” said Brian. “I think colleagues find the Civil Service Career Matcher useful whether they’re applying for promotion or want a change of role. It’s great that people hoping to join the Civil Service find our careers information both insightful and inspiring.”"
        },
        {
            "heading": 3,
            "text": "Top 10 Civil Service blogs of 2021"
        },
        {
            "text": "How to Break Through in the Civil Service - Our Top Tips"
        },
        {
            "text": "Amy Tsang’s blog post proved the biggest draw with readers with her mix of tips and work wisdom on how to climb the career ladder. If you’ve ever felt stuck in a career cul-de-sac, this one’s for you."
        },
        {
            "text": "Spotting Signs of Excessive Stress and Burnout"
        },
        {
            "text": "To mark Stress Awareness Month, Natalie Dinnick shared her personal story from complete burnout to recovery. “I learnt incredibly valuable lessons and developed a new career path. I am sharing my story hoping to demonstrate that there is always light at the end of the tunnel,” wrote Natalie."
        },
        {
            "text": "Civil Service Careers Website: Career Matcher"
        },
        {
            "text": "For some people, understanding how they can navigate their path into the Civil Service can be puzzling. Others may never have considered exploring Civil Service career options at all. Good news: the Career Matcher is here to help.  "
        },
        {
            "text": "5 Lessons From the Forces About Getting Things Done"
        },
        {
            "text": "When Rupert Cryer joined the Cabinet Office COVID-19 Task Force, his new colleagues from the Armed Forces couldn’t have had more different day jobs. Yet the stark contrast was the very thing that made it work."
        },
        {
            "text": "New Grid Data Tool to Build a More Inclusive Civil Service"
        },
        {
            "text": "Government Business Services showcase a data analyser to improve recruitment and find the cream of the candidate crop. The second blog post by Brian Stanislas to make our coveted top five."
        },
        {
            "text": "Social Mobility: Are You Playing Your Part?"
        },
        {
            "text": "Civil servant Charlotte Bedford is one heck of a role model. Growing up in a working class community with three siblings and a single mum, life wasn’t easy. As a teen, budding actress Charlotte turned down a dream place at drama school, unable to afford the annual £10,000 fees - a sharp reality check in how poor social mobility can lead to missed opportunities. When tragedy struck and younger brother Sam died, the family struggled to pay for his funeral. "
        },
        {
            "text": "In 2019, Charlotte joined the Civil Service and has already supported three ministers at the Department of Transport. The wellbeing volunteer is studying for a policy apprenticeship and saving for her first home. Inspiring proof that perseverance pays off!"
        },
        {
            "text": "Getting a Gong"
        },
        {
            "text": "We all know someone who always goes that extra mile and doesn't expect any credit, so why not thank them by nominating them for an honour? After all, honours are a way of celebrating extraordinary people who go above and beyond to change the world around them for the better. Cabinet Office Honours Secretary Fatma Khalil explains that it’s easier than you think, and reveals the nominations process that belies your path to the palace."
        },
        {
            "text": "You’re Never Too Old to be an Apprentice"
        },
        {
            "text": "Apprenticeships aren’t just for teenagers, so never let anyone tell you that age is a barrier. When mum Nikki Hanmer, 27, wanted to change career, she set her sights firmly on a Civil Service apprenticeship and - shhh, spoiler alert - Nikki was hired! "
        },
        {
            "text": "Fully-qualified, newly-promoted Nikki said: “Yes, I’ve got a certificate confirming my achievement. But I’ve also gained lasting friendships, new skills, a newfound inner confidence and a promising new career.”"
        },
        {
            "text": "Civil Service Awards 2021 Shortlist"
        },
        {
            "text": "Nothing beats the buzz when the Civil Service unveils contenders for the annual awards ceremony, and 2021 was no exception. Think spirited, multi-tasking and resilient civil servants who went beyond the call of duty."
        },
        {
            "text": "Mentoring and Me"
        },
        {
            "text": "A great mentor encourages a person to progress, giving wise advice and encouragement. But it isn’t a one-way street. Many mentors find building the bond just as rewarding and gain fresh inspiration. Bernadette Thompson and Melissa Crawshay-Williams shared their mentoring journey."
        },
        {
            "text": "And finally… thank you!"
        },
        {
            "text": "Congratulations and huge thanks to all the bloggers - not forgetting all the fixers behind the scenes - who we’ve worked with over the last 12 months. "
        },
        {
            "text": "Thanks to everybody who has taken time from your busy days to read the Civil Service Blog. We’re taking a break from 24 December and will be back on 10 January 2022. Meanwhile, merry Christmas, happy New Year - and keep safe! "
        }
    ]
}