{
    "url": "https://homeofficemedia.blog.gov.uk/2021/12/16/factsheet-provisional-police-funding-settlement-2022-23/",
    "title": "Factsheet: Provisional Police Funding Settlement 2022/23",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2021-12-16T13:24:56+00:00",
    "content": [
        {
            "text": "The Home Office has published the provisional police funding settlement for 2022/23."
        },
        {
            "text": "HEADLINE FIGURES"
        },
        {
            "text": "The Government is proposing a total police funding settlement of up to £16.9 billion for policing in 2022/23. This includes funding to Police and Crime Commissioners (PCCs), plus funding for counter-terrorism policing and national priorities, such as dismantling County Lines, reducing violent crime and making our streets safer."
        },
        {
            "text": "Overall funding available to PCCs will increase by up to £796m next year - an increase of up to 5.8% when compared to the 2021/22 funding settlement – if PCCs make full use of their flexibility to increase precept."
        },
        {
            "text": "The funding package includes:"
        },
        {
            "text": "POLICE UPLIFT"
        },
        {
            "text": "The Government is committed to delivering an additional 20,000 officers by March 2023."
        },
        {
            "text": "Latest statistics show that, as of 30th September 2021, 11,053 of these officers were already in place."
        },
        {
            "text": "POLICE PRECEPT"
        },
        {
            "text": "Around two-thirds of funding for PCCs comes directly from Government grants, with around a third coming from a share of council tax – known as police precept."
        },
        {
            "text": "In 2022/23, we are giving PCCs in England the flexibility to increase local funding by setting a £10 precept limit for a typical Band D property."
        },
        {
            "text": "If all PCCs take full advantage of this flexibility, it will raise up to an additional £246 million for local forces based on current forecasts."
        },
        {
            "text": "PCCs must consult their local electorate on setting precept and explain how additional investment will deliver a better local police service."
        },
        {
            "text": "Council Tax policy in Wales is devolved and is a matter for the Welsh Government. The precept limit does not apply there."
        },
        {
            "text": "COUNTER-TERRORISM POLICING"
        },
        {
            "text": "Counter-terrorism policing is a national priority with ring-fenced funding."
        },
        {
            "text": "Counter-terrorism policing will receive funding of over £1 billion in 2022/23, including continued funding for both armed policing and the CT Operations Centre."
        },
        {
            "text": "The funding includes the transfer of £44 million for Special Branch from core PCC budgets to the counter-terrorism policing grant, protecting local counter-terrorism assets while providing forces with greater access to specialist expertise and resources."
        },
        {
            "text": "NATIONAL PRIORITIES"
        },
        {
            "text": "In 2022/23, £1.4 billion will be provided for national policing programmes and priorities. This delivers on the national priorities of taking down more County Lines, reducing violent crime, child sexual abuse and exploitation, fraud and modern slavery."
        },
        {
            "text": "PENSIONS"
        },
        {
            "text": "The funding package includes £152.6 million to help police pay increased pensions costs. Of this, £142.6 million will go directly to PCCs and £10 million to counter-terrorism policing and the National Crime Agency."
        },
        {
            "text": "Change in total funding compared to 2021/22 in £ millions.                       "
        },
        {
            "text": " "
        }
    ]
}