{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/12/16/hopes-for-a-safe-and-happy-festive-season/",
    "title": "Hopes for a safe and happy festive season",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Coronavirus",
        "Our profession",
        "Viewpoint"
    ],
    "pub_date": "2021-12-16T17:10:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Perspectives on progress"
        },
        {
            "text": "Did you know Wham’s ‘Last Christmas’ finally reached number one in the UK singles chart on New Year’s Day 2021, 36 years after its initial release, so getting the adult social care reform White Paper ‘People at the heart of care’ over the line, six years on from the Care Act implementation in 2015, is pretty good going!"
        },
        {
            "text": "I have had some very positive feedback about the white paper’s focus on people first, rather than systems and of course this is what makes effective social care so special – it’s all about people, relationships and never forgetting that every person matters."
        },
        {
            "text": "The investment announced in the social care workforce, including funding for enhanced training, support and expanded career paths for social workers, is hugely welcome. Our compassion, experience and expertise as a profession has never been needed more in these challenging times."
        },
        {
            "heading": 2,
            "text": "Thanks for Christmases past, present and future"
        },
        {
            "text": "As this year’s festivities begin, I wanted to take the opportunity to say an enormous thank you to the people who keep things going, social workers, occupational therapists, social care staff in local authorities and everyone working in provider services."
        },
        {
            "text": "Thanks for everything you are doing now and will be doing over the festive period. I know it will be a challenging time for everyone again this winter as we are preparing to manage the continuing impact of COVID-19 and the omicron variant in our communities. I do hope everyone has a chance to enjoy time with family and friends safely."
        },
        {
            "text": "Do look after yourselves and may 2022 brings us better times, both here and across the world."
        }
    ]
}