{
    "url": "https://educationhub.blog.gov.uk/2021/12/how-the-holiday-activity-and-food-programme-is-helping-our-communities/",
    "title": "How the Holiday Activity and Food Programme is helping our communities",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Holidays"
    ],
    "pub_date": "2021-12-16T13:57:36+00:00",
    "content": [
        {
            "text": "Next week marks the start of the 2021 winter Holiday Activity and Food Programme (HAF) for children and young people across the country. We speak to Jamie Noble, Head of Community at Rotherham United Community Sports Trust, on the provision he runs, and the impact it has made within the area."
        },
        {
            "heading": 3,
            "text": "Do you believe that the HAF programme is able to have a positive effect on the mental health of the attendees?"
        },
        {
            "text": "Jamie: Yes, more so than ever at the moment, particularly for the young people who have experienced the lockdowns and social changes. We saw a tangible difference in the children who participated in our summer schemes, and how they grew with confidence as the weeks went on, particularly when it came to developing social and leadership skills."
        },
        {
            "heading": 3,
            "text": "Can you describe how you ensure the HAF programme is inclusive to a broad range of children from across Rotherham, including those with SEND? "
        },
        {
            "text": "Jamie: Before we start anything, we do a piece of work centred around engaging with participants via their schools, parents, and influence groups. The groups we work with include our Disabled Supporters Group, our Youth Forum, and the graduate programmes that we run at Rotherham United Community Sports Trust. The activities we eventually run are centred around what these stakeholders advise. We also make sure to cater our format and timings, as well as facilities and locations, to make sure all children who take part in our provision are offered a range of accessible and enjoyable activities."
        },
        {
            "heading": 3,
            "text": "Do you believe your programme has benefitted the wider community in Rotherham? "
        },
        {
            "text": "Jamie: Definitely. We know that the school holidays can be especially challenging and expensive, so we believe it’s really important for the whole community that we provide this support for local families. It’s also a great opportunity to unite and get behind a positive area wide initiative."
        },
        {
            "text": "We always want to reward young people and make sure that those who can’t afford our sessions can access them, but as a charity and as a business we still have our overheads to consider. Thanks to HAF, we now have a lot more freedom in this area, along with the ability to think outside the box when providing additional opportunities to the children who have not previously had them over the last few years."
        },
        {
            "heading": 3,
            "text": "What are the main lessons that you have learnt through running the HAF camps, and how do you aim to build on these in the future? "
        },
        {
            "text": "Jamie: One big lesson was that people don’t want to be treated any differently based on their economic background. We found that the majority of working class families wanted the same opportunities as other families, and didn’t want their children to be attached with a stigma of free school meals."
        },
        {
            "text": "We have worked a lot around integrating these children into the activities that we were already running, and trying to provide the necessary support without it being too obvious. For example, we provide meals for all participants in the same format as the paying families, so that children don’t think ‘why do they get that and I don’t’, which was a common theme on our first camps."
        },
        {
            "heading": 3,
            "text": "What are you looking forward to most about the winter provision?"
        },
        {
            "text": "Jamie: It will be brilliant to see many of the children and young people we worked with over summer again, as well as meeting lots of new participants."
        },
        {
            "text": "Due to the successful feedback we received from parents during the last edition, we have been able to expand our offer to include dance, drama, a singing camp, and a E-Sports gaming camp."
        },
        {
            "text": "It feels more important than ever to provide support to families and alleviate some of the social isolation at this time, especially over the festive period, as we have been able to incorporate it’s theme and the community spirit it generates into lots of our activities, as well as organise some special one-off events that get wider families involved. This programme is also a great way for local authorities and providers to maintain contact with particular groups over this period, helping ensure that all children are safe and looked after over the school holidays."
        },
        {
            "heading": 3,
            "text": "Looking for more information on HAF?"
        },
        {
            "text": "As with Easter and the summer, HAF will again be available across the country this winter. HAF provides support for eligible children and families through high quality and healthy food, engaging activities along with socialising and having fun."
        },
        {
            "text": "Please contact your local authority or search ‘HAF’ alongside the name of your area."
        },
        {
            "text": "For information on how to get involved and for full guidance on the HAF programme visit gov.uk."
        }
    ]
}