{
    "url": "https://nda.blog.gov.uk/marker-in-the-sand-for-nationally-significant-infrastructure-programme/",
    "title": "Marker in the sand for nationally significant infrastructure programme",
    "authors": [
        "Dr Rachel Roffe - RWM Head of Stakeholder Engagement"
    ],
    "categories": [
        "Waste management"
    ],
    "pub_date": "2021-12-16T14:04:59+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "First-ever national conference"
        },
        {
            "text": "December opened with our first-ever national GDF Conference bringing together a wide range of stakeholders from government, parliament, regulators, industry, business, academia, international organisations, next generation representatives and communities."
        },
        {
            "text": "The setting was Central Hall, Westminster, famed as a venue for discussing the most pressing social issues of the day. It made an appropriate setting for us and our guest speakers to share knowledge and stimulate debate about a critical national issue with a multi-generational impact: the safe and secure disposal of the UK’s higher activity radioactive waste."
        },
        {
            "text": "The UK has been storing radioactive waste for decades, so what made this the right time to bring the industry together? As RWM’s Chief Executive Karen Wheeler explained in her opening remarks to the conference, we chose this moment because the programme is now happening and building momentum and we now have four communities exploring the potential a Geological Disposal Facility (GDF) may have for their areas."
        },
        {
            "text": "These communities – Mid and South Copeland and Allerdale in Cumbria, and Theddlethorpe in Lincolnshire – are interested in investigating the opportunities a GDF could offer for them, their children and grandchildren. None of them have committed to anything by starting the conversation with us, but these conversations mean that RWM, the GDF developer’s work to site and construct a GDF in the UK is now well under way."
        },
        {
            "heading": 3,
            "text": "Programme continues to accelerate"
        },
        {
            "text": "The GDF Conference offered a packed day of presentations and panels, with speakers from the worlds of government, business and academia sharing insights on the technical, financial and socio-economic aspects of the GDF programme."
        },
        {
            "text": "Delegates heard from RWM representatives how the pace of the programme continues to accelerate."
        },
        {
            "text": "Simon Hughes, RWM’s Community Engagement and Siting Director, shared the view from on the ground; his team visited 35 locations on 45 occasions across our four interested communities in 2021, meeting and listening to hundreds of people and laying the groundwork for Community Partnerships to form. Two Community Partnerships have now formed in Copeland, with a third expected to form soon in Allerdale."
        },
        {
            "text": "The formation of Community Partnerships allows new stages of the programme to proceed. Technical Director John Corderoy engaged the audience with a presentation demonstrating the scope, scale and timescales of the programme, which helped generate many interesting conversations in conference breaks and also after the event. People were palpably excited by the potential as Professor Stephen Pollock (Viscount Hanworth) said:"
        },
        {
            "text": "In the afternoon we also took a look at what is involved in building a deep understanding of the geology of locations, including what we know now and the work we will need to do in the future. The first detailed geophysical surveys are expected to begin in summer 2022, using standard techniques used by the oil and gas and offshore wind industries to understand more about the geological characteristics and to determine suitability of sites to host a GDF."
        },
        {
            "text": "Chief Engineer Paul Shipley outlined the innovation opportunities as well as the challenges of engineering design with such a long time for development. Paul’s team are hard at work investigating how the different possible findings of these geophysical surveys could influence the design and layout of a future  facility. Nice problems to have for a an engineer!"
        },
        {
            "text": "A GDF will be a complex undertaking and there aren’t many fields of study or areas of industry that won’t have a part to play from engineering to science to advanced robotics and of course communications and engagement as this is all about building long term relationships and trust with communities and everyone else that will be involved. Young people studying these subjects today may find a job waiting for them on the GDF programme."
        },
        {
            "heading": 3,
            "text": "Milestones across the nuclear industry"
        },
        {
            "text": "While there was a lot for RWM to update the delegates about, we didn’t dominate the conference. There was plenty of space in the schedule to hear from other organisations related to the GDF programme – all of whom had their own recent and upcoming milestones to share."
        },
        {
            "text": "The Environment Agency’s Keith Ashcroft described how decommissioning at Sellafield is proceeding both safely and speedily. Anyone familiar with the site may have noticed some significant recent changes to its skyline as a result."
        },
        {
            "text": "Joining via video link from Olkiluoto, Finland, Mika Pohjonen from Posiva Solutions Oy announced that the construction of Finland’s GDF is proceeding on schedule. The first tunnels are on track to trial receiving waste in early 2023. Jonathan Turner mentioned that ANDRA in France will also be applying for a licence to construct their GDF in the very near future."
        },
        {
            "text": "Looking ahead to next year in the UK, Simon Hughes was confident that we would see even more Working Groups and Community Partnerships forming."
        },
        {
            "text": "While the whole conference conveyed a strong sense of momentum building behind the GDF programme, an insightful question in one of the panel discussions pointed out the need to balance this with the needs of communities. The unique consent-based siting process for a GDF means it’s vitally important not to push interested communities faster than they’re comfortable going."
        },
        {
            "text": "Simon Hughes pointed out that the reason communities reach out is because they’re aware of the benefits and opportunities a GDF could bring. While no community wants to rush into a big decision, no one wants to put off the potential opportunities longer than necessary either."
        },
        {
            "heading": 3,
            "text": "Getting the word out"
        },
        {
            "text": "The first GDF Conference was a great success. It brought together representatives of those industries and organisations with vital parts to play in the GDF programme, got everyone up to speed with the amazing progress being made, and brought the programme to the forefront of everyone’s mind."
        },
        {
            "text": "The real mark of success is that the conference’s message quickly spread beyond Central Hall. Speaking at the Nuclear Industry Association conference the following day, the Rt Hon Greg Hands MP, Minister for Energy, Clean Growth and Climate Change, said:"
        }
    ]
}