{
    "url": "https://defrafarming.blog.gov.uk/2021/12/16/meet-one-of-our-sustainable-farming-incentive-pilot-applicants/",
    "title": "Meet one of our Sustainable Farming Incentive pilot applicants",
    "authors": [
        "Joseph Evans"
    ],
    "categories": [
        "A view from the farm",
        "Conversations we're having",
        "Sustainable Farming Incentive pilot"
    ],
    "pub_date": "2021-12-16T11:33:24+00:00",
    "content": [
        {
            "text": "Farmers like Charlie are joining the pilot to help us make sure the Sustainable Farming Incentive scheme works in practice."
        },
        {
            "text": "Charlie is a partner at Kensham Farms in Buckinghamshire and applied to join the Sustainable Farming Incentive pilot in 2021."
        },
        {
            "text": "In this video, Charlie gives us an overview of how he manages his land and explains why he applied to join the pilot."
        },
        {
            "text": "He takes us on a tour of his farm to talk about some of the machinery he has and farm practices he uses like direct drilling and cover cropping."
        },
        {
            "text": "During the video, Charlie spoke about investing in new equipment. Defra published information about the Farm Investment Fund earlier this year, which you can read more about here: Farming Investment Fund on GOV.UK. This fund provides grants for equipment and transformation to help improve productivity and bring environmental benefits."
        },
        {
            "text": "The Sustainable Farming Incentive will pay farmers to produce public goods alongside food production. Farmers like Charlie, who are joining the pilot version of the scheme, will help make sure we achieve this."
        },
        {
            "text": "We have already started learning from the experience of farmers in the pilot. You can read more about what we’ve learned so far and what we’re doing about it, as well as which farmers are in the pilot, in this blogpost: Update on the Sustainable Farming Incentive pilot."
        },
        {
            "text": "Many thanks to Charlie for taking part."
        },
        {
            "text": "Read the transcript."
        }
    ]
}