{
    "url": "https://knowledgeasset.blog.gov.uk/2021/12/16/the-met-offices-weather-forecasting-expertise-saves-christmas/",
    "title": "The Met Office’s Weather Forecasting Expertise Saves Christmas",
    "authors": [
        "Aidan McGivern"
    ],
    "categories": [
        "Met Office"
    ],
    "pub_date": "2021-12-16T12:49:20+00:00",
    "content": [
        {
            "text": "Every year the Met Office provides a Santa Tracker to help people know where Santa is and help Santa get all his deliveries done on time.  This is an innovative use of Met Office weather data that helps with Santa’s critical task and helps develop the dialogue between the Met Office and the public.  Aidan McGivern, Met Office Weather Presenter, explains more."
        },
        {
            "text": "On Christmas Eve, when Santa Claus calls the Met Office for a route forecast, he’s put straight through to the World Area Forecast Centre (WAFC). There are only two World Area Forecast Centres in the world, both established in the early 1980s to meet pilots’ needs for meteorological information. One is operated by the National Oceanic and Atmospheric Administration in the USA and the other is operated by the Met Office in the UK. Every six hours, a Significant Weather Chart is produced – an essential tool for pilots and for Santa – to provide a broad overview of aviation hazards around the world. “We’ll plot an efficient route for Santa that uses the jet stream as a tail wind and avoids erupting volcanoes, thunderstorms and clear air turbulence,” says Matt Box in the WAFC team. “He’s particularly concerned about presents falling from the back of the sleigh. And he’ll always ask questions about fog so he can decide whether to use Rudolph’s glowing red nose.”"
        },
        {
            "text": "For more detail on what to expect on his global tour, Santa will speak to an expert meteorologist at the Met Office Global Guidance Unit (GGU). Every day, a Global Weather Impacts Assessment is produced, which plots details of severe weather and its impacts around the world. As well as day-to-day weather impacts, there are ongoing seasonal variations in the weather. A significant factor this year is La Niña – a phase of the El Niño Southern Oscillation, which is a periodic fluctuation in sea surface temperatures in the Pacific with ramifications on weather patterns throughout the world. “La Niña leads to wetter weather in Australia and Indonesia and drier weather in East Africa. It can also lead to colder spells during the first half of winter in northwest Europe,” according to GGU Meteorologist Adam Thornhill. “Santa is very familiar with the El Niño Southern Oscillation, since La Niña and its opposite phase El Niño often peak around Christmas.” In fact, the name El Niño, which means The Little Boy or Christ Child in Spanish, originally came from fishermen off the coast of South America who noticed warmer seas at around this time of year."
        },
        {
            "text": "Once Santa’s route has been determined, it’s plotted on the Met Office weather graphics engine known as Visual Cortex. Visual Cortex allows meteorologists to visualise various layers of weather data on a 3d projection of the globe and animate sequences through time. These graphics are used routinely by Met Office weather presenters to broadcast forecasts for media customers as well as the Met Office app, website and YouTube channel. With two greenscreen weather studios in operation at the Met Office headquarters in Exeter, as well as an interactive touchscreen, ad hoc weather broadcasts can be recorded and posted quickly when severe weather hits."
        },
        {
            "text": "Short non-presented clips of these weather graphics – in a social-media-friendly square format – are also regularly posted on Twitter to highlight routine weather forecasts, warnings of severe weather and, sometimes, forecasts for specific events. “I don’t know if Santa follows us on Twitter, or even if he knows what Twitter is. But he has given us permission to post regular updates of his route every Christmas Eve, which we call the Santa Tracker,” says Mark Wilson, who oversees the Media Services Team. “The Santa Tracker is just a bit of fun but it does encourage a lot of engagement on social media.”"
        },
        {
            "text": "With more than 850 thousand followers on Twitter, as well as large audiences on Facebook, YouTube, TikTok, Snapchat and LinkedIn, it’s essential that the Met Office continue to build engagement and trust on social media – even during times of benign weather – so that when severe weather is predicted as many people as possible are warned of its impacts."
        },
        {
            "text": "Don’t forget to follow @MetOffice to keep track of Santa this Christmas Eve."
        }
    ]
}