{
    "url": "https://openpolicy.blog.gov.uk/2021/12/16/tools-for-climate-policy-1-co-design-in-parallel-to-cop26/",
    "title": "Tools for climate policy: 1) co-design in parallel to COP26",
    "authors": [
        "beckymiller",
        "camillabuchanan"
    ],
    "categories": [
        "Policy Lab",
        "Skills, tools and techniques",
        "Thought Pieces"
    ],
    "pub_date": "2021-12-16T13:24:32+00:00",
    "content": [
        {
            "text": "We are sharing a short blog series on different methodologies that Policy Lab has experimented with in the context of action to address climate change. An important part of our ethos is learning-through-doing. This series aims to show how we have deployed different innovative techniques in real life policy settings. Our intention is to provide inspiration for how such techniques, coupled with our broader experimental mindset, could be deployed in relation to the climate crisis. This, the first blog, describes a policy co-design process we ran last month at the Design Council’s Design for Planet conference coinciding with COP26."
        },
        {
            "heading": 2,
            "text": "What is co-design?"
        },
        {
            "text": "A co-design approach allows ideas to be shared and shaped quickly, collaboratively and iteratively. The designer’s role is to create and facilitate a process that cuts away the layers of mediation and bureaucracy that tend to exist between people and large organisations. The outcome is to swiftly gather an understanding of the rich perspectives of people with lived experiences of an issue, whilst inviting those people to contribute ideas for change themselves. "
        },
        {
            "text": "Through our past projects, Policy Lab has shown how co-design can add value for policymakers working across government, and with a whole range of stakeholders, citizens and users. For example, our work with the Youth Policy Team in the Department for Digital, Culture, Media & Sport (DCMS) in 2019 allowed us to co-design a new youth democracy engagement platform with young people using Instagram. In a completely different policy context, our collaboration the year before with the Department for Transport (DfT) saw us designing a workshop for maritime sector stakeholders to co-design new visions and strategies for the future of their industry, which fed into the Technology and Innovation Route Map for the Maritime 2050 Strategy."
        },
        {
            "heading": 2,
            "text": "Designing for the planet"
        },
        {
            "text": "Design for Planet  was a 2-day festival that took place in November 2021 at the Victoria & Albert Museum in Dundee, held alongside COP26 and streamed online. It’s aim was to support the UK and global design communities to address climate change more directly. Convened by the Design Council, the hybrid event included speakers such as economist Kate Raworth and environmentalist Anita Okunde, 120 physical participants including representatives from 20 national design bodies around the world, and 5,500 online registrations. You can watch the Design Council’s two minute video on the festival, and read a summary blog by Cat Drew, Chief Design Officer at Design Council and previously in the Policy Lab team."
        },
        {
            "text": "The theme of ‘designing for the planet’ aimed to explore how designers can connect and align individual human needs with our planetary system. This is an evolution from an arguably more extractive historical model of design, and builds on the insights of practitioners such as Victor Papenek, who contemplated the environmental responsibility of the design sector in his 1971 book, Design for the Real World."
        },
        {
            "heading": 2,
            "text": "How can we… unleash the design sector on climate change?"
        },
        {
            "text": "There are many existing examples of designers deploying imaginative approaches to tackle climate change, from Olafur Eliasson’s Little Sun prototypes to Superflux’s Future Energy Lab speculations. However, given the pressing nature of climate change, combined with the UK Government’s commitment to addressing it, the Design Council asked Policy Lab to explore what policy changes could further unleash the sector on this global issue."
        },
        {
            "text": "We used a co-design approach to invite designers to express in their own terms the barriers, ideas and opportunities the design sector faces in addressing climate change. The ideas that participants developed ranged from a radical rethink of skills training for designers focusing on climate change and regenerative design, to carbon accounting in all design projects, and more responsible ways to consider resource usage with other countries."
        },
        {
            "heading": 2,
            "text": "Framing and crafting"
        },
        {
            "text": "We deployed a couple of specific techniques to facilitate this co-design session. First, we used a framing tool which we have written about before: our Styles of Government Action framework. This matrix allowed us to consider with participants both what changes may facilitate designers to address climate issues, but also how we might deliver those changes. This was important for the session because part of creating change in large systems involves not only designing a concept, but also the process by which that concept can come into being. "
        },
        {
            "text": "Second, we encouraged people to use their hands. The scale, urgency and entangled nature of the ‘design for planet’ challenge can feel overwhelming. One thing that designers do powerfully is to use visual and haptic cues in the physical environment to signal the presence of new culture and ways of working. We have previously written about using different sensory formats for policy discussions. For our workshops at Design for Planet, we were additionally inspired by ’craftivist’, Sarah Corbett who uses crafted objects to contemplate global issues, provoke thought and start conversations. This approach influenced our deliberate slow repurposing of found artefacts. These included handmade policy canvases to help participants develop their ideas, and origami polar bears used for an icebreaker exercise, crafted from discarded buffet cart bags collected on our train journey to Dundee."
        },
        {
            "text": "These simple objects created moments of mindful reflection for both our team in the crafting process, and the workshop participants through the physical interactions they afforded. Our experience at Policy Lab tells us that thoughtfully designed objects can be an incredibly effective tool for engaging conversation, creating shared understanding and in enabling people to transition into a different way of working and thinking. "
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Perhaps the strongest message coming from participants at the Design for Planet festival was the need to be intentional about the relationship between our collective practice and the planet and climate upon which we all depend. This ethos underpins our work, and we will describe more examples of how it can play out in practice in future articles. Subscribe to our blog to catch the next in our series on Policy Lab’s climate-related policy work. And if your team is keen to take an innovative approach to policy challenges, climate-related or otherwise, we’d love to hear from you: team@policylab.gov.uk."
        }
    ]
}