{
    "url": "https://skillsengland.blog.gov.uk/2026/01/12/driving-outcomes-through-place-and-sector-phil-smith-explores-skills-englands-2025-2026-delivery-plan/",
    "title": "Driving outcomes through place and sector: Phil Smith explores Skills England’s 2025-2026 delivery plan",
    "authors": [
        "Skills England Communications"
    ],
    "categories": [
        "Industrial Strategy",
        "News and announcements",
        "Strategy"
    ],
    "pub_date": "2026-01-12T15:11:50+00:00",
    "content": [
        {
            "text": "In the summer of 2025, shortly after the creation of Skills England, I shared with you the priorities that will guide our work. Now, as we begin a new year, I’ve been reflecting on the enormous energy and commitment I’ve seen across our skills system every day by employers, training providers, local leaders and national partners working to build a skills system that responds better and faster to the needs of employers, people and place."
        },
        {
            "text": "I’m pleased to now publicly share Skills England’s delivery plan for 2025-2026, which sets out how we will turn our long-term priorities into action over the remainder of this financial year, and beyond. It builds on the foundations we’ve laid since Skills England was established and shows what we’ll be doing to deliver a coherent and responsive skills system."
        },
        {
            "heading": 2,
            "text": "Our vision, mission and priorities"
        },
        {
            "text": "Our vision remains simple but ambitious, Better Skills for Better Jobs. We are ensuring that the nation benefits from a highly skilled workforce, making businesses stronger and fostering better prospects for people, wherever they live."
        },
        {
            "text": "Supporting government priorities on growth and opportunity, our mission is to:"
        },
        {
            "text": "This mission directly reflects what employers consistently tell us: for the UK to achieve its economic potential the skills system must meet business needs and give people clear routes into good skilled work."
        },
        {
            "text": "Our priorities are to:"
        },
        {
            "text": "1. Understand our nation’s skills needs and improve our skills offer"
        },
        {
            "text": "2. Simplify access to skills to boost economic growth"
        },
        {
            "text": "3. Mobilise employers and other partners, co-creating solutions to meet national, regional and local skills needs"
        },
        {
            "text": "To deliver on our ambitious vision, our work is structured around two strategic objectives."
        },
        {
            "heading": 2,
            "text": "Strategic objective 1: delivering for employers"
        },
        {
            "heading": 3,
            "text": "We will ensure technical education remains relevant and up-to date"
        },
        {
            "text": "We will do this through maintaining occupational standards, so they keep pace with industry changes, delivering the first foundation apprenticeships and rolling out new apprenticeship units that offer greater flexibility."
        },
        {
            "text": "This will mean up to date employer insight shapes our skills system and that technical education responds to employers’ needs."
        },
        {
            "heading": 3,
            "text": "We will support delivery of the industrial strategy"
        },
        {
            "text": "To ensure key industrial strategy sectors have strong skills plans to develop their growth, we are supporting the implementation of four sector skills packages in:"
        },
        {
            "text": "Each package will contain offers tailored to the industry’s needs."
        },
        {
            "heading": 3,
            "text": "Local Skills Improvement Plans"
        },
        {
            "text": "We will ensure the skills system meets the needs of local economies and individuals through the development, review and implementation of Local Skills Improvement Plans (LSIPs)."
        },
        {
            "text": "This will mean local skills training needs are aligned with employer needs and improve economic growth through collaborative planning between businesses and education providers."
        },
        {
            "heading": 3,
            "text": "We will support small and medium sized businesses (SMEs)"
        },
        {
            "text": "We know that SMEs can struggle to navigate the skills system. We will be sharing successes from case studies so we can deepen local support in coming years for these employers."
        },
        {
            "heading": 3,
            "text": "Delivering a new Skills Investment and Infrastructure Offer"
        },
        {
            "text": "We will develop a skills investment service, identifying where internationally mobile investors and large infrastructure projects face skills challenges. We will work with them and other partners to coordinate solutions, helping investors to navigate the skills system and enable strategic place-based investment into the United Kingdom."
        },
        {
            "heading": 2,
            "text": "Strategic objective 2: delivering for people"
        },
        {
            "heading": 3,
            "text": "We will work with industry to deliver AI upskilling"
        },
        {
            "text": "We will help deliver the national ambition of 7.5 million workers upskilled in AI by 2030. This will give more people the digital capabilities they need, ensuring they can benefit from, and keep up with, technological change."
        },
        {
            "heading": 3,
            "text": "Strengthening pathways into priority sectors"
        },
        {
            "text": "We will work across government to strengthen the pathways into priority sectors through producing job plans in key industrial strategy sectors, growing our domestic skills pipeline. This will mean we reduce reliance on migration in key sectors of the economy."
        },
        {
            "heading": 3,
            "text": "Providing rapid support for workers impacted by severe economic shocks"
        },
        {
            "text": "We will work with partners and regional leaders to provide rapid support for workers impacted by major redundancies or economic shocks. This will mean people can retrain locally and reconnect with workforce opportunities quickly."
        },
        {
            "heading": 3,
            "text": "Getting more young people into work"
        },
        {
            "text": "We will work with the Department for Work and Pensions to identify barriers and strengthen support for young people into employment. This will mean they can gain confidence and skills needed to access sustained work."
        },
        {
            "heading": 3,
            "text": "Skills data"
        },
        {
            "text": "Good skills data is essential for better decision making on skills provision."
        },
        {
            "text": "We will publish the first National Skills Need Analysis, which will provide a single trusted view of the skills our economy needs now and in the future."
        },
        {
            "text": "We have already published:"
        },
        {
            "text": "As we continue into 2026, this plan reflects ambition and practicality to deliver on skills challenges. I am immensely grateful for the expertise and commitment our partners bring, and I look forward to working with you all to deliver on these ambitions."
        },
        {
            "text": "Phil Smith CBE"
        },
        {
            "text": "Chair, Skills England"
        }
    ]
}