{
    "url": "https://food.blog.gov.uk/2023/01/04/get-comfortable-with-being-uncomfortable-fsa-in-nis-boardroom-apprentice-reflects-on-her-first-few-months/",
    "title": "’Get comfortable with being uncomfortable’ - FSA in NI’s Boardroom Apprentice reflects on her first few months",
    "authors": [
        "Catherine Hardy, Communications Manager (Northern Ireland)"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-01-04T14:30:55+00:00",
    "content": [
        {
            "text": "It has been a busy few months for Judith Hanvey, the FSA in Northern Ireland’s Boardroom Apprentice, with an overnight trip to Oxford for a Board retreat and a fact-finding visit to Lakeland Dairies with NIFAC colleagues."
        },
        {
            "text": "“I really valued the Lakeland Dairies visit as it brought to life the topics being discussed at recent Northern Ireland Food Advisory Committee (NIFAC) meetings such as the Northern Ireland Protocol. It helped me to appreciate the complexities which businesses in Northern Ireland are having to consider. It was also wonderful to visit such a successful company catering to global customers, just down the road in Newtownards.”"
        },
        {
            "text": "The Board Meeting in December was held in London. Unfortunately, Judith could not attend in person due to illness but joined online."
        },
        {
            "text": "Judith says it has been a steep learning curve so far. “I’m starting to really understand the saying, 'get comfortable with being uncomfortable'! I have particularly felt this during the last couple of meetings, with substantial agenda items such as the Retained EU Law Bill and organisation in-year prioritisation.”"
        },
        {
            "text": "“I picked the Food Standards Agency as my host board as it felt like the most natural fit due to my experience in nutrition and public health. I am quickly learning that, although an interest in the organisation’s daily operations is valuable, there can be much more complex and crucial topics and decision-making involved in being a board member.”"
        },
        {
            "text": "There is also a learning day each month for all the NI Boardroom Apprentices. The last session was about governance, dealing with legal duties, responsibilities, and liabilities as well as practical arrangements of boards. After Christmas, they will be looking at finance. Judith is hoping this will unlock more knowledge for her which she can then apply in upcoming board meetings."
        },
        {
            "text": "Meeting and mixing with the other apprentices has also been reassuring. “We are all in different organisations across the public and third sectors and it is great to share learning and experiences so far.”"
        },
        {
            "text": "There is a Board retreat organised for this month in York for which Judith intends to travel."
        }
    ]
}