{
    "url": "https://companieshouse.blog.gov.uk/2023/01/04/how-we-approach-wellbeing-at-companies-house/",
    "title": "How we approach wellbeing at Companies House",
    "authors": [
        "Sarah Williams - Engagement Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2023-01-04T16:00:16+00:00",
    "content": [
        {
            "text": "Wellbeing at work used to be a nice thing to do. It was always an add on in the world of HR; something that organisations felt they just ‘did’. "
        },
        {
            "text": "However, the COVID-19 pandemic taught us one thing – that our health and wellbeing should never be taken for granted. Lockdown fundamentally shifted how and where we do our work, and how we manage our own wellbeing.  "
        },
        {
            "text": "Fast forward almost 3 years, Companies House, like many other organisations has seen the importance of embedding a health and wellbeing agenda in everything that we do. That’s why we developed a strategy which firms up our approach. It was important for us to demonstrate to our people that their wellbeing is our priority, and a strategy helps to cement that commitment."
        },
        {
            "heading": 2,
            "text": "A culture of conversation"
        },
        {
            "text": "Our culture change journey started in 2018, when we got rid of our old ways of mid-year reviews and one-to-ones and replaced them with our ‘culture of conversation’. For a public sector organisation this was a bold move; we were used to more formal and rigid structures of giving and receiving feedback."
        },
        {
            "text": " As a manager, every conversation I now have with the team starts with ‘how are you’, putting wellbeing at the forefront of our relationships and checking in when we want to. Everyone has wellbeing, it looks different to every individual and people develop their own coping mechanisms to stay healthy. Our approach helps our leaders really understand their teams – identifying what makes them tick and helping to harness an environment where everyone can flourish and help to drive high performance."
        },
        {
            "heading": 2,
            "text": "Wellbeing champions"
        },
        {
            "text": "To ensure that our strategy was embedded throughout the organisation and had a positive impact on the way that we work, we recruited a network of wellbeing champions from across the organisation. By delivering a directorate approach to wellbeing, it allows us to tailor support – picking up on key dates and times of increased workload and stress for different teams, to be able to action wellbeing initiatives and provide appropriate communications and opportunities for support. "
        },
        {
            "text": "Our champions know the people in their directorates. They know what impacts their wellbeing and are keen to provide the best support possible the role of a wellbeing champion is voluntary – 27 colleagues from across the organisation have identified themselves as a champion. By highlighting the wellbeing at work agenda, role modelling healthy practices and sharing messages, our network embeds the culture of wellbeing throughout their directorates."
        },
        {
            "heading": 2,
            "text": "Real time feedback from data"
        },
        {
            "text": "Another way that we’ve developed our approach to wellbeing at Companies House is by using data. "
        },
        {
            "text": "For me, this was a daunting challenge. I’d only ever been used to working with people, not numbers! It was a new way of working for me, analysing people data to understand what it was showing. It was skill that I never thought I would learn or need. However, I've found that data gives great real time insight into what is impacting our people. I'm then able to act upon this data by delivering a monthly wellbeing campaign focusing on what people need support with."
        },
        {
            "text": "Acting upon feedback is one of the most important things we can do in the world of workplace wellbeing. By shaping our approach based on data to shape our campaigns, we saw a 230% increase in the number of colleagues accessing financial support for eye test, as a result of an eyesight campaign in February 2022. In May 2022, 499 colleagues received insight into recognising signs of burnout."
        },
        {
            "text": "In June 2022, we focused on corporate social responsibility (CSR) in response to 21% of colleagues who indicated in our annual people survey that they felt lonely some of the time. We highlighted the social opportunities of volunteering and participating in groups, and saw a 123% increase in volunteering opportunities taken up following the campaign, compared to the previous month."
        },
        {
            "text": "In September 2022, our wellbeing champions delivered ‘The Big Wellbeing Week’ on-site. This featured exercise sessions delivered by colleagues and included mindfulness, yoga, dancing and coffee and crafts – with 74% of attendees stating that the sessions inspired them to find new ways to support their wellbeing."
        },
        {
            "heading": 2,
            "text": "Our people networks"
        },
        {
            "text": "In our hybrid world, we're continually looking for ways to bring people together to maintain positive social connections. Feeling part of something and connecting with people that we feel comfortable with, really supports our social wellbeing. "
        },
        {
            "text": "We're lucky that 40% of our organisation are part of one of our 23 people networks. Our networks help to drive our health and wellbeing strategy forward, being our ears on the ground to tell us what’s important to our people. "
        },
        {
            "text": "Our strategy is based on 5 pillars of wellbeing – emotional, physical, social, financial, and digital. We cannot deliver on this strategy alone. We need our people networks to be driving it forward and be our ears on the ground."
        },
        {
            "heading": 2,
            "text": "External recognition"
        },
        {
            "text": "We're proud of how we approach wellbeing at Companies House. We've recently been awarded the gold award for We Invest in Wellbeing – this is the first time we've undertaken the assessment, which sits alongside our platinum award for Investors in People. "
        },
        {
            "text": "In March, we were also awarded the gold standard at Mind’s Workplace Wellbeing Index and ranked 16th out of 119 organisations that took part. "
        },
        {
            "text": "Having external recognition for our approach is testament to our culture, how we recognise everyone as individuals and celebrate our differences. We couldn’t do any of it without our networks. They drive forward our approach to inclusiveness, making sure everyone feels supported and can truly be themselves at work."
        }
    ]
}