{
    "url": "https://insolvencyservice.blog.gov.uk/2023/01/04/positive-voices-myth-busting-and-living-with-hiv/",
    "title": "Positive voices: myth busting and living with HIV",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "LGBT+",
        "People",
        "Uncategorized"
    ],
    "pub_date": "2023-01-04T11:30:50+00:00",
    "content": [
        {
            "text": "To mark 2022's World AIDS Day, the Insolvency Service’s LGBT+ Network welcomed Neil and Tim from the Terrence Higgins Trust to share with staff their experiences of living with HIV."
        },
        {
            "text": "World AIDS Day was founded in 1988 and is an annual event where people show support for those living with HIV, and to commemorate those who have died from an AIDS-related illness."
        },
        {
            "heading": 2,
            "text": "Terrence Higgins Trust: reaching out through shared experience"
        },
        {
            "text": "Neil and Tim are volunteers for the Terrence Higgins Trust’s Positive Voices, a programme where people provide informative talks and education sessions to education, corporate, public sector and other audiences about their personal experiences of living with HIV."
        },
        {
            "text": "Sophie is a Project Manager for the Insolvency Service, specialising in IT services, and invited Neil and Tim to share their stories."
        },
        {
            "text": "“We organised the talk with Neil and Tim as we wanted to do something where people could really understand first-hand about what it means to live with HIV and nothing can do that quite like hearing a personal story from someone directly impacted,” said Sophie."
        },
        {
            "text": "“We reached out to the Terrence Higgins Trust as the foremost charity in this area, as we had heard of their renowned Positive Voices programme where they help bring speakers with lived experience to workplaces, schools, and community groups."
        },
        {
            "text": "“It was really important for the network to share how much progress has been made in the science and management of HIV, that people can live a full and normal life thanks to treatment, and to bust the myths that still perpetuate about both HIV and AIDS.”"
        },
        {
            "heading": 2,
            "text": "Neil and Tim"
        },
        {
            "text": "Neil was diagnosed in 2001 with HIV and initially thought his life was over."
        },
        {
            "text": "“I was full of fear around my health and had a lot of shame about my status,” said Neil. “It took me to visit a drug and alcohol rehab in 2020 for me to realise that I needed some help and specific therapy to come fully to terms with HIV."
        },
        {
            "text": "“This is where I got some help from Terrence Higgins Trust (THT) which I am so grateful for. THT helped me accept fully my diagnosis and made me realise that HIV was something I could live with one day at a time by taking my medication. The advance in medication is incredible and I now have a standard life expectancy. I wanted to give back to THT, help others to come to terms with HIV but also to educate and challenge stigma. I am proud to be HIV positive today and to be able to share my story to inspire other people."
        },
        {
            "text": "\"I regularly attend 12 step fellowships to help support others in their recovery. I have a dog called Baxter and I hope to volunteer with him as a therapy dog. I enjoy spending time with friends, reading, living a spiritual life, being out in nature particularly hill walking and I have just started to learn to sing. I live a full and happy life now as HIV positive gay man.\""
        },
        {
            "text": "Tim moved to South Africa with his parents when he was a child. He finished schooling there and went to Drama School as his passion was acting."
        },
        {
            "text": "“Over the next 20 years, I worked in a variety of roles across television and the theatre,” said Tim. “I worked as an actor on and off for the next 20 years, playing various parts in"
        },
        {
            "text": "Shakespeare plays at the Cape Town National Theatre, as well as having a lead role in a television series that went on for three years."
        },
        {
            "text": "“But I also liked to be behind the camera. I worked as a producer and director in television and commercials, and produced and directed South Africa’s first World Aids Day programme. I have also been recognised by my peers and have won 12 awards as a producer/director from the South African National Film and Television Awards.”"
        },
        {
            "text": "Tim returned to the UK in 2018 and moved to Brighton. “I came across the Terrence Higgins Trust (THT) before deciding I wanted to volunteer and help their Positive Voices programme,” said Tim. “I was trained up ready to do public speaking in early 2020 and while my first talks were done via Zoom during the pandemic, I am thoroughly enjoying delivering these sessions in person.”"
        },
        {
            "heading": 2,
            "text": "Sharing their experiences"
        },
        {
            "text": "On the day, Neil and Tim spoke about the impact HIV stigma has had on their lives but how through simple changes, including workplace changes, we can all do our part to tackle HIV stigma."
        },
        {
            "text": "They also spoke about HIV transmission, prevention, treatment, living well with HIV, along with busting commonly held myths, as well as answering questions from the audience."
        },
        {
            "text": "Harry Richardson from the Business Services Directorate where he works as a Distribution Clerk, attended the presentation."
        },
        {
            "text": "“I thought that Neil and Tim’s insights about their work for the Terrence Higgins Trust helped to spread an extremely important message,” said Harry. “Their contributions were also livened by their unique perspectives, which were made more accessible by their openness and ability to be receptive of the comments and questions that were raised throughout.”"
        },
        {
            "heading": 2,
            "text": "An inclusive Insolvency Service"
        },
        {
            "text": "Sharon Lewis, Deputy Chief Operating Officer and the agency’s sponsor for the LGBTQ+ network, said that one of the aims of the agency’s Inclusion First strategy is making our workplace more diverse and inclusive, where everyone can feel comfortable, accepted, valued, and supported to be their true self and deliver their best."
        },
        {
            "text": "“Only by understanding what other people are going through we can make this happen. So, understanding how we can all do our part to tackle HIV stigma is one of the ways we can make this happen,” said Sharon."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}