{
    "url": "https://educationhub.blog.gov.uk/2023/01/04/studying-maths-to-18-what-you-need-to-know/",
    "title": "Studying maths to 18 – what you need to know",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-01-04T17:42:01+00:00",
    "content": [
        {
            "text": "There are still too many people who are being held back by poor maths both in their careers and in their personal lives."
        },
        {
            "text": "Prime Minister Rishi Sunak has said that he wants to see all students in England study some form of maths to 18 to ensure that they leave school better equipped for the jobs of the future."
        },
        {
            "text": "Just half of all 16–19-year-olds study maths. Yet in a world where data is everywhere and statistics underpin every job, our children’s jobs will require more analytical skills than ever before."
        },
        {
            "text": "The Prime Minister set out the plans in a speech on 4 January 2023."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "Why is maths so important? "
        },
        {
            "text": "So many jobs and careers require a good level of maths – particularly quantitative and analytical skills. But at the moment around 8 million adults in the UK have maths skills lower than those expected of a nine-year-old meaning lots of rewarding jobs might not be available to them. Part of the problem is that at the moment only around half of 16–18-year-olds study maths. But it goes beyond careers and employment, so many aspects of everyday life – from managing personal finances to understanding offers in the supermarket – require a decent level of maths."
        },
        {
            "text": "Many other countries – including Australia, Canada, France, Germany, Finland, Japan, Norway and the USA – ensure students take some form of maths until they’re 18 and the Prime Minister has made clear that England will do likewise."
        },
        {
            "heading": 3,
            "text": "How will 16-18-year-olds study maths under these plans?"
        },
        {
            "text": "Further detail will be set out in due course but we are exploring existing routes, such as the Core Maths qualifications and T-Levels, as well as more innovative options. This does not mean compulsory A level maths for everyone."
        },
        {
            "heading": 3,
            "text": "What level of maths do pupils study at the moment? "
        },
        {
            "text": "Maths is compulsory on the curriculum for all pupils in England up to age 16. We expect them to leave primary school having mastered the basics before going on to apply those fundamental principles to more complex problems in secondary school. Pupils that don’t get a grade 4 or above in their maths GCSE have to resit the exam if they want to carry on studying in a school or college after they’re 16 – this is already helping make sure fewer young people leave school without basic maths skills."
        },
        {
            "text": "Since 2010 we have seen a number of key changes in the way maths is taught in school. These include the introduction of ‘mastery teaching’ – based on a Singaporean model of teaching that fosters a deeper understanding of the subject – and of Maths Hubs which help teachers around the country share and develop best practice in maths teaching."
        },
        {
            "text": " "
        }
    ]
}