{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/10/24/a-way-to-prove-who-you-are-that-is-fit-for-the-uks-digital-economy/",
    "title": "A way to prove who you are that is fit for the UK's digital economy",
    "authors": [
        "Hannah Rutter"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2024-10-24T09:00:19+01:00",
    "content": [
        {
            "text": "At DSIT, we’re working to accelerate innovation, to ensure new and existing technology is developed safely and deployed for good, and to drive a modern digital government that gives people their time back."
        },
        {
            "text": "We’re delivering on those objectives by making it easier for people to prove who they are and prove things about themselves across the whole of the UK economy."
        },
        {
            "heading": 2,
            "text": "Proving who you are is difficult"
        },
        {
            "text": "To prove who you are across the economy today, you have to use a patchwork of paperwork from the government and the private sector."
        },
        {
            "text": "Proving your age in the supermarket. Opening a bank account. Buying a house. These processes are complicated, time-consuming and expensive."
        },
        {
            "text": "You often end up sharing far more information than you need to do. For example, to prove your age in a bar or shop today, you have to show a document like a driving licence. This forces you to share detailed information – with someone you probably don’t know – like your date of birth, your sex, and your current address, when all they need to know is that you are over or under 18."
        },
        {
            "text": "These checks aren't reusable either. Every time a business has to check who you are, they have to start from scratch, asking you to hand over the same documents over and over again."
        },
        {
            "text": "It can also be unfair. Some people don’t have access to documents like passports or driving licences that most of us take for granted, because they can’t afford to get them. This freezes people out of identity processes, stopping them accessing essential services."
        },
        {
            "heading": 2,
            "text": "There is a better way"
        },
        {
            "text": "There is a better way to check that someone is who they say they are. We call this “digital identity”. Digital identity can make people’s lives easier, and unlock billions of pounds of economic growth."
        },
        {
            "text": "We’re doing this without any form of government identity card. This system does not involve a centralised database. Using a digital identity will be completely voluntary. You will be in control of your data and who it is shared with."
        },
        {
            "text": "Instead, you’ll be able to choose from a range of digital identity and attribute providers, based in the private and charities sectors."
        },
        {
            "text": "The provider will do the hard work of proving that you are who you say you are. Eventually, you’ll be able to re-use your digital identity across the economy, sharing only what is needed, when it is needed, and making the process of proving your identity fast, easy and safe."
        },
        {
            "text": "And whilst digital identity services will save you time, so you can focus on what matters to you, it will also help to drive economic growth. We estimate that a fully functioning digital identity market in the UK could create net economic benefits of around £4.3 billion over the next 10 years."
        },
        {
            "text": "Our programme of work is making all of this possible. In fact, in some limited cases, you can take advantage of digital identity services right now."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "This is an exciting time for our team, as we work across government to understand how modern trustworthy systems of digital identity can help unlock the new government’s priority missions."
        },
        {
            "text": "We’ll be using this blog to explain what we are doing and what’s coming next. Whether you’re a digital identity business, an organisation that needs to do identity checking, or just interested in our work we hope you’ll give us your feedback so we can make digital identities available to everyone and do that in a way that is safe, secure and protects individuals’ privacy."
        }
    ]
}