{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/24/deputy-prime-minister-promises-relationship-reset-with-councils/",
    "title": "Deputy Prime Minister promises relationship ‘reset’ with councils",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Local government"
    ],
    "pub_date": "2024-10-24T17:36:01+01:00",
    "content": [
        {
            "text": "Deputy Prime Minister Angela Rayner has today (24 October) vowed to forge a new relationship based on honesty and respect between central and local government, helping drive economic growth and improve lives."
        },
        {
            "text": "Speaking at the Local Government Association (LGA)’s annual conference in Harrogate on Thursday, the Deputy Prime Minister said she would build on the government’s progress in establishing a better, more collaborative relationship, as she launched a new Leaders Council to ensure Whitehall continues to listen to local leaders."
        },
        {
            "text": "The Council has been established to bring together local government leaders and Ministers to identify and tackle the strategic challenges facing local government. Its inaugural meeting took place today, chaired by the Deputy Prime Minister and Local Government Minister Jim McMahon."
        },
        {
            "text": "It comes as the government looks to shore up the foundations of local government so the focus can be on delivering for residents, with the aim of getting councils back on firm footing by ending competitive funding pots, and by providing stability through multi-year funding settlements."
        },
        {
            "text": "This week, the government also informed Parliament of its intention to move to a more supportive approach towards stewardship for local councils in difficulty. Local Government Minister Jim McMahon pledged the government would work closely with councils to solve problems and ensure services are delivered for residents."
        },
        {
            "text": "As part of her speech, the Deputy Prime Minister confirmed the government would not look to micro-manage councils, as local leaders are best placed to make decisions that affect them."
        },
        {
            "text": "Speaking at the Local Government Association Conference today, Deputy Prime Minister Angela Rayner said:"
        },
        {
            "text": "“We know what’s possible when you give people with skin in the game the power to change lives."
        },
        {
            "text": "“That is why we are resetting our relationship with local government and rebuilding its foundations, delivering services that people can rely on.”"
        },
        {
            "text": "The Deputy Prime Minister also used her speech to:"
        },
        {
            "text": "The speech was covered by the Independent/London Standard."
        },
        {
            "text": "The full transcript of the speech can be found here: Local Government Association Conference - GOV.UK"
        }
    ]
}