{
    "url": "https://opss.blog.gov.uk/2024/10/24/early-talent-at-opss-the-opss-regulatory-leaders-graduate-scheme-rlgs/",
    "title": "Early Talent at OPSS: The OPSS Regulatory Leaders Graduate Scheme (RLGS)",
    "authors": [
        "Emily Neville"
    ],
    "categories": [
        "Careers at OPSS",
        "Civil Service Careers",
        "Civil Service Graduate Schemes",
        "Early Careers",
        "Graduate Scheme"
    ],
    "pub_date": "2024-10-24T13:11:19+01:00",
    "content": [
        {
            "text": "We are dedicated to fostering the growth and development of our colleagues, helping them achieve their career aspirations. "
        },
        {
            "text": "Applications for the Regulatory Leaders Graduate Scheme (RLGS) opened on Monday the 7th of August. The RLGS will enable graduates to gain the skills, experience and knowledge to succeed in a regulatory environment."
        },
        {
            "text": "Hear from Emily about her experience of joining the scheme:"
        },
        {
            "text": "‘At university, I studied Law with Humanities, taking most of my modules in Law, English and History. "
        },
        {
            "text": "I applied for RLGS after speaking to a member of the OPSS Graduate Hub at my university careers fair. I was drawn in when we began to discuss the wide range of roles that were available to the graduates over four unique rotations. I am currently based in the policy impact area, working within the Consumer Policy and Delivery team. I help to deliver awareness campaigns; also assisting in the creation of materials that can be published to help consumers be aware of product safety issues. "
        },
        {
            "text": "One of the key elements of RLGS is learning and development. A notable example of my recent learning is a diversity and inclusion workshop that I attended. In general, there is a wide range of learning and development opportunities available for all OPSS employees."
        },
        {
            "text": " I always assumed that I would have a rigid career path into law after finishing my degree. However, I am excited by the fact that RLGS will help me to build a variety of skills and allow me to explore a range of different roles to find the best fit.’"
        },
        {
            "text": "Our commitment extends to nurturing talent from the very start of their careers through a variety of specialised development programs. We are especially eager to attract early talent from various groups. "
        },
        {
            "text": "We offer short-term placements, Internships and and Graduate Schemes that provide a glimpse into our work and the structure of the Civil Service. Additionally, our apprenticeships allow you to earn while you learn, combining practical experience with academic development."
        }
    ]
}