{
    "url": "https://space.blog.gov.uk/2024/10/24/enabling-technologies-programme-sensors-comms/",
    "title": "Enabling Technologies Programme: Sensors & Comms",
    "authors": [
        "Emily Jayne Peters"
    ],
    "categories": [
        "Catalysing Investment",
        "Funding"
    ],
    "pub_date": "2024-10-24T15:05:21+01:00",
    "content": [
        {
            "text": "Satellites have been in orbit for over 60 years, but we continue to seek ways to innovate the technology, resulting in better connectivity, communications, Earth observation and space sensors."
        },
        {
            "text": "The following projects funded by the UK Space Agency’s Enabling Technologies Programme (ETP) aim to develop new or improved instruments in the field of satellites, sensors and communications. Our ETP grants each fund £250,000 towards high-risk, high-reward research to improve technology readiness levels. "
        },
        {
            "text": "CubeSats are an inexpensive form of nanosatellite that have gained traction thanks to their standardised design and versatility. With this rise in popularity comes an increased demand for CubeSat efficiencies, to maximise the payload and increase science capabilities."
        },
        {
            "text": "One ETP-funded team at the University of Strathclyde is aiming to do just that with their, “Micro LEDs for Satellite Quantum Key Distribution” project. "
        },
        {
            "text": "Project Lead Daniel Oi explains: "
        },
        {
            "text": "The project is currently at its midway point, with the University of Strathclyde having successfully designed and fabricated the first set of devices, and the University of Bristol performing preliminary integration activities with their experimental apparatus. Based on the data gathered during the first device tests, a second device run will refine the design for further characterisation of QKD performance.  "
        },
        {
            "text": "This project team is a collaboration between the Department of Physics and Institute of Photonics, both at the University of Strathclyde, and the University of Bristol. Both universities are involved in the UK Quantum Communication Hub mission, SPOQC, to demonstrate satellite QKD from a CubeSat that is due to be launched in 2025, and the Canadian QEYSSat microsatellite mission. They have also collaborated on previous UK Space Agency projects as part of the National Space Technology Programme (NSTP) and National Space Innovation Programme (NSIP) to develop CubeSat QKD. "
        },
        {
            "text": "Meanwhile at the University of Birmingham, a team supported by ETP funding and led by Dr Leah-Nani Alconcel (associate professor at the School of Metallurgy and Materials) is developing antennae to monitor mechanical or surface condition of satellites directly from space in the project “Sub-Terahertz Inverse Synthetic Aperture Radar (ISAR) for monitoring of GEO assets – STAR”."
        },
        {
            "text": "Dr Alconcel said: "
        },
        {
            "text": "The results of STAR promise positive commercial outcomes as the ISAM market continues to grow at a rapid rate, bolstering sustainability and the longevity of spacecrafts and satellites. "
        },
        {
            "text": "Wrapping up their ETP-funded project is Oxford Dynamics (OD), who have been exploring the viability of automotive radar  systems for on-satellite detection of debris and other spacecraft, as part of its AI-based, multi-modal sensor Space Situational Awareness (SSA) framework, called The Great Eye."
        },
        {
            "text": "Automotive radar systems offer an intriguing and attractive opportunity for reducing SSA costs as significant non-recurring engineering (NRE) has been successfully completed on this type of sensor. "
        },
        {
            "text": "Automotive radars are characterised by being low cost, reliable and maintenance-free, with a small form-factor and the ability to operate under conditions of temperature extremes and vibration (and humidity). "
        },
        {
            "text": "Mike Lawton, from the OD team, said: "
        },
        {
            "text": "A roadmap to progress from this feasibility study to in orbit demonstration was also produced."
        },
        {
            "text": "Finally, Ultima Forma is working with various partners in industry using their extra-thin metal layering technology in a proof-of-concept ETP project, “Electroformed modular Q-band waveguide assemblies”, which aims to produce prototype Q-band waveguides for satellites by a novel modular electroforming process."
        },
        {
            "text": "Building on an earlier concept feasibility study, Ultima Forma is developing the manufacturing process for Q-band waveguides, including the modular components, flexible sections and joining technology, to produce configurable waveguide assemblies. These will be evaluated and tested for radio frequency (RF) performance by Airbus Defence and Space.  "
        },
        {
            "text": "The proof-of-concept will unlock the potential for a cost-effective Q-band waveguide manufacture process, accelerating UK satellite competitiveness in this emerging market.  "
        },
        {
            "text": "Ultima Forma is also making use of its’ electroforming capabilities to support projects aiming to decarbonise the aerospace sector: watch this space for updates coming soon!  Look out for our final blog post in the ETP series, which will focus on a variety of novel instruments and technologies that haven’t yet been captured in our previous topics (lasers and aiding exploration). "
        }
    ]
}