{
    "url": "https://environmentagency.blog.gov.uk/2024/10/24/monitoring-antimicrobial-resistance-in-the-environment/",
    "title": "Monitoring antimicrobial resistance in the environment",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Nature",
        "Rivers"
    ],
    "pub_date": "2024-10-24T08:56:49+00:00",
    "content": [
        {
            "text": "Microorganisms drive many of the biogeochemical processes that make the Earth habitable for people. These processes involve the movement and transformation of chemical elements and compounds between living organisms, the atmosphere, and the Earth's crust. However, some microorganisms can cause disease in people, animals and plants. So, over the past 100 years, a wide range of antimicrobial substances have been developed and used to control the growth of microorganisms in medicine, agriculture and industry. Microorganisms are now becoming increasingly resistant to these antimicrobials, putting at risk much of our modern healthcare and food supplies."
        },
        {
            "text": "The rise of resistance to antibiotics and other antimicrobials presents one of the greatest challenges that humanity faces. The impact of antimicrobial resistance (AMR) in clinical settings is widely recognised: it is thought to be responsible for increasing numbers of global deaths. Resistant organisms can develop in the environment too, while others may be released into the water, air or soil from human activities. In either case they can potentially go on to infect new hosts. However, we do not have enough information on the scale and spread of environmental AMR and what really drives it."
        },
        {
            "text": "Our role here at the Environment Agency is to create better places for people and wildlife and support sustainable development. That’s why we have acted on the government’s call for research into the environmental aspects of AMR and are looking at how we can monitor the development of resistance in the environment in future."
        },
        {
            "text": "In 2021 our Chief Scientist’s Group received HM Treasury funding with the UK Health Security Agency and Food Standards Agency to investigate environmental AMR as part of a wider cross-governmental research programme called PATH-SAFE. The programme is piloting the development of national surveillance networks for AMR and food borne diseases, using environmental sampling and modern techniques such as quantitative polymerase chain reaction (qPCR) and metagenomic sequencing that allows us to study the DNA of microorganisms."
        },
        {
            "text": "“Antimicrobial resistance presents one of those risks that crosses traditional government departmental boundaries. Working across disciplines in this research area has been rewarding and will be essential in future.”Dr Wiebke Schmidt, Environment and Health Senior Research Scientist"
        },
        {
            "text": "At the Environment Agency, our focus in the PATH-SAFE programme has been on:"
        },
        {
            "text": "Environment Agency scientists undertook a programme of research projects between 2021 and 2023. Our flagship project (SC210023: Pilot surveillance of antimicrobial resistance in river catchments in England) investigated the presence of resistant organisms, genes and substances in 3 experimental river catchments in England, each representing different land uses. We trialled a range of methods to detect and measure AMR in each catchment. This included culture-based (such as isolating target microorganisms), molecular (metagenomic and qPCR) and chemical analysis methods to better understand the advantages and limitations of each method."
        },
        {
            "text": "Resistant bacteria were found at all 3 sites. The details of when and where specific organisms and genes appeared may help us to understand the sources they come from and eventually, the risks that they pose. The heavily urbanised river catchment showed the highest numbers of resistant bacteria and the greatest number (an average of 27) of different resistance genes seen in a single location. In contrast, the more rural sites had lower numbers but also differences in the types of resistance present. "
        },
        {
            "text": "The results show that to fully understand AMR in surface waters you need a range of techniques including “classical” microbiology as well as the modern DNA techniques described above. Rivers can be affected by local sources of resistant organisms, but these may not be the only sources and understanding the detail will be essential to focussing on the right causes and successfully managing AMR risks in future. In addition to the water environment, our research looked at antimicrobials spread to land in biosolids and at options for AMR surveillance in marine waters and air, as well as wild fauna and flora."
        },
        {
            "text": "An important question that this research considered was whether it is possible to identify threshold amounts of antimicrobial substances below which the chance of AMR developing is much less. We found we could repurpose a method that was originally developed for clinical antibiotics to look at antifungals used in agriculture. As a result of this research, we are now closer to understanding how “minimum selective concentrations” may support future regulation. Our current research is developing threshold values for antifungals commonly used in medicines, crop protection and personal care and which are often widely detected in surface waters, to support future management and mitigation options."
        },
        {
            "text": "International agencies and national governments recognise that the environment plays a major role in AMR development and spread. Left unchecked, AMR presents risks to human health, agriculture and even future economic growth. Our involvement in cross-government research, here at the Environment Agency, is part of the answer to understanding those risks and providing the science and evidence needed to help future regulatory processes, such as permitting, inspecting, monitoring and enforcing, to address them."
        },
        {
            "text": "There’s more to do, as some of our recently published and ongoing work shows. But this work helps us to take an important step forward. We will continue to have an important role to play as we collectively tackle AMR in the environment and strive to create better places for people and wildlife.   "
        },
        {
            "text": "Don't forget you can subscribe to receive updates from the Environment Agency delivered to your inbox, or follow us on X. "
        },
        {
            "text": "     "
        }
    ]
}