{
    "url": "https://marinescience.blog.gov.uk/2024/10/24/ocean-country-partnership-programme-in-sri-lanka-marine-spatial-planning-marine-biodiversity-and-sustainable-seafood/",
    "title": "Ocean Country Partnership Programme in Sri Lanka - Marine Spatial Planning, Marine Biodiversity, and Sustainable Seafood. ",
    "authors": [
        "angharadelliman"
    ],
    "categories": [
        "biodiversity",
        "Climate Change",
        "marine protected areas",
        "OCPP",
        "Uncategorized"
    ],
    "pub_date": "2024-10-24T10:12:24+01:00",
    "content": [
        {
            "text": "Authors:  Lois Duff, Hannah Lawson"
        },
        {
            "text": "A team from the Joint Nature Conservation Committee (JNCC) and the Marine Management Organisation (MMO) travelled to Sri Lanka in July 2024 to build on the support offered through the Ocean Country Partnership Programme (OCPP).  "
        },
        {
            "text": "OCPP is a UK Government-led official development assistance (ODA) programme under the Blue Planet Fund, delivered by the Centre for Environment, Fisheries and Aquaculture Science (Cefas), the Joint Nature Conservation Committee (JNCC) and the Marine Management Organisation (MMO) on behalf of the UK Department for Environment, Food and Rural Affairs (Defra).   "
        },
        {
            "text": "The aim of the visit was to progress ongoing work on Marine Protected Areas (MPAs) and scope a work programme to March 2026 covering fisheries compliance and enforcement, and marine spatial planning (MSP).  "
        },
        {
            "text": "This visit took place alongside a visit by colleagues from the Centre for Environment Fisheries and Aquaculture Science (Cefas), focussing on marine pollution and aquaculture, providing a great opportunity to present the breadth of work being delivered under the OCPP.  "
        },
        {
            "text": "Marine Spatial Planning  "
        },
        {
            "text": "Whilst in country, the MMO OCPP team met with a range of government ministries, departments and agencies to discuss and agree priorities in relation to MSP - a tool that is used to manage conflict between activities and promote sustainable and equitable use of the marine environment.  "
        },
        {
            "text": "Meetings were also held with a range of non-governmental organisations (NGOs) to identify opportunities for collaboration and to ensure programme alignment.  "
        },
        {
            "text": "The visit concluded with a two-day consultation workshop on adopting a Strategic Environmental Appraisal (SEA) approach to MSP for Northwest Sri Lanka. The objectives of the workshop were:        "
        },
        {
            "text": "Workshop sessions focused on some of the key sectors in the Northwest – namely fisheries, offshore energy, and MPAs, with speakers representing a range of Sri Lankan government ministries, agencies, and NGOs, as well as OCPP itself. The workshop was attended by over 50 individuals and saw a very productive exchange of information on key activities, issues and current projects in the northwest region.  "
        },
        {
            "text": "The proposal for a pilot MSP in the Northwest region of Sri Lanka received wide support from those attending the consultation session. Building on work that has already taken place for terrestrial and coastal environments, the MMO’s Marine planning experts are developing a proposal for a pilot MSP in the Northwest region of Sri Lanka. This will be presented to in country partners for review and consideration later this year.  "
        },
        {
            "text": "Workshop participants engaging in the MSP strategic exercise.  "
        },
        {
            "text": "Dr Sean Jamshidi from the MMO presenting learnt from the UKs  "
        },
        {
            "text": "offshore wind sector.  "
        },
        {
            "text": "Marine Biodiversity  "
        },
        {
            "text": "Much of OCPP’s support under this theme is focused on supporting Sri Lanka’s ambitions and international commitments to marine conservation, including being a signatory to the Kunming-Montreal Global Biodiversity Framework which commits countries to protect and conserve at least 30% of the world’s land and ocean by 2030.  "
        },
        {
            "text": "In addition to supporting the MSP workshop, the JNCC OCPP team met with key Sri Lanka colleagues to continue progress on a range of deliverables.  "
        },
        {
            "text": "This included meeting with the Department of Wildlife Conservation (DWC) to discuss ongoing and future work focused on MPAs. OCPP has delivered five Management Effectiveness Tracking Tool (METT-4) assessments last year for DWC and will be delivering a further four assessments this year. METT-4 assessments are a type of Protected Area Management Effectiveness (PAME) assessment. They support MPA managers to measure and understand the impact of their management actions on protected areas, the habitats and species within them, and the local communities who interact with the protected area.  "
        },
        {
            "text": "The team also met with Environment Foundation Limited who are delivering an MPA mapping and network analysis contract for OCPP.  "
        },
        {
            "text": "Sustainable Seafood "
        },
        {
            "text": "During the visit, experts from the MMO’s global and operational teams met with several of the divisions within the Department of Fisheries and Aquatic Resources (DFAR) to discuss priority areas for assistance. Going forward, key areas of focus will include providing assistance with the analysis of Vessel Monitoring System (VMS) data to improve understanding of vessel activity, reviewing and updating the National Plan of Action for Illegal Unreported and Unregulated (IUU) fishing and building the evidence base of IUU from foreign flagged vessels within Sri Lanka’s Exclusive Economic Zone (EEZ). "
        },
        {
            "text": "This visit by the JNCC and MMO marked a crucial step forward in the OCPP- Sri Lanka partnership. Through meaningful collaboration with a range of stakeholders, the OCPP team made great progress by scoping where best OCPP can assist with MSP, fisheries management, and biodiversity conservation in Sri Lanka going forward. These collaborative efforts will play a key role in safeguarding marine environments while supporting the sustainable use of resources for future generations. "
        }
    ]
}