{
    "url": "https://prisonjobs.blog.gov.uk/2024/10/24/reclaiming-narratives-black-history-month-insights-from-community-payback-supervisor-victorias-19-year-career/",
    "title": "Reclaiming Narratives: Black History Month - Insights from Community Payback Supervisor Victoria's 19-Year Career ",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Black History Month",
        "Community Payback",
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2024-10-24T16:22:38+01:00",
    "content": [
        {
            "text": "In line with this year’s Black History Month theme of ‘reclaiming narratives’, we’re highlighting personal stories and career journeys to illustrate the varied experiences of Probation Service colleagues. We spoke to Victoria, a Community Payback supervisor, about what this year’s theme means to her and about her career journey in the Probation Service. "
        },
        {
            "text": "How long have you worked in your current role and why did you join? "
        },
        {
            "text": "I have worked in my current role for 19 years. I joined because I was working for the Citizens Advice Bureau, and a supervisor from the Probation Service came to the office with five offenders. They helped clear the overgrown garden and did some painting, which initiated my interest in the role of being a Community Payback supervisor. "
        },
        {
            "text": "What does your role involve and what do you find most rewarding about it? "
        },
        {
            "text": "My role involves working with offenders to lead, supervise, and motivate them while they complete their community service. I supervise offenders with unpaid work such as gardening, painting, and education training and employment courses. I find it rewarding as I am able to work with a diverse range of individuals, and after unpaid work, they approach me to say thank you, which is extremely rewarding. I received positive feedback from non-profits, charitable organisations and others who benefit from Community Payback work, that was also a rewarding experience. "
        },
        {
            "text": "What does the ‘reclaiming narratives’ theme mean to you? "
        },
        {
            "text": "The ‘reclaiming narratives’ theme means taking control of the stories we tell ourselves as individuals. It is important because historically, the narratives in the United Kingdom have been influenced by cultural stereotypes and colonialism. It is crucial for institutions to fully integrate the achievements of Black people across all fields. "
        },
        {
            "text": "What challenges do you face in your role? "
        },
        {
            "text": "The challenges you may face in this role are related to difficult behaviors from offenders and learning how to adjust and adapt to each individual and their needs. My strategy is applying my listening skills, being empathetic to their needs, and having a lot of patience in the support given to the offenders. "
        },
        {
            "text": "How has your background influenced your approach to your work? "
        },
        {
            "text": "With my background in the Citizens Advice Bureau, I am able to advise offenders on different matters such as benefits, employment, and housing issues, and provide signposting while giving them a fresh outlook on matters. "
        },
        {
            "text": "How does cultural competence play a role in your work? "
        },
        {
            "text": "Cultural competence, the ability to understand, communicate with, and effectively interact with people across cultures, plays a huge role in my work as it creates a welcoming environment, fosters teamwork, and eliminates disparities.   "
        },
        {
            "text": "Can you share a specific achievement in your career? "
        },
        {
            "text": "An education training and employment program, which I completed a few years ago, achieved the highest number of offenders signing up for the program by teaching them about it. The education and training program is run by the London probation service by the education and training team. The program entails training in first aid, gardening, painting, and ICT skills, which will enhance their chances of employability.  "
        },
        {
            "text": "How does HMPPS support diversity and inclusion and how could it improve? "
        },
        {
            "text": "HMPPS offers training and learning to help people deliver roles fairly and inclusively. Alongside a commitment to diversity and inclusion for all, they also have policies in place to ensure their services are inclusive of people of all ages, abilities, races, religions, sexual orientations, and more. HMPPS could offer more of these training sessions regarding diversity and inclusion as it is an extremely diverse Service. "
        },
        {
            "text": "What advice would you give to someone considering a similar path? "
        },
        {
            "text": "The advice I would give to someone considering a similar path is to always show empathy, compassion, and reflect your listening skills at all times while being attentive. Overall, I find my role rewarding and would encourage others to join. I have often come across offenders after their completed hours expressing gratitude and thanks which makes any challenges of the role worth it for me. "
        },
        {
            "text": "If you're passionate about helping others and looking for a rewarding career where you can make a real difference, consider our programme facilitator roles. Find out more. "
        }
    ]
}