{
    "url": "https://mhclgmedia.blog.gov.uk/2024/10/24/reporting-on-the-future-homes-standard-and-solar-panels/",
    "title": "Reporting on the Future Homes Standard and solar panels",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-10-24T14:59:29+01:00",
    "content": [
        {
            "text": "There has been some reporting this week on the Future Homes Standard and solar panels."
        },
        {
            "text": "We are clear we want solar panels on as many new homes as possible and the suggestion that there are plans to water down the rules on low-carbon standards is completely untrue."
        },
        {
            "text": "All options set out in the Future Homes Standard consultation would result in significant emissions reductions compared to previous standards. This would see those homes all built with no fossil fuel boilers, becoming fully net zero, without further cost to householders, by 2030 as the grid decarbonises."
        },
        {
            "text": "A final decision on the amount of solar panels that new homes will typically be expected to include is yet to be made. Solar panels are not currently mandated and it is a fundamental principle of building regulations that we do not constrain innovation by prescribing any specific technology."
        },
        {
            "text": "The final standard has yet to be determined, but will be shaped to ensure that new homes can be designed in keeping with local architectural practices, whilst also balancing energy bills, emissions, energy demand and construction costs."
        },
        {
            "text": "A Ministry for Housing, Communities and Local Government spokesperson said:"
        },
        {
            "text": "“These claims are inaccurate - we are not weakening the rules on low-carbon standards."
        },
        {
            "text": "“We want solar panels on as many new homes as possible, because they are a vital technology to help cut bills for families, boost our national energy security, and help deliver net zero."
        },
        {
            "text": "“It’s also crucial we set standards for new homes in a way that allows for future innovation and flexibility in technology and design, which is why the building regulations do not mandate one particular option.”"
        }
    ]
}