{
    "url": "https://cddo.blog.gov.uk/2024/10/24/techtrack-transforming-lives-through-apprenticeships/",
    "title": "TechTrack: Transforming lives through apprenticeships ",
    "authors": [
        "Thomas Beautyman, Deputy Director Government Digital Capability, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Cyber security",
        "Data",
        "Digital learning and development",
        "Digital strategy",
        "Government Digital and Data"
    ],
    "pub_date": "2024-10-24T14:08:18+01:00",
    "content": [
        {
            "text": "The TechTrack Apprenticeship programme was launched at the end of July. The applications we’ve received for the first cohort, which includes the first two apprenticeship roles of Software Developers and DevOps Engineers demonstrate a diverse pool. This includes, 70% of applicants coming from minority backgrounds and over 60% based outside of London. "
        },
        {
            "text": "TechTrack is a really important initiative, encompassing all departments across the Civil Service, and allowing every department to build its digital capability, fast. This is vital if we are to meet the continuing and escalating demand for digital skills, and the vital mission to transform public services and deliver world class technology. "
        },
        {
            "text": "Apprenticeships are a key part of how we can address skills gaps and drive economic growth, in line with the government’s ambitious plan for building a modern economy and society. "
        },
        {
            "heading": 3,
            "text": "Roles that are critical to delivering public services"
        },
        {
            "text": "TechTrack is recruiting to fill the four most in demand digital roles across government. These are:"
        },
        {
            "text": "If you are interested in a career in tech or upskilling your existing digital experience, these apprenticeships are an exciting opportunity to get involved in important projects that have a real impact on real people in society; helping to improve our public services and ensuring that AI works to all our benefit and making a difference to people’s lives across the UK. "
        },
        {
            "text": "TechTrack stands out from other level 4 apprenticeships because:"
        },
        {
            "text": "While applications for the first cohort of Software Developers and DevOps Engineers have recently closed, TechTrack is a live and rolling upskilling programme, and we will be opening applications for a second cohort for these two roles, early in the new year. Sign up to make sure you find out when the second cohort opens, including applications for the Business Analyst and Cyber Security apprenticeships."
        },
        {
            "heading": 3,
            "text": "Filling the digital talent pipeline"
        },
        {
            "text": "If you’re a department or talent lead within government, we’re especially keen to hear from you. Upskilling and building digital talent is vital to achieving our mission and we've committed to ensuring that we have a strong digital talent pipeline to fulfil your department’s tech needs, via a number of  routes."
        },
        {
            "text": "TechTrack will play a key role in ensuring our digital talent pool is constantly evolving. It aims to:"
        },
        {
            "text": "Since the Chancellor announced on 29 July that the government will move away from capping Civil Service headcount to an approach that ensures departments consider overall value for money in resourcing decisions. "
        },
        {
            "text": "We would like to remind you that you can place bids for TechTrack apprentices and can do so on the TechTrack departmental platform."
        },
        {
            "text": "You can also come along to one of our Information Sessions and meet the programme providers and ask questions: if you're a Civil Service Department or Talent Lead, reserve your place in advance."
        },
        {
            "text": "The TechTrack apprenticeships are open to everyone - existing and non-civil servants and if you are considering a career in digital, this apprenticeship programme is a unique opportunity to join the growing Government Digital and Data community. "
        },
        {
            "text": "You can find out more by visiting the TechTrack website."
        }
    ]
}