{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/10/24/the-office-for-digital-identities-and-attributes-ofdia-building-trust-through-governance-and-oversight/",
    "title": "The Office for Digital Identities and Attributes: Building trust through governance and oversight ",
    "authors": [
        "Graham Francis"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2024-10-24T09:00:00+01:00",
    "content": [
        {
            "text": "In this blogpost, we’ll be talking a bit about the role of the Office for Identities and Attributes (OfDIA), which will oversee the governance of the UK's digital identity market.  "
        },
        {
            "text": "Evolving our support for the digital identity market "
        },
        {
            "text": "We are committed to delivering a trusted, voluntary approach to digital identity that gives people greater convenience and control over their personal information, and which drives economic growth across the UK. "
        },
        {
            "text": "Through the responses to DSIT’s formal consultations, and our ‘trust in digital identity’ public dialogue, it has been clear just how important good systems of governance are to building this trust. "
        },
        {
            "text": "That’s why we’re now launching the Office for Digital Identities and Attributes, a team within DSIT that will provide clear, transparent systems for market governance.  "
        },
        {
            "text": "What OfDIA will do "
        },
        {
            "text": "OfDIA will be responsible for enabling the development of a trusted and secure digital identity market in the UK. "
        },
        {
            "text": "If you’ve worked with the team in the Department for Science, Innovation and Technology up to now, you will already know us and be familiar with a lot of what we do. "
        },
        {
            "text": "We’ll continue to oversee and mature the UK’s digital identity trust ecosystem – we’ll maintain the trust framework and other standards, ensure they are being followed, and make it easy to see who is following them. We will do so transparently, and in a spirit of co-creation with the market. "
        },
        {
            "text": "We’ll help open up delivery of new use cases, working across Whitehall and the private sector to identify ways in which citizens and businesses can benefit from digital identity. "
        },
        {
            "text": "We’ll work internationally to support development of digital identities that are interoperable and reusable.  "
        },
        {
            "text": "And we’ll keep delivering on our commitment to encourage the market to grow in a way which supports inclusion, so digital identity solutions can be accessed by all those who choose to use them. "
        },
        {
            "text": "Looking ahead, we’re aiming to work more with consumer groups across the UK to ensure that our system is working as it should, and clear processes are in place to support users if things do go wrong. "
        },
        {
            "text": "This includes work to understand the impact of the digital identity trust mark, which will be released to registered digital identity providers in due course. "
        },
        {
            "text": "We’ll track growth and innovation within the UK’s digital identity market, to understand how its products and services are evolving and are being adopted across the UK, and to gather evidence on new trends that our policies may need to respond to. "
        },
        {
            "text": "We’ll also be looking at how we can support growth of the digital identity ecosystem by enabling access to public authority data for the purposes of identity verification. "
        },
        {
            "text": "The future role of OfDIA "
        },
        {
            "text": "Establishing the Office of Digital Identities and Attributes within DSIT is a first step in the evolution of a trusted digital identity ecosystem for the UK. "
        },
        {
            "text": "We know from the responses to our public consultation and to the public dialogue that some stakeholders would prefer governance to be separate from central government.  Others want government to have an explicit role in saying which products and services are trustworthy.  "
        },
        {
            "text": "With no consensus, our priority is to get the market moving so the best place for the oversight function to sit – for now – is in DSIT. "
        }
    ]
}