{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/10/24/the-uk-digital-identity-and-attributes-trust-framework-clear-rules-that-services-can-follow/",
    "title": "The UK digital identity and attributes trust framework: clear rules that services can follow",
    "authors": [
        "Tom Oldfield"
    ],
    "categories": [
        "Digital identity",
        "UK digital identity and attributes trust framework"
    ],
    "pub_date": "2024-10-24T09:00:48+01:00",
    "content": [
        {
            "text": "When we’ve spoken to members of the public and to businesses across the economy about adopting digital identity services, one message has been clear: it’s hard to know what good looks like. "
        },
        {
            "text": "That’s why the government has created the UK digital identity and attributes trust framework. Or just ‘the trust framework’, for short."
        },
        {
            "heading": 2,
            "text": "A collection of rules and standards"
        },
        {
            "text": "The trust framework is a document of rules for creating a good digital identity and attributes service. It sets the minimum quality standard the government expects to see from a reliable, secure and trustworthy service. "
        },
        {
            "text": "The trust framework was created in collaboration with industry, academia, civil society groups and members of the public. We intend to review and refresh it every year to ensure it stays up-to-date."
        },
        {
            "text": "For the first time in the UK, every business has a clear, consistent vocabulary for the creation and use of digital identities and attributes. The trust framework is already enabling businesses to start confidently using digital identity services in their day-to-day operations."
        },
        {
            "text": "For example, hundreds of thousands of digital identity and attribute checks are now taking place each month, off the back of the trust framework and its rules."
        },
        {
            "heading": 2,
            "text": "No one, right way to build a product or service"
        },
        {
            "text": "The trust framework doesn’t say exactly how to build a product or service. That’s because there isn’t only one “right way” to create a digital identity service, and we want to enable the private sector to innovate, whilst setting clear guard rails."
        },
        {
            "text": "So, instead of detailed, onerous requirements, we’ve taken a technology-agnostic and standards-based approach. We define the outcome a service provider needs to achieve, rather than the methods they must use to get there."
        },
        {
            "text": "Unless it’s absolutely necessary, we also don’t tell companies which technologies they must use, or the exact content of their policies. Instead, we point to existing, internationally-recognised standards and approaches that we think represent best practice."
        },
        {
            "text": "For example, to meet the rules of the trust framework, a provider must have service and quality management processes in place. We recommend that these processes follow standards such as ISO 9001, ISO 20000-1 or the Information Technology Information Library (ITIL); but any process could be suitable provided it can meet the same levels of quality as those set out in these standards."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "We’ve already published three successive versions of the trust framework. Over 50 services have been certified against our latest publication. "
        },
        {
            "text": "If you'd like to find out more, you can find the most recent version and previous versions of the trust framework on GOV.UK."
        }
    ]
}