{
    "url": "https://cspl.blog.gov.uk/2024/10/24/the-nolan-principles-keeping-the-public-front-of-mind/",
    "title": "The Nolan Principles - keeping the public front of mind",
    "authors": [
        "Professor Mark Philp"
    ],
    "categories": [
        "30th Anniversary",
        "Nolan Principles"
    ],
    "pub_date": "2024-10-24T09:00:00+01:00",
    "content": [
        {
            "text": "Thirty years ago, following the ‘cash for questions’ scandal in the House of Commons, John Major established the Committee on Standards in Public Life to make recommendations to improve standards in public life.  In the Committee’s first report Lord Nolan set out ‘The Seven Principles of Public Life’ which he described as ‘a restatement of the general principles of conduct which underpin public life’ and intended ‘for the benefit of all who serve the public in any way’.  "
        },
        {
            "text": "Today, the Principles continue to elicit wide support from the general public and to express what they expect from those who govern them, whether elected or appointed."
        },
        {
            "text": "These 7 Principles - honesty, integrity, objectivity, accountability, selflessness, openness and leadership - have underpinned the Committee’s work for thirty years and contributed extensively to the development of the standards landscape in the United Kingdom.  They are high-level ethical principles rather than rules: those in public office should take decisions solely in terms of the public interest; they should not put themselves under any obligation that might influence them in their work; they should be accountable to the public for their decisions and actions; they should declare any private interests that might relate to their public duties; and so on.  In short,  it is an essential responsibility of those in public office that they serve the public interest.  "
        },
        {
            "text": "‘Public’ and ‘public interest’ were not terms that Lord Nolan’s report analysed in any detail although they are referenced throughout the Principles.  On the 30th anniversary, we have published an academic paper exploring further what these terms mean in respect of standards of public life.  "
        },
        {
            "text": "Public life is ‘public’ because it is open to and may affect any member of the community.  Public services are designed to serve citizens and benefit the community.   Equally, we, as members of the public, have an obligation to the system of norms, rules and procedures that unite us as a community, and to those in public office when they act in the service of the public. Many public services are provided by government or public bodies but by no means all. When a private body is contracted on behalf of the state it is beholden to the same Principles and takes on the same responsibilities to serve the public interest. "
        },
        {
            "text": "The Nolan Principles express the underlying trust that should govern the relationship between members of the community and those in public office. They resonate not simply because they act as a guide to those working with public resources, but also because they map the responsibilities that those in office have to the public who entrust them with these responsibilities.  The existence of these standards of conduct, the behaviour in accordance with them, and the relationship of trust between government and the public that the Principles set out, themselves constitute a shared public good and public value.  A society in which politicians, public servants and the public share an understanding of the Principles and act in keeping with them is a major public good and in the public interest - central to the well-being and functioning of the country and our communities.  "
        },
        {
            "text": "The way in which leaders talk about the value of public service within their organisations is also important.  Building an internal culture with a strong connection to the purpose of the organisation and the overriding duty to serve the public mobilises staff to act in a way that helps keep their responsibilities to the public first and foremost and deliver in the public interest - as CSPL argued in Leading in Practice.  "
        },
        {
            "text": "This sense of being a part of a common culture that is committed to the public good is a crucial part of the ethical compass for those in public office - from Ministers, teachers, nurses and local government officials to companies and charities contracted to deliver services to the public."
        },
        {
            "text": "Inevitably, public life involves tensions - those in office need to follow due procedures, but also deliver outcomes which those formal processes might sometimes be thought to delay or obstruct; individual office holders have their own career or personal interests that may clash with giving priority to the public interest; and members of the public can be torn between accepting the rules of the system and losing patience with the process and turning on the order itself.  "
        },
        {
            "text": "Individuals do not always act as they should; public scandals and poor service shake people’s confidence. Cynicism, 24 hour news and the sharing of distrust and misinformation on social media, have further eroded the public’s belief that the government and the political system more widely is working effectively on its behalf.  There are many drivers of such attitudes, but without a common language of public responsibility and service, this pact between the people and those who govern them risks becoming increasingly fragile. When principles are ignored, government and the exercise of its delegated powers breaks free of that relationship of trust."
        },
        {
            "text": "The Nolan Principles were developed in part to help steer those in public office in ways that would help re-cement trust in public life. They clearly have the potential to do that, but only as part of a wider and continued drive to maintain high ethical standards in public life.  Nolan’s Principles have served us well for nearly thirty years in expressing the nature of the understanding between those in public office and the public.  The challenge now is how to continue articulating their value and meaning for new generations in an increasingly complex world. "
        },
        {
            "heading": 3,
            "text": "About CSPL"
        },
        {
            "text": "What are the Seven Principles of Public Life?"
        },
        {
            "text": "Watch a short video about the work of the Committee"
        }
    ]
}