{
    "url": "https://naturalengland.blog.gov.uk/2024/10/24/to-the-rescue-understanding-flight-heights-for-seabird-conservation-and-offshore-wind-expansion/",
    "title": "To the ReSCUE: Understanding flight heights for seabird conservation and offshore wind expansion",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Climate change",
        "Development",
        "Monitoring",
        "Seabirds",
        "Wildlife"
    ],
    "pub_date": "2024-10-24T12:01:53+01:00",
    "content": [
        {
            "text": "By Eddie Cole, ReSCUE Project Manager; Andrew Harwood, Senior Marine Ornithologist and ReSCUE Technical Lead; Lucy Hawken, Project Support Officer"
        },
        {
            "text": "Reducing Seabird Collisions Using Evidence (ReSCUE) is a multi-year, multi-partner project led by Natural England, funded through The Crown Estate’s Offshore Wind Evidence and Change (OWEC) Programme. OWEC seeks to facilitate the sustainable and coordinated expansion of offshore wind to help meet the UK’s commitments to low carbon energy transition whilst supporting clean, healthy, productive and biologically diverse seas.By using existing sources of data and innovative technology such as light detection and ranging (LiDAR), ReSCUE will provide a better understanding of seabird flight heights and vulnerability to collision with wind turbines. Better data, and reduced uncertainty, will provide increased confidence in the assessment of potential impacts and aid the development of design standards to mitigate them. This will help us achieve our vision of evidence led mitigation and consenting, contributing to seabird conservation and low impact expansion of offshore wind."
        },
        {
            "text": "The ReSCUE field study - validating methods for collecting and analysing seabird flight height data"
        },
        {
            "text": "In August 2024, the ReSCUE project team, supported by members of the NE Birds team, Earth Observations team, and the British Trust for Ornithology (BTO), conducted a field study to test, compare, and investigate sources of uncertainty associated with three primary methods for measuring seabird flight heights: combined LiDAR-digital aerial survey (LiDAR-DAS), laser-rangefinders, and telemetry. The study took place at the National Drone Hub at Predannack Airfield, on the Lizard peninsula in Cornwall."
        },
        {
            "text": "Light aircraft equipped with LiDAR technology flew transects above a target array comprised of 2D laser-cut and 3D printed seabird targets (of three varieties: gannet, kittiwake, and storm petrel). During the overhead flights, NE’s Earth Observation team flew three drones equipped with telemetry tags, performing lateral flights perpendicular to the direction of the aircraft transect at three different altitudes, to provide additional mobile targets for the aircraft to capture. At ground level, NE’s Birds team took readings of the targets and drones using laser-rangefinders."
        },
        {
            "text": "In addition to the land-based study, LiDAR-DAS suppliers have been commissioned to survey live seabirds off the coast at Flamborough and Filey Coast SPA. It is hoped that these surveys will generate large amounts of actual seabird data and further inform our understanding of potential sources of uncertainty associated with LiDAR-DAS."
        },
        {
            "text": "What is next for ReSCUE?"
        },
        {
            "text": "The results of the study will be analysed by BTO and NE and will inform the further development of best-practice methods for collecting and analysing seabird flight height data for use in offshore wind farm assessments going forwards."
        },
        {
            "text": "The ReSCUE project team is currently collating data from various existing studies and monitoring work carried out by a range of stakeholders. These data will mainly be comprised of laser-rangefinder measurements, bird-borne telemetry data, and measurements derived from LiDAR coupled with digital imagery. The collation will be used to identify gaps in available data that will be addressed by a suite of large-scale LiDAR surveys in 2025 using the best-practice we have developed."
        },
        {
            "text": "ReSCUE will provide long-lasting benefits by providing internationally relevant standards for data collection, processing, and analysis, and publicly available access to the evidence and outcomes from the project through the development of a toolkit, and other deliverables. The improved evidence provided by this project will increase confidence in impact assessments, consenting decisions and help inform approaches to mitigation. This will ultimately aid in the conservation of vulnerable species whilst supporting ambitious targets for offshore wind development."
        },
        {
            "text": "For more information on the project, contact eddie.cole@naturalengland.org.uk."
        }
    ]
}