{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/10/24/what-you-can-use-a-digital-identity-for-today/",
    "title": "What you can use a digital identity for today",
    "authors": [
        "Eleanor Curry",
        "Ellery Shentall"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2024-10-24T09:00:03+01:00",
    "content": [
        {
            "text": "We think digital identity services are a great way to prove who you are and things about you, but no one sets up a digital identity for the sake of it. A digital identity is only useful when you use it to do something."
        },
        {
            "text": "There are already dozens of digital identity services that have been certified against the UK digital identity and attributes trust framework. This independent certification process has given lots of organisations across the UK economy the confidence to start accepting digital identity. "
        },
        {
            "text": "In some parts of the economy though government or businesses need extra assurance, beyond the requirements in the trust framework, before a digital identity can be used. To test how our work can support digital identity in those kinds of scenarios, we’ve worked with other government bodies to develop some initial use cases for digital identity. "
        },
        {
            "text": "Three government-backed ways to use a digital identity today"
        },
        {
            "text": "So far we’ve created three sets of extra rules to provide the assurance needed in particular use cases. Because of these, you can now use a digital identity service:"
        },
        {
            "text": "The Home Office and the Disclosure and Barring Service are responsible for the specific requirements that need to be met by a digital identity provider and the checks employers and landlords need to do. "
        },
        {
            "text": "Our independent certification process ensures that digital identity providers meet the requirements of the trust framework, and the specific requirements for use in these three regulated areas. Currently more than 50 providers have been certified as meeting those requirements. "
        },
        {
            "text": "It’s possible – and increasingly likely – that the next time you start a job or you try to rent a flat, you’ll be able to do a digital identity check using one of our certified providers."
        },
        {
            "heading": 2,
            "text": "Removing barriers to digital identity adoption"
        },
        {
            "text": "We estimate that hundreds of thousands of right to work, right to rent and disclosure and barring checks each month are now taking place using digital identity services providers; but that’s just the small step towards a much bigger transformation we want to enable through our work."
        },
        {
            "text": "We are working with organisations and across government to remove barriers to digital identity adoption across the whole economy. "
        }
    ]
}