{
    "url": "https://moderncivilservice.blog.gov.uk/2025/09/17/32-ways-to-deliver-the-best-outcomes-for-the-public/",
    "title": "32 ways to deliver the best outcomes for the public",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Innovation",
        "Join a profession",
        "Modernisation and Reform",
        "One Big Thing",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-09-17T13:28:45+01:00",
    "content": [
        {
            "text": "Have you joined your profession yet? With 32 cross-government professions now available, including the newly launched Grants profession (welcome to the family!), there are more pathways than ever for civil servants to access specialised learning, career guidance, and professional networks that enhance both individual progression and collective capability."
        },
        {
            "text": "But what exactly is a government profession? It's where you can find specialist learning, best practice advice, career guidance, and peer support that helps you excel in your role and progress your career. These aren't just formal membership schemes – they're genuine professional communities that provide belonging, development, and opportunities throughout your career journey."
        },
        {
            "heading": 3,
            "text": "Why professional development matters "
        },
        {
            "text": "In June 2025, the Cabinet Secretary asked every civil servant to identify and connect with their relevant government profession and build their professional skills. This will help you deliver their roles effectively, better support career development and ensure that the Civil Service has the skills and confidence to deliver the best outcomes for the public and the government of the day."
        },
        {
            "text": "Professional skills development is essential to the success of the Civil Service. This is about investing in the skills that make you more effective in the role you're already doing and better equipped for the roles you want to do next."
        },
        {
            "text": "Profession membership should be a key part of the Civil Service experience - from onboarding through to performance conversations and career planning. Strong professional communities drive innovation, share expertise, and build the skills our organisation needs for the future."
        },
        {
            "heading": 3,
            "text": "Spotlight on Grants Profession"
        },
        {
            "text": "The newly launched Government Grants Profession unites a diverse community of grant-making professionals from across government departments, arm's length bodies and the broader public sector. The Grants Profession is open and interdisciplinary in nature - drawing on expertise from other professions such as Commercial, Finance, Operations, Project Management and Policy. "
        },
        {
            "text": "Grants are a vital policy lever and make up roughly.12% of total government expenditure (£153 billion allocated in 2023/24). They fund initiatives from healthcare, education, environmental sustainability, research to crisis support. Behind these schemes are dedicated and skilled grants practitioners involved in the design, management, administration and evaluation of grants schemes. Their expertise ensures that every pound is effectively used to deliver impactful citizen- focused outcomes and create meaningful benefits. "
        },
        {
            "text": "Do you think the Grants profession is for you? If you're a grants policy adviser, programme manager, assessment officer, or evaluation specialist, Grants could be your primary profession. Or perhaps it's not your core role but you occasionally support grants work and could consider Grants as your secondary profession – many colleagues in policy development, commercial roles, project delivery, or finance can find that understanding grant mechanisms enhances their primary expertise whilst opening up new career possibilities."
        },
        {
            "heading": 3,
            "text": "Exploring other open professions"
        },
        {
            "text": "The Grants profession joins 31 other cross-government professions, many of them open to civil servants if their work fits with the profession’s aims "
        },
        {
            "text": "Here is some inspiration to get you started:"
        },
        {
            "text": "Each profession provides targeted learning, networking opportunities, and career guidance tailored to specific skill sets and career aspirations. "
        },
        {
            "heading": 3,
            "text": "Getting started"
        },
        {
            "text": "Ready to find out more? Visit the Join a profession page to explore all 32 government professions and their offer. Not sure which profession aligns with your role? Use the online tool to identify the best fit for your skills and career objectives."
        },
        {
            "text": "Once you've identified your profession – whether it's Grants, one of the other 31 professions, – you can connect directly to access learning opportunities, career guidance, and professional networks. "
        },
        {
            "text": "What else can you do?"
        },
        {
            "text": "Professional development through government professions isn't extra work – it's the foundation of career success and public service excellence. With 32 pathways now available, there's never been a better time to connect with your professional community and invest in your future."
        }
    ]
}