{
    "url": "https://actuaries.blog.gov.uk/2025/09/17/adding-actuarial-value-to-workforce-modelling/",
    "title": "Adding actuarial value to workforce modelling",
    "authors": [
        "Jo Howlett - GAD Head of Workforce Strategy"
    ],
    "categories": [
        "Modelling"
    ],
    "pub_date": "2025-09-17T15:56:36+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Planning for uncertain workforce needs"
        },
        {
            "text": "Actuaries are specialists in risk, who develop projections in respect of people, resources and finances, where driving factors are uncertain. Actuarial teams are familiar with providing advice to pension plans and insurance arrangements, and one team at GAD are applying the same skills to strategic workforce planning."
        },
        {
            "text": "There are a lot of similarities in forecasting of headcount or workforce costs – sourcing and reviewing large amounts of data, considering best estimate future scenarios, and building a projection model of how people and resources move over time. "
        },
        {
            "text": "Working with an actuarial team on developing an organisational workforce plan, or a strategic workforce review project, can help tackle some of the risks early, and be able to communicate the longer term risks with clarity."
        },
        {
            "text": "Within the public sector, workforce plans are important to support efficient resourcing today and plan effective delivery for tomorrow. "
        },
        {
            "text": "The NHS 10 year Health Plan for England is one example of a national body considering what action is needed today to keep delivering critical services in future years. For the NHS and other providers of public services, the need for services is growing, and will need to be provided under tighter budgets. At the same time, technological change is changing the nature of many roles in ways that can’t always be predicted."
        },
        {
            "text": "In this blog, we talk through some of the key steps of building a workforce projection model and how it may be supported by GAD’s team of actuaries and analysts."
        },
        {
            "heading": 2,
            "text": "Good models are built on good data"
        },
        {
            "text": "One of the first steps in building an effective model is collating reliable, quality data. However, it is commonly the case that good quality, consistent data, spanning an entire workforce, is difficult to obtain or aggregate. Improving quality of workforce data often requires co-ordinated collaboration across HR, Finance, Digital, and outsourcing partners."
        },
        {
            "text": "At GAD, we assist organisations in the public sector in analysing existing data or developing a plan to improve available data. We can analyse and visualise data trends and advise on the impact of poor data quality. GAD is in a unique position having insights from pension scheme data for public service pension schemes, which can provide an idea of what future retirement patterns or exits from service could look like."
        },
        {
            "heading": 2,
            "text": "Choosing the best modelling approach"
        },
        {
            "text": "Once you have data, the next step is to use a tool or model to project your workforce data, considering demand side and supply side factors to understand where skills gaps may develop. The choice of tool will vary depending on many factors, including size, complexity, budget and objectives. "
        },
        {
            "text": "Ways that GAD may support different types of public body may include:"
        },
        {
            "text": "In many cases, actuarial models have a longer horizon than other business planning timescales, and are able to apply actuarial knowledge of demographic trends and flows of individuals between different states (e.g. working to retired). "
        },
        {
            "text": "Considering demographic analysis can highlight risks such as clusters of employees due to retire at a similar time. Some organisations may also be affected by population factors such as fertility rates, longevity improvements or healthcare demand."
        },
        {
            "heading": 2,
            "text": "Understanding model risk and future uncertainty"
        },
        {
            "text": "In setting up a model to forecast workforce data, you’ll need to make assumptions about what changes will affect the workforce, for example, rate of growth/attrition of different professions, and demand for different skills. It is also advisable to consider the uncertainty in assumptions you make."
        },
        {
            "text": "Experience will be different to the assumptions that are made, so it is important to test your assumptions to identify possible resource pinch points, cost concerns, and consider contingency plans."
        },
        {
            "text": "Actuaries routinely consider the risk of a model being incorrect. Risks arise through unreliable data, inappropriate assumptions, or unsuitable modelling approach. "
        },
        {
            "text": "GAD actuaries may illustrate the impact of individual risks by showing the sensitivity of results to small changes in a numerical assumption, or modelling alternative scenarios. Applied to workforce planning, this can help decision makers to draw balanced conclusions from the statistical analysis."
        },
        {
            "heading": 2,
            "text": "From analysis to action"
        },
        {
            "text": "Once a model is finalised and workforce projections created, it’s time to share findings and recommendations with senior stakeholders and decision makers. These may include proposals for training, recruitment or new areas of strategic focus. Feedback should be considered and looped back into the workforce planning process. "
        },
        {
            "text": "In some scenarios, strategic business changes may be required, such as a review of reward and benefits, including retirement benefits. Pensions specialists at GAD can provide advice on making the most of benefit changes from an employee value perspective. "
        },
        {
            "text": "The strategic workforce planning process is often illustrated as an iterative cycle – the CIPD version is shown below. The cycle helps to show that it is important to revisit a workforce plan regularly to reflect changes in workforce composition, business data and the wider environment. "
        },
        {
            "text": "As actuaries, the value we can add is to overlay a risk monitoring framework, inspired by the Actuarial Control Cycle, which articulates risks, sets appropriate assumptions, and monitors the validity of them as experience emerges."
        },
        {
            "heading": 2,
            "text": "Workforce strategy at GAD"
        },
        {
            "text": "GAD’s workforce strategy team supports government and public sector organisations by applying an actuarial mindset to workforce challenges. We apply statistical skills, data literacy, modelling expertise and visualisation to development of new workforce models and quality assurance reviews of existing ones. "
        },
        {
            "text": "Our experience working closely with public sector pension schemes and data insights from our related projects can support validation of assumptions in scenario forecasting. "
        },
        {
            "text": "If you are a public sector team on your workforce planning journey and would like to learn more about how we can work together, please get in touch."
        },
        {
            "text": "Jo Howlett - joanna.howlett@gad.gov.uk"
        },
        {
            "text": "Louise Fletcher -  louise.fletcher@gad.gov.uk "
        },
        {
            "heading": 3,
            "text": "Related blogs "
        },
        {
            "text": "You may be interested in these earlier blogs."
        },
        {
            "heading": 2,
            "text": "Disclaimer"
        },
        {
            "text": "The views expressed are the author’s own and the opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page. "
        }
    ]
}