{
    "url": "https://defrafmp.blog.gov.uk/2025/09/17/crab-and-lobster-fmp-explained-goals-benefits-and-updates/",
    "title": "Crab and lobster FMP explained: goals, benefits and updates",
    "authors": [
        "​​Regional Fisheries Groups team, Marine Management Organisation​"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-09-17T12:17:21+01:00",
    "content": [
        {
            "text": "In response to requests from the inshore fishing industry, raised through the Regional Fisheries Groups (RFGs), the Marine Management Organisation (MMO) has developed a set of infographics and short videos to help explain the goals and progress of the first five Fisheries Management Plans (FMPs), published in December 2023. "
        },
        {
            "heading": 2,
            "text": "Spotlight on the crab and lobster FMP "
        },
        {
            "text": "The crab and lobster FMP, is one of the first five plans and aims to ensure the long-term sustainability of crab and lobster stocks and the fishers who depend on them. "
        },
        {
            "heading": 2,
            "text": "What’s happening now? "
        },
        {
            "text": "We’re committed to transparency and keeping our stakeholders informed as the FMPs are implemented. To support this, we have created an infographic which outlines current actions, achievements, and next steps.  "
        },
        {
            "text": "It will be updated regularly and shared across: "
        },
        {
            "heading": 2,
            "text": "Goals of the crab and lobster FMP "
        },
        {
            "text": "We have also created an infographic and video to show the FMP goals and why they will help. "
        },
        {
            "text": "Learn about the goals of the FMP and why they were chosen: "
        },
        {
            "text": "Watch a short video designed for the fishing sector which gives a summary of the goals:"
        },
        {
            "heading": 2,
            "text": "Stay connected "
        },
        {
            "text": "Whether you're actively involved or simply want to stay informed, we encourage you to explore the resources, share your feedback, and subscribe to this blog for updates. For queries relating directly to the crab and lobster FMP, contact FMPs@defra.gov.uk "
        },
        {
            "text": "If you fish commercially or recreationally within the 12 nautical mile limit and would like to receive regular updates from the RFGs, including news on FMPs and inshore fisheries, email us at regionalfisheriesgroups@marinemanagement.org.uk to join the mailing list. "
        }
    ]
}