{
    "url": "https://moderncivilservice.blog.gov.uk/2025/09/17/empowering-innovation-and-citizen-outcomes/",
    "title": "Empowering innovation and citizen outcomes: ",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Join a profession",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-09-17T14:15:37+01:00",
    "content": [
        {
            "text": "A guest blog by Penny Horner-Long, Head of the Government Grants Profession."
        },
        {
            "heading": 3,
            "text": "Profession number 32 in government: The grant-making community - driving policy and mission delivery"
        },
        {
            "text": "The inclusion of grants as a recognised profession marks a significant milestone for the Grants Function — acknowledging the expertise and passion of our Grant-Making Community. "
        },
        {
            "text": "Grants are a vital funding tool for government. With £153 billion awarded in 2023-24, grants are an important strategic lever in the delivery of  government policy and achieving the government's five missions. Grants facilitate new research and innovation, strengthen capabilities in key sectors to stimulate economic growth, advance environmental sustainability, and support both community-led initiatives and national priorities, in the UK and internationally."
        },
        {
            "text": "The £300 million Great British Energy Supply Chain Fund aims to make Britain a clean energy superpower by boosting domestic manufacturing, supply chains and jobs in offshore wind. The Kinship Allowance Pilot and What Works Centre for Children and Families focus on improving social mobility and breaking the link between background and success. Neighbourhood Policing schemes and forensic initiatives support Labour’s mission to ‘Take Back Our Streets’ by enhancing community safety. These grants translate government priorities into societal benefits, promoting economic growth, social inclusion and resilience."
        },
        {
            "heading": 3,
            "text": "My journey with grants"
        },
        {
            "text": "My journey with grants began over a decade ago, setting up the Grants Function to maximise the value and impact of government grant spend. Since then, we've made huge strides working in close partnership with practitioners across government to set standards, provide expert support and build capability. This has significantly improved ways of working, resulting in all departments and Arms Length Bodies achieving or exceeding the Grants Functional Standard. "
        },
        {
            "text": "A government grant is awarded every seven minutes! It's the diversity and impact of this funding and seeing the difference we make as a Function that keeps me hooked. "
        },
        {
            "text": "Successful grant-making isn’t simple; it involves dedicated teams, visionary leadership and expertise to design and manage schemes that protect public funds and maximise impact. It’s inherently complex, often needing creative thinking and solutions to deliver challenging policy outcomes. I am inspired by the ambition and skill of grant practitioners. Managing grants involves balancing innovation with prudence, exercising sound judgement and managing risk and opportunity. When handled by expert professionals, grants become powerful drivers for positive change."
        },
        {
            "heading": 2,
            "text": "The future of grant making…"
        },
        {
            "text": "Over the past decade, the grants community has evolved. The pandemic highlighted grants' vital role and the agility of grant-makers to respond swiftly. Grant funding doubled and became central to the UK's response - the £70 billion Coronavirus Job Retention Scheme safeguarded jobs and supported businesses during a national crisis."
        },
        {
            "text": "The landscape is continuing to change with centralisation of funding and greater involvement of local authority and devolved partners in testing what works and ensuring grant funds deliver impactful outcomes for government and citizens."
        },
        {
            "text": "Central to this progress is the passion and capability  of grants professionals committed to delivery, development and expertise. That’s why we have established a recognised Grants profession - to ensure everyone has the skills and tools needed for the effective delivery of grant funds. The Grants Profession will harness the expertise of grants practitioners and share best practices on what works to maximise impact and ensure public money delivers lasting benefits."
        },
        {
            "heading": 3,
            "text": "The evolution of grant careers"
        },
        {
            "text": "Grant practitioners are diverse: some work in grants as their main profession, others as a secondary profession. Many entered the profession by chance and have grown into senior experts motivated by the rewarding nature of grant-making - managing schemes that deliver real value."
        },
        {
            "text": "In recent years, we’ve embedded capability as a strategic priority, expanding recognised training, accreditations, and peer networks. This formal recognition at this stage in our journey affirms the value of practitioner expertise, fostering professional identity and reinforcing grants practitioners vital role in delivering government priorities."
        },
        {
            "heading": 3,
            "text": "What’s in it for professionals?"
        },
        {
            "text": "This profession will unify grants practitioners across government departments, arm’s length bodies, and the wider public sector. Building on the first grant-making qualification, it aims to create a professional identity, clear career pathways, and consistent professional standards - nurturing talent, from incomers to experienced leaders. You will benefit from comprehensive training, qualifications, communities of practice and growing opportunities. For organisations, a professional grants community helps ensure consistency, efficiency, and high standards - fostering pride and professionalism in what we do."
        },
        {
            "text": "Look out for the Grants Profession and Learning Festival later this year! While grants have come far over the past 13 years, this marks an exciting new chapter. I look forward to where this journey takes us, together."
        },
        {
            "heading": 3,
            "text": "Join us - Be part of the change"
        },
        {
            "text": "If you work in grants, I encourage you to raise your hand and join the Grants Profession - whether as a primary or secondary profession. This community offers opportunities to share knowledge, develop expertise, and advance your career. The launch recognises the vital contributions of grants professionals, whose work in policy design and administration delivers meaningful public impact."
        },
        {
            "text": "Grants is one of the 32 government professions. You can find out more on the Join a profession page."
        }
    ]
}