{
    "url": "https://space.blog.gov.uk/2025/09/17/from-satellites-to-solutions-tackling-blue-green-algae-in-lough-neagh/",
    "title": "From Satellites to Solutions: Tackling Blue-Green Algae in Lough Neagh",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Delivering Missions and Capabilities",
        "Earth from space",
        "Earth observation"
    ],
    "pub_date": "2025-09-17T11:38:26+01:00",
    "content": [
        {
            "text": "Lough Neagh is one of Northern Ireland’s most valuable natural assets. "
        },
        {
            "text": "The largest freshwater lake in the UK at over square 380 kilometres, it provides drinking water, supports fisheries and recreation, and holds cultural significance for the communities that live around its shores. "
        },
        {
            "text": "Yet, like many freshwater bodies across Europe, it is increasingly vulnerable to the growth of harmful blue-green algae. "
        },
        {
            "text": "These blooms are more than an environmental issue: they carry risks for human and animal health, disrupt economic activity, and place additional pressures on those working to protect and restore the lough."
        },
        {
            "text": "Responding to this challenge requires more than traditional monitoring alone. That is why the UK Space Agency, through its Unlocking Space for Government programme, has joined forces with the Department for Agriculture, Environment and Rural Affairs (DAERA) and partners in Northern Ireland to explore how space data can be applied directly to this pressing public need."
        },
        {
            "text": "Phase 1 of this work showed that combining satellite observations with in-situ measurements and environmental data can provide a richer picture of how harmful blooms form and evolve. "
        },
        {
            "text": "The progress achieved in just a few months underlined the potential for space-enabled services to offer faster, broader and more cost-effective insights than existing methods alone."
        },
        {
            "text": "With the start of Phase 2, this initiative is moving from trial to operational development. "
        },
        {
            "text": "Two teams, Plastic-i and Newcastle University, will now advance innovative tools that integrate radar and optical satellite imagery with forecasting models, drone data and newly developed low-cost sensors. "
        },
        {
            "text": "Their goal is to deliver a decision-support capability that can provide earlier warnings, more reliable predictions, and information that aligns directly with DAERA’s day-to-day management needs."
        },
        {
            "text": "This approach reflects a core principle of the Unlocking Space for Government programme: ensuring that investment in space innovation translates into real-world impact. "
        },
        {
            "text": "By funding innovative businesses and academic groups to work hand-in-hand with public authorities, we are providing space-enabled solutions to the most pressing government priorities and strengthening the UK’s wider innovation ecosystem."
        },
        {
            "text": "For DAERA and its partners, the benefits could be transformative. A system that offers predictive insights and short-term forecasts will improve the ability to safeguard public health, support the local economy, and target resources more effectively. "
        },
        {
            "text": "For the UK Space Agency, it demonstrates how collaboration, evidence and a delivery focus can turn advanced technology and data into practical tools that matter for citizens and communities."
        },
        {
            "text": "More broadly, the work at Lough Neagh highlights the contribution that space can make to critical national challenges, from environmental protection to resilient infrastructure and more effective and resilient public services. "
        },
        {
            "text": "It also shows how targeted investment in innovation can help early-stage organisations grow their capabilities, positioning them to deliver value not only in Northern Ireland but across the UK and internationally."
        },
        {
            "text": "What makes this programme distinctive is that it has been shaped around the priorities and operational realities of DAERA from the very start. "
        },
        {
            "text": "Rather than pushing technology in search of a problem, Phase 2 has been co-designed with the end user, ensuring that the tools being developed are practical, usable and directly aligned with how water quality is monitored and managed in Northern Ireland. "
        },
        {
            "text": "This user-driven approach gives the project a strong foundation for real adoption and impact."
        },
        {
            "text": "Looking ahead, the benefits could extend far beyond Lough Neagh. "
        },
        {
            "text": "As climate change increases the frequency and severity of harmful algal blooms worldwide, the solutions being pioneered here offer a blueprint for how satellite-enabled services can help manage freshwater ecosystems more effectively. "
        },
        {
            "text": "By building systems that are not only technically advanced but also operationally grounded, this work is laying the groundwork for greater resilience—supporting communities, safeguarding natural resources, and demonstrating how space can deliver lasting value to society."
        }
    ]
}