{
    "url": "https://dcmslibraries.blog.gov.uk/2025/09/17/maker-station-makes-an-impact-at-stockton-central-library/",
    "title": "Maker Station makes an impact at Stockton Central Library",
    "authors": [
        "Emma Tennant, Libraries Development Officer, Stockton‑on‑Tees Borough Council"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2025-09-17T15:48:09+01:00",
    "content": [
        {
            "text": "The Government announced the fourth round of the Libraries Improvement Fund earlier this year as part of the Government’s commitment to ensure libraries are able to upgrade their physical and digital infrastructure to adapt to changing user needs and can be enjoyed by future generations."
        },
        {
            "text": "We’re taking some time to shine a light on some of the earlier LIF rounds. Today, Stockton Libraries are talking about how LIF supported them to upgrade their central library."
        },
        {
            "text": "Stockton-on-Tees Library Service"
        },
        {
            "text": "Since receiving a Libraries Improvement Fund grant of £50,000 Stockton-on-Tees Library Service has revamped and renamed a space dedicated to creative technology. The newly named Maker Station now boasts state-of-the-art sewing machines, digital embroidery machines and new 3D printers, alongside a laser cutter, Cricut smart cutters, sublimation printer and heat presses."
        },
        {
            "text": "The funding has allowed the library to expand on a creative offer that aims to support new skills development as well as connect people with equipment that they may not be able to access elsewhere. Opportunities for people to come together, share knowledge and make new friends was also a big driver in wanting to develop the Maker Station facilities. "
        },
        {
            "text": "First to get to grips with the new technology were the library staff. A combination of training sessions and time for self-learning was essential for staff to upskill themselves, build confidence and develop ideas for how to engage members of the public with the equipment."
        },
        {
            "text": "A programme of beginner workshops and self-led Open Sessions has now been rolled out, encouraging people to either learn something new or bring along projects that they are working on. Plus, a weekly Sewcial morning provides a relaxed and friendly space for independent crafting. These regular sessions have been interspersed with pop-up workshops, which have developed into a seasonal programme of events."
        },
        {
            "text": "(Stockton-on-Tees Libraries)"
        },
        {
            "text": "Uptake has been positive, with over 600 people attending sessions since July 2024, and word continues to spread. One user has commented, “I learn a little bit more each time, it’s wonderful”."
        },
        {
            "text": "Young people have enjoyed themed 3D pen sessions and Lego Education digital sessions; using coding to bring Lego creations to life using sound, movement and lights. Additional sessions have been programmed for the ‘Holidays are Fun’ scheme, specifically aimed at children from low-income families. "
        },
        {
            "text": "The Maker Station can also be used as a collaborative space and has already been put to good use by external groups looking for somewhere to get creative. The Elm Tree and Fairfield branch of the Women’s Institute were commissioned to create some bunting in celebration of the 200th  anniversary of Stockton and Darlington Railway.  Over a six month period, five dedicated sewers met fortnightly in the Maker Station, creating 20 metres of rail themed bunting, which will be used at S&DR200 Festival events during 2025."
        },
        {
            "text": "Similarly themed Community Quilt workshops occupied Friday afternoons throughout March 2025. Led by local artist Harriet Mee, the sessions were a focal point for residents to come together to take part in the creation of a commemorative quilt. "
        },
        {
            "text": "Funded by the Libraries Connected and Arts Council England microgrant scheme, community groups and residents were encouraged to contribute a fabric panel, inspired by the history of the Stockton and Darlington Railway. The response has been fantastic, with both novice and experienced sewers keen to be involved. Art & Design students at Stockton Riverside College helped to bring the final piece together, with Film & TV students also getting involved to document the process. "
        },
        {
            "text": "One participant said, “Being in the house all day and hardly going out, this was a nice chance to get out and meet people with the same interests.”"
        },
        {
            "text": "The whole project has highlighted the value of people coming together to share creativity. Having the facilities available at the Maker Station has been central to making this happen."
        }
    ]
}