{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/09/17/new-regulations-for-clinical-trials-join-our-route-b-substantial-modifications-pilot/",
    "title": "New regulations for clinical trials – Join our Route B substantial modifications pilot",
    "authors": [
        "simongoodman"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-09-17T12:39:37+01:00",
    "content": [
        {
            "text": "By Anthony Carter – MHRA Low-Risk Assessor Manager, Clinical Investigations & Trials Operations Team"
        },
        {
            "text": "September 2025: This blog provides information about the Route B substantial modifications and why you should sign up to take part in the pilot if you are eligible."
        },
        {
            "text": "We developed new clinical trial legislation in collaboration with the Health Research Authority (HRA) and encouraged extensive stakeholder input via public consultation."
        },
        {
            "text": "The new clinical trials regulations were approved by Parliament in April 2025 and come into effect on 28 April 2026, providing a regulatory framework that is agile, innovative, and patient-centred. "
        },
        {
            "text": "A wide range of stakeholders have been involved in developing the draft guidance with us and were invited to provide comments and feedback on areas that needed updating, and also some new areas, reflecting the changes in the regulations.  "
        },
        {
            "text": "Risk proportionate support for reviewing Route B substantial modifications"
        },
        {
            "text": "A great example of this is how we are expanding our current risk proportionate approach to include the review of modifications to approved clinical trial applications. Once implemented under the new regulations, substantial modifications that meet the pre-defined criteria will be eligible for automatic approval through the  process."
        },
        {
            "text": "This will help to speed up the modification process and provide the applicant with a decision from the licencing authority (the MHRA) within 14 days from validation, instead of the 35 days required for Type A modifications."
        },
        {
            "text": "The Route B process will be mandatory for all eligible modifications to a clinical trial from28 April 2026."
        },
        {
            "text": "Join our Route B substantial modifications pilot"
        },
        {
            "text": "The Route B substantial modification pilot runs from 1 October 2025 to 31 March 2026. "
        },
        {
            "text": "We’ve already had more than 40 sponsors from industry, academia, and the NHS sign up to join the pilot. We can accommodate many more. Joining is simple, and we encourage eligible sponsors to take part and benefit from receiving a response to their amendment (or modification under the Medicines for Human Use (Clinical Trials) (amendment Regulations 2025) within 14 days, while at the same time familiarising themselves with the eligibility criteria and helping influence the future of clinical trials in the UK."
        },
        {
            "text": "Any modification eligible under section 11B of the Medicines for Human Use (Clinical Trials) (Amendment) Regulations 2025 can be included."
        },
        {
            "text": "Eligible sponsors interested in participating should visit our pilot guidance page and complete the registration form."
        },
        {
            "text": "If you have any questions, please email: CT-NotificationScheme@mhra.gov.uk"
        },
        {
            "text": "Reminder!"
        },
        {
            "text": "Draft guidance supporting the Medicines for Human Use (Clinical Trials) (Amendment) Regulations 2025 is available on the Clinical Trials Hub. The section on modifying a clinical trial covers the Route B substantial modifications criteria."
        }
    ]
}