{
    "url": "https://hmlandregistry.blog.gov.uk/2025/09/17/the-true-picture-of-property-fraud-in-england-and-wales/",
    "title": "The true picture of property fraud in England and Wales",
    "authors": [
        "Lynne Feddon, Head of Counter Fraud "
    ],
    "categories": [
        "Buying and selling property",
        "Law and practice"
    ],
    "pub_date": "2025-09-17T09:56:59+01:00",
    "content": [
        {
            "text": "Whilst recent media stories may have left homeowners fearing that property fraud is increasing dramatically, we can confirm that thankfully it remains relatively rare, in part due to some simple steps that people can take to protect their property. "
        },
        {
            "heading": 2,
            "text": "What is property fraud? "
        },
        {
            "text": "Property fraud takes various forms, from bogus landlords letting out properties they do not own to a criminal stealing a property owner's identity and using it to make a fraudulent application to HM Land Registry (HMLR) to register change of ownership or a mortgage deed, for example.  "
        },
        {
            "heading": 2,
            "text": "The scale of property fraud and what we are doing about it "
        },
        {
            "text": "In 2024-25, we received 4,429,092 applications to create or update the Land Register, of which only 86 were identified as fraudulent. That’s just over 0.0019%.  "
        },
        {
            "text": "But, whilst the scale of attempted property fraud is relatively small, we know the impact of property fraud on the individuals concerned can be devastating. "
        },
        {
            "text": "As well as continually reviewing and updating our fraud-detection methods, including ensuring all necessary documentation is provided and in order, we work in close partnership with other agencies across government and the property sector to raise awareness and help combat criminal activity.  "
        },
        {
            "heading": 2,
            "text": "Examples of frauds HM Land Registry has stopped  "
        },
        {
            "text": "We received an application to transfer ownership of a bungalow with a value of £360,000 – significantly below the average for the area. The owners were notified of the application by Property Alert and, on visiting the property, discovered the locks had been changed and a For Sale sign put up.  "
        },
        {
            "text": "They got in touch with us, and we cancelled the application to transfer ownership.  "
        },
        {
            "text": "In another example, we received an application to register a £200,000 mortgage on a terraced house. But the owner – who didn’t live at the property - said they had not made a mortgage application. We immediately cancelled the application.  "
        },
        {
            "heading": 2,
            "text": "How much fraud has HM Land Registry prevented?  "
        },
        {
            "text": "In the financial year 2024-25, HMLR prevented the registration of fraudulent applications against more than £59 million worth of property.  "
        },
        {
            "text": "Between 2020 and 2025, we prevented fraudulent applications against more than 300 properties worth over £194 million.   "
        },
        {
            "heading": 2,
            "text": "What happens if a fraud takes place? "
        },
        {
            "text": "Our state-backed guarantee (indemnity) protects homeowners whose properties are registered with HMLR, should they become a victim of registered title fraud. The scheme offers compensation – indemnity payments - if someone suffers a loss for a mistake in the register that is put right.  "
        },
        {
            "text": "In the financial year 2024-25, we made 4 payments totalling £398,964.  "
        },
        {
            "text": "It’s important to note that indemnity payments made may not relate to applications made in that same year as fraud can take time to detect, investigate and put right. "
        },
        {
            "heading": 2,
            "text": "What can you do to safeguard your property?    "
        },
        {
            "text": "Homeowners can also play a crucial role in combatting fraud by remaining vigilant and we encourage them to:   "
        },
        {
            "heading": 2,
            "text": "How to report property fraud   "
        },
        {
            "text": "If you think you’ve been the victim of property fraud or suspect fraudulent activity in respect of your own or someone else’s property, call our dedicated property fraud line (which also offers a Welsh language service).  "
        },
        {
            "text": "Call us on 0300 006 7030 Monday to Friday, 8am to 4.30pm.  "
        },
        {
            "heading": 2,
            "text": "Wider government advice to guard against fraud          "
        },
        {
            "text": "We work closely with various government organisations to combat fraud and amplify anti-fraud messages. Whilst our remit is to combat property fraud in the lodging of fraudulent applications for registration, we also want to help people avoid fraud of any kind – so do check out the Home Office’s advice and guidance at Stop! Think Fraud - stay ahead of scams . "
        }
    ]
}