{
    "url": "https://defradigital.blog.gov.uk/2025/09/17/transparent-transformation-bringing-people-along-with-change/",
    "title": "Transparent transformation—bringing people along with change",
    "authors": [
        "David Thomas"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2025-09-17T13:04:51+01:00",
    "content": [
        {
            "text": "David Thomas, Delivery Group Lead for Environmental Quality, reflects on his experience developing new ways of working across digital delivery."
        },
        {
            "text": "Recently Defra’s digital delivery department changed the way it delivered new services from a single large portfolio to a set of 11 delivery groups. More than just dividing the portfolio into smaller chunks, this change aimed to radically change our approach to delivery. As part of this change, I was asked to create a new governance model. This means a new model for how we decide what work we’ll do and how we’ll do it, as well as a set of processes for assuring the work had been done to an appropriate standard."
        },
        {
            "heading": 2,
            "text": "Applying agile working to transformation"
        },
        {
            "text": "I’m a bit of a governance geek, and could talk governance structures all day long, but digital transformation is more interesting to most people. Digital transformation is the process of changing an organisation to have digital services at its core. This isn't just a change which impacts people working in IT, but one that affects the whole organisation and the way people work. The change to working in delivery groups and the new governance model are a small part of a much larger transformation taking part across Defra."
        },
        {
            "text": "Digital transformations often fail in organisations. One of the reasons for this is the approach that is taken to transformation. Digital organisations need to be agile, meaning they can make lots of rapid changes in response to new information. Digital transformation programmes often run at a slower pace. They try to design a correct final operating model and move to that model in a few big steps."
        },
        {
            "text": "I was keen to approach this piece of transformation work in the same way that I would approach a digital project. I wanted to quickly come up with a draft governance model, test it out with a group of people and then iterate it. As soon as we had a model that was good enough, I wanted to roll it out. Once it was rolled out, I could carry on iterating on it based on how it worked in practice."
        },
        {
            "heading": 2,
            "text": "How we approached developing a new governance model"
        },
        {
            "text": "Digital projects are built by multidisciplinary teams. This means they have different people with different skillsets. The same is important for transformation work. Designers can help convey the model in an easy-to-understand way. User researchers could gather feedback on it. Subject matter experts from different areas of digital, data, technology and security also helped ensure that the model represented the full lifecycle of digital delivery. In the end we had a team of seven people working part time on this project, with a few more supporting."
        },
        {
            "text": "The approach we took was to develop a draft of the model, present it at a show and tell, and then iterate on that draft. We ended up doing this five times, before we had something we were happy to progress with."
        },
        {
            "text": "The show and tells were at times quite emotive. Change is tricky, and not everyone is bought in to new ways of working. An advantage of the approach we took is that we weren’t trying to say we had all the answers but could take on feedback and adapt the model. It also meant that the show and tells were filled with people who were for new ways of working and some who were more hesitant."
        },
        {
            "heading": 2,
            "text": "Communicating with people"
        },
        {
            "text": "Having an instant messaging channel for discussing the governance changes was very effective. Our show and tells were well attended, but only one person out of the 50 people on there could speak at once. Having another channel for people to discuss the changes meant people could digest the model at their own pace and ask us questions or discuss the changes amongst themselves."
        },
        {
            "text": "The user researchers on the team did a great job of approaching the stakeholders most affected by the governance model and gathering their feedback and requirements. These were done in one-to-one sessions outside of the wider show and tell. This meant the people who were most affected could give more direct feedback."
        },
        {
            "text": "Our interaction and content designers created multiple ways of viewing the model. This was a largely text-based description of the governance model, with different visuals to support."
        },
        {
            "heading": 2,
            "text": "The challenges we faced"
        },
        {
            "text": "Transparency is hard. Despite our best efforts to engage as many people as possible in our work, we were always finding new people who were surprised that it was happening, and they hadn’t been consulted."
        },
        {
            "text": "It was also tricky to remain focused on governance. The changes we were making to governance were part of a wider change, and people understandably wanted to talk about all of that. But we could only change governance processes so wanted to remain focussed."
        },
        {
            "text": "Getting the changes signed off has also been tricky. The work was completed several months ago, but we’re still negotiating sign of for it. The model has influenced the development of delivery groups so hasn’t been wasted work, but the speed of its roll out has been slowed by not being officially signed off. This emphasises the need for agile governance around digital transformation."
        },
        {
            "heading": 2,
            "text": "What's next"
        },
        {
            "text": "The final draft of the governance model has been published and is visible for everyone to see. Parts of that governance model are already being used by delivery groups, and an important part of the work is to roll this out more widely."
        },
        {
            "text": "As delivery groups mature and the model gets used, it will be important to keep it up to date. And as a delivery group lead, I’m looking forward to not only implementing it, but learning and adapting as I do so."
        }
    ]
}