{
    "url": "https://hmlandregistry.blog.gov.uk/2025/04/16/building-the-service-you-need/",
    "title": "Building the service you need",
    "authors": [
        "Simon Hayes, Chief Executive and Chief Land Registrar"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2025-04-16T15:00:25+01:00",
    "content": [
        {
            "text": "I know that improving the speed of registration is our customers’ number one concern. It is the same for all of us at HM Land Registry. I am pleased to be able to say we are making real headway on this now."
        },
        {
            "text": "We’ve always kept essential services running quickly, helping people move home, or their business. But the registration that follows a sale – after people have actually moved –  has taken too long. At the peak, some applications waited up to 20 months. "
        },
        {
            "text": "That’s far from good enough."
        },
        {
            "text": "So, we set a goal that by March this year we would have processed 95% of applications within 12 months of their submission. We surpassed that ahead of schedule."
        },
        {
            "text": "Some applications will not finally be completed until after that if we are awaiting a response to queries or notice to third parties on the application or doing the same on an application that is ahead in priority."
        },
        {
            "text": "This reduction in overall waiting times is a big step forward and I am proud of the work that has gone in to achieve this."
        },
        {
            "text": "We are not being complacent, though. We know we still have a lot further to go. We will remain absolutely focused on the speed of our service until it is back where our customers need it to be."
        },
        {
            "heading": 2,
            "text": "Laying the foundations for a faster, better service"
        },
        {
            "text": "The combination of changes we’ve made is starting to show results."
        },
        {
            "text": "1. Working more closely with you We’ve been working directly with customers to understand better what you need from us and how we can find easier and faster ways of doing business together. From cutting out common errors, to shaping services and data, we’re learning from your experiences and acting on them. "
        },
        {
            "text": "2. Training and recruitment at scale We’ve hired over 2,000 new caseworkers and launched our own Land Registration Academy to train them. It has taken time to feel the impact, but as new staff finish their training and gain further experience, we’re seeing faster progress on more applications. "
        },
        {
            "text": "3. Reshaping how we work We’ve restructured our organisation to make sure we can respond quickly to demand in the market, such as the recent Stamp Duty Land Tax deadline, with the right expertise and the right capacity, focused always on getting things right first time."
        },
        {
            "text": "4. Smarter use of technology We’re investing in automation, AI and secure digital services. We are digitising local land charges faster than ever before. These changes will help reduce delays and improve accuracy across the board. "
        },
        {
            "text": "All of this is helping us process more applications, reduce backlogs and build the foundations for a modern digital land registry at the heart of a reformed property market. "
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "We will continue our pursuit of a faster, more convenient registration service that meets your needs. I am confident in the progress we will continue to make in the coming months.  "
        },
        {
            "text": "As one example, we’ll keep working with you to reduce delays caused by requisitions. Starting this month, firms will receive an email with simple insights into the most common avoidable errors – and how to prevent them. Please check with the ‘responsible person’ on your HM Land Registry portal account. "
        },
        {
            "text": "We’re also improving our Estimated Completion Date tool to give clearer, more accurate timelines. "
        },
        {
            "text": "In February, the Minister of State for Housing and Planning Matthew Pennycook MP wrote to our Chair Neil Sachdev setting out the Government’s expectations and priorities for HM Land Registry for the coming year. You may have seen our Chair's response, outlining how we’ll meet the Minister’s expectations and what’s next for HM Land Registry, including a new Business Plan and Strategy.   "
        },
        {
            "text": "We’ll be publishing these shortly, covering plans to automate more of our simpler work, reduce requisitions through better digital checks, simplify our fees, and support a more streamlined, digital homebuying process."
        },
        {
            "text": "As ever, please do let me or the team have any feedback about what we are doing, and what you would like to see, using the comment section below."
        },
        {
            "text": "As we continue to improve, I hope you and your clients will continue to feel the difference more clearly in the months ahead."
        }
    ]
}