{
    "url": "https://socialcareinspection.blog.gov.uk/2025/04/16/the-families-first-partnership-programme-new-guide-and-how-this-affects-ilacs/",
    "title": "The Families First Partnership programme: new guide and how this affects ILACS",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's services",
        "inspection framework",
        "local authorities",
        "safeguarding",
        "social care regulation"
    ],
    "pub_date": "2025-04-16T15:51:22+01:00",
    "content": [
        {
            "text": "As part of the children’s social care reforms, the Department for Education (DfE) has published its Families First Partnership (FPP) programme guide. The guide is aimed at safeguarding partners who are implementing reforms around family help, multi-agency child protection and family group decision-making."
        },
        {
            "text": "In this blog, I want to explain how our inspections of local authority children’s services (ILACS) will take account of the reforms. I’ll also discuss the next steps."
        },
        {
            "text": "To find out more about the reform proposals, you can read our blog responding to them."
        },
        {
            "heading": 2,
            "text": "About the FFP programme guide"
        },
        {
            "text": "The guide sets out how local authority children’s services should begin to implement:"
        },
        {
            "text": "The guide will likely be most useful to local authorities in the early stages of implementation."
        },
        {
            "heading": 2,
            "text": "Our inspections"
        },
        {
            "text": "We know that the next few years will be a time of considerable change and reorganisation for you and your teams, and how you work with partners to help vulnerable children and families."
        },
        {
            "text": "We want to reassure you that, while ILACS will continue, our inspectors will be highly attuned to the changes you’re making."
        },
        {
            "text": "It’s not Ofsted’s role to monitor local authorities’ compliance with putting the reforms into place. Our focus will continue to be on the quality of decision-making for children and on how your work has helped and protected children, families and care leavers."
        },
        {
            "text": "I know that developing MACPTs may be challenging. You’ll need the full buy-in of your safeguarding partners and you’ll need to make sure that lines of responsibility are clear between the MACPT and the case-holding family help teams. Each local authority will be on its own individual implementation journey, with its own timeline and milestones. Our inspectors will always take that into account."
        },
        {
            "text": "Of course, your statutory functions have not changed. But you can now exercise some functions in different ways, such as allowing practitioners other than social workers to support children in need – as set out in ‘Working together to safeguard children’. You should follow this, alongside the guide, the national framework and other statutory guidance such as ‘Kinship care: framework for local authorities’."
        },
        {
            "heading": 2,
            "text": "Pathfinders"
        },
        {
            "text": "Your new approaches will be led by learning from the pathfinders (the 10 local authorities that have been testing this area of reforms), and from the practice guides as they evolve. We’ll be really interested to see how these new approaches lead to good quality and safe interventions for families."
        },
        {
            "text": "Last year, we did a focused visit to Wolverhampton, which was one of the first wave of pathfinders. The feedback from this has been positive. We heard through the feedback how inspectors used a strengths-based approach to understanding how reform is being managed. They were able to do this while still sticking to their core task of evaluating children and families’ progress and experiences."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We’ll continue to make sure our inspections align with the reforms. We recently updated our grade descriptor language to bring it in line with the national framework. Over the life of the government’s reform programme, we will continue to keep the ILACS framework under review so it remains fit for purpose."
        },
        {
            "text": "One of the changes is broadening who can act as a lead practitioner supporting children and families in need (section 17, Children Act 1989). We know that some of you may be concerned about the impact this might have on inspection. "
        },
        {
            "text": "Our view is that practitioners other than social workers can have a valuable part to play in supporting children and families. Lead practitioners must have:"
        },
        {
            "text": "Some Directors of Children’s Services have expressed concerns that we might give lower grades if lead practitioners are not social workers. This is simply not the case. We want to see that children and families receive the right help and protection at the right time. Whether the lead practitioner overseeing this is a social worker or not will have no impact on our grades."
        },
        {
            "text": "We’re all moving towards an era of ever-more changing, challenging and exciting practice. I’m confident that practitioners, leaders and inspectors will continue our professional dialogue to help ensure the most effective and helpful support to children, families and care leavers."
        }
    ]
}