{
    "url": "https://marinescience.blog.gov.uk/2021/10/07/cefas-and-industry-science-collaborations-scallop-stock-assessment/",
    "title": "Cefas and industry science collaborations: scallop stock assessment",
    "authors": [
        "Andy Lawler"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-10-07T13:01:29+01:00",
    "content": [
        {
            "text": "This is the first in a series of short blogs focussing on Cefas’ fisheries science work in partnership with the fishing industry.  Cefas Scientist Andy Lawler, who specialises in commercial shellfish, is the first of our mini blog authors."
        },
        {
            "text": "This week Cefas scientists, including myself, are taking part in the annual ICES Scallop Assessment Working Group (WGScallop), where we are presenting the latest scallop stock assessment report based on our collaborative work with industry. ICES is an international body with 20 member countries and helps to meet societal needs for impartial evidence on the state and sustainable use of our seas and oceans. WGScallop is one of 160 such expert groups which reports to ICES."
        },
        {
            "text": "In recent years, Cefas has been working closely with the fishing industry to ensure their insight, expertise and operations contribute to the development of fisheries management and the science that informs it.  One of the earliest of these collaborations has enabled the Cefas shellfish team to carry out annual stock assessments for king scallops in the main fisheries located around English coasts."
        },
        {
            "text": "The project started in the English Channel in 2017 and additional assessment areas in the North Sea and the Approaches to the Bristol Channel were added to the programme a year later. Scallop fisheries are one of the most valuable UK fisheries, but prior to this initiative the status of many stocks was unknown."
        },
        {
            "text": "The project is coordinated by the Project Steering Board (PSB) which comprises Cefas, Defra and Seafish colleagues, but membership is mainly composed of fishing industry representatives. The PSB is responsible for facilitating the project aims and sees government scientists and industry representatives working closely to achieve this."
        },
        {
            "text": "Aoife Martin, Seafish Chair of the PSB says: “The success of this project has relied on the close collaboration between scientists and industry.   Ensuring that industry contributes directly to the collection and use of this scallop data helps build a better understanding of the state of the stocks, which in turn supports the sustainable management of this hugely valuable commercial fishery.”"
        },
        {
            "text": "Three data streams provide inputs for the stock assessments: Scallop dredge surveys, underwater TV surveys (UWTV) and a biological sampling programme."
        },
        {
            "text": "The dredge surveys use a chartered fishing vessel to determine the harvestable biomass of scallops on the fishing grounds."
        },
        {
            "text": "The UWTV surveys are typically carried out on the Cefas Endeavour, and these determine the distribution and abundance of scallops in areas that are not currently fished. These areas are often inaccessible to the dredging fleet but may support scallop populations that contribute offspring to fished areas by larval drift."
        },
        {
            "text": "The biological sampling scheme is an adaption of an earlier scheme suggested by the fishing industry and relies on the industry providing both samples for the scientists and scallop measurements, collected at the participating processor facilities."
        },
        {
            "text": "Stock assessments are carried out by Cefas on an annual basis with the main data source currently being provided from the dredge surveys and carried out on a fishing vessel selected and provided by the industry. Scallop dredges do not catch all of the scallops they pass over. Using the ratio of scallops caught, to those in the path of the dredges (gear efficiency), the total weight or biomass of scallops on the grounds is calculated from the survey catches. The level of fishing pressure in each area is presented as the proportion of commercial sized scallops that are subsequently caught by the fishermen (“harvest rate”). Simple fisheries models enable estimation of harvest rates that are compatible with Maximum Sustainable Yield[i] and put the observed harvest rates into context. This stock assessment programme has led to other research work as we try to refine input parameters and evolve assessment methods."
        },
        {
            "text": "Each year the results of the scallop stock assessments are published on the government website and presented at the October ICES WGScallop meetings."
        },
        {
            "text": "For me the annual WGScallop meeting sees the culmination of a year of science-industry collaboration, from dredge survey data collection on commercial fishing vessels to biological sampling at seafood processors. The meeting enables ICES working group members to share expertise, data, training and collaborate towards carrying out research on scallop fisheries on both sides of the Atlantic."
        },
        {
            "text": "This is still early days for this project, and we have yet to build up a time series of assessments and monitoring data, our work with industry will help develop our understanding of the stock and how best we can support a sustainable future for industry with our international partners."
        },
        {
            "text": "With thanks to Defra and industry who have funded this research."
        },
        {
            "text": "[i] The maximum level at which a fishery can be routinely exploited without long-term depletion."
        }
    ]
}