{
    "url": "https://insidehmcts.blog.gov.uk/2021/10/07/how-were-cutting-carbon-emissions-by-10-across-our-estate/",
    "title": "How we’re cutting carbon emissions by 10% across our estate",
    "authors": [
        "Zoe Hurley"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-10-07T07:00:46+01:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "The headlines on climate change are alarming."
        },
        {
            "text": "Environmental experts tell us that the world is getting warmer with more extreme heatwaves, droughts and flooding likely to occur. In August, the Intergovernmental Panel on Climate Change published a report which said it’s ‘unequivocal that human influence has warmed the atmosphere, ocean and land’. The Rt Hon Alok Sharma MP, President for COP26, responded by saying we must act now to drive down global emissions – and that we all have a part to play."
        },
        {
            "text": "On a global level, the pandemic highlighted the need for a stronger more sustainable approach in all we do. It showed that we must ensure our buildings, systems and lifestyles are robust and flexible enough to withstand major challenges."
        },
        {
            "text": "The outlook may seem bleak, but it’s important to remember that it’s not too late if we act now."
        },
        {
            "text": "At HMCTS, we take our environmental footprint very seriously. We’re playing our part in meeting our Greening Government Commitments and supporting the delivery of the forthcoming Ministry of Justice’s (MoJ) Net Zero Carbon strategy. We are investing £40m in making our courts and tribunal spaces more sustainable – meaning we’re on course to cut carbon emissions by 10% across our estate."
        },
        {
            "text": "We’ve also put together a five-year environmental sustainability strategy. The strategy outlines our commitments to carbon reduction, minimising our consumption of water, reducing and managing our waste responsibility and helping nurture and protect biodiversity."
        },
        {
            "text": "The measures we’ve taken so far aim to limit the impact we have on the environment and play our part in protecting our earth’s resources. This will help sustain us both now and in the future. We recognise that we’ve just started and we have a long way to go, but impressively, our actions already having an impact. Here’s how."
        },
        {
            "text": "£40m investment"
        },
        {
            "text": "A year ago, we secured £40m in additional funding to invest in carbon-reduction projects across our estate. It was a significant cash boost from the Government and has really kick-started our work to improve our environmental performance."
        },
        {
            "text": "As a result of our funding, we have:"
        },
        {
            "text": "Due to these actions, we’re on course to achieve an overall reduction of 10% of total emissions emitted by HMCTS, that’s around 6,000 tonnes of carbon saved."
        },
        {
            "text": "It’s a huge stride in just a year, and a real testament to colleagues across HMCTS who have carried out works across our estate, while maintaining services during COVID-19."
        },
        {
            "text": "A new five-year strategy "
        },
        {
            "text": "As mentioned earlier, we have recently developed a five-year strategy, to ensure we have a plan for embedding sustainability in everything we do."
        },
        {
            "text": "The strategy outlines the measures we will take to reduce our impact on the environment and increase biodiversity. It is split into four areas:"
        },
        {
            "text": "Alongside these measures we will use data to regularly monitor our progress and determine areas for improvement. You can see how we performed over the past year here. We are also working with our staff to develop engagement programmes and develop a culture where we are working sustainably."
        },
        {
            "text": "Next steps "
        },
        {
            "text": "Sustainability requires collective activity. It’s taken the ideas, energy and commitment of colleagues across our organisation to achieve what we’ve done so far."
        },
        {
            "text": "I’m optimistic that the steps we’ve taken will help with our environmental credentials in the years to come. But there is plenty more to do. I’ll continue to work with my colleagues across HMCTS and in the MoJ Sustainability Team to find ways of reducing our carbon emissions and water consumption, and making sure sustainability is embedded in all our activity. We’re all in this together."
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Sut rydym yn torri 10% o allyriadau ledled ein hystâd"
        },
        {
            "text": "Mae’r penawdau ar newid hinsawdd yn peri dychryn."
        },
        {
            "text": "Mae arbenigwyr amgylcheddol yn dweud wrthym fod y byd yn cynhesu. Mae’n debygol y bydd mwy o dywydd poeth eithafol, sychder a llifogydd yn digwydd. Ym mis Awst, cyhoeddodd y Panel Rhynglywodraethol ar Newid Hinsawdd adroddiad  yn datgan yn ‘ddigamsyniol bod dylanwad dyn wedi cynhesu’r atmosffer, y cefnforoedd a thiroedd.’ Ymatebodd yr AS y Gwir Anrhydeddus Alok Sharma, Llywydd COP26, drwy ddweud bod yn rhaid i ni weithredu nawr i leihau allyriadau byd eang - a bod gennym oll ran i’w chwarae."
        },
        {
            "text": "Yn fyd-eang, mae’r pandemig wedi amlygu’r angen i arddel dulliau mwy cynaliadwy ym mhob dim a wnawn. Dangosodd bod rhaid sicrhau bod ein hadeiladau, ein systemau a’n ffyrdd o fyw yn gadarn ac yn ddigon hyblyg i wrthsefyll heriau pwysig."
        },
        {
            "text": "O bosibl fod y rhagolygon yn edrych yn dywyll, ond mae’n bwysig cofio nad yw hi’n rhy hwyr os byddwn yn gweithredu nawr."
        },
        {
            "text": "Yn GLlTEM, mae ein ôl-troed amgylcheddol yn bwysig iawn i ni. Rydym yn chwarae ein rhan yn y gwaith o fodloni Ymrwymiadau Materion Gwyrdd y Llywodraeth a chefnogi cyflenwi strategaeth Garbon Sero Net y Weinyddiaeth Gyfiawnder sydd ar y gweill. Rydym yn buddsoddi £40m i sicrhau bod gofodau ein llysoedd a’n tribiwnlysoedd yn fwy cynaliadwy - golyga hyn ein bod ar y trywydd cywir i leihau allyriadau carbon hyd at 10% ar draws ein hystâd."
        },
        {
            "text": "Hefyd, rydym wedi llunio strategaeth gynaliadwy amgylcheddol am gyfnod o bum mlynedd. Mae’r strategaeth yn amlinellu ein hymrwymiad i leihau carbon, lleihau ein defnydd o ddŵr, lleihau a rheoli ein cyfrifoldeb gwastraff a helpu i annog a gwarchod bioamrywiaeth."
        },
        {
            "text": "Nod y mesurau rydym wedi eu gweithredu hyd yn hyn yw cyfyngu ein heffaith ar yr amgylchedd a chwarae ein rhan yn y gwaith o warchod adnoddau ein byd. Bydd hyn yn helpu i’n cynnal nawr ac yn y dyfodol. Rydym yn cydnabod ein bod ond megis cychwyn ac mae gennym ffordd bell i fynd, ond yn aruthrol, mae ein camau gweithredu eisoes wedi cael effaith. Dyma pam."
        },
        {
            "heading": 3,
            "text": "Buddsoddiad o £40m"
        },
        {
            "text": "Flwyddyn yn ôl, gwnaethom sicrhau cyllid ychwanegol o £40m i’w fuddsoddi mewn prosiectau lleihau carbon ledled ein hystâd. Roedd yn hwb ariannol arwyddocaol gan y Llywodraeth ac mae’r cyllid yn wirioneddol wedi rhoi hwb i’n gwaith i wella ein perfformiad amgylcheddol."
        },
        {
            "text": "O ganlyniad i’n cyllid, rydym wedi:"
        },
        {
            "text": "Oherwydd y camau gweithredu hyn, rydym ar y trywydd cywir i gyflawni lleihad cyffredinol o 10% o’r holl allyriadau carbon a ryddheir gan GLlTEM, mae hynny tua 6,000 tunnell o garbon wedi ei arbed."
        },
        {
            "text": "Mae’n gam mawr mewn cwta flwyddyn, ac yn destun clod i gyfeillion ledled GLlTEM sydd wedi cyflawni gweithiau ledled ein hystâd, er cynnal a chadw gwasanaethau yn ystod COVID-19."
        },
        {
            "text": "Strategaeth pum mlynedd newydd"
        },
        {
            "text": "Fel y crybwyllwyd yn gynharach, yn ddiweddar rydym wedi datblygu strategaeth bum mlynedd, er mwyn helpu i sicrhau bod gennym gynllun i wreiddio cynaliadwyedd ym mhob dim a wnawn."
        },
        {
            "text": "Mae’r strategaeth yn amlinellu’r mesurau y byddwn yn eu cymryd i helpu i leihau ein heffaith ar yr amgylchedd a chynyddu bioamrywiaeth. Rhennir hwn yn bedwar maes:"
        },
        {
            "text": "Law yn llaw â’r mesurau hyn, byddwn yn defnyddio data i fonitro ein cynnydd yn rheolaidd ac i bennu meysydd i’w gwella. Gallwch weld y gwaith rydym wedi ei gyflawni'r llynedd yma. Hefyd, rydym yn gweithio gyda’n staff i ddatblygu rhaglenni  ymrwymo a datblygu diwylliant lle rydym yn gweithio’n gynaliadwy."
        },
        {
            "heading": 3,
            "text": "Y camau nesaf"
        },
        {
            "text": "Mae cynaliadwyedd yn gofyn am weithgarwch ar y cyd. Mae wedi golygu gwireddu syniadau, egni ac ymrwymiad cyfeillion ledled ein sefydliad i gyflawni'r hyn rydym wedi ei wneud hyd yn hyn."
        },
        {
            "text": "Rwy’n ffyddiog y bydd y camau rydym wedi eu cymryd yn helpu ein cymwysterau amgylcheddol mewn blynyddoedd i ddod. Ond mae llawer mwy o waith i’w gyflawni. Byddaf yn parhau i weithio gyda’m cyfeillion ledled GLlTEM ac yn y Tîm Cynaliadwyedd i ganfod ffyrdd o leihau ein hallyriadau carbon a’n defnydd o ddŵr, a sicrhau bod cynaladwyedd wedi ei wreiddio yn ein holl weithgareddau. Rydym oll, gyda’n gilydd yn rhan o hyn."
        }
    ]
}