{
    "url": "https://insideDIO.blog.gov.uk/2021/10/07/my-reflections-of-the-defence-procurement-research-technology-and-exportability-conference/",
    "title": "My reflections of the Defence, Procurement, Research, Technology and Exportability conference",
    "authors": [
        "David Poole"
    ],
    "categories": [
        "Commercial",
        "Commercial Strategy",
        "Procurement"
    ],
    "pub_date": "2021-10-07T12:06:43+00:00",
    "content": [
        {
            "text": "This week, I attended my first ever Defence, Procurement, Research, Technology and Exportability (DPRTE) conference in Farnborough."
        },
        {
            "text": "DPRTE is a Defence event focussed on the growing infrastructure needed on the Defence estate. The event provides an opportunity for DIO to talk to our current supply chain, and to businesses who might work with us in the future."
        },
        {
            "text": "The DPRTE event covered a wide range of Defence and infrastructure sectors and businesses, with some fascinating stands showcasing innovative solutions and ideas. For the team, and for many of the suppliers, it was our first ‘physical’ event post lockdown. It was truly energising to be in the company of like-minded people with a common purpose who work with us to meet our 10-year strategy."
        },
        {
            "text": "There were a range of speakers from DIO who presented and spoke about the core strategic priorities (as in the diagram below) which will shape how we work with our suppliers going forward. We have a growing portfolio and will need to work with more suppliers, more closely in the future. The DIO strategy focusses on delivering: One Team, Excellent Advice and Outstanding Delivery. Within this framework our commercial team is focussed on developing a robust and capable supply chain which can deliver sustainable and demonstrable value across all areas of DIO operations."
        },
        {
            "text": "Our core strategic priorities which will shape how we work with our suppliers going forward. [Crown Copyright/MOD2021]Our presentations on Supplier Relationship Management and the Procurement Pipeline addressed how we are shaping our internal activity to engage more effectively with our suppliers and encourage the best response we can from the supply chain. We are committed to developing our supplier relationships in a collaborative way and providing timely visibility of the pipeline information to help suppliers plan for, and respond, to the needs of the Defence estate. We covered a ‘bottom-up’ guide on ‘How to work on secret projects’ with the intention of demystifying this for suppliers who have the appropriate skills, capabilities and capacity, but have not yet been tempted to work on this interesting and diverse portfolio."
        },
        {
            "text": "Our Chief Operating Officer, David Brewer, addressed the importance of safety in his presentation. Safety has two primary aspects for DIO. The first is to ensure we provide a safe estate for users of the Defence estate. This requires us to look at our core processes and data to help us understand and manage our assets so that we are able to address any risks before they become safety issues. The second is safe operations which looks at how we work together with our supply chain on delivering a safe and secure Defence estate."
        },
        {
            "text": "The Government and Defence policy agenda is prioritising both sustainability and social value. These topics were addressed by Tetra Tech and RBLI respectively. RBLI in particular brought to life what social value in a procurement proposal means, and how it can be accessed through working with social enterprises at the bid stage of contracts."
        },
        {
            "text": "All presentations delivered in the Infrastructure and Estates Knowledge Zone hosted by DIO and sponsored by Tetra Tech were very well attended resulting in some valuable discussions including how we are increasing SME participation within our supply chain and further engagement around our proposed published procurement pipeline."
        },
        {
            "text": "Overall, for those suppliers who could join us, DPRTE provided a great window into what our commercial teams need to do to continue developing our strategic capabilities around our core objectives. If you weren’t able to join us but are interested in doing business with DIO please visit the DPRTE website or take a look at our resources from the DPRTE event by scanning the QR code below."
        }
    ]
}