{
    "url": "https://educationhub.blog.gov.uk/2021/10/national-poetry-day-poetry-on-the-curriculum/",
    "title": "National Poetry Day: Poetry on the curriculum",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Schools"
    ],
    "pub_date": "2021-10-07T16:58:58+01:00",
    "content": [
        {
            "text": "Today is National Poetry Day in the UK, the annual mass celebration on the first Thursday of October that encourages all to enjoy, discover and share poetry."
        },
        {
            "text": "The day sparks a flurry of activity throughout the country, with events taking place in homes, schools, libraries, and public places and showcases the ways in which poetry adds value in society."
        },
        {
            "text": "Poetry is not just celebrated on National Poetry Day however and remains a key part of the English curriculum in schools. Students are continuously encouraged to develop their creativity and embrace the power of poetry."
        },
        {
            "text": "We know that many teachers are using creative ways to teach poetry on the English curriculum. We deliberately don’t stipulate how lessons must be taught in the curriculum – we just outline the topics that must be covered – to allow teachers creative freedom."
        },
        {
            "text": "Since 2013, the department has funded Poetry By Heart to deliver the National Poetry Recitation Competition. This competition helps to develop and support inspiring poetry teaching in schools across England and motivates pupils and teachers alike to explore our rich literary heritage."
        },
        {
            "text": "There is a body of evidence that suggests engaging with poetry can have benefits for mental health, cultural awareness and self-expression."
        },
        {
            "text": "Here we take a quick look at how poetry is taught in schools."
        },
        {
            "heading": 3,
            "text": "At Key Stage 1, pupils are taught to:"
        },
        {
            "heading": 3,
            "text": "At Key Stage 2, pupils are taught to:"
        },
        {
            "heading": 3,
            "text": "At Key Stage 3, pupils are taught to:"
        },
        {
            "heading": 3,
            "text": "At Key Stage 4, pupils are taught to:"
        }
    ]
}