{
    "url": "https://disabilityunit.blog.gov.uk/2021/10/07/national-arthritis-week-my-journey-with-rheumatoid-arthritis/",
    "title": "National Arthritis Week: My journey with Rheumatoid Arthritis",
    "authors": [
        "Jacqui Wyatt"
    ],
    "categories": [
        "National Disability Strategy"
    ],
    "pub_date": "2021-10-07T10:42:09+01:00",
    "content": [
        {
            "heading": 2,
            "text": "How it all started"
        },
        {
            "text": "I had been suffering with severe pain for quite a while. Every time I bent my knees or went up and down flights of stairs they would crunch. I knew this was not normal so I contacted my GP."
        },
        {
            "text": "At the grand old age of 47 I was diagnosed with Rheumatoid Arthritis (RA) in both knees and both ankles. I was sent a couple of leaflets and told to take painkillers when needed!"
        },
        {
            "text": "Luckily I am a fan of the phrase ‘I will google that’ – so that is exactly what I did. There was information galore, including diet change, exercises and lifestyle changes. One of the things I was advised to avoid was alcohol – and although I now avoid several other dietary items, I still enjoy a glass or two of Prosecco! Finding a balance between avoiding certain triggers and enjoying myself has been important. "
        },
        {
            "heading": 2,
            "text": "Managing my symptoms"
        },
        {
            "text": "I struggle when the weather is cold and damp (clearly I should be living on a tropical island!) Because of this, the winter is hard and I use heat pads when my joints are playing up. Sometimes I have to go up my stairs on all fours as my knees can not take the pressure of stepping up each step. "
        },
        {
            "text": "I am fortunate that I can afford to see a private physiotherapist who has been a great help in managing my symptoms. My treatment includes acupuncture, heat lamps and massages from which I greatly benefit."
        },
        {
            "text": "When you have an invisible disability and you look “OK”  it can be tough. Many days I am faced with challenges, from walking down my stairs to getting on a bus (remember those days before the pandemic?) I look after my mum who has advanced Alzheimer’s Disease which means I have to carry on even when I feel like shutting myself away due to the pain."
        },
        {
            "text": "It's not all doom and gloom. The pain can be difficult to live with but I have a positive mindset and remind myself it could be worse. I count my blessings – and it’s certainly not all bad – I live in Peckham and I have prosecco! I am looking forward to the warmer weather which will be here soon and that really helps."
        },
        {
            "heading": 2,
            "text": "So what is RA?"
        },
        {
            "text": "Rheumatoid arthritis (RA) is an autoimmune disease, where your immune system attacks the cells that line your joints by mistake. It is a long-term condition which causes joint pain, swelling and stiffness. "
        },
        {
            "text": "It most commonly affects the hands, feet and wrists, but can occur elsewhere on the body. Symptoms can fluctuate over time. Periods where symptoms become worse are known as flare-ups or flares. "
        },
        {
            "text": "It is not possible to predict when a flare might happen. Treatment for RA can decrease the number or severity of flares. Treatment can also minimise or prevent long-term damage to the joints. "
        },
        {
            "heading": 2,
            "text": "Symptoms of RA:"
        },
        {
            "heading": 2,
            "text": "Treatment options"
        },
        {
            "text": "Although there is no cure for RA, there are three main treatment options: medications, physical therapies, and surgeries. "
        },
        {
            "text": "A combination of different medications is usually recommended as they work in different ways. Gentle movement and physical therapy can help reduce stiffness and pain in the joints over time, and using hot and cold packs can be effective in reducing inflammation and pain. "
        },
        {
            "text": "A different combination of treatment options will be suited to different people. Everyone’s experience of RA is unique and each will find the best way in which to support their symptoms or flares.  "
        },
        {
            "text": "A common misconception about RA is that it generally affects the elderly. You can develop RA at any age, but symptoms are most likely to appear between the ages of 30 and 50. Risk factors include being a woman, having a family history of RA, or being a smoker. "
        },
        {
            "heading": 2,
            "text": "National Arthritis Week"
        },
        {
            "text": "National Arthritis Week exists to raise awareness for the experiences of over 10 million people in the UK who are living with arthritis. Find out more about arthritis, including types, symptoms and tips for managing symptoms. "
        },
        {
            "text": "For further reading on living with a non-visible disability you can take a look at our blog."
        }
    ]
}