{
    "url": "https://prisonleaversproject.blog.gov.uk/2021/10/07/tackling-reoffending-through-llif/",
    "title": "Tackling reoffending through the Local Leadership and Integration Fund",
    "authors": [
        "Local Leadership and Integration Fund"
    ],
    "categories": [
        "Local Leadership and Integration Fund"
    ],
    "pub_date": "2021-10-07T11:02:50+01:00",
    "content": [
        {
            "text": "We know that local context can affect a prisoner’s experience leaving custody, and so can impact how likely it is that they turn away from crime for good."
        },
        {
            "text": "A huge number of government departments, agencies, local authorities, charities and other organisations play important roles in delivering services to prison leavers. Each service targets prison leavers in different ways – from health to employment and housing - supporting them to build productive lives and break the cycle of crime. But we know that in some local areas, these services could be even better joined up."
        },
        {
            "text": "At the Prison Leavers Project, we wanted to encourage a tailored approach to improving outcomes for prison leavers and therefore cutting crime – one that accounts for this local context and builds on the expertise and experience of local leaders."
        },
        {
            "text": "So how are we doing this?"
        },
        {
            "heading": 2,
            "text": "Introducing the Local Leadership and Integration Fund"
        },
        {
            "text": "Back in February 2020, we launched our grant funding scheme: the Local Leadership and Integration Fund."
        },
        {
            "text": "We invited organisations from both the public and third sector to come together in partnership to develop locally-led pilots."
        },
        {
            "text": "Through this scheme, we’re giving local leaders and agencies the funding and support to work together in ways they haven’t before to improve outcomes for prison leavers, and ultimately better protect the public. Our emphasis is on new partnerships between organisations to help join up the services in a given area."
        },
        {
            "text": "The competition has two rounds. The first has now closed with a lot of interest and some amazing new partnerships applying, and the second round officially launched at the beginning of September. If your interest is sufficiently piqued, be sure to read to the end of this blog for more on how to apply."
        },
        {
            "heading": 2,
            "text": "Our exciting partnerships"
        },
        {
            "text": "The first round of the competition closed in March, having received 52 applications."
        },
        {
            "text": "The competition was tough, but we are thrilled that we’ve officially awarded funding to the following partnerships across the country:"
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "Now that we’ve concluded the first round of applications, we are supporting our successful Local Leadership and Integration Fund partnerships to set up their pilots. "
        },
        {
            "text": "As you can see, these pilots are focussed on different cohorts, in different areas, with different intended outcomes."
        },
        {
            "text": "This range will help us to learn about the challenges and opportunities of working together across sectors in different areas. Ultimately, we want to build evidence about what works to reduce reoffending at a local level so we can find new approaches which can be scaled up to best promote public protection."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We are excited to be moving forwards with the final round of competition which, as of 6 September, is officially open for applications!"
        }
    ]
}