{
    "url": "https://food.blog.gov.uk/2021/10/07/the-launch-of-the-uk-anaphylaxis-registry-and-its-importance-for-uk-consumers/",
    "title": "The launch of the UK Anaphylaxis Registry and its importance for UK consumers",
    "authors": [
        "Dr Paul Turner, Consultant in Paediatric Allergy and Immunology at Imperial College London",
        "Ayah Wafi, Allergen Risk Assessor"
    ],
    "categories": [
        "Allergy"
    ],
    "pub_date": "2021-10-07T14:26:26+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Dr Paul Turner, Consultant in Paediatric Allergy and Immunology at Imperial College London, and Ayah Wafi, Allergen Risk Assessor at the Food Standards Agency, introduce a new national reporting platform for allergic reactions. Funded by the Food Standards Agency (FSA) with contributions from Food Standards Scotland (FSS), the UK Anaphylaxis Registry will provide more data on levels of anaphylactic reactions in the UK."
        },
        {
            "text": " "
        },
        {
            "text": "Today sees the launch of the UK Anaphylaxis Registry at the Annual Conference of the British Society for Allergy and Clinical Immunology (BSACI)."
        },
        {
            "text": "The establishment of a registry represents an important step in better understanding anaphylaxis and how allergic reactions impact individuals in the UK."
        },
        {
            "heading": 2,
            "text": "Understanding anaphylaxis"
        },
        {
            "text": "An anaphylaxis reaction is a serious, and potentially life-threatening allergic reaction. Whilst severe or fatal anaphylaxis is rare, food-allergic reactions due to accidental exposure are common in people with a food allergy."
        },
        {
            "text": "Until the launch of the registry, we have not had a standardised way of reporting these reactions in the UK. The registry will serve as a platform for clinicians to record details of anaphylaxis incidents, and collate data from across the UK to provide a better picture of the type of reactions, their frequency and their geographic spread."
        },
        {
            "text": "Understanding more about accidental allergic reactions to food, such as the specific food causing a reaction, will help the FSA better protect those with food allergies."
        },
        {
            "text": "The registry is being co-ordinated by researchers at Imperial College London, in conjunction with the NORA European Anaphylaxis Registry (Network of Online Reporting for Anaphylaxis)."
        },
        {
            "heading": 2,
            "text": "Collecting anaphylaxis data"
        },
        {
            "text": "The UK Anaphylaxis Registry came about from a need to better understand the circumstances of accidental reactions happening in the community in connection with food."
        },
        {
            "text": "Unfortunately, NHS data is limited by incomplete data or incorrect coding. This includes a lack of information as to which food allergen has triggered a particular reaction."
        },
        {
            "text": "This significantly limits our understanding of the circumstances of allergic reactions, and our ability to use this information to improve patient care and to help guide public policy."
        },
        {
            "heading": 2,
            "text": "Collaboration between international allergy researchers"
        },
        {
            "text": "With funding from the FSA and FSS, researchers at Imperial College London have worked with the team of Professor Margitta Worm, who established and has led the European Anaphylaxis Registry (NORA) platform for over a decade."
        },
        {
            "text": "During this time, the NORA Registry has collected over 15,000 anaphylaxis reports, spanning over 120 medical centres from 14 countries. This work has helped to identify factors which may contribute to more severe reactions and has guided decision making around anaphylaxis management."
        },
        {
            "text": "By working with NORA, we will collect data relating to adults and children having unintended allergic reactions to both food and non-food triggers. This would be either at the time of presentation to an Accident and Emergency department, or within 12 months when the patient attends an outpatient appointment."
        },
        {
            "text": "The project is supported by BSACI and Paediatric Emergency Research in the United Kingdom & Ireland (PERUKI), who will help recruit healthcare professionals to participate."
        },
        {
            "heading": 2,
            "text": "How to contribute to the UK Anaphylaxis Registry"
        },
        {
            "text": "Uniquely, we will also collect data about the circumstances of the reaction from the patient themselves. This includes their assessment of the severity of symptoms experienced."
        },
        {
            "text": "When a healthcare professional logs a reaction, by entering (with permission) an email address for the patient, the system will email the patient a questionnaire collecting additional information relating to symptoms and possible risk factors."
        },
        {
            "text": "All data will be anonymised and de-identified, in line with data protection legislation, protecting the identity of the patient themselves."
        },
        {
            "text": "We are encouraging BSACI members and other healthcare professionals with an interest in allergy and anaphylaxis to register as a Contributor to the Registry."
        },
        {
            "text": "You can do this by contacting anaphylaxis.registry@imperial.ac.uk or requesting to become a contributor to the UK anaphylaxis register online."
        },
        {
            "text": "Equally, if you have experienced an allergic event in the last 12 months, you can ask your healthcare professional to report it to the registry by contacting anaphylaxis.registry@imperial.ac.uk for further information."
        },
        {
            "heading": 1,
            "text": "Lansio Cofrestrfa Anaffylacsis y Deyrnas Unedig, a'i phwysigrwydd i ddefnyddwyr"
        },
        {
            "text": "Mae Dr Paul Turner, Ymgynghorydd Alergedd ac Imiwnoleg Paediatreg yng Ngholeg Imperial Llundain, ac Ayah Wafi, Asesydd Risg Alergenau yn yr Asiantaeth Safonau Bwyd (ASB), yn cyflwyno platfform adrodd cenedlaethol newydd ar gyfer adweithiau alergaidd. Wedi'i hariannu gan yr Asiantaeth Safonau Bwyd (ASB) gyda chyfraniadau gan Safonau Bwyd yr Alban (FSS), bydd Cofrestrfa Anaffylacsis y Deyrnas Unedig (DU) yn darparu rhagor o ddata ar lefelau adweithiau anaffylactig yn y DU."
        },
        {
            "text": " "
        },
        {
            "text": "Heddiw, bydd Cofrestrfa Anaffylacsis y DU yn cael ei lansio yng Nghynhadledd Flynyddol Cymdeithas Alergedd ac Imiwnoleg Glinigol Prydain (BSACI)."
        },
        {
            "text": "Mae sefydlu cofrestrfa yn gam pwysig tuag at wella dealltwriaeth o anaffylacsis a sut mae adweithiau alergaidd yn effeithio ar unigolion yn y DU."
        },
        {
            "heading": 2,
            "text": "Deall anaffylacsis"
        },
        {
            "text": "Mae adwaith anaffylacsis yn adwaith alergaidd difrifol a all beryglu bywyd. Er bod anaffylacsis difrifol neu angheuol yn brin, mae adweithiau alergaidd bwyd o ganlyniad i gyswllt damweiniol ag alergen yn gyffredin mewn pobl ag alergeddau bwyd."
        },
        {
            "text": "Hyd nes lansio’r gofrestrfa, ni fu gennym ni ffordd safonol o roi gwybod am yr adweithiau hyn yn y DU. Bydd y gofrestrfa'n llwyfan i glinigwyr gofnodi manylion digwyddiadau anaffylacsis, a chasglu data o bob rhan o'r DU i roi darlun gwell o'r math o adweithiau, eu hamlder a'u lledaeniad daearyddol."
        },
        {
            "text": "Bydd deall rhagor am adweithiau alergaidd damweiniol i fwyd, fel y bwyd penodol sy'n achosi adwaith, yn helpu'r ASB i ddiogelu’r rheiny ag alergeddau bwyd yn well."
        },
        {
            "text": "Mae'r gofrestrfa'n cael ei chydlynu gan ymchwilwyr yng Ngholeg Imperial Llundain, ar y cyd â Chofrestrfa Anaffylacsis Ewropeaidd NORA (Rhwydwaith Adrodd Ar-lein ar gyfer Anaffylacsis)."
        },
        {
            "heading": 2,
            "text": "Casglu data anaffylacsis"
        },
        {
            "text": "Cyflwynwyd Cofrestrfa Anaffylacsis y DU yn sgil yr angen i ddeall yn well amgylchiadau adweithiau damweiniol yn y gymuned mewn perthynas â bwyd."
        },
        {
            "text": "Yn anffodus, mae data'r GIG wedi'i gyfyngu gan ddata anghyflawn neu godio anghywir. Mae hyn yn cynnwys diffyg gwybodaeth o ran pa alergen bwyd sydd wedi achosi adwaith penodol."
        },
        {
            "text": "Mae hyn yn cyfyngu'n sylweddol ar ein dealltwriaeth o amgylchiadau adweithiau alergaidd, a'n gallu i ddefnyddio'r wybodaeth hon i wella gofal cleifion ac i helpu i arwain polisi cyhoeddus."
        },
        {
            "heading": 2,
            "text": "Cydweithrediad rhwng ymchwilwyr alergedd rhyngwladol"
        },
        {
            "text": "Gyda chyllid gan yr ASB a FSS, mae ymchwilwyr yng Ngholeg Imperial Llundain wedi gweithio gyda thîm yr Athro Margitta Worm, a sefydlodd blatfform y Gofrestrfa Anaffylacsis Ewropeaidd (NORA), ac sydd wedi ei arwain ers dros ddegawd."
        },
        {
            "text": "Yn ystod yr amser hwn, mae Cofrestrfa NORA wedi casglu dros 15,000 o adroddiadau anaffylacsis, sy’n rhychwantu dros 120 o ganolfannau meddygol mewn 14 gwlad. Mae'r gwaith hwn wedi helpu i nodi ffactorau a allai gyfrannu at adweithiau mwy difrifol, ac mae wedi arwain y broses benderfynu o ran rheoli anaffylacsis."
        },
        {
            "text": "Trwy weithio gyda NORA, byddwn ni’n casglu data sy'n ymwneud ag oedolion a phlant sy’n cael adweithiau alergaidd anfwriadol i fwyd a chynhyrchion nad ydynt yn fwyd. Byddai hyn naill ai ar adeg adodd am yr adwaith i adran Damweiniau ac Achosion Brys, neu cyn pen 12 mis pan fydd y claf yn mynychu apwyntiad claf allanol (outpatient)."
        },
        {
            "text": "Cefnogir y prosiect gan BSACI ac Ymchwil Frys Bediatreg yn y Deyrnas Unedig ac Iwerddon (PERUKI), a fydd yn helpu i recriwtio gweithwyr gofal iechyd proffesiynol i gymryd rhan."
        },
        {
            "heading": 2,
            "text": "Sut i gyfrannu at Gofrestrfa Anaffylacsis y DU"
        },
        {
            "text": "Yn wahanol i’r arfer, byddwn ni hefyd yn casglu data am amgylchiadau'r adwaith gan y claf ei hun. Mae hyn yn cynnwys eu hasesiad o ddifrifoldeb eu symptomau."
        },
        {
            "text": "Pan fydd gweithiwr gofal iechyd proffesiynol yn cofnodi adwaith, trwy nodi (gyda chaniatâd) cyfeiriad e-bost y claf, bydd y system yn anfon e-bost at y claf yn cynnwys holiadur sy’n casglu gwybodaeth ychwanegol am symptomau a ffactorau risg posibl."
        },
        {
            "text": "Bydd yr holl ddata yn ddienw ac ni fydd modd adnabod y claf, yn unol â deddfwriaeth diogelu data, gan ddiogelu hunaniaeth y claf."
        },
        {
            "text": "Rydym ni’n annog aelodau BSACI a gweithwyr gofal iechyd proffesiynol eraill sydd â diddordeb mewn alergedd ac anaffylacsis i gofrestru fel Cyfrannwr i'r Gofrestrfa."
        },
        {
            "text": "Gallwch chi wneud hyn trwy gysylltu ag anaphylaxis.registry@imperial.ac.uk neu ymweld â www.anaphylaxie.net."
        },
        {
            "text": "Yn yr un modd, os ydych wedi profi adwaith alergaidd yn ystod y 12 mis diwethaf, gallwch ofyn i'ch gweithiwr gofal iechyd proffesiynol roi gwybod i'r gofrestrfa trwy gysylltu ag anaphylaxis.registry@imperial.ac.uk i gael rhagor o wybodaeth."
        }
    ]
}