{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/10/07/working-together-to-de-mystify-policy/",
    "title": "Working together to de-mystify policy",
    "authors": [
        "Gareth Davies"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2021-10-07T12:00:56+01:00",
    "content": [
        {
            "text": "If it wasn’t evident beforehand, the height of the pandemic demonstrated more than ever the essential work of the half a million civil servants across country. Medics provided expert advice to keep us safe, whilst economists in the Treasury identified the businesses and individuals to provide much needed support to during the crisis."
        },
        {
            "text": "However, the role of policy professionals during the pandemic, and indeed at any other point in time, can be harder to articulate. Policy is often seen as a mysterious ‘black box’, privy only to the most senior and ‘elite’ people in government. Even the most experienced civil servants, whose entire career is in policy, have been known to disagree when it comes to defining exactly what policy is."
        },
        {
            "heading": 2,
            "text": "Throwing open the doors"
        },
        {
            "text": "But it is so important that we do. Without a clear vision of what policymakers do, we run the risk of policy continuing to being seen as a profession open only to insiders or those in the know. And with this comes the risk that policy is made without drawing on the best insights and perspectives. We risk missing opportunities and not having the impact we should for families and communities."
        },
        {
            "text": "This was really brought home to me in the Social Mobility Commission's report from earlier this year. It highlighted that those from more diverse backgrounds are not properly represented in policymaking roles. Whilst everyone knows the role of a lawyer or a finance professional, policy can be seen as vague and ambiguous from the outside. This can act as a deterrent for some people applying for roles - which means we are missing out on talent."
        },
        {
            "text": "I want us to be much clearer about what policy is, and the skills you need to develop to be a great policy professional. This is a vital step in ensuring that the profession is open to everyone and seen to be open to everyone. Along with ensuring that there are great policy roles and opportunities for progression across the country, I want to make it easier for people to move into policy roles from other professions."
        },
        {
            "heading": 2,
            "text": "Defining policymaking "
        },
        {
            "text": "For me public policy is the management of the government’s role in improving the welfare, security, and prosperity of the nation. It ranges from designing public services to improve education and health, assessing the infrastructure needs for different parts of the country, ensuring the UK is on track to achieve net zero carbon emissions, and to levelling up the country."
        },
        {
            "heading": 2,
            "text": "Five activities for policymakers"
        },
        {
            "text": "And to do this we need to:"
        },
        {
            "heading": 2,
            "text": "Support policymakers to flourish"
        },
        {
            "text": "Policy is not just about coming up with new ideas. It is about ensuring that the system is delivering and that there is proper democratic accountability through ministers to parliament."
        },
        {
            "text": "Different jobs and different organisations will structure policy roles in different ways. But all will have elements of these five activities. The Policy Profession is now looking at its training offer, including refreshing the Policy Profession Standards framework for professional development, to ensure that policymakers can access the support they need to strengthen their skills in all these five areas."
        },
        {
            "text": "We’ve been ambiguous about what is and isn’t policy for too long. Let’s bring some light and demystify what we do. This way we can ensure we all have the skills and experience we need to flourish in our roles, and that we are able to attract the great people from across the country to work in some of the most demanding and rewarding jobs in government."
        },
        {
            "heading": 2,
            "text": "Make your voice heard"
        },
        {
            "text": "Are you a policy professional? We’d love to hear your feedback on this blog by taking part in our 5-minute survey here."
        }
    ]
}