{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/10/07/world-mental-health-day/",
    "title": "World Mental Health Day",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Mental health",
        "Our profession"
    ],
    "pub_date": "2021-10-07T15:51:32+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The pandemic and mental health"
        },
        {
            "text": "Since returning to my role as Chief Social Worker for Adults, I have been impressed by many stories of social workers in local authorities, NHS mental health trusts and voluntary and community agencies stepping up to make sure people, their carers and the communities they live in, are supported to cope with the mental as well as physical impact of COVID-19."
        },
        {
            "text": "‘Mental health in an unequal world’ is this year’s theme for World Mental Health Day – and it’s one which speaks to all social workers working alongside people living with mental health conditions."
        },
        {
            "text": "The impact of the pandemic has of course been profound for people who need our care and support. It has created many challenges, including the need to do things differently. It’s pace and impact means social workers have had to act quickly, adapt their skills and strengthen their professional responses,  especially in supporting people’s mental health and wellbeing."
        },
        {
            "heading": 2,
            "text": "Reestablishing connections"
        },
        {
            "text": "Meanwhile, voluntary and statutory services have striven to understand how individuals can be better engaged and included."
        },
        {
            "text": "Significant pressure has been placed on our approach to safeguarding, in so doing, exposing new issues and challenges reminding us of its purpose and application within a social work value base."
        },
        {
            "text": "Social workers and other professionals work alongside people to make sure they are listened to, their uniqueness respected, and their involvement in decisions about their care and support defended. Most importantly, they strive to protect their human rights. In all these ways, they help individuals achieve positive outcomes and lead better lives."
        },
        {
            "text": "These unusual times have also reminded me of our professional standards which require social workers to promote the rights, strengths and wellbeing of people, families and communities in order to fulfil their regulatory responsibilities."
        },
        {
            "text": "Relationship based practice provides the opportunity for people to speak to someone they trust, to be supported in having things to look forward to and strengthening social connections. Helping people access appropriate housing, income security and engage in meaningful occupations are just some of the things which make a huge difference."
        },
        {
            "heading": 2,
            "text": "A complex but common factor"
        },
        {
            "text": "Mental health is a complex issue. It sits on many intersections including race, gender, poverty, class and isolation. Working to address the social determinants of health and wellbeing is core to the endeavour of social work, especially at milestones in people’s lives, including transition into adulthood."
        },
        {
            "text": "The social care reforms have been announced and the forthcoming white papers on adult social care and integration will continue to place the principle of people’s wellbeing and needs at the centre of care and support."
        },
        {
            "text": "The Department of Health and Social Care will be working with people with lived experience of mental ill health, their carers and practitioners, to shape these white papers so that reforms and the strategies underpinning them make a positive and sustainable difference for the future."
        },
        {
            "heading": 2,
            "text": "Reforming approaches and reaffirming our social work principals"
        },
        {
            "text": "The Mental Health Act reforms will also result in improvements to specialist mental health support. Social workers undertaking the Approved Mental Health Professional (AMHP) role will make sure the principles of treating each person as an individual are met."
        },
        {
            "text": "This involves supporting their choice and control, using the least restrictive options and maximising therapeutic benefits arising from their care."
        },
        {
            "text": "Social workers can also provide practice leadership alongside other professionals with whom they work, encouraging holistic person-centred approaches in working with people with lived experience. In this way, we can sensitively tailor support, which is culturally appropriate, personalised, builds on an individual’s strengths and addresses the changes they need to make a positive difference to the quality of their lives."
        },
        {
            "text": "The world may be unequal, but World Mental Health Day remind us why it’s more important than ever to redress the balance for those who need our advocacy, empathy and compassion the most."
        }
    ]
}