{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/09/25/a-journey-in-supporting-families-and-children/",
    "title": "A journey in supporting families and children",
    "authors": [
        "Roz Davidson"
    ],
    "categories": [
        "Working in children's social care"
    ],
    "pub_date": "2025-09-25T16:10:18+01:00",
    "content": [
        {
            "text": "I’m a national domestic abuse consultant and trainer, and the director of Domestic Abuse Solutions Ltd. I have 32 years of experience supporting vulnerable families across a wide range of organisations, including nurseries, children's centres and local authorities, as well as working across statutory services such as police and health."
        },
        {
            "heading": 2,
            "text": "Recognising the hidden patterns behind parenting challenges"
        },
        {
            "text": "Early in my career, I began to deliver Triple P parenting programmes, first through children's centres and then through my own company. I started noticing clear patterns: I observed that many parenting challenges stemmed from experiences of domestic abuse, sometimes ongoing, sometimes historical. I realised we were trying to address parenting when, in fact, the children were communicating with us through their behaviour, which was influenced by the impact of domestic abuse. We were tackling the symptoms rather than the root cause."
        },
        {
            "heading": 2,
            "text": "Learning more"
        },
        {
            "text": "This realisation motivated me to learn more about domestic abuse."
        },
        {
            "text": "I trained to deliver and later became a national trainer for the Community Groups Programme, a 12-week programme helping women and children recover from domestic abuse, and I later decided to study for a master’s degree to deepen my understanding of domestic abuse, especially the effects of developmental trauma on children."
        },
        {
            "heading": 2,
            "text": "Building understanding"
        },
        {
            "text": "I think education is essential. Everyone needs to understand what domestic abuse is, recognise its signs, and be aware of the support available. This is particularly important when it comes to controlling or coercive behaviour, which is often harder to spot."
        },
        {
            "text": "I was therefore proud to be a script consultant for a local authority-led film called Timekeeper, designed to raise awareness of the impact of domestic abuse on children among the local workforce. Since then, it has been used widely as a training tool for professionals across the sector. My role was to help ensure the film’s message was accurate and impactful. I continue to work across countless organisations and local authorities, supporting them with their response to children affected by domestic abuse through training and consultancy."
        },
        {
            "text": "Since I started working in this field, the government has legally recognised children as victims in their own right, which demonstrates the significant shift in attitudes and attention for this often hidden abuse."
        },
        {
            "heading": 2,
            "text": "Witnessing the power of meaningful connections and lasting change"
        },
        {
            "text": "This work motivates me because I have seen genuine long-term change. I have a group of mothers and children I worked with in 2018 who still send me annual pictures of them all meeting up, as they connected in such a meaningful way that they have become lifelong friends."
        },
        {
            "text": "Moments like this remind me of the real and lasting impact this work can have."
        },
        {
            "heading": 2,
            "text": "Find out more"
        }
    ]
}