{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/09/25/gse-leadership-values-masterclass-leading-through-change/",
    "title": "GSE Leadership Values Masterclass: Leading through change  ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Collaborating & Networking",
        "GSE Offer",
        "Talent & Leadership"
    ],
    "pub_date": "2025-09-25T16:28:15+01:00",
    "content": [
        {
            "text": "Over 150 members of the Government Science and Engineering (GSE) community gathered on 4 September, for a masterclass to explore how science and engineering leaders can lead through change. It was facilitated by Sophie Boldon, Deputy Director in the Government Office for Science with speakers from several government departments. "
        },
        {
            "text": "The event brought together a range of perspectives to reflect on the core GSE leadership values: inclusiveness, decisiveness, integrity, and collaboration. "
        },
        {
            "text": "What were the key discussion points? "
        },
        {
            "text": "Speakers dived into their professional journeys and shared the different routes they took including through academia, apprenticeships and professional recognition programmes. They shared how leadership values were key to managing change and recounted their experiences of leading through uncertainty. The panel also discussed the importance of open communication in managing challenging events and how important it is to balance decision-making with people-focused leadership. "
        },
        {
            "text": "The panel discussed that leadership can come from all grades and encouraged participants to recognise their own value and leadership potential. Regardless of formal management responsibilities, people can contribute through subject matter expertise, network involvement, or even by just supporting team initiatives. They also provided great practical tips to manage crisis situations and to keep teams motivated during uncertain times. They also spoke about effective ways to challenge senior leadership constructively by focusing on evidence-based arguments and collaborative solutions.  "
        },
        {
            "text": "The panel agreed that communication plays a key role in managing change and supporting staff. This can be through understanding what the audience needs to ensure that we maintain transparency in all our messaging. This leads to confidence among the team to make accurate decisions and helps retain institutional memory.  "
        },
        {
            "text": "Feedback from attendees "
        },
        {
            "text": "The feedback from the Masterclass was overwhelmingly positive. Attendees found it insightful and praised the hybrid format of the session. The diversity of speakers was particularly appreciated, sparking thoughts about future opportunities for learning and development. The attendees particularly appreciated spot coaching which was described as “brilliant” and contributing to “a fabulous event overall”. "
        },
        {
            "text": "Want to continue with your leadership development? "
        },
        {
            "text": "Contact the GSE Profession team on gse@go-science.gov.uk  to:  "
        }
    ]
}