{
    "url": "https://rpc.blog.gov.uk/2025/09/25/rpc-examines-how-the-quality-of-government-analysis-has-changed-over-time/",
    "title": "RPC examines how the quality of Government analysis has changed over time",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2025-09-25T11:24:26+01:00",
    "content": [
        {
            "text": "The RPC reviews and rates the quality of impact assessments (IAs) of new regulations produced by government departments. As well as the headline ‘fit for purpose’ rating, we rate IAs across four areas: rationale and options; cost-benefit analysis; wider impacts; and monitoring and evaluation plans. Areas that are rated ‘good’ or ‘satisfactory’ provide good or sufficient support for decision-making on those areas of the assessment, while those rated ‘weak’ or ’very weak’ provide inadequate support for decision-making."
        },
        {
            "text": "We have published a spreadsheet of past RPC opinions covering 174 IAs issued since 2020[1]."
        },
        {
            "text": "A disappointing decline in the quality of Government analysis"
        },
        {
            "text": "More than a quarter (28%) of all the assessments within the data were rated ‘weak’ or ‘very weak’."
        },
        {
            "text": "Percentage of IAs receiving ‘good’ or ‘satisfactory’ ratings"
        },
        {
            "text": "Comparing the period before April 2022 with the latest period since April 2024, there was a disappointing decline in the percentage of IAs that were rated ‘good’ or ‘satisfactory’:"
        },
        {
            "text": "The RPC’s Chair, Stephen Gibson said: “The decline in the quality of the assessment of the impacts of regulatory proposals is disappointing. Good quality evidence and analysis is critical to allowing ministers and Parliament to make regulatory choices that secure the best outcomes for the country”  "
        },
        {
            "text": "The proportion of IAs rejected as not fit for purpose as first submitted increased significantly, but has started to improve"
        },
        {
            "text": "Where we judge that an IA as first submitted is not fit for purpose (and the department has submitted the IA early enough to allow resubmission), we can issue an Initial Review Notice (IRN). This means that the department has an opportunity to address the areas of concern and resubmit the IA for a further review. The proportion of IAs receiving an IRNs is an indication of the quality of Government analysis."
        },
        {
            "text": "In the first two years of our dataset the number of rejected IAs increased very significantly from 18% to 40%, this has since reduced to 29%. This still means that almost 3 in 10 IAs are judged not fit for purpose as first submitted."
        },
        {
            "text": "Percentage of IAs receiving an Initial Review Notice by year"
        },
        {
            "text": "[1] In May 2024, we published a spreadsheet and blog summarising our ratings of 142 IAs. We have now updated this to include an additional 32 IAs published over the last year."
        }
    ]
}