{
    "url": "https://ukhsa.blog.gov.uk/2025/09/25/should-we-be-worried-about-the-current-covid-19-variants/",
    "title": "Should we be worried about the current COVID-19 variants? ",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "UKHSA science"
    ],
    "pub_date": "2025-09-25T16:28:32+01:00",
    "content": [
        {
            "text": "As we enter autumn, rates of respiratory illnesses start to rise and people ask how the most common current  lineages  -  or groups of genetically similar viruses  -  compare to previous COVID-19 variants.  "
        },
        {
            "heading": 2,
            "text": "What have we seen so far? "
        },
        {
            "text": "The most common current variants are the XFG and NB.1.8.1 (sometimes referred to in the media as the Stratus and Nimbus variants).  Our genomic surveillance of SARS-CoV-2 lineages last month found that 35% were classified as XFG.3, 28% were classified as XFG, 11% were classified as NB.1.8.1, 7% were classified as XFG.5 and 7% were classified as XFG.3.4.1. You can see our latest data on the National flu and COVID-19 surveillance reports. "
        },
        {
            "text": "Current data does not indicate that these variants lead to more severe illness than other variants in circulation.  "
        },
        {
            "text": "It’s normal for viruses to mutate and change, and as more data becomes available on these variants we’ll have a better understanding of how they interact with our immune systems and how to optimise our protection, as well as actions we can take to keep the most vulnerable safe and live our lives as normally as possible. The most important thing is for those eligible to get their vaccination when it is due.  "
        },
        {
            "heading": 2,
            "text": "If people become unwell, and are unsure if they have COVID-19, what should they do? "
        },
        {
            "text": "If you have symptoms of a respiratory infection, such as COVID-19, and you have a high temperature or do not feel well enough to go to work or carry out normal activities, you should avoid contact with vulnerable people and stay at home if possible.  "
        },
        {
            "text": "For those of us who absolutely can’t stay at home, the Living with COVID guidance remains unchanged, and will reduce the chance of passing on your infection to others: "
        },
        {
            "heading": 2,
            "text": "What vaccination programme is in place for COVID-19 in the UK? "
        },
        {
            "text": "Vaccines remain our best defence against severe disease and hospitalisation from flu and COVID-19.  You can find details of who is eligible and how they can book their vaccination here. "
        },
        {
            "heading": 2,
            "text": "What surveillance systems are in place? "
        },
        {
            "text": "We publish the latest surveillance data for COVID-19 and other respiratory illnesses on the UKHSA data dashboard. We’re also getting vital data from those who are admitted to hospital with symptoms, and use genome sequencing to understand which variants people are most vulnerable to.  "
        },
        {
            "text": "Hospital is where we will see the more severe cases, and we will be monitoring the numbers of people attending who test positive or with COVID-19 symptoms very carefully. This will help us understand the growth rate and transmission potential of the current variants.  "
        },
        {
            "text": "We continue to collaborate globally with health organisations in other countries, WHO and initiatives such as the Global Influenza Surveillance & Response System (GISAID) to ensure that we have the most current data.  "
        }
    ]
}