{
    "url": "https://phescreening.blog.gov.uk/2017/08/30/diabetic-eye-screening-is-exactly-the-same-for-people-who-have-rarer-forms-of-diabetes/",
    "title": "Diabetic eye screening is exactly the same for people who have rarer forms of diabetes",
    "authors": [
        "Patrick Rankin",
        "Dr Peter Scanlon"
    ],
    "categories": [
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2017-08-30T13:24:32+01:00",
    "content": [
        {
            "text": "The NHS Diabetic Eye Screening Programme (DES) helps prevent sight loss in people with diabetes. Screening can detect diabetic retinopathy early, when treatment is effective at reducing or preventing damage from the condition."
        },
        {
            "text": "Most people have heard of Type 1 and Type 2 diabetes. We (the PHE Screening national team) also receive regular queries about some much rarer forms of diabetes, particularly maturity onset diabetes of the young, or MODY for short."
        },
        {
            "text": "MODY runs strongly in families. It is caused by a mutation (or change) in a single gene. If a parent has this mutation, any child they have will have a 50% chance of inheriting it from them."
        },
        {
            "text": "Experts estimate that only 1 to 2% of people with diabetes in the UK (20,000 to 40,000 people) have MODY.  As it is so rare, doctors may not be aware of it, so it’s estimated that about 90% of people with MODY are initially mistakenly diagnosed with Type 1 or Type 2 diabetes."
        },
        {
            "text": "There are 6 different types of MODY and the rates of complications vary across these different types. Most patients don’t know what type of MODY they have."
        },
        {
            "text": "We aim to offer screening to everyone aged 12 and over identified with diabetes in England. That is around 3 million people."
        },
        {
            "text": "The national screening programme is highly standardised, routinely quality assured and is not set up to provide highly specialised care for very small groups of people. Therefore, all patients with MODY should be invited for routine diabetic eye screening irrespective of their MODY type."
        },
        {
            "text": "More information about MODY is available from Diabetes UK."
        },
        {
            "heading": 3,
            "text": "PHE Screening blogs"
        },
        {
            "text": "PHE Screening BLOGs provide up to date news from all NHS screening programmes."
        },
        {
            "text": "You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs."
        }
    ]
}