{
    "url": "https://ipa.blog.gov.uk/2023/09/12/innovation-in-action-at-uks-first-all-electric-prison/",
    "title": "Innovation in action at UK’s first all-electric prison",
    "authors": [
        "Luke Cryan"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Project Futures",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2023-09-12T11:28:07+01:00",
    "content": [
        {
            "text": "Jon Loveday, Director of Infrastructure, Enterprise and Growth, and Alison Baptiste, Director of Public and Security Services at the Infrastructure and Projects Authority (IPA), share their thoughts following a site visit to the HMP Millsike Programme. "
        },
        {
            "text": "HMP Millsike is a new-build Category C prison currently being constructed in York and is due to be completed early 2025. When completed, the prison will hold over 1500 prisoner places, covering almost 50 acres of land."
        },
        {
            "text": "The Transforming Infrastructure Performance: Roadmap to 2030 (TIP) principles run through the heart of its construction and delivery. TIP is the IPA’s flagship programme to lead system change in the built environment and sets out a vision for innovation and reform in infrastructure delivery. "
        },
        {
            "text": "Named after the local river, ‘Millsike’ was chosen by a panel of representatives that included the Ministry Of Justice, who is delivering the project, and members of the local community. While the name is an ode to a local point of beauty promoting the natural environment, it also embeds the project into the communities that are surrounding it, by giving local people a stake in the built environment around them. The build is also being delivered in partnership with local stakeholders and communities, with over 40% of construction orders coming from within 50 miles of the site. This is a prime example of how the TIP theme of place-based regeneration is present throughout varying aspects of the programme."
        },
        {
            "text": "Construction of HMP Millsike will see close to 50 former prisoners take part in the build of the prison, supporting them in rehabilitating and turning their backs on crime. This speaks to the United Nations (UN) Sustainable Development Goals (SDGs) of decent work and economic growth that promotes full and productive employment for all. SDGs are global agreements made at the UN level to improve health and education, reduce inequality, and spur economic growth, while tackling climate change. Aligning the UN’s SDGs with the built environment is a central part of continuing to implement TIP. "
        },
        {
            "text": "HMP Millsike will run solely on electricity, making it the first of its kind in the UK. The build will use solar panels, heat pump technology and more efficient lighting systems to run the prison, meaning that it will use approximately a quarter of the energy used to heat traditional Victorian prisons. Aside from the positive environmental impacts, the improved energy efficiency of the project will bring down taxpayer energy costs by over £1m per year. "
        },
        {
            "text": "Digital innovation has played a key part in the development of HMP Millsike. New digital twin technology has been used that has the potential to increase the accuracy of tracking and interacting with building components, while only costing one third of the traditional alternative. The use of a digital twin to aid in the construction of the prison, modernises and accelerates infrastructure performance - a key part of realising the ambition of TIP."
        },
        {
            "text": "Modern Methods of Construction (MMC) is central to delivering TIP through a platform approach - using standardised elements of designs to increase productivity and efficiency. This can be seen throughout the new prison estate, and continues with HMP Millsike. The blueprint of the project is based on the designs for HMP Five Wells, a project successfully delivered in 2022, and also brings in parts of a houseblock design used in another improvement project across prisons in the UK. The perimeter fence around the prison has similarly seen an innovative construction method applied to it, carried over from HMP Fosse Way."
        },
        {
            "text": "Alison Baptiste, Director of Public and Security Services (IPA) said: "
        },
        {
            "text": "“After the successes we saw in the application of TIP principles in HMP Five Wells and Fosse Way, it was great to visit York and see how innovation and excellence continue to be driven at HMP Millsike. "
        },
        {
            "text": "\"The team continues to iterate to ensure better delivery, including the use of offsite construction in more structures on site and early installation of drainage and roads - all good signs of implementing Construction Playbook best practice. It’s fantastic to see lots of this being done as we work to make TIP business as usual by 2025.”"
        },
        {
            "text": "Jon Loveday, Director of Infrastructure, Enterprise and Growth (IPA) said: "
        },
        {
            "text": "“It was fantastic to spend some time at HMP Millsike and see lots of the positive work going on across the project, as well as areas where we can continuously improve. "
        },
        {
            "text": "\"There is a clear and continued commitment to offsite manufacturing, which is fundamental to the application of TIP, and seeing the implementation of the Construction Playbook was encouraging, with the project’s alliance contracting promoting good sharing of knowledge and improving performance and outcomes."
        },
        {
            "text": "\"The balance of commitment to local labour and efficiency that HMP Millsike has demonstrated through national supply arrangements, as well as seeing how ex-offenders had the opportunity to play a crucial role in the building of the prison, showed the huge social value that the building of the project brings, which is another important element of TIP in action.”"
        },
        {
            "text": " "
        },
        {
            "text": "Sitting at the heart of government, reporting to the Cabinet Office and HM Treasury, the IPA provides expert project delivery advice, support and assurance to ensure projects are delivered efficiently and effectively. Through TIP, the IPA is working to drive a step-change in infrastructure performance, increasing productivity, reducing costs and radically improving the sustainability of projects. For further information on TIP, please see our Roadmap to 2030 here."
        }
    ]
}