{
    "url": "https://marinescience.blog.gov.uk/2023/09/12/into-the-deep-how-cefas-science-of-the-deep-sea-is-exploring-uncharted-waters/",
    "title": "Into the deep: How Cefas science of the deep-sea is exploring uncharted waters",
    "authors": [
        "James Bell"
    ],
    "categories": [
        "biodiversity",
        "Deep-sea",
        "Monitoring",
        "Policy",
        "Science"
    ],
    "pub_date": "2023-09-12T13:39:00+01:00",
    "content": [
        {
            "text": "The deep-sea covers more than 60% of the Earth's surface. Deep-sea ecosystems are amongst the least well understood owing to the combined challenges of remoteness, vastness, and the difficulties of exploring its depths. The ‘deep-sea’ is a catch-all term that encompasses a wide range of habitats from the twilight open ocean, through globe-spanning ocean ridges, the vast rolling hills of the abyssal plains, all the way to 11km down in the deepest trenches. The average depth of the oceans is around 3.8km, and it is estimated that around 80-90% of the species in the deep-sea have yet to be described."
        },
        {
            "text": "The deep-sea is increasingly threatened by human activities, including long standing bottom fishing practices, nascent impacts from new industries such as deep-sea mining, and inadvertent impacts from plastics and climate change. Since we generally know very little about deep-sea ecosystems, understanding the extent and consequences of any impacts remains very challenging, even for activities like fishing that have occurred for many years. Plastics and other types of waste haves been found in every deep-sea habitat where scientists have looked, mostly recently by our team in water samples from 3000m deep, over 800 nautical miles offshore!"
        },
        {
            "text": "The Deep-seas group at Cefas (Deep-Seafas) is a team of ecologists, oceanographers, biogeochemists, and more who study the deep-sea and provide scientific advice, principally to the UK Government and to international management bodies. We also work heavily with the UK Overseas Territories, and the Governments of Small Island Developing States, whose waters can be almost entirely in the deep-sea."
        },
        {
            "text": "The work of Deep-Seafas group spans a range of topics, but focuses principally on the biodiversity of the deep-sea, and human threats to its environments. Our recent work includes assessing impacts of fisheries in the northwest Atlantic, mapping brand new areas of UK Overseas Territories marine protected areas, and contributing to management and research of the Southern Oceans. Here are some examples of the Deep-Seafas group recent work:"
        },
        {
            "text": "Understanding the impacts of deep-sea fisheries "
        },
        {
            "text": "Deep-sea fisheries take place between depths of 200 and 2 000 meters, and target species on continental shelves, seamounts and ocean ridges using bottom and deep mid-water trawls, gillnets, longlines and pots. According to UN regulations (UNGA Res 61/105), deep-sea fisheries are meant to avoid what is known as ‘Significant Adverse Impacts’ upon vulnerable marine ecosystems. Even though these regulations were enacted in 2006, with the lack of data we have for the deep-sea, it remains a major challenge to get to grips with what the term ‘significant adverse impacts’ really means in different deep-sea environments."
        },
        {
            "text": "In partnership with the Northwest Atlantic Fisheries Organisation and other similar organisations elsewhere, Cefas have been driving forward research into deep-sea ecosystem status assessment and providing advice on how to ensure that deep-sea fisheries can minimise their environmental impact (e.g., Downie et al., 2021). We also recently provided support to the Government of South Georgia and the South Sandwich Islands for their Marine Stewardship Council review of the impacts of the Patagonian toothfish longline fishery on deep-sea habitats in this region, helping them to minimise impacts from fishing."
        },
        {
            "text": "Exploring the Blue Belt "
        },
        {
            "text": "Last year some of the Deep-Seafas team took part in a research survey to Ascension and St Helena as part of the Blue Belt Programme, Discovery Research Vessel Expedition last November (#DY159). The UK Overseas Territories are collectively responsible for Marine Protected Areas that span over 4.3 million sq. km, over 90 % of which is in the deep-sea."
        },
        {
            "text": "During this survey, we charted new seamounts (one of them accidentally while we were just trying to calibrate some of the ship’s equipment!), collected video data to test new kinds of habitat models, and collected samples of water, sediment and animals from deep-sea areas of the marine protected areas that have never been studied. Only around 25% of the ocean has currently been mapped to modern standards, mostly in shallower areas. Surprisingly, there are still limitations in terms of the technology. Sometimes our satellite maps of the deep-seafloor can be wrong by 1000s of metres, and we are still regularly discovering new entire underwater mountains!"
        },
        {
            "text": "This ability to study the deep-sea is still a serious limiting factor in many places all over the world, because of the high cost and complex engineering needs, and we are actively developing technology that can be used for deep-sea research using small local boats. For example, we are working with St Helena and Belize to trial a specialised underwater camera system that can be used at 1,000 metres, that is also cheap and easy to use.  This will give local scientists and managers the ability to collect the data themselves for the first time, data that they need to make decisions about deep-sea ecosystem management."
        },
        {
            "text": "Influencing negotiations in the Antarctic "
        },
        {
            "text": "Members of Deep-Seafas recently contributed to the CCAMLR (Convention for the Conservation of Antarctic Marine Living Resources) Ecosystem Monitoring and Management working group. During two weeks of monsoon rains in Kochi, India, Cefas scientists contributed to a diverse range of topics including discussing approaches to methods to use fishing fleets as monitoring platforms, how best to protect vulnerable marine ecosystems such a large-scale icefish nesting sites, and the development of methodologies to evaluate CCAMLR MPAs. Climate change has become an increasingly important topic within CCAMLR  and  a dedicated CCAMLR workshop will take place in  September, providing Deep-Seafas scientists the opportunity to update CCAMLR on a new British Antarctic Survey-Cefas collaboration investigating climate impacts on Southern Ocean fisheries. Deep-Seafas scientists also recently contributed to the second review of the South Georgia and South Sandwich Islands MPA and, having worked in the region for over a decade, will be well placed to support the drafting of an updated management plan for the region’s waters in the coming months."
        },
        {
            "text": "If you have any questions about the group or proposals for collaborations, please contact either james.bell@cefas.gov.uk or jacqueline.eggleton@cefas.gov.uk in the first instance"
        },
        {
            "text": "Key dates: the Cefas deep-seas group are hosting the next meeting of the UK Challenger Society Special Interest Group on Deep-Sea Ecosystems on 13th and 14th of September"
        },
        {
            "text": "DSE-SIG page: Deep-Sea Ecosystems (challenger-society.org.uk)"
        },
        {
            "text": "Recent papers,including the Deep-Seafas team:"
        }
    ]
}