{
    "url": "https://buyingforschools.blog.gov.uk/2023/09/12/my-experience-of-using-get-help-buying-for-schools-to-buy-cleaning-services-for-my-school/",
    "title": "My experience of using Get help buying for schools to buy cleaning services for my school",
    "authors": [
        "Zoe Allcott, Business Manager, Thrive Education Partnership"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-09-12T08:02:12+01:00",
    "content": [
        {
            "text": "Zoe Allcott is a Business Manager at Thrive Education Partnership (TEP) in the West Midlands. TEP is a growing multi-academy trust consisting of five special needs academies. In this blog post, Zoe shares her experience of using the Get help buying for schools service, the support she received, and how the service helped her to upskill."
        },
        {
            "text": "The cleaning contract for one of our schools – Calthorpe Academy – was up for renewal. The value of the contract was approximately £120k."
        },
        {
            "text": "This was the first tender I had managed for the trust, and I felt a little overwhelmed. Buying isn’t my area of expertise and unfortunately there was no-one in my team that I could ask. I did some initial research to try and teach myself how to run a tender but there was lots of information out there and it all left me feeling very confused. It was difficult to know exactly where to start and I did not feel confident that I would be doing everything I needed to make sure it was compliant. Also, because it was my first tender, I wanted to make sure I had the right support and guidance to do a good job."
        },
        {
            "text": "I am a member of the National Network of Special Schools (NNOSS) so I reached out to my network colleagues to get advice direct from our sector. Colleagues recommended the Get help buying for schools service, which I had previously heard mentioned at a couple of conferences, in workshops and by guest speakers. It wasn’t really my area of work until this first tender so I hadn’t really paid too much attention, but it was somewhere in the back of my mind."
        },
        {
            "text": "I contacted the service through GOV.UK and received a response within a couple of days. There are helpful self-service tools on GOV.UK such as Create a specification and Find a Framework but because I wasn’t confident enough to use those on my own, I requested the full level of support. This meant that I was allocated a procurement expert to support me through the entire process."
        },
        {
            "text": "I think it’s fantastic that this full service is provided. Using a combination of the initial research I’d done, the templates I’d put together and the support from a procurement expert, I was able to put together a compliant tender."
        },
        {
            "text": "The support I received was excellent. I am not anticipating huge savings but that wasn’t a priority. I know I have saved so much time and it has certainly put my concerns around compliancy to rest. The professional development I've gained is a fantastic added benefit of the service. Working through the process with a procurement expert has been a real learning curve and has certainly helped me to upskill."
        },
        {
            "text": "I would absolutely use Get help buying for schools again but next time I would feel confident to lead my own tender, using the Get help buying for schools service to check in if I needed to rather than relying on them to support me through the entire process."
        },
        {
            "text": "When I was doing my initial research I was quite surprised as I did see other similar services with an associated cost, so when I first contacted the service and there was no charge, I was a bit suspicious!"
        },
        {
            "text": "The fact that it exists, is free to use and helps us all to achieve our main objective - to ensure we have the best outcomes for our children – is brilliant. I would highly recommend it and have already done so in the various groups and forums that I belong to."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}