{
    "url": "https://civilservice.blog.gov.uk/2023/09/12/seven-ways-to-make-the-civil-service-more-innovative/",
    "title": "Seven ways to make the Civil Service more innovative…",
    "authors": [
        "Simon Baugh, Chief Executive, Government Communication Service"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2023-09-12T15:55:23+00:00",
    "content": [
        {
            "text": "The fast pace of technological change is creating new opportunities for how we can deliver exceptional public service."
        },
        {
            "text": "But I’ve always thought that telling people: “Be more innovative!” is a fairly unhelpful instruction."
        },
        {
            "text": "Over the last six months, I’ve been speaking to academics, researchers and private sector companies, and asking them one question: “What is it that innovative organisations do that other organisations don’t?”."
        },
        {
            "text": "The answer? They have the culture, funding, insight, networks and skills for innovation."
        },
        {
            "text": "Here are seven ideas for how to make the civil service more innovative:"
        },
        {
            "heading": 3,
            "text": "2. Refocus budgets towards innovation"
        },
        {
            "text": "Budgets are tight. And that could mean finding the money for innovation is a problem."
        },
        {
            "text": "But that’s thinking about it the wrong way. We already spend £350 million on marketing and communications across government. The biggest private sector advertisers spend around 10% of their budgets on innovation. So that’s what we have done in GCS."
        },
        {
            "text": "We have changed spending controls to encourage departments to spend up to 10% of their campaign budget on new techniques from which we can test and learn. If the full 10% was used that would give us a £35m annual innovation budget."
        },
        {
            "text": "More than 30 innovation projects are being piloted as part of this year’s campaigns. Some are new to a department, some are new to government and some have never been tried anywhere before."
        },
        {
            "heading": 3,
            "text": "4. Rigorously test new ideas"
        },
        {
            "text": "It’s easy to get carried away by a persuasive pitch, so we need the right testing and evaluation to assess which pilots are working. We’ve published new test and learn guidelines on how to use A/B and multivariate testing.  And our new Evaluation Council will expose our pilots to scrutiny and give an independent view on the performance of projects."
        },
        {
            "heading": 3,
            "text": "6. Train people on new tools and techniques"
        },
        {
            "text": "Great people will remain at the heart of our work and I want all GCS members to be confident in using the latest practices and techniques."
        },
        {
            "text": "That’s why we’ve launched GCS Advance - a step change in the quality of learning and development for Government communicators. It focuses on digital and data skills, with modules on AI at every level."
        },
        {
            "text": "The pilot starts this month, with 700 people already signed up, and the full programme launches in April. Our ambition is for 2,500 GCS members to be part of a GCS Advance programme by March 2025."
        }
    ]
}