{
    "url": "https://space.blog.gov.uk/2023/09/12/uk-space-agency-to-bring-its-space-for-everyone-steam-tour-to-wrexham/",
    "title": "UK Space Agency to bring its 'Space for Everyone' STEAM tour to Wrexham",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Careers",
        "Championing Space"
    ],
    "pub_date": "2023-09-12T12:29:47+01:00",
    "content": [
        {
            "text": "The UK Space Agency is delighted to announce that it will be docking its 72ft model rocket at Queens Square, Wrexham, from 14 to 18 September, bringing the awe-inspiring 'Space for Everyone’ tour to the region."
        },
        {
            "text": "This exciting initiative aims to captivate and educate the next generation, showcasing the UK's flourishing space industry and the diverse array of career opportunities available in Wales and beyond. "
        },
        {
            "text": "The ‘Space for Everyone’ tour will serve as a beacon of inspiration, shedding light on the pivotal role that space plays in enhancing life on Earth. Visitors, including children, families and teachers will have the unique opportunity to witness first-hand how space technologies benefit our daily lives and gain insights into the continuous efforts to explore the great unknown."
        },
        {
            "text": "Matt Archer, Director of Launch at the UK Space Agency, said:"
        },
        {
            "text": "“We’re delighted to bring our Space for Everyone tour to Wrexham so young people and their families can learn not just about space, but also about the vibrant space sector and the exciting career opportunities available in the field."
        },
        {
            "text": "“The space sector is diverse and requires people from all backgrounds and with a variety of skills – many not traditionally associated with it. The tour proves you don’t have to be a rocket scientist, or even an astronaut, as there are a host of talents needed to bring space closer to our daily lives and improve our understanding of this critical part of the environment for the benefit of the planet and its people.”"
        },
        {
            "text": "Space for Everyone promises an immersive experience, incorporating state-of-the-art virtual reality headsets to provide unparalleled insights into what a launch from the UK looks like, and the job roles involved in making it happen. Visitors will also have the opportunity to explore various interactive areas, learning about the crucial role of satellites and discovering the diverse career paths available within the UK space industry."
        },
        {
            "text": "Cllr Phil Wynn, Lead Member for Education, said: "
        },
        {
            "text": "“This exceptional tour is meant to inspire young people to enter into the UK space industry – something many of us dreamt of when we were younger but there were few opportunities. Now young people in Wrexham can find out for themselves what careers are available for them to aspire to when they are older.” ‌​‌‌​​​‌‍‌​‌​‌‌‌​‍‌​‌​‌‌​​‍‌​​‌‌‌‌​‍‌​​​​‌‌​‍‌​‌​‌​‌‌‍‌​​‌​‌‌‌‍‌​​‌‌​‌​‍‌​​​​‌‌​‍‌​‌‌‌‌‌​‍‌​​​‌‌​‌‍‌​​‌‌​‌​‍‌​‌​‌​‌‌‍‌​​‌​‌‌‌‍‌​​‌​‌‌​‍‌​​‌‌​‌​‍‌​​​‌​​‌‍‌​​‌‌​‌​‍‌​​​‌‌​​"
        },
        {
            "text": "Admission to the tour is free, no booking required, and while the event is primarily targeted towards children aged 9 to 18, it is guaranteed to ignite a passion for science, technology, engineering, arts and mathematics (STEAM) in individuals of all ages. Mums, dads, grandparents and next-door neighbours are all invited to participate and experience the excitement of the Space for Everyone tour. "
        },
        {
            "text": "The tour kicked off in Southampton in June and will visit a further two locations around the UK after Wrexham. For further information about the Space for Everyone tour, please visit spaceperson.co.uk/rocket-tour/ or follow @spacegovuk on social media."
        },
        {
            "text": "The Space for Everyone tour will visit:"
        }
    ]
}