{
    "url": "https://environmentagency.blog.gov.uk/2023/09/12/weir-making-a-real-difference-to-water-quality-on-the-river-cole/",
    "title": "Weir making a real difference to water quality on the River Cole",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-09-12T15:28:26+00:00",
    "content": [
        {
            "text": "The Environment Agency enables partnerships to come together and improve the local environment to benefit wildlife and communities. Catchment Coordinator for the West Midlands Environment Programme team, Adam Noon, tells us more about removing Ackers Weir on the River Cole in East Birmingham."
        },
        {
            "text": "“I help develop projects to improve the water environment and a key part of my job is to work with a wide range of partner organisations and stakeholders, such as local authorities, eNGOs, universities, community groups and other statutory agencies. I provide specialist technical support, help to secure funding and bring people together into strong partnerships. The EA often provides funding for projects, matching contributions from partners, and in that case I’ll sit on the steering board to ensure it’s being delivered in line with our targets."
        },
        {
            "text": "Much of my work is focused on the urban environments of Birmingham and the Black Country, so my issues tend to be related to urbanisation and the physical modification of watercourses."
        },
        {
            "text": "Before taking this role at the EA, I worked as an ecologist for a Local Authority, so I’m enjoying the new challenge this role brings and learning a lot. I enjoy working with partners the most and seeing complex projects that can take a long time to develop finally come to fruition."
        },
        {
            "text": "Removing Ackers Weir, an historic river problem"
        },
        {
            "text": "One of our recent successes is removing Ackers Weir, a 2.6 metre high concrete barrier on the River Cole. The original weir was constructed in 1852 by Webster and Horsfall, a local metal works. The weir provided a water supply that was used to form and cool the metal. The whole time the weir has existed it has significantly disrupted all natural river processes, with sediments trapped upstream and no opportunity for the natural migration of fish and other aquatic organisms.  It’s fair to say that back in 1852 there just wasn’t the understanding we have now of how environmentally damaging these structures could be! In total, there was 500m3 of contaminated sediments trapped behind the weir, containing a wide range of pollutants including heavy metals and hydrocarbons. It was a very depleted stretch of river."
        },
        {
            "text": "Removing the 300-tonne concrete weir has been an EA aspiration for 15 years and in October 2022, working in partnership with the University of Birmingham, this finally became a reality. The project was so successful that it was shortlisted for the Dam Removal Europe Award, a prestigious international award."
        },
        {
            "text": "Removing the weir and associated bed regrading means fish can now migrate for the first time in 170 years. It has restored natural processes and we have recorded significant water quality improvements. People are saying ‘we can now hear the river’ which, due to the impoundment, had previously been silent.  Removing this weir is just the beginning of a long-term aspiration to enhance this degraded area of East Birmingham."
        },
        {
            "text": "Not just a weir removal…"
        },
        {
            "text": "This project came with a wide range of challenges and constraints including very restricted access, lack of funding, contaminated silts, asbestos, invasive species and lack of community engagement. It required a huge collaborative effort to make it happen. The removal of the weir as a stand-alone project didn’t stack up financially, so we worked with partners to develop a wider project called the River Cole Community Commons Project. This included restoring and rehabilitating 55 acres of neglected land adjacent to the weir. This enabled us to access match funding through European Regional Development Funds to create a project that not only enhanced wildlife but also engaged local communities. It was  really challenging to get the community to believe the project was worth it, as the area has been known for years as the ‘lost world’ with poor access, litter, fly-tipping and anti-social behaviour. This project was as much about inspiring people to get involved and see it as their space too."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "The original plan for this project was to take the weir out and deliver a 900m river restoration project further downstream. Unfortunately, we didn’t have sufficient funding to achieve this, so we are working hard with the University of Birmingham to secure additional funding to deliver this next year. The renaturalisation will create meanders, re-profile banks and in-channel features which will improve the habitat and access for people to enjoy again. This is just the beginning of work in this area, and we are already looking at other restoration opportunities along the River Cole and wider catchment."
        },
        {
            "text": "I am also working on a separate project with the University of Birmingham and Birmingham & Black Country Wildlife Trust to create a network of citizen scientists across Birmingham who will be responsible for monitoring river health and water quality, called Birmingham River Champions."
        },
        {
            "text": "You can read more about this in a future blog – click the sign-up button on this page to get updates."
        }
    ]
}