{
    "url": "https://defradigital.blog.gov.uk/2024/04/15/greener-services-hack-day-part-two/",
    "title": "Greener services hack day: Part two",
    "authors": [
        "Sandeep Dhaliwal",
        "Natalie Smithson"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Planet Centred Design"
    ],
    "pub_date": "2024-04-15T16:06:25+01:00",
    "content": [
        {
            "text": "In the second post of a two-part blog, content designers Natalie Smithson and Sandeep Dhaliwal report on the outputs of the recent hack day, led by Defra’s planet-centred design (PCD) team."
        },
        {
            "text": "We wrote a few weeks back about the ‘hack day’ that we were planning alongside TPXimpact, one of the many sessions that made up Services Week 2024."
        },
        {
            "text": "The goal of the day was to gather feedback on a set of principles for the design and delivery of greener services we had sketched in Defra, by asking participants to apply them to a real service challenge."
        },
        {
            "text": "The event was hybrid, with over 70 practitioners from different professions and organisations joining us. Many people met face to face in TPXimpact’s offices in London and some online too by a video call."
        },
        {
            "text": "Following a series of thought-provoking presentations, participants were introduced to the service challenge for the day: the current paper-based process for documenting and tracking electrical and electronic waste (often referred to as e-waste) in the UK."
        },
        {
            "text": "Using the self-organising idea of an ‘unconference’, people pitched their ideas for how the current e-waste service could be made ‘greener’. These ideas were then grouped into themes, and teams formed around each."
        },
        {
            "text": "The five teams that emerged in the room focused on:"
        },
        {
            "text": "The teams were asked to choose two or three of the greener service principles to guide their thinking about re-designing the current service. They captured their thoughts and experiences of this process as they went through the exercise."
        },
        {
            "text": "The challenge was to keep focus on the greener services principles, rather than being too pre-occupied by redesigning the e-waste service in detail."
        },
        {
            "heading": 2,
            "text": "Learnings from the day"
        },
        {
            "text": "We gathered a good deal of detailed feedback about how we could refine the principles to make them work better for people. Things that stood out include the:"
        },
        {
            "text": "The day finished with a discussion around our experience of trying to use the principles to shape our thinking in a sustainable way. The thoughts and comments shared will be very valuable for our next steps. These include:"
        },
        {
            "text": "We also spent time thinking about practical aspects of using the principles, such as the way information is presented and if there were any obvious hierarchies."
        },
        {
            "text": "One of the most important questions of the day was how we could prove we had used the principles. What might a Key Performance Indicator look like in a service assessment?"
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "With such a rich supply of ideas and suggestions we have plenty to keep us busy. Our work is going to cover several different areas."
        },
        {
            "text": "We will use the insights from the hack to develop the next version of the principles and share these back to our community. To track our progress, we are going to start documenting a design history for the principles so that everyone can see the journey we have been on."
        },
        {
            "text": "Our plan is to identify some projects at Defra we can continue to test with teams at different stages of project lifecycles, using that feedback to further evolve the principles."
        },
        {
            "text": "We will continue to work in the open and build our community so that anyone who is interested can get involved and contribute to the development of this work."
        }
    ]
}