{
    "url": "https://mhclgdigital.blog.gov.uk/2024/04/15/join-us-at-our-virtual-digital-recruitment-days-and-explore-your-next-career-move/",
    "title": "Join us at our virtual Digital Recruitment Days and explore your next career move",
    "authors": [
        "MHCLG Digital team"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-04-15T13:09:12+01:00",
    "content": [
        {
            "text": "Do you work in engineering, user research or interaction design, and are looking for a rewarding and impactful career opportunity?"
        },
        {
            "text": "Join us at our virtual DLUHC Digital Recruitment Days on 25 and 26 April. These events, which we previously held in Manchester, Darlington, Leeds and Wolverhampton, will be held online for the first time. "
        },
        {
            "text": "We will be recruiting for the following roles at DLUHC. Find out more and apply to attend: "
        },
        {
            "heading": 3,
            "text": "25 April event (virtual)"
        },
        {
            "heading": 3,
            "text": "26 April event (virtual)"
        },
        {
            "heading": 2,
            "text": "Why attend?"
        },
        {
            "text": "Our Digital Recruitment Days are a unique opportunity for you to engage in meaningful conversations with potential future colleagues from our digital teams. You’ll have the chance to connect with professionals in your specialist community, ask questions to our HR people and our senior leadership team."
        },
        {
            "text": "You’ll learn more about DLUHC Digital, our exciting areas of work, culture, career progression and development opportunities, and the array of benefits we offer."
        },
        {
            "text": "You’ll also have the opportunity to talk about yourself and showcase your skills, experience and aspirations, and for the right people, we are aiming to make job offers shortly after the event, which means it’s potentially a great way to fast-track your job search. "
        },
        {
            "heading": 2,
            "text": "Join our purpose-driven work"
        },
        {
            "text": "At DLUHC, our work focuses on solving problems, delivering innovative services and achieving ambitious outcomes that have a big impact on communities and people right across the UK. "
        },
        {
            "text": "We work in autonomous, multi-disciplinary teams in 20 locations across the UK. We are in fact one of the most geographically dispersed government departments. Our people enjoy flexible and hybrid working, plus generous benefits and development routes for learning and progression. "
        },
        {
            "text": "Find out more about what it’s like to work in DLUHC Digital."
        },
        {
            "heading": 2,
            "text": "Our first virtual event of this type"
        },
        {
            "text": "Our virtual Digital Recruitment Days this April build upon the success of our previous face-to-face events in various cities across the country. We have so far welcomed over 270 people from diverse backgrounds, specialising in various digital, data and technology disciplines, offering a better experience of recruitment for everyone."
        },
        {
            "heading": 2,
            "text": "Apply and attend our virtual recruitment days"
        },
        {
            "text": "If it sounds like something you’d like to be part of, join us and let’s chat. "
        },
        {
            "text": "Use the links at the top of this post to apply and attend."
        },
        {
            "text": "If you have any questions, contact our recruitment team: digitaldatajobs@levellingup.gov.uk."
        }
    ]
}