{
    "url": "https://teaching.blog.gov.uk/2024/04/15/supporting-every-learner-using-the-national-tutoring-programme/",
    "title": "Supporting every learner using the National Tutoring Programme",
    "authors": [
        "Meic Griffiths"
    ],
    "categories": [
        "Inspiring teachers",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "School funding",
        "Secondary schools",
        "SEND"
    ],
    "pub_date": "2024-04-15T09:26:35+01:00",
    "content": [
        {
            "text": "The Imperium Federation is a community of two special schools in London; Waterside Social Emotional Mental Health Needs (SEMH) Primary and King's Oak School, previously called Moatbridge."
        },
        {
            "text": "Executive Headteacher, Meic Griffiths, shares his experience using the National Tutoring Programme (NTP) to support pupils at the federation."
        },
        {
            "text": "Selecting pupils for tutoring"
        },
        {
            "text": "When selecting which pupils to bring forward for tutoring, we firstly considered our disadvantaged pupils in the year groups that had missed the most learning during COVID-19. We looked at assessment data to identify knowledge and skills gaps so we could develop personalised intervention plans."
        },
        {
            "text": "Tailoring tuition to meet each pupil’s needs"
        },
        {
            "text": "As our school specialises in supporting pupils with SEND, we recognised that having highly trained staff who were already familiar with the pupils’ needs was vital."
        },
        {
            "text": "For this reason, we chose to use the school-led tutoring route."
        },
        {
            "text": "We also considered how the sessions were delivered. Delivering face-to face tutoring during the school day allowed teachers to build on existing relationships with pupils and tailor their sessions accordingly."
        },
        {
            "text": "The pupils’ individual timetables were adjusted to accommodate the tutoring as an intervention, which was planned and resourced by subject leaders and delivered by our higher level teaching assistant staff."
        },
        {
            "text": "The impact"
        },
        {
            "text": "Most of our pupils who receive tutoring have significantly improved their outcomes and show better engagement in all areas of intervention, as well as in class teaching."
        },
        {
            "text": "In practice, this has meant that pupils have attained improved results in their GCSE mocks, moved forward a minimum of 16 months in reading and have needed less ‘time out’ of their usual classes in order to maintain their behaviours."
        },
        {
            "text": "Tutoring has also encouraged the pupils to give things a go and not to worry about getting it right first time, as they know it is a safe space for them to learn."
        },
        {
            "text": "A year 8 pupil said:"
        },
        {
            "text": "\"I felt safe to explore the parts of my work that I found difficult with a member of staff I know and trust. This meant that I have chosen GCSE subjects that I may otherwise have decided not to try.\" "
        },
        {
            "text": "Advice for other special schools considering tutoring"
        },
        {
            "text": "I would definitely recommend the NTP to other special schools."
        },
        {
            "text": "As specialist provision units, it is essential that we look past the pupil’s behaviour and mental health and see the child within. We tailor our curriculum delivery accordingly to ensure that they can achieve and succeed as well as, if not better, than their mainstream counterparts."
        },
        {
            "text": "NTP helps us focus on our academic strengths and prepare pupils for the end of key stage 2 assessments and GCSEs. Our GCSE results show a consistent improvement and hopefully we’ll see the same improvement this year."
        },
        {
            "text": "Embedding tutoring"
        },
        {
            "text": "We will continue to offer tutoring and will evolve our delivery to meet the needs of our new cohorts. We’ll ensure that our focus remains on academic achievements as well as emotional progress."
        },
        {
            "text": "Further information:"
        }
    ]
}