{
    "url": "https://rpc.blog.gov.uk/2024/04/15/whats-past-is-prologue-looking-back-on-the-past-decade-of-the-rpc/",
    "title": "What’s past is prologue; looking back on the past decade of the RPC",
    "authors": [
        "Jonathan Cave"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-04-15T11:46:59+01:00",
    "content": [
        {
            "text": "Dr Jonathan Cave has recently stepped down after nine years as an economist member of the Regulatory Policy Committee. The committee and its secretariat are all very sorry to see him go, thank him for his enormous contribution over the years, and wish him well for the future."
        },
        {
            "text": "In this Blog post Jonathan reflects on developments in the role of the RPC and the Better Regulation Framework over that period. The comments below are Jonathan’s  own and do not necessarily reflect the views of the RPC or the Government."
        },
        {
            "text": " "
        },
        {
            "text": "Looking back over 9 years, my time with the RPC has been both professionally rewarding and an invaluable insight into how regulatory policy is made and evaluated. Particularly striking aspects are the differences between the assumptions underpinning regulatory economics, the design of regulatory frameworks (like the original and recrafted versions of Better Regulation) and the realities of the policy cycle. These may arise from unpredictable outside events, strategic behaviour or systemic and cultural factors (e.g. different policy areas, ministers and policy types). These disconnects are significant; each domain can usefully learn from the others, their alignment can be improved and the promise of better regulation brought closer to fulfilment. This is not a new insight; over time, they have co-evolved (e.g. Real Options perspectives in regulatory assessment, ‘Smart Regulation’, changing Better Regulation Framework and Toolboxes and the continual improvement of scrutiny and its relation with departments and regulators. This blog looks back over the past decade to highlight positive and negative aspects and set the stage for a forward-looking companion piece."
        },
        {
            "text": "When I began, regulatory impact assessment (RIA) stretched over 9 distinct stages corresponding to points in the regulatory life-cycle and different scrutiny groupings. RIA (in principle) looked across a wide range of potential impacts, and considered their alignment with policy objectives and unrelated objectives – even then, there was concern that a focus on direct impacts to business might limit both the utility and the credibility of scrutiny. There was a commitment in principle to regulatory budgeting, with each pound of regulatory burden requiring the removal of a pound elsewhere (the One-In-One-Out rule of 2011) then two pounds (2014) and three pounds in the month before I joined. There was little evidence that this successive tightening produced a useful reduction in harmful burdens; offsets were sought (if at all) in unrelated areas of policy, burdens were assessed separately by measure (though experienced collectively by business), indirect and wider impacts were ignored, and – perhaps most damningly  - the rule did not distinguish between useful burdens (e.g. those that internalised the harm associated with prohibited activity – such as those associated with regulations of tobacco, new psychoactive substances or gambling) and harmful distortions. It is a testimony to the dedication of those involved to the concept of Better Regulation that these simplistic straitjackets were replaced, first with the Business Impact Target (BIT - which was directional rather than directive) and latterly with the elimination of regulatory direct cost budgets and the inclusion of wider and indirect impacts (including impacts on competition, trade and innovation)."
        },
        {
            "text": "Another limitation, which has been gradually addressed, is confining the scope and depth of analysis and scrutiny to the somewhat artificial policy channels within which the policy process was forced to operate. Objectives that could be furthered by regulation, fiscal measures (e.g. taxes and charges) and government spending were forced down separate scrutiny routes (the RPC, HMT and NAO respectively), which tended to prevent deep consideration of how best to meet policy challenges. Even within the RPC domain, some baked in separations are gradually being relaxed: direct vs. indirect costs and benefits; business vs. ‘household’ and other types of impact; actors and actions (primary and secondary legislation), Free Trade Agreements and regulators’ activities (casework, guidelines, rulemaking), impacts that are quantified or qualitative or certain vs. uncertain and, critically, impacts that relate directly to objectives and those that are orthogonal to them (e.g. ‘cost to business’  as opposed to impact on the size and distribution of profits or general measures of economic efficiency."
        },
        {
            "text": "Particularly promising is the revival, for a new century, of Better Regulation thinking[1]. This clarifies the substantive differences between the principles of Better Regulation and the aim of deregulation. When I joined the RPC, the political wind was clearly blowing towards the latter, but the RPC (in particular) had learned how to tack in the direction of Better Regulation, helped by Ministers in DTI and Cabinet Office who clearly understood their synergies and the value of independent scrutiny. But Better Regulation requires eternal vigilance and progress has not been continual or straightforward. There finally seems to be a growing consensus that what should be minimised is unnecessary or counterproductive burdens and that independent scrutiny (by those not committed to a specific policy) is needed to ensure that regulations take into account how affected parties will in fact respond and whether regulatory burdens might help government to discourage harmful actions without specifying (and taking responsibility for) what business should do – which it generally cannot know. This means not treating all burdens as bad and embracing smart regulation."
        },
        {
            "text": "A related positive development is for the RPC to offer clearer and more actionable guidance in a spirit of successive adaptation. Guidelines are not rules, but they create a ‘comply or explain’ relationship in which proportionate and coherent innovation – originating in industry, departments or the RPC - can be encouraged, assessed, shared and adopted or adapted. This also allows the RPC to serve as a platform for continuing development of Better Regulation, for instance by aligning the analysis of trade issues between Free Trade Agreements and other regulations that affect or are affected by trade or by enabling – even urging – the sharing of evidence and analytic methods across government."
        },
        {
            "text": "Also on the positive side are the increasing alignment of the frameworks underlying the assessment of regulation, public spending and fiscal measures. Eventually, this may allow the artificial walls dividing them to be torn down, so that policy development can become more rigorous, holistic, proportionate and productive. In this spirit, I have welcomed our wider engagements with those involved with Better Regulation: the Better Regulation Executive (now the Smarter Regulation Directorate), Better Regulation Units in departments, Departmental Chief Economists, Parliament, industry and civil society bodies and the international policy assessment community."
        },
        {
            "text": "On the other hand, I leave with some regrets about things we’ve failed to get rid of and some new impediments. Perhaps the most obvious is our structurally myopic focus on the tip of the regulatory iceberg. We consider each regulation separately, both for impact assessment and evaluation, and focus on the most visible aspects (regulations outside the context of other policies and the easiest to quantify impacts) rather than those most relevant to policy decisions. This sometimes creates a disconnect between the impacts we scrutinise and regulatory objectives. This is not inevitable; impacts relating to e.g. Levelling Up, Net Zero or costs to business (and soon households) could be seen as general objectives in contrast to specific objectives. Perhaps a deeper concern is the Goodhart’s Law risk, or more crudely, that what gets measured gets managed. This may not only lead us away from Better Regulation, but may in addition exacerbate the problems which we sought to address by regulation."
        },
        {
            "text": "Analytically, RIAs tend to unrealistic simplifying assumptions (e.g. that the ROAMEF[2] cycle is followed or that regulations will be complied with in the most literal fashion). This has led us to argue strongly that earlier scrutiny is ipso facto better, but this remains to be tested. Other simplifications include: a foreshortened view of evidence-based policy (evidence per se rather than “evidence of” something specific); the dominance of the quantifiable and a relaxed attitude to the breadth, depth and relevance of numerical data; neglect of methodologies appropriate to the question (e.g. regression, behavioural modelling, game-theory, systems modelling); little attention paid to selection or instrument bias in the data used, or treatment of risks and uncertainties in the data and in the way stakeholders will respond to regulations and thus produce impacts; and a tendency to use RIAs for support rather than illumination and thus to retrofit the analytic focus and the way it is described to the business case for the regulation in question. Taken together, these suggest a regulatory culture in which decision precedes analysis, and the accountability it provides is more likely to allow a shifting of responsibility than to foster an evolution towards Better Regulation."
        },
        {
            "text": "The evolutionary perspective should be taken seriously; it requires variation, selection and heredity. In this (slightly strained) metaphor, variation comes from disruptive shocks, in the form of new policy challenges or political events – the fracturing of parties or the enthusiasms of individual ministers. Ideally, these changes can be informed by assessment, but this is not necessary if the other elements are present. Selection involves the success of viable ideas and the abandonment of others. As with variation, this can be based in evidence and analysis of ‘what works’ or the growth and death of political careers and policy ideas. Heredity takes the form of copying good ideas (imperfectly or in new contexts). When these elements are present, evolution occurs. It need not go ‘uphill’; that depends on the environment and the nature of the three forces. But these can be improved to increase the odds of Better Regulation (as a direction rather than a destination). Those improvements – innovations likely to succeed or to provide valuable lessons, selection aligned with shared objectives and neither too fast (jumping to the ‘next great idea’ before the last has had time to be understood, or sticking with a non-viable idea long after all possible lessons of its failure are learned; and inheritance that builds shared understanding of how we govern ourselves (rather than mimetic copying of past or fashionable actions) – can all be fostered by independent, proportionately rigorous and evidence-based analysis of the sort the RPC has tried to provide. This ecosystem service that scrutiny provides to the web of government, civil society and enterprise is where an evaluation culture can thrive; without that, even the best regulations will not lead to sustainable improvements. Rather, they will accumulate like undergrowth, gradually choking business and social enterprise and gradually raising the risk of deregulatory wildfires in which much that is good will perish, and much that is bad will persist."
        },
        {
            "text": "Evidence and analysis do not tell Ministers what regulations to assemble or Parliaments what to approve; they should not set out to justify these choices once made. Rather, they should help Ministers and Parliaments to discharge their obligations and to assure others that these choices are not incompatible with what is known and pay due attention to what is to come. The drive to legislate comes from an inevitably partial view of what is necessary, and legislation and regulation by themselves do not solve policy problems. Independent scrutiny can help ensure that partial (or ‘proportionate’) understanding does not lead to avoidable mistakes; that those affected by regulation understand them well enough to comply with or challenge them in ways that lead ‘uphill’ and that the lessons of the past provide sound foundations for the future."
        },
        {
            "text": "Jonathan Cave\nApril 2024"
        },
        {
            "text": " "
        },
        {
            "text": "[1] Cf. Cabinet Office (1999) “Modernising government” Cm 4310. London: HMSO."
        },
        {
            "text": "[2] ROAMEF is the Government’s policy-making and delivery cycle. It is an acronym for: Rationale, Objectives, Assessment, Monitoring, Evaluation, Feedback"
        }
    ]
}