{
    "url": "https://educationhub.blog.gov.uk/2022/08/19/a-levels-and-university-admissions-fact-check/",
    "title": "A Levels and university admissions fact check",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "A Level",
        "Admissions",
        "Myth busting"
    ],
    "pub_date": "2022-08-19T16:06:38+01:00",
    "content": [
        {
            "text": "This week students up and down the country got results from their A Levels, T Levels and vocational and technical qualifications that are used for progression to university, employment and other routes."
        },
        {
            "text": "We’ve seen a number of claims about results and university admissions in the press and on social media that are either misleading or don’t tell the full story. Here we look at the facts."
        },
        {
            "heading": 3,
            "text": "Claim: A Level results have fallen"
        },
        {
            "text": "Fact check: This claim doesn’t tell the whole truth. This year’s results aren’t directly comparable to previous years because for the last two years exams haven’t happened so grades have been awarded differently on average went up significantly."
        },
        {
            "text": "This year’s results are more comparable to 2019 when exams were last taken – this year 82% of grades were C or above compared to 76% in 2019. But even this isn’t a like for like comparison because this year’s grades are slightly more generous than in 2019 in recognition of the disruption pupils have faced."
        },
        {
            "text": "Comparisons don’t tell the full story at the moment but Ofqual has made clear it plans to move back to a system where grades are more comparable with the pre-pandemic years."
        },
        {
            "heading": 3,
            "text": "Claim: More young people are missing out on going to university"
        },
        {
            "text": "Fact check: This isn’t true. More students than ever before in an exam year will be taking up a place at university, with 425,830 securing a place. According to UCAS the number of students who missed out on a place on Thursday is 20,306 – down from 24,260 in 2019."
        },
        {
            "heading": 3,
            "text": "Claim: Because grades are lower than last year more students are missing out on university places?"
        },
        {
            "text": "Fact check: This is a misleading claim. Yes, grades are lower than last year on average, but this is something that everyone – including universities - expected due to the shift back to exam-based assessment. Following Ofqual’s September announcement on grading, universities have been excellent at making sure the way they set entry requirements and make offers to students reflected the grades students received this summer. Furthermore, the number of places in the system doesn’t change based on results."
        },
        {
            "text": "So, despite grades being overall lower this year, this shouldn’t affect anyone’s chances of getting into university."
        },
        {
            "heading": 3,
            "text": "Claim: Young people are missing out on places at universities due to international students and deferrals from last year"
        },
        {
            "text": "Fact check: Both these claims are misleading. It is a myth that offering a place to an international student takes a place away from a student in the UK - places are offered to UK students and those from overseas in two separate streams. Today’s data shows international students make up 12.3% of undergraduates at UK universities this year, down from 14.7% in 2019."
        },
        {
            "text": "It’s important to say that international students make a significant contribution to our university sector which actually supports the creation of more places for domestic students, not fewer."
        },
        {
            "text": "And deferrals from last year make up a really small proportion of the total and weren’t significantly higher this year than in previous years. In 2021, 6.5% of all accepted applicants deferred their place. This is up by just 0.9 percentage points compared to 2019 and 0.3 percentage points compared to 2020."
        },
        {
            "heading": 3,
            "text": "Claim: Young people from better off backgrounds do better than their peers in both A Level results and in terms of getting into university"
        },
        {
            "text": "Fact check: It’s true to say that pupils from disadvantaged backgrounds do not on average get as good results at A Level as their peers – but this is something we are trying to address and the important thing is that the gap is narrowing."
        },
        {
            "text": "The gap between the proportion of top grades (A*, A and above and B and above) in independent schools and academies has narrowed compared to 2021. Furthermore, a record 23,220 English 18-year-olds from the most disadvantaged backgrounds have been accepted into university this year, an increase of 4,260 on 2019. This means that the entry rate gap between the most and least advantaged has narrowed from 2.29 in 2019 to 2.26 in 2022 and from 2.32 in 2021."
        },
        {
            "heading": 3,
            "text": "Claim: There aren’t enough places in Clearing"
        },
        {
            "text": "Fact check: Clearing is always busy. On the morning of results day, over 27,500 different courses were available offering students lots of choice. The number of courses available in Clearing for this year is roughly in line with previous years. UCAS and providers have been available to support students throughout the day to help them navigate their options - whether that is at university or on other high quality vocational or technical training course."
        },
        {
            "text": "We’ve seen media coverage suggesting the number of students in the Clearing system is as high as 43,000. It’s important to make clear that this figure is those who are ‘free to be placed in Clearing’ – this figure includes the 20,306 students who missed out on a place yesterday (which is down from 24,260 in 2019)  but also a large number of inactive applicants and students who received but declined an offer. Not all of the applicants who are ‘free to be placed in Clearing’ will want to take up a place at university this year and so it is misleading to suggest there are 43,000 students competing for places."
        },
        {
            "text": "We can expect the number of unplaced applicants to change while active applicants decide their next steps but will come down significantly."
        }
    ]
}