{
    "url": "https://insidehmcts.blog.gov.uk/2022/08/19/broadcasting-from-the-crown-court/",
    "title": "Broadcasting from the Crown Court",
    "authors": [
        "Rachael Collins"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2022-08-19T11:48:18+01:00",
    "content": [
        {
            "text": "On 28 July 2022, a judge's sentencing remarks were broadcast for the first time in England and Wales."
        },
        {
            "text": "The broadcasting of Crown Court judges’ sentencing remarks will allow the public to see and hear judges explain the reasoning behind their sentences. We hope this will give the public a better understanding of how judges reach their decisions. "
        },
        {
            "text": "The move will open up some of the most high-profile courts across the country, including the Central Criminal Court, which is more commonly known as the Old Bailey.   "
        },
        {
            "text": "Anyone can watch proceedings from within the Crown Court, but under section 41 of the Criminal Justice Act 1925 and the Contempt of Court Act 1981, filming and recording in the Crown Court has been banned - until now. "
        },
        {
            "text": "During the 1910s and 1920s, the introduction of portable cameras led to snatched photographs being taken in courts. They were used to illustrate salacious trials and for society gossip, such as the famous photograph of Dr Hawley Crippen with Ethel Le Neve in the dock at their murder trial in 1910. "
        },
        {
            "text": "This disruption to courts led to the 1925 Act which prohibited photography in courts. Technology, along with society, has developed at considerable pace since then, but the 1925 Act remains in force for these purposes. "
        },
        {
            "text": "Broadcasting from the Court of Appeal and Supreme Court has been happening for several years. Over the last 3 years, we’ve been working with:  "
        },
        {
            "text": "We’ve enabled the changes to happen in a way that makes sure proceedings are not disrupted and recording does not interfere with the administration of justice.  "
        },
        {
            "text": "Within HMCTS we set up an implementation working group in early 2020 to prepare for the change in legislation that’s enabled this to happen. "
        },
        {
            "text": "We worked with colleagues from our: "
        },
        {
            "text": "We made sure we had workable guidance for staff and for the media in place so the process of applying to the Court to record sentencing remarks was as straight forward as possible for the media and for our staff. Matt Nicholls, Sky News’ Court Video Journalist came along to a webinar we held with staff at a number of Crown Courts. The webinar encouraged discussions about how this would work in practice and addressed any operational concerns. "
        },
        {
            "text": "Matt Nicholls said: "
        },
        {
            "text": "Authorised media parties will decide whether to apply to the court to record and broadcast a judge’s sentencing remarks. The judge will then decide whether to grant the request, taking into account reporting restrictions in place. There will be a short delay before broadcast to comply with reporting restrictions. "
        },
        {
            "text": "Only authorised media partners will be able to film sentencing remarks, but they can make their footage - including stills from the filming - available to other media organisations. They’ll also normally make the footage, subject to reporting restrictions, available to the public on a hosting platform until the conviction becomes spent under the Rehabilitation of Offenders Act 1974. "
        },
        {
            "text": "It’s important to remember that this change does not allow anyone else to record or broadcast hearings, even if it’s during a hearing where one of our authorised media partners are present and recording.  "
        },
        {
            "text": "To protect the privacy of victims, witnesses, court staff and jurors, only the judge and their sentencing remarks will be filmed. You can read more about the process and safeguards.  "
        },
        {
            "text": "Phil Joseph, Operations Manager, at the Central Criminal Court said: "
        }
    ]
}