{
    "url": "https://insidedio.blog.gov.uk/2022/08/19/celebrating-the-50th-anniversary-of-the-british-army-training-unit-suffield-batus/",
    "title": "Celebrating the 50th anniversary of the British Army Training Unit Suffield (BATUS)",
    "authors": [
        "Kate Harrison"
    ],
    "categories": [
        "British Army",
        "Canada",
        "Defence Training Estate (DTE)"
    ],
    "pub_date": "2022-08-19T13:48:58+00:00",
    "content": [
        {
            "text": "A Challenger 2 tank firing as part of a British Army training exercise at BATUS [Crown Copyright / MOD 2022]I'm Kate Harrison, Finance Director at the Defence Infrastructure Organisation and I recently had the pleasure of visiting the British Army Training Unit Suffield (BATUS) in Canada."
        },
        {
            "text": "The UK Armed Forces have trained here since 1972, so my visit with Brigadier Jonathan Bartholomew and Stuart Nash from DIO's Overseas & Training team coincided with the 50th anniversary year of this expansive training estate."
        },
        {
            "text": "BATUS is around four times the size of Salisbury Plain and over the years, many of our military colleagues have trained here to gain valuable expertise in the use of armoured vehicles over a vast and varied landscape."
        },
        {
            "heading": 2,
            "text": "How DIO supports the British Army in Canada"
        },
        {
            "text": "On my visit I was struck by the scale of the operation and how the infrastructure to support it is equally complex and vast, an efficient and effective operation on every level, delivered with a personal touch. The commitment and knowledge of all DIO staff who work there, from the range control staff, to soft and hard facilities provision, engineering, contracting and stores,  showcases the wide range of talented, committed individuals who collaborate effectively and have an intimate understanding of what is required to make BATUS a safe and effective place to live, work and train."
        },
        {
            "text": "Kate Harrison with colleagues from the DIO Overseas and Training Team in Canada. [Crown Copyright / MOD 2022]I found the care for the environment, for colleagues undergoing training and for each other was evident with a real sense of purpose and camaraderie. I was also pleased to see the relationships that our staff have built with the host nation and the civilian staff that work for DIO in both a personal and professional nature; it was a real family atmosphere."
        },
        {
            "heading": 2,
            "text": "Delivering expertise overseas"
        },
        {
            "text": "What’s more, it was incredible to see and hear that the DIO Canada team has evolved over the years and now uses its knowledge and experience to provide full support to our wider training requirement – not just in BATUS but also Germany and the UK; ensuring that equipment is effectively utilised across the large and growing DIO Area of Operations in support of Defence's priorities. This is incredibly important to show DIO’s commitment to operating effectively and delivering on our sites across the world."
        },
        {
            "text": "I work primarily from the UK, as many of my colleagues do, and this trip really brought home to me how much our DIO colleagues overseas constantly strive to deliver the best training, services and support to our Armed Forces."
        },
        {
            "text": "Brigadier Bartholomew (pictured centre), head of DIO's Overseas Region and Defence Training Estate team, alongside colleagues [Crown Copyright / MOD 2022]I am incredibly proud of the team and thank them for the incredible learning experience I had at BATUS; their continued success is testament to their hard work and dedication."
        }
    ]
}