{
    "url": "https://rtau.blog.gov.uk/2022/08/19/driving-responsible-innovation-in-self-driving-vehicles/",
    "title": "Driving responsible innovation in self-driving vehicles",
    "authors": [
        "Michael Birtwistle",
        "Ghazi Ahamat",
        "Lara Bird, Centre for Data Ethics and Innovation"
    ],
    "categories": [
        "Artificial intelligence",
        "Data",
        "Data-driven technology",
        "Ethical innovation",
        "Responsible innovation",
        "Trustworthy innovation"
    ],
    "pub_date": "2022-08-19T09:03:27+01:00",
    "content": [
        {
            "text": "Self-driving vehicles have the potential to radically transform the UK’s roads. But to enable their benefits and achieve the government’s ambition to ‘make the UK the best place in the world to deploy connected and automated vehicles’, developers and manufacturers need clarity about the regulatory landscape they are operating in, and the general public needs to have confidence in the safety, fairness and trustworthiness of these vehicles."
        },
        {
            "text": "Today we are publishing ‘Responsible Innovation in Self-Driving Vehicles’, a report that sets out proposals for a trustworthy approach to the regulation and governance of self-driving vehicles. The report proposes how we can update our current legal and regulatory systems that rely on holding licensed human drivers accountable."
        },
        {
            "text": "The recommendations in this report directly support the government’s ‘Connected and Automated Mobility 2025: Realising the benefits of self-driving vehicles in the UK’ - a roadmap to developing a new legislative framework to build trust in self-driving vehicles while enabling innovation."
        },
        {
            "text": "Supporting UK leadership on AI governance"
        },
        {
            "text": "With the right design, regulation and governance can actively enable responsible innovation.Our report provides a comprehensive view of how the recent proposals set out by the Law Commissions can be supported by a responsible and trustworthy regulatory and assurance framework."
        },
        {
            "text": "This report takes a broad view of the factors that are crucial to public trust: safety; data privacy and fairness. We also look at the areas that will be important enablers to responsible innovation: facilitating sufficient explainability to ensure accountability; data sharing; promoting public trust and effective governance."
        },
        {
            "text": "The recommendations in our report aim to ensure a fair, trustworthy and proportionate approach to the regulation and governance of self-driving vehicles to build public trust and confidence in their use, which in turn will drive responsible adoption and innovation. "
        },
        {
            "text": "The flexible, pro-innovation approach taken in this report supports the government’s ambition to build the most trusted and pro-innovation system for AI governance in the world, and aligns with the recent ‘Establishing a pro-innovation approach to regulating AI’ paper. It also forms part of the CDEI’s wider programme of work on AI Assurance, which supports the development of an effective and mature ecosystem of AI assurance services in the UK."
        },
        {
            "text": "Working in partnership to drive responsible innovation"
        },
        {
            "text": "We were commissioned to produce these recommendations by the Centre for Connected and Autonomous Vehicles, a joint policy unit within the Department for Transport and the Department for Business, Energy & Industrial Strategy."
        },
        {
            "text": "The report has been informed by the expert contributions of Professor John McDermid and Professor Jack Stilgoe, and through engagement with members of the Centre for Data Ethics and Innovation Advisory Board and key stakeholders, including the Law Commission of England and Wales and the Scottish Law Commission, the Information Commissioner’s Office, the Office of the Biometrics and Surveillance Camera Commissioner, the Driver and Vehicle Standards Agency, and the Vehicle Certification Agency."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "This report will inform the work of the Centre for Connected and Autonomous Vehicles as they develop primary and secondary legislation in this area.  As they start to implement the new legislative and regulatory frameworks for self-driving vehicles, we will continue to support their development. "
        },
        {
            "text": "We are also exploring pilot projects to demonstrate different approaches to algorithmic explainability in this domain directly with industry partners. If you would be interested in working with us as a pilot partner or would like to find out more about this report, please contact us at cdei@cdei.gov.uk."
        }
    ]
}