{
    "url": "https://environmentagency.blog.gov.uk/2022/08/19/energy-infrastructure-consulting-on-sizewell-c-environmental-permits/",
    "title": "Energy infrastructure: Consulting on Sizewell C environmental permits",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry"
    ],
    "pub_date": "2022-08-19T13:46:24+00:00",
    "content": [
        {
            "text": "Alan McGoff, who advises on new nuclear build policy and strategy at the Environment Agency, talks about the importance of engaging with the public on a national infrastructure project and the impact of the project on the local and national environment."
        },
        {
            "text": "I've worked at the Environment Agency since it was created in 1996 and for one of its founder bodies, Her Majesty’s Inspectorate of Pollution (HMIP) before that – so 30 years in total. In my early career with HMIP I became site inspector for Sizewell B leading our regulation and permitting of the site which was in the final stages of construction and beginning commissioning. It was a hectic time, not least because of the outcome of a then ongoing judicial review for another site (Sellafield) meant that we had to consider “regulatory justification” in our decision making. As now, public consultation was important so we held a further consultation on regulatory justification. After carefully considering all the responses we received in our consultations we issued the “authorisations” for the site in November 1994 – around 18 months after we received the applications."
        },
        {
            "text": "Now nearly 28 years later we’re back consulting on environmental permits for Sizewell C – the proposed new nuclear power station adjacent to the B station."
        },
        {
            "text": "Our nuclear future"
        },
        {
            "text": "The transition away from fossil fuels depends on how quickly the UK can roll out new renewables and other low carbon energy sources such as nuclear. The government’s ‘Ten point plan for a green industrial revolution’, together with the ‘Net zero strategy’ and the recent British Energy Security Strategy set this out. The energy security strategy states an aim that by 2050, up to a quarter of the power used in Great Britain will be from nuclear compared to about 15% today. This equates to 24GWe of generating capacity – for comparison Sizewell C, if built, would provide 3.2GWe – enough to power about 6 million homes"
        },
        {
            "text": "The Environment Agency is the independent environmental regulator for the nuclear industry in England. We make sure that nuclear power stations meet high standards of environmental protection."
        },
        {
            "text": "Permitting Sizewell C"
        },
        {
            "text": "In 2020, the EDF owned company that wants to build Sizewell C (NNB Generation Company (Sizewell C) Limited) applied to us for 3 environmental permits that would be required to operate a nuclear power station. We asked the public for their views on the applications and supporting documents. Our technical specialists have been scrutinising the applications, asking the company for further information, and carrying out several assessments to help us reach our proposed decision on each application. It’s a thorough process and we also seek advice from other organisations including Natural England and the UK Health Security Agency."
        },
        {
            "text": "The advantage of Sizewell C applying for these permits now, many years ahead of when the station would be operating, is that it enables us to regulate more fully the final design, procurement, construction and commissioning of the power station."
        },
        {
            "text": "So what would these permits allow the company to do:"
        },
        {
            "text": "The big picture"
        },
        {
            "text": "Before Sizewell C can be built, the company must get all the necessary permissions.  These include:"
        },
        {
            "text": "Working with communities"
        },
        {
            "text": "In July we started our 12 week consultation on our proposed decisions so that people can share views and new information with us to help us to reach a final decision. We’ll carefully consider all the comments we receive before making our final decisions, which we aim to make in 2023."
        },
        {
            "text": "We want people who live near Sizewell, or anywhere in the UK with an interest in this power station, to be involved in decisions that affect their community and the country."
        },
        {
            "text": "We’ve been regularly visiting and having online conversations with community representatives and environmental groups for several years. In July we organised events in towns near Sizewell for local people to talk with us and ask questions about our proposed decisions. It was hot and we appreciate all those who came along to see us. We had a lot of questions including about our role and the role of others involved in consenting a new nuclear power station, about radioactive waste management and future disposal, and about the impacts of discharges."
        },
        {
            "text": "We’ll also be holding an online event in early September for anyone to attend and ask questions ahead of submitting their consultation response."
        },
        {
            "text": "So please do have a look at the documents we’ve published. Is what we’ve said correct?  Do you have local knowledge which will help inform this assessment?"
        },
        {
            "text": "You can also email us to join our e-bulletin list for news about regulation of nuclear sites across England. nuclear@environment-agency.gov.uk"
        }
    ]
}