{
    "url": "https://ipa.blog.gov.uk/2022/08/19/the-road-ahead-a-site-visit-to-the-a12-and-a14-road-improvement-schemes/",
    "title": "The road ahead - a site visit to the A12 and A14 road improvement schemes",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Construction",
        "Modern Methods of Construction",
        "Project Delivery",
        "Project Delivery Profession",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2022-08-19T11:10:10+01:00",
    "content": [
        {
            "text": "Project Delivery Advisor, Dan Samaila, from the Infrastructure and Projects Authority (IPA) shares his insightful visit to the A12 and A14 road improvement schemes. "
        },
        {
            "text": "Why do we need more roads? "
        },
        {
            "text": "This is a common question in the aftermath of the pandemic and many people will assume that with people still working remotely, there is less demand on our road network. "
        },
        {
            "text": "With this in mind, I was keen to accept the invitation to visit two road schemes in different stages of their lifecycle - the A12 Chelmsford to A120 Widening Scheme, and A14 Cambridge to Huntingdon Improvement Scheme, both being delivered by National Highways. The A12 is currently in development, while the A14 is in the tail end of delivery."
        },
        {
            "text": "The visit was attended by colleagues from HM Treasury, Department for Transport, the Infrastructure and Projects Authority, National Highways and representatives from the integrated project teams. "
        },
        {
            "text": "The aims and objectives of the schemes were developed prior to the pandemic, but are still as important as ever: to improve road safety, reduce congestion, provide reliable journey times, support planned economic and housing growth, and provide safer connection routes for people (such as cyclists, walkers and horse riders). See links for further details of the A12 and A14 schemes."
        },
        {
            "text": "A12"
        },
        {
            "text": "The visit began at Kelvedon railway station, with a guided tour of the proposed A12 scheme. We joined the A12 and headed northbound to Junction 25, before heading southbound to Junction 19. The scheme aims to take long-distance traffic off the local roads and put it back on the A12, so that small local roads are not used by drivers who are trying to avoid traffic on larger roads, affecting local villages and their communities. "
        },
        {
            "text": "During the visit we were able to see the temporary site where they displayed their current sustainable energy set-up, that uses solar, hydrogen and wind to meet current power demands, without any connection to the electricity grid. The aspiration for this energy set-up is for it to be developed on a larger scale for the scheme’s main construction site. "
        },
        {
            "text": "This forward thinking and planning, will allow for carbon reduction in construction and a reduced impact on the environment, a core aspect of the IPA’s Transforming Infrastructure Performance (TIP) programme, as well as DfT’s and National Highways decarbonisation plans."
        },
        {
            "text": "A14 "
        },
        {
            "text": "From the A12, we made our way north-east to visit sections of the A14 Cambridge to Huntingdon scheme, which opened to traffic on 5 May 2020. It took over 14,000 people to build the A14, with a workforce of 2,800 at its peak in summer 2018. The road features slip formed central barriers, channel drainage sections, integral bridges with pre-cast sections built off-site. The scheme also considered aspects of biodiversity, such as burrow pits (large pits in the ground formed while excavating material for construction) turned into wetland features, and the planting of two trees for every tree taken down."
        },
        {
            "text": " "
        },
        {
            "text": "Following the drive through the scheme, we stopped at the main site which is due to close in the fortnight following the visit, with the temporary structures then being re-used for the A428 road scheme between St Neots and Caxton Gibbet. "
        },
        {
            "text": "During the stopover, the A14 Integrated Team (seven different organisations of clients, contractors and consultants) and NH Sponsorship Team outlined how co-location and taking time to develop a ‘one team’ culture was key to overcoming challenges and delivering a successful project. They explained how the use of digital tools drove productivity - for example using up to date construction metrics to drive day to day operational decisions on deployment of machines and materials."
        },
        {
            "text": " "
        },
        {
            "text": "Taking Lessons Learnt from One Scheme to Another"
        },
        {
            "text": "It was clear from both schemes, how lessons learnt are captured and stored, and then shared between projects. For instance, the A14 benefited from speedy approvals when new opportunities arose during the course of construction - this could then be implemented in the development of the A12."
        },
        {
            "text": "Another valuable lesson learnt from the A14 was the jack, slide and lowering of the Huntingdon Viaduct prior to demolition, this enabled the construction programme to be sped up by minimising the closure of the busy roads and railway line sitting below the viaduct (see video for more). "
        },
        {
            "text": "These evolving processes and innovations respond to real life challenges, and support the IPA’s vision for innovation and reform in infrastructure delivery as outlined in the Transforming Infrastructure Performance (TIP) programme, as the UK infrastructure sector becomes more productive in its delivery. "
        },
        {
            "text": "I look forward to seeing how other projects that are being developed and delivered will take these lessons learnt and develop them further in overcoming their challenges, and share their own lessons down the line, to continue to help the industry deliver real public value."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}