{
    "url": "https://food.blog.gov.uk/2022/09/20/areas-of-research-interest-the-food-standard-agencys-research-priorities/",
    "title": "Areas of Research Interest - The Food Standard Agency’s research priorities",
    "authors": [
        "Dr Adam Cook, Dr Adam Cook, Head of Science Strategy, Capability and Research"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2022-09-20T12:23:27+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Dr Adam Cook, Head of Science Strategy, Capability and Research, introduces the latest update to our Areas of Research Interest."
        },
        {
            "text": "The fundamental mission of the Food Standards Agency (FSA), as laid out in our strategy, is food you can trust. In delivering this mission we have developed seven guiding principles. These include being science and evidence-led, being transparent and working with others. We talked more about the strategy and what it means for science in a previous blog. In that blog, we mentioned that we would be publishing revised Areas of Research Interest (ARI) and I am pleased to say that we have now done this."
        },
        {
            "text": "The aims of the ARI are to set out the research questions that we want to answer to ensure a safer food system. These are not the first set of ARI that the FSA has published, our first were in 2017, but are a refresh and revision of our priorities based on an evolving food system. This shows the FSA’s continued commitment to addressing the recommendations of the Government Science Capability Review (SCR)."
        },
        {
            "text": "The updated FSA strategy expands our mission to support access to safe, healthy and sustainable food for everyone. Therefore, in addition to the previous themes addressing food standards and safety, our revised ARI also consider a new focus on food that is healthier and more sustainable."
        },
        {
            "heading": 2,
            "text": "Our four strategic priorities"
        },
        {
            "text": "The issues surrounding the food we all eat are broad and, as such, so are the research questions we wish to address. Our ARI are 14 research questions grouped under four strategic priorities:"
        },
        {
            "text": "Assuring food and feed safety and standards – this is integral to our role and considers the risks to the public through the food they consume. These risks include chemical hazards, foodborne pathogens, food hypersensitivity, food crime, novel foods and how differences in food standards across the globe may impact trade and the food available to UK consumers."
        },
        {
            "text": "Understanding consumers and our wider society – by understanding what consumers think, feel, and do we can better protect them and play our part in supporting safe, healthy, sustainable diet choices. Our research areas in this priority relate to how consumers view and understand the food system, the role behaviour and perception play in food standards and the impact of food insecurity on food safety."
        },
        {
            "text": "Adapting to the food and feed system of the future – our world is rapidly changing, and we need to predict risks and opportunities that arise, including those associated with new technologies, and how we can continue to adapt to them when developing and implementing food regulations."
        },
        {
            "text": "Addressing global grand challenges – the food system does not exist in isolation and we need to understand the role food plays in these wider challenges. These challenges include Antimicrobial Resistance, climate change and the move to more sustainable and healthy living."
        },
        {
            "heading": 2,
            "text": "Collaborating and protecting the public"
        },
        {
            "text": "These are a broad set of challenges and go far beyond what a single organisation can deliver, so we intend on using them to enable and enhance our collaborations, working with others who are undertaking or funding research on aspects of the food system. These collaborations will be with other government departments, the academic community, industry and consumers so that we can obtain an integrated understanding of the food system and the impact of interventions."
        },
        {
            "text": "By increasing our collaborations, we can ensure we continue to have access to an even more substantial evidence base to inform our decisions, in the most cost-effective manner. Providing assurance that not only are we protecting the public, but we are doing it whilst delivering the best value for money for taxpayers."
        },
        {
            "text": "The Research Excellence Framework (REF) is the UK’s system for assessing the quality of research in our Higher Education Institutions and informs the allocation of public research funds across them. The REF considers the impact of research performed by academics on public policy. Publishing our ARI enables us to give researchers access to a government regulator, to ensure that their research not only benefits the FSA but also helps ensure UK research spending can have a real-world impact and have a positive effect on the wider public."
        },
        {
            "text": "We have a great deal of research underway or already published related to scientific challenges we face and will be commissioning research in due course. However, addressing the challenges that we all face should not be a supplier-customer relationship. If you are planning or currently undertaking any research related to our 14 ARI please get in touch with us to let us know more about it."
        },
        {
            "heading": 1,
            "text": "Blaenoriaethau ymchwil yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Dr Adam Cook, Pennaeth Strategaeth Gwyddoniaeth, Gallu ac Ymchwil, yn cyflwyno’r diweddaraf am ein Meysydd o Ddiddordeb Ymchwil."
        },
        {
            "text": "Cenhadaeth sylfaenol yr Asiantaeth Safonau Bwyd (ASB), fel y nodir yn ein strategaeth, yw bwyd y gallwch ymddiried ynddo. Wrth gyflawni’r genhadaeth hon rydym wedi datblygu saith egwyddor sy’n llywio ein gwaith. Mae’r rhain yn cynnwys cael ein harwain gan wyddoniaeth a thystiolaeth, bod yn dryloyw a gweithio gydag eraill. Gwnaethom drafod rhagor am y strategaeth a’r hyn y mae’n ei olygu i wyddoniaeth mewn blog blaenorol. Yn y blog hwnnw, fe wnaethom sôn y byddem yn cyhoeddi meysydd o ddiddordeb ymchwil diwygiedig, ac rwy’n falch o ddweud ein bod bellach wedi gwneud hyn."
        },
        {
            "text": "Amcanion y meysydd o ddiddordeb ymchwil yw nodi’r cwestiynau ymchwil yr ydym am eu hateb er mwyn sicrhau system fwyd mwy diogel. Cyhoeddodd yr ASB y set gyntaf o feysydd o ddiddordeb ymchwil yn 2017. Mae’r set newydd yn adnewyddu ac yn adolygu ein blaenoriaethau sy’n seiliedig ar system fwyd sy’n datblygu. Mae hyn yn dangos ymrwymiad parhaus yr ASB i fynd i’r afael ag argymhellion Adolygiad Gallu Gwyddoniaeth y Llywodraeth (SCR)."
        },
        {
            "text": "Mae strategaeth ddiwygiedig yr ASB yn ehangu ar ein cenhadaeth i gefnogi bwyd sy’n ddiogel, yn iachus ac yn gynaliadwy i bawb. Felly, yn ogystal â’r themâu blaenorol sy’n mynd i’r afael â safonau a diogelwch bwyd, mae ein meysydd o ddiddordeb ymchwil diwygiedig hefyd yn ystyried ffocws newydd, sef bwyd sy’n iachach ac yn fwy cynaliadwy."
        },
        {
            "text": "Mae’r materion sy’n ymwneud â’r bwyd rydym yn ei fwyta yn eang, ac felly hefyd y  cwestiynau ymchwil yr ydym am fynd i’r afael â hwy. Mae ein meysydd o ddiddordeb ymchwil yn cynnwys 14 cwestiwn ymchwil sydd wedi’u grwpio o dan bedair blaenoriaeth strategol:"
        },
        {
            "text": "Sicrhau diogelwch a safonau bwyd a bwyd anifeiliaid – mae hyn yn rhan annatod o’n rôl ac yn ystyried y risgiau i’r cyhoedd trwy’r bwyd y maent yn ei fwyta. Mae’r risgiau hyn yn cynnwys peryglon cemegol, pathogenau a gludir gan fwyd, gorsensitifrwydd i fwyd, troseddau bwyd, bwydydd newydd a sut y gall gwahaniaethau mewn safonau bwyd ledled y byd effeithio ar fasnach a’r bwyd sydd ar gael i ddefnyddwyr y Deyrnas Unedig (DU)."
        },
        {
            "text": "Deall defnyddwyr a’n cymdeithas ehangach – trwy ddeall beth mae defnyddwyr yn ei feddwl, yn ei deimlo, ac yn ei wneud, gallwn eu diogelu’n well a chwarae ein rhan wrth gefnogi dewisiadau deiet diogel, iachus a chynaliadwy. Mae ein meysydd ymchwil yn y flaenoriaeth hon yn ymwneud â sut mae defnyddwyr yn gweld ac yn deall y system fwyd, y rôl y mae ymddygiadau a chanfyddiadau yn ei chwarae mewn perthynas â safonau bwyd ac effaith diffyg diogeledd bwyd (food insecurity) ar ddiogelwch bwyd."
        },
        {
            "text": "Addasu i system fwyd a bwyd anifeiliaid y dyfodol – mae ein byd yn newid yn gyflym, ac mae angen i ni ragweld risgiau a chyfleoedd sy’n codi, gan gynnwys y rheiny sy’n gysylltiedig â thechnolegau newydd, a sut y gallwn barhau i addasu iddynt wrth ddatblygu a gweithredu rheoliadau bwyd."
        },
        {
            "text": "Mynd i’r afael â heriau mawr byd-eang – nid yw’r system fwyd yn bodoli ar ei phen ei hun ac mae angen i ni ddeall y rôl y mae bwyd yn ei chwarae yn yr heriau ehangach hyn. Mae’r heriau hyn yn cynnwys Ymwrthedd Gwrthficrobaidd (Antimicrobial Resistance), newid yn yr hinsawdd a symud i fyw’n fwy cynaliadwy ac yn iach."
        },
        {
            "text": "Mae’r rhain yn gyfres eang o heriau, ac yn mynd y tu hwnt i’r hyn y gall un sefydliad ei gyflawni. Felly rydym yn bwriadu eu defnyddio i alluogi a gwella ein cydweithrediadau, gan weithio gydag eraill sy’n cynnal neu’n ariannu ymchwil ar agweddau ar y system fwyd. Byddwn yn cydweithio ag adrannau eraill y llywodraeth, y gymuned academaidd, y diwydiant a defnyddwyr er mwyn sicrhau dealltwriaeth integredig o’r system fwyd ac effaith ymyriadau."
        },
        {
            "text": "Drwy gynyddu ein cydweithrediadau, gallwn sicrhau ein bod yn parhau i gael mynediad at sylfaen dystiolaeth, sydd hyd yn oed yn fwy sylweddol, i lywio ein penderfyniadau, a hynny yn y modd mwyaf effeithiol o ran cost. Mae hyn yn rhoi sicrwydd, nid yn unig ein bod yn diogelu’r cyhoedd, ond ein bod yn gwneud hynny gan sicrhau’r gwerth gorau am arian i drethdalwyr."
        },
        {
            "text": "Y Fframwaith Rhagoriaeth Ymchwil (REF) yw system y DU ar gyfer asesu ansawdd ymchwil yn ein Sefydliadau Addysg Uwch ac mae’n llywio’r broses o ddyrannu cyllid ymchwil cyhoeddus iddynt. Mae’r REF yn ystyried effaith ymchwil a wneir gan academyddion ar bolisi cyhoeddus. Mae cyhoeddi ein meysydd o ddiddordeb ymchwil yn ein galluogi i roi mynediad i ymchwilwyr at reoleiddiwr y llywodraeth, er mwyn sicrhau bod eu hymchwil o fudd i’r ASB ond hefyd yn helpu i sicrhau y gall gwariant ymchwil y DU gael effaith go iawn yn y byd ac effaith gadarnhaol ar y cyhoedd ehangach."
        },
        {
            "text": "Mae gennym lawer o waith ymchwil ar y gweill, neu ymchwil sydd eisoes wedi’i gyhoeddi, sy’n ymwneud â’r heriau gwyddonol sy’n ein hwynebu, a byddwn yn comisiynu ymchwil maes o law.  Fodd bynnag, ni ddylai mynd i’r afael â’r heriau sy’n ein hwynebu i gyd fod yn berthynas cyflenwr i gwsmer. Os ydych chi’n cynllunio, neu’n cynnal unrhyw ymchwil sy’n ymwneud â’n 14 o feysydd o ddiddordeb ymchwil ar hyn o bryd, cysylltwch â ni i roi rhagor o wybodaeth."
        }
    ]
}