{
    "url": "https://ipa.blog.gov.uk/2022/09/20/celebrating-a-decade-of-the-project-delivery-profession/",
    "title": "Celebrating a decade of the Project Delivery Profession",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "IPA Project Profession and Standards",
        "Major projects",
        "Project Delivery",
        "Transformation"
    ],
    "pub_date": "2022-09-20T09:21:52+01:00",
    "content": [
        {
            "text": "Above, (from left to right) Nick Borwell, Fiona Spencer, Tim Banfield, and Karina Singh."
        },
        {
            "text": "The Project Delivery Profession has been in existence for a decade now. It’s one of the youngest professions in government, and as you would expect it is the most delivery-focused. As the profession enters its second decade of development, a lineage of Heads of Profession (HoPs), Tim Banfield, Nick Borwell, Fiona Spencer and I, Karina Singh, met to reminisce about the changes they have led and built upon. "
        },
        {
            "text": "A couple of themes became very apparent as we talked - a strong sense of joint endeavour and community, spearheading real change that can take years to deliver, and systematically upskilling our people, is key to delivering our ambitions as a nation. "
        },
        {
            "text": "Our first HoP, Tim Banfield, joined us from the National Audit Office in 2013, in the recently formed Major Projects Authority (MPA). Having reviewed and assured major projects for years, he brought with him an understanding of the key ingredients of good delivery - strong sponsorship, energetic, empowered teams and structured capability development. During Tim’s time, the accountability of Senior Responsible Owners (SROs) for major programmes was strengthened, making them directly accountable to Parliament. Tim also introduced the first ever Project Delivery Fast Stream and the Fast Track apprenticeship scheme. He started the work on codifying the capabilities needed for particular roles in delivering projects. Tim started making real progress when instead of trying to do things within the MPA, he turned his delivery model inside out and started co-creating with departments. Speaking of this work, Tim recollects “the progress we started making was phenomenal. The number who identified as project delivery professionals numbered about 10,000 by 2015.” "
        },
        {
            "text": "Nick Borwell took over from Tim in 2016. Nick joined the then re-formed Infrastructure and Projects Academy (IPA) from Mott Macdonald, with extensive delivery experience from both the private and public sectors. Nick and his small team were immediately pulled into EU Exit transition planning, plugging significant skills gaps across the government by redeployment and upskilling. The team launched the first ever cross-departmental project delivery recruitment campaigns that successfully drew in significant numbers of new project delivery professionals to the Civil Service. At this time, he commissioned and ran the EU Exit Programme and Project Leadership (PPL) training. Building on this work, the team formalised the Project Delivery Capability Framework (PDCF), which articulates the competencies required for all project delivery roles. Nick also led the development of a new government online skills assessment tool, Government Online Skills Tool (GOST), that helps government project delivery professionals assess their skills against their current roles and ambitions in a structured way. Nick introduced the first version of the Government Project Delivery Standard and created the highly sought-after development programme ‘Orchestrating Major Programmes’, aimed at Director Generals and Chief Executive Officers overseeing significant portfolios of change in their departments. HM Treasury also agreed to send spending teams on major project development programmes run by the Major Projects Leadership Academy faculty. The departmental HoPs continued to be the engine for project delivery development over this period. By the end of Nick’s tenure, the government project delivery profession adopted the symbol of a black swan as its emblem, in recognition of those improbable, but highly impactful events that experienced project delivery teams get adept at managing. "
        },
        {
            "text": "Fiona Spencer succeeded Nick in 2019, joining with extensive experience in managing complex projects, programmes and portfolios. As the Home Office’s HoP, Fiona had worked closely with both Nick and Tim in the IPA to establish the fast stream, develop the standards agenda and shape the profession. Her time in the IPA saw a concerted effort to build on these foundations to develop a more systemic framework of standards and guidance for government project delivery, with a range of products co-created with the profession. These included guidance for SROs and the ‘Art of Brilliance’ SRO handbook, the Principles for Project Success, reissue of the Project Routemap series, development of the Government Project Delivery Framework and a range of other supporting guidance and tools. She also led creation of the Government Projects Academy, bringing together project delivery training, with Nick’s investment in the GOST tool and the PDCF to establish a comprehensive toolkit for developing and externally validating the skills and experience of government project delivery professionals through the new government professional accreditation scheme.  Fiona also introduced the first training programme for ministers sponsoring major projects and oversaw the introduction of Chief Project Delivery Officers in departments to advise Accounting Officers and Executive Boards, to help improve standards and build project delivery capability.  "
        },
        {
            "text": "As we enter the second decade of the profession, there is a lot to look forward to. Taking over from Fiona in July 2022, I have brought my expertise in project delivery, my experience in building diverse capabilities and my passion for making project delivery the profession of choice across government. As I consult on and finesse where I want to take the profession next, I can say I am proud to be building on such solid foundations, have a brilliant community around me to work with and of course a lineage of HoPs to turn to for advice. "
        },
        {
            "text": "Here’s to the next decade. "
        }
    ]
}