{
    "url": "https://prisonjobs.blog.gov.uk/2022/09/20/i-absolutely-love-my-job-seeing-the-difference-i-can-make-is-so-special/",
    "title": "“I absolutely love my job. Seeing the difference I can make is so special.”",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Community Payback",
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2022-09-20T17:14:10+01:00",
    "content": [
        {
            "text": "Read on to see if it’s for you, find out more and take a look at our current vacancies. "
        },
        {
            "text": "Why did you decide to become a Community Payback (CP) supervisor?"
        },
        {
            "text": "Having been a self-employed book-keeper and accountant for a number of years, and now that my family have grown up, I wanted a change. I was looking for a secure job where I could work regular hours and take paid leave."
        },
        {
            "text": "I also wanted to help people. An opportunity to make a difference at a difficult time in their lives."
        },
        {
            "heading": 4,
            "text": "What does a typical day as a CP supervisor look like for you?"
        },
        {
            "text": "What skills and experience do you bring to the role?"
        },
        {
            "text": "I’m a mother, a grandmother, a sister and a daughter. I have a lot of life experience to draw on. I can see how people get into trouble, and how they stay out of it."
        },
        {
            "text": "My job is about being human: recognising that we can all make mistakes but can learn from them and change. I can’t make people change, but I can help plant the seed and support them to do so. Sometimes, all people need is a bit of one-to-one attention and a chat about their personal circumstances to make them stop and think. And I’m good at that, I’ve done it all my life."
        },
        {
            "text": "I see my job as helping people see what they’re capable of and building on it. Learning new skills and the discipline of going to work while on Community Payback can really help them focus on turning their lives around."
        },
        {
            "text": "What makes a good CP supervisor?"
        },
        {
            "text": "What do you like about working as a CP supervisor?"
        },
        {
            "text": "Getting the people on probation in the groups I’m supervising interacting and working well together."
        },
        {
            "text": "The real job satisfaction is when someone takes the time to say, ‘see you next week’ and asks how I am the next time they see me. Then I know I’ve made a connection with them and that they’re more motivated to complete their Community Payback. It’s great when you see that change in someone who was previously dragging their feet and not co-operating."
        },
        {
            "text": "I really enjoy working outside on projects. I’ve learnt a lot more about gardening since I started in this job, and my health is so much better now I’m more active."
        },
        {
            "text": "I absolutely love my job. Seeing the people on my groups keep turning up for their unpaid work, and how they react to me is so special – knowing that something I’ve done or said has made a positive difference."
        }
    ]
}