{
    "url": "https://movingon.blog.gov.uk/2022/09/20/managing-in-service-defects/",
    "title": "Commercial operators urged to carry out regular maintenance",
    "authors": [
        "Dave Wood"
    ],
    "categories": [
        "Enforcement",
        "Maintenance workshop",
        "Vehicle testing"
    ],
    "pub_date": "2022-09-20T15:02:23+01:00",
    "content": [
        {
            "text": "Commercial operators are being reminded of the importance of carrying out regular maintenance all year round to avoid dangerous incidents as data reveals vehicles are issued 10 times more prohibitions 3 months after their annual test (MOT)."
        },
        {
            "text": " DVSA examiners encountered a concerning 25 percentage point increase in prohibitions compared to the first month after an MOT."
        },
        {
            "text": "This indicates that some vehicles are not being adequately maintained following their test."
        },
        {
            "text": "We want to remind all operators to prioritise vital vehicle maintenance and ensure they are legal and roadworthy all year round. This includes checking you are getting what you pay for from third party maintenance providers."
        },
        {
            "text": "The data also shows that more than 60% of HGV prohibition defects found at the roadside 3 months after the MOT could have been reported and fixed before beginning a journey or noticed when driving the vehicle."
        },
        {
            "text": "Several situations can contribute to this happening, including:"
        },
        {
            "text": "Both operators and drivers are responsible for making sure vehicles are in good working order before they leave their base of operations. It’s an offence to use an unroadworthy vehicle on the road."
        },
        {
            "text": "It is important drivers are allowed time to complete the necessary checks by transport managers within their schedule."
        },
        {
            "text": "Operators are legally responsible for ensuring vehicles are maintained and used in a roadworthy condition and drivers are legally responsible for the condition of the vehicle they drive."
        },
        {
            "text": "What we have found"
        },
        {
            "text": "Drivers generally don’t want to use an unroadworthy vehicle but sometimes they don’t realise how dangerous a vehicle can be, even with the simplest of fault."
        },
        {
            "text": "A very common example of this is a direction indicator not working. This can be very dangerous for other drivers and particularly vulnerable road users if indicators can’t be seen."
        },
        {
            "text": "This defect means the vehicle becomes immediately dangerous. We find many drivers and operators don’t realise the urgency and wait to get the indicator fixed when it gets back to base."
        },
        {
            "text": "If we check the vehicle at the roadside and find this type of fault, the vehicle will receive an immediate prohibition and the driver could get a fixed penalty. We want to avoid so many cases of this happening in the future as it is a waste of your time and resources to bring in a vehicle which will fail the test."
        },
        {
            "text": "There are many others."
        },
        {
            "text": "What operators and drivers should do"
        },
        {
            "text": "As soon as any defect is spotted, it should be assessed as soon as it’s safe to do so. If it causes the vehicle to be dangerous it must not be used and treated as if the vehicle’s broken down."
        },
        {
            "text": "Anyone who is responsible for assessing vehicle defects should be competent and use relevant standards. The categorisation of defects will tell you how dangerous a defect is and what action would be taken if the vehicle is checked by enforcement."
        },
        {
            "text": "We do take a pragmatic approach for less serious defects that have occurred on the current day’s journey. These need to be correctly reported by the driver and assessed as not being dangerous."
        },
        {
            "text": "For defects we have mentioned above, we accept the vehicle can be repaired at the end of the current day’s journey. This concession is detailed in the introduction section of the categorisation of defects manual."
        },
        {
            "text": "As defects will inevitably happen, it is essential everyone is fully aware of their legal responsibilities ensuring:"
        },
        {
            "text": "We will be encouraging the heavy vehicle industry to support us in gathering additional insight which will enable us together to ensure vehicles are maintained to a safe standard between tests."
        }
    ]
}