{
    "url": "https://aphascience.blog.gov.uk/2022/09/20/saving-the-red-squirrel/",
    "title": "Saving the red squirrel: an update from the field",
    "authors": [
        "Sarah Beatham"
    ],
    "categories": [
        "Wildlife",
        "Women in science"
    ],
    "pub_date": "2022-09-20T11:39:36+01:00",
    "content": [
        {
            "text": "The presence of the non-native grey squirrel carries a significant economic and environmental impact in the UK. In this blog we hear from APHA ecologist Sarah Beatham, as she updates on the progress made in her work developing the delivery of contraceptives to grey squirrels."
        },
        {
            "text": "Last year I wrote about the research the APHA Wildlife team are conducting on developing an oral contraceptive to control populations of grey squirrels in the UK, to reduce the damaging effects they have on the native red squirrel and trees. Since my last blog, we have made progress in developing a feeder that can prevent access by red squirrels while delivering a bait containing contraceptives to most grey squirrels."
        },
        {
            "heading": 3,
            "text": "The story so far…"
        },
        {
            "text": "In 2021, in two woodland areas in Northumberland, we carried out field trials to see if a heavy weight placed on the doors to feeders we designed, could be used to exclude red squirrels. We found that, despite their smaller size, the reds were tenacious enough and strong enough to open the heaviest doors tested and we concluded that we would need something more sophisticated to keep them out."
        },
        {
            "text": "As part of the same trials, using colour sensors attached to the feeders, we also recorded red squirrel coat colour to compare with grey squirrel coat colour, to see if this could be used to select between the two. Although this method has a lot of potential, we concluded that a system based on colour would need a fair bit of development, to overcome the complexity of the data recorded."
        },
        {
            "heading": 3,
            "text": "Promising results"
        },
        {
            "text": "In 2022, we decided to test whether body weight could be a better squirrel selection method."
        },
        {
            "text": "Barry Bickerton, one of the red squirrel practitioners I have been working with, designed a feeder that automatically records the body weight of a red squirrel, or anything else, that feeds from it. The results so far have been very promising. Thankfully, the red squirrels, unlike many humans, were not too sensitive about having their weight taken!"
        },
        {
            "text": "During the Northumberland winter, we monitored these adapted feeders with remote cameras, recording 719 red squirrel weights from 20-30 individuals. The red squirrel body weights ranged between 200g and 319g, significantly lower than those we recorded for 50 grey squirrels (422-760g) in Yorkshire at the same time of year."
        },
        {
            "text": "To account for seasonal and geographical differences in weights, this summer we deployed the feeders in woods in Cumbria and the Yorkshire Dales and we will deploy them in more areas this winter."
        },
        {
            "text": "The Yorkshire Dales trial was recently featured in a  positive BBC News report on the squirrel contraceptive project, which was well received and has increased support for the work."
        },
        {
            "heading": 3,
            "text": "Thank you!"
        },
        {
            "text": "This has been a great study to be involved in, working in some beautiful areas of the UK with charismatic red squirrels and people who are both passionate and knowledgeable about red squirrel conservation."
        },
        {
            "text": "I would like to thank the many landowners, practitioners and volunteers who have helped with the study so far and to the UK Squirrel Accord for funding and supporting the work."
        },
        {
            "heading": 3,
            "text": "How to report red squirrel sightings"
        },
        {
            "text": "If you are lucky enough to spot a red squirrel in one of the following key areas in the United Kingdom: Scotland, Northern Ireland, Northern England, and Northern and Mid Wales, please report sightings to the UK Squirrel Accord. Or, for those happy to record other mammal sightings, you can download and use the Mammal Society app. Doing so will help conservation efforts as well as important population monitoring."
        }
    ]
}