{
    "url": "https://socialcare.blog.gov.uk/2022/09/20/taking-double-precautions-ahead-of-winter/",
    "title": "Taking double precautions ahead of winter",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2022-09-20T11:59:51+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Insulating against risk"
        },
        {
            "text": "You don’t have to be a fan of Game of Thrones to know ‘winter is coming’. And while we might wish we had a few fire breathing dragons around to help with the heating, the issues we face as a health and care system require some real world resolve and practical solutions to match."
        },
        {
            "text": "Luckily, one of those practical solutions is already tried and tested: vaccination. When the first COVID-19 vaccine was approved for roll out two years ago, vulnerable residents and frontline care and health staff were rightly among the first cohorts to be offered the jab."
        },
        {
            "text": "I am so grateful many of you agreed to be vaccinated and continue to keep yourselves, your residents and colleagues safe."
        },
        {
            "text": "Even before coronavirus became an unwelcome and seemingly permanent guest at the feast of seasonal infections, we already had the annual flu surge to contend with. Although infections have been suppressed for the last couple of years, data emerging from Australia and other territories suggests the lifting of covid restrictions means flu and other illnesses are more likely to circulate and take hold among the general population."
        },
        {
            "text": "This may seem an obvious point. However, when you consider general immunity to influenza is likely to be weaker due to lack of exposure, as a workforce about to enter a period of intense service pressure, we simply cannot be complacent."
        },
        {
            "heading": 2,
            "text": "Vaccinations underway"
        },
        {
            "text": "As I hope many of you are aware, care home residents and housebound people in England began receiving the COVID-19 booster from 5 September. Where possible and practical, the booster is being co-administered with the flu vaccine and I urge you to make sure you have both. Please book your vaccination appointments through the national booking service."
        },
        {
            "text": "I am sure your managers will work with you to make sure you have the time to keep your appointments. In tandem with maintenance of the highest standards of infection prevention and control (IPC), this really is the best way to maximise your chances of staying well, protecting others and not placing extra burden on your care teams."
        },
        {
            "text": "Having spent decades on the frontline in a variety of care settings and clinical spaces, I know as well as you that keeping contagion at bay is a battle fought on multiple fronts. I know you’re up to the task, but your confidence will be boosted – literally - by the protective shield of vaccination."
        },
        {
            "heading": 2,
            "text": "Everything you need to know"
        },
        {
            "text": "For those of you still concerned about getting your jabs, or wish to help spread the word by signposting to advice and further information, a suite of resources have been updated and made available here."
        },
        {
            "text": "The wider rollout has been gathering pace from earlier this month, prioritising the oldest and most vulnerable in our communities. The JCVI will doubtless advise who, when and why the next groups will be invited to have their vaccinations in due course. In the meantime, I know you are doing all you can to keep your residents, friends, loved ones and colleagues safe."
        },
        {
            "text": "Thank you for your strength and resilience over the last three years. Rest assured, we will do all we can to maintain your resilience and wellbeing in the months, years - and winters - to come."
        }
    ]
}