{
    "url": "https://ukhsa.blog.gov.uk/2022/07/01/covid-19-the-future-of-ukhsa-surveillance/",
    "title": "COVID-19: the future of UKHSA surveillance",
    "authors": [
        "Steven Riley"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2022-07-01T11:24:50+01:00",
    "content": [
        {
            "text": "Since the onset of the pandemic scientists and researchers, aided and supported by the UK Health Security Agency (UKHSA) and DHSC, have mobilised to create surveillance systems that have infinitely improved our understanding of COVID-19."
        },
        {
            "text": "These systems help us track prevalence of the virus across the United Kingdom, detect new variants and in turn analyse both their transmissibility and severity. Taken together, these studies allow us to understand the overall impact that different waves and variants have on communities, and how it affects different social, ethnic and age groups. Without them, the government’s ability to make timely public health interventions would be severely hampered."
        },
        {
            "text": "We have now entered a new stage of managing COVID-19. Surveillance has allowed us to understand the virus, but its vaccines that have impacted COVID-19’s ability to make people seriously ill. Over 50 million people have now had at least one jab, and nearly 40 million have had three. Spring boosters are now being given to the most vulnerable."
        },
        {
            "text": "This, however, does not mean the pandemic is over. COVID-19 must still be treated as a threat to public health, which is why UKHSA will continue to monitor the virus through several different studies."
        },
        {
            "heading": 2,
            "text": "COVID-19 Infection Survey (CIS)"
        },
        {
            "text": "The biggest of these is the Office for National Statistics COVID-19 Infection Survey (CIS), a world-leading project that provides weekly data on prevalence levels across the United Kingdom, as well as further vital information on the socio-demographic characteristics of the people and households who have contracted the virus."
        },
        {
            "text": "This year, the scale of the infection survey is being reduced a little, with an average of 9000 tests completed every day. Models will continue to adjust according to the characteristics of the sample, to ensure estimates continue to represent the population."
        },
        {
            "text": "Crucially, though, CIS will not reduce its reporting. This means we will continue to see the Weekly Infection Survey bulletin, the weekly mortality stats and the fortnightly characteristics of people testing positive for COVID-19 and Antibody and Vaccination reports."
        },
        {
            "text": "The survey is evolving to make it easier for those involved to participate. Participants will be able to post their samples and fill in a digital questionnaire, rather than having face-to-face appointments at home, while a phone service will be available to support participants."
        },
        {
            "text": "Alongside the infection survey, it is important that we continue to monitor the spread of the virus in high-risk settings."
        },
        {
            "text": "This is why both the SIREN and Vivaldi studies will continue to operate in the next year."
        },
        {
            "heading": 2,
            "text": "SIREN"
        },
        {
            "text": "SIREN, a UKHSA-led study, started out assessing the impact that detectable antibodies can have on the incidence of COVID-19, specifically in healthcare workers, and in the last year has widened its remit to analyse the impacts of vaccination on immunity within this community."
        },
        {
            "text": "The study, the largest of its kind worldwide, has since June 2020 seen a cohort of over 44,000 National Health Service healthcare workers participate across 135 hospitals UK-wide. These participants undergo regular PCR testing and antibody testing, and the resulting data gives us unparalleled insight into antibodies and therefore COVID-19 reinfection more generally."
        },
        {
            "text": "The study has had analysis published in landmark publications including The Lancet and the New England Journal of Medicine. It’s continuing to work with healthcare workers and NHS trusts in the next year and will retain capacity to monitor immunity levels against Omicron and variants beyond that."
        },
        {
            "text": "The SIREN study has helped NHS trusts across the country to produce research they wouldn’t usually have the capacity to produce and will continue to work with an engaged cohort to provide more answers to our questions on immunological trends."
        },
        {
            "heading": 2,
            "text": "VIVALDI"
        },
        {
            "text": "Running in parallel to SIREN, the VIVALDI study has been collecting similar data on care home staff and residents in 330 homes in England since June 2020. This has consisted of regular PCR testing through the National Testing Programme and repeat collection of blood samples. This has enabled analyses into (re)infection levels, variants of concern (VOCs) duration of the immune response from both vaccination and natural infection, and vaccine effectiveness."
        },
        {
            "text": "Linkage to other datasets, such as hospital admissions and mortality data, has provided further insight into COVID-19 related hospitalisations and deaths, and the protective effect of vaccination against these outcomes."
        },
        {
            "text": "This year, VIVALDI will maintain scaled-down COVID-19 work in care homes in order to answer ongoing research questions, such as around the requirement for further booster vaccinations."
        },
        {
            "text": "Alongside other tools at UKHSA’s disposal, such as continued genomic sequencing capacity, the research and analysis conducted in these studies will continue to facilitate understanding as the virus develops and ensure that public health advice keeps in step with the science."
        },
        {
            "text": " "
        }
    ]
}