{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/07/01/everyone-loses-out-with-resale-price-maintenance/",
    "title": "Everyone loses out with resale price maintenance",
    "authors": [
        "Simon Nichols"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2022-07-01T12:59:20+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is retail price maintenance?"
        },
        {
            "text": "Resale Price Maintenance (RPM), or vertical price fixing, is where a supplier requires a retailer not to sell below a certain price. The goal is to keep prices artificially high, so consumers are then robbed of a fair deal."
        },
        {
            "text": "Resale price maintenance (RPM) harms consumers with increased prices and damages business reputation as a consequence. Find out more about RPM in our video."
        },
        {
            "text": "RPM is illegal.  It harms consumers, and the consequences for businesses found using RPM agreements are severe. The fines could be as much as 10% of annual turnover. Most recently, we fined Dar Lighting £1.5 million and the total fines across all CMA RPM cases to date is more than £20 million."
        },
        {
            "text": "Our digital data monitoring tool assists us in tracking and detecting possible misconduct online. We ensure the consequences of RPM are tough and the risk of getting caught is real."
        },
        {
            "heading": 2,
            "text": "Why is resale price maintenance harmful?"
        },
        {
            "heading": 3,
            "text": "It rips off customers"
        },
        {
            "text": "At a time when many people are struggling with the cost-of-living, when every penny counts, preventing discounting through RPM is particularly harmful."
        },
        {
            "text": "At the CMA, we receive more complaints about RPM than any other anti-competitive business practice and, over the last few years, we have seen an increase in the proportion of those complaints concerning online RPM."
        },
        {
            "text": "RPM means that, regardless of how much time is spent looking for a better deal, you won’t find that reduced price. When we fined firms for RPM in the bathroom fittings and domestic lighting sector, CMA economic research revealed an estimated 17% price drop as a consequence.  This type of price reduction means a great deal to customers struggling to stretch household budgets."
        },
        {
            "heading": 3,
            "text": "It undermines the benefits of online shopping"
        },
        {
            "text": "The UK has the most advanced e-commerce market in Europe. According to the most recent figures from the Office of National Statistics, the country’s e-commerce revenue in 2019 amounted to £693 billion GBP, a sharp increase on the year prior."
        },
        {
            "text": "RPM is particularly damaging when it happens online.  Online shopping gives consumers easy access to multiple retailers. This should increase competition between retailers and suppliers as they try to attract shoppers looking for the best prices. But, when RPM occurs and restricts the ability for retailers to set their own online selling price, this weakens a key benefit of e-commerce for consumers and risks damaging consumer trust in online markets."
        },
        {
            "heading": 2,
            "text": "What suppliers and retailers can do to avoid RPM"
        },
        {
            "text": "Suppliers and retailers (whether online or on the high street) should ensure they are clear on the boundaries of competition law when entering into resale agreements. If in doubt, be sure to get legal advice and follow it carefully."
        },
        {
            "heading": 3,
            "text": "Ensure retailers are free to set their retail prices independently"
        },
        {
            "text": "Suppliers should not directly or indirectly force retailers to sell their products for a price at or above particular levels. The same rule applies in respect of the prices a retailer advertises on its website."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Be careful when implementing policies like Recommended Retail Prices (RRPs) or arrangements like Selective Distribution Agreements (SDAs)"
        },
        {
            "text": "RRPs and SDAs are a legitimate means of doing business that can benefit a company. However, they should never be misused in an attempt to get around competition rules and impose RPM."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Never ignore a CMA warning or advisory letter"
        },
        {
            "text": "You could face a significant fine increase if you are later caught breaking the law. We increased fines by 35% after a business ignored 2 warning letters and was later investigated and found to have broken the law."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Don’t assume you are safe just because you haven’t received a warning or advisory letter"
        },
        {
            "text": "We may not send out a warning or advisory letter prior to launching an investigation."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Retailers must be compliant too"
        },
        {
            "text": "The majority of CMA cases to date have focused on suppliers, however we will also investigate retailers and dependent on the circumstances they may be and have been subject to penalties too."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Create a culture of compliance"
        },
        {
            "text": "Roll out regular training with sales and other customer-facing teams on competition law rules regarding pricing."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Compliance advice and reporting"
        },
        {
            "text": "The CMA has published guidance to help suppliers and retailers across all sectors, with information about what to do if they are, or may have been, involved in RPM or similar practices. To see what RPM is in practice, watch our video."
        },
        {
            "text": "If you have information on other companies in your industry that may have been involved in an anti-competitive arrangement, report it to us or call us on 020 3738 6000."
        },
        {
            "text": "If you think your business has been involved in RPM, you should notify the CMA as soon as possible – you may benefit from lenient treatment by being the first to come forward to the CMA."
        }
    ]
}