{
    "url": "https://educationhub.blog.gov.uk/2022/07/01/how-we-are-improving-internet-access-in-rural-schools/",
    "title": "How we are improving internet access in rural schools",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Primary Schools",
        "Schools"
    ],
    "pub_date": "2022-07-01T10:28:32+01:00",
    "content": [
        {
            "text": "Fast broadband is crucial to levelling up rural communities and will help pupils from across the country to succeed in their education, no matter where their school is."
        },
        {
            "text": "That’s why, in partnership with the Department for Digital, Culture, Media and Sport (DCMS), up to 3,000 primary schools across rural England will get lightning-fast broadband connections."
        },
        {
            "text": "Here’s what you need to know about how we are improving internet access in rural schools."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "Pupils all over the country will be able to reap the benefits of super fast broadband."
        },
        {
            "text": "Through an £82 million investment, schools will be able to access future-proof speeds of up to 1,000 megabits per second – which is often known as gigabit broadband. It’s typically the fastest speed available."
        },
        {
            "heading": 3,
            "text": "What does that mean for children in these rural areas? "
        },
        {
            "text": "It means the estimated 500,000 primary school pupils in these schools will now be able to use the internet with no interruptions, even if multiple classes are using it at the same time."
        },
        {
            "text": "Teaching won’t be hindered by devices not connecting to the internet, videos buffering or by the lack of access to online resources."
        },
        {
            "text": "Pupils will benefit from being able to link up with others anywhere in the world to learn from one another, with access to an ever-growing library of online tools designed to make lessons more fun and engaging."
        },
        {
            "heading": 3,
            "text": "Where is this funding coming from? "
        },
        {
            "text": " The DCMS GigaHubs programme is providing funding for up to 2,000 schools to access the new broadband."
        },
        {
            "text": "Part of Project Gigabit - the UK government’s £5 billion national mission to deliver lightning-fast, reliable broadband across the UK - the scheme is set to connect up to 7,000 rural public sector buildings including schools, GP surgeries, libraries and other public buildings."
        },
        {
            "text": "An additional 1,000 schools will be funded by the Department for Education (DfE) as part of their mission to enable every school in England to access high-speed internet by 2025."
        },
        {
            "text": "We will also invest up to £150m to upgrade schools that fall below our Wi-Fi connectivity standards in priority areas."
        },
        {
            "heading": 3,
            "text": "When will this start happening?"
        },
        {
            "text": "An engagement exercise will take place over the coming months with all eligible schools."
        },
        {
            "text": "Procurement of the product will begin in the autumn term."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}