{
    "url": "https://planninginspectorate.blog.gov.uk/2022/07/01/royal-town-planning-institute-rtpi-work-placements-in-town-planning/",
    "title": "Royal Town Planning Institute (RTPI) – Work placements in town planning",
    "authors": [
        "Duncan Phillpotts"
    ],
    "categories": [
        "Equality Diversity and Inclusion",
        "People",
        "Public service"
    ],
    "pub_date": "2022-07-01T16:55:52+01:00",
    "content": [
        {
            "text": "The Planning Inspectorate was delighted to be involved in the RTPI EXPLORE work experience scheme. This pilot programme aims to encourage young people from under-represented groups to become Chartered Town Planners, by giving them the opportunity to explore the many rewarding roles and opportunities that the planning profession has to offer."
        },
        {
            "text": "The week saw five Sixth Form students, from schools local to our main office, being invited into the Inspectorate to participate in face-to-face and virtual workshops. These provided them with experience of the varied work of the Planning Inspectorate and of the skills needed by our staff. They also highlighted the various routes into the planning profession."
        },
        {
            "text": "To maximise the experience and engagement each student was loaned a laptop for the week. This enabled full participation in the virtual elements as well as ensuring access to valuable online resources."
        },
        {
            "text": "Having orientated the students around the office on the Monday morning, they were introduced to the wider Civil Service and to the contribution of the Inspectorate in creating great places to live, work and play. This was supported by a Planning Inspector, who presented a fascinating history of planning and provided an overview, with personal experiences, of their role."
        },
        {
            "text": "The week continued with presentations and workshops hosted by Appeal Planning Officers, who talked the students through considering ‘appearance and character’ when making appeal decisions. The students were also given the opportunity to review some previous appeal decisions, which gave them insight into the important elements that need to be considered when making a fair, open and impartial decision."
        },
        {
            "text": "The following day saw presentations and workshops conducted by the National Infrastructure team. These drew amazement from the students when they realised the contribution of the Inspectorate to sustainable energy planning, in particular."
        },
        {
            "text": "The environmental theme continued into the following day, when the students were challenged by the Environmental Services Team to undertake a screening exercise as part of an Environmental Impact Assessment. This task involved them reviewing various sources of data and maps to understand the significance of any environmental impact of a particular planning decision."
        },
        {
            "text": "To consolidate what had been learned during the week, the students were led on a guided ‘Design Tour’ of the local area. This highlighted the outcomes of some of the planning appeal decisions that had been made by the Inspectorate."
        },
        {
            "text": "The week was also interspersed with work skills training, including CV writing, the Civil Service Success Profiles and presenting skills. It also covered academic routes into planning, discussions on workplace behaviour and the benefits of psychological safety in the working environment."
        },
        {
            "text": "The students impressed with their engagement in all the activities and we received some very positive feedback at the end of the week. We even had some enquiries about apprenticeship routes into the Inspectorate!"
        },
        {
            "text": "The Planning Inspectorate would welcome the opportunity to be involved in the EXPLORE programme again and hopes to be able to offer work experience to greater numbers of students in the future."
        }
    ]
}