{
    "url": "https://kingsawards.blog.gov.uk/2022/07/01/taking-europes-gardens-to-the-next-level-woodblocx-recognised-for-exceptional-export-growth/",
    "title": "Taking Europe’s gardens to the next level - WoodBlocX recognised for exceptional export growth",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "International trade",
        "Queen's Awards",
        "Scotland",
        "Winners"
    ],
    "pub_date": "2022-07-01T09:57:05+01:00",
    "content": [
        {
            "text": "WoodBlocX has been recognised with a Queen’s Award for Enterprise in the International Trade category following the company’s outstanding growth in overseas sales. "
        },
        {
            "text": "The family business, based in the town of Dingwall in the Scottish Highlands, has achieved the award for demonstrating exceptional growth for export sales over a three year period following its entrance into the French and German markets. "
        },
        {
            "text": "Since its launch in 2012, WoodBlocX has grown exponentially from a relatively small online business selling its innovative modular raised bed kits in the UK, to a multi-million pound brand offering a wide range of garden structures tailored to customers’ requirements.  "
        },
        {
            "text": "Henry Blake, Managing Director at WoodBlocX said;"
        },
        {
            "text": "10 years of growth  "
        },
        {
            "text": "The Queen’s Award recognition comes at an exciting time for the company: 2022 marks 10 years since the business launched in the UK and it is also the year that the company will expand its operation. In 2021 it opened its very first European distribution hub in Germany which aims to reduce delivery times to customers and has already, this year launched in Italy, Belgium and the Netherlands.  "
        },
        {
            "text": "The entire team at WoodBlocX are overjoyed to have achieved this award, it is a great achievement especially since the disruption that came with Covid. They also anticipate that achieving a Queen’s Award will boost their profile both in the UK and internationally.  "
        },
        {
            "text": "Joanie Whiteford, Her Majesty’s Lord-Lieutenant for Ross and Cromarty is delighted for the business which is the first in Ross and Cromarty to win this award since she became Lord-Lieutenant in 2019. HM Lord-Lieutenant said:"
        },
        {
            "text": "WoodBlocX’s top tips to future applicants is to tell your company’s unique story and provide as much detail as possible. "
        },
        {
            "text": "Find out more about WoodBlocX on their website."
        },
        {
            "text": "Has your company got what it takes to win a Queen’s Awards for Enterprise? Applications are open now until the 6th September. Apply now! "
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880"
        }
    ]
}