{
    "url": "https://kingsawards.blog.gov.uk/2023/08/30/congratulations-to-the-james-hutton-institute-on-their-sustainable-development-award/",
    "title": "Congratulations to The James Hutton Institute on their Sustainable Development Award",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "King's Awards",
        "Sustainable development"
    ],
    "pub_date": "2023-08-30T12:49:26+01:00",
    "content": [
        {
            "text": "Tucked away in Scotland’s northeast, The James Hutton Institute has for a long time been something of a hidden gem."
        },
        {
            "text": "It is one of the UK’s biggest independent research centres, with more than 500 scientists and support staff, combining interdisciplinary strengths agriculture, food security, ecosystems and resilient communities. This year, the Institute was recognised with The King's Award for Enterprise for Sustainable Development."
        },
        {
            "text": "These are strengths that are increasingly at the forefront of government and policy makers’ minds."
        },
        {
            "text": "They need answers to issues such as food, energy and environmental security."
        },
        {
            "text": "Underpinning these global challenges and the Hutton’s research is a drive for sustainability. This is why the institute felt it was time to be more proactive in sharing its work."
        },
        {
            "text": "“We felt we had a story to tell,” says Colin Campbell, the institute’s Chief Executive. “The King’s Award for Enterprise in Sustainable Development was a great way to achieve this because the King’s Awards are so well perceived, and you get such great profile and awareness raising."
        },
        {
            "text": "“The award recognises the wide range of activities that we undertake, all of which is aligned with the UN’s Sustainable Development Goals. So it was especially appropriate for us to apply for the award for Sustainable Development.”"
        },
        {
            "text": "Stefan Jindra, the Hutton’s Sustainability Officer, adds, “As well as the research we do, we have been reporting and reducing our emissions since 2013, through alternative and energy saving measures, from solar power to biomass, and we have met and even exceeded our short-term targets."
        },
        {
            "text": "“We are also leading by example through projects such as our Climate-Positive Farming Initiative, which seeks to achieve negative emissions through transforming farm activities, while our Just Transition Hub project in Aberdeen will help to build capacity and share expertise in the wider region."
        },
        {
            "text": "“That’s why for us it was great that the award also recognises how we’re addressing our own sustainability as a major research establishment, which is perhaps unusual for the King’s Awards, which are traditionally awarded to businesses.”"
        },
        {
            "text": "The institute receives a significant amount of its funding from the UK and Scottish Governments. For example, its International Barley Hub and Advanced Plant Growth Centres at its Invergowrie campus, near Dundee, are being supported through £45 million funding from the UK Government and £17 million from the Scottish Government, as part of the Tay Cities Region Deal. Both projects underpin its commitment to inclusive growth and sustainable food production for the future."
        },
        {
            "text": "Its HydroGlen green hydrogen powered farm community project and the Just Transition Hub at its Aberdeen campus last year also received £13 million from the Scottish Government Just Transition Fund. Both target sustainability in energy and land use, building expertise and capacity in the region."
        },
        {
            "text": "“The application process for the award was straight forward,” explains Stefan. “Through the work we have already doing to develop our updated Climate Action Plan, which commits us to net zero scope 1 and 2 emissions by 2035 and net zero scope 3 emissions by 2040, in line with the Science Based Target initiative, we already had a lot of the information and evidence we needed to put forward our case."
        },
        {
            "text": "“The result has been really positive. The wider recognition we are now seeing for not only the science we do but what we are doing as an organisation to be sustainable is tangible."
        },
        {
            "text": "“For anyone thinking about applying for the King’s Award for Sustainable Development, I’d say go for it. You do need to have the information to support your application, but if you’re serious about sustainability, which we are, you will already have it. So go for it.”"
        },
        {
            "text": "Find out more about The James Hutton Institute on their website: https://www.hutton.ac.uk/"
        },
        {
            "text": "Apply for this year's King's Awards round here: https://www.gov.uk/kings-awards-for-enterprise"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}