{
    "url": "https://defrafarming.blog.gov.uk/2023/08/30/farmers-webinar-learn-more-about-funding-and-put-your-questions-to-us/",
    "title": "Farmer’s webinar: learn more about funding and put your questions to us ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments to improve animal health and welfare",
        "Sustainable Farming Incentive",
        "Things we're doing",
        "Ways to get involved"
    ],
    "pub_date": "2023-08-30T12:02:16+01:00",
    "content": [
        {
            "text": "On Wednesday 6 September, we’re holding a webinar for farmers to learn more about the funding available in England.  "
        },
        {
            "text": "Policy leads working on the Sustainable Farming Incentive, the Farming Equipment and Technology Fund and the Animal Health and Welfare Pathway will explain the offer and answer your questions. "
        },
        {
            "text": "To attend the online session, simply follow the Eventbrite link and reserve a place. It’s free. "
        },
        {
            "text": "You will receive a link to the event in your confirmation email. You’ll also receive a reminder email before the event starts with the link to join. "
        },
        {
            "text": "The 1-hour webinar will start at 11:30am. "
        },
        {
            "text": "It will be recorded so if you can’t attend, don’t worry. We'll add the video recording to this post after it ends.  "
        },
        {
            "text": "To prepare, you might find it helpful to look at the Funding for farmers, growers and land managers page on GOV.UK. It lists every payment available in England.  "
        },
        {
            "text": "Finally, we'll share a survey at the end of the webinar. As this is the first time we’re trying this format out, we’d appreciate your feedback. It would be particularly helpful to know how useful you found the webinar, if you’d like us to plan more, their frequency and your thoughts on how they could be improved. "
        },
        {
            "text": "If you can’t attend and watch the recording afterwards, you can always leave your thoughts in the comments section below. We'll review all the feedback and blog again with an update on future plans.  "
        }
    ]
}