{
    "url": "https://educationinspection.blog.gov.uk/2023/08/30/getting-all-pupils-reading/",
    "title": "Getting all pupils reading",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Education"
    ],
    "categories": [
        "early years",
        "education inspection framework",
        "inspection",
        "reading"
    ],
    "pub_date": "2023-08-30T09:00:06+01:00",
    "content": [
        {
            "text": "In this blog, we explore the challenges of getting primary pupils back on track with reading. We look at:"
        },
        {
            "heading": 4,
            "text": "Getting pupils back on track  "
        },
        {
            "text": "On inspection, we’ve seen the difficulties that teachers are facing as they try to get all pupils back on track with reading."
        },
        {
            "text": "Teachers tell us they are noticing that more pupils are further behind with reading. The wider the range of starting points, in any one class, also adds to the challenge."
        },
        {
            "heading": 4,
            "text": "Guiding principles for ensuring that pupils who have fallen behind in reading are able to catch up quickly"
        },
        {
            "text": "The early reading evaluation criteria in our school inspection handbook helps us identify what successful schools are doing to support lower attaining pupils."
        },
        {
            "text": "We have drawn up 5 guiding principles:"
        },
        {
            "text": "You can read more about the principles below or by clicking on each title in the above list. Below the principles, you will also find information on:"
        },
        {
            "heading": 4,
            "text": "Principle 1: If pupils are not able to read well, they will not be able to access the full curriculum"
        },
        {
            "text": "Reading is the gateway to learning. Pupils who struggle with the basic mechanics can quickly fall behind."
        },
        {
            "text": "Being able to read accurately by age 6 has a strong correlation with future academic success. So, getting phonics teaching right is essential. That’s why our education inspection framework (EIF) places a strong emphasis on how well schools teach all pupils to read."
        },
        {
            "text": "In September 2022, we added an evaluation criteria (paragraph 241) to our school inspection handbook. It reflects the importance of reading and emphasises that support should be given to all pupils."
        },
        {
            "heading": 4,
            "text": "Principle 2: Rigorous ‘keep-up’ reduces ‘catch-up’ later"
        },
        {
            "text": "If schools make sure that all pupils keep up with phonics from Reception and Year 1, only new arrivals may need to catch up."
        },
        {
            "text": "The Department for Education (DfE)’s reading framework says:"
        },
        {
            "text": "‘Teachers should aim for all children to keep up with the school’s chosen phonics programme, ensuring teaching time is sufficient for the content to be taught within the timescales the programme sets out. Some children need extra support from the beginning.’"
        },
        {
            "text": " Successful schools are rigorous in making this possible. They do it in different ways including:"
        },
        {
            "text": "A few pupils (including some with SEND) may not be able to keep up and need to take smaller steps. This can help them make progress every day. Ongoing assessment should enable teachers to address this urgently."
        },
        {
            "heading": 4,
            "text": "Principle 3: Catch-up is essential for pupils who have fallen behind"
        },
        {
            "text": "Successful schools have a carefully thought-out catch-up plan for new pupils or for those who have fallen behind due to loss of schooling."
        },
        {
            "text": "Making the best use of time in every phonics lesson, as well as finding sufficient time for extra teaching and practice, is crucial. This means that:"
        },
        {
            "text": "We often see pupils with insufficient knowledge being expected to attempt the same learning as their peers. Struggling to access the lesson wastes precious time and can threaten their self-confidence. Pupils who need more teaching and practice opportunities than their peers end up with less."
        },
        {
            "text": "Successful schools use assessment to identify precise gaps in a pupil’s phonic knowledge. Extra daily teaching, as well as help during the phonics lesson itself, focuses on these gaps."
        },
        {
            "text": "Other features of successful schools include:"
        },
        {
            "heading": 4,
            "text": "Principle 4: There are no short cuts when following the sequence of a phonics programme"
        },
        {
            "text": "Successful leaders choose a phonics programme that can achieve consistency across the school. Fidelity to the sequence of the school’s phonics programme is essential. Each programme introduces grapheme-phoneme correspondences and common exception words in a specific order. Following the sequence builds effectively and cumulatively on what has been taught before. It’s not possible to take short cuts."
        },
        {
            "text": "While fidelity to the sequence is vital, not all schools, or classes within a school, can make the same choices about how to organise teaching. Organising teaching will depend on a range of factors. It will be affected by whether all pupils have kept up, pupils’ starting points, and the priority given to phonics teaching and extra catch-up sessions."
        },
        {
            "heading": 4,
            "text": "Principle 5: The curriculum is the same for all pupils, including those who need to catch up"
        },
        {
            "text": "Some pupils have been left behind without sufficient teaching and practice. This does not mean that phonics does not work or that other strategies should be used. Phonics is the only way to accurately read an unfamiliar word. All pupils who struggle to read should be taught to do this. Pupils who have fallen behind need to be taught the phonic knowledge for the stage they are at. All pupils are on the same curriculum journey but at different stages (See principle 3.)"
        },
        {
            "heading": 4,
            "text": "Fidelity to a phonics programme"
        },
        {
            "text": "Leaders on inspection often raise the issue of fidelity to a phonics programme. Some tell us it’s difficult to balance this fidelity with making sure that pupils who need teaching at an earlier stage get it so that they can catch up quickly."
        },
        {
            "text": "When leaders buy a scheme, it’s usually because they want consistency across the school and a curriculum designed by experts. It is understandable that they want to follow the programme with fidelity."
        },
        {
            "text": "As we explored in principle 4, fidelity is important. The programme has been carefully sequenced to build on what has been taught before. It should be followed as intended – as long as pupils are keeping up. If pupils have different starting points, they will need to be taught the content from an earlier stage."
        },
        {
            "heading": 4,
            "text": "Evaluating how well pupils are taught to read"
        },
        {
            "text": "When we evaluate reading on inspection, we are interested to find out if the school’s curriculum is doing the job that leaders want it to. We use the early reading evaluation criteria in our school inspection handbook to find out how effectively the curriculum is being implemented and how well all pupils are learning to read. We pay particular attention to what the school is doing to help the lowest attaining pupils to catch up."
        },
        {
            "text": "We don’t directly inspect fidelity to a phonics programme or the phonics programmes themselves. We do not have a preference about which phonics programme a school chooses. The DfE has a list of suitable programmes which have been validated but following one of these is not mandatory. What is important is that schools teach all pupils to read fluently."
        },
        {
            "heading": 4,
            "text": "Principles into practice - examples from schools with different circumstances"
        },
        {
            "text": "Here are some good examples of how schools working in different contexts have made decisions so that pupils can catch up quickly."
        },
        {
            "text": "School 1 - In this two-form entry primary school, the same phonics content is taught to the whole class at the same time. Teachers spot those who need extra help straight away and provide that support during the lesson. Some pupils who need even more practice also have a daily session to consolidate what they’ve been taught. It’s the same content as the whole class session but may be broken down into smaller steps."
        },
        {
            "text": "If new pupils are behind, they receive additional teaching at their stage from a teaching assistant with phonics expertise. The groups may include pupils from different classes and year groups. This takes place during phonics lesson time and in an additional sessions until pupils can join the whole class."
        },
        {
            "text": "School 2 – In this two-form entry infant school, pupils throughout the school are organised in groups according to the stage they are at with phonics. Most pupils keep up with the expected pace of the programme. Groups sometimes include pupils from more than one year group who are at the same stage. Pupils who have fallen behind also receive daily catch-up teaching."
        },
        {
            "text": "School 3 - In this small primary school with only two classes, leaders had to plan carefully because pupils in the same class have very different starting points. Pupils are grouped together by phonic stage rather than age. The teacher provides phonics teaching for each group separately while others are working independently to practise using knowledge they have learned previously. Pupils who are behind also receive additional practice each day."
        },
        {
            "text": "School 4 – In this one-form entry primary school, phonics teaching is organised differently in some year groups than others. In Reception, the teacher delivers the same content to the whole class at once. The teacher and teaching assistant use ongoing assessment to spot children who need extra help during the lesson. They have also identified a group of children who regularly need a bit more time. These children are taken out of class each afternoon for a short ‘keep-up’ session."
        },
        {
            "text": "Leaders have made this a priority and they select support staff from across the school who have the greatest phonics expertise to provide this teaching."
        },
        {
            "text": "In Year 1, there are several new pupils who are at a much earlier stage. They cannot yet access the same content and so the teacher groups them together. The group carries out consolidation tasks while the others receive their daily phonics teaching. Then the teacher swaps over and teaches this group while the rest are practising what they have been taught. The small group also have another daily session of phonics."
        },
        {
            "text": "There are a few pupils in Years 3 and 4 who are not reading accurately and automatically. New leaders have already put systems in place to make sure that all future pupils keep up. They have also made sure that phonics teaching continues for these pupils into key stage 2. This group of pupils are taught phonics during the second half of each English lesson by a teaching assistant with phonics expertise. The group takes part in the first part of each English lesson, which makes sure they hear age-appropriate books being read and benefit from the discussion to support their language comprehension."
        },
        {
            "text": "These examples demonstrate that there is no single way to organise the teaching of phonics effectively. What matters most is that any pupils who fall behind are able to catch up quickly. Applying the principles for helping pupils to catch up quickly, alongside consideration of the context, increases the likelihood of all pupils learning to read well as soon as they should."
        }
    ]
}