{
    "url": "https://educationinspection.blog.gov.uk/2023/08/30/more-parental-complaints-dont-mean-more-inspections/",
    "title": "More parental complaints don’t mean more inspections",
    "authors": [
        "Christopher Russell, National Director Education"
    ],
    "categories": [
        "education inspection framework",
        "inspection",
        "schools"
    ],
    "pub_date": "2023-08-30T08:30:48+01:00",
    "content": [
        {
            "text": "  "
        },
        {
            "text": "Recently we’ve noticed a rise in the number of complaints we receive from parents."
        },
        {
            "text": "While parents should be able to complain to Ofsted if they’ve gone through their school’s internal process and not found a resolution, we know there’s a perception that this increase in complaints is prompting more snap inspections."
        },
        {
            "text": "This year we received 14,900 complaints about schools, almost a 25 per cent increase on the previous year. Prior to the pandemic, we received around 10,300 complaints in 2019/20 and around 12,200 in 2018/19."
        },
        {
            "text": "We take every complaint seriously and take action where required. However, I’d like to reassure everyone working in the sector that the need for immediate action is rare and has not increased alongside the number of complaints."
        },
        {
            "text": "We always advise parents to go through their child’s school internal complaint process before making a complaint to Ofsted as we know the majority of problems can be solved this way. When a parent comes to us directly, we encourage them to approach the school first."
        },
        {
            "text": "Two-thirds of complaints we receive are around safeguarding concerns, and around one-third of these complaints will contain an aspect of bullying. We carefully consider all of these concerns and decide if they need to be referred to another agency, whether that’s the local authority or the police."
        },
        {
            "text": "A qualifying complaint for Ofsted would be something that raises an issue that affects the whole school. As the inspectorate, we do not have the power to investigate an individual complaint such as the provision of a child’s education, health and care plan or to reverse a school decision such as the exclusion of a child."
        },
        {
            "text": "We never rush to inspect"
        },
        {
            "text": "The remaining qualifying complaints are usually concerned with the leadership and management of a school, pupils’ well-being or both. In these situations, we have a process whereby we examine the complaint carefully to see whether it merits any action. If we think the complaint does merit action, then we can decide to bring forward an inspection of the school or retain the information for the school’s next inspection."
        },
        {
            "text": "This year, we have retained the information from around 1,530 complaints for the next scheduled school inspection so that the issues can be taken into account there."
        },
        {
            "text": "There are of course times when we decide that a complaint is serious enough to necessitate an immediate inspection. This could be if we have concerns that the safety of the pupils or staff is at risk, or if there’s evidence to suggest a significant decline in standards or a breakdown in leadership."
        },
        {
            "text": "However, just because we decide to inspect immediately or retain information about a complaint for the next inspection does not necessarily mean that there is a problem at the school. Inspectors approach things with an open mind."
        },
        {
            "text": "This year, we made a decision to carry out 76 immediate inspections following complaints made to us, less than 1 per cent of all complaints closed in the year. This compares with 72 immediate inspections in 2019/20 and 71 in 2018/19. So, despite the rise in complaints, this has not led to a rise in snap inspections."
        },
        {
            "text": "It’s really important that parents are able to contact us and raise concerns if they believe they have exhausted the school’s own systems."
        },
        {
            "text": "But we want to be clear that we never rush to inspect without carefully considering whether this is the right and proportionate thing to do, in the interests of pupils."
        }
    ]
}