{
    "url": "https://gds.blog.gov.uk/2023/08/30/the-new-in-person-identity-check-for-gov-uk-one-login/",
    "title": "The new in-person identity check for GOV.UK One Login",
    "authors": [
        "Rachel Tsang, Deputy Director for GOV.UK One Login",
        "John Holben, Deputy Director for GOV.UK One Login"
    ],
    "categories": [
        "GOV.UK One Login"
    ],
    "pub_date": "2023-08-30T09:00:53+01:00",
    "content": [
        {
            "text": "Core to GDS's mission for GOV.UK One Login is our commitment to make sure as many people as possible can easily prove their identity to access government services. "
        },
        {
            "text": "We are therefore excited to announce that we are now working with the Post Office to run an in-person identity check in their branches, for people who need additional support to use GOV.UK One Login."
        },
        {
            "text": "The in-person service has been created to assist people who want to use GOV.UK One Login, but are unable to use the app or browser journey for identity verification. We’ve designed this route specifically for users without smartphones, or those who have a low level of confidence in using a digital platform to input their document details. Offering an in-person service allows for a wider range of people to access vital public services online. Once having proved their identity people will, in the future, be able to reuse this to access services across government."
        },
        {
            "text": "The service is currently in private beta which means that together with the Post Office we are testing the route and making improvements. Once these changes have been made and tested, the service will be fully available to the public. "
        },
        {
            "heading": 2,
            "text": "How this will work"
        },
        {
            "text": "A user accessing the in-person service to help them prove their identity will go through the following steps:"
        },
        {
            "text": "We’re aware this process does begin and end online, which may not work for everyone. However, for those who lack confidence or don’t have a smartphone, this in-person option may offer all the help they need to prove their identity with GOV.UK One Login. "
        },
        {
            "text": "The in-person identity checking also allows people to make use of a wider range of identity documents, beyond driving licences, passports and biometric residence permits. This grows the number of people who can prove their identity using GOV.UK One Login. "
        },
        {
            "heading": 2,
            "text": "The GDS and Post Office partnership"
        },
        {
            "text": "There are many benefits to partnering with the Post Office on this service. The Post Office is a well known institution and many people in the UK use their services regularly. They have a selection of branches offering in-person verification already in place for other government and non-government services. Most people in the UK are within 10 miles of a branch that is offering this new in-person identity check for GOV.UK One Login."
        },
        {
            "text": "Postmasters are trusted and often well-known figures in their local community. They can support those individuals who are unable to use the app or browser journey for verification through the in-person service."
        },
        {
            "text": "Once initiated online using the above steps, during the visit to the Post Office staff will be happy to help with the identity verification process. "
        },
        {
            "heading": 2,
            "text": "What's coming next"
        },
        {
            "text": "We are continuing to build out our offering so as many people as possible can access our government services using GOV.UK One Login. Which is why we are currently procuring a service where people can get support over the phone or by email when using the GOV.UK One Login service. "
        }
    ]
}