{
    "url": "https://environmentagency.blog.gov.uk/2025/08/27/come-and-meet-us-at-the-environmental-services-and-solutions-expo/",
    "title": "Come and meet us at the Environmental Services and Solutions Expo",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2025-08-27T09:38:40+00:00",
    "content": [
        {
            "text": "Next month we are taking part in the Environmental Services and Solutions Expo at Birmingham NEC on 17-18 September."
        },
        {
            "text": "You will be able to meet us on our exhibition stand in Hall 19 (Recycling Services Section) stand RS-E144 where our staff will be available to answer your questions and discuss the Environment Agency’s extensive range of responsibilities to protect and enhance the environment for people and wildlife."
        },
        {
            "text": "Pay us a visit and we will be pleased to meet you."
        },
        {
            "text": "Environment Agency speakers"
        },
        {
            "text": "You can also attend our speaker sessions. Throughout the two-day event, our teams will be presenting in the Expo theatres covering everything from future monitoring of the water industry to reform of waste regulations and our flood and coastal risk management work."
        },
        {
            "text": "Day One"
        },
        {
            "text": "Our Deputy Director for Climate Change, Liz Parkes, will present a keynote on Net Zero Transition Planning in the EFD Theatre. Liz will also be a speaker in the panel session Decarbonising at Scale: Systems-Level Solutions for Net Zero in the Net Zero Summit Theatre."
        },
        {
            "text": "Our Deputy Director for Water Regulation, Judy Proctor, will present a keynote in the WWEM Theatre on how innovation is reshaping monitoring across the water industry: The Future of Monitoring in the Water Industry."
        },
        {
            "text": "Other sessions you can join include a session on the reform of the Waste Carriers, Brokers and Dealers regime to the new Carriers and Transporters Permitting Regime, where you will learn about your roles and responsibilities and compliance requirements, and an insight into our Environment and Science Graduate Training Scheme at the Future Talent Hub. "
        },
        {
            "text": "Day Two"
        },
        {
            "text": "Our staff will be speaking about more waste topics, including a session on Waste Electrical and Electronic Equipment (WEEE): WEEE Producer Outreach and Compliance where attendees will gain insights into how producers can better understand their obligations and Digital Waste Tracking."
        },
        {
            "text": "You can also hear from our Flood and Coastal Risk Management colleagues and learn about our Net Zero Carbon for Infrastructure Programme."
        },
        {
            "text": "Drop In Sessions"
        },
        {
            "text": "There will be further opportunities throughout the entire event to meet our staff, get advice and learn even more about the broad range of responsibilities we have at the Environment Agency. Meet us at a range of drop-in sessions throughout two days on our exhibition stand:"
        },
        {
            "text": "You can find out more about the ESS Expo on the event website."
        },
        {
            "text": "We look forward to seeing you in September!"
        }
    ]
}