{
    "url": "https://hmlandregistry.blog.gov.uk/2025/08/27/easement-entries-in-the-register-of-title-promoting-consistency/",
    "title": "Easement entries in the register of title: promoting consistency",
    "authors": [
        "David Linn, Head of Practice"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2025-08-27T13:04:05+01:00",
    "content": [
        {
            "text": "In early September, we are changing the way we describe easements in title registers."
        },
        {
            "heading": 2,
            "text": "What is changing?"
        },
        {
            "text": "From 8 September 2025, HM Land Registry is improving the description of easements in title registers to ensure greater consistency, clarity and accuracy for all users."
        },
        {
            "text": "Key points"
        },
        {
            "heading": 2,
            "text": "Why are we making this change?"
        },
        {
            "text": "Land registration language can sometimes appear inconsistent, with different wording describing the same legal concepts. For easement entries, some registers currently state \"the land has the benefit of any legal easements\" while others read \"the title includes any legal easements\". This variation can create confusion for legal professionals and members of the public who rely on registers for clear, accurate information about property rights."
        },
        {
            "heading": 2,
            "text": "What exactly is changing?"
        },
        {
            "text": "New terminology from 8 September 2025Before: \"The land has the benefit of any legal easements...\" After: \"The title includes any legal easements...\" "
        },
        {
            "text": "This change provides a clearer reflection of how easements affect specific titles and prevents potential misinterpretation. "
        },
        {
            "heading": 2,
            "text": "Enhanced qualification notes"
        },
        {
            "text": "We are also standardising how we qualify easement entries with explanatory notes, making both the structure and reasoning more transparent. For example: "
        },
        {
            "text": "Previous note: \"The rights granted by clause 4.2 of the Transfer are included in the registration only so far as they are granted over title number NE1862.\" New note: \"The easements granted by clause 4.2 of the Transfer are included in the title only so far as they are granted over title number NE1862 and are capable of subsisting at law at the date of the grant.\""
        },
        {
            "heading": 2,
            "text": "What is not changing"
        },
        {
            "heading": 2,
            "text": "Benefits for register users"
        },
        {
            "text": "This standardisation ensures our title registers remain:"
        },
        {
            "heading": 2,
            "text": "Supporting guidance and training"
        },
        {
            "text": "We're publishing new internal guidance for HM Land Registry caseworkers to ensure consistent application of these standards, maintaining the reliability and accuracy of the register. "
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "This update follows our previous successful change to language around personal covenants (detailed in our blog post: We are simplifying the registration of personal covenants). That change was widely welcomed by customers as a significant improvement to title register consistency. We will continue identifying opportunities to enhance how we record and describe entries on title registers. "
        },
        {
            "heading": 2,
            "text": "More information about easements"
        },
        {
            "text": "For comprehensive information and guidance, visit:"
        },
        {
            "text": "We welcome your feedback on this change and other improvements to title register clarity. Contact us at customercommunicationsteam@landregistry.gov.uk to share your thoughts."
        }
    ]
}