{
    "url": "https://mhclgdigital.blog.gov.uk/2025/08/27/how-user-research-is-shaping-the-future-of-epcs/",
    "title": "How user research is shaping the future of EPCs",
    "authors": [
        "Vinus Payman, User Researcher"
    ],
    "categories": [
        "Energy Performance of Buildings"
    ],
    "pub_date": "2025-08-27T09:53:06+01:00",
    "content": [
        {
            "text": "Energy performance certificates (EPCs) help people understand how energy efficient their buildings are and what they can do to improve it. They’re used by landlords to meet legal requirements, by renters and buyers to compare properties, and by homeowners to spot energy-saving opportunities. Policy teams also use EPCs to support government efforts to reach net zero targets and reduce fuel poverty. "
        },
        {
            "text": "Concerns about how clear, accurate and policy-aligned EPCs have led to a government consultation in December 2024, exploring potential reforms, such as introducing multiple metrics to better reflect energy performance.  "
        },
        {
            "text": "To support this, the user-centred design (UCD) team within MHCLG’s Energy Performance of Buildings Register has been tasked with redesigning the EPC to better meet policy goals and improve the user experience. "
        },
        {
            "text": "In this blog post, we share how we’re using user research to shape future improvements to EPCs, ensuring reforms reflect real-world needs and support government policy objectives."
        },
        {
            "heading": 2,
            "text": "Our goal "
        },
        {
            "text": "As EPCs influence both personal decisions and national policy, we set out to design a certificate that’s clear, intuitive and supports meaningful action, while also meeting policy objectives. "
        },
        {
            "text": "To do this, we ran in-depth user research with landlords, homeowners, renters, buyers and policy professionals. We used a mix of research methods to explore their needs, decision-making priorities, and how best to communicate the proposed EPC metrics. "
        },
        {
            "text": "We also looked at how the redesign could encourage investment in energy efficiency upgrades. This helps ensure the reform supports action at both individual and policy levels. "
        },
        {
            "heading": 2,
            "text": "What we did "
        },
        {
            "heading": 3,
            "text": "Exploring policy perspectives "
        },
        {
            "text": "We’ve worked closely with our policy team throughout this project and they’ve been open to adopting a UCD approach. This collaboration helped us explore how EPCs are currently used across government and where design could make the most difference. "
        },
        {
            "text": "To understand this in more detail, we started by mapping how government policies and schemes currently use EPCs as decision-making tools and policy levers. This gave us a clearer view of the wider policy landscape and highlighted opportunities to better align the certificate with strategic goals.  "
        },
        {
            "text": "We then interviewed key policy professionals across government. We explored how the proposed reforms might affect their work, how a redesigned EPC could support better policy outcomes, and how it could adapt to shifts in their policy areas. These conversations offered valuable insight into how design can support both the operational and strategic needs of policy teams, helping ensure the EPC remains relevant and adaptable as government priorities evolve. "
        },
        {
            "text": "To build on existing knowledge, we reviewed industry reports with recommendations for EPC design. We combined these with insights from our policy interviews to shape the focus of our citizen research, which explored how EPCs influence property searches and decisions to improve energy efficiency.  "
        },
        {
            "heading": 3,
            "text": "Understanding citizen experiences "
        },
        {
            "text": "We prioritised inclusivity in recruitment for our user research, engaging a diverse mix of participants across UK regions, genders, ages, ethnicities, income levels and disability statuses. This helped us capture a broad range of experiences and perspectives, ensuring the redesign reflects the needs of all users.  "
        },
        {
            "text": "We interviewed landlords, renters, buyers and homeowners (our citizen stakeholders) to understand how they make decisions about home energy efficiency and what they want from a redesigned EPC. These interviews took place both virtually and in person, helping us uncover real-world insights into citizen needs, hidden pain points, practical barriers and emotional drivers. These are often harder to surface through traditional consultation methods. "
        },
        {
            "text": "To build on these insights and test emerging themes at scale, we developed a survey exploring people’s needs, motivations and barriers around energy efficiency, both when searching for a home and considering improvements. We then carried out segmentation analysis to identify distinct groups within each stakeholder type. This confirmed that the patterns observed in interviews were not isolated cases but reflected broader population trends.  "
        },
        {
            "text": "The segmentation built a deeper understanding of our users, including their behaviours, experiences and attitudes, allowing us to design with clarity and empathy. "
        },
        {
            "text": "To bring these insights into practice, we hosted virtual co-design workshops with each citizen stakeholder group. Together, we explored what an ideal interaction with an EPC could look like from their perspective. These sessions surfaced ideas grounded in lived experience and led to a set of service propositions. We’ve shared these with the wider team to inform ongoing design and policy discussions. This helps ensure the redesign reflects user needs and supports related policies. "
        },
        {
            "heading": 2,
            "text": "What we learnt "
        },
        {
            "text": "Our research has surfaced insights that continue to support the EPC reform and the wider policy community we engaged early on. By bringing together citizen and policy perspectives, we’ve built a clearer understanding of how EPCs are interpreted and used, particularly when searching for a home or planning improvements, and where design could better support decision-making. "
        },
        {
            "text": "We learned that citizen engagement with energy efficiency is shaped not just by cost and convenience, but also by trust, understanding and long-term value. Many users called for greater transparency, clearer guidance and practical support to act on EPC recommendations. "
        },
        {
            "text": "The certificate itself was sometimes described as overwhelming or difficult to interpret at a glance. Many users said they had rarely consulted it during property searches, choosing only to look at the energy rating displayed on property portals. The EPC was often forgotten after purchase, with some users unaware that a dedicated service to look up their EPC exists. Some users felt that the EPC’s recommendations to improve home energy efficiency, though useful in theory, do not always align with the most practical or affordable steps people can take right away. "
        },
        {
            "text": "Segmentation analysis from our surveys highlighted distinct user groups with different needs, behaviours and motivations. These segments will inform the initial redesign of the EPC and guide future research.  "
        },
        {
            "text": "The service propositions obtained from the co-design workshops reflect the diversity of our user base, supporting the development of an EPC that works for more people. Together, these insights may also help policy teams tailor interventions, communications and support, moving beyond a one-size-fits-all approach. "
        },
        {
            "heading": 2,
            "text": "What’s next "
        },
        {
            "text": "We’re now working on the first concept for a redesigned EPC. As we move into this phase, we’ll continue working closely with policy stakeholders and citizens to test ideas and gather feedback. This next round of user research will help us refine the design and make sure it works for the people who use it and for the policies it supports. "
        },
        {
            "text": "Read more articles from the Energy Performance of Buildings Register team on the MHCLG Digital blog. "
        }
    ]
}