{
    "url": "https://kingsawards.blog.gov.uk/2025/08/27/london-early-years-foundation-leyf-celebrate-their-kings-award-for-enterprise-in-sustainability/",
    "title": "London Early Years Foundation (LEYF) celebrate their King's Award for Enterprise in Sustainability",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-08-27T14:33:04+01:00",
    "content": [
        {
            "text": "Credit: Nick Corlett, Sustainability Manager at London Early Years Foundation (LEYF)"
        },
        {
            "heading": 2,
            "text": "How did you hear about The King’s Awards for Enterprise?"
        },
        {
            "text": "We’ve long admired the prestige and purpose of the King’s Award for Enterprise in Sustainable Development. As a social enterprise deeply rooted in creating positive impact, we were inspired by the values the Awards champion, especially around sustainability and enterprise with purpose. The Awards have increasingly become a beacon for organisations like ours, who want to use their platform to lead change."
        },
        {
            "heading": 2,
            "text": "Why did you apply for the Awards?"
        },
        {
            "text": "We applied because we wanted to shine a light on the often overlooked but vital role that Early Years Education and Care (EYEC) plays in building a more sustainable future. Through this award, we hoped to amplify the message that sustainability in EYEC is not an afterthought, it’s a necessity. It’s central to how we support children, families, and our communities every single day. In fact, our whole-system approach is driven by the London Institute of Early Years, LEYF’s dedicated research and training hub, and its: Action for Sustainability in Education, Community of Practice which is a vibrant network focused on embedding the three pillars of sustainability – economic, social, and environmental sustainability into daily practice."
        },
        {
            "text": "We also wanted to celebrate the collective effort of our staff, children, families and partners who have helped embed sustainability into our DNA – from ethical procurement and waste reduction to carbon footprint monitoring and embedding the UN’s Sustainable Development Goals (SDG) into daily nursery life."
        },
        {
            "heading": 2,
            "text": "How did you find the application process?"
        },
        {
            "text": "The process was rigorous but deeply reflective. It gave us the opportunity to pull together all the strands of our sustainability work from our ISO14001 and Planet Mark achievements, to partnerships with organisations like City Harvest, Fashion Enter, Green Bottoms, and Bikeworks. The application was a chance to step back, gather evidence, and celebrate how far we’ve come. It reminded us that sustainability is a journey and one worth shouting about."
        },
        {
            "heading": 2,
            "text": "How does it feel to receive the award?"
        },
        {
            "text": "This award is a huge boost for everyone at LEYF. It acknowledges the hard work and dedication of our team and validates our mission to lead sustainability in the Early Years sector."
        },
        {
            "text": "Sustainability in Early Years isn’t about slogans or scare tactics, it’s about daily decisions, mindset change, and social justice. As our Sustainability Manager, Nick Corlett, put it so perfectly, “We wanted to win this award to shine a light on the role EYEC can play in building a more sustainable future.”"
        },
        {
            "heading": 2,
            "text": "How do you plan to celebrate?"
        },
        {
            "text": "We’ll definitely celebrate with the children, staff and everyone that has a shared interest in this achievement!. And yes, there might even be cake and fizz involved!"
        },
        {
            "heading": 2,
            "text": "How do you plan to use the award / tell others about your success?"
        },
        {
            "text": "The King’s Award gives us an incredible platform to share what’s possible when sustainability is part of your culture and not an add-on. This will include:"
        },
        {
            "heading": 2,
            "text": "What top tips do you have for others applying?"
        },
        {
            "text": "Credit: Nick Corlett, Sustainability Manager at London Early Years Foundation (LEYF)"
        },
        {
            "text": "Find out more about @leyfonline on their website: LEYF Nurseries - London Early Years Foundation"
        }
    ]
}