{
    "url": "https://marinedevelopments.blog.gov.uk/2025/08/27/spotlight-on-mpa-marine-habitats-from-subtidal-sand-to-deep-sea-bed/",
    "title": "Spotlight on MPA marine habitats: From Subtidal Sand to Deep-Sea Bed",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "marine conservation",
        "Uncategorized"
    ],
    "pub_date": "2025-08-27T16:01:54+01:00",
    "content": [
        {
            "text": "We’re diving into some of the less well known but ecologically vital marine habitats found in England’s offshore Marine Protected Areas (MPAs). This  includes subtidal sand, mud, sediment, and deep-sea bed. "
        },
        {
            "text": "While these habitats may not have the visual appeal of tropical reefs, they play a critical role in supporting biodiversity and healthy fish stocks in our waters. That’s why we're proposing new management measures to protect these habitats within our offshore MPAs. "
        },
        {
            "text": "In response to your feedback"
        },
        {
            "text": "During recent engagement activities to support our Stage 3 MPAs consultation, we’ve heard from and listened to stakeholders who’ve asked: “Why are we protecting sand?” It’s a fair question and the answer lies in the hidden importance of these habitats. "
        },
        {
            "text": "Subtidal sand and other sediment types are home to a wide range of species, from burrowing worms and molluscs to juvenile fish and crustaceans. These habitats act as nurseries and feeding grounds, forming the foundation of the wider marine ecosystem. "
        },
        {
            "text": "Protecting these habitats helps maintain the ecological balance that supports commercial fish species, meaning the health of these habitats can lead to healthier fish stocks over time. "
        },
        {
            "text": "MPA designations and features "
        },
        {
            "text": "In England, our seas host a rich variety of marine habitats. MPAs are areas of the ocean that have been set aside and designated to protect these habitats and the species that depend on them. Within MPAs, features like sandbanks, deep-sea beds, and rocky reefs are known as ‘designated features’ and many are sensitive to damage from certain types of fishing activity. "
        },
        {
            "text": "That’s why we're proposing new evidence based management measures to ensure these habitats remain healthy, resilient, and functioning for the long term benefit of the marine environment and our coastal communities. "
        },
        {
            "text": "Sediment habitats Subtidal sand is usually found on open coasts, but while they might appear barren, they contain an abundance of marine life, including flat fish and sand eels which lie camouflaged on the surface, as well as polychaete worms and bivalves which burrow and live within the sediment.  "
        },
        {
            "text": "Subtidal mixed sediments include a range of sediments like sand, mud, cobbles and pebbles, gravely or muddy sands. As the sediment is so varied, they can be home to many different species, living on the surface or within the sediment such as worms, urchins, starfish, anemones and bivalves.  "
        },
        {
            "text": "Subtidal mud is found in sheltered areas, deep enough that they are not affected by the tides. They are abundant in sea urchins and sea cucumbers with sea pens and burrowing anemones also found here. "
        },
        {
            "text": "By providing habitats for many different marine species, these sediments encourage diversity in the wider ecosystem."
        },
        {
            "text": "Deep-sea bed: "
        },
        {
            "text": "The deep- sea generally occurs at depths over 200 metres, extending out from the edge of the continental shelf. It is home to many different sea-bed types, including sand, mud, bedrock and boulders. There are also some features that are unique to the deep-sea, like cold-water coral reefs and bioherms. Bioherms are rock structures made up of the remains of marine organisms set inside mineral rock. Corals and bioherms provide complex 3D structures which act as refuges for species like brittle stars and provide a hard surface where non-mobile species like sponges can attach and colonise. "
        },
        {
            "text": "The importance of protecting these habitats "
        },
        {
            "text": "When we protect a diverse range of habitats we provide homes for a wide array of marine life, including habitats for prey species and feeding and nursery grounds, encouraging a resilient and biodiverse marine ecosystem. Healthy and diverse ecosystems are more resilient and able to adapt to negative impacts like climate change. Protected marine ecosystems can better withstand human and environmental pressures, helping their long-term survival and ensuring that we can enjoy our diverse marine life into the future. "
        },
        {
            "text": "Share your views and additional evidence"
        },
        {
            "text": "We are now undertaking formal consultation on our proposed management measures to protect these habitats. As part of this, we've produced a range of documents, including assessments of each MPA site including in this stage, for you to review and comment on. You can also provide feedback and supply any additional evidence for us to consider as we take this project forward. "
        },
        {
            "text": "Find out more about MPAs."
        },
        {
            "text": "Have your say and take part in our Stage 3 MPA consultation. "
        }
    ]
}