{
    "url": "https://defrafmp.blog.gov.uk/2025/08/27/women-in-fisheries-fmps-and-the-power-of-inclusive-voices/",
    "title": "Women in Fisheries, FMPs and the power of inclusive voices",
    "authors": [
        "Stephanie Lucas - Network Coordinator, Women in Fisheries",
        "Helen Hunter - Senior Policy Advisor, Defra"
    ],
    "categories": [
        "- Defra led FMPs"
    ],
    "pub_date": "2025-08-27T15:04:48+01:00",
    "content": [
        {
            "text": "This post is a collaboration between Defra and Women in Fisheries (WIF), a network that connects women working across every part of the UK fishing industry."
        },
        {
            "text": "Women are at the heart of UK fisheries- from regional management to everyday decisions, their insights and awareness, especially within fishing families, are deeply woven into the social and environmental fabric of the industry."
        },
        {
            "text": "Their knowledge and perspectives can play a valuable role in shaping the future of fisheries and coastal communities, but they can feel that their contributions are not relevant enough to confidently get involved in discussions about fisheries management."
        },
        {
            "text": "This is something we want to explore and help change. How do we involve diverse stakeholders to help build more inclusive, resilient, and sustainable coastal futures?"
        },
        {
            "text": "In this post, Stephanie Lucas, Network Coordinator from WIF sits down with Helen Hunter, a Senior Policy Advisor at Defra, who works in the non-quota species (NQS) shellfish team to talk about her role in fisheries management and fisheries management plans (FMPs)."
        },
        {
            "text": "We aim to break down some of the common myths around FMPs, answer some key questions surrounding women getting involved, and hope to start removing some of the barriers that they experience."
        },
        {
            "heading": 3,
            "text": "Stephanie Lucas: Let’s start with a big question- why should fishers care about FMPs?"
        },
        {
            "heading": 3,
            "text": "SL: One common concern is that FMPs are just more red tape. How would you respond to fishers who see them as a burden rather than a benefit?"
        },
        {
            "heading": 3,
            "text": "SL: Across the industry, we’ve seen how women feel their voices won’t be heard in meetings. Can you share how inclusive the FMP process really is?"
        },
        {
            "heading": 3,
            "text": "SL: Are FMPs mainly designed with large commercial vessels in mind?"
        },
        {
            "heading": 3,
            "text": "SL: What real changes can women working in fisheries expect to see as a result of these plans?"
        },
        {
            "heading": 3,
            "text": "SL: How does Defra ensure that science and local knowledge—including women’s knowledge—is balanced in FMP development?"
        },
        {
            "heading": 3,
            "text": "SL: What’s the best way for women in fisheries to get involved with, or give feedback on FMPs right now?"
        },
        {
            "heading": 3,
            "text": "SL: What do I need to do if I'm on an FMP group?"
        },
        {
            "text": "Throughout this conversation, Women In Fisheries have been putting the questions to Defra, but to finish we’re flipping the script. Helen has a question of her own."
        },
        {
            "heading": 3,
            "text": "HH: You’ve asked us some great questions, but I’d love to know - what’s the best way Defra and others working on FMPs can stay connected with Women in Fisheries and support the work you’re doing to amplify women’s voices?"
        }
    ]
}