{
    "url": "https://space.blog.gov.uk/2025/06/02/2-million-funding-available-for-satellite-enabled-business-solutions/",
    "title": "£2 million funding available for satellite-enabled business solutions",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment",
        "Funding"
    ],
    "pub_date": "2025-06-02T14:20:07+01:00",
    "content": [
        {
            "text": "The UK Space Agency’s Unlocking Space for Business programme aims to help UK businesses harness the power of satellite data and services to drive innovation, improve operations, and deliver environmental and customer benefits."
        },
        {
            "text": "Launched in October 2023, the UK Space Agency's Unlocking Space for Business programme supports the government’s ambition to accelerate investment in science and technology by enabling commercial sectors to adopt space-based solutions."
        },
        {
            "text": "Focusing on the Financial Services and Transport & Logistics sectors, the programme connects end-user businesses with space industry suppliers to explore and implement satellite-enabled solutions."
        },
        {
            "text": "Through a combination of funding, workshops and expert support, it helps businesses de-risk innovation and unlock new commercial opportunities. "
        },
        {
            "heading": 2,
            "text": "Success stories"
        },
        {
            "text": "These projects demonstrate how satellite-derived solutions can deliver tangible benefits across diverse industries, from enhancing operational and financial efficiency, to improving customer retention and addressing environmental sustainability."
        },
        {
            "heading": 2,
            "text": "New funding round"
        },
        {
            "text": "Building on the success of its pilot phase, the UK Space Agency has launched Call 2 of the Unlocking Space for Business programme.  "
        },
        {
            "text": "This new funding round offers up to £400,000 grant funding per project, with a total of £2 million available, to support pilot projects that commercialise space solutions in the Financial Services or Transport & Logistics sectors. "
        },
        {
            "text": "Applications for the new funding call must be submitted by 7 July 2025. Selected projects will run for up to seven months, beginning in September 2025. To be eligible, proposals must be led by a UK-based end-user business in either the Financial Services or Transport & Logistics sectors, which must form a consortium with a UK space sector supplier. "
        },
        {
            "text": "This is a unique opportunity for businesses to explore how space solutions can transform their operations and gain a competitive edge. Whether you're looking to enhance data analytics, improve logistics, or develop new services, the UK Space Agency is ready to support your journey. "
        },
        {
            "text": "To learn more and apply, visit the official grant page."
        },
        {
            "text": "Learn more about previously funded Unlocking Space for Business grant projects."
        }
    ]
}