{
    "url": "https://prisonjobs.blog.gov.uk/2025/06/02/from-the-frontline-to-probation-how-my-army-training-shaped-my-career-in-the-probation-service/",
    "title": "From the Frontline to Probation: How My Army Training Shaped My Career in the Probation Service ",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "Probation",
        "Uncategorized"
    ],
    "pub_date": "2025-06-02T15:34:19+01:00",
    "content": [
        {
            "text": "We spoke to Jon, a probation officer, operations lead for veterans in Hull and East Riding, and longstanding reservist military policeman. Jon started working in the Probation Service 23 years ago as a probation services officer and recently completed the trainee probation officer programme in February this year, graduating with a professional qualification in probation (PQiP).  "
        },
        {
            "text": "Can you tell us a little more about why you joined and about your time in the Probation Service? "
        },
        {
            "text": "I knew I wanted to find a role which matched the fulfilment I want to get out of life. In April 2001, I started as a probation services officer (PSO) at Humberside Probation Service. I began in a spilt role in offender management and as a court officer. I started on the 15-month route for the trainee probation officer programme in November 2021 and qualified last February. Being a 50-something-year-old going through university was initially quite daunting but now I say to people if I did it there’s nothing to stop anybody who’s got something about them being able to do it too.  "
        },
        {
            "text": "Why did you decide to do the trainee probation officer programme and why didn’t you do it sooner? "
        },
        {
            "text": "I only had GCSEs and a couple of A-levels and thought university wasn’t for me. But with the support from probation colleagues around me, I realised I could. Probation is great at nurturing and developing people’s potential. Now that I’m qualified, they’re already pushing me towards management. "
        },
        {
            "text": "It was intimidating at first, especially with younger staff coming straight out of university. But I’ve used my life experience to help offenders set and achieve goals. I worried about the academic side, but my grades were better than I expected. Balancing work, studies, reserves, and family was tough, but the Probation Service made it manageable, and I had support from my university lecturers whenever I needed it. "
        },
        {
            "text": "How did you balance work and study time? "
        },
        {
            "text": "It was quite straightforward since the learning was all online. I had one study day a week and could fit the rest around my schedule. The ability to download lectures and make notes in my own time really suited me. "
        },
        {
            "text": "How was your graduation? "
        },
        {
            "text": "It was brilliant- I went with my wife and parents, and we had a great time. I was probably the oldest one graduating that day, but it felt like the perfect way to close this chapter. Overall, it was a challenging but incredibly rewarding experience. "
        },
        {
            "text": "After 23 years in the Probation Service, I wouldn’t change a thing. It took time to find a career that made me feel happy and settled, but now that I have, I can’t believe how quickly the time has flown. "
        },
        {
            "text": "You’re also a reservist military policeman. What would you say to someone in the army who’s thinking about joining the Probation Service? "
        },
        {
            "text": "It’s a hard job but it gives a sense of belonging to an organisation that I think people who come from the military will respond well to. In the Probation Service, you’re part of a closeknit team with the common goal to support and help others. My military colleagues have got the skills the Service needs, such as leadership, self-management, wanting to help and develop others. "
        },
        {
            "text": "What are the other transferrable skills between the army and the Probation Service? "
        },
        {
            "text": "Emotional intelligence. Going through the military there’s stresses people will experience like separation from families, being on deployments, and being in active environments. I think people who can cope and navigate those stressful environments and help others navigate them too, will be able to use these transferrable skills in the Probation Service. Military personnel are also used to working with people with challenging and complex needs. Senior ranks in the army act as role models and these are skills that we can pass on to offenders. It’s called prosocial modelling and I try and show offenders positive behaviours like being responsible and be more integrated within society. "
        },
        {
            "text": "Can you tell us more about your additional role within the Probation Service working with veterans? "
        },
        {
            "text": "As an operations lead for veterans in Hull and East Riding, I work with a lot of veteran services within the area, developing support options available and I’ve recently taken up a role looking at recruit training for the army reserves. What I love about probation is the phenomenal support they’ve given me to engage with the army reserve. While I've worked in probation, I've been able to fulfil my responsibilities as a reservist military policeman. I’ve been deployed to Iraq, Afghanistan, Cyprus, and Bosnia. I get additional leave every year as well to meet my commitments with the army reserve and my probation colleagues have always kept in touch with me while I’ve been away, so it feels like I haven’t left when I get back! "
        },
        {
            "text": "What do you think about the Advance into Justice Scheme? "
        },
        {
            "text": "As a member of the armed forces, I can attest to a career in the justice system being an enjoyable and rewarding second career to consider on leaving the armed forces. Many of the skills force's personnel develop in their military careers are fully transferable into justice roles, and you will be offered the opportunities to further develop these skills. Through the Advance into Justice scheme, applications from veterans or those just about to leave the armed forces are actively encouraged, with either a guaranteed interview for those who are veterans, or the possibility of securing a job before leaving the military. I fully support this scheme and would strongly encourage anyone who is still serving or who has served in the armed forces to consider a position in the Probation Service or other justice organisations. "
        }
    ]
}