{
    "url": "https://mhclgmedia.blog.gov.uk/2025/06/02/inaccurate-reporting-of-the-planning-and-infrastructure-bill/",
    "title": "Inaccurate reporting of the Planning and Infrastructure Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Communities",
        "Planning"
    ],
    "pub_date": "2025-06-02T18:09:28+01:00",
    "content": [
        {
            "text": "Over the weekend it was reported that the Planning and Infrastructure Bill will remove our existing environmental protections and put irreplaceable ancient woods and trees at risk."
        },
        {
            "text": "This is not true."
        },
        {
            "text": "The Planning and Infrastructure Bill will maintain the existing legal and policy protections, while delivering a more strategic approach to improve the environment – and ultimately deliver more for nature not less."
        },
        {
            "text": "Current rules in the National Planning Policy Framework (NPPF) are clear that development resulting in the loss or deterioration or irreplaceable habitats including ancient woodland and ancient or veteran trees should be refused. This is not being changed through the Planning and Infrastructure Bill."
        },
        {
            "text": "There is a very high bar for exceptions to this rule – with proposals being wholly exceptional and demonstrating that the public benefit would outweigh the loss or deterioration of habitats, under longstanding safeguards. It must also propose a suitable compensation strategy to enhance the environment."
        },
        {
            "text": "The Ancient Woodland Inventory, updated Planning Practice Guidance, and standing advice from Natural England and the Forestry Commission sets out what constitutes impacts to ancient woodlands and veteran trees and allows local decision makers to make informed decisions about planning applications near these habitats. And last year arrangements were set out for consulting the Secretary of State once planning permission has been granted for development affecting ancient woodland."
        },
        {
            "text": "These measures exist to help support the environment, and through the Nature Restoration Fund – introduced in the Bill – will accelerate the building of homes and infrastructure, while unlocking the positive impact development can have in driving the recovery of protected sites and species. "
        },
        {
            "text": "The Planning and Infrastructure Bill creates a new type of plan: an Environmental Delivery Plan (EDP). Environmental Delivery Plans will secure improved environmental outcomes that go further than simply offsetting harm as required under current legislation."
        }
    ]
}