{
    "url": "https://defrafarming.blog.gov.uk/2025/06/02/now-open-farming-innovation-investor-partnership-competition/",
    "title": "Now open: Farming Innovation Investor Partnership competition",
    "authors": [
        "Sarah Kaya"
    ],
    "categories": [
        "Payments for research and innovation",
        "Webinars"
    ],
    "pub_date": "2025-06-02T10:05:32+01:00",
    "content": [
        {
            "text": "I’m pleased to say the Farming Innovation Investor Partnerships competition is now open. "
        },
        {
            "text": "The competition is part of the Farming Innovation Programme, delivered by Defra in partnership with Innovate UK.  "
        },
        {
            "text": "It provides a combination of public grant funding and private investment to help agri-tech businesses scale and commercialise late-stage innovations. "
        },
        {
            "text": "This round has up to £5 million in grant funding available. "
        },
        {
            "heading": 2,
            "text": "About the competition "
        },
        {
            "text": "The Investor Partnerships competition supports agri-tech businesses to bring near-market innovations into use on farms. "
        },
        {
            "text": "Through this competition, grant funding from Defra is matched with private investment from a pool of more than 150 pre-approved investors. These investors have been selected for their track record in supporting innovative, high-growth businesses. "
        },
        {
            "text": "The competition builds on a successful pilot round that supported 5 projects and leveraged more than £10 million in private investment. "
        },
        {
            "text": "The guidance contains details of eligibility, scope, dates, how to apply, and more information on supporting materials. In summary, applicants must be: "
        },
        {
            "heading": 3,
            "text": "Projects must: "
        },
        {
            "heading": 3,
            "text": "Grant funding will cover: "
        },
        {
            "heading": 2,
            "text": "How to apply "
        },
        {
            "text": "Applications must be made through the Innovation Funding Service on GOV.UK. They will be assessed by independent experts from business and academia. "
        },
        {
            "heading": 3,
            "text": "Dates to note"
        },
        {
            "text": "Good luck with your application. "
        }
    ]
}