{
    "url": "https://planninginspectorate.blog.gov.uk/2025/06/02/planning-to-be-an-expert-witness-heres-what-to-do/",
    "title": "Planning to be an expert witness? Here’s what to do. ",
    "authors": [
        "Rebecca Phillips"
    ],
    "categories": [
        "Appeals",
        "Environment"
    ],
    "pub_date": "2025-06-02T14:21:35+01:00",
    "content": [
        {
            "text": "The role of the expert witness, when carried out well, is vital to the smooth and successful running of planning appeals. Rebecca Phillips, the Planning Inspectorate’s Interim Chief Planning Inspector tells us how to be the most effective expert witness for everyone’s benefit."
        },
        {
            "text": "I was delighted to take part in a panel discussion at the recent annual Planning & Environment Bar Association (PEBA) conference to offer my thoughts on the inquisitorial role of Inspectors and the role of professional experts in informing Inspectors’ decisions."
        },
        {
            "text": "It goes without saying that Inspectors make their decisions with impartiality, however, the appeals they consider are often complex and technical and an effective witness can help to untangle that complexity and keep the event moving."
        },
        {
            "text": "A focussed submission on the main areas of dispute is much more compelling and persuasive and gives the Inspector a better understanding of the case to make a decision or recommendation."
        },
        {
            "text": "The Planning Inspectorate and PEBA have worked jointly to put together guidance on being an effective witness (see 3 protocols) and a good practice guide on the importance for all parties to agree a Statement of Common Ground (SoCG)."
        },
        {
            "text": "A SoCG allows opposing parties to set out the areas they agree on to keep the appeal focused on the bits they don’t."
        },
        {
            "text": "So, based on the joint Planning Inspectorate and PEBA guidance here are my top tips on what Inspectors are looking for from experts giving evidence."
        },
        {
            "text": "Find out even more about being an expert witness in our Presenting your evidence webinar"
        }
    ]
}