{
    "url": "https://charitycommission.blog.gov.uk/2025/06/02/volunteers-week-a-message-of-thanks/",
    "title": "Volunteers’ Week – A Message of Thanks",
    "authors": [
        "Mark Simms OBE"
    ],
    "categories": [
        "Trustees",
        "Volunteering"
    ],
    "pub_date": "2025-06-02T11:39:32+01:00",
    "content": [
        {
            "text": "Every day across England and Wales, people give their time, energy and compassion to support others through charities and community organisations."
        },
        {
            "text": "Volunteers deliver food parcels. They count rare species. They drive people to hospital appointments. They support those in distress, serve as trustees, and take on countless other roles that allow charities to reach people and communities who would otherwise be left out."
        },
        {
            "text": "Volunteering is not a side project. It underpins civil society. It represents people at their best — choosing to act not for profit or attention, but because they believe in helping others."
        },
        {
            "text": "The contribution of volunteers is vast and varied. It is also vital."
        },
        {
            "text": "So this Volunteers’ Week, we say it clearly and sincerely: thank you."
        },
        {
            "text": "A personal reflection"
        },
        {
            "text": "When I first became the leader of a small charity, I started writing personal thank you cards to every volunteer who joined us. It was a simple gesture, but one that mattered."
        },
        {
            "text": "Years later, I still believe that saying thank you should be part of how we lead. It is not just about courtesy. It is about recognising that nothing works in this sector without people who care enough to give their time."
        },
        {
            "text": "Across the UK, millions of people volunteer. One in four people say they do so at least once a month. That is not a small act. It is a shared effort that helps keep people safe, connected and hopeful."
        },
        {
            "text": "Volunteering has no boundaries"
        },
        {
            "text": "Volunteering cuts across society. It connects people not through privilege or power, but through shared values and purpose. It is simply a willingness to offer something of yourself to others."
        },
        {
            "text": "I have met people facing serious challenges — illness, homelessness, bereavement, poverty — who still choose to give their time. I have also seen people with wealth, status or significant experience give their time just as freely."
        },
        {
            "text": "That is part of what gives the charity sector its strength. The fact that so many people from different walks of life find meaning and dignity in volunteering should give all of us confidence in the future of civil society."
        },
        {
            "text": "Age is no barrier"
        },
        {
            "text": "From the Scouts and Guides, to school clubs and youth organisations, to faith groups and local campaigns — we see people of all ages making a difference every day. Volunteers bring experience, enthusiasm, commitment and a deep understanding of their community — whether through charity shops, local libraries, or as trustees."
        },
        {
            "text": "And for some of us, volunteering was something we were handed early. My own Friday nights were shaped by my mum, whose idea of family time meant running bingo and buffets for older people in our neighbourhood. It was not optional. But it stayed with me."
        },
        {
            "text": "It taught me that volunteering is not something other people do. It is something we all can do. And many of us already are."
        },
        {
            "text": "Volunteers are behind some of the most essential work in the country."
        },
        {
            "text": "Behind every statistic is a real story of someone doing better because another person stepped forward."
        },
        {
            "text": "Trustees are volunteers"
        },
        {
            "text": "Around 700,000 charity trustees serve in the UK. They are almost all volunteers, but their role comes with legal duties."
        },
        {
            "text": "They set the strategic direction. They oversee resources. They ensure charities are meeting their public benefit and doing so safely and lawfully."
        },
        {
            "text": "Many trustees bring knowledge from finance, law, governance or lived experience. They apply that experience for the benefit of others, without pay and often with little recognition."
        },
        {
            "text": "As Chair of the Commission, I want to say clearly — your work is respected. It is essential to the integrity and strength of this sector."
        },
        {
            "text": "Volunteering can change lives — including your own"
        },
        {
            "text": "Volunteering is not only about giving. It is also about growth."
        },
        {
            "text": "Evidence shows that it boosts wellbeing. More than three quarters of regular volunteers say it improves their mental health and gives them a stronger sense of purpose."
        },
        {
            "text": "It can teach new skills, build confidence, and create lasting relationships. And while these benefits are real, the deepest impact is still in the lives that are changed because someone gave their time."
        },
        {
            "text": "How to get involved"
        },
        {
            "text": "If you are considering volunteering:"
        },
        {
            "text": "Places to find opportunities:"
        },
        {
            "text": "To find volunteering opportunities that match what you enjoy"
        },
        {
            "text": "If you’re interested in finding out more about becoming a trustee visit Become a charity trustee - GOV.UK"
        },
        {
            "text": "You do not need to be a professional. You do not need to have lots of free time. You just need to care enough to act. Even one hour can make a real difference."
        },
        {
            "text": "A final word"
        },
        {
            "text": "As Interim Chair of the Charity Commission, I see the impact of volunteers in large national charities and small community groups alike."
        },
        {
            "text": "The sector relies on people who are prepared to step forward. And that is what makes it strong."
        },
        {
            "text": "So to everyone who volunteers, thank you. Your time, your energy, your care — they are seen, they matter and they make the world a better place."
        }
    ]
}