{
    "url": "https://nationalscreening.blog.gov.uk/2024/09/10/asking-questions-about-screening-inequalities/",
    "title": "Asking questions about screening inequalities",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-09-10T10:08:32+01:00",
    "content": [
        {
            "text": "Last summer, the UK National Screening Committee (UK NSC) sent out a survey on inequalities in screening to about 800 screening stakeholders."
        },
        {
            "text": "We received 204 responses, giving us an insight into what people working in and around screening think are the main causes of inequalities, and what sort of new research might help to tackle them."
        },
        {
            "text": "Most responses (78%) related to the 5 NHS young person and adult (YPA) screening programmes (bowel cancer, breast, cervical, diabetic eye and abdominal aortic aneurysm) while the remaining 22% related to the 6 antenatal and newborn (ANNB) screening programmes. We heard from a range of people including screening staff, clinicians, third sector representatives, public health professionals, commissioners, societies and Royal Colleges, and members of the public."
        },
        {
            "text": "We know inequalities of access and outcomes in health and healthcare are longstanding and important issues. There is plenty of literature relating to inequalities in, and barriers to, screening. However, there is very little published evidence on proven interventions that reduce inequalities or increase uptake in underserved groups. We wanted to see if we could shed some light on the gaps that need filling."
        },
        {
            "heading": 2,
            "text": "Major causes of inequality"
        },
        {
            "text": "We provided a list of 12 pre-defined areas of potential inequalities and asked people to select all those they felt were major causes."
        },
        {
            "text": "For 8 of the 11 programmes ‘deprivation/socio-economic status’ was cited most often as a major cause. This was followed by ‘learning disability’ and ‘ethnicity’ for YPA programmes, and ‘ethnicity’ and ‘cultural or religious beliefs’ for ANNB programmes."
        },
        {
            "text": "Nearly half of respondents thought inequalities equally affected both uptake of screening and uptake of follow-up tests; 40% felt inequalities mostly affected uptake of screening only."
        },
        {
            "heading": 2,
            "text": "Research gaps and questions"
        },
        {
            "text": "We asked people to suggest up to 3 research gaps or questions relating to screening inequalities that they thought the UK NSC should prioritise (priority 1 being the highest priority and priority 3 the lowest)."
        },
        {
            "text": "We received 409 valid responses. Some responses were excluded for reasons such as lack of context (for example a single word answer), mentioning an issue not relating to inequalities, referring to treatment types (outside the remit of screening), or calling for new screening methods or programmes (the survey covered existing programmes only)."
        },
        {
            "text": "We grouped the responses into themes – with 40 research themes identified. Some responses covered more than one theme. In total, the 40 themes were identified 498 times within the valid responses, with 83% of those relating to YPA programmes."
        },
        {
            "text": "Overall, the top 4 themes identified across all programmes and priority areas (1 to 3) for research were:"
        },
        {
            "heading": 2,
            "text": "Priorities"
        },
        {
            "text": "For all programmes, the most identified theme relating to research gaps or questions was ‘promotion and information’. Suggestions for research under this theme included trialling information resources designed to target underserved communities, and evaluating national screening programme promotional campaigns."
        },
        {
            "text": "The next most common theme for YPA programmes was ‘impact of deprivation’. For ANNB programmes, ‘impact of ethnicity’, ‘translations’ and ‘workforce’ were jointly the next most mentioned."
        },
        {
            "text": "Looking at the research themes identified in the ‘priority 1’ (highest priority) category, for the ANNB programmes, the top themes identified were:"
        },
        {
            "text": "For the YPA programmes, the top priority 1 themes identified were:"
        },
        {
            "text": "Priority 2 category themes showed a continued focus on ‘promotion and information’ for YPA programmes, and ‘impact of ethnicity’ for ANNB. Priority 3 (lowest priority) category themes again had ‘promotion and information’ as the most cited for both YPA and ANNB programmes."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We will assess the research suggestions received to identify, summarise and, in due course, share a viable list of priority issues. We will refine this into a set of prioritised research questions for the UK NSC’s Research and Methodology Group (RMG) to discuss. The RMG will then determine what it thinks are the most important areas of focus for future screening inequalities research."
        },
        {
            "text": "The intended outcome of this work is to provide interested researchers with a list of potential areas to explore in formal research. The ultimate aim will be to contribute to an evidence base on reducing screening inequalities so that effective interventions can be incorporated more easily into routine practice."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}