{
    "url": "https://homeofficemedia.blog.gov.uk/2024/09/10/media-factsheet-evisas-2/",
    "title": "Media factsheet: eVisas",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2024-09-10T14:30:50+01:00",
    "content": [
        {
            "text": "Overview"
        },
        {
            "text": "eVisas are a key part of delivering a border and immigration system which is more digital and streamlined. This process is already underway, and millions of people in the UK who applied for their visa through the EU Settlement Scheme, have used their BRP to create a UKVI account, or used the ‘UK Immigration: ID Check’ app to make an immigration application, already have an eVisa (digital proof of their immigration status). These changes bring significant benefits to customers, deliver excellent value, and increase the UK immigration system’s security and efficiency."
        },
        {
            "text": "An eVisa is an online record of a customer’s immigration permission in the UK, and any conditions which apply. It can be viewed by logging into the online ‘View and prove your immigration status’ service using their UK Visas and Immigration (UKVI) account. It is usually linked to a customer’s passport to facilitate straightforward international travel."
        },
        {
            "text": "All BRP holders should visit www.gov.uk/eVisa now to create a UKVI account to access their eVisa. Holders of other physical immigration documents, including passports containing visa vignette stickers or ink stamps (for those who hold indefinite leave to enter or indefinite leave to remain), and BRCs, can also find information here on what they need to do to create a UKVI account to access their eVisa. BRP holders should keep their expired BRPs as it may enable a more streamlined process for future applications to stay in the UK."
        },
        {
            "text": "Using a phased approach to implementing digital services, the intention is that by 2025 most customers will have a secure and seamless digital journey when they interact with the UK’s immigration system."
        },
        {
            "text": "It is free, and straightforward for customers who hold physical documents to create a UKVI account to access their eVisa. Creating a UKVI account will not change, impact or remove customers’ current immigration status or their rights in the UK."
        },
        {
            "text": "Customers who already have an eVisa, including anyone granted status through the EU Settlement Scheme, do not need to do anything other than keep their UKVI account up to date with their latest passport/travel document and contact details at www.gov.uk/update-uk-visas-immigration-account-details. This is also the case if a customer holds both a physical document, such as a BRP, and an eVisa. Customers who are not sure if they already have a UKVI account and eVisa can either check here on GOV.UK or refer to their original grant email or letter."
        },
        {
            "text": "Further information and future updates, including details of the support available, is available at www.gov.uk/eVisa. This will be updated throughout 2024."
        },
        {
            "text": "An eVisa partner pack which provides an overview of the changes, social assets, guides and factsheets for stakeholders is available here."
        },
        {
            "text": "What is an eVisa?"
        },
        {
            "text": "An eVisa is an electronic record of a person’s immigration status."
        },
        {
            "text": "It replaces the need for physical documents such as the biometric residence permit (BRP), ink stamps or vignette visa stickers in passports, or the biometric residence card (BRC)."
        },
        {
            "text": "It explains the immigration status of the holder, including the conditions of the immigration permission such as any limitations on their right to work."
        },
        {
            "text": "Customers can view their eVisa by logging into the view and prove service using their UKVI account and share relevant information about their status securely with third parties, such as employers or private service providers such as letting agencies."
        },
        {
            "text": "What are the benefits of eVisas?"
        },
        {
            "text": "eVisas bring significant benefits, deliver excellent value and increase the UK immigration system’s security and efficiency."
        },
        {
            "text": "They will also bring significant benefits to customers who hold an immigration status in the UK:"
        },
        {
            "text": "It is also simpler for those who need to check someone’s UK immigration status (such as employers and landlords), to use online services, rather than having to maintain awareness of, and look through, different types of physical immigration documents, some of which may be in bad condition, or even fraudulent. As more and more customers create UKVI accounts, checkers can increasingly conduct one quick and simple check using a secure online service on GOV.UK."
        },
        {
            "text": "When are eVisas launching? "
        },
        {
            "text": "Although millions of customers already have and use eVisas, including everyone granted status under the EU Settlement Scheme, throughout 2024 customers who currently use physical immigration documents to prove their status and rights in the UK, are being urged to take action to create a UKVI account to access their eVisa at www.gov.uk/eVisa."
        },
        {
            "text": "This process launched in April 2024, with BRP holders emailed directly with instructions on how to create UKVI account to access their eVisa. These email invitations were initially sent in phases, before the service was made available to all BRP holders in August 2024."
        },
        {
            "text": "All BRP holders should take action now to create a UKVI account to access their eVisa at www.gov.uk/evisa."
        },
        {
            "text": "Holders of other physical immigration documents, such as a passport containing ink stamps or vignette visa stickers, or BRCs can take steps to acquire an eVisa now, and further instructions are available at www.gov.uk/eVisa."
        },
        {
            "text": "Will this impact British citizens?"
        },
        {
            "text": "British passport holders and Irish citizens, including those who previously held an immigration status but have since acquired British citizenship, do not need to do anything. British citizens who do not have a British passport because they are dual nationals (excluding Irish passport holders) may need to take action in future regarding how they prove their right of abode. Updates on this will be provided in due course."
        },
        {
            "text": "Will the Home Office be communicating about eVisas? "
        },
        {
            "text": "A comprehensive range of communications activity on the implementation of eVisas is underway and is being delivered throughout 2024, including extensive direct communications to customers on the transition to eVisa."
        },
        {
            "text": "We are also proactively engaging with a wide range of targeted stakeholders to engage those impacted by the move to eVisas, and we have developed a range of partner pack content here to equip them to communicate widely about eVisa changes."
        },
        {
            "text": "We are using official communication channels, including a range of informative videos and regularly updated content on gov.uk to communicate these changes."
        },
        {
            "text": "What is a UKVI account? How is it different to an eVisa?  "
        },
        {
            "text": "A UKVI account is a secure way for customers to log into online services such as view and prove, whereas an eVisa is an electronic record of a person’s immigration status."
        },
        {
            "text": "Using their UKVI account, customers can view their eVisa and share the relevant information via the online view and prove service, by generating a share code, which provides time-limited access to the relevant data. A person can have a UKVI account but no eVisa, for example, where the application for permission to stay in the UK was refused or expired."
        },
        {
            "text": "A customer can also update personal details such as address and contact details in their UKVI account. This service is free, unlike updating physical immigration documents for which customers may be charged. This service is available at: www.update-your-UK-Visas-and-immigration-account-details."
        },
        {
            "text": "The UKVI account is currently created automatically for everyone who uses the ‘UK Immigration: ID Check mobile App’ to make an immigration application."
        },
        {
            "text": "Customers who already hold a physical document will need to create a UKVI account to access their eVisa and to be able to use the full range of online services."
        },
        {
            "text": "As physical documents that evidence immigration status expire, the view and prove service, accessed via the UKVI account, will be the way people can view and prove their immigration status and associated rights in the UK."
        },
        {
            "text": "Can you still use a physical document if it expires, and you don’t get an eVisa?  "
        },
        {
            "text": "The expiry of a physical document, for example, a BRP card, does not affect a customer’s immigration status."
        },
        {
            "text": "Customers will be able to create an account quickly and easily post-2024, using their expired BRP if needed, at www.gov.uk/evisa. BRP holders will still be able to use the online right to work and rent services to prove their rights once their BRP expires – provided they still have valid immigration status – although they are encouraged to register for a UKVI account and to use that to access those services."
        },
        {
            "text": "Holders of legacy paper documents, including passports containing ink stamps and visa vignette stickers, can continue to use their document to prove their immigration status as before. However they are encouraged to take action at www.gov.uk/eVisa in order to make use of the benefits and convenience that a UKVI account offers, and to reduce unnecessary delays when proving their status."
        },
        {
            "text": "What do customers need to do if they hold a BRP that expires at the end of 2024?"
        },
        {
            "text": "The expiry of their BRP card does not affect their immigration status. However, how they prove their status will change from 2025."
        },
        {
            "text": "Customers who have a BRP will need to create a UKVI account to access their eVisa unless their immigration leave expires on or before 31 December 2024.  All BRP holders should take action now to create a UKVI account to access their eVisa at www.gov.uk/evisa.."
        },
        {
            "text": "Customers should retain their BRP after this process as they may need it for future applications to stay in the UK. They should also continue to use their BRP as they have previously, such as taking their BRP with them when they travel internationally, until it expires."
        },
        {
            "text": "Customers who already have an eVisa (a digital immigration status) as well as a BRP, will not need to create a UKVI account, as they already have one. Customers can find out if they already have a UKVI account by checking the email or letter that they were given when they were granted immigration status in the UK or go to www.gov.uk/evisa for further information."
        },
        {
            "text": "Should customers whose BRP expires on 31 Dec 2024 before their immigration leave is due to expire, apply now to renew their BRP?  "
        },
        {
            "text": "No, customers should not apply to renew their BRP, as all BRPs issued to customers who hold immigration leave beyond 2024, including renewals, are due to expire on 31 Dec 2024 and will be replaced by the eVisa.  An application to renew will result in an unnecessary cost to the customer, and a BRP with the same expiry date as the BRP they already hold."
        },
        {
            "text": "What should customers do if they’ve lost their BRP? "
        },
        {
            "text": "If a customer has lost their valid BRP then they can apply for a replacement in the usual way. As with all BRPs, if their leave extends beyond the end of 2024, their replacement BRP will expire on 31 December 2024, and they will need to create a UKVI account to access their eVisa to prove their rights."
        },
        {
            "text": "Once the replacement is received then customers should visit www.gov.uk/eVisa for details of how to create a UKVI account and access their eVisa."
        },
        {
            "text": "If a customer has a BRP but it expires before the end of 2024 what do, they need to do?  "
        },
        {
            "text": "If a customer’s BRP expires before 31 Dec 2024 then their immigration leave may also expire at that point. If it does, and if they plan to remain in the UK then they should make a visa renewal application in the usual way."
        },
        {
            "text": "Will a BRP holder be able to use an expired BRP to generate a share code after it has expired but while they still have immigration leave?  "
        },
        {
            "text": "Customers will be able to create an account quickly and easily post-2024, using their expired BRP if needed, at www.gov.uk/eVisa. BRP holders will still be able to use the online right to work and rent services to prove their rights once their BRP expires – provided they still have valid status – although they are encouraged to register for a UKVI account and to use that to access those services. Customers with expired BRPs will not be able to use them to travel internationally."
        },
        {
            "text": "What do legacy paper document holders need to do to evidence their rights in the UK – and what do they need to do to get an eVisa?  "
        },
        {
            "text": "Customers who have indefinite leave to enter or indefinite leave to remain and prove their rights using a passport containing an ink stamp or vignette visa sticker or use another type of legacy paper document should make a ‘No Time Limit’ application."
        },
        {
            "text": "As part of the application process customers may need to travel to a UK Visa and Citizenship Application Services Centre (known as a UKVCAS) to provide a photograph, and in some cases provide fingerprints."
        },
        {
            "text": "Once an application has been processed successful No Time Limit applicants will be issued with a biometric residence permit (BRP), which can then be used to prove the customer's rights and to create a UKVI account."
        },
        {
            "text": "By the end of 2024 No Time Limit applicants will receive an eVisa, rather than a BRP. Further updates on this change will be available in due course."
        },
        {
            "text": "It is free to make a No Time Limit application, and information on how to do so is available at www.gov.uk/biometric-residence-permits/replace-visa-brp"
        },
        {
            "text": "Why do holders of legacy documents such as passports containing ink stamps or vignette visa stickers need to get an eVisa?  "
        },
        {
            "text": "The border and immigration system is becoming more digital and streamlined, a change that will enhance the customer experience, deliver excellent value, and increase the immigration system’s security and efficiency. This move also reflects a broader societal move towards a digital approach."
        },
        {
            "text": "The transition from legacy documents, such as passports containing ink stamps or a vignette visa sticker, to eVisas will bring a range of benefits to customers. This includes the fact that an eVisa cannot be lost or damaged, like a vignette, and there is no need for a potentially costly replacement."
        },
        {
            "text": "Customers who replace their legacy document with an eVisa will benefit from the automated access that public bodies, including the Department for Work and Pensions and the National Health Service in England and Wales will securely have to their immigration status, which will streamline access to key services."
        },
        {
            "text": "Creating a UKVI account to access an eVisa will also help to prevent unnecessary delays when travelling internationally (if travelling on the document linked to the UKVI account)."
        },
        {
            "text": "What do eVisas mean for international travel? "
        },
        {
            "text": "Customers should continue to carry their in-date physical immigration documents with them when they travel internationally. Customers who already have an eVisa should tell the Home Office about any travel document on which they intend to travel using the Update your UK Visas and Immigration account details’ service at www.gov.uk/update-uk-visas-immigration-account-details.‘ if this is not already linked to their account."
        },
        {
            "text": "During 2024, the Home Office is taking steps to allow carriers, including transport operators such as airlines, ferry, and international train operators, to securely and automatically access the immigration status of passengers travelling on their services when they present their travel document which is linked to their UKVI account."
        },
        {
            "text": "This will automate the existing routine checks completed whenever a passenger presents their travel document when travelling internationally. This will provide a more convenient customer journey, and enhanced border security."
        },
        {
            "text": "While the UK government is delivering a digital border and immigration system including plans to trial contactless entry using facial recognition only, there are no current plans to replace physical passports with digital equivalents."
        },
        {
            "text": "Will all international carriers have automatic access to immigration details? Or will it just be airlines?  "
        },
        {
            "text": "Carriers operating across air, rail & sea are now be able to securely access passenger immigration information. Holders of physical immigration documents should continue to carry these with them when they travel internationally."
        },
        {
            "text": "Will removing the use of physical cards to evidence a person's immigration status in the UK, create another Windrush situation?"
        },
        {
            "text": "We are committed to ensuring that all customers, including the most vulnerable, are properly supported as we transform our immigration system, and nobody should be left behind as a result of our digital transformation."
        },
        {
            "text": "We understand that individuals may have concerns about proving their status in the absence of a physical document. However, unlike Windrush individuals whose immigration status was automatically conferred on them by an Act of Parliament, so in some cases they had no physical proof, those who receive an eVisa have secure evidence of their status. They also receive a written notification, setting out their immigration status, which they can retain for their own records. They will also have access to online services which enable them to share evidence of their immigration status with third parties, such as an employer or a landlord."
        },
        {
            "text": "To ensure customers with historic and paper-based evidence of their immigration status can take advantage of the benefits eVisas bring, we are planning further focused communications activity aimed at this group and key stakeholders to get the information that they need to create a UKVI account and access their eVisa during 2024."
        },
        {
            "text": "We will endeavour to reach vulnerable people who are less digitally confident through collaboration with other Government departments and stakeholders."
        },
        {
            "text": "Is there help and support for vulnerable groups? "
        },
        {
            "text": "We are developing our digital products and services for use by all, including vulnerable users."
        },
        {
            "text": "Customers can contact the UK Visas and Immigration Contact Centre, which provides telephone and email support to those using the online immigration status services."
        },
        {
            "text": "This includes supporting users through the online journey by:"
        },
        {
            "text": "The UK Visas and Immigration Contact Centre will also be able to assist users who are experiencing technical issues with their online immigration status, and where necessary, enable individuals’ status to be verified through alternative means."
        },
        {
            "text": "Individuals can nominate a ‘helper’ and give them limited access to their account, so that they can assist with creating a UKVI account, completing details to access an eVisa, and with any immigration application. Where a person is unable to manage their own affairs due to, for example, age or disability, a ‘proxy’, who is authorised, can create and manage the account on behalf of the person."
        },
        {
            "text": "Our Assisted Digital service is also available to provide individual support by phone and email to individuals who require assistance with IT-related aspects of creating a UKVI account."
        },
        {
            "text": "Additionally, we work collaboratively with a range of third-party stakeholders on the move to eVisas. Many of these organisations offer support to individuals requiring assistance in creating a UKVI account and accessing their eVisa."
        },
        {
            "text": "What support is there for those who are digitally excluded? "
        },
        {
            "text": "Assisted Digital is a free service provided by UKVI to support customers in the UK who are digitally excluded to create a UKVI account and access their eVisa. Customers are classified as being digitally excluded if they have access needs or if they have low or no digital skills."
        },
        {
            "text": "Access needs can include any disability that requires support to use online services, a lack of device or a lack of internet access."
        },
        {
            "text": "Will children be impacted by the move to eVisas? "
        },
        {
            "text": "In the case of children, the expectation is that their parent or guardian will have access to their UKVI account and use the online services on their behalf, as they would have looked after and used a BRP/C on the child’s behalf. They can subsequently transfer ownership of the account and access to the online services when the child reaches majority."
        },
        {
            "text": "Parents and guardians can create a UKVI account for their children at the same time they create an account for themselves."
        }
    ]
}