{
    "url": "https://rpc.blog.gov.uk/2024/09/10/reflections-from-two-recently-appointed-rpc-committee-members/",
    "title": "Reflections from two recently appointed RPC committee members",
    "authors": [
        "Caroline Elliott",
        "Ryan Williams"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-09-10T09:17:02+01:00",
    "content": [
        {
            "text": "The Regulatory Policy Committee (RPC) comprises a Chair and seven other members who together provide independent scrutiny of the economic analysis underpinning proposed legislation and post legislation review from any Government department. Members come from a variety of business, consultancy and academic backgrounds."
        },
        {
            "text": "We are the most recent appointees, starting our roles in March 2024. The application process was very straightforward. Applicants needed to submit a CV and two-page expression of interest, highlighting relevant experience. Shortlisted applicants then faced a more challenging interview. In advance of the interview we were sent a recent impact assessment from a government department on a piece of proposed secondary legislation. In the interview we were asked to offer an economic critique of the impact assessment, and then were questioned on the conclusions we had reached. It was a demanding but positive, intellectually stimulating experience."
        },
        {
            "text": "Our first impressions of the role are very positive. The cases we have reviewed are varied and frequently high-profile. For example, we were involved in the debate over the economic impacts of the proposed disposable vapes ban. In our first six months, we have reviewed economic analyses from the HM Treasury, Department for Business and Trade, the Department for Environment, Food and Rural Affairs, and the Department of Culture, Media and Sport. Additionally, we have provided input into a government White Paper, scrutinised various Government Impact Assessments and Option Assessments for proposed legislation, as well as a smaller number of Post Implementation Reviews."
        },
        {
            "text": "New members of the committee are paired with a mentor from the committee, who helps to explain the details of the Better Regulation Framework and the RPC’s approach to scrutinising impact or options assessments. We review cases individually or in pairs, but all draft RPC opinions are circulated to the eight members of the committee for comment and agreement before being issued, to ensure that opinions are genuinely representative of the collective committee’s views. The committee is supported by a fantastic secretariat of civil servants who manage the RPC’s review process and shoulders the load of full-time economic analysis."
        },
        {
            "text": "Caroline Elliott and Ryan Williams"
        },
        {
            "text": "September 2024"
        }
    ]
}