{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/10/secondment-opportunity-head-of-strategy-and-chief-of-staff-the-uk-centre-for-ecology-hydrology-ukceh/",
    "title": "Secondment opportunity - Head of Strategy and Chief of Staff, the UK Centre for Ecology & Hydrology (UKCEH)",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2024-09-10T15:11:56+01:00",
    "content": [
        {
            "text": "UKCEH is looking for a combined Head of Strategy and Chief of Staff to join our team of talented individuals, contributing to scientific discovery and making the world a better place through generating the data, insights and solutions that researchers, businesses and governments need. This role is available as a secondment for Civil Servants.  "
        },
        {
            "text": "Working at UKCEH is rewarding. Our science makes a real difference, enabling people and the environment to prosper, and enriching society. We are the custodians of a wealth of environmental data, collected by UKCEH and its predecessors over the course of more than 60 years. "
        },
        {
            "text": "Job Description "
        },
        {
            "text": "As our Head of Strategy and Chief of Staff, you will play a crucial role in advancing our mission and ambitions, leading strategic initiatives, and ensuring the continued success of our organisation. This is your chance to make a significant impact on the future of environmental science, policy and operations. In this role, you will address our most pressing challenges by coordinating complex programmes and ensuring we stay ahead of emerging issues through decisive leadership and agile management. You will bring a strong strategic vision and thought leadership, demonstrating the ability to lead and motivate teams and individuals to deliver impactful results. "
        },
        {
            "text": "As a trusted partner to the CEO, Finance Director, and Senior Leadership Team, you will provide strategic guidance, foster collaboration, and energise teams across the organisation, ensuring our objectives are met with precision and impact. You will help bridge critical gaps in our organisation, driving its evolution by overseeing the strategic delivery of key initiatives, from pioneering climate security efforts to streamlining internal governance. The role seeks to ensure excellence and impact in all that we do through driving delivery of our strategy including leading delivery of major impact areas.  "
        },
        {
            "text": "For more information, please see the full job description here.  "
        }
    ]
}