{
    "url": "https://environmentagency.blog.gov.uk/2024/09/10/wet-winters-leading-to-more-macroalgae-in-solent-but-nutrient-reduction-offers-hope-for-the-future/",
    "title": "Wet winters leading to more macroalgae in Solent, but nutrient reduction offers hope for the future",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Climate change",
        "Fisheries and biodiversity",
        "Nature"
    ],
    "pub_date": "2024-09-10T10:51:17+00:00",
    "content": [
        {
            "text": "If you spend time on or around the water of the Solent’s harbours, you will likely have noticed high levels of bright green macroalgae, on the shore or in the water. Wet winters are causing an increase in green macroalgae across the Solent, but this is set to improve."
        },
        {
            "text": "What causes macroalgae?"
        },
        {
            "text": "Increased nutrients, such as nitrogen, alongside sunlight and carbon dioxide causes the excessive growth of green macroalgae, a process known as eutrophication. Macroalgae occurs naturally in our marine environment, supporting everal species of marine life and absorbing nutrients from the water."
        },
        {
            "text": "In excess it is an indicator that something isn’t quite right. Too much macroalgae can smother mudflats and saltmarsh habitats, upset the natural beauty of the area, create challenges for recreation and negatively affect biodiversity. Birds in particular struggle because they can’t access the food rich mudflats they rely on when the macroalgae takes over."
        },
        {
            "text": "There are several sources of nitrogen that contribute to eutrophication in the Solent; sewage treatment work discharges, run off from roads and urban areas and domestic sewage treatment plants. But the largest source comes from agricultural practices over the past 40-50 years."
        },
        {
            "text": "Farmers commonly add nitrogen as a fertilizer to grow crops because it helps plants photosynthesise and grow, and in farming terms this increases the yield. But not all the nitrogen applied to the land is taken up by the plants. When it rains, excess unused nitrogen is washed into watercourses or drains (leaches) down into the ground."
        },
        {
            "text": "How do the nutrients get into the water?"
        },
        {
            "text": "Nitrogen that leaches into the ground will typically take longer to enter the water, even more so in the Solent. Much of the geology in and around the Solent is chalk; it’s where we get a lot of our drinking water from. A chalk aquifer is when water is held below the ground in a permeable or porous rock layer – the South Downs are an example of this."
        },
        {
            "text": "The chalk aquifer is like a giant sponge, absorbing water and the pollution within it before slowly releasing it over time. When we get a lot of rainfall over a long period the chalk gets saturated, squeezing older water out of holes and fissures in the ground and out of springs which eventually find their way into the harbours and estuaries of the Solent."
        },
        {
            "text": "Why is it worse this year?"
        },
        {
            "text": "This year, heavy rainfall over the winter period has flushed higher levels of nitrogen out of the chalk aquifer than normal."
        },
        {
            "text": "Much of the nitrogen being flushed from the chalk this year was probably put on the land in the 80’s and 90’s; it can take that long to filter down through the chalk (sponge). This ‘legacy’ nitrogen was put on the land in much higher levels than we see today."
        },
        {
            "text": "How are nutrient levels being reduced within the Solent?"
        },
        {
            "text": "Better regulation, improvements in farming practices and the cost of fertilizers has seen a vast reduction in nitrogen use from agriculture over the last 20 years. Most of the Solent is now designated a Nitrate Vulnerable Zone, meaning farmers have to reduce the amount of nitrate they put on the land. The knowledge that nutrients in excess can have a negative impact on our environment is also more widely understood, so many farmers are choosing themselves to consciously change their practices to limit harm."
        },
        {
            "text": "Similar improvements have been seen with sewage treatment work discharges. The Urban Wastewater Treatment Directive in 1994 and more recently the Environment Act 2021 have applied stringent targets for nitrogen and other pollutants at sewage treatment works. In Langstone Harbour the nitrates from discharges have reduced by over 49% since 2000."
        },
        {
            "text": "Although macroalgae presents a significant problem to the harbours environmentally and recreationally, the reductions in nutrients that have occurred over the last 20 years are leading to a slow but steady decrease in macroalgae levels across the Solent. The work doesn’t stop there, partnerships between the Environment Agency, Natural England, Harbour Authorities, Charities, Universities and Water Companies are working to identify more sources of nitrate and other pollution entering the harbours so we can tackle them at source. We are doing more work with farmers to help reduce inputs and we are looking at how we can use nature to absorb, filter and treat pollution. The Solent Seascape is looking to create 4ha of oyster reef in Chichester Harbour, Langstone Harbour and the river Hamble, using nature to improve water quality brings added benefits for biodiversity, carbon capture and flood protection."
        },
        {
            "text": "There will continue to be years when macroalgae is in higher abundance and we recognise there is still significant work to be done in terms of water quality. But there is hope for the future of the Solent and its harbours by demonstrating that continued investment in nutrient reduction measures can, with time, result in positive changes for the environment."
        },
        {
            "text": "Further Information"
        },
        {
            "text": "If you would like to hear more about the work that is being done to improve water quality, create new habitats and make the environment in the Solent a better place then please check out these partnerships; Chichester Harbour Protection and Recovery of Nature, Solent Seascape Project, Three Harbours."
        },
        {
            "text": "If you are concerned that what you see is not algae and is some other kind of pollution, please phone the Environment Agency hotline on 0800 807060 and avoid the water."
        },
        {
            "text": "Know before you go – check Swimfo for details of over 400 bathing waters in England. Avoid algal blooms in marine or freshwaters. If you suspect pollution, phone the Environment Agency’s hotline on 0800 807060 and avoid the water."
        }
    ]
}