{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/11/18/civil-service-fast-stream-campaign-for-2022-2/",
    "title": "Civil Service Fast Stream Campaign for 2022",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities",
        "Talent & Leadership"
    ],
    "pub_date": "2022-11-18T15:53:38+00:00",
    "content": [
        {
            "text": "Save the date applications open for the Science and Engineering Fast Stream on 8th December 2022! "
        },
        {
            "text": "Society faces many challenges which science can help solve. The Covid-19 crisis in particular highlighted the essential role of scientists and engineers in improving the quality of government decisions, to ensure scientific evidence underpins policy and that it is effectively communicated. "
        },
        {
            "text": "The government needs highly talented, versatile, and numerate scientists and engineers who are representative of our diverse population, to deliver on exciting and challenging work that will make a difference to the lives of people across the UK.  "
        },
        {
            "text": "Is this you? "
        },
        {
            "text": "We are recruiting for the Science and Engineering scheme in the Civil Service Fast Stream 2023  award-winning leadership development programme. The Fast Stream is the Government's flagship graduate development programme; it equips the brightest candidates with the knowledge, skills and experience they need to become future leaders of the Civil Service.  "
        },
        {
            "text": "You may be a science or engineering graduate straight out of university, an experienced postgraduate academic, a seasoned industry professional or a current civil servant with relevant experience. Join us and you will become part of a modern, vibrant, and active community of science and engineering professionals, who have one goal in common: to give back to the communities they serve. Whatever your background, you will have a unique set of technical skills that make you stand out from the wider Fast Stream.  "
        },
        {
            "text": "On the Fast Stream you will experience a wide range of exciting and rewarding postings while being supported to grow through a tailored personal development programme and mentoring. Over the course of three years, your unique set of postings will be across different government departments, and may also include local government, charity, or private sector roles. Together, these will further hone your ability to apply your scientific mindset while building on your leadership potential. "
        },
        {
            "text": "The Science and Engineering Fast Stream will develop you into a confident and inspiring future senior leader in the Civil Service - supporting our ambition to put science and engineering at the heart of government policy. So, if you are passionate about science and engineering, why not apply today?  "
        },
        {
            "text": "For more information, please visit the Science and Engineering Fast Stream pages on the Civil Service Fast Stream 2023 website.  "
        },
        {
            "text": "Applications are open from 8th December 2022 and the window for applications will close midday 22nd December 2022. "
        }
    ]
}