{
    "url": "https://lifeathmrc.blog.gov.uk/2022/11/18/julians-advice-helping-men-and-boys-this-international-mens-day/",
    "title": "Julian's advice: 'Helping Men and Boys' this International Men's Day",
    "authors": [
        "ebonydouglas"
    ],
    "categories": [
        "Diversity",
        "General",
        "Guest blog",
        "Inclusion",
        "Mental Health"
    ],
    "pub_date": "2022-11-18T15:14:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Celebrating International Men's Day!"
        },
        {
            "text": "Julian has worked at HMRC for 20 years and to celebrate International Men’s Day he attempts to demystify stereotypes and encourages you to take time out for yourself."
        },
        {
            "heading": 2,
            "text": "“Just what is International Men’s Day? Why does it matter? How can this post help me do my work? Why are we not concentrating on work. I have a deadline to reach…?”"
        },
        {
            "text": "Does this response resonate with you? I work in one of the largest organisations in the UK which is responsible for collecting the money that pays for the UK’s public services and helping families and individuals with targeted financial support. HMRC does it well. So well in fact, our various systems and procedures are held around the world as a barometer of how to do it correctly and fairly."
        },
        {
            "text": "So, do we need to look at IMD?"
        },
        {
            "text": "Hmm…ok let’s look at this from a different perspective."
        },
        {
            "heading": 2,
            "text": "Silent Struggles..."
        },
        {
            "text": "Our workforce has a good gender balance and a focus on diversity.  A large percentage of the male equation may have come across the themes listed above at some stage of their life."
        },
        {
            "text": "Many men may never talk, discuss any of these with their colleagues due to feeling insecure or wanting to remain private which is fine. But – of this percentage how many men in various workplaces are silently struggling? Battling through because it’s the “manly” thing to do. On top of this you must get your work done. And you probably will. But at what cost? To change a mindset is hard to do. To change a lifestyle is even harder."
        },
        {
            "heading": 2,
            "text": "Mental health, Work and Wellbeing"
        },
        {
            "text": "This IMD I’m going to suggest something small. Something which is easy to do and does not cost a penny. Just breathe. Take a step away from the computer reading this and just breathe. Relax for a moment. Not bad is it…just a bit of space to think about nothing."
        },
        {
            "text": "It’s no good for you or HMRC if your mental health is in overdrive mode. You won’t win medals if you never take a break or work till stupid o’clock because you can. Alleviating stress has been studied and proven to lead to a better healthier heart which in turn, leads to a longer life. HMRC benefits too, knowing that your health is being monitored by your own sense of wellbeing."
        },
        {
            "heading": 2,
            "text": "Coping Mechanisms"
        },
        {
            "text": "Me? Well, a book, a vinyl record or two (too many records!!), a walk or even a chat to someone about something current is how I take time out for myself. Whatever it is wherever it is – find that little bit of time to look after you."
        },
        {
            "text": "Why am I writing this post I hear you cry? Good question – I’ve been in HMRC for 20 years and a very experienced project practitioner who now resides in the Customs team. I have though, experienced two instances which were particularly traumatic for me."
        },
        {
            "text": "So…IMD – let’s make it a day where you step back and look after yourself."
        },
        {
            "text": "HMRC has a range of different internal networks and wellbeing initiatives. If you needed to talk, there are many of us who are willing to listen to our colleagues."
        },
        {
            "text": "We have a wide range of roles available, with vacancies being added to Civil Service Jobs each week. Check our current vacancies and apply now."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}