{
    "url": "https://nda.blog.gov.uk/mental-health-and-me-blog-by-yanyang-chen-magnox-nucleargraduate-international-mens-day-2022/",
    "title": "Mental health and me - blog by YanYang Chen, Magnox nucleargraduate - International Men's Day 2022",
    "authors": [
        "YanYang Chen"
    ],
    "categories": [
        "diversity",
        "health"
    ],
    "pub_date": "2022-11-18T09:12:23+00:00",
    "content": [
        {
            "text": "With the end of the year looming just around the corner, International Men’s Day poses a good opportunity to discuss a matter close to my heart – men’s mental health. According to latest reports, men account for around 74% of the total suicides in 2021, an alarming figure that is “consistent with long-term trends”. Whilst I cannot speak for everyone, in this post I will look at what in my experience are the biggest causes for this, before suggesting some ideas to help handle these issues."
        },
        {
            "heading": 2,
            "text": "The factors"
        },
        {
            "text": "The biggest factor, in my opinion, are the traditional gender roles society and the media impose on us; “strength, power, and competitiveness” are shown as important attributes for young men, alongside “less open displays of emotion and affection”. In my experience, failing to meet what I assumed was expected of me has left me feeling ashamed and despondent, although the very people I feel that I have let down may have been no worse for wear. This feeling could be caused by something big, such as a test result, down to something insignificantly small, such as being late to meet someone. Over time, without an outlet, these feelings can pile up, and in my experience the pressure can get to a point where you tangle yourself up in a quandary that I’m sure many of us have experienced; the belief that failure can only occur if something is attempted, and a vicious cycle begins."
        },
        {
            "text": "Surely, you must be thinking, you would have to be rather foolish to let it get to that point, yet many men do. The expectation of men to keep a stiff upper lip and hide their emotions makes talking about them more difficult. The negative stigma and embarrassment may only be in our minds, yet their real-world effects are clearly visible, as 40% of men stated that they would only seek professional help if they had thoughts of suicide of self-harm. In my own experience, the fear of showing weakness to others, no matter how close, has generally pushed me away from seeking help, although I can say that when I have it is generally worth it."
        },
        {
            "text": "Finally, the third topic I wanted to touch on in regard to the stigma around men’s mental health is one of culture. Personally, being from a Chinese background, mental health, and particularly men’s mental health, has long carried a deep-rooted cultural stigma, with the topic remaining taboo for many. Even for my own family in Beijing, whom I consider to be far more open on such topics than the average person, any discussion relating to issues like depression was always limited to whispered conversations between my older relatives. I can see the legacy of this in my father’s issues, in his reluctance to show love openly, and in the negative way he deals with his frustrations. This issue isn’t solely confined to Chinese culture and can be seen globally."
        },
        {
            "heading": 2,
            "text": "How can we help?"
        },
        {
            "text": "Whilst there are many more factors relating to men’s mental health, the three topics above (social expectations, emotional outlets, and cultural stigma) are the three I have personally struggled with the most. –– I’d like to end by covering the ways in which we can all help, specifically those methods which I found most effective."
        },
        {
            "text": "First and foremost, being aware of those around you is key. The nuclear sector, in the short time that I have been a part of it, is pretty good at this. Has someone lost the spring in their step? Maybe they’re just tired, or maybe something is happening in their home life, the only way to know is to ask. Not being afraid to ask the question, not just about work, but also about the wellbeing of colleagues is an admirable trait to have, and one that I hope to practice and improve upon as I work in the industry. That one small question may seem insignificant to you, but to them it might be a lifeline out of a vicious cycle. For some people, pressures from family or culture may result in them lashing out at first. This doesn’t mean that reaching out was a bad thing to do. Whilst mental health is no excuse for bad behaviour, consider the pressures they may be under, and how you could reach out and help them, as one day, the roles could be reversed."
        },
        {
            "text": "Beyond this, I find that talking to my male peers about emotions can alleviate a lot of pressure, so taking the time out to reach out to that friend who hasn’t been as active lately might be just what they, and maybe you, need. This isn’t to say that women can’t also be a listening ear, however in my experience, getting confirmation that my experience as a man isn’t unique, was very helpful. Staying connected is especially important as we get older, and I implore you to reach out to those senior to yourselves, whether that be in work or at home."
        },
        {
            "text": "And to close out, something we can all do to improve our own health as the days grow shorter; exercise. I personally found that cycling was a great outlet, as it removed me from my normal surroundings, where I could feel trapped at times, and out into anywhere I wanted. Fresh air and sunshine are great for releasing stress built up from the mundanities of everyday life, however that isn’t to say indoor sports aren’t also a great option. The physical act of moving about and raising your heartrate is enough to cause your brain to release positive endorphins, and a change of pace is something everyone needs every once in a while."
        },
        {
            "text": "Whilst this blog post is far from comprehensive, I hope it gives you some insight into what someone may be going through and what you can do to reach out and support those around you."
        }
    ]
}