{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/11/18/opss-product-safety-engineer-heo/",
    "title": "OPSS: Product Safety Engineer- HEO",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-11-18T15:22:04+00:00",
    "content": [
        {
            "text": "Our Team"
        },
        {
            "text": "We are a multidisciplinary team of scientists and engineers delivering testing and research across the broad range of regulatory areas that Office for Product Safety and Standards (OPSS) is responsible for. The team is based at our new laboratories at the Centre of Product Testing and Research which provide the capability for the assessment of a wide range of testing including metrology, mechanical, electrical, chemical and flammability. We seek to implement a high quality and fit for purpose test facility that delivers robust, scientific outputs. In collaboration with other internal evidence teams including those in science, engineering, research and analysis, our outputs inform policy development, incident investigation and the delivery and enforcement of product regulations."
        },
        {
            "text": "The Role"
        },
        {
            "text": "We require a Product Safety Engineer to lead on product testing in our new electrical laboratories, collaborating with other technical specialists and ensuring OPSS continues to deliver high-quality technical services. You will apply your technical expertise to undertake and deliver relevant work programmes, ensuring appropriate risk assessments and training have been completed, and verifying the validity and robustness of test processes and outputs. This is a key post at our newly refurbished Teddington site, requiring close collaboration with other evidence and H&S teams to ensure the effective, efficient and safe operation of our laboratories."
        },
        {
            "text": "For more information inlcuding a full job description and how to apply, please click here"
        },
        {
            "text": "Vacancy reference: 248335, Teddington; closing date:  11:55 pm on Sunday 11th December 2022."
        }
    ]
}