{
    "url": "https://ipa.blog.gov.uk/2022/11/18/pioneering-projects-for-a-greener-innovative-and-digital-future/",
    "title": "Pioneering projects for a greener, innovative and digital future",
    "authors": [
        "Nick Smallwood"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2022-11-18T10:16:37+00:00",
    "content": [
        {
            "text": "Infrastructure and Projects Authority (IPA) Chief Executive Officer, Nick Smallwood, discusses the progress that has been made to implement the ‘Transforming Infrastructure Performance: Roadmap to 2030’ policy document, one year on from publication. "
        },
        {
            "text": "It is no secret that the UK government delivers some of the most challenging, ambitious and innovative projects this country has ever seen, with the scale and scope matching some of the biggest in the world. "
        },
        {
            "text": "To do this, we have to keep up with what really matters to our modern society. Whether that be the state of our climate and finding more ‘green’ methods of delivery, or pre-empting what technology will be critical in the next 20 years, so that we are never behind the curve. "
        },
        {
            "text": "That is why we are currently embedding policies that drive both government and industry to think more innovatively in their approach of delivering major infrastructure and wider projects that will make a difference to the lives of the British public.  "
        },
        {
            "text": "Transforming Infrastructure Performance - one year on"
        },
        {
            "text": "One year ago we published our policy document, ‘Transforming Infrastructure Performance: Roadmap to 2030’. TIP’s Roadmap describes a vision for the future in which we collectively prioritise the societal outcomes we need, and use modern digital approaches and technologies, alongside improved delivery models. TIP engages with the complexity of the built environment to describe a desired future state, that we developed with industry, and brought to life through five key focus areas. "
        },
        {
            "text": "Significant progress is being made to implement the TIP principles with industry and government alike, and best practice is being shared with these groups to make an even greater impact. "
        },
        {
            "text": "Maximising decarbonisation opportunities "
        },
        {
            "text": "Fundamental to delivering TIP is improving outcomes for nature. With the government's target to reach net zero emissions by 2050, building greener, more sustainable infrastructure will be a fundamental way in which we achieve this ambition and deliver a cleaner future for the UK. To meet this goal we are investing in carbon friendly solutions, factoring biodiversity into infrastructure build and increasing carbon removal to protect against the impacts of climate change."
        },
        {
            "text": "I recently had the pleasure of visiting two sites from the School Rebuilding Programme, which is being delivered by the Department for Education with support from the IPA. Announced in 2020, the programme is committed to rebuilding or refurbishing 500 schools over the next decade. All of those built under the programme are designed to be net zero carbon in operation and have low energy use. Both sites we visited have living roofs (roofs that are partially or completely covered with plants and vegetation) and enough photovoltaic panels (panels that are installed for the conversion of thermal energy into electricity) to power the schools. This is one of a number of projects that are implementing greener methods to help create the future we want to see."
        },
        {
            "text": "Living in a digital age "
        },
        {
            "text": "TIP also embeds critical thinking around digitalisation of infrastructure, so that we continue to embrace innovation in all of our projects. Methods such as 4D planning, workforce planning and building information modelling (BIM) will be considered for every project moving forward."
        },
        {
            "text": "This has already become a reality for projects such as Crossrail that took to the tracks earlier this year and most recently opened its Bond Street Station branch. Crossrail used BIM during project management, construction and design to save time and money. This includes the pioneering build of a ‘digital twin’ - a realistic digital version of the physical railway line, providing more accuracy over how it is designed and constructed. "
        },
        {
            "text": "The learning legacy from Crossrail has enabled us to share best practice and inform future projects and programmes of what worked and what didn’t. This includes subsequent rail projects such as HS2, which also used a ‘digital twin’. The representation will be created and managed using digital engineering tools, providing capability to review and assure the railway as it is designed and constructed."
        },
        {
            "text": "We are constantly striving to develop new guidance to support government projects adopting digital principles. The new IPA Digitalisation Infrastructure Guide, part of the Government Project Delivery Framework (GPDF), will help us to achieve this. It will provide context as to how we can elevate the project delivery space using technology and amplify the TIP principles moving forward."
        },
        {
            "text": "I was particularly impressed during a recent visit to Hinkley Point Nuclear Power Station, where they have gone above and beyond many of the ideas in the  IPA Digitalisation Infrastructure guide. They demonstrated Advanced Work Packaging in action and how every aspect of the project is now using a common data platform from engineering design and quality assurance/quality control, through to construction and commissioning."
        },
        {
            "text": "Making change together "
        },
        {
            "text": "While we are making significant progress in implementing TIP, it is vital that in the future, we continue to immerse our projects in it. Of course, we can’t do this without a mutual vision between government, industry, academia and others. We need to get to a place where all of us can better challenge people and projects to adopt the TIP, by sharing best practice, spotting and managing risks from the start and monitoring metrics more closely. "
        },
        {
            "text": "I am incredibly proud of the brilliant work being delivered by our project people over the past year. We are driving the profession into a place it has never been before and while there are challenges ahead, I look forward to seeing those changes become a reality. "
        },
        {
            "text": "For more information on TIP, click here. "
        }
    ]
}