{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/18/top-tips-for-farmers-to-prepare-for-a-site-visit/",
    "title": "Top tips for farmers to prepare for a site visit",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Farm Safety"
    ],
    "pub_date": "2022-11-18T11:06:40+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "RPA’s Field Officers undertake more than 6,500 site visits each year, supporting the farming, food production and food trader sectors across England. In this blog we offer some advice to farmers on how they can best prepare for a site visit."
        },
        {
            "text": "As highlighted in this blog, RPA has introduced a more supportive, partnership-based approach to inspections, moving away from the penalty-based system under the EU, to farmer-focused visits for schemes such as the Sustainable Farming Incentive and Countryside Stewardship."
        },
        {
            "text": "Inspections are now referred to as ‘visits’ and Inspectors are called Field Officers whose aim is to support farmers by offering greater levels of advice, guidance and signposting to help improve compliance with standards and scheme requirements, and achieve better outcomes."
        },
        {
            "text": "Our Field Officers are a source of advice and guidance, and going forward, our advice and guidance activity will increase as we work with farmers and land managers to help them secure the outcomes of their agreements, prior to checking compliance with scheme controls."
        },
        {
            "text": "As part of this supportive approach, we have introduced a new visit record checklist. This will help inform farmers of their responsibilities. Please find below some top tips on how to prepare for a site visit by an RPA Field Officer:"
        },
        {
            "text": "Here you can find a full list of all the records a field officer may need to see during a cross compliance visit."
        },
        {
            "text": " "
        }
    ]
}