{
    "url": "https://environmentagency.blog.gov.uk/2022/11/18/update-on-environment-agency-investigation-2/",
    "title": "Update on Environment Agency investigation",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-11-18T09:11:06+00:00",
    "content": [
        {
            "text": "On 18 November 2021, the Environment Agency (EA) and Ofwat announced separate major investigations into possible unauthorised discharges at thousands of wastewater treatment works. "
        },
        {
            "text": "For the EA it’s our largest ever criminal regulatory investigation and we are seeking to determine the extent of any non-compliance of environmental permit conditions related to flows treated and discharged from wastewater treatment works into English waters. All water and sewerage companies and wastewater treatment works are currently in scope and more than 2,200 sites are being scrutinised by EA investigators and specialists. Our initial assessment indicates that there may have been widespread and serious non-compliance with the relevant regulations by all water and sewerage companies. "
        },
        {
            "text": "Ofwat are undertaking an unprecedented investigation into all wastewater companies in England and Wales, looking into issues with how companies are complying with their legal duties to maintain, operate and manage their wastewater treatment works and the adequacy of their governance and compliance processes on the performance of those works. Since the beginning, we have been liaising closely with Ofwat to ensure a co-ordinated approach to the separate investigations. "
        },
        {
            "text": "It is the water and sewerage companies’ responsibility to comply with all their permit conditions and environmental legislation. This is the right thing for their customers and the environment. We expect water and sewerage companies to take immediate action to bring their operations into compliance. While this investigation continues the EA is working to hold the water industry to account on a scale never seen before through increased monitoring and ongoing enforcement action when laws are broken. "
        },
        {
            "text": "An investigation of this scale takes considerable time and effort. EA investigators have been working through hundreds of documents received from the water companies and we have so far analysed over 2 billion data points as part of our investigation. Each document that we have gathered needs to be formatted correctly for analysis, scrutinised in detail, and cross-checked against permits for the thousands of sites that we are exploring. This analysis has been a huge undertaking which has helped build a picture of the potential scale of non-compliance. It is not the end of our work. We are continually analysing the data to build a comprehensive understanding of potential permit breaches to guide the next stage of the investigation. "
        },
        {
            "text": "This is a major criminal investigation and, as such, it is important that we comply with certain legal obligations and requirements. As with all criminal investigations, such as those taken by the police, the Serious Fraud Office, and others, we need to appropriately obtain and secure evidence which is relevant and reliable to ensure that we deliver a comprehensive investigation. "
        },
        {
            "text": "As an investigative body we are obliged to follow the codes of practice for both the Criminal Procedure and Investigations Act 1996 and the Police and Criminal Evidence Act 1984. Following these codes ensures that our criminal investigation can stand up to scrutiny in the event of any enforcement action. It takes time and care to ensure that our investigation is robust so that any potential prosecutions instigated by the EA are fair, proportionate, and have the maximum chance of success. "
        },
        {
            "text": "We know how important this investigation is and we are committed to getting it right. "
        },
        {
            "text": "Outside of this investigation, the EA is working with water and sewerage companies to protect the environment. We have significantly driven up monitoring and transparency from water companies so that everyone can see what is going on. Through Event Duration Monitoring (EDM) the EA requires water and sewerage companies to measure how often, and for how long, storm overflows are used. The number of overflows monitored across the network has increased from 800 in 2016 to more than 12,700 in 2021, the equivalent of almost nine in ten storm overflows. All the data is published online. "
        },
        {
            "text": "In addition, the EA is driving a multi-million-pound-programme requiring water companies to improve how they monitor and manage flows at wastewater treatment works specifically. This is to ensure that water and sewerage companies are treating the flows required by their permits before allowing discharges into the environment. This investigation was launched because the rollout of these new monitors caused the water and sewerage companies to indicate that there may have been potentially serious breaches of permit conditions. The programme will bring about significant investment for increased capacity at wastewater treatment works and storm tanks to ensure water and sewerage companies are treating all flows in accordance with strict permit conditions. Already, £200 million is earmarked for improvements between 2025-2030. This project will not be delayed by the investigation, and we continue to push the water industry to improve its performance and protect the environment. "
        },
        {
            "text": "Anyone caught breaching environmental laws faces enforcement action, up to and including prosecution. The EA does not decide the fines handed out to companies and individuals who pollute our rivers. This is down to the courts. Over 90% of our prosecutions are successful and we have secured significant penalties including fines and imprisonment against offenders who have engaged in environmental crime. "
        },
        {
            "text": "Recent judgements indicate a clear and welcome trend towards much bigger fines against water companies where appropriate. We would still like to see fines for water companies which are significant enough to concentrate the minds of board members and shareholders. Since 2015 the EA has brought forward 56 prosecutions against water companies which have secured fines of over £141 million. We continue to see important successes such as the recent combined fines of over £1.2m for Anglian Water. This year eight prosecutions brought by the EA have concluded, resulting in fines of over £3.6m. More prosecutions are progressing in court. "
        },
        {
            "text": "In 2020, Southern Water received a record £90m fine for corporate environmental crime. The fine against Southern Water was only possible due to the care and diligence the EA took. It took five years of detailed investigative work to lead to Southern Water’s admission of guilt in court. That investigation analysed discharges from 17 wastewater treatment works. Our current investigation is exploring thousands of sites across all water companies that discharge into English waters. Because of this, we have invested in new resources and staff to ensure that we can deliver a timely and thorough investigation. "
        },
        {
            "text": "We know the challenge is huge. We are focussed on following all reasonable lines of enquiry so that we can understand whether breaches have occurred, the reasons they may have occurred, and what the impact of the breaches may have been. On completion of our investigation, we will consider all the options available to us under our Enforcement and Sanctions Policy. "
        },
        {
            "text": "All future updates on this investigation can be found here on Gov.uk. "
        }
    ]
}