{
    "url": "https://educationhub.blog.gov.uk/2022/11/what-does-the-autumn-statement-mean-for-schools-colleges-universities-nurseries-and-other-education-settings/",
    "title": "What does the Autumn Statement mean for schools, colleges, universities, nurseries and other education settings?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "early years",
        "Funding",
        "Further education",
        "Higher Education",
        "Schools",
        "Universities"
    ],
    "pub_date": "2022-11-18T14:57:23+00:00",
    "content": [
        {
            "text": "The Chancellor Jeremy Hunt delivered the Autumn Statement on Thursday 17 November setting out the Government’s continued commitment to ensuring every child, young person, and adult can access world class education."
        },
        {
            "text": "He reminded us that being pro-education is being pro-growth - reaffirming the Government’s ambitions to ensure our education system provides the skills our economy needs. Sir Michael Barber has been brought in to help advise the Education Secretary, Gillian Keegan, and the Chancellor on the implementation of our skills reforms programme, backed by £3.8 billion over this parliament."
        },
        {
            "text": "As part of a continued drive to push up school standards and support schools as we catch up on lost learning after the pandemic, he announced a further £2.3 billion for schools, both next year and the year after."
        },
        {
            "text": "Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "What is the Autumn Statement? "
        },
        {
            "text": "The Autumn Statement provides an update on the Government’s plans for the economy based on the latest forecasts from the Office for Budget Responsibility. You can read more about this year’s autumn statement here."
        },
        {
            "text": "In recent years we’ve announced a range of key investments at all stages of education and in the Autumn Statement the Chancellor built on these significantly by pledging new money for schools and announcing the appointment of Sir Michael Barber to advise on our reforms to skills education."
        },
        {
            "text": "In this year’s Autumn Statement, the Chancellor set out that against the backdrop of the economic shocks from Putin’s war in Ukraine and the pandemic, the government’s priorities are stability, growth and public services."
        },
        {
            "heading": 3,
            "text": "What does the Autumn Statement mean for schools? "
        },
        {
            "text": "The Chancellor set out in his speech that schools will receive £2.3bn of additional funding in both 2023-24 and 2024-25. After adjusting budgets set at the 2021 Spending Review down to account for the removal of the compensation for employer costs of the Health and Social Care Levy, this brings the core schools budget to a total of £58.8 billion in 2024-25, £2.0 billion greater than published in 2021. This £2bn is new money over and above what had been previously committed."
        },
        {
            "text": "Funding is already £4bn higher this year than last year; and today’s announcement means it will rise by another £3.5bn in total, on top of that, next year.  That’s a 15% increase in just 2 years. By 2024‑25, the Government will be spending £58.8 billion."
        },
        {
            "text": "These increases mean that the per pupil funding levels committed to at Spending Review 2021 will be protected in real terms and underlines the importance Government attaches to schools."
        },
        {
            "heading": 3,
            "text": "Will this funding help with energy bills and other pressures?"
        },
        {
            "text": "Over the winter months all schools will continue to benefit from the Energy Bill Relief Scheme, reducing how much they need to spend on their energy and giving them greater certainty over their budgets. We are also providing schools with tools and information to help get the best value for money from their resources. This support will run until March, in line with the support offered to the public sector more widely."
        },
        {
            "text": "This significant investment, on top of increases already announced, demonstrates that schools are a key priority for the Government, especially in the context of wider fiscal challenges we are facing."
        },
        {
            "text": "This additional funding will enable school leaders to continue to invest in the areas that we know positively impact educational attainment, including high quality teaching and targeted support to the children who need it most."
        },
        {
            "heading": 3,
            "text": "What else did the chancellor say about education in the Autumn Statement?"
        },
        {
            "text": "The Chancellor reaffirmed the importance of skills to driving long-term economic growth and taking forward major reforms set out in the Skills for Jobs White Paper - like delivering T levels, rolling out bootcamps and introducing the Lifelong Loan entitlement from 2025 – all of which are key priorities for the department."
        },
        {
            "text": "To help maximise the impact of these commitments, he announced that Sir Michael Barber has been appointed to advise the Chancellor and the Secretary of State for Education on the delivery these significant reforms."
        },
        {
            "heading": 3,
            "text": "Other sectors weren’t directly mentioned in the Autumn statement – does that mean they’re not being supported?"
        },
        {
            "text": "No. The Autumn statement is an update on Government spending – there are already a range of measures in place to support the further and higher education sectors and early years:"
        },
        {
            "text": "Further education: "
        },
        {
            "text": "Reflecting the importance of skills to the economy, last year we announced the biggest increase in 16-19 funding in a decade."
        },
        {
            "text": "We are investing an extra £1.6 billion by 16-19 education and training in 2024-25, compared to 2021-22. This includes an up-front cash boost which has seen the overall average rate of funding per student increased by 9.5% in 2022-23. We are also considering funding for colleges for the coming academic year (2023-24) and will announce details in due course."
        },
        {
            "text": "On top of this, we are investing in a package of direct support for the Further Education Workforce in 2022-23, to continue to support the FE sector with the recruitment, retention, and development of teachers. This includes bursaries worth up to £26,000 each tax-free, which are available to support FE teacher training in priority subject areas for 2022-23."
        },
        {
            "text": "Early years: "
        },
        {
            "text": "We are committed to improving parents’ access to affordable, flexible childcare. We have also already increased funding to local authorities to increase the hourly rates they pay to childcare providers, and we’re providing further support for early years providers with their energy costs."
        },
        {
            "text": "Universities and other higher education settings:"
        },
        {
            "text": "To support students with living costs, we have increased maintenance loans every year, meaning disadvantaged students now have access to the highest ever amounts in cash terms."
        },
        {
            "text": "Students who are worried about making ends meet should speak to their university about the support they can access. This year universities can boost their hardship funds by drawing on up to £261m we have made available through the Office for Students."
        }
    ]
}