{
    "url": "https://educationhub.blog.gov.uk/2022/11/18/what-we-are-doing-to-help-combat-bullying-in-education/",
    "title": "What we are doing to help combat bullying in education",
    "authors": [
        "media officer"
    ],
    "categories": [
        "HTB bullying"
    ],
    "pub_date": "2022-11-18T14:46:47+00:00",
    "content": [
        {
            "text": "Bullying in school or college can have a devastating effect on children, young people and their families."
        },
        {
            "text": "Last year, we confirmed funding for five leading organisations, worth over £1m in total, to support schools and colleges as part of their responsibility to tackle all forms bullying."
        },
        {
            "text": "Here’s what you need to know about the progress that has been made to help combat bullying in education."
        },
        {
            "heading": 3,
            "text": "What organisations have received grants from the government and how are they being used? "
        },
        {
            "text": "Diana Award"
        },
        {
            "text": "The Diana Award is implementing an anti-bullying programme to empower young people with the skills, tools, confidence, and knowledge needed to significantly transform school culture and provide support to peers."
        },
        {
            "text": "They will create tailored resources and training to deliver content that meets the needs of students and school staff tackling bullying behaviour in school, the wider community and online."
        },
        {
            "text": "Training will be delivered through large, multiple-school sessions at venues across the country, offering schools the opportunity to share and support learning."
        },
        {
            "text": "Each school will have teams of around 10 students who will be Anti-Bullying Ambassadors, these will be supported by school staff."
        },
        {
            "text": "Anti-Bullying Alliance"
        },
        {
            "text": "United Against Bullying (UAB) Programme (anti-bullyingalliance.org.uk)"
        },
        {
            "text": "The Anti-Bullying Alliance (ABA) will be implementing 'United Against All Bullying' a new anti-bullying support programme, which embeds practice to help to prevent and tackle bullying in schools, including that of pupils with protected characteristics such as LGBT, SEND, race or religion or sexual/sexist bullying."
        },
        {
            "text": "Through this programme, the ABA will increase the quality of support and information available to schools; make sure support is based on the evidence about what works in this space; and embed practice into other areas such as Relationships, Sex and Health Education (RSHE)."
        },
        {
            "text": "Anne Frank Trust UK"
        },
        {
            "text": "The Anne Frank Trust have developed the 'Different But The Same' project."
        },
        {
            "text": "This is a three-year intensive anti-bullying project, which will provide training and support for 79,960 young people, their teachers and schools to tackle bullying focused on protected characteristics including LGBT+, SEND, race or religion/and belief or sexual/sexist-based bullying."
        },
        {
            "text": "The programme will help young people respect identity differences while recognising common humanity and anti-bullying values."
        },
        {
            "text": "Through learning about Anne Frank's experiences and expanding this to other victimised groups, young people will develop empathy for victims, thereby decreasing further incidents and teachers will be equipped support victims and challenge perpetrators."
        },
        {
            "text": "Diversity Role Models"
        },
        {
            "text": "Embracing Difference, Ending Bullying - A new project (diversityrolemodels.org)"
        },
        {
            "text": "Diversity Role Models will deliver a package of interventions to schools which will help make sure that staff have the knowledge and skills to tackle and prevent bullying and create inclusive school cultures."
        },
        {
            "text": "The programme will be underpinned by identifying and understanding knowledge gaps within schools and specifics challenges they face."
        },
        {
            "text": "At the end of the project, policies and processes will be widely understood by staff, while both staff and pupil participants will feel confident in intervening if they witness bullying."
        },
        {
            "text": "EqualiTeach"
        },
        {
            "text": " EqualiTeach will work with schools through their Multi-Academy Trusts (MATs) and/or local authorities (LAs) to provide a programme, full of practical support, which will create sustainable whole-school change."
        },
        {
            "text": "By working with schools in clusters in MATs/LAs, the programme will build support networks of schools who are embedding best practice and who will continue building and sharing this practice after the intervention has ended."
        },
        {
            "text": "Over the course of the programme, EqualiTeach will build an online platform of interactive resources which will be available for schools throughout the country to develop their anti-bullying work."
        },
        {
            "heading": 3,
            "text": "What else are you doing to help tackle bullying in education?"
        },
        {
            "text": "Our relationships, sex and health education (RSHE) guidance and training resources give schools the confidence to construct a curriculum that reflects diversity of views and backgrounds, while fostering respect for others and the understanding of healthy relationships."
        },
        {
            "text": "The new RSHE subjects also include teaching about bullying, healthy friendships, equality and the risks of stereotyping and online safety to ensure children are kept safe both in school but also at home, where cyberbullying can continue. Online safety should also be included in a school’s child protection policy. Our Teaching Online Safety in Schools guidance aims to support schools in teaching pupils how to stay safe online within new and existing school subjects, such as RSHE, Citizenship and Computing."
        },
        {
            "text": "Through our Preventing and Tackling Bullying guidance we provide further advice for schools on preventing and responding to bullying, including advice for head teachers and school staff on cyberbullying."
        },
        {
            "text": "As part of this, schools are also required to have policies to prevent all forms of bullying that give head teachers the confidence to ensure they can deal with any behaviour that prevents a calm, disciplined learning environment."
        },
        {
            "text": " "
        }
    ]
}