{
    "url": "https://dluhcmedia.blog.gov.uk/2023/12/22/community-ownership-fund-announcement/",
    "title": "Community Ownership Fund Announcement",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-12-22T14:08:04+00:00",
    "content": [
        {
            "text": "The Department for Levelling Up, Housing and Communities has announced that over 70 community treasures including historic theatres, pubs and museums to be rescued with £25 million UK Government levelling up funding."
        },
        {
            "text": "Successful bidders will be given a share of the Community Ownership Fund  (COF) - a levelling up initiative worth £150 million. This will ensure that local people continue to reap the benefits of their valued community assets, preserving them for future generations."
        },
        {
            "text": "The Sun welcome 8 cherished pubs across Cheshire, Yorkshire, Suffolk, Essex and the Highlands receiving funding.  BBC News positively reports that the house where the Bronte sisters were born in Thornton will be refurbished and opened to the public."
        },
        {
            "text": "The Northern Echo cover Levelling Up Minister Jacob Young’s visit to the heritage St Mary’s Church in Gateshead, a new COF project receiving over £270,000.  Many major Scottish outlets also report the King’s Theatre in Edinburgh, one of Scotland’s most historic and significant theatres is receiving £1 million, including in the Edinburgh Reporter, The Lochside Press, The Scotsman and STV News."
        },
        {
            "text": "The announcement receives wider pick up in regional news including Bristol 247, Northern Times, Weston Mercury Yorkshire Post, Nottingham Post and Manchester Evening News. Many articles note the next funding window of the Community Ownership Fund is open for bids and will close on 31 January 2024. Community groups are encouraged to apply."
        },
        {
            "text": " "
        },
        {
            "text": "Secretary of State for Levelling Up Michael Gove said:"
        },
        {
            "text": "Investing in communities improves lives – whether that’s rebuilding a community centre, rescuing historic pubs and theatres or upgrading sports facilities used by families every day."
        },
        {
            "text": "These are unique and cherished places, valued by local people of all ages, and we know how much they mean to communities."
        },
        {
            "text": "“The Community Ownership Fund is about restoring pride in the places people call home and I’m delighted to be funding these projects."
        },
        {
            "text": " "
        },
        {
            "text": "Adrian Jackson CEO and Artistic Director of the Wolverhampton Grand Theatre said:"
        },
        {
            "text": "Wolverhampton Grand Theatre is committed to supporting and empowering our cherished community, therefore the grant from the Community Ownership Fund will allow us to continue to enhance the cultural and creative enrichment within the City."
        },
        {
            "text": "Wolverhampton Grand Theatre has been developing major creative expansion plans for the past six years and these will now finally become a reality."
        },
        {
            "text": "I wish to express my sincere gratitude to the Department for Levelling Up, Housing and Communities for recognising the significant impact our work will have on the local community and for this exciting new chapter."
        }
    ]
}