{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/12/22/gse-profession-2023-wrap-up/",
    "title": "GSE Profession 2023 Wrap Up",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Profession Updates"
    ],
    "pub_date": "2023-12-22T11:00:19+00:00",
    "content": [
        {
            "heading": 3,
            "text": "In this blog we reflect on 2023 and look ahead to what’s coming up for the GSE Profession this year. "
        },
        {
            "text": "Firstly, thank you for your contributions and support of our monthly GSE newsletter. Your feedback is important to us, and we encourage you to keep the contributions coming by emailing us at gse@go-science.gov.uk."
        },
        {
            "text": "As we continue to improve our communications, we're thrilled to announce the upcoming launch of a new GSE member site. Your input during focus groups and surveys has been invaluable, with a consensus emerging for a password-protected site. Moving forward, we'll seek further feedback to tailor the site's content to your preferences and needs. Look out for more information on this in the new year."
        },
        {
            "text": "The Leadership and Talent (T&L) front has seen remarkable growth, with 51 new Science and Engineering Fast Streamers joining the SEFS scheme in 2023. Events like the Direct Appointment Scheme (DAS) network event and SEFS Recognition Offer, have contributed to growing our profession. In the coming year, we plan to finalize the new SEFS skills framework as part of the Fast Stream 2024 campaign."
        },
        {
            "text": "T&L also launched GSE Leadership Values, featuring Vlogs, Blogs, and the Toolkit. We've also supported applicants for Future Leaders Scheme & Senior Leaders Scheme and celebrated STEM apprenticeships during National Apprenticeship Week 2023."
        },
        {
            "text": "It’s also been a great year for interchange. We’ve relaunched our cross-sector knowledge exchange scheme, STEM Futures, and welcomed new government partners such as the Department for Science, Innovation and Technology. We’re excited to launch a secondment pilot programme this year in two of our main technical areas, Quantum and Data Science/AI."
        },
        {
            "text": "The Learning and Development (L&D) team has made strides with the launch of Awareness Level GSE Courses, a refreshed Professional Recognition Offer, and the expansion of the GSE L&D Champions Network. In 2024, we plan to further develop our L&D offerings to meet the diverse needs of our members."
        },
        {
            "text": "Early in 2024, we will see the launch of both the GSE skills taxonomy webpage, and further opportunities for coaching, mentoring, and career development. Don't miss National Apprenticeship Week and GSE Leadership Masterclass, both in February."
        },
        {
            "text": "Our GSE D&I Strategy Action Plan Update demonstrated that progress has been made on our priority actions and how the profession has been delivering against its D&I mission statement. Recognising GSE as a profession where everybody’s STEM talent or interest is nurtured and celebrated, delivering world class science and engineering. For the year ahead we will continue to embed EDI throughout the portfolio of work across the GSE Profession team, with an emphasis on inclusivity and collaborating with members to ensure relevance in terms of supporting capability."
        },
        {
            "text": "We have three key events coming up in 2024 including a celebration of Science and Engineering Week (March 8-17 March), our GSE presence at Civil Service Live, taking place in various locations in June and July, and the return of our biennial GSE conference later this year."
        },
        {
            "text": "Keep an eye on the GSE blog and subscribe to our newsletter to stay updated."
        }
    ]
}