{
    "url": "https://cspl.blog.gov.uk/2023/12/22/introducing-our-new-chair-doug-chalmers/",
    "title": "Introducing our new Chair, Doug Chalmers",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "Ethical standards",
        "Nolan Principles"
    ],
    "pub_date": "2023-12-22T11:48:05+00:00",
    "content": [
        {
            "text": "It is an honour to take over from Lord Evans leading the Committee on Standards in Public Life. "
        },
        {
            "text": "The Committee - which has existed since 1994 - is an independent advisory body that exists to promote the Nolan Principles of Public Life and maintain high ethical standards of conduct. It has no remit to look at individual cases nor any investigatory powers. The Committee’s strength comes from its research and ability to bring together a range of experts and practitioners so that it can learn from their experiences and hear their views before providing insight and advice or making well argued recommendations for change. "
        },
        {
            "text": "Over the years, the Committee’s work has led to the establishment of so many of the standards bodies and regulators that we now rely on. For example today it would be hard to imagine a Parliament that had no independent Commissioner for Standards to consider complaints against its Members. Or that the UK’s Electoral Commission didn’t exist to regulate and report on political donations and election expenditure. "
        },
        {
            "text": "Keeping standards processes and systems up to date means that they need to be frequently reviewed. Well run organisations regularly assess their codes of conduct and governance as there will always be new challenges and big questions that we might not have been able to foresee. By way of illustration our predecessors did not need to consider the potential consequences of AI on decision making and accountability or the impact of social media on public life. "
        },
        {
            "text": "The Nolan Principles are a well embedded cornerstone of public life in this country but they cannot be taken for granted. They take constant energy if they are to be meaningful. I look forward to working with all those who play a part in helping to maintain the high standards expected by the public of those that serve them."
        },
        {
            "text": "As I start my five year term, I will endeavour to continue the Committee’s reputation for carefully researched reports that make sound arguments to assist those in public life retain high ethical standards. We will be announcing the Committee’s future work programme in the New Year."
        },
        {
            "text": " "
        },
        {
            "text": "Follow the Committee on twitter @PublicStandards"
        },
        {
            "text": "Read previous Committee reports"
        },
        {
            "text": "What are the Nolan Principles?"
        },
        {
            "text": "Watch a short film about the work of the Committee"
        }
    ]
}