{
    "url": "https://prisonjobs.blog.gov.uk/2023/12/22/kims-work-in-approved-premises-over-the-festive-period/",
    "title": "Kim's work in approved premises over the festive period",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Probation"
    ],
    "pub_date": "2023-12-22T12:42:54+00:00",
    "content": [
        {
            "heading": 3,
            "text": "We find out what it is like to work in approved premises over the festive period, and the rewarding nature of the work."
        },
        {
            "heading": 3,
            "text": "We spoke to Kim, a business manager for approved premises in the South West region. With over 20 years of experience in probation, Kim's journey from being a case administrator to her current role has been marked by a keen interest in the operational side and a commitment to supporting offenders' rehabilitation and prospects. She reflects on the complex yet fulfilling nature of her role, especially during the festive season. "
        },
        {
            "text": "What are the biggest challenges you face working over Christmas?  "
        },
        {
            "text": "I think the fact that it can be a very lonely time for the offenders is one of the biggest challenges when working over Christmas and New Year's. Some prefer to spend time on their own and it's that balance of trying to not push it in their faces and make them feel that they have to be happy, and have to get involved in everything. They know that staff are there 24/7. If they wanted to have a one-to-one conversation. And, if they want to sit in their room, they know that we'd be checking on them regularly just to make sure they're OK. I think it's that fine balance of trying to understand that it’s a difficult time. As well as trying to make it a positive environment where we've got things on to distract them which can help them from returning to substance misuse, negative thinking or losing their motivation to succeed and make positive changes.   "
        },
        {
            "text": "Also, the allocation of home leave is a big factor. You might get some offenders who are like, “Well, they’ve got home leave- why haven’t I got home leave?”. Some may want to spend time with their family, but because of restrictions, and assessments, it’s not been approved. So, sometimes you have people who are obviously quite upset that they’ve not had home leave approved or it’s too soon for them to be tested in that environment, which you need to manage. "
        },
        {
            "text": "What are the best things about working over Christmas? "
        },
        {
            "text": "The real positive aspect of working over this period is, I think, being able to support offenders. I tend to work over this period to add some consistency, and a familiar face because I work there quite often and they get to know staff. I think they're quite grateful that they know the people generally who are working Christmas Day want to be there over that time to support them. It’s really positive being able to support them and see them progress.  Seeing how they handle the day as well is really rewarding. It's a very tough day for quite a lot of them. So, seeing them get through it and manage it well is always good. "
        },
        {
            "text": "Can you tell us a bit about your work history and how you came to be working in an approved premises for the probation service? "
        },
        {
            "text": "I've done lots of different roles working both in the front frontline and back-office. I started as a case administrator and was then a probation services officer for about 8-9 years in Offender Management. I've always done additional work usually on a weekend, first in Community Payback and then I moved over to approved premises. I've always had a love for the operational side, and I could never choose between the two, so I do both. It helps me significantly in my business manager role as I have a ground-level knowledge of current issues. "
        },
        {
            "text": " You've had a lot of great experience in the Probation Service, what keeps you motivated? "
        },
        {
            "text": "Seeing the impact that the work can have on people really motivates me, when you see people successfully move on from approved premises.  The main thing is knowing that you are contributing to protecting the public, reduce offending and importantly, to protect victims.  Sometimes they keep in touch and let us know how they're doing. We don't always get success stories all of the time, but when you do it really makes it so worthwhile. You see them go through a journey, starting with what you read about them on paper and how they present themselves, to learning to trust and take on the support and help. Seeing them progress, address their offending behaviour and reduce their risk, getting involved in some of the activities, learning new skills and successfully moving on and making those steps to change is really worthwhile, and I think that's why I’ve stayed working in probation for so long.  "
        },
        {
            "text": "The Probation Service is currently recruiting staff across several regions. If you are interested in finding out more about our roles then please visit our vacancy pages here "
        }
    ]
}