{
    "url": "https://naturalengland.blog.gov.uk/2023/12/22/kings-lincolnshire-coast-visit-to-feature-in-boxing-day-documentary/",
    "title": "King’s Lincolnshire coast visit to feature in Boxing Day documentary",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Landscapes",
        "National Nature Reserve",
        "Natural England"
    ],
    "pub_date": "2023-12-22T09:02:01+00:00",
    "content": [
        {
            "text": "In summer 2023, King Charles III visited a new Natural England National Nature Reserve (NNR) on the Greater Lincolnshire Coast to film for a BBC documentary to be broadcast on Boxing Day."
        },
        {
            "text": "The Lincolnshire Coronation Coast NNR was officially declared in September and is the first in a new King’s Series of NNRs, created by Natural England to leave a lasting public legacy for people and nature, in celebration of the Coronation of King Charles III."
        },
        {
            "text": "In July, King Charles III visited the Saltfleetby Theddlethorpe Nature Reserve, which now forms part of the new Lincolnshire Coronation Coast NNR, and took part in filming with the Chair of Natural England, Tony Juniper."
        },
        {
            "text": "Footage from the day will be included in Charles III: The Coronation Year, a new 90-minute documentary that will be broadcast on BBC One and iPlayer at 6.50 pm on Boxing Day."
        },
        {
            "text": "Alongside filming for the documentary, the King met staff from both Natural England and the Lincolnshire Wildlife Trust to gain an insight into their management of reserve."
        },
        {
            "text": "The King also learned about efforts to conserve natterjack toads and butterflies at the site, work that is closely aligned to the King’s interest in the natural world."
        },
        {
            "text": "Declan Crace, Natural England’s East Midlands Team Leader for NNRs and Connecting People with Nature, said:"
        },
        {
            "text": "“The visit was a wonderful opportunity to meet the King and discuss the fantastic work that takes place at the Lincolnshire Coronation Coast NNR."
        },
        {
            "text": "“The King was warm and engaging and showed a keen interest in our work, something which I’m sure will be reflected in the upcoming documentary."
        },
        {
            "text": "“I’d like to thank my team for their continued hard work and dedication, and for helping to make the visit a success.”"
        },
        {
            "text": "The Lincolnshire Coronation Coast NNR is the first in the new King’s Series of NNRs, committed to enhancing biodiversity and nature recovery while connecting people with nature."
        },
        {
            "text": "It covers 33 square kilometres along almost 30 kilometres of the Greater Lincolnshire coast containing a rich variety of sand dunes, salt marshes, mudflats and freshwater marshes which are of international importance."
        },
        {
            "text": "Charles III: The Coronation Year offers a unique insight into the life of King Charles III and Queen Camilla and takes viewers behind the scenes of the first year of the reign of King Charles. The cameras followed the King and Queen as they embraced their new roles and carried out their work and duties. Narrated by Helena Bonham Carter, it will air as part of the BBC’s Christmas offering."
        },
        {
            "text": "Find out more about the Lincolnshire Coronation Coast NNR."
        }
    ]
}