{
    "url": "https://ipo.blog.gov.uk/2023/12/22/monopoly-and-the-inventor-who-was-streets-ahead/",
    "title": "Monopoly and the inventor who was streets ahead",
    "authors": [
        "Amber Ockenden"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Design right",
        "Licensing",
        "Patents"
    ],
    "pub_date": "2023-12-22T13:36:06+00:00",
    "content": [
        {
            "text": "With Christmas fast approaching, my Monopoly board, together with its familiar Scottie dog and top hat player pieces, is due for its annual airing. It’s always a source of great family challenge in my house. It got me wondering if there was any interesting intellectual property history connected with this evergreen board game. What I found out was intriguing - a complex tale featuring not one, but two different inventors. "
        },
        {
            "heading": 3,
            "text": "Where it all began "
        },
        {
            "text": "More than 100 years old, it's likely to have been the cause of many a flipped family games table. Monopoly is still regarded as one of the most popular board games worldwide, and with its legendary Mayfair, Park Lane and Piccadilly locations I’d always thought it was a British game.  In fact, for many years, an American called Charles Darrow was credited with being the original inventor. "
        },
        {
            "text": "The story goes that in 1934, after playing a board game with his neighbours where the object was to buy and sell property, Darrow decided to create, patent and publish his own version of the game under the name Monopoly. Darrow’s game introduced some of the icons that the later Monopoly made famous, such as the large red arrow for ‘Go’, the tap on the ‘Water Works’ segment and a light bulb marking the ‘Electric Company’.  "
        },
        {
            "heading": 3,
            "text": " Monopoly passes ‘GO’ to take UK streets by storm "
        },
        {
            "text": "Around that time, a Leeds-based printing company known as Waddingtons had branched out into playing cards. They sent their card game Lexicon to Parker Brothers in the USA hoping to license it there. In return, Parker Brothers sent over a copy of Monopoly. "
        },
        {
            "text": "Norman Watson, head of the card games division at Waddingtons, took the game home to test over a weekend. Norman was so impressed that on Monday morning he and his father, Victor, Waddington's managing director, placed a rare transatlantic call to Parkers. The outcome? Waddingtons obtained a license to produce and market the game outside of the United States. "
        },
        {
            "text": "There was just one change needed to ensure success in the United Kingdom: the street names would need to be changed. So it was that landmark London streets such as Whitehall, Trafalgar Square and King’s Cross Station became household names with families across Britain.   "
        },
        {
            "heading": 3,
            "text": "Where it really all began "
        },
        {
            "text": "So, Darrow invented Monopoly, did he? Oh no he didn’t! It seems that Darrow may not have invented the game at all, but rather he may have taken a game that was popular locally and made some changes.   "
        },
        {
            "text": "The real story of Monopoly began in the United States when, in the early 1900’s, a stenographer named Lizzie Magie created ‘The Landlord’s Game’. "
        },
        {
            "text": "Lizzie was unmarried and, unusually for the time, owned her own home. She was intensely politically aware, and her political beliefs were given an outlet when she created the Landlord’s Game. It was a property and taxation game intended to educate users about Georgism - a system proposed by American political economist and journalist, Henry George. The object was to demonstrate how rents enrich property owners and impoverish tenants. So, interestingly, the focus of the original game was on poverty rather than on wealth and property.  "
        },
        {
            "text": "Lizzie was reported to have said about her game: "
        },
        {
            "heading": 3,
            "text": "A familiar version  "
        },
        {
            "text": "A lot of what we find familiar about Monopoly was innovative for board games at that time, and some of those novel elements could be seen in the Landlords Game too. For instance, the players circled the board. In one corner were the Poor House and the Public Park, with the Jail across the board, which of course gave us the words that Monopoly players fear: ‘GO TO JAIL’. "
        },
        {
            "text": "There were nine rectangular spaces along the edges of the board between each corner. In the centre of each nine-space grouping was a railway line, with spaces for rent or sale on either side.  As gamers made their way around the board, they performed work and earned wages. Players who ran out of money were sent to the Poor House. "
        },
        {
            "text": "Interestingly, Lizzie created two sets of rules: an anti-monopolist set in which all were rewarded when wealth was created, and a monopolist set in which the goal was to create monopolies and crush opponents. We all know which was most popular! "
        },
        {
            "heading": 3,
            "text": "Lizzie achieves patent protection "
        },
        {
            "text": "By 1906 Lizzie had patented and published her game. Magie held the patent until it expired in 1923 when she applied for another with a slightly updated game. She sold the patent to Parker Brothers for $500 in 1935 when the company bought up all rights for any game related to Darrow’s Monopoly. "
        },
        {
            "text": "So, while Darrow created the name we all know, the game’s ancestor was the popular Landlord Game created entirely by Lizzie Magie.  "
        },
        {
            "heading": 3,
            "text": "How IP litigation revealed Magie’s contribution "
        },
        {
            "text": "In the 1970s, Professor Ralph Anspach, a German-born American economics professor and games inventor, created his own game called Anti-Monopoly. Parker Brothers sued him over IP infringement.   "
        },
        {
            "text": "Through this litigation, much of the early history of the game was ‘rediscovered’ and entered into official United States court records. The legal status of Parker Brothers' copyright and trade marks on the game was eventually settled in 1985.  "
        },
        {
            "text": "So, after numerous legal plot twists, IP protection enabled Lizzie Magie to gain credit for her innovative game.  "
        },
        {
            "text": "Hasbro acquired Parker brothers in 1991.  There are 319 live US trade marks for the wordmark MONOPOLY and 62 in the UK. Other elements of the game are still protected under copyright law. At the conclusion of the court case, the game's logo and graphic design elements became part of a larger Monopoly brand, licensed by Hasbro on a variety of items through to the present day. "
        },
        {
            "text": "So this Christmas, if you’re feeling like a family challenge, why not dust off your Monopoly game board and raise a Scottie dog or doff your top hat to the game’s true creator, Lizzie Magie? I think we can safely say that she was streets ahead of her time. "
        },
        {
            "heading": 3,
            "text": "Did you know? "
        },
        {
            "text": "       Source: Hasbro - Monopoly - History & Fun Facts (archive.org)"
        }
    ]
}