{
    "url": "https://openpolicy.blog.gov.uk/2017/07/14/on-prototyping-and-putting-something-out-there/",
    "title": "On prototyping and putting something out there...",
    "authors": [
        "Vasant Chari"
    ],
    "categories": [
        "Policy Lab",
        "Skills, tools and techniques"
    ],
    "pub_date": "2017-07-14T14:34:13+01:00",
    "content": [
        {
            "text": "Prototyping might be worth a try.  Just putting it out there…"
        },
        {
            "text": "I loved my first job in the civil service. I joined the then ‘alcohol strategy unit’, a dynamic team of supportive policy makers with a wide and trusted network. There was always someone we could call for a view, explanation or for help. This was vital; we had a lot to do to realise our new ministers' vision. I suppose I also knew a little about the subject; I'd just been temping in an alcohol support centre."
        },
        {
            "text": "As policy-makers, we must remember that a feeling of connectedness to a issue can be both a blessing and a curse.  It's a curse because we inevitably bring our own tacit assumptions and experiences to bear on what we think will and won't work. This shapes the decisions we make.  It's a blessing for much the same reason; we can bring a certain level of expertise and understanding to complex policy issues. Now, after five months working in Policy Lab I'd like to share some thoughts on early stage testing or 'prototyping'.  It think this is a handy way to mitigate the risk that we design for our tacit assumptions."
        },
        {
            "text": "NB. I treat every civil servant as a policy-maker because no matter the job, a civil servant is considering the best way to make something happen."
        },
        {
            "text": "Policy-makers always benefit from talking to the people they make policies for.  In my career I've met so many representative groups, frontline staff and practitioners.  It’s no surprise that the word 'stakeholder' is such a core part of the civil servant vernacular.  But of late, Policy Lab has given me a completely different type of ‘stakeholder’ meeting.  In week 2, I was out on Saturday morning asking members of the public what they thought of mock-ups of some educational policies.  This was refreshing.  I didn't feel the impulse to defend the idea, instead a willingness to change the mock-ups based on what I was hearing - making them better. We were prototyping."
        },
        {
            "text": "Prototypes are ways to demonstrate how a service might look.  They allow us to test potential interventions at a really early stage.  As those who have worked with Policy Lab know, our design process starts by going deeply into how a citizen interacts with a service, making use of data science to look for patterns and then working in multidisciplinary teams to co-design potential interventions (see our slideshare for more). But whatever the process we take, the interventions we design will not yet be ready. We must first create small things that represent an aspect of the policy - something that can be shown to people to draw out what they think of it and whether they think it might work. "
        },
        {
            "text": "The concept of testing is not a new phenomenon in policy.  Whenever we are set a new brief by ministers we envisage what the service or intervention might look like and - often through policy submissions - ask people what they think. We consider a ‘thought experiment’.  We often consult with service users and practitioners.  We run ideas past our boss or colleagues.  We sketch diagrams.  We might even test out an idea with our friends whenever we say that we are 'just putting it out there'. "
        },
        {
            "text": "So if we already test, why write about prototyping? Because there’s something special about building facets of the policy and testing these tangible prototypes with users. "
        },
        {
            "text": "Prototypes can be super cheap and easy.  It might just be a mock-up of a gov.uk page with the proposed policy - or a roleplay of someone using a new service.  We did this in an ongoing project with the Department for Communities and Local Government (see pictures).  We were given ideas on how we could support tenants and landlords in the Private Rented Sector.  We printed off simple pictures which demonstrated those ideas.  We went out and tested them with some landlords, citizen advisers and letting agents.  We then took insights back to those who helped designed them.  It's now for another round of redesign and testing.  On another project, we’re using prototypes as building blocks, working with policy-makers to make a vision for the future. "
        },
        {
            "text": "Prototyping is best-practice from the design world.  So many of the products we love are prototyped: from the size of fizzy drink cans to changes to the logo on your favourite website.  This case study from GDS discusses prototyping services for the power of attorney.  James Dyson famously took 5,127 prototypes to develop his first vacuum cleaner.  Just imagine a government policy that had 5,127 prototypes...  I’d argue that often successful policies make room for 5,127 practitioners and frontline staff to innovate in delivery 5,127 times."
        },
        {
            "text": "I believe we should embrace a ‘prototyping mindset’ whenever we are making policy.  I’d like to leave you with three reasons:"
        },
        {
            "text": "First, prototyping is an acknowledgment that even after doing the research and building a great view of what the citizen wants, you are still a long way off a perfect policy. It is a way of safely imagining what a service might look like, welcoming comments with “yes, great point”, rather than “I didn't explain that clearly enough”."
        },
        {
            "text": "Second, prototypes can be a more understandable and compelling way to explain how something might work. If you are thinking about creating a voucher scheme, make it tangible by mocking up a voucher and asking people if they would use it.  This might produce richer insights than sending someone a two page note on what you are trying to achieve."
        },
        {
            "text": "Third, and most critically, prototyping can be a tool to promote the thought diversity which I believe is so necessary in government. Like many conscientious policy makers, I've often been afraid of speaking an opinion for fear of being 'shut down' when someone finds an inevitable small flaw in an idea. Showing someone a prototype which demonstrates the idea can be a safe way of encouraging constructive criticism: saying “this won't be perfect, but here is what it might look like - are we going in the right direction?”."
        },
        {
            "text": "You can find out more about prototyping in the Open Policy Making Toolkit or check out Nesta’s handy guide here.  Tip of the day: create your prototype by thinking about what you want to learn, asking those around who they think we should ask.  They might even be able to find you people to do more prototyping with. "
        },
        {
            "text": "I may have known a thing or two about alcohol policy when I joined the civil service, but I know where I learnt most about how policies are really experienced?  I was out with the police on a late night patrol.  Dressed in a bright fluorescent jacket two sizes too big, I asked blunt - and horribly naive - questions about how officers thought proposals might work.  In hindsight, perhaps I should have asked them to help build a prototype and brought some simple making tools with me.  But I’m not sure the jacket had pockets..."
        },
        {
            "text": " "
        }
    ]
}