{
    "url": "https://aphascience.blog.gov.uk/2022/08/20/world-mosquito-day/",
    "title": "APHA marks World Mosquito Day",
    "authors": [
        "Arran Folly"
    ],
    "categories": [
        "Parasites",
        "Viral diseases"
    ],
    "pub_date": "2022-08-20T09:00:13+01:00",
    "content": [
        {
            "text": "Most ‘world days’ are a celebration and general promotion of their eponymous characters. However, World Mosquito Day is slightly different. The annual event is used to commemorate Sir Ronald Ross’ discovery in 1897 that female Anopheles mosquitoes transmit malaria between humans."
        },
        {
            "text": "Ross’ ground-breaking work paved the way for many things we take for granted today, such as using mosquito nets, repellents, and population control programmes to reduce the incidence of disease."
        },
        {
            "text": "In the years that followed his important discovery, our understanding of mosquito-borne disease has increased dramatically; we now know mosquitoes are vectors for a broad range of pathogens that severely impact animal and public health. To provide some context, over one million human deaths occurred globally due to mosquito-borne disease in 2020 alone, and an estimated 627,000 of these were due to malaria. It seems, even with our deep understanding of mosquito-borne disease, the global disease burden is set to remain high. "
        },
        {
            "text": "Mosquitoes for their part, are, I am sure, unaware of their impact on disease transmission. Like us, mosquitoes require suitable nutrition to survive. Both male and female adult mosquitoes consume nectar, which is sugar rich, providing carbohydrates for energy. Female mosquitoes also require protein for egg production (termed oogenesis), they get this through consuming blood. Many pathogens have ‘piggybacked’ on this interaction to jump between hosts or to complete lifecycles. Therefore, when a female mosquito feeds on a vertebrate, unbeknownst to her, pathogens may indirectly be transmitted and ultimately cause disease."
        },
        {
            "heading": 3,
            "text": " Usutu virus"
        },
        {
            "text": "Unfortunately, due in part to a changing global climate, pathogens once thought to be restricted to tropic and sub-tropic regions of the world are emerging into and causing disease in temperate areas."
        },
        {
            "text": "Usutu virus is the UK’s first mosquito-borne viral zoonosis (a disease that can be transmitted from animals to humans). The initial detection of Usutu virus in the UK was in mosquitoes and birds, to date no human infections have been recorded. The detection of Usutu virus is an important milestone in our national biosecurity, as it implies that other mosquito-borne diseases might emerge here in the future."
        },
        {
            "text": "Usutu virus mostly impacts passerine birds, especially blackbirds, but the risk to humans is considered relatively low.  Recent work from APHA scientists, in collaboration with the IoZ, the British Trust for Ornithology (BTO) and the UK Health Security Agency (UKHSA), has shown that the initial emergence of Usutu virus may have caused a rapid, local decline in blackbird numbers in Greater London. This decline has been corroborated by the recent BTO/Joint Nature Conservation Committee/Royal Society for the Protection of Birds Breeding-Bird Survey which also shows a marked decline in blackbirds in Greater London in 2020."
        },
        {
            "text": "Whether this decline will continue, or if the Greater London blackbird population stabilises, remains unclear, and greatly depends on the ability of Usutu virus to persist in the UK."
        },
        {
            "text": "The APHA and IoZ detected Usutu virus in the UK again in 2021 and we are currently trying to determine if this new detection is evidence for the overwintering of Usutu virus in the UK or a new incursion. Differentiating between these two mechanisms will provide a greater understanding of how mosquito-borne viruses emerge and persist in new environments and will enable us to elucidate if the UK is permissive for the long-term establishment of such viruses."
        },
        {
            "heading": 3,
            "text": "West Nile Virus"
        },
        {
            "text": "Two years ago (2020) West Nile virus, a mosquito-borne virus which is closely related and has similar climatic requirements to Usutu virus and also infects birds and other vertebrates, was detected in a common whitethroat (Curruca communis), a passerine bird, in the Netherlands. This is the furthest north this virus has been detected and highlights the importance of understanding its continuing geographic expansion to safeguard UK biosecurity."
        },
        {
            "text": "West Nile fever is a notifiable disease of horses in the UK and potentially has a greater impact on animal and public health when compared with Usutu virus. As West Nile virus is now present at high latitudes it is becoming increasingly feasible that it will emerge in the UK in the future, but any long-term impacts are difficult to predict. The APHA routinely conducts surveillance for West Nile virus in the UK, and to date (August, 2022) there have been no detections."
        },
        {
            "text": "Our collaborative work, outlined above, which highlights the value of a One-Health approach to understanding emerging diseases, continues to look at the occurrence and impact of mosquito-borne viral diseases to safeguard animal and human health and to protect UK biosecurity."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}