{
    "url": "https://nda.blog.gov.uk/a-manifesto-for-sellafield-what-a-difference-a-year-makes/",
    "title": "A manifesto for Sellafield - what a difference a year makes",
    "authors": [
        "Martin Chown"
    ],
    "categories": [
        "Safety and Wellbeing",
        "Skills"
    ],
    "pub_date": "2021-09-08T12:30:04+01:00",
    "content": [
        {
            "text": "‘What’s it like to work at Sellafield’, and ‘what happens at Sellafield?’ are two questions that I was frequently asked when I first joined the company in 2016."
        },
        {
            "text": "Over the last 12 months, in my first year as CEO, the questions have changed. People are still interested in what happens behind our security fences but are increasingly more interested in the how rather than the what."
        },
        {
            "text": "How will we tackle some of our most hazardous clean-up challenges, how do our people work together, and how will we create a clean and safe environment for future generations?"
        },
        {
            "text": "The importance of how we do what we do is exactly why, one year ago today, we launched our manifesto, and why our annual review this year focussed on the people who are delivering our purpose."
        },
        {
            "heading": 3,
            "text": "What is our manifesto?"
        },
        {
            "text": "Our manifesto is a simple one-page document that sets out the company that we want to be. A Sellafield of which we can all be proud."
        },
        {
            "text": "It sets out why we are here – to create a clean and safe environment for future generations - and describes the 9 behaviours that our employees told us we should all expect to see from each other."
        },
        {
            "text": "That’s what makes our manifesto different. It wasn’t written by me, my executive or our board. It was written by our employees. More than 400 of them from across professions, roles and grades."
        },
        {
            "heading": 3,
            "text": "We’re creating a modern, diverse and inclusive organisation"
        },
        {
            "text": "When I became CEO one of my priorities was to help Sellafield Ltd become a modern, diverse and inclusive organisation where everyone can be themselves and do their best work."
        },
        {
            "text": "Culture change doesn’t happen overnight, but I am proud of what we have achieved in the first year of our manifesto, especially given the unprecedented nature of the last 12 months as we also responded to the coronavirus (COVID-19) pandemic."
        },
        {
            "text": "We’re driving change at all levels of the organisation – as you might expect we are driving the change as an executive and leadership team, with an executive sponsor for each element of our manifesto. But we’re also driving change from within the business with a network of more than 240 change makers."
        },
        {
            "text": "These change makers are from across our organisation. When it comes to our manifesto, change makers help link our employees and the executive. They share their enthusiasm for what we’re aspiring to achieve with colleagues, and feedback to the executive how it feels to work here so together we can continue to improve. "
        },
        {
            "text": "We’re putting our purpose at the heart of our business decisions – our internal governance systems and committees are all asking the same question… how does this business case, funding request, or programme of work help us to deliver our purpose? By clearly articulating how our work aligns to our manifesto we’re embedding it further into our organisation."
        },
        {
            "heading": 3,
            "text": "There’s more to do"
        },
        {
            "text": "One of the biggest achievements in terms of our manifesto so far is harder to quantify. It is in the conversations that people are having. People are reflecting on the manifesto and holding each other to account."
        },
        {
            "text": "I am extremely proud of the progress we have made in terms of delivery at Sellafield over the past year, and of how we are all increasingly aware that how we deliver work is just as important and what we do at Sellafield."
        },
        {
            "text": "I look forward to seeing what everyone involved in delivering our purpose at Sellafield achieves over the next 12 months."
        },
        {
            "text": " "
        }
    ]
}