{
    "url": "https://aphascience.blog.gov.uk/2021/09/08/asian-hornet-week-hunt-for-asian-hornets/",
    "title": "Asian Hornet Week – Hunt for Asian hornets",
    "authors": [
        "Meg Seymour",
        "Gordon Bull"
    ],
    "categories": [
        "Bee health"
    ],
    "pub_date": "2021-09-08T15:30:35+01:00",
    "content": [
        {
            "text": "This week, 6-10 September 2021, is the British Beekeepers’ Association’s Asian Hornet Week, encouraging vigilance and reporting of suspect Asian hornets."
        },
        {
            "text": "This year two APHA National Bee Unit (NBU) Inspectors, Meg Seymour and Gordon Bull talk of their experiences with the Asian hornet to encourage sightings during September when potential Asian hornet nest activity is at its peak and they are more likely to be seen. Last year Asian Hornet Week coincided with a finding of Asian hornets, which you can read about here: The Threat of Asian Hornet."
        },
        {
            "text": "The view across the river from Fowey in Cornwall which greeted Meg Seymour, NBU Inspector, as she arrived at an Asian hornet incursion in 2018 made her think, ‘we are looking for a needle in a haystack!’ The search for a nest was challenging and the team’s step count went up quickly! Thankfully, Meg and the team were all reasonably fit."
        },
        {
            "text": "Given the terrain and the number of potential points of entry, establishing the location of sightings and setting up traps to be monitored was the first priority for the team. Ultimately the team found and destroyed two nests in Fowey– a primary and secondary nest, both linked by genetic analysis to the same queen."
        },
        {
            "text": "In addition to responding to potential sightings of Asian hornets, NBU provide an apiary inspection programme and advice on how to manage threats to bee health such as the Asian hornet to both commercial and hobbyist beekeepers in England and Wales. Our approach to the Asian hornet is to find and destroy nests before they release potentially hundreds of queens at the end of the summer, each of which has the potential to start a new nest the following year after a period of hibernation."
        },
        {
            "heading": 3,
            "text": "What is Asian hornet and why is it a concern?"
        },
        {
            "text": "The Asian hornet (Vespa velutina) is an invasive non-native species originally from Asia. This species was introduced to France in 2004 where it has since spread rapidly, and into a number of neighbouring countries."
        },
        {
            "text": "The Asian hornet is not yet established in the United Kingdom (UK), but a number of sightings have been recorded since 2016. This species is a highly effective predator of other insects, including honeybees, which could harm the balance of UK pollinators if it were to establish."
        },
        {
            "text": "Find the latest information on Defra’s Asian hornet rolling news page."
        },
        {
            "text": "Asian hornets are highly adaptive and could nest anywhere. In the UK, nests have been found both in the ground and high in trees for example. For a nest to thrive it needs water and food nearby."
        },
        {
            "text": "Whilst Asian hornets need a prevailing wind to fly across the Channel from France or Jersey, where they are already causing a real problem. They are also not averse to hitching a lift on a boat, in a caravan or ferry. Therefore, if you are travelling from mainland Europe, remember to keep a look out in your vehicle or luggage for an unwelcome stowaway! Find out how to report Asian hornet sightings later in this blog."
        },
        {
            "heading": 3,
            "text": "Responding to sightings"
        },
        {
            "text": "In the last 5 years, APHA’s NBU has responded to 21 incursions of the Asian hornet. Nests were destroyed in all cases where continuous flying hornets were observed and an associated nest or nests were also found."
        },
        {
            "text": "NBU Seasonal Bee Inspector Gordon Bull’s first experience of Asian hornets was in Tetbury, Gloucestershire, in 2016. A local beekeeper had spotted the hornets predating his bees."
        },
        {
            "text": "Gordon was also part of the NBU Team who dealt with an incursion near Drayton Bassett in Staffordshire in 2019 where the team had a sighting location in a back garden where the hornets were regularly coming to feed."
        },
        {
            "text": "A new leaflet showing how to create a range of simple monitoring devices is available under ‘factsheets’ on Beebase, the NBU’s official website."
        },
        {
            "heading": 3,
            "text": "2021 New Asian hornet ‘Track and Trace’ technology"
        },
        {
            "text": "Track and Trace is the search method that has proved to be most effective to find Asian hornet nests. NBU started using the term long before COVID-19! Monitoring traps with a variety of baits are used and Inspectors watch and mark foraging hornets around beehives and on patches of nectar-bearing flowers."
        },
        {
            "text": "APHA has developed an Asian Hornet Track and Trace mobile application allowing real-time data, such as trap locations and sightings, to be collected and recorded on a map. The app will help multiple teams of inspectors record and share information more effectively which we believe will further improve tracking."
        },
        {
            "heading": 3,
            "text": "Identifying an Asian hornet"
        },
        {
            "text": "The Asian hornet has some distinct identifying features:"
        },
        {
            "text": "Improve your identification skills so you can identify an Asian hornet. Download a free ID sheet (Free hard copies can be ordered from nnss@apha.go.uk)."
        },
        {
            "heading": 3,
            "text": "What can I do to help?"
        },
        {
            "text": "Nests in Europe can develop up to the size of a large beach ball, however, nests found in the UK have been smaller, so it is not quite ‘hunting for a needle in a haystack’. The only chance we have of continued success for finding and eradicating Asian hornets to protect the UK’s bees and other pollinators, is by working together to raise awareness of the threat and the continued reporting of suspected sightings which is where you can help."
        },
        {
            "text": "This Asian Hornet Week, APHA and the British Bee Keepers’ Association are asking everyone to brush up on their Asian hornet identification skills, and report any suspected sightings with a photo using the free Asian Hornet Watch app for iPhone or Android."
        },
        {
            "text": "Remember to keep a look out on late flowering plants such as Ivy where the hornets (and other insects) forage on the flowers."
        },
        {
            "text": "You may also wish to read this article on commonly misidentified insects."
        },
        {
            "heading": 3,
            "text": "Our science blog"
        },
        {
            "text": "Important achievements are published regularly on the APHA science blog with the aim to improve the communication of our science to a wider audience. It covers a range of scientific highlights from special interest stories on our scientists through to more detailed reports on the excellent science we do."
        },
        {
            "text": "You can subscribe to the blog or follow the work of APHA via our official social media platforms: Facebook, Twitter and LinkedIn. These are regularly updated with news stories, calls to action and notification of the publication of new science blogs."
        }
    ]
}