{
    "url": "https://ruralpayments.blog.gov.uk/2021/09/08/mp-roundtable-with-the-rpa-richard-holden-mp-north-west-durham/",
    "title": "MP Roundtable with the RPA - Richard Holden MP (North West Durham)",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Agricultural Transition",
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Rural Development Programme for England"
    ],
    "pub_date": "2021-09-08T14:55:50+01:00",
    "content": [
        {
            "text": "We held the second of our ‘MP Roundtable with the RPA’ events on 27 August with Richard Holden, MP for North West Durham. Held at St Thomas Hall in Stanhope, Paul Caldwell, our CEO, Ali Johnson, an RPA Director, members of the Senior RPA team and colleagues from the Future Farming Countryside Programme (FFCP) met with a wide variety of farmers and land agents from the local area."
        },
        {
            "text": "Holding an event on a Friday evening at 5pm was slightly risky, but it paid off with more than double the number of confirmed attendees arriving, creating a buzz in the church hall."
        },
        {
            "text": "After a welcome and introductions from Richard Holden, who has been the MP for North West Durham since 2019, Paul Caldwell took to the floor and outlined the purpose of the session - to provide an update from the RPA, to give more details about the Agricultural Transition Plan and offer an opportunity for farmers and land agents to ask questions and provide feedback."
        },
        {
            "text": "In addition to outlining the RPA 5-year strategy, the RPA leadership team were keen to stress our ambition to build a different relationship with farmers, highlighting some of ways the Agency was transforming the way it worked with rural communities."
        },
        {
            "text": "The attendees were also given an update, from John Hustler, on the work underway on the environmental land management schemes i.e. Sustainable Farming Incentive (SFI), Local Nature Recover and Landscape Recovery."
        },
        {
            "text": "We recently announced that the SFI pilot deadline has been extended until 30 September. This was a hot topic for the session, with lots of questions around specifics of what farmers needed to do for the scheme and the application process. Other topics in the Q&A session included the upcoming BPS reductions; the effect on communities; animal health and wellbeing; reassurance on mapping and the software; and the overall financial envelope available."
        },
        {
            "text": "The overriding theme of the discussions was the appreciation of the RPA's efforts to get payments out and the intention to co-design the new schemes with farmers and land agents. Introducing the changes gradually and only when we know they work, acting on feedback received to adopt flexibility in the way the schemes are administered."
        },
        {
            "text": "Richard Holden MP said,"
        },
        {
            "text": "Paul Caldwell said,"
        },
        {
            "text": "We are organising more roundtable events over the coming months with MPs across the country and we are arranging other sessions with farming bodies and associations, so keep an eye on our blog for more information. To receive further updates to your inbox, you can subscribe to the blog."
        }
    ]
}