{
    "url": "https://homeofficemedia.blog.gov.uk/2021/09/08/new-safety-tech-fund-challenge/",
    "title": "New Safety Tech Fund Challenge",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Ministerial opinion"
    ],
    "pub_date": "2021-09-08T10:35:11+01:00",
    "content": [
        {
            "text": "HThe below op-ed from Home Secretary Priti Patel is featured in the Telegraph Online today, Wednesday, 8 September, coinciding with the launch of the Home Office's new Safety Tech Challenge Fund."
        },
        {
            "text": "The Fund will award five organisations from around the world up to £85,000 each to develop innovative technology to keep children safe in environments such as online messaging platforms with end-to-end encryption."
        },
        {
            "text": "Home Secretary Priti Patel                                               "
        },
        {
            "text": "Modern technology has brought many benefits, but any powerful medium also brings dangers. The internet and social media are used to conduct and facilitate the most despicable crimes."
        },
        {
            "text": "  "
        },
        {
            "text": "It is utterly appalling to know that the sexual abuse of children is incited, organised, and celebrated online. Child abusers share photos and videos of their abhorrent crimes, as well as luring children they find online into sending indecent images of themselves. "
        },
        {
            "text": "It is devastating for those it hurts and happens on a vast and growing scale. Last year, global technology companies identified and reported 21 million instances of child sexual abuse. "
        },
        {
            "text": " "
        },
        {
            "text": "Another misconception is that this all takes place in dark corners of the web. In fact much of this abuse occurs on everyday apps and platforms that you probably use for perfectly normal reasons. "
        },
        {
            "text": " "
        },
        {
            "text": "End-to-end encrypted messaging presents a big challenge to public safety, and this is not just a matter for governments and law enforcement. Social media companies need to understand they share responsibility for keeping people safe. They cannot be passive or indifferent about what their products enable or how they might inadvertently blind themselves and law enforcement from protecting children with end-to-end encryption."
        },
        {
            "text": " "
        },
        {
            "text": "Your messages are already encrypted as they travel from your device to a technology company’s systems. End-to-end encryption takes this further, so that neither the platform operator nor police can see the content – even when it’s essential for safety reasons that they do so."
        },
        {
            "text": " "
        },
        {
            "text": "The UK is a global leader in tackling online child sexual abuse. We are bringing in new safety laws via the Online Safety Bill. There is, however, zero room for complacency. I am raising this issue at the G7 summit of interior ministers this week, as it is a problem that crosses national borders. "
        },
        {
            "text": " "
        },
        {
            "text": "I will chair sessions where we consider how the G7 can deepen our collaboration to keep people safe, with a particular focus on online security and child sexual exploitation. We will look at the promises made by industry and their role in addressing harmful content on their platforms."
        },
        {
            "text": " "
        },
        {
            "text": "The introduction of end-to-end encryption must not open the door to even greater levels of child sexual abuse – but that is the reality if plans such as those put forward by Facebook go ahead unchanged. Hyperbolic accusations from some quarters that this is really about governments wanting to snoop and spy on innocent citizens are simply untrue. It is about keeping the most vulnerable among us safe and preventing truly evil crimes."
        },
        {
            "text": " "
        },
        {
            "text": "I am calling on our international partners and allies to continue to back the UK’s approach of holding technology companies to account and asking social media companies to put public safety before profits. They must not let harmful content continue to be posted on their platforms or neglect public safety when designing their products. We believe there are alternative solutions, and I know our concerns are shared by law enforcement colleagues and the most respected child protection organisations in the UK and around the world."
        },
        {
            "text": " "
        },
        {
            "text": "This is also a technical issue, so we are seeking technical solutions. Recently Apple have taken the first step, announcing that they are seeking new ways to prevent horrific abuse on their service. Apple state their child sexual abuse filtering technology has a false positive rate of 1 in a trillion, meaning the privacy of legitimate users is protected whilst those building huge collections of extreme child sexual abuse material are caught out. They need to see though that project."
        },
        {
            "text": " "
        },
        {
            "text": "But that is just one solution, by one company, and won’t solve everything. Big Tech firms collectively need to take responsibility for public safety and greater investment is essential. Today I am launching a new Safety Tech Challenge Fund. We will award five organisations from around the world up to £85,000 each to develop innovative technology to keep children safe in environments such as online messaging platforms with end-to-end encryption."
        },
        {
            "text": " "
        },
        {
            "text": "Applications open today, with a deadline of 6 October. The Fund will run for five months from November 2021. Technologies will be evaluated by independent academic experts."
        },
        {
            "text": " "
        },
        {
            "text": "Modern technology has changed the world, in many ways for the better. We cannot allow it to be used to hurt children."
        }
    ]
}