{
    "url": "https://phescreening.blog.gov.uk/2021/09/08/new-guidance-to-help-nhs-antenatal-and-newborn-screening-providers-tackle-inequalities/",
    "title": "New guidance to help NHS antenatal and newborn screening providers tackle inequalities",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme",
        "NHS Infectious Diseases in Pregnancy Screening Programme",
        "NHS Newborn and Infant Physical Examination",
        "NHS Newborn Blood Spot Screening Programme",
        "NHS Newborn Hearing Screening Programme",
        "NHS Sickle Cell and Thalassaemia Screening Programme"
    ],
    "pub_date": "2021-09-08T08:34:06+01:00",
    "content": [
        {
            "text": "The NHS population screening inequalities strategy sets out how PHE and our partners aim to tackle screening inequalities."
        },
        {
            "text": "The strategy emphasises the importance of making sure there is equitable access to screening services and of supporting people to make a personal informed choice about participating in screening."
        },
        {
            "text": "In support of that aim, we have published a wide range of national guidance and resources for local screening providers and commissioners on GOV.UK."
        },
        {
            "text": "We have now added to this suite of resources by publishing new national guidance to support providers in addressing inequalities throughout the antenatal and newborn (ANNB) screening pathway."
        },
        {
            "heading": 2,
            "text": "Successful collaboration"
        },
        {
            "text": "The guidance was developed by a national PHE Screening team that included representatives from each of the 6 ANNB screening programmes:"
        },
        {
            "text": "It was informed by a literature search and developed in collaboration with a range of stakeholders, including patient organisations such as the Sickle Cell Society and UK Thalasaemia Society, local screening providers and newborn hearing and NIPE IT system user groups."
        },
        {
            "text": "The new guidance includes a wealth of information, resources and signposting related to:"
        },
        {
            "text": "Many thanks to everyone who contributed to the development of this new guidance."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}