{
    "url": "https://deframedia.blog.gov.uk/2021/09/08/regulatory-position-statement-on-wastewater-treatment/",
    "title": "Regulatory Position Statement on wastewater treatment",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-09-08T17:13:46+01:00",
    "content": [
        {
            "text": "On Monday 6 September, the Environment Agency issued a Regulatory Position Statement (RPS) covering the use of one of the chemicals – ferric sulphate – which is used by water and sewerage companies to treat wastewater."
        },
        {
            "text": "The purpose of the RPS is to minimise the impact on the environment should unavoidable delays in the delivery of ferric sulphate in the coming weeks due to a shortage of HGV drivers."
        },
        {
            "text": "Ferric sulphate is used in the final stage of sewage treatment in certain areas to reduce levels of phosphorus. Primary and secondary treatment of wastewater will not be affected; this is not a case of untreated sewage being discharged."
        },
        {
            "text": "This time-limited RPS requires water companies to prioritise discharges to protect the most sensitive and high-risk locations, using a risk assessment process designed by the Environment Agency.  Strict conditions apply to this position statement. Treatment may only be temporarily ceased after the Environment Agency has agreed in writing that companies have met the criteria and can demonstrate a low environmental impact.  This means that the most sensitive and high-risk watercourses will not be affected."
        },
        {
            "text": "No companies have requested to use the RPS yet. The Government is also continuing to work closely with water companies on this issue, with steps already taken such as extending delivery hours outside of standard operating times."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}