{
    "url": "https://socialcare.blog.gov.uk/2021/09/08/social-care-reform-and-what-it-means-for-our-workforce/",
    "title": "Social care reform and what it means for our workforce",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2021-09-08T10:27:45+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The biggest challenge"
        },
        {
            "text": "Solving the crisis of provision, affordability and sustainability in the social care sector was always going to be a complex, contentious and evolving challenge. Adding a global pandemic to the equation has made that task even more daunting."
        },
        {
            "text": "It is one thing to establish a new funding model and - whatever you feel about the recently announced Health and Social Care Levy - it’s quite another to make sure you have the colleagues, providers and services in place to deliver great care."
        },
        {
            "text": "Our wonderfully resilient care colleagues have been doing that already of course. They have borne the strains, stresses and sacrifices of the last 18 months with incredible fortitude, but this level of service is not sustainable and must be met with enhanced professional support."
        },
        {
            "text": "As part of the record 36 billion investment to reform the NHS and social care, the Prime Minister’s announcement of at least £500m funding for the care workforce across three years is, therefore, very welcome. It will help us develop new qualifications, career progression pathways and robust mental health support for thousands of care staff across England. It represents a five-fold increase in public spending on the skills and training of care workers and registered managers."
        },
        {
            "heading": 2,
            "text": "Enhanced training"
        },
        {
            "text": "I am also heartened by the Government’s commitment to provide additional support for the continuous professional development (CPD) of the workforce, including hundreds of thousands of training places and certifications for care workers. This will spur efforts to level up CPD in line with NHS nurses and therapists and promote enhanced knowledge and skills across the piece."
        },
        {
            "text": "The PM’s announcement mean we can also raise our game in providing pastoral support for staff, who continue to perform extraordinary roles helping the country emerge from the privations of this pandemic."
        },
        {
            "text": "Boosted mental health resources and access to occupational health services will help sustain good health in mind and body. Counselling, peer-to-peer coaching and workplace improvements are just some of the provisions we hope to see rolled out across the sector. In particular, I’m keen to see care providers respond more positively and flexibly to care staff’s travel and domestic needs. An understanding, adaptable and empathic employer is such a morale booster."
        },
        {
            "heading": 2,
            "text": "Grasp the opportunity"
        },
        {
            "text": "It may sound counter-intuitive, given the strange and pressured times we’ve all lived through, but I believe there has never been a better moment to pursue careers in social care. We just need to get much better at showcasing all the career opportunities available at a local and national level and celebrate the successful and rewarding careers many people have had and continue to enjoy."
        },
        {
            "text": "Local authorities have a vital role to play in supporting recruitment and retention. I am keen to see them supporting local providers to recruit colleagues by proactively identifying workforce shortages, developing workforce plans, and encouraging integrated working across services. If we can draw one positive from the pandemic, it is our enhanced ability to collaborate."
        },
        {
            "text": "Centrally, Government has put in a place a range of measures to help providers recruit and retain staff. This includes the national recruitment campaign, Every Day is Different, the latest phase of which ran from February to April 2021and which is due another push soon."
        },
        {
            "text": "So, big changes are coming, but they won’t happen overnight. They also won’t happen without input from the people who understand our profession the best – our care colleagues. We need their hopes, concerns and wise counsel to inform the White Paper on social care reform coming later this year, to help make sure all proposals are truly fit for purpose."
        },
        {
            "text": "I believe we all are at the beginning of an exciting, empowering and transformative journey, one which will take our amazing profession to new heights of excellence and job satisfaction, and deliver happier, healthier communities. I hope many more of you will join us and help create a social care system fit for the 21st Century and beyond."
        }
    ]
}