{
    "url": "https://forestrycommission.blog.gov.uk/2023/05/09/addressing-the-need-for-seed-how-were-tackling-the-demand-for-quality-trees/",
    "title": "Addressing the need for seed: How we’re tackling the demand for quality trees",
    "authors": [
        "Megan Shirley"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-05-09T16:10:36+01:00",
    "content": [
        {
            "text": "Tree seed is a key, but often overlooked part of tree production. With the government’s ambitious tree planting commitments, and the introduction of legally binding targets to increase tree and woodland cover in England to 16.5% by 2050, demand for trees and therefore tree seed is more important than ever. That’s why last year we launched the Seed Sourcing Grant (SSG), to enhance the quality, quantity, and diversity of tree seed sources in England."
        },
        {
            "text": "Following a successful first round, we’re reopening the grant for new applications later this spring. Read on to learn more about the grant and what's new. Definitions for technical terms can be found at the bottom of the page."
        },
        {
            "heading": 2,
            "text": "What is the Seed Sourcing Grant?"
        },
        {
            "text": "The SSG launched in September 2022 and provides funding to create or identify new Seed Stands and Seed Orchards and make existing Stands as productive as possible for seed collectors in the long term."
        },
        {
            "text": "Work with stakeholders and technical experts has developed a set of priority tree seed species strategies. These describe suggested approaches to improving the availability of seed for certain priority species (mainly native broadleaves). These species are prioritised for funding under the grant but other species are also eligible."
        },
        {
            "text": "The grant is open to a range of applicants, from landowners to private tree nurseries or charities, and we encourage collaborations, for example, between landowners and technical experts. Applicants from round 1 are welcome to apply again in round 2."
        },
        {
            "heading": 2,
            "text": "How did the first round go?"
        },
        {
            "text": "We were really pleased with the response to the first round of the SSG. Applicants were asked to submit single, or multi-year proposals with a minimum total cost of £10,000."
        },
        {
            "text": "After a competitive evaluation process, we funded 11 projects and committed £770k over three years. The projects cover 22 priority species and 14 non-priority species."
        },
        {
            "text": "Amongst the successful applicants, are several large landowners, including the Woodland Trust and the National Trust. They’ll be surveying their land for suitable seed stands to add to the Register of UK Basic Materials. These projects should result in a range of new registered Seed Stands becoming available for seed collections within the next couple of years."
        },
        {
            "text": "Other successful applicants include landowners who are receiving funding to manage single seed stands, through activities such as thinning, clearing ground vegetation, or installing deer fencing. These projects aim to increase the quantity of seed available for collection at these sites as well as improve the ease with which collection can be carried out."
        },
        {
            "text": "We’re also funding a number of organisations to develop new Seed Stands and Orchards. These include Selected Stands and Tested Orchards consisting of trees that show superior characteristics such as form and size. Seed from these Stands and Orchards is ideal for tree planting where timber production is a priority. Earth Trust, Sotterley Estate, and Future Trees Trust, for example, are working together to develop new Tested Seed Orchards for Sessile and Pedunculate Oak, the first of their kind in the UK."
        },
        {
            "text": "You can read about all the projects funded in round 1 on the Seed Sourcing Grant: successful projects 2022 page."
        },
        {
            "heading": 2,
            "text": "What’s new for the second round?"
        },
        {
            "text": "Ahead of reopening the grant, we’ve reviewed the priority tree seed species strategies to reflect where these are being met by work funded to date. As a result, we’ve removed wych elm and guelder rose from the priority list (though they remain on the non-priority list). The updated strategies are available on our Seed Sourcing Grant page."
        },
        {
            "text": "There are still areas where there’s little or no work being carried out. Therefore, in round two, we’d particularly welcome proposals to address these, including:"
        },
        {
            "text": "The system for managing Forest Reproductive Materials can be quite a technical area, so we’ll also be providing potential applicants with support on putting together proposals. We’ll be running a ‘Meet the Experts’ webinar to provide advice on how to plan an SSG project and give potential applicants a chance to ask questions."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Look out for announcements about the ‘Meet the Experts’ webinar and further details on the grant reopening. We’ll publish these on our social media channels, @ForestryComm on Twitter and Forestry Commission on LinkedIn, and in our Grants and Regulations eAlert which you can subscribe to. "
        },
        {
            "text": "In the meantime, you can send any enquiries about the grant to ssg@forestrycommission.gov.uk. "
        }
    ]
}