{
    "url": "https://buyingforschools.blog.gov.uk/2023/05/09/do-the-fire-doors-in-your-school-meet-the-required-safety-standards/",
    "title": "Do the fire doors in your school meet the required safety standards?",
    "authors": [
        "Julie Noble, Health, safety and fire resilience technician"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-05-09T13:59:11+01:00",
    "content": [
        {
            "text": "Julie Noble is a health, safety, and fire resilience technician for the Risk Protection Arrangement (RPA), the DfE’s alternative to commercial insurance for schools. Your school may already be a member but if not, you can find more information about the RPA on GOV.UK. Julie, alongside her colleague Joanne Rafferty, conduct on-site fire risk assessments every day in schools as part of the RPA resilience measures. In this blog post, Julie will guide you through how to check and make sure your fire doors are up to the required safety standards."
        },
        {
            "heading": 2,
            "text": "Fire doors explained"
        },
        {
            "text": "Schools have a responsibility under the Regulatory Reform; Fire Safety Order (FSO) 2005 to ensure that everyone in the building is kept safe; including pupils, teachers, and support staff. Making sure that all fire doors are fitted and maintained properly is a key part of this."
        },
        {
            "text": "We walk past and through them every day without a second thought, but fire doors play a vital role in the defence against fire, smoke, and toxic fumes. In a school, as in all public spaces, good fire safety practice can literally be the difference between life and death."
        },
        {
            "text": "The simple purpose of a fire door in everyday use is just as any other door. However, since a breakout of fire is never predictable, the fire door, unlike any other door, must then perform its prime purpose – to protect lives and offer protection to the remainder of the building."
        },
        {
            "text": "A fire door ensures that should a fire break out, it can be contained in a 'compartment'. This prevents the spread of fire, smoke and toxic fumes for a defined period, allowing adequate time for occupants to escape before becoming overwhelmed. It will not fulfil this function if it is not fitted or maintained properly, propped open, or the 'hold open' devices are not working effectively."
        },
        {
            "text": "All fire doors are 'fire rated' and all this means is that some provide longer protection than others for holding back smoke, fire, and toxic fumes. You will probably find most school fire doors are FD30 rated which means they will resist the elements of fire and contain the flames for a minimum of 30 minutes."
        },
        {
            "text": "There are, however, both single and double fire doors of a higher rating available, allowing a longer period of fire containment. These are ordinarily located on rooms of special fire risk like plant rooms, electrical intake rooms, science and technology laboratories, kitchens, combustion engine rooms, rooms used for the storage of chemicals and fuels, and stores for PE mats."
        },
        {
            "text": "Part of our role as health, safety, and fire resilience technicians, is helping schools with the basics and this includes a brief 'tour' of a fire door. Yes, that is something we do! To demonstrate the 'tour', we’ve produced this short video to help you understand what to look for on your fire doors."
        },
        {
            "text": "It’s important to understand the different elements of a fire door, as each has its own role to play in ensuring it is suitable and sufficient for its purpose, and lives are not put at risk. More information and guidance can be found in the Fire safety risk assessments in educational premises – Appendix B, page 121 covers fire doors."
        },
        {
            "text": "The most common issues we see during our on-site risk assessments include:"
        },
        {
            "heading": 2,
            "text": "Which areas need a fire door?"
        },
        {
            "text": "There is often a misconception that every door should be a fire door, this is not the case."
        },
        {
            "text": "Schools should have a fire strategy identifying where fire doors are required. This is usually in the form of a CAD/plan drawing produced by the architect who designed the building and can ordinarily be found in the Operations and Maintenance manuals (O&M) for the building(s). The Institute of fire engineers have a member directory which may be of assistance if your school decides to commission a competent person, for example a fire engineer, to produce a fire strategy."
        },
        {
            "text": "Stairway areas are a key area to be protected. There won’t be many schools that don’t have at least one stairway that is a means of escape from upper floors. Protected stairways are designed to provide a 'fire sterile' area to places of safety outside the building. Fire doors, as far as reasonably possible, will stop any gases, flame, or smoke from spreading to any floors other than where the initial fire outbreak has occurred. Your mandatory fire strategy CAD/plan will clarify the locations of protected stairways and your fire risk assessor should check the doors to the area are effective at each fire risk assessment review."
        },
        {
            "text": "Long corridors are also a high risk and self-closing fire door(s) should be installed in every corridor exceeding 12 metres in length which connects two or more exits."
        },
        {
            "heading": 2,
            "text": "How often should my fire doors be checked?"
        },
        {
            "text": "To comply with the Regulatory Reform (fire safety) Order 2005 (as amended by the Fire Safety Act 2021), a competent person should regularly review the fire risk assessment of their school building(s). A person is regarded as 'competent' where they have sufficient knowledge, skills, experience, and relevant qualifications to conduct the task. Schools should check that their fire risk assessor is competent in checking fire doors and that they are checked as part of the fire risk assessment."
        },
        {
            "text": "The person accountable for the premises is usually the responsible person, and their duties fall within the Regulatory Reform (fire safety) Order 2005 (RRO) and regulations made under article 24 of the RRO. If your school or academy has residential sleeping accommodation or your building exceeds 11 metres in height and contains residential sleeping accommodation, please also refer to Fire Safety (England) Regulations 2022: fire door guidance."
        },
        {
            "text": "Fire doors should be checked regularly, at least every six months. In terms of maintenance and where doors are heavily used it may be pertinent to increase this frequency. A basic check should be carried out daily to make sure exits are not blocked or obstructed."
        },
        {
            "text": "The minimum requirement is for the competent person to undertake an inspection to identify any obvious damage or issues and record their findings. This could be on a simple spreadsheet to confirm the date, any deficiencies found and when remedials are completed."
        },
        {
            "text": "Where remedial work is required, this must be conducted by a competent person. We would also recommend if any issues were identified, it would be appropriate to undertake more detailed checks of doors (or the self-closing device) if any damage is identified from the initial inspection. This could include engaging a specialist."
        },
        {
            "heading": 2,
            "text": "More information"
        },
        {
            "text": "We recognise that this is an important task and we have just given this brief overview. We would encourage you to read the Fire safety risk assessments in educational premises which explains what a fire risk assessment is and how you might go about it, as well as further guidance on fire precautions. Appendix A of the Fire safety risk assessment in educational premises has an example of a fire safety maintenance checklist you may find helpful."
        },
        {
            "text": "We can’t stress enough the importance of conducting your mandatory fire risk assessments and this includes all fire doors. If your school is looking to replace or purchase new fire doors, always use a reputable supplier, and ask whether the product has been fire tested. Remember that the frame and ironmongery are just as important as the door - they all work together."
        },
        {
            "text": "Ensure that where new fire doors are installed, this is completed by a competent organisation and there is a regime of care and maintenance including regular inspections."
        },
        {
            "heading": 2,
            "text": "Help and advice"
        },
        {
            "text": "GOV.UK has more information and guidance about fire safety in new and existing school buildings."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}