{
    "url": "https://marinedevelopments.blog.gov.uk/2023/05/09/have-your-say-on-marine-plans-in-your-area/",
    "title": "Have your say on marine plans in your area",
    "authors": [
        "Alex Curd, MMO Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2023-05-09T12:00:51+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation's (MMO) Marine Planning team would like your support in collecting data to inform the monitoring and reporting of England’s marine plans."
        },
        {
            "text": "Surveys are one way we can understand the use and impact of marine plans. Information you share is used to support three-yearly reports to Parliament on the progress of marine plans. You can view previous reports for the South Marine Plan and East Marine Plans on GOV.UK."
        },
        {
            "text": "We would very much welcome you to share your experience of using marine plans in your work by completing one of the monitoring surveys listed here:"
        },
        {
            "text": "The monitoring surveys are our primary source of data collection where other data methods are limited and therefore yours and your organisation’s effort in completing the monitoring survey is important to us. If you operate in multiple marine plan areas, we would appreciate it if you or your organisation would respond to multiple surveys."
        },
        {
            "text": "The monitoring surveys will close on the Friday 30 June."
        },
        {
            "heading": 3,
            "text": "FAQs"
        },
        {
            "text": "How long will a monitoring survey take to complete?"
        },
        {
            "text": "The monitoring survey should take less than an hour to complete. We can only accept fully completed monitoring surveys, those partially completed will be excluded from the final analysis of the data."
        },
        {
            "text": "Who can I speak to for more information about marine plans in my area?"
        },
        {
            "text": "Marine Planners are based around England’s coast and are here to support you and answer your questions on the monitoring survey or any other issue."
        },
        {
            "text": "How will information provided be protected?"
        },
        {
            "text": "The MMO personal information charter gives clarity on how we will use your information."
        },
        {
            "text": "Data taken from the monitoring surveys and later used in publications will be aggregated and anonymised."
        },
        {
            "text": " "
        },
        {
            "text": "Thank you for your help in strengthening our monitoring data."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}