{
    "url": "https://nationalscreening.blog.gov.uk/2023/05/09/lancet-article-defines-road-map-for-uk-lung-cancer-screening-programme/",
    "title": "Lancet article defines road map for UK lung cancer screening programme",
    "authors": [
        "Andrew Anderson"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-05-09T15:34:39+01:00",
    "content": [
        {
            "text": "The Lancet has this week published an article setting out the priorities for the effective implementation of targeted lung cancer screening in the UK."
        },
        {
            "text": "This follows the UK National Screening Committee’s (UK NSC’s) positive recommendation for the introduction of a national targeted lung cancer screening programme for people at high risk."
        },
        {
            "text": "The UK NSC contributed to the article, which describes the consensus reached by an expert multi-professional group on the requirements and priorities for implementing lung cancer screening. The expert group included behavioural scientists, stakeholder organisations, and representatives from NHS England (NHSE), the UK NSC and the 4 UK nations."
        },
        {
            "text": "The article summary states:"
        },
        {
            "text": "The UK NSC, NHSE and the Department of Health and Social Care (DHSC) are working together to plan how targeted lung cancer screening will be implemented in the 4 UK nations."
        },
        {
            "text": "We will continue to keep you informed of developments leading to implementation via this blog."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}