{
    "url": "https://marinescience.blog.gov.uk/2023/05/09/qa-with-elena-couce-paris-agreement-vital-to-save-worlds-coral-reefs/",
    "title": "Q&A with Elena Couce: Paris Agreement vital to save world’s coral reefs",
    "authors": [
        "Elena Couce"
    ],
    "categories": [
        "adaptation",
        "biodiversity",
        "Climate Change",
        "International",
        "Policy",
        "Science"
    ],
    "pub_date": "2023-05-09T09:08:14+01:00",
    "content": [
        {
            "text": "Coral reefs are one of the most important ecosystems in the world, supporting up 25% of the ocean’s marine life.  However, warming temperatures and ocean acidification have led to a decline in coral reef richness in much of the tropics.  In this Q&A, Cefas Scientist, Elena Couce, discusses her latest study which is helping to understand the impacts of climate change on coral reef biodiversity, and how meeting the Paris Agreement targets to limit global warming to 1.5 will be crucial for their future protection. "
        },
        {
            "text": "Could you tell us a little more about the findings of your new paper?  "
        },
        {
            "text": "This is the first global study to predict the future impacts of climate change on coral reef biodiversity. The study looked at the changes in habitat for over 650 different coral reef species in specific locations and regions across the world driven by climate change under a Paris Agreement or High Emissions scenario by 2080-2090 (so either about 1.9 degrees or over 4 degrees of warming).  For each coral species, we trained a statistical model to look at how things like changes in sea temperature, salinity and ocean acidification could impact the distribution of that specific coral reef species, to understand which areas were likely to be able to support healthy coral reefs in the future.  "
        },
        {
            "text": "Our study found that even if the 2-degree Paris Agreement target was met, the majority of the world’s reefs would experience a significant loss of coral species, with particularly large declines across sites in the Great Barrier Reef, Coral Sea and Western Indian Ocean. We are already seeing this today, with mass coral bleaching events becoming increasingly common, but it’s not all doom and gloom. We found that if the world can come together to meet the Paris Agreement targets, then regional coral reef species richness was largely maintained (up to 30% loss), whereas an 80-90% loss was projected under the High Emissions scenario.  So even though individual reefs are still likely to lose a lot of species even under the Paris Agreement, when we look at the species present in other nearby reefs, we see that many of them are still going to be present in the future at different locations within the region.  "
        },
        {
            "text": "The High Emissions scenario, on the other hand, paints a bleak picture for the future of coral reef biodiversity, with warming and ocean acidification levels becoming increasingly unsuitable for corals throughout the century, leading to potentially catastrophic species loss nearly everywhere. The hope, of course, is that we don’t take that path…"
        },
        {
            "text": "Several studies that look at coral mortality due to bleaching suggest that even under the Paris Agreement, we are likely to lose the majority of the world’s reefs. How does looking coral species richness advance our understanding of the impacts of climate change on coral reef ecosystems? "
        },
        {
            "text": "Coral mortality from bleaching due to warmer sea temperatures can only be predicted in the short term because it is due to extreme temperature events, and it is difficult to predict those in advance. We do know mass coral bleaching events are already happening and increasing in frequency, which does indeed paint a bleak future for corals. However, papers looking at mortality are generally not focusing on changes in biodiversity or community composition, so although both types of study highlight that the world’s coral reefs will be significantly impacted by climate change, it's only when we looked at regional richness that we saw a nugget of hope in an otherwise depressing future for coral reefs, in that while individual reefs were going to lose a lot of species, many of these species were still going to persist somewhere in the larger region. This provides some hope that recovery may still be possible in the latter half of the century when conditions improve (if the Paris Agreement targets are met). "
        },
        {
            "text": "Why is it important to look at both local and regional richness in terms of understanding coral reef biodiversity? "
        },
        {
            "text": "The study looked at local reef richness (i.e., average coral species richness at reef locations) and regional richness (total number of species in any reef location within a region). Species richness is often used an indicator of healthy coral reef ecosystems. Locally we found that diversity is going down significantly in all reefs, with some areas affected worse than others, however at the regional level, we found that the species projected to be lost in an individual reef were different compared to those expected to be lost in other nearby reefs. So, if you put together all the different species throughout the region, the majority would still be there (under the Paris Agreement scenario). This is important because even if a reef has lost a lot of species, but those species are still present nearby, they could re-colonize the reef once conditions improve, whereas if they are completely lost from an area (we call this a \"regional\" extinction), then it would be much harder for them to come back. "
        },
        {
            "text": "How could these findings be used to help protect coral reefs?  "
        },
        {
            "text": "The study highlights the importance for policymakers in meeting the Paris Agreement which aims to limit global warming to 1.5C to protect coral reef ecosystems, in that 70-80% of coral species could be protected in most key regions. It also helps us understand the areas where biodiversity is at greater risk and those where conditions look more favourable to future corals, which could help policymakers better manage and monitor their oceans, such as through marine protected areas or to help support reef restoration. It also could help policymakers plan targeted interventions to protect specific climate vulnerable species or to support species with greater resilience.  "
        },
        {
            "text": "What was the most interesting part of the study for you?  "
        },
        {
            "text": "Interestingly one of the things we found is that regions with the greatest warming, but experiencing less impact from acidification, such as the Red Sea, are projected to retain a high proportion of their coral species, particularly under the Paris Agreement scenario, whereas regions with lower sea temperatures and a lower rate of warming, but high levels of ocean acidification, such as in the Great Barrier Reef, and the Coral Sea, are projected to experience the greatest species loss. This suggests that ocean acidification could have a critical impact on coral species richness.  "
        },
        {
            "text": "What are the next steps for this research? "
        },
        {
            "text": "We have several projects that will continue this research and build on the results of this study. For example, we are looking at the impact of diversity loss on the ecosystem services that coral reefs provide. For example, if we were to lose particular types of corals from a reef, for example “branching” species, then the animals that depend on those branching corals will no longer be able to live there. We are also looking at the implications for shoreline protection since coral reefs play a critical role in protecting tropical coastline from tropical storms and flooding. Another line of research is the impact of climate change on species that are particularly important for the coral trade and that are exported in large number by different countries in the world (for example, for the aquarium industry). "
        }
    ]
}