{
    "url": "https://apprenticeships.blog.gov.uk/2023/05/09/transport-and-logistics-from-apprentice-to-mentor/",
    "title": "Transport and logistics: from apprentice to mentor",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentices"
    ],
    "pub_date": "2023-05-09T10:31:31+01:00",
    "content": [
        {
            "text": "The transport and logistics route review report was published on 2 May."
        },
        {
            "text": "Koli Begum completed an apprenticeship with the Go Ahead Group in June 2021, before going on to become a driver and apprentice mentor in the organisation."
        },
        {
            "text": "Hear from her about her experience on the level 2 passenger transport driver - bus, coach and tram apprenticeship standard, and her career journey so far."
        },
        {
            "heading": 2,
            "text": "Why did you decide to do an apprenticeship?"
        },
        {
            "text": "The apprenticeship programme gave me access to re-join the workforce with on-the-job training alongside an educational programme, helping me to gain employment."
        },
        {
            "text": "This was my first full-time employment after being a caregiver for 12 years for my beautiful son who is disabled, and I was apprehensive about returning to work. I was ecstatic when I was offered the bus driving job. I really enjoyed driving all over London - I felt like a tourist in my home town!"
        },
        {
            "text": "The apprenticeship route allowed me to take up my role as a bus driver immediately. It gave me a practical approach to learning and allowed me to earn a living whilst gaining a qualification. A benefit of being an apprentice is that it gives you invaluable hands-on experience from professionals."
        },
        {
            "heading": 2,
            "text": "What was your apprenticeship experience like?"
        },
        {
            "text": "The apprenticeship programme is designed to support you in every way to maximise your potential, keeping you upskilled and up-to-date with changes taking place in the company. I could not have done it without the support of my mentors, assessors, training school team, and managers."
        },
        {
            "text": "When I  was asked to become a mentor after completing my apprenticeship, I was very proud that I could provide support and training to other bus drivers. I did not think my managers would consider me to join their mentoring team. Your employers see you as their next team leaders, managers, creators and inventors. You are part of their company and developing you is part of their growth, too."
        },
        {
            "heading": 2,
            "text": "What are your next steps in your career or learning?"
        },
        {
            "text": "I am currently part of a woman’s steering group for bus and coach networks initiated by Transport For London to encourage more woman to join the industry and how better to support them."
        },
        {
            "text": "I started my apprenticeship during the pandemic and at the height of it,  I saw how instrumental public transport had become. This gave me an insight and made me realise how vital the transport system is and what it meant to me. I hope to remain in  the transport industry and be at the heart of any communities that we serve by meeting their diverse and ever changing needs."
        },
        {
            "text": "Taking the apprenticeship route made me see I can pursue a long-term career in an essential industry."
        }
    ]
}