{
    "url": "https://food.blog.gov.uk/2023/05/09/what-happens-during-a-food-business-inspection-we-asked-an-environmental-health-practitioner/",
    "title": "What happens during a food business inspection? We asked an Environmental Health Practitioner",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-05-09T10:35:30+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Jo,  from South Derbyshire District Council. She shared with us her top advice and explained the important role Environmental Health Practioners (EHP) like her, play in ensuring food businesses are supported and equipped to run safe and successful businesses. "
        },
        {
            "text": "“I like enabling people to achieve their goals.”"
        },
        {
            "text": "I wanted to become an Environmental Health Practitioner because of the breadth and depth of the profession. Each day is different. I enjoy the role because I can help people succeed and I like enabling people to achieve their goals. I like being able to pass on my knowledge and experience."
        },
        {
            "text": "Being an EHP has given me broad brush skills that not only include food safety, but pest control for example, which allows me help people in different ways. I like working with new business owners because I can be there to support them from start to finish."
        },
        {
            "text": "“We want the food business to succeed and our economy to flourish!”"
        },
        {
            "text": "I also like my job because it contributes to the economic growth of local communities, it provides employment and it can help provide spaces for people to come together. We want the food business to succeed and our economy to flourish!"
        },
        {
            "text": "“We are not seeking to find fault or to catch out the business.”"
        },
        {
            "text": "Some business owners can be nervous but when they understand what the inspection is about they usually relax. We are not seeking to find fault or to catch out the business. We are very much about working with the business; coaching or training to secure compliance. Get the most out of the visit by asking questions, don’t be afraid to ask questions."
        },
        {
            "heading": 2,
            "text": "Inspections and visits"
        },
        {
            "text": "We know new businesses in particular are eager to know what to expect for their first EHP inspection, so we asked Jo to give us an overview of what an inspection or visit entails."
        },
        {
            "text": "I tend to start with basic questions to understand the business activity. Then find out if they are undertaking high-risk activities and focus on those. I will check any records to ensure that documented systems are being followed."
        },
        {
            "text": "I do a physical inspection of the premises to ensure that there is no significant disrepair and that the facilities such as staff toilets and water supply to the wash-hand basins are all satisfactory. I will also check the fridge temperatures and any hot cabinets or bain-maries to ensure the correct temperatures are being maintained."
        },
        {
            "text": "I will talk to the management and staff regarding the risks associated with the business and what controls are in place to minimise these. This will also include discussing training of staff."
        },
        {
            "text": "“The purpose of the inspection is to ensure that we have confidence in the management of the business”"
        },
        {
            "text": "Basically, the purpose of the inspection is to ensure that we have confidence in the management of the business and that the relevant documentation is in place. We also make sure that the premises are suitable for a food business, such as the layout and structure, and that the Food Business Operator and staff are competent and can carry out their roles safely."
        },
        {
            "text": "Once an assessment has been completed a food business risk rating will be calculated, this will determine the date of the next inspection. If appropriate, a food hygiene rating will be given."
        },
        {
            "text": "“Discuss what you are planning to do and establish a good working relationship with your local authority”"
        },
        {
            "text": "My advice for business owners would be to contact their local authority before they start trading. You can discuss what you are planning to do and establish a good working relationship with your local authority and ask for their advice, no matter how trivial it may seem."
        },
        {
            "heading": 2,
            "text": "Further advice on preparing for an inspection"
        },
        {
            "text": "Want to find out more about what EHP’s would look for in an inspection? Take a look at our food safety management system known as Safer Food Better Business."
        },
        {
            "text": "If you’re planning to start or are currently running a food business, we want to make it easier for you to do the right thing and keep your customers safe. Visit our Business Guidance Hub to find a range of advice, guidance and training for Food Business Operators."
        },
        {
            "heading": 1,
            "text": "Beth sy’n digwydd yn ystod arolygiad busnes bwyd? Gwnaethom ofyn i Ymarferydd Iechyd yr Amgylchedd"
        },
        {
            "text": "Cawsom sgwrs â Jo, o Gyngor Dosbarth De Swydd Derby. Rhannodd ei chyngor gorau â ni ac esboniodd y rôl bwysig y mae Ymarferwyr Iechyd yr Amgylchedd fel hi yn ei chwarae o ran sicrhau bod busnesau bwyd yn cael eu cefnogi a’u harfogi i redeg busnesau diogel a llwyddiannus. "
        },
        {
            "text": "“Rwy’n hoffi cefnogi pobl i gyrraedd eu nodau.”"
        },
        {
            "text": "Roeddwn i eisiau bod yn Ymarferydd Iechyd yr Amgylchedd oherwydd ehangder a dyfnder y proffesiwn. Mae pob diwrnod yn wahanol. Rwy’n mwynhau’r rôl oherwydd fy mod yn gallu helpu pobl i lwyddo, ac rwy’n hoffi cefnogi pobl i gyrraedd eu nodau. Rwy’n hoffi gallu rhannu fy ngwybodaeth a’m profiad er budd eraill."
        },
        {
            "text": "Mae bod yn Ymarferydd Iechyd yr Amgylchedd wedi rhoi sgiliau eang i mi sy’n cwmpasu mwy na diogelwch bwyd. Rwy hefyd yn gwybod am reoli plâu er enghraifft, sy’n fy ngalluogi i helpu pobl mewn gwahanol ffyrdd. Rwy’n hoffi gweithio gyda pherchnogion busnes newydd oherwydd fy mod yn gallu bod yno i’w cefnogi o’r dechrau i’r diwedd."
        },
        {
            "text": "“Rydym am i’r busnes bwyd lwyddo ac i’n heconomi ffynnu!”"
        },
        {
            "text": "Rwy hefyd yn hoffi fy swydd am ei bod yn cyfrannu at dwf economaidd cymunedau lleol. Mae’n darparu cyflogaeth ac mae’n gallu helpu i ddarparu mannau i bobl ddod at ei gilydd. Rydym am i’r busnes bwyd lwyddo ac i’n heconomi ffynnu!"
        },
        {
            "text": "“Dydyn ni ddim yn ceisio dod o hyd i feiau na dal y busnes allan.”"
        },
        {
            "text": "Mae rhai perchnogion busnes yn gallu bod yn nerfus, ond pan fyddant yn deall beth sy’n digwydd mewn arolygiad, maen nhw fel arfer yn ymlacio. Dydyn ni ddim yn ceisio dod o hyd i feiau na dal y busnes allan. Rydym yn canolbwyntio ar weithio gyda’r busnes gan ddarparu hyfforddiant i sicrhau cydymffurfiaeth. Manteisiwch i’r eithaf ar yr ymweliad drwy ofyn cwestiynau. Peidiwch byth â bod ofn gofyn cwestiynau."
        },
        {
            "heading": 2,
            "text": "Arolygiadau ac ymweliadau"
        },
        {
            "text": "Rydym yn gwybod bod busnesau newydd yn arbennig yn awyddus i wybod beth i’w ddisgwyl o ran eu harolygiad cyntaf gan ymarferydd iechyd yr amgylchedd. Felly, gwnaethom ofyn i Jo roi trosolwg i ni o’r hyn sy’n digwydd yn ystod arolygiad neu ymweliad."
        },
        {
            "text": "Rwy’n tueddu i ddechrau gyda chwestiynau sylfaenol er mwyn dod i ddeall gweithgareddau’r busnes. Yna, rwy’n ceisio cael gwybod a ydynt yn ymgymryd â gweithgareddau risg uchel ac yn canolbwyntio ar y rheiny. Byddaf yn gwirio unrhyw gofnodion i sicrhau bod systemau sydd wedi’u dogfennu yn cael eu dilyn."
        },
        {
            "text": "Rwy’n cynnal archwiliad ffisegol o’r safle i sicrhau nad oes angen unrhyw waith atgyweirio sylweddol, a bod y cyfleusterau, fel y toiledau staff a’r cyflenwad dŵr i’r basnau golchi dwylo, i gyd yn foddhaol. Byddaf hefyd yn gwirio tymheredd yr oergell ac unrhyw gabinetau poeth neu offer ‘bain-marie’ i sicrhau bod y tymereddau cywir yn cael eu cynnal."
        },
        {
            "text": "Byddaf yn siarad â’r rheolwyr a’r staff ynghylch y risgiau sy’n gysylltiedig â’r busnes a pha fesurau rheoli sydd ar waith i’w lleihau. Bydd hyn hefyd yn cynnwys trafod hyfforddiant y staff."
        },
        {
            "text": "“Diben yr arolygiad yw sicrhau bod gennym ni hyder yn y ffordd y mae’r busnes yn cael ei reoli”"
        },
        {
            "text": "Yn y bôn, diben yr arolygiad yw sicrhau bod gennym ni hyder yn y ffordd y mae’r busnes yn cael ei reoli a bod y ddogfennaeth berthnasol yn cael ei chadw. Rydym hefyd yn gwneud yn siŵr bod y safle’n addas ar gyfer busnes bwyd, o ran y cynllun a’r strwythur, a bod y Gweithredwr Busnes Bwyd a’r staff yn gymwys ac yn gallu cyflawni eu rolau’n ddiogel."
        },
        {
            "text": "Unwaith y bydd asesiad wedi’i gwblhau, bydd sgôr risg busnes bwyd yn cael ei gyfrifo, a bydd hyn yn pennu dyddiad yr arolygiad nesaf. Os yw’n briodol, caiff sgôr hylendid bwyd ei phennu."
        },
        {
            "text": "“Trafod yr hyn rydych yn bwriadu ei wneud a meithrin perthynas waith dda gyda’ch awdurdod lleol”"
        },
        {
            "text": "Fy nghyngor i berchnogion busnes yw y dylent gysylltu â’u hawdurdod lleol cyn iddynt ddechrau masnachu. Gallwch drafod yr hyn rydych yn bwriadu ei wneud a meithrin perthynas waith dda gyda’ch awdurdod lleol a gofyn am eu cyngor, ni waeth pa mor ddibwys y gallai ymddangos."
        },
        {
            "heading": 2,
            "text": "Cyngor pellach ar baratoi ar gyfer arolygiad"
        },
        {
            "text": "Awydd gwybod mwy am yr hyn y byddai ymarferwyr iechyd yr amgylchedd yn edrych amdano mewn arolygiad? Edrychwch ar ein system rheoli diogelwch bwyd o’r enw Bwyd Mwy Diogel, Busnes Gwell."
        },
        {
            "text": "Os ydych chi’n bwriadu dechrau busnes bwyd neu os ydych yn rhedeg busnes bwyd ar hyn o bryd, rydyn ni am ei gwneud hi’n haws i chi wneud y peth iawn a chadw’ch cwsmeriaid yn ddiogel. Ewch i’n Hyb Canllawiau Busnes i ddod o hyd i amrywiaeth o gyngor, canllawiau a hyfforddiant i Weithredwyr Busnesau Bwyd."
        }
    ]
}