{
    "url": "https://deframedia.blog.gov.uk/2023/07/14/coverage-of-unlimited-penalties-for-environmental-polluters/",
    "title": "Coverage of unlimited penalties for environmental polluters",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-07-14T10:03:12+01:00",
    "content": [
        {
            "text": "There has been widespread coverage on new legislation that means those that pollute the environment will face unlimited penalties. It will allow environmental regulators to target a much wider range of offences and tackle pollution."
        },
        {
            "text": "The move to enshrine these new powers in law was covered by Radio 4’s Today Programme, The Times, The Independent, Press Association, The Daily Express, Evening Standard, Daily Star, CityAM, Bloomberg and Reuters, amongst others. The Environment Secretary was also interviewed on Farming Today on the issue while attending the Great Yorkshire Show. There was further coverage in regional and financial trade titles, such as the Northern Echo and Insurance Journal."
        },
        {
            "text": "The current limit of £250,000 on variable monetary penalties that the Environment Agency and Natural England can impose directly on operators will be lifted, following a government consultation which received widespread public support. This will offer regulators a quicker method of enforcement than lengthy and costly criminal prosecutions – although the most serious cases will continue to be taken through criminal proceedings."
        },
        {
            "text": "New powers will also enable these higher penalties to be levied as a civil sanction for offences under the Environmental Permitting (England and Wales) Regulations 2016, the regime under which the majority of Environment Agency investigations take place. This will ensure regulators have the right tools to drive compliance across a range of sectors, strengthening enforcement and holding all who hold environmental permits – from energy and water companies to waste operators and incinerators – to greater account."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "Minister for Environmental Quality and Resilience Rebecca Pow said:"
        },
        {
            "text": "Environment Agency Chair Alan Lovell said:"
        },
        {
            "text": "There was also coverage following the publication of the Environment Agency’s annual report on the environmental performance of England’s nine water and sewerage companies. The Environmental Performance Assessment report shows some modest improvements to water company star ratings in 2022, compared to 2021. The findings were covered by The Times, The Daily Telegraph, The i and Utility Week, amongst others."
        },
        {
            "text": "Measured against the Environment Agency’s 4-star rating system, four companies have stayed the same, three have improved and two have got worse. The ratings take into account performance on environmental commitments such as pollution incidents and treatment work compliance. Although there have been some improvements, all water companies need to go further and faster in improving their environmental performance."
        },
        {
            "text": "The Environment Agency has also set out how it will:"
        },
        {
            "text": "Environment Agency Chair Alan Lovell said:"
        },
        {
            "text": "Water Minister Rebecca Pow said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}