{
    "url": "https://healthmedia.blog.gov.uk/2023/07/14/government-accepts-recommendations-from-nhs-pay-review-bodies/",
    "title": "Government accepts recommendations from NHS pay review bodies ",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Workforce"
    ],
    "pub_date": "2023-07-14T15:38:55+01:00",
    "content": [
        {
            "text": "The government has accepted the recommendations of the Independent Review Body on Doctors' and Dentists' Remuneration’s (DDRB)."
        },
        {
            "text": "The decision means that doctors in training (junior doctors) will receive a permanent pay increase of on average 8.8% - between 8.1% and 10.3% depending on where they are in their training"
        },
        {
            "text": "Pay scales for consultants will also increase by 6%, meaning starting basic full-time pay will increase from more than £88,300 to £93,600. Full-time equivalent basic pay for consultants will increase by around £6,300 on average."
        },
        {
            "text": "Below is a fact sheet setting out further detail and the press release can be found here."
        },
        {
            "heading": 2,
            "text": "Health and Social Care Secretary Steve Barclay said:"
        },
        {
            "text": "“We hugely value the work of all NHS staff."
        },
        {
            "text": "“That’s why we’re giving junior doctors, consultants and senior NHS staff a fair and reasonable pay rise as recommended by the independent pay review bodies."
        },
        {
            "text": "“But it also balances the need to keep inflation in check while giving some staff significant pay increases."
        },
        {
            "text": "“We’ve made it clear this pay award is not up for negotiation and urge those unions still in dispute with the government to end their strikes immediately.”"
        },
        {
            "heading": 2,
            "text": "How much will junior doctors receive?"
        },
        {
            "heading": 2,
            "text": "Is the £1,250 cash increase a bonus or a one-off?"
        },
        {
            "heading": 2,
            "text": "How much will consultants and salaried GPs receive?"
        },
        {
            "heading": 2,
            "text": "Is the pay increase covering all salaried staff in general practice? "
        },
        {
            "heading": 2,
            "text": "How much will dentists receive?"
        },
        {
            "heading": 2,
            "text": "How much will senior managers receive?"
        },
        {
            "heading": 2,
            "text": "How is this being funded?"
        },
        {
            "heading": 2,
            "text": "Which existing budgets will this this come from?"
        },
        {
            "heading": 2,
            "text": "Will you continue to negotiate with the unions on pay?"
        },
        {
            "heading": 2,
            "text": "How much will Agenda for Change staff receive?"
        },
        {
            "heading": 2,
            "text": "Have Agenda for Change staff received a smaller pay rise by agreeing a deal?"
        },
        {
            "heading": 2,
            "text": "How do pay review bodies work?"
        }
    ]
}