{
    "url": "https://ipo.blog.gov.uk/2023/07/14/serving-up-aces-at-wimbledon/",
    "title": "Serving up aces at Wimbledon",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "AI",
        "Innovation",
        "IPO",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-07-14T16:15:21+01:00",
    "content": [
        {
            "text": "Summer has arrived and with it comes one of the most fruitful times of year for sporting events."
        },
        {
            "text": "This weekend will be the final of one of the most iconic tennis tournaments in the world, Wimbledon. It's also another reason to eat some delightful British strawberries."
        },
        {
            "text": "In keeping with tradition, the Wimbledon women’s final will be played on Saturday 15 July and the men’s final on Sunday 16 July."
        },
        {
            "text": "It’s a sporting event that’s been on my ‘to do’ list for years and I’m definitely going to make next year my Wimbledon year! In the meantime, I've been having a look at some of the innovation that’s making the tournament go with a swing."
        },
        {
            "heading": 2,
            "text": "Technology boom"
        },
        {
            "text": "A lot has happened in the world of tennis since Major Walter Wingfield was granted a patent on 23 February 1874 for a 'new and improved portable court for playing the ancient game of tennis', which also included rules on how to play the game."
        },
        {
            "text": "Major Wingfield was a pioneer in the invention and development of lawn tennis. Spencer Gore won the first gentlemen’s single title back in 1877 with a simple tennis racket made from heavy wood."
        },
        {
            "text": "Today, a patent search on the term ‘tennis racket’ will bring up over 17,000 results. Each result represents an inventor who has applied their creativity and expertise to make innovative changes and improvements to the game."
        },
        {
            "text": "Gone are the days of the heavy wooden rackets, which have changed in both shape and material over the past 100 years. They are now made from a variety of carbon composites, incorporating shock and vibration-absorbing elements."
        },
        {
            "text": "The tennis racket isn’t the only equipment to have been developed over the years. The humble tennis ball dates back to 1844. The first ball to be used in lawn tennis was invented by Charles Goodyear who was granted a patent on 15 June 1844. He was a pioneer in developing vulcanised rubber. Since then, there have been many adaptations, including making them fluorescent yellow to increase visibility."
        },
        {
            "text": "Did you know, British sports equipment brand Slazenger has had successful relations with the club since 1902 and will supply 54,250 balls for this year's tournament? Each of them will be tested for weight, bounce and compression- a job that sounds incredibly therapeutic to me."
        },
        {
            "heading": 2,
            "text": "The IP in tennis "
        },
        {
            "text": "Wimbledon was founded on 23 July 1868 as The All England Croquet Club."
        },
        {
            "text": "Now known as the All England Lawn Tennis & Croquet Club (Wimbledon) Limited (AELTC for short), it has registered a remarkable 73 registered trade marks over the years in the UK alone, 63 of which are still live.  I was able to find this after a quick search on the IPO’s ‘search for a trade mark’ page."
        },
        {
            "text": "When establishing a brand, registering a trade mark is key to helping customers distinguish your products and services from those of your competitors. Once registered, a trade mark lasts 10 years before it needs to be renewed and you can register words, sounds, logos, colours or a combination of any of these."
        },
        {
            "text": "The first mark registered by The AELTC was ‘The Wimbledon’ (registered on 19 November 1884) which is still in force today. However, Wimbledon’s well-known purple and green colour combination has only been protected as a registered trademark in the UK since 2016."
        },
        {
            "heading": 2,
            "text": "AI-powered commentary"
        },
        {
            "text": "The commentary has drastically changed from the first radio broadcast at Wimbledon on 29 June 1927, with coverage now across multiple television channels, online and on apps."
        },
        {
            "text": "Artificial intelligence has also found its way to Wimbledon."
        },
        {
            "text": "IBM has been the Official Technology Partner of The Championships for more than 30 years. This year they have introduced the latest innovations in data, analytics, and high-performance computing to the commentary, providing fans with AI-generated insights and world-class digital experiences."
        },
        {
            "text": "If you think about it, there are 18 championship courts playing up to 3-4 matches a day, so keeping track of the highlights and results is a challenge in itself. I’m sure the new technology, which helps fans engage with the tournament simultaneously, will be welcomed by all."
        },
        {
            "text": "While I'm watching the games I see a huge number of people involved in bringing this event to life. The tennis players, umpires, coaches and grounds people all play an important and visible role but for me it's the inventors behind the innovation that deserve recognition as well - the IP behind the game."
        },
        {
            "text": " "
        }
    ]
}