{
    "url": "https://educationhub.blog.gov.uk/2023/07/space-engineering-degree-apprenticeship-we-have-liftoff/",
    "title": "Space engineering degree apprenticeship – we have liftoff!",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-07-14T10:33:28+01:00",
    "content": [
        {
            "text": "All systems are go for a new degree apprenticeship, which will launch people of all backgrounds into a fascinating career in space engineering."
        },
        {
            "text": "Apprentices on the new Level 6 Space Systems programme will access high quality training in the space industry while earning a salary. What’s more, they’ll get a Bachelor of Science (BSc) degree in space engineering on completion."
        },
        {
            "text": "Here we tell you everything you need to know about the brand-new apprenticeship."
        },
        {
            "heading": 3,
            "text": "What is the space degree apprenticeship?"
        },
        {
            "text": "From learning about spacecraft manufacturing to testing satellites, apprentices will have a leading role in the development of space hardware and ground support equipment."
        },
        {
            "text": "As with all degree apprenticeships, apprentices on the Space Systems programme will study towards a degree while working. This means they will get invaluable industry experience and earn a salary at the same time, without needing to take out a student loan."
        },
        {
            "text": "Space engineering apprentices will work for Airbus and earn their degree through the University of Leicester, with access to specialist facilities and world-class expertise at the nearby Space Park Leicester."
        },
        {
            "heading": 3,
            "text": "Why are you introducing the space degree apprenticeship? "
        },
        {
            "text": "This apprenticeship in will open up more opportunities for young people to build rewarding careers in the space industry, regardless of background, by creating opportunities for people to work in the UK’s world-leading space industry, including for global aerospace companies, space agencies or institutions including universities and technology research and development laboratories."
        },
        {
            "text": "Space technology is vital for monitoring and tackling climate change, connecting people across the world, and growing our economy. This new degree level apprenticeship will help train the space engineers and industry leaders of the future, while growing the country’s thriving space sector."
        },
        {
            "heading": 3,
            "text": "When will the space degree apprenticeship be available?"
        },
        {
            "text": "Applications open in September for this programme."
        },
        {
            "text": "Successful applicants will start work for Airbus and begin their degree training in September 2024."
        },
        {
            "heading": 3,
            "text": "Who is eligible for the space degree apprenticeship?"
        },
        {
            "text": "Apprenticeships are open to everyone aged over 16 living in England who are not in full-time education."
        },
        {
            "text": "Employers may also have entry requirements for individual programmes – for a degree apprenticeship this typically could include A-Levels or a particular number of UCAS points."
        },
        {
            "heading": 3,
            "text": "How do I apply for the space degree apprenticeship?"
        },
        {
            "text": "As with all apprenticeships, applications for the space degree apprenticeship will be direct with the employer."
        },
        {
            "text": "Applications open in September."
        },
        {
            "text": "You can also now search for degree apprenticeships via the Find an Apprenticeship website or UCAS."
        },
        {
            "heading": 3,
            "text": "What other degree level apprenticeships are available?"
        },
        {
            "text": "Degree apprenticeships are available in sectors such as nursing, science or engineering. Since 2014, more than 188,000 people have started a degree apprenticeship programme since they were first introduced in 2014."
        },
        {
            "text": "To name a couple of examples, while solicitor apprenticeships are already available and plans for doctor apprenticeships are currently being drawn up in collaboration with the NHS."
        },
        {
            "text": "Degree apprenticeships offer an alternative to a traditional 3-year degree, with apprentices earning a median salary of over £34k after completion, while avoiding paying tuition fees."
        },
        {
            "text": "You apply to degree apprenticeships direct with the employer. You can now search for degree apprenticeships via the Find an Apprenticeship website or via UCAS."
        },
        {
            "text": "Applying for a degree apprenticeship is similar to applying for a job. This means that unlike with university courses, you can apply for degree apprenticeships at any time."
        }
    ]
}