{
    "url": "https://forestrycommission.blog.gov.uk/2023/07/14/taking-action-for-nature-recovery-and-a-more-wooded-landscape/",
    "title": "Taking action for nature recovery and a more wooded landscape",
    "authors": [
        "Kate Tobin and Mark Stevenson"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-07-14T10:35:47+01:00",
    "content": [
        {
            "text": "At the end of June, government announced new funding for local authorities developing Local Nature Recovery Strategies. The Strategies create an opportunity to accelerate action for nature – for wildlife, climate and people."
        },
        {
            "text": "Woodlands and trees are havens for wildlife and new tree planting or woodland establishment, which is carefully sited and appropriately managed, will increase their wildlife value, whilst improving water and air quality, reducing flood risk, helping to mitigate and adapt to climate change, as well as providing green jobs and home-grown timber."
        },
        {
            "text": "Local Nature Recovery Strategies are a new approach to planning for nature which will build consensus on priorities, opportunities and actions we need to take for nature and nature-based solutions. The Strategies will be developed over the next two years. They will link with new duties and funding, such as Biodiversity Net Gain, to direct action on the ground."
        },
        {
            "text": "The Forestry Commission protects, expands and promotes sustainable management of woodlands in England. We are committed to supporting the development of these Strategies, alongside Natural England and the Environment Agency, and helping local authorities identify opportunities for woodland and trees to benefit wildlife and to provide wider social and environmental benefits."
        },
        {
            "heading": 2,
            "text": "Improving the contribution of woods and trees to biodiversity and other environmental outcomes"
        },
        {
            "text": "The government has set statutory targets to halt biodiversity loss and to increase tree cover in England. New woodland and trees contribute directly to the UK’s carbon balance, helping us in our efforts to reach net zero. The protection, management and creation of all types of woodland will need to play a role in delivering for nature if we are to tackle the twin challenge of climate change and biodiversity loss. Our ancient and semi-natural woodlands are rich in wildlife and build up long term carbon stores, while our faster-growing mixed woodlands bring wildlife to the wider countryside and sequester carbon quickly."
        },
        {
            "text": "Hedges and field trees are a vital part of our rural landscape and urban trees are increasingly valued as an asset to our cities and towns. Our incentives reflect this, with the Local Authority Treescapes Fund and the Urban Tree Challenge Fund carefully designed to support the establishment of trees outside woodlands."
        },
        {
            "text": "Woodland creation is central to the government’s goal of establishing a resilient network of places to support thriving plants and wildlife. We have supported the establishment of 10,000ha of woodland in England over the last 5 years, around 80% of which has been broadleaved."
        },
        {
            "text": "Management of our ancient and native woodlands is vital too, to create light and structure and to control the impact of invasive plants and rising deer and squirrel populations. Deer will browse out rare wildflowers and regenerating trees, while squirrel will strip the bark from growing trees – especially native broadleaved species - preventing them from reaching maturity. Evidence from the British Trust for Ornithology and others tells us that lack of light and structure in woodlands has been a key factor in loss of woodland species, such as lesser spotted woodpecker, willow tit, purple emperor or white admiral butterflies, whose complex lifecycles depend on just the right combination of scrub, flowers and mature trees."
        },
        {
            "text": "More, and better management of, commercially productive mixed conifer woodlands is equally important. Forest design and management to modern standards integrates sunny spaces for wild plants and pollinators, structure for nesting and foraging, tree species diversity to promote resilience and retention of dead wood habitat and ancient trees. Establishing and managing productive woodland to UK Forestry Standard – the baseline for all new woodland, overseen by the Forestry Commission - ensures nature conservation is integrated from the start. All our incentives require this standard to be met."
        },
        {
            "heading": 2,
            "text": "Nature recovery and the nation’s forests"
        },
        {
            "text": "Across the nation’s forests, Forestry England manages more land than any other public or private body, with biodiversity a key pillar in our decision-making. Within the 252,000 hectares of the nation’s forests, there are 68,000 hectares of Sites of Special Scientific Interest (SSSIs), 94% of which are in favourable or recovering condition. Over 10 years ago, Forestry England committed to restore all plantations on ancient woodland sites back to semi-natural woodland habitat, a decades-long endeavour which is well underway."
        },
        {
            "text": "In 2022, a commitment was made to restore an additional 6000 hectares of wild areas within our forest landscapes. Forestry England have hosted the re-introduction of the sea eagle on the Isle of Wight, returned water voles to Kielder and worked to maintain populations of threatened butterflies, such as the wood white in the Western Weald. These successes and future plans should be integrated into local nature recovery strategies, recognising that the nation’s forests play a key part in nature recovery at scale."
        },
        {
            "heading": 2,
            "text": "How is the Forestry Commission supporting the development of Local Nature Recovery Strategies?"
        },
        {
            "text": "The Chair of the Forestry Commission, Sir William Worsley, welcomes Local Nature Recovery Strategies and believes they will greatly support our ambition for a more wooded landscape, richer in wildlife and providing a range of other important benefits for wider society."
        },
        {
            "text": "Our new Nature Recovery Advisors, in our Area Teams, will work closely with Natural England and Environment Agency colleagues to help local authorities produce their Local Nature Recovery Strategies. We will provide advice, data and evidence so that local nature recovery strategies identify the best opportunities for woodland management, restoration and creation, for wildlife and for nature-based solutions. We are working hard to improve and share our data with local authorities to help them identify where woodland and trees will make the most difference."
        },
        {
            "text": "We are also considering our own incentives and delivery of nature recovery to be ready to align with the aspirations set out in the Strategies. We already support woodland creation and management across the country with a range of different incentives, including our flagship England Woodland Creation Offer which has a supplement to boost nature recovery, and with our Woodland Improvement grants under Countryside Stewardship. We are working with our partners to use mechanisms like Biodiversity Net Gain and the £640 million Nature for Climate Fund to restore nature across the country. LNRSs will be a way to bring all these mechanisms together."
        }
    ]
}