{
    "url": "https://environmentagency.blog.gov.uk/2023/07/14/taking-a-holistic-approach-to-coastal-habitat-restoration/",
    "title": "Taking a holistic approach to coastal habitat restoration",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-07-14T08:58:30+00:00",
    "content": [
        {
            "text": "By Rob Bradburne, Environment Agency Chief Scientist "
        },
        {
            "text": "Fresh approaches"
        },
        {
            "text": "Restoring saltmarshes, seagrass meadows and native oyster beds is of importance to many different people and will require coordinated efforts across a range of sectors to reverse historic declines and make the most of today’s opportunities."
        },
        {
            "text": "This week I spoke at the two-day Restoring Meadow, Marsh and Reef (ReMeMaRe) conference in Scarborough, where more than 250 delegates from a range of organisations convened to hear about and discuss some of the latest developments, progress, partnerships, research and understanding of estuarine and coastal restoration. "
        },
        {
            "text": "Among the projects highlighted were Steart Marshes in Somerset; Medmerry Nature Reserve in West Sussex; and Fingringhoe Wick Nature Discovery Park in Essex. "
        },
        {
            "text": "These vital projects are helping to realise restoration targets, address centuries of decline of important habitats, support healthy and resilient seas and contribute towards achieving good biological and chemical status in transitional estuarine and coastal waterbodies. "
        },
        {
            "text": " "
        },
        {
            "text": "Catalyst for change "
        },
        {
            "text": "One of my favourite places in the UK is blessed with some saltmarsh. Cuckmere Haven in East Sussex holds so many happy memories for me as a child, and I’m sure many of you reading this will have places that are similarly special to you. This is so often where restoration projects begin, and this is why so many are successful – because of the passion of people for nature in places they love.  "
        },
        {
            "text": "I first started leading teams working to improve the incorporation of the value of nature into decisions and plans made by government and others back in 2008. This work was then given a real boost by the National Ecosystem Assessment and white paper of 2011, and now we have new legislation in place that drives us towards this much more joined up approach to working with nature: the Environment Act and Environmental Improvement Plan. "
        },
        {
            "text": "This new legal and administrative system has biodiversity targets that will require the expansion of nature restoration efforts. But it also sets ambitious plans for other improvements, such as air and water quality and achieving Net Zero. Restoring coastal ecosystems interacts with many of these wider environmental improvements. Understanding these interactions makes communication of new project ideas and building partnerships and business cases more effective, engaging a broader range of partners to support more ambitious work and pull in more funding. "
        },
        {
            "text": " "
        },
        {
            "text": "Environmental systems"
        },
        {
            "text": "Environmental change is definitely a challenge for marine and coastal systems.  But it also can present opportunities. Faced with a changing climate, these ecosystems can all be part of necessary adaptation responses, and even part of mitigation action.  So new opportunities may arise to invest further in them.  But to do this wisely, we must ensure there is a joined-up plan around coastal restoration which takes into account efforts in the catchment inland and the interactions of ecosystems along the coast and out to sea."
        },
        {
            "text": "It’s not just the environment that is changing though. So is the economy of the coast, with new industries replacing old, and people are relocating along the coast, using it in different ways. All of this creates opportunities for when change can happen, and we need to be ready for that, and make sure nature is part of the decisions about how we use land around our coasts so it is fit for the 21st Century."
        },
        {
            "text": "On a recent visit to Teesside, I was given real hope seeing just how fast a saltmarsh can spring back into life over just a few years when given the opportunity, returning to supporting a range of coastal plants and even commercially important juvenile fish."
        },
        {
            "text": "My team in the Environment Agency’s Chief Scientist’s Group is working on the data for and economics of Natural Capital, so it is easier for everyone to incorporate this into their forward business plans to make the case for working with natural systems."
        },
        {
            "text": "If we work with these different systems, we can evolve our approach to the work we are doing around the coast, such as providing more scope to look for new projects to meet the growing demands from government and private sector investors and collaborators. This will give us the opportunity not only to work more smartly, with greater understanding at our fingertips, but also to think about more projects that join up along catchments or along coastlines, which in turn can meet wider objectives in areas such as regeneration, coastal protection or even tourism."
        },
        {
            "text": "A way forward"
        },
        {
            "text": "I hope that the ReMeMaRe initiative, led by the Environment Agency and aiming to restore at least 15% of these habitats in the next 20 years, will be a catalyst for creating bigger, better and more joined up natural areas delivering the Lawton vision along our coasts – which I think is as relevant today as when it was written in 2010. We can also demonstrate the vision of the Dasgupta Review too, striking a new balance which incorporates nature into our economic activities, and gets us on a more sustainable footing that grows our natural capital alongside other forms of capital that we develop."
        },
        {
            "text": "To help us with achieving these aims, through ReMeMaRe the Environment Agency is investing £1.8m in Championing Coastal Coordination over the next three years with 20 projects receiving funding in 22/23."
        },
        {
            "text": "To help us adapt, the Environment Agency is also investing £120m in compensating and restoring estuarine and coastal habitat that will be lost due to a combination of maintaining flood defences, rising sea levels and resulting coastal squeeze."
        },
        {
            "text": "The Government is investing £200m for the Flood and Coastal Innovative programmes to support local places including coastal communities. It includes the £36 million Coastal transition accelerators programme which will support communities in areas at significant risk of coastal erosion to transition and adapt to a changing climate."
        },
        {
            "text": "We live in a period of much change – I am keen that we do all we can to make that a change for the better for people and nature in places along our precious coasts."
        },
        {
            "text": "Follow the Environment Agency on Twitter, and sign up for email alerts."
        }
    ]
}