{
    "url": "https://charitycommission.blog.gov.uk/2023/07/14/trustee-and-public-trust-research/",
    "title": "Trustee and public trust research",
    "authors": [
        "Paul Latham"
    ],
    "categories": [
        "Public Trust",
        "Research"
    ],
    "pub_date": "2023-07-14T13:18:10+01:00",
    "content": [
        {
            "text": "It has long been a priority for the Charity Commission to learn more about the public’s attitudes towards charities and about trustees’ understanding of their role."
        },
        {
            "text": "Tracking the attitudes, perceptions and knowledge of these two key groups helps us to understand our success as a regulator and shape our plans for the future."
        },
        {
            "text": "Our annual research relates closely to our statutory objectives - which include increasing public trust and confidence in charities; promoting compliance by charity trustees with their legal obligations; and enhancing the accountability of charities to donors, beneficiaries and the wider public."
        },
        {
            "text": "And this year’s findings are broadly reassuring in this context."
        },
        {
            "text": "Whilst public trust in some other institutions has fallen or flatlined, charities continue to be well regarded and highly trusted – ranking second only to doctors - and the public continues to take reassurance from charity registration. Trust continues to be closely linked to the public seeing a high proportion of funds used for charitable activity, that charities are making the difference that they promise to make, and that the way they work is consistent with charitable values.  Consistent with our earlier research on charity transparency, the public is more inclined to trust charities that are small, local or where they feel a personal connection to the cause. Trust in charities is not uniform and remains higher in more diverse and affluent urban communities."
        },
        {
            "text": "Charities have been very visible, including in supporting the most vulnerable, during current cost of living challenges, and of course throughout the pandemic. This appears to have been positively recognised, particularly by those who have benefitted from charitable support."
        },
        {
            "text": "Whilst high, trust has not returned to its pre-2014 levels. The public’s confidence was dented by several high-profile scandals involving household name charities; in 2018 trust in charities fell below trust in the average person in the street. For some people, lingering doubts remain, but charities’ recovery to second most trusted group overall is significant."
        },
        {
            "text": "In these challenging times, trustees continue to feel confident that they understand what the public expects of them. Demonstrating prudent stewardship of funds is more critical than ever. Both trustees and the public generally feel that charities should avoid excessive risk and focus on their core purposes when deciding how to spend funds. Equally, though, the public feels charities should not be so cautious that they end up simply accumulating money."
        },
        {
            "text": "As for the Charity Commission, we have set out an ambition to be an expert regulator that is fair, balanced, and independent. And so it is reassuring that the great majority (81%) of trustees who had been in contact with us for advice or permission felt that they were treated fairly. Trustees also expect, and in many cases perceive, balance in the Commission’s regulatory approach. There was also a consensus that we are not unduly influenced by external forces; 78% agreed that our main influence is - rightly - charity law."
        },
        {
            "text": "The overwhelming majority (95%) of trustees also remain firmly confident that the Commission will deal appropriately with wrongdoing and harm once it is identified. They are also more confident than in 2020 that the Commission can uncover wrongdoing in the first instance."
        },
        {
            "text": "It is pleasing that trustees’ awareness of our accessible 5-minute guides has increased.  Those who have used the Commission guidance also found it to be helpful (96% of trustees). Those who do access our guidance are also more likely to correctly answer questions about their responsibilities such as dealing with conflicts of interest, making sure the charity’s funds are used properly, and making sure charity files accounts on time. However, there are still too few trustees who feel they need to engage with the support we provide, reinforcing the importance of the further awareness raising and improvements to guidance we have committed to in our 2023/24 Business Plan."
        },
        {
            "text": "There is much to be positive about from this research - but it’s also clear that there is no room for complacency, for charities, or for us as regulator.  We know that trust is hard earned and can very easily be lost – and no charity has an innate right to trust or support from the public."
        }
    ]
}