{
    "url": "https://defradigital.blog.gov.uk/2023/07/14/why-being-a-social-mobility-ambassador-is-important-to-me/",
    "title": "Why being a social mobility ambassador is important to me",
    "authors": [
        "Leyla Kee-McParlin"
    ],
    "categories": [
        "Defra content design",
        "Defra digital"
    ],
    "pub_date": "2023-07-14T07:31:54+01:00",
    "content": [
        {
            "text": "As the world prepares to celebrate World Youth Skills Day, Lead Content Designer Leyla Kee-McParlin reflects on her experience of supporting the Ministry of Justice (MoJ) Social Mobility Ambassadors Schools Programme, and what it’s given her, and explains what networks are doing both in Defra and across government to improve career progression in the Civil Service for those from low socio-economic backgrounds."
        },
        {
            "text": "It was Social Mobility Awareness Day very recently, an opportunity for organisations across the UK to get involved in wider conversations about social mobility and to encourage action that brings about positive change."
        },
        {
            "heading": 2,
            "text": "What social mobility is and how it has been important to me"
        },
        {
            "text": "The Social Mobility Commission (SMC) defines social mobility as “the link between a person’s occupation or income and the occupation or income of their parents. Where there is a strong link, there is a lower level of social mobility. Where there is a weak link, there is a higher level of social mobility.” Simply put, it’s our starting point in life and where we end up."
        },
        {
            "text": "It’s a big part of my story. I still live in the area I grew up in. My family is from the Anfield area of Liverpool, but I was born in Birkenhead, which is an old shipbuilding town nearby, on the other side of the River Mersey."
        },
        {
            "text": "I was raised on a council estate. During the early 1990s recession, my family lived in one single room. We shopped at budget supermarkets and charity shops before they were more widespread. It was only when my mum and I watched the recent Marcus Rashford documentary about food poverty together that she revealed, like Marcus’s mum, very often she and my dad would either have small portion sizes or miss meals completely so that we would have proper meals."
        },
        {
            "text": "I still consider myself lucky. I’ve had good people around me. I went to university as a first-generation student, while living at home and working in the social care sector. I was happy to throw myself into anything when it came to unpaid work experience. Want a brew? I’m here. Want me to deal with some unwanted calls? You got it. Need a package delivered? I’m your person! If I could get a weekly shop in for next to nothing, and I had a couch to sleep on, let me come and work for you."
        },
        {
            "text": "I’ve had a “squiggly career”, and I’ve also been on Jobseeker’s Allowance, but one opportunity after another has led me to this point right now. The thing is, I’m not the only one and, this is why it’s important for us to talk about social mobility."
        },
        {
            "heading": 2,
            "text": "“Navigating the labyrinth”"
        },
        {
            "text": "I eventually landed here in the Civil Service. It's a brilliant place to find people with similar backgrounds, learn and join the conversation. There’s an important report from 2021 called ‘Navigating the labyrinth: socio-economic background and career progression in the Civil Service’ which says:"
        },
        {
            "text": "“there is no ‘silver bullet’ to solving diversity and inclusion... employers should embrace a layered approach to drive change... Civil servants from disadvantaged backgrounds are significantly under-represented in the Civil Service, and even when they ‘get in’ they struggle to ‘get on'.’”"
        },
        {
            "text": "The data was quite a sobering read, it included:"
        },
        {
            "text": "The Civil Service employs nearly 500,000 people, so there’s lots to do when it comes to improving the situation for future civil servants and progress for those already here."
        },
        {
            "heading": 2,
            "text": "Finding the networks out there: Defra Social Mobility Network and Ministry of Justice Social Mobility Ambassadors"
        },
        {
            "text": "When I came to Defra in 2021, I found the Defra Social Mobility Network. They were amazing and regularly organised things like listening circles, workshops and seminars from visiting speakers like Professor Sam Friedman and the Social Mobility Commission (SMC). There’s a lot of support for the network and especially from Defra senior civil servants who are active members in it with their own personal stories, which is really encouraging."
        },
        {
            "text": "This network led me to the Ministry of Justice’s work leading a huge cross-government social mobility awareness and outreach programme. It brings together a huge number of civil servants who are passionate advocates for social mobility. They organise work experience placements like the Graduate Aspiration Programme, and a mentoring programme called Catapult that has nearly 2,500 people involved as both mentors and mentees."
        },
        {
            "heading": 2,
            "text": "What I’ve learned from the MoJ Social Mobility Ambassadors Schools Programme"
        },
        {
            "text": "The report above mentioned “layers” and one of these layers is school outreach work, organised by MoJ."
        },
        {
            "text": "This outreach work has tangible impacts to support young people and their teachers or tutors with confidence and aspiration. A brief part of my “squiggly career” was secondary school teaching, so I joined the programme and got back into the classroom to work with young people in my home areas of Birkenhead and Liverpool."
        },
        {
            "text": "I’ll help out with everything from careers fairs, mock interviews and speed networking. My most recent placement has been with Birkenhead Park School, and I’ve really enjoyed going in to talk to them about what I do at Defra as well as answer questions from the students and share my stories."
        },
        {
            "text": "I’ve learned three important things:"
        }
    ]
}