{
    "url": "https://lifeathmrc.blog.gov.uk/2023/07/14/world-youth-skills-day-developing-skills-at-hmrc/",
    "title": "World Youth Skills Day: developing skills at HMRC",
    "authors": [
        "Sarah"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-07-14T14:50:30+00:00",
    "content": [
        {
            "text": "The year's theme for 'World Youth Skills Day' is 'skilling teachers, trainers and youth for a transformative future.' It aims to highlight the importance of teachers in supporting young people and equipping them with the skills they need for the future. "
        },
        {
            "text": "At HMRC, we offer a whole host of opportunities for young people to gain new skills that can help grow their careers and build a future. We asked apprentice, Anastasia, what skills they have developed at HMRC, how these skills will help further their career, and how their mentors and leaders have supported them. "
        },
        {
            "heading": 3,
            "text": "What do you think is the most valuable skill you've gained during your apprenticeship? "
        },
        {
            "text": "I think the most valuable skill I have learnt during my apprenticeship is effective communication. "
        },
        {
            "heading": 3,
            "text": "Which skills would you like to develop further? "
        },
        {
            "text": "One skill I would like to develop further is managing other people. People management is a skill that will help grow my career and create more opportunities for promotion. "
        },
        {
            "heading": 3,
            "text": "What are your plans for the future and which skills will help you get there? "
        },
        {
            "text": "My plan for the next 6 months is to continue in my current role, alongside keeping up to date with latest technology. "
        },
        {
            "text": "My plan over the next 5 years is to get more involved with a social mobility programme at HMRC. My career started through an outreach programme and I would like to support other people to find roles though the programme.  "
        },
        {
            "heading": 3,
            "text": "How has HMRC helped you gain new skills? "
        },
        {
            "text": "My team and my colleagues have been really helpful with providing support and guidance to develop my skills. HMRC has helped me understand my neurodiverse conditions in a workplace environment, and has enabled me to work on my communication and language development. "
        },
        {
            "heading": 3,
            "text": "How have your mentors and leaders supported you to help gain the skills you need?"
        },
        {
            "text": "They have taken the time to get to know me and learn what works best for me when I’m learning. During my apprenticeship they have given me plenty of advice and I feel comfortable and can ask for help when I needed it. My mentors have also introduced me to other people across the organisation, which has allowed me to build networking skills. "
        },
        {
            "heading": 3,
            "text": "What would your advice be to someone considering an apprenticeship at HMRC? "
        },
        {
            "text": "If I could offer one piece of advice it would be to make sure the apprenticeship links directly to your job, and always ask for help if you need it. If you can, seek help from someone who has previously done the same apprenticeship as you, as they will have a lot of knowledge to share. "
        },
        {
            "heading": 3,
            "text": "Opportunities to learn and grow at HMRC "
        },
        {
            "text": "We have apprenticeship opportunities across many areas in HMRC including digital, legal, finance and more. "
        },
        {
            "text": "Find out more about our learning and development and apprenticeship opportunities. "
        }
    ]
}