{
    "url": "https://gdsgeospatial.blog.gov.uk/2025/11/04/geography-in-the-united-nations-its-not-just-about-where-things-are/",
    "title": "Geography in the United Nations - it's not just about where things are",
    "authors": [
        "Melanie Hutchinson, International Geospatial Lead, GDS"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2025-11-04T11:30:51+00:00",
    "content": [
        {
            "text": "Discover how the UK’s geospatial experts are shaping global policy at the UN, tackling challenges from climate action to governance. Melanie Hutchinson, International Geospatial Lead in GDS, shares insights from her secondment in New York, revealing the impact and importance of international collaboration in geospatial information management."
        },
        {
            "text": "When people hear “geography” and “the United Nations” in the same sentence, they probably imagine a bunch of experts poring over maps in a windowless room, arguing about borders or the best way to get from A to B. But as International Geospatial Lead in GDS I get to work with the UN Committee of Experts on Global Geospatial Information Management (UN-GGIM) and I can tell you it’s so much more than that. "
        },
        {
            "text": "The Global Geospatial Family "
        },
        {
            "text": "Every year, the geospatial world’s great and good - think national mapping agencies like our very own Ordnance Survey - descend on New York for UN-GGIM’s annual session. It’s a bit like a family reunion, but with way more acronyms and (possibly) fewer embarrassing stories. We gather to thrash out the big issues: how countries collect, share, and use geospatial data to inform everything from urban planning and public health to disaster response and climate action and how we can build capacity and share knowledge across the globe. "
        },
        {
            "text": "But the work doesn’t stop when the session ends. Throughout the year, UN-GGIM’s work continues, with focussed working groups tackling everything from land registries to marine environments to the mind-bending science of geodesy. The UK is right in the thick of it—chairing, co-chairing, and actively engaging across a whole range of groups both thematic and in the Europe UN-GGIM committee, with input from various government departments and arm’s-length bodies and Ordnance Survey taking a lead. "
        },
        {
            "text": "Why Does the UK Care So Much? "
        },
        {
            "text": "But why does the UK invest so much time and energy in UN-GGIM. The answer is simple: being able to answer the question “where?” is essential to nearly all aspects of people’s lives. Being at the table means we can influence international geospatial policy, maintain the trusted relationships we’ve built over decades (or indeed centuries when you think several of our key organisations in this field, including Ordnance Survey and the British Geological Survey that were founded in 1791 and 1835 respectively), and expand our networks with other member states and organisations. It’s about making sure the UK’s voice is heard, and that we’re shaping the future of global geospatial information and making sure that no one is left behind. "
        },
        {
            "text": "A Year of Change—and Challenge "
        },
        {
            "text": "This year, things took a new turn. In the run-up to the 15th session of UN-GGIM, we decided to second someone (me!) to the UN-GGIM Secretariat. We did this for a number of reasons given the critical role of UN-GGIM "
        },
        {
            "text": "First, the UN is facing a liquidity crisis. Vacant posts aren’t being filled, and the Secretariat is running at about 20% of its usual staffing. That’s a huge strain, especially as demand from member states for new activities keeps growing with the risk that UN-GGIM, a victim of its own success. At the same time, the US has been stepping back from multilateral processes resulting in a much smaller delegation at this year’s session who we have worked extremely closely with over the last 15 years further compounding the impact of a smaller Secretariat.  "
        },
        {
            "text": "All of these factors combined meant that we felt that a UK secondee could provide much-needed support and help us better understand what the state of play. "
        },
        {
            "text": "My Secondment: From London to New York "
        },
        {
            "text": "Given my background of 20 years working in the UN system, I was asked to step in. My mission? To support the Secretariat, deliver on a set of key tasks, and travel to New York to help with final preparations for the 15th session of the UN-GGIM. "
        },
        {
            "text": "So, what did I actually do? Quite a lot, as it turns out! I helped finalise the position paper on the future geospatial information ecosystem, wrapped up the UN-GGIM Strategic Framework 2025–2030 (including compiling survey results and feedback from member states and other stakeholders), and developed a scoping document and draft workplan on climate, environment, and resilience. I also supported the preparation of a global programme for national capacity development and drafted introductory remarks for various agenda items.  The high point was undoubtedly presenting my paper on climate, environment and resilience to the Bureau of UN-GGIM, which sets the direction for UN-GGIM.   "
        },
        {
            "text": "The UN-GGIM 15th Session: Side Events, Presentations, and Plenary Drama "
        },
        {
            "text": "The week kicked off with two days of side events and meetings. The UK spoke at five of these - I attended three. The highlight was the Plenary Meeting of the High-Level Group of the UN Integrated Geospatial Information Framework (IGIF), where I presented on the work of the Comms Group (which the UK Co-Chairs with Indonesia) over the past six months.  This was a critical meeting and focused on roles, responsibilities, and governance across the IGIF, including a new Knowledge and Innovation Centre established in China. These discussions will continue, both within the UK and with key partner countries, in the months ahead. "
        },
        {
            "text": "In the Room Where It Happens "
        },
        {
            "text": "The main session takes place in one of the UNHQ’s grand committee rooms, with 80 member states at the table and others in the gallery. Simultaneous interpretation keeps everyone on the same page, and the sessions are chaired by the Co-Chairs (currently Saudi Arabia, South Africa, and the US).  "
        },
        {
            "text": "The UK delegation is headed by David Henderson, Chief Geospatial Officer at Ordnance Survey and this year he was joined by James Norris, International Lead at Ordnance Survey, Olive Powell, Head of Geospatial at the Office for National Statistics, and me). We shared the 6 UK interventions between, and it was an incredible privilege to speak in the room where it happens, putting the UK’s position into the official record - even my teenage sons actually grunted that it was quite impressive that I had done that, high praise indeed! "
        },
        {
            "text": "Recognition and Reflection "
        },
        {
            "text": "The 15th session was a success. The UK’s contribution, including through my secondment, was publicly acknowledged by several member states and by the Expanded Bureau when I presented my paper on climate, environment, and resilience. My connections with the Secretariat have only deepened, positioning the UK as a trusted partner. "
        },
        {
            "text": "These sessions are invaluable—not just for the formal discussions, but for the informal conversations and connections that happen around them. They give us insight into the challenges and opportunities facing other countries and help us refine our own approach. "
        },
        {
            "text": "Looking Ahead "
        },
        {
            "text": "Now that we’re back, the work continues. We’ve already started deep dives into the outcomes of the 15th session, and we’ll be discussing these with stakeholders through the xHMG+ International Geospatial Network (which the International Geospatial Team facilitates) and beyond. We’re also keeping the conversation going with like-minded countries and considering whether to provide further support to the Secretariat. "
        },
        {
            "text": "Final Thoughts "
        },
        {
            "text": "The past few months have highlighted some big challenges for UN-GGIM: the UN’s liquidity crisis, the shifting role of the US, and the ever-increasing demands on the Secretariat and for geospatial data more broadly. But they’ve also shown the value of international cooperation, the importance of trusted relationships, and the difference that a small and committed team can make on the global conversation and capabilities.  Being part of this work is a privilege—and I’m excited to see where we go next. "
        },
        {
            "text": "You can sign up to get an email notification every time we publish a new blog post. For more information on our work see the GDS gov.uk site, or follow us on  LinkedIn "
        }
    ]
}