{
    "url": "https://moderncivilservice.blog.gov.uk/2025/11/04/increasing-science-and-engineering-capability-across-government/",
    "title": "Increasing science and engineering capability across government",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Data science",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Join a profession",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-11-04T11:38:57+00:00",
    "content": [
        {
            "text": "A guest blog from Professor Dame Angela McLean, Government Chief Scientific Adviser and Head of the Government Science and Engineering Profession."
        },
        {
            "text": "No matter your role or background, I’m delighted to introduce you to the Government Science and Engineering (GSE) Profession, a vibrant cross-government community of people who use science and engineering to improve lives across the UK."
        },
        {
            "heading": 2,
            "text": "What we do"
        },
        {
            "text": "From building and applying scientific knowledge, to conducting critical analyses, generating and evaluating evidence or creating new standards, the breadth of experience within the GSE Profession is vast."
        },
        {
            "text": "It’s hard to think of a policy or operational area that cannot be improved by engaging with science and engineering experts. From AI to public housing, net zero to transport, in every single area there is some element of science and engineering that could make a difference."
        },
        {
            "heading": 3,
            "text": "Who we are"
        },
        {
            "text": "You don’t need to be a scientist or engineer to benefit from what we do. The profession is a diverse cross-government group of people who are connected to science and engineering either by their role, skillset or interests. With around 10,000 members across the civil, public and crown services, we aim to embed science and engineering in government decision making and increase the capability of scientists and engineers across government."
        },
        {
            "heading": 3,
            "text": "Our welcome offer"
        },
        {
            "text": "As part of the Join a profession campaign, we’re inviting you to explore what the GSE Profession has to offer. Our welcome offer includes tailored learning and development, career pathways, and opportunities to connect with a vibrant cross-government community. You’ll find support to gain professional recognition, such as chartership, and take part in initiatives like the Royal Society Pairing Scheme, which brings together scientists, engineers, parliamentarians and civil servants to strengthen evidence-based policymaking."
        },
        {
            "text": "We also host flagship events including Leadership Values masterclasses with senior leaders, Community of Practice meetings, and the STEM Futures programme, a cross-sector partnership enabling placements, mentoring and secondments to promote STEM across government, industry and academia. You’ll find support whether you’re a specialist or simply curious about how science and engineering can enhance your work."
        },
        {
            "text": "To support all our government colleagues, regardless of their background, we’ve developed products to:"
        },
        {
            "heading": 3,
            "text": "Why join the GSE profession?"
        },
        {
            "text": "Joining the GSE Profession means:"
        },
        {
            "text": "So, if you’re looking for a community that values curiosity, rigour and impact, come and join us. You’ll be welcomed, supported and inspired. Government Science and Engineering is one of the 32 government professions. You can find out more on the Join a profession page or on the GSE blog. We look forward to working with you."
        }
    ]
}