{
    "url": "https://ipo.blog.gov.uk/2025/11/04/sparking-innovation/",
    "title": "Sparking innovation ",
    "authors": [
        "Meg Davies",
        "Kelsey Jones"
    ],
    "categories": [
        "Enforcement",
        "Innovation",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-11-04T12:45:18+00:00",
    "content": [
        {
            "text": "Bonfire Night is one of our favourite autumn traditions. There’s something magical about gathering with friends and family, wrapped up warm, sipping hot chocolate, and waiting for that first firework to burst into the sky. But as dazzling as they are, safety is key.  "
        },
        {
            "text": "Intellectual property (IP) is at the forefront of this, with patents and trade marks protecting the products – but some products bypass these protections entirely. Counterfeit and substandard fireworks exist that don’t meet safety regulations. In this blog, we share the IP that helps make fireworks night both dazzling and safe, and our top tips to make sure you know what you’re getting. "
        },
        {
            "heading": 3,
            "text": "Popping patents "
        },
        {
            "text": "Fireworks innovation has been protected through patents for over a century, with technical ingenuity behind displays. These patents cover everything from safety devices to the fundamental mechanics of how fireworks function. "
        },
        {
            "text": "Fireworks that spin are impressive inventions, and patent GB189901879A, filed in 1899, covered one such rotary firework. Designed to spin like a top when ignited, this device rotates rapidly on its vertical axis when lit, creating a \"fiery spinning top\", similar to the impressive Catherine wheel. "
        },
        {
            "heading": 3,
            "text": "Patented safety "
        },
        {
            "text": "As well as creating fireworks that look great, many patents focus on improving the safety of fireworks. Patent GB938811A, filed in 1963, introduced a universal firework holder. Made from helically coiled wire, it could grip poles of various sizes and accommodate different firework types, helping you to light your fireworks safely. In 1970, GB1202389A revolutionised rocket design by making them stickless and wingless, reducing the hazards posed by falling sticks and wings. "
        },
        {
            "text": "As well as the fireworks in the sky, sparklers are a firm bonfire night favourite – but there are still associated risks. In 1974, GB1362712A introduced a safer version of the sparkler, made of a safer composition of chemicals and a holder that extinguishes automatically.  "
        },
        {
            "heading": 3,
            "text": "Trade marks that light up the market "
        },
        {
            "text": "While patents protect technical innovations, trade marks identify the commercial origin of good and services. In the fireworks industry where safety is paramount, recognising where the goods originate from can provide vital reassurance to customers. Trade marks such as those for well-known companies like Black Cat and TNT Fireworks can help ensure customers that they’re purchasing from a reputable source with established safety standards.  "
        },
        {
            "heading": 3,
            "text": "Burned by unsafe or fake fireworks "
        },
        {
            "text": "Patents and trade marks play an important role in fireworks safety, yet these safeguards are only effective when you're purchasing authentic products from legitimate sources. Criminals will exploit any opportunity to make money. No product is off limits - including fireworks!  "
        },
        {
            "text": "If fireworks haven’t been through proper safety checks – and counterfeits usually haven’t - the results could be catastrophic.  "
        },
        {
            "heading": 3,
            "text": "What are the risks?"
        },
        {
            "text": "Unregulated fireworks can fail unpredictably. They might explode too soon, fall over, or misfire. This can cause:  "
        },
        {
            "heading": 3,
            "text": "Counterfeit vs substandard fireworks: what’s the difference?  "
        },
        {
            "text": "You may be wondering how to spot a counterfeit firework. It’s important to know that counterfeit doesn’t always mean substandard, and being substandard doesn’t necessarily mean counterfeit. Here’s what each term means:  "
        },
        {
            "text": "counterfeit fireworks: these imitate a genuine brand but are fake. They are designed to look like trusted products but are produced illegally.  "
        },
        {
            "text": "substandard fireworks: poor quality or untested products that don’t meet safety standards. They may not claim to be a specific brand but still pose serious risks.  "
        },
        {
            "text": "These categories aren’t exclusive - both are dangerous and often go hand in hand. A counterfeit firework will rarely be safety tested or made with the same care that a legitimate business would take.  "
        },
        {
            "text": "Counterfeit fireworks can mislead buyers into thinking they’re safe because they look like a known brand."
        }
    ]
}