{
    "url": "https://dataingovernment.blog.gov.uk/2026/02/27/securing-personal-data-across-government/",
    "title": "Securing personal data across government",
    "authors": [
        "James Freeland - Senior Data and Security Architect, GDS"
    ],
    "categories": [
        "Data protection",
        "Data Standards",
        "Guidance"
    ],
    "pub_date": "2026-02-27T13:13:49+00:00",
    "content": [
        {
            "text": "Government is entering a new phase of modernising public services. Central to this plan is making it easier for different government departments to safely share information and use common digital systems. This helps services work better together, enabling faster, more joined-up support for citizens and civil servants who need it. "
        },
        {
            "text": "Over the past year, the Government Digital Service (GDS) has created a roadmap for modern digital government showing how new digital tools will improve services across government. The aim is to make everyday tasks, such as accessing benefits, renewing documents, or finding information, quicker, simpler, and more reliable. "
        },
        {
            "heading": 3,
            "text": "Building on strong foundations "
        },
        {
            "text": "The Data Protection Act 2018 and UK GDPR provide robust safeguards for all personal data held by government. These protections apply equally to everyone, ensuring that personal information is handled lawfully, fairly and securely. "
        },
        {
            "text": "To support the government's ambition for better joined-up services, the Office of the Chief Digital Officer (OCDO) has published the Principles for Securing Personal Data in Government Services. This guidance builds on existing data protection law to provide practical direction for teams developing a system or service that processes or shares personal data. "
        },
        {
            "heading": 3,
            "text": "Why we developed these principles "
        },
        {
            "text": "When government departments share data effectively, they can deliver better outcomes, more efficient public services, and reduced burden on citizens who shouldn't need to provide the same information multiple times. "
        },
        {
            "text": "These principles focus on the operational challenges of managing datasets containing personal information that departments need to deliver essential services, such as managing benefits payments, tax, health records and vehicle and driver records. "
        },
        {
            "text": "The principles provide consistent standards that give teams confidence when sharing data across organisational boundaries, ensuring that the benefits of better-connected services are realised ethically and securely. "
        },
        {
            "heading": 3,
            "text": "The ten principles at a glance "
        },
        {
            "text": "The guidance sets out ten principles for securing personal data in government services: "
        },
        {
            "text": "These principles support secure-by-design practices and provide the foundation for trusted, effective data sharing across government. "
        },
        {
            "heading": 3,
            "text": "How the principles were developed "
        },
        {
            "text": "Our approach has been collaborative, bringing together GDS internal teams and colleagues across government with expertise in personal data management. "
        },
        {
            "text": "We worked closely with the Cabinet Office Government Security Group and experts from the National Cyber Security Centre through a series of meetings and workshops. Together, we defined what teams needed, scoped out the guidance, and produced a first draft. "
        },
        {
            "text": "Following that, we undertook a consultation period of over ten months with external stakeholders, including the Information Commissioner's Office, the wider data protection and cyber security communities across government, and representatives from the National Security community. "
        },
        {
            "text": "We tested the principles against actual data sharing use cases between large data-led departments including ONS, DWP and HMRC. After several iterations, the final draft was approved by GDS and published on GOV.UK. "
        },
        {
            "heading": 3,
            "text": "What we're asking of you "
        },
        {
            "text": "Senior leaders, delivery teams and data professionals across government are encouraged to adopt these principles as the foundation for secure, trusted services. Applying them early and consistently will support effective data sharing and help teams work confidently across organisational boundaries. "
        },
        {
            "text": "Leaders should champion these principles across their organisations, embed secure-by-design practices, and ensure teams have the skills and governance structures needed to maintain high standards. "
        },
        {
            "text": "By working together, we can ensure that government continues to use personal data responsibly, enabling better public services while maintaining the trust that citizens place in us."
        }
    ]
}