{
    "url": "https://rpc.blog.gov.uk/2026/02/27/why-the-rpc-matters-because-independent-scrutiny-improves-uk-regulation/",
    "title": "Why the RPC matters – because independent scrutiny improves UK regulation",
    "authors": [
        "Stephen Gibson, RPC Chair"
    ],
    "categories": [
        "Better regulation"
    ],
    "pub_date": "2026-02-27T09:48:31+00:00",
    "content": [
        {
            "text": "This is the final post in our series answering the simple but important question: why does the Regulatory Policy Committee matter?"
        },
        {
            "text": "In previous posts we explored:"
        },
        {
            "text": "This final post shows how the RPC has raised the quality of evidence and analysis underpinning regulatory proposals and thereby improved UK regulation."
        },
        {
            "heading": 2,
            "text": "Raising the quality of impact assessments"
        },
        {
            "text": "More than 30% of impact assessments (IAs) submitted to the RPC are initially rated “not fit for purpose”, meaning that there are major concerns about the quality of the evidence or analysis presented - for example relating to the rationale for regulation, options assessment or small and micro business assessment."
        },
        {
            "text": "When this happens, the RPC provides detailed feedback and works with the department to address the weaknesses. As a result, the proportion of deficient IAs falls to below 5% by the time they are finalised."
        },
        {
            "text": "That improvement reflects the value of independent scrutiny - and raises an important question: "
        },
        {
            "heading": 2,
            "text": "Strengthening post-implementation evaluation"
        },
        {
            "text": "Regulation should not end when it is introduced. It should be evaluated to determine whether it is working correctly, whether it is having any unintended consequences and if it is achieving its intended objectives."
        },
        {
            "text": "Before the RPC began actively monitoring and publishing data on departmental performance, more than 40% of regulations were not being evaluated as planned."
        },
        {
            "text": "By publishing this data and securing commitments from departments to improve their performance, the RPC has helped drive a huge reduction in missed evaluations - strengthening accountability and improving regulatory effectiveness across government."
        },
        {
            "heading": 2,
            "text": "Improving the analysis of free trade agreements"
        },
        {
            "text": "Free trade agreements (FTAs) are central to the UK’s post-Brexit trading arrangements. Yet the initial impact assessments submitted for review often emphasised potential opportunities while giving insufficient attention to costs, risks and the levels of uncertainty in the estimates."
        },
        {
            "text": "The RPC worked closely with trade analysts in the Department for Business and Trade (and previously the Department for International Trade) to ensure that final FTA IAs present a more balanced assessment — transparently setting out both the benefits and potential downsides of the FTA. The result was analysis that better summarised the impacts of the trade agreement and was more useful to decision makers and stakeholders alike."
        },
        {
            "heading": 2,
            "text": "Independent scrutiny improves UK regulation"
        },
        {
            "text": "By challenging weak analysis, promoting evaluation and insisting on balance, the RPC has improved the quality, credibility and transparency of the UK’s regulatory decision making and the effectiveness of our regulations."
        }
    ]
}