{
    "url": "https://food.blog.gov.uk/2026/02/27/why-meat-inspections-matter-and-how-were-making-sure-they-stay-effective/",
    "title": "Why meat inspections matter - and how we’re making sure they stay effective",
    "authors": [
        "Junior Johnson, Director of Operations"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2026-02-27T15:38:24+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "When you buy meat - whether it’s from your local butcher, supermarket or farmers’ market - you expect it to be safe and produced to high welfare standards. "
        },
        {
            "text": "Trust is essential for the meat industry to thrive, and at the Food Standards Agency (FSA) we take our regulatory responsibility alongside that of food businesses extremely seriously."
        },
        {
            "text": "Our Official Veterinarians and Meat Hygiene Inspectors work in meat plants and abattoirs across the country making sure that the meat that reaches your table is safe to eat. "
        },
        {
            "text": "These inspections support food safety and protect animal welfare. They help maintain confidence in a meat industry worth more than £11 billion to the UK economy, showing consumers and trading partners that British meat is produced to the highest standards."
        },
        {
            "text": "These controls are essential for public safety, and we are committed to making sure they remain robust. However, the cost of delivering them is increasing and this is happening for several reasons. "
        },
        {
            "text": "We have strengthened delivery resilience by introducing multiple suppliers, but like many public services the cost to the FSA of providing controls has increased. The skilled worker visa minimum salary threshold increase, for example, has had an impact, as many vets are recruited from overseas. At the same time, there is less public funding available for support through discounts to these charges."
        },
        {
            "text": "We have just published our annual charge rates for 2026/27. While 18% of the £66m in charges is still discounted, the overall effect of the changes means that businesses will have to pay significantly more for inspections."
        },
        {
            "text": "For many years, the smallest abattoirs have received discounts of up to 90% off their inspection charges and we are determined to maintain this support. So, to make the best use of taxpayer’s money in 2026/27 we are targeting more of the money available for discounts towards smaller abattoirs. "
        },
        {
            "text": "These businesses are often at the heart of rural communities, supporting local and regional food markets, increasing consumer choice, and playing an important role in the sustainability of rare and native livestock breeds."
        },
        {
            "text": "By focusing funding where it has the greatest public benefit, we can help ensure that smaller, often family‑run businesses continue to play their important role in local economies, which contribute significantly to the food system, while also delivering good value for the taxpayer."
        },
        {
            "text": "In March 2026, we will be consulting on proposals to reform taxpayer funded discount system and we want to hear from businesses of all sizes. "
        },
        {
            "text": "This consultation follows extensive engagement with industry since autumn 2024. It will help shape our approach to financial support within a system that continues to protect food safety and supports a strong and diverse meat sector."
        },
        {
            "heading": 2,
            "text": "Pam mae arolygiadau cig yn bwysig - a sut rydym yn sicrhau eu bod yn parhau i fod yn effeithiol"
        },
        {
            "text": "Junior Johnson, Cyfarwyddwr Gweithrediadau’r Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Pan fyddwch chi’n prynu cig – boed hynny o’ch cigydd lleol, archfarchnad neu farchnad ffermwyr – rydych chi’n disgwyl iddo fod yn ddiogel ac wedi’i gynhyrchu yn unol â safonau lles uchel. Mae ymddiriedaeth yn hanfodol er mwyn i’r diwydiant cig ffynnu, ac yn yr Asiantaeth Safonau Bwyd (ASB) rydym yn cymryd ein cyfrifoldeb rheoleiddio, ochr yn ochr â’n cyfrifoldeb dros fusnesau bwyd, o wir ddifrif."
        },
        {
            "text": "Mae ein Milfeddygon Swyddogol ac Arolygwyr Hylendid Cig yn gweithio mewn ffatrïoedd cig a lladd-dai ledled y wlad er mwyn sicrhau bod y cig sy’n cyrraedd eich bwrdd yn ddiogel i’w fwyta. Mae’r arolygiadau hyn yn cefnogi diogelwch bwyd ac yn diogelu lles anifeiliaid. Maent yn helpu i gynnal hyder mewn diwydiant cig sy’n werth mwy nag £11 biliwn i economi’r DU, gan ddangos i ddefnyddwyr a phartneriaid masnachu fod cig o Brydain yn cael ei gynhyrchu yn unol â’r safonau uchaf."
        },
        {
            "text": "Mae’r rheolaethau hyn yn hanfodol i ddiogelu’r cyhoedd, ac rydym wedi ymrwymo i sicrhau eu bod yn parhau i fod yn gadarn. Fodd bynnag, mae cost yr arolygiadau hyn yn cynyddu, a hynny oherwydd sawl rheswm. Rydym wedi cryfhau ein gwydnwch wrth gynnal rheolaethau drwy gyflwyno sawl cyflenwr, fel llawer o wasanaethau cyhoeddus, mae cost i’r ASB ddarparu rheolaethau wedi cynyddu. Mae’r cynnydd yn y trothwy isafswm cyflog ar gyfer fisâu gweithwyr medrus, er enghraifft, wedi cael effaith, gan fod llawer o filfeddygon yn cael eu recriwtio o dramor. Ar yr un pryd, mae llai o gyllid cyhoeddus ar gael ar gyfer cefnogaeth trwy ostyngiadau i’r taliadau hyn."
        },
        {
            "text": "Rydym newydd gyhoeddi ein cyfraddau taliadau blynyddol ar gyfer 2026/27. Er bod 18% o’r £66m mewn taliadau’n derbyn gostyngiad o hyd, mae effaith gyffredinol y newidiadau yn golygu y bydd yn rhaid i fusnesau dalu llawer mwy am arolygiadau. Ers blynyddoedd lawer, mae’r lladd-dai lleiaf wedi cael gostyngiadau o hyd at 90% oddi ar eu taliadau arolygu ac rydym yn benderfynol o gynnal y gefnogaeth hon. Felly, er mwyn gwneud y defnydd gorau o arian trethdalwyr yn 2026/27, rydym yn targedu mwy o’r arian sydd ar gael ar gyfer gostyngiadau tuag at ladd-dai llai. Mae’r busnesau hyn yn aml wrth wraidd cymunedau gwledig, gan gefnogi marchnadoedd bwyd lleol a rhanbarthol, cynyddu dewis i ddefnyddwyr, a chwarae rhan bwysig yng nghynaliadwyedd bridiau da byw prin a brodorol."
        },
        {
            "text": "Drwy dargedu cyllid at y mannau lle y bydd o’r budd mwyaf i’r cyhoedd, gallwn helpu i sicrhau bod busnesau llai, sydd yn aml yn fusnesau teuluol, yn parhau i chwarae rhan bwysig mewn economïau lleol, gan gyfrannu’n sylweddol at y system fwyd, ac ar yr un pryd ddarparu gwerth da i’r trethdalwr."
        },
        {
            "text": "Ym mis Mawrth 2026, byddwn yn cynnal ymgynghoriad ar gynigion i ddiwygio’r system ostyngiadau a ariennir gan drethdalwyr, ac rydym am glywed gan fusnesau o bob maint. Mae’r ymgynghoriad hwn yn dilyn gwaith ymgysylltu helaeth â’r diwydiant ers hydref 2024. Bydd yn helpu i lunio ein dull o roi cymorth ariannol o fewn system sy’n parhau i ddiogelu diogelwch bwyd ac sy’n cefnogi sector cig cryf ac amrywiol."
        }
    ]
}