{
    "url": "https://ukhodigital.blog.gov.uk/2021/06/10/5-reasons-why-it-is-important-to-map-the-ocean-floor/",
    "title": "5 reasons why it is important to map the ocean floor",
    "authors": [
        "James Carey"
    ],
    "categories": [
        "Blue economy",
        "COP 26"
    ],
    "pub_date": "2021-06-10T13:11:36+01:00",
    "content": [
        {
            "text": "The health of our oceans and the health of our planet are one and the same. Yet the link between how much we know about this environment and how we protect it is not always clear."
        },
        {
            "text": "In this article, I outline 5 reasons why better mapping could help us to understand the basics of our ocean ecosystem and help us protect it – and one reason why mapping could compromise our environment."
        },
        {
            "heading": 2,
            "text": "The 5 reasons why"
        },
        {
            "heading": 3,
            "text": "1.  Our future"
        },
        {
            "text": "Our future is tied to the health of the world’s oceans. They capture carbon, regulate the earth’s temperature and are a source of food for billions of people. To protect our oceans and future generations, we need to build a better understanding of our changing climate and the effect it has on the marine environment."
        },
        {
            "text": "Unfortunately current models use data that is up to 80% incomplete, with calculations that are based on misleading averages. For example, we know that on average the sea is 3km deep, but this doesn’t account for outliers like the Mariana Trench which stretches to depths of 11km."
        },
        {
            "text": "So, if we don’t know its exact volume, how can we understand the ocean to its full extent? And, more critically, how can begin to understand the full extent of how humans are impacting the marine environment?"
        },
        {
            "text": "Organisations and partnerships around the world are trying to change this, including The Nippon Foundation-GEBCO Seabed 2030 project – which aims to create a global map of the ocean by the end of the decade. By collecting and sharing more data that depicts the actual depths of the seafloor, we can build a better understanding of our marine environment and how to protect it."
        },
        {
            "text": "Find out how the UKHO is supporting The Nippon Foundation-GEBCO Seabed 2030 project >"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "2. Possibility"
        },
        {
            "text": "We know so little about the ocean’s potential to support life on earth. In fact, it’s a well-known fact that we know more about the surface of the moon than we do about the seafloor."
        },
        {
            "text": "But recent years have seen increased ocean exploration, which has led to the discovery of previously untapped resources: new medicines, genomes, food and energy resources, and even aspects of our own cultural heritage. But if there is a wealth of natural resources that can be sourced from our oceans, how do we manage their use fairly and sustainably?"
        },
        {
            "text": "Habitat mapping, analysis of seabed samples, and a host of other marine geospatial data sets can support this aim, by building a full itinerary of our ocean resources and a means of monitoring their use. Without this data, we risk depleting vital resources and causing irreversible damage to critical marine habitats."
        },
        {
            "text": "Find out how the UKHO’s Data Science team are using satellite imagery to map mangroves >"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "3. Protection"
        },
        {
            "text": "Communities around the world depend upon the existence of many vital marine environments, and both human and animal populations alike are threatened by their overexploitation. The 30x30 project aims to safeguard these environments by designating 30% of the world’s oceans as marine protected areas by 2030. But to do so, there are formidable hurdles."
        },
        {
            "text": "Likewise, as offshore renewable energy becomes increasingly important, access and rights to parts of the ocean become fundamental to both conservation and economic efforts."
        },
        {
            "text": "For both of these initiatives to work, ocean territories and areas of responsibility need to be well-defined. But this is easier said than done, as the coastline is ever-changing."
        },
        {
            "text": "To be able to define clear, mutually agreed boundaries, good survey data and tidal observations are essential – as well as expertise in Law of the Sea. If you can’t define your coastline you can’t fully protect your seas."
        },
        {
            "text": "Find out more about the importance of coastal environments >"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "4. Resilience"
        },
        {
            "text": "Coastal inundation poses a significant threat to millions of people around the world. Caused by storm and tidal surges, it can completely submerge surrounding areas in sea water – causing substantial damage to infrastructure and harm to vulnerable communities. With rising sea levels, it is estimated that this issue could affect up to 4.6% of the global population annually by 2100."
        },
        {
            "text": "A good understanding of the shape of the seabed and the nature of the coastline can help authorities to develop models that predict the impact of coastal inundation on low-lying areas. By identifying areas at risk, they can then take measures to protect communities. For example, the planting of mangroves can reduce the impact of strong wave action."
        },
        {
            "text": "Access to disaster insurance products is also a key driver of national resilience in Small Island Developing States – so quantifying the effects of coastal morphology and composition are increasingly essential to allow access to this."
        },
        {
            "text": "Find out how the UKHO are helping Kiribati to fight the impacts of coastal inundation >"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "5. Safety"
        },
        {
            "text": "Last, and by no means least: safety is dependent on an understanding of ocean depths, obstructions and tidal currents – not only the safety of individuals, but for the ecosystem as a whole."
        },
        {
            "text": "Untold damage to environmentally sensitive areas can occur just from the release of fuel reserves from a stricken vessel. When it comes to the effect from a bulk carrier or oil tanker, the damage can be multiplied by an order of magnitude."
        },
        {
            "text": "Even now with ubiquitous remote sensing technology, many navigational products rely on 19th century data collected in rowing boats with lines and lead weights. Therefore it’s imperative that we collect more accurate data to support the safe and efficient navigation of shipping around the world."
        },
        {
            "text": "Discover how data collected in the British Virgin Islands is supporting the safe navigation of cruise ships >"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "And 1 reason why not."
        },
        {
            "heading": 3,
            "text": "6. Pollutants"
        },
        {
            "text": "To adequately map the oceans to a reasonable standard by 2030 would require every known ocean research vessel to work every day for the next 10 years. Notwithstanding, most of these vessels are not configured for ocean survey specifically, and certainly not for deep water mapping. Therefore the failure rate from working on this continuously would make it untenable – as would the other research lost if all these ships were only focused on survey."
        },
        {
            "text": "Even more problematic is the consumption of fuel and the production of undersea noise which would have environmental consequences in their own right. So, what we don’t need is just more of the same."
        },
        {
            "text": "Environmentally friendly propulsion would be a step in the right direction and in nearshore, clear waters, remote sensing can provide part of the solution. However, ocean survey requires a game-changing technological leap."
        },
        {
            "text": "The most likely direction for this is in autonomous vessels – small, uncrewed vessels that can operate semi-independently, either through programming or remote control – which don’t operate using fossil fuels. Even so, such technology on its own is not yet at the stage where it will singlehandedly change the amount of data collected."
        },
        {
            "text": "Another hopeful avenue is through building local capability for survey. By putting the skills to undertake surveys into the hands of local practitioners, the amount of data collected will increase at a lower environmental cost. This requires training; not only in survey and survey processing, but in data management and dissemination."
        },
        {
            "text": "Find out how the UKHO is supporting autonomous navigation >"
        },
        {
            "text": "Gaining a better understanding of our ocean is a fundamental objective in protecting it. It is a big job though one which I am optimistic about."
        },
        {
            "text": "Developments in technology and collaborations in data gathering suggest we are on the brink of knowing much more about size and shape of the ocean. As we look ahead to COP26, and beyond that to the UN Decade of Ocean Science for Sustainable Development, the UK Hydrographic Office will continue to share data with our partners that supports safe, secure and thriving oceans."
        }
    ]
}