{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/06/10/carers-week-my-personal-perspective/",
    "title": "Carers Week: my personal perspective",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Coronavirus",
        "Knowledge and skills",
        "Learning disabilities"
    ],
    "pub_date": "2021-06-10T11:52:13+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The privilege of caring"
        },
        {
            "text": "I have just returned to my role as Chief Social Worker for Adults, alongside Fran Leddra, following time out to care for my elderly mother who had liver cancer and Lewy Body Dementia. It seems highly fitting, therefore, for my first blog, on returning to this wonderful role, to be posted during Carers Week."
        },
        {
            "text": "She died after a long period of illness and increasing disability. It was a privilege to spend the last 12 months of her life by her side, supporting her to stay in her own home and making it possible to die in her own bed, with our family by her side."
        },
        {
            "text": "My autistic brother, who lived with her all his life, had provided most of her support and caring, but was struggling. He had coped amazingly well, respecting her rights and gently managing those difficult, challenging moments."
        },
        {
            "text": "He has since had to process his own feelings of loss, whilst rising to the challenge of adjusting to ongoing changes on a weekly basis. I am now supporting him from a distance, so my caring role continues."
        },
        {
            "heading": 2,
            "text": "A lifetime of learning"
        },
        {
            "text": "We both learnt a lot as her children, and latterly as her carers, including lifting and handling techniques, skin care, medicines management, dietary needs, sleep management and pain control."
        },
        {
            "text": "All the while, we were balancing risk and protection with respecting and supporting her independence, choice and control and recognising that to love is to act. We made sure she remained connected to her family, friends and neighbours who visited her till the very end of her life, with all the challenges that COVID-19 restrictions presented."
        },
        {
            "text": "And for me as a social worker, it underlined how essential it is that we recognise and support carers with advice, practical and financial support, helping them manage their own health and care needs, education and career aspirations. ensuring they can have a break and most importantly providing emotional support and helping to co-ordinate the labyrinthine  world that is health and social care."
        },
        {
            "text": "I take my hat off to all those carers who, day in and day out, are there for the people they are supporting. We simply cannot do with out them."
        },
        {
            "text": "Every week is Carers Week of course, but this week – in this year of all years - the need to raise awareness and improve carers lives and those they care for, has never been more vital."
        }
    ]
}