{
    "url": "https://dragonsden.blog.gov.uk/2021/06/10/dragons-den-episode-11-series-18/",
    "title": "Dragons' Den, Episode 11, Series 18",
    "authors": [
        "Laurien Webb"
    ],
    "categories": [
        "Designs",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2021-06-10T21:00:08+01:00",
    "content": [
        {
            "text": "Passions were running high in tonight’s episode with some fiery questions from the Dragons, surely leaving some of the entrepreneurs feeling hot under the collar. Tonight’s episode was jam packed with Rockstar spirits, nursing bras, immersive adventure-themed home work-outs, heat-free hair curling products and animated story books for children. So, without further ado – let’s get down to business!"
        },
        {
            "heading": 3,
            "text": "“Nothing great is easy”"
        },
        {
            "text": "First up and first to catch my eye was Tom Hurst of Rockstar Spirits who confidently walked into the Den with an array of premium single distillery rums mixed with natural flavour combinations. Off to a flying start after a great pitch, it was time for the taste test!"
        },
        {
            "text": "I looked on as the Dragons all sampled the wonderfully mixed rum, and meanwhile, at home, I quickly added a bottle of Banana Bomb to my food shopping list!). It wasn’t long before Deborah complimented Tom on his branding and illustrations, and what I thought was a beautifully decorated label. I’ll be honest with you, if I ever fancy sampling something new and I haven’t had time to do my research, I rely greatly on the appearance of a product. That will be the one that jumps off the shelf at me visually as I’m rushing through the supermarket before getting back for the school run."
        },
        {
            "text": "Branding is so important. It can influence the way that your customer perceives you when they hear or think of your company name, service, or product. This includes everything they think they know about your brand, including information, your packaging, but also emotive elements, like for example, that it’s luxurious."
        },
        {
            "text": "You can register your trade mark to protect your brand, such as the name of your product or service. When you register your trade mark, you'll be able to:"
        },
        {
            "text": "Check out this video for more information on protecting your brand!"
        },
        {
            "heading": 3,
            "text": "Let’s head to the bar"
        },
        {
            "text": "With Tom bringing a taste of the tropics to the Den it was clear that a Dragon duel was about to commence. Tom originally asked for a 25k investment for 2% of his business. He walked in with an open mind with no mention of whether he had a preferred Dragon in mind. Possibly stirred into action by the rum, all Dragons aside from Sara Davies were quick to make Tom an offer. Theo Paphitis made a spirited attempt to gazump them all with his powerful offer of 50k for 10% equity.  Fortunately for Tej & Touker they managed to claw their way back into Tom’s sights. They partnered up with an 8% equity split between them for 25k of Tom’s spiced rum business."
        },
        {
            "heading": 3,
            "text": "“I’ve got IP behind me!”"
        },
        {
            "text": "The next entrepreneur to capture my interest was Yanika Cordina with her ‘Flower Curl’ invention. Her innovative, patented product helps users get creative with heatless hair styling solutions."
        },
        {
            "text": "I am someone who loves all things beauty related and I enjoy spending my time trying out anything from new hairstyles to hair colours.  I have built up quite an army of products and tools throughout my years. Any solution that promises less heat damage to my locks whilst still allowing me to try out new styles is sure to catch my attention."
        },
        {
            "text": "Yanika got off to a strong start and was asking for 75k in return for 15% equity in her business."
        },
        {
            "text": "It wasn’t long before the Dragons inspected the product. When Deborah asked, “What’s to stop someone from using this?” Yanika responded that she had registered the intellectual property – or IP - in her product."
        },
        {
            "text": "So what IP does Yanika own? Quite an array it seems! She stated that she has a UK patent and an EU patent pending."
        },
        {
            "text": "You can use a patent to protect your invention. It gives you the right to take legal action against anyone who makes, uses, sells or imports it without your permission."
        },
        {
            "text": "To be granted a patent, your invention must be all of the following:"
        },
        {
            "text": "Before you apply, check if a patent is right for your business."
        },
        {
            "text": "As well as this, Yanika owns trade marks in the UK and across the pond in the USA. Clearly having a good eye, I was keen to know if Yanika understood IP and had protected the brand. A quick trade mark search shows the registered trade mark.  Well done Yanika!"
        },
        {
            "text": "And finally, Yanika had protected the design of the Flower Curl."
        },
        {
            "text": "So, in Yanika’s case this means that she has protected the look of the Flower Curl and the functionality of the product including how it works – an important part!"
        },
        {
            "text": "Having both a patent and a registered design has given Yanika tighter IP protection and an advantage in her industry over other competitors."
        },
        {
            "text": "Check out this video on how to protect your designs at the UKIPO:"
        },
        {
            "heading": 3,
            "text": "“I bring the business acumen; you bring the IP”"
        },
        {
            "text": "All of the Dragons wished Yanika well with her product, while one, Sara Davies, made Yanika an eye watering offer for the full 75k for 50% of her business. Yanika sealed the deal with Sara – herself a credible Dragon and successful businesswoman."
        },
        {
            "text": "If you are thinking about the intellectual property in your business, visit the IP for Business section of our website or sign up to receive regular updates."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}