{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/10/gse-opportunities-defra-deputy-director-roles-x2/",
    "title": "GSE Opportunities : Defra Deputy Director Roles ×2",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-06-10T17:36:57+01:00",
    "content": [
        {
            "text": "The Department for Environment, Food and Rural Affairs (Defra) is the UK Government Department responsible for safeguarding the UK's natural environment, supporting its world-leading food and farming industry, and sustaining a thriving rural economy. The broad remit of this Department means Defra plays a major role in people’s day-to-day life, from the food people eat, and the air people breathe, to the water people drink. Defra is a ministerial department, supported by 33 agencies and public bodies."
        },
        {
            "text": "Currently, Defra has two exciting opportunities to be part of the development of a world class science facility delivering infrastructure critical to animal health and farming in the UK. Within these roles, you would lead a significant portfolio of Critical Works projects and work closely with the Science Capability in Animal Health (SCAH) programme delivering new facilities."
        },
        {
            "heading": 3,
            "text": "Current Vacancies"
        },
        {
            "heading": 4,
            "text": "SCS (SCS1) - Deputy Director, Head of Programmes (Science Facilities)"
        },
        {
            "text": "We are seeking an experienced Head of Programme to deliver a portfolio of complex capital projects within Science Facilities. This is an exciting opportunity to be part of the development of a world class science facility delivering infrastructure critical to animal health and farming in the UK at the heart of Defra’s agenda. A ten-year programme of work, with a budget of £1.4B has been secured to redevelop the Animal and Plant Health Agency’s (APHA) science laboratories based at Weybridge. You will lead a significant portfolio of Critical Works projects and work closely with the SCAH programme delivering new facilities."
        },
        {
            "text": "Vacancy reference: 115024, Weybridge; closing date: 11:55 pm on Monday 14th June 2021"
        },
        {
            "heading": 4,
            "text": "SCS (SCS1) - Deputy Director, Head of Operations (Science Facilities)"
        },
        {
            "text": "We are seeking a Deputy Director to operate within the science facilities and engineering professions. You will be the operations director for the Animal and Plant Health Agency (APHA) science facilities at Weybridge ensuring that they operate safely and effectively, and that they are maintained and compliant with legislative requirements, with responsibility for all aspects of operating a high containment laboratories site."
        },
        {
            "text": "Vacancy reference: 115054, Weybridge; closing date:  11:55 pm on Monday 21st June 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}