{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/10/gse-opportunities-european-space-agency-astronaut-x2/",
    "title": "GSE Opportunities : European Space Agency Astronaut ×2",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-06-10T14:46:46+01:00",
    "content": [
        {
            "text": "Are you calm under pressure, fit and healthy, and looking for a new career?"
        },
        {
            "text": "For the first time since 2008, The European Space Agency (ESA) is on the lookout for new astronauts.. The UK Space Agency expects the next professional UK astronaut to be selected through this recruitment drive and encourages all eligible applicants to apply."
        },
        {
            "text": "Following an intensive period of training, which will include a three-week course in caving and a course in practical geology, the new astronauts will take their first flights into space when they are deployed to the International Space Station. They are likely to be part of the crew on the next missions to the Moon in the late 2020s and through the 2030s."
        },
        {
            "text": "ESA is also issuing a special call for candidates with physical disabilities to apply to its astronaut reserve. The pilot project aims to open the astronaut career path to people who, until now, have been excluded from space flight."
        },
        {
            "text": "Find out more information about application requirements and links to the job adverts below. A list of FAQs can be accessed here."
        },
        {
            "heading": 3,
            "text": "Application Requirements (Both Roles)"
        },
        {
            "text": "Experience of the space sector is not essential, but candidates will need a master’s degree (or higher) in Natural Sciences, Medicine, Engineering, Mathematics or Computer Sciences or be qualified as an experimental test pilot. Fluency in English is essential along with other requirements. The right person for the job will also be calm under pressure and be willing to be the participate in life science experiments - past experiments have included studying the effects of microgravity on human bone and tissue."
        },
        {
            "heading": 4,
            "text": "Specific Additional Requirements for Astronaut with a Physical Disability"
        },
        {
            "text": "Those with a lower limb deficiency or who are considered to be of short stature and meet other recruitment criteria are invited to apply. ESA will invest in the necessary adaptations of space hardware to enable these otherwise excellently qualified professionals to serve as crew members on a safe space mission."
        },
        {
            "text": "Astronaut Vacancy Reference: 12355, Porz-Wahn (DE) possibility of multi-year postings in Houston (USA) or Star City (Russia); closing date:  11:59 pm on Friday 18th June 2021"
        },
        {
            "text": "Astronaut with a Physical Disability Reference : 12354, Porz-Wahn (DE) possibility of multi-year postings in Houston (USA) or Star City (Russia); closing date:  11:59 pm on Friday 18th June 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}