{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/06/10/gse-opportunities-government-office-for-science-go-science-roles-x5/",
    "title": "GSE Opportunities : Government Office for Science (GO-Science) Roles ×5",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-06-10T15:21:43+01:00",
    "content": [
        {
            "text": "The Government Office for Science (GO-Science) works at the heart of Government to ensure that policies and decisions are informed by the best scientific evidence and strategic long-term thinking. It is a very exciting time to join the organisation, we have unique and high-profile positions where you will have the opportunity to inform and influence policy making and the systems for use of science and engineering across government. Currently, GO-Science is expanding due to it's work on several key-Government areas, this week an additional 5 vacancies have gone live. Take a look below to see if a career in GO-Science is for you."
        },
        {
            "heading": 3,
            "text": "Current Vacancies"
        },
        {
            "heading": 4,
            "text": "HEO - Assessment and Insight ×2"
        },
        {
            "text": "We are looking to recruit two analytical roles within the unit to deliver cross-Government analysis and assessment of the implications and impact of science and technology on HMG’s goals on economic policy, social policy and national security."
        },
        {
            "text": "Vacancy reference: 123754, London ; closing date:  11:55 pm on Wednesday 16th June 2021"
        },
        {
            "heading": 4,
            "text": "SEO - Capability & Delivery Lead ×1"
        },
        {
            "text": "This vacancy is for the position of Capability & Delivery Lead within the Science, Technology and Innovation Insights unit. The unit is being established to deliver cross-Government analysis and assessment of the implications and impact of science and technology on HMG’s goals on economic policy, social policy and national security."
        },
        {
            "text": "Vacancy reference: 124680, London ; closing date:  11:55 pm on Sunday 20th June 2021"
        },
        {
            "heading": 4,
            "text": "EO Executive Assistant & Programme Support ×1"
        },
        {
            "text": "The role will involve working across the newly-formed team to provide administrative support and executive assistance including diary support for the new Deputy Director. The post holder will be engaged in a wide range of administrative duties to support the creation of the new unit – maintaining key team documents such as project plans and risk logs, supporting knowledge and information management, supporting unit financial management and helping with recruitment and staff on-boarding."
        },
        {
            "text": "Vacancy reference: 124704, London or Manchester ; closing date:  11:55 pm on Sunday 20th June 2021"
        },
        {
            "heading": 4,
            "text": "G7 Assessment & Insight ×1"
        },
        {
            "text": "This vacancy is for the position of Assessment and Insight lead within the unit. The unit is being established to deliver cross-Government analysis and assessment of the implications and impact of science and technology on HMG’s goals on economic policy, social policy and national security."
        },
        {
            "text": "Vacancy reference: 123745, London ; closing date:  11:55 pm on Wednesday 23rd June 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}