{
    "url": "https://educationhub.blog.gov.uk/2021/06/10/how-were-taking-action-to-keep-young-people-and-children-safe-in-our-schools/",
    "title": "How we’re taking action to keep young people and children safe in our schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Ofsted",
        "Relationships and Sex Education",
        "Schools"
    ],
    "pub_date": "2021-06-10T00:01:13+01:00",
    "content": [
        {
            "text": "After the Everyone’s Invited movement shone a light on worrying stories of sexual abuse in our schools, we asked Ofsted to carry out a review."
        },
        {
            "text": "Ofsted’s review found that in some cases, incidents of harassment and abuse have been ‘normalised’ by their frequency. Of the 900 children and young people surveyed by the review, the majority had experienced the receipt of unsolicited images or sexist comments – whether in person at school or college, or online or via mobile phone."
        },
        {
            "text": "This is completely unacceptable so we are taking clear action."
        },
        {
            "heading": 3,
            "text": "We’re supporting teachers to spot abuse and harassment"
        },
        {
            "text": "School and college leaders will be encouraged to dedicate inset day time to help train staff on how to deal with sexual abuse and harassment among pupils and how to deliver the Government’s new compulsory relationships, sex and health education (RSHE) curriculum."
        },
        {
            "text": "This will build on our Keeping Children Safe in Education guidance that helps school and college staff respond to and deal with accusations of abuse or harassment."
        },
        {
            "text": "Every school and college should have a designated safeguarding lead, whose role it is to identify safeguarding concerns among pupils, and we will be working with up to 500 schools to provide support for these safeguarding leads, with a specific focus on sexual abuse."
        },
        {
            "heading": 3,
            "text": "A lot of the abuse reported happened online so we’re working with tech companies to secure action"
        },
        {
            "text": "The Education Secretary Gavin Williamson, Culture Secretary Oliver Dowden and Children’s Commissioner, Dame Rachel de Souza will join a roundtable discussion with tech companies, law enforcement, children’s charities and schools to talk about preventative measures ahead of proposed legislation. The focus will be on how to support parents, staff and children to make more informed and safer choices online."
        },
        {
            "text": "Parents also need to be able to spot what their children are doing and know how to support them if things go wrong. There is support available from the Safer Internet Centre, the NSPCC and the Internet Watch Foundation which each have detailed resources to help adults skill up on what can otherwise be daunting."
        },
        {
            "heading": 3,
            "text": "We’re also strengthening the relationships and sex education and health education (RSHE) curriculum"
        },
        {
            "text": "By strengthening the compulsory RSHE curriculum, we’re helping teachers focus on relevant elements, such as around sharing images online and consent. And we are updating our statutory guidance to ensure that the definitions used are in line with pupils understanding and experience."
        },
        {
            "text": "This means that young people up and down the country will get taught about important issues such as respect, consent and privacy. It helps young people to learn about healthy relationships from an early age."
        },
        {
            "heading": 3,
            "text": "We’re also continuing to run the phone line we set up with the NSPCC spell out"
        },
        {
            "text": "We asked the NSPCC to set up a confidential phone line in April 2021 for reporting abuse or harassment."
        },
        {
            "text": "Running until October, the helpline ensures that young people who may have experienced abuse at school, or any other victim of recent or non-recent sexual abuse, can receive immediate support and guidance. As of Monday 7 June, the helpline had received over 400 calls and helpline staff have made 70 referrals to external agencies including the police or social services."
        },
        {
            "text": "All this builds on a range of measures recently introduced – read more here."
        }
    ]
}