{
    "url": "https://communityinterestcompanies.blog.gov.uk/2021/06/10/provide-cic-delivering-care-with-innovation-and-compassion/",
    "title": "Provide CIC - delivering Care with Innovation and Compassion",
    "authors": [
        "Chris Summers"
    ],
    "categories": [
        "Community Interest Companies in action"
    ],
    "pub_date": "2021-06-10T11:55:03+01:00",
    "content": [
        {
            "heading": 2,
            "text": "We Provide"
        },
        {
            "text": "Provide was established as a community interest company (CIC) ten years ago. This was as a part of the Government’s initiative to separate the commissioning and provider roles of the local NHS.  Today, Provide employs over 1,200 staff. Our organisation delivers a portfolio of more than 40 NHS and Social Care services to a community of more than 4.5 million including:"
        },
        {
            "text": "Provide services covers the areas across Essex and East Anglia and is committed to providing ‘Safe, Clean Care’ for all our patients."
        },
        {
            "heading": 2,
            "text": "An unprecedented year"
        },
        {
            "text": "In 2020/21, the delivery of health and social care services was tested in an unprecedented way. Almost overnight, Provide faced the challenge of adapting its delivery of care to thousands of existing patients, with a rapidly escalating responsibility to meet the needs of thousands more impacted by Covid-19.  Within hours of the first restrictions, Provide pivoted its operations:"
        },
        {
            "text": "On 21 March 2020, just days after the first restrictions were announced, Provide launched a support portal to serve the people of Essex. This full-service support included:"
        },
        {
            "text": "The Essex Wellbeing Service (EWS) has been a lifeline for more than 21,000 service users. The service has delivered:"
        },
        {
            "text": "In 2021, the EWS is enabling hundreds more staff and volunteers in the rapid roll-out of the vaccination programme."
        },
        {
            "heading": 2,
            "text": "Innovation is the way to Provide"
        },
        {
            "text": "Our key achievements over the last year have included:"
        },
        {
            "text": "Provide’s core values of care, innovation and compassion have shaped the organisation to become the region’s largest partnership provider of high-quality health and social care services."
        },
        {
            "text": "Our mission going forward is that our ambitious employee-owned social enterprise will grow in size and influence the sector.  Our aim is to transform lives by treating, caring and educating people."
        },
        {
            "text": "To keep in touch sign up to email updates from this blog, or follow us on Twitter."
        }
    ]
}