{
    "url": "https://dluhcdigital.blog.gov.uk/2021/06/10/update-on-our-training-offer/",
    "title": "What our training offer is teaching us about the needs of local government",
    "authors": [
        "Sam Villis"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Training"
    ],
    "pub_date": "2021-06-10T13:13:32+01:00",
    "content": [
        {
            "text": "Earlier this year, we launched a library of online training courses to support our local government colleagues to learn and develop their digital skills while working remotely."
        },
        {
            "text": "A core part of this training offer is a selection of funded courses: certified courses that people can apply to, which are paid for in full by MHCLG. The funded courses have been carefully chosen based on the needs of local government staff, and provided by the online learning platform, FutureLearn."
        },
        {
            "text": "Since launch, we’ve had over 100 applications from colleagues at 68 councils up and down the country for the funded courses. We’re learning as we go, regularly reviewing and assessing the offering to make sure it continues to meet the needs of the sector."
        },
        {
            "text": "We want to share with you what we’ve learned so far and what we plan to do next. You can also find out how we’ve expanded the offer to provide even more training opportunities."
        },
        {
            "heading": 2,
            "text": "What we want to achieve through the training library"
        },
        {
            "text": "The coronavirus restrictions in place last year meant that we had to temporarily press pause on our classroom-based courses."
        },
        {
            "text": "To support local government staff to continue to develop their digital skills - and to do so from home, in their own time, and at their own pace - we launched a virtual training library at the start of this year."
        },
        {
            "text": "When we developed the library, we did so with some key principles in mind. These included making it applicable to colleagues across local government, including both digital and non-digital colleagues, and making the best of the skills that those colleagues already have."
        },
        {
            "heading": 2,
            "text": "Who has been applying?"
        },
        {
            "text": "To date we have issued over 100 licences to local government across 18 different courses. Approximately two thirds of applicants have been from Digital or IT roles, while just over a third come from other areas including Planning, Public Health, Communications and Procurement."
        },
        {
            "text": "Around 10% of applications have come from senior leadership roles (‘Heads of’ and above) but we’ve also had applications from apprentices, those new to local government, or those returning to work - for example, after periods of parental leave. We’ve also noted 5% of applications from HR, Organisational Design and Development or training practitioners, which we hope will further support organisational buy-in."
        },
        {
            "text": "This broad range of roles indicates that there is interest from the sector to increase digital skills across all levels of seniority and job roles."
        },
        {
            "text": "The response also highlights the power of community and word of mouth in building awareness of training, with over 50% of applicants having heard about the training from a colleague. A further 24% heard about it via members of our team, while 19% heard about the offering across our range of channels including Slack, Twitter, the newsletter and blog."
        },
        {
            "text": "An infographic to show our key learnings from the funded training course applications to date."
        },
        {
            "heading": 2,
            "text": "Why are people applying for training?"
        },
        {
            "text": "When people apply for training, we ask them why they want to take that particular course. This has provided really interesting and useful information to help us understand how we might improve the offering."
        },
        {
            "text": "We analysed all of those reasons for wanting to attend training. While people’s motivations for taking training are varied, the top reasons are:"
        },
        {
            "heading": 2,
            "text": "Which courses are proving popular with local authorities?"
        },
        {
            "text": "The most popular courses so far have been:"
        },
        {
            "text": "Applications to these courses currently make up around 42% of our total applications."
        },
        {
            "text": "It’s interesting to note that working remotely continues to be a significant focus for local government, even as restrictions are lifted."
        },
        {
            "heading": 2,
            "text": "Meeting the needs of local government"
        },
        {
            "text": "We want to make sure that our training offer reflects the needs of the sector. When analysing how well the courses are meeting those needs, we’ve used a combination of course popularity and the applicant’s self-reported knowledge of the subject they were applying for."
        },
        {
            "text": "When people apply for training, we ask them to rate their existing knowledge of the subject on a scale of 1-5, with 1 being ‘I have no knowledge of this topic’ and 5 being ‘I consider myself an expert of this topic’."
        },
        {
            "text": "Across all of our courses an overwhelming 67% of applicants rated themselves as having no knowledge or “a bit” of knowledge of the subject they applied for. No applicant rated themselves as an expert in any of the subjects."
        },
        {
            "text": "Courses where applicants rated their knowledge the lowest were:"
        },
        {
            "text": "Our most popular courses aren’t just those that people feel they need to upskill in, and our less popular courses aren’t less popular because people already have knowledge about them. This helps us to know that the funded courses we initially selected for the library have a broad appeal."
        },
        {
            "text": "That said, the courses out there are changing and improving all the time, so we want to make sure that our curated list of funded courses changes accordingly."
        },
        {
            "heading": 2,
            "text": "New ‘choose your own course’ option"
        },
        {
            "text": "We recently expanded the training library to include a ‘choose your own FutureLearn course’ option. You can now apply for any FutureLearn short course that might benefit your personal and career development - funded in full by us."
        },
        {
            "text": "This opens up a much wider range of courses on topics such as communication skills, networking and wellbeing at work. As well as offering greater choice, it will help us to keep up to date with what the sector needs and enables us to promote other great courses as they become available."
        },
        {
            "heading": 2,
            "text": "What happens now"
        },
        {
            "text": "We hope that this early analysis, combined with the post-course feedback we’re starting to receive, shows that we are on the right path. Understanding more about the motivations of our participants will also help us to communicate the courses to a wider audience and, we hope, increase uptake over the next few months."
        },
        {
            "text": "We’re also interested to see what other courses you apply for as part of the choose your own course option, and we can’t wait to see where that training takes you."
        },
        {
            "text": "As our first batch of learners come to the end of their courses, we are asking them to feed back on the course they’ve taken and our training offer as a whole. If you’ve recently completed a course, please don’t forget to fill out the feedback form to have your say."
        },
        {
            "text": "If you have any more general feedback about the course offering, please email skills@localdigital.gov.uk."
        },
        {
            "text": " "
        }
    ]
}