{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/06/10/whats-so-good-about-a-multidisciplinary-team/",
    "title": "What’s so good about a multidisciplinary team?",
    "authors": [
        "Niamh Webster"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2021-06-10T12:00:23+01:00",
    "content": [
        {
            "text": "The idea of a ‘multidisciplinary team’ is often bandied about as a solution for good policymaking. I’ve only been in government since 2018 but I’m already tired of hearing about it, having never seen it in practice."
        },
        {
            "text": "But what is a multidisciplinary team really? What does it look and feel like it, and who’s involved? And importantly, does it work?"
        },
        {
            "text": "I got the chance to be part of one this year. In sharing my experience, I want to bring a bit of light to how they work. Because much to my surprise, I find myself recommending working in this way in future."
        },
        {
            "heading": 2,
            "text": "It can be daunting to work in a new way"
        },
        {
            "text": "I won’t lie, joining a cross-government multidisciplinary team of 20 people and working for the UK Government for the first time was daunting. Especially as it was all online from my flat in Edinburgh. As a secondment from Scottish Government, I was brought on board due to my experience as a policymaker and bringing my background in public participation in policymaking."
        },
        {
            "text": "A hugely ambitious project, the ‘reforming policymaking’ project aimed to better understand how policymakers can deliver meaningful change for citizens. It’s always tricky to live up to high expectations, and this project was no different in tackling transformation of a system. This is always a worry with projects like this. Especially in a project with impact across 4 nations and affecting 30,000 policymakers."
        },
        {
            "text": "The basic ingredients for a multidisciplinary team are subject matter experts and technical experts. In this case, policymakers with expertise in making policy for citizens, working alongside service designers and user researchers with expertise in hearing the voice of people that use policies and services. Put these two teams together, and you have a recipe for success."
        },
        {
            "heading": 2,
            "text": "A different approach to research"
        },
        {
            "text": "As a policy person with subject matter expertise in citizen participation, I took on the role of analytical team lead. A rather unglamourous task, I spent hours on the project wading through piles of reports and research papers."
        },
        {
            "text": "No project should start from scratch; people will always advise you to start with what has gone before. Find what has been tried, what challenges people have already discovered, and why these have or haven’t worked in the past. A thorough investigation of past literature on the topic informed the next strands of research."
        },
        {
            "text": "We spotted gaps to dig into and suggested interesting avenues to go down, to find similar evidence and increase our teams confidence in findings. What made this all the more challenging was the variety in the dataset of existing evidence; from lengthy research reports to podcasts, from case studies and speeches to Parliamentary reports. It was no easy task, comparing and giving weighting to evidence. It’s like comparing apples with pears."
        },
        {
            "text": "What helped overcome this challenge was sharing this back to the team for their reflections. I can’t describe the relief I felt after the first ‘Show and Tell’ on the project when we started to see emerging trends with the team, and reassured me that despite the challenges, we were starting to see some really interesting findings."
        },
        {
            "text": "What can’t be glossed over is that working in this way means dealing with lots of uncertainty and complexity. The work was complex, but so was the way in which we did it. Design processes were new to me – even simple things like working intensely in week-long sprints, frequent retrospectives, a collaborative workspace where we prioritised a back-log of work - is very different to how policymakers normally operate."
        },
        {
            "heading": 2,
            "text": "Collaboration is challenging but rewarding"
        },
        {
            "text": "As a policymaker I initially struggled with this collaborative process; I’m far more comfortable holding the pen while juggling competing interests in a policy role, but ultimately being in control. This forced me out of my comfort zone, into a flat structure where everyone brings different expertise to the table, and where each discipline must be respected if you are to balance the evidence from each strand correctly."
        },
        {
            "text": "Where I instinctively wanted to introduce strict methodology and research methods, this collaborative project tested me. It was different to carrying out a research project in a more traditional sense. A collaborative effort of this scale, with hugely different research strands, forced me to re-think how I developed the methodology. It meant carefully considering the methodology suitable for analysing existing evidence."
        },
        {
            "text": "It took me some time to recognise that my analytical approach would and should be different from the methods used by service designers and user researchers in the team. And inescapably, I spent time compiling evidence and coordinating external partners for submissions of evidence – which basically means I spent a lot of time in a spreadsheet!"
        },
        {
            "text": "Everything else was different though; gone were the days of reliance on the same old project management tools. Working fully online pushed us to use collaborative tools to work together. And we spent days and days in video virtual workshops towards the end pulling the report together."
        },
        {
            "text": "Having never worked in a design process before, I find myself being an advocate of this approach. Yes, it’s challenging and wildly different from how many of us usually work. But there’s a precious opportunity in that, for a collaborative effort to work. Bringing these good ingredients together - with different perspectives, skills and talents - might offer you the best chance of cracking that problem. Cooking up your own multidisciplinary team might just be the perfect recipe for success."
        }
    ]
}