{
    "url": "https://companieshouse.blog.gov.uk/2022/01/11/4-ways-to-grow-your-small-business/",
    "title": "4 ways to grow your small business",
    "authors": [
        "Ryan Elliott - Content Manager, Enterprise Nation"
    ],
    "categories": [
        "Company guidance",
        "Starting a business"
    ],
    "pub_date": "2022-01-11T12:32:58+00:00",
    "content": [
        {
            "text": "Starting a business is an exciting time but working out how to develop it further once you’re up and running can be tough."
        },
        {
            "text": "Here we look at 4 important areas to help grow your business and see it thrive long-term."
        },
        {
            "heading": 2,
            "text": "1. Create a sound marketing plan"
        },
        {
            "text": "The age of the internet and social media has opened countless new marketing avenues for small business, but as a result, it’s often tricky to decide what channels to focus on, with so many options out there."
        },
        {
            "text": "As you build a marketing plan, consider:"
        },
        {
            "text": "Social media is a cheap and effective tool for marketing, but if your target demographic is not as active online as others, perhaps you need to rethink."
        },
        {
            "text": "Look at getting your business into the press, or maybe start speaking at in-person events. Enterprise Nation hosts daily lunch and learn webinars and there are always opportunities to get involved by pitching the right ideas."
        },
        {
            "text": "You will not achieve 100% success every time. Track your results, measure what’s effective and tailor future plans accordingly. No entrepreneur is perfect - be prepared to learn from your mistakes."
        },
        {
            "heading": 2,
            "text": "2. Explore different sales avenues"
        },
        {
            "text": "Much like with marketing, developing a sales strategy involves trial and error. Working out what does and does not work can take time, but perseverance pays."
        },
        {
            "text": "Two potential customers who are generally overlooked are large businesses and the government."
        },
        {
            "text": "The government is committed to procuring a significant percentage of its products and services from small business, which is a major door-opener for entrepreneurs with growth on the agenda."
        },
        {
            "text": "Supply chains are being created by larger corporates, who are always interested in aligning their brand with new, exciting talent. This then provides their small business partners with new customers."
        },
        {
            "heading": 2,
            "text": "3. Access finance"
        },
        {
            "text": "To grow your business - whether that’s investing in capital, expanding your products or increasing outlets - investment is needed, and sometimes that will come from external sources."
        },
        {
            "text": "There are so many different types of funding available to small businesses. Before making any concrete decisions, entrepreneurs must:"
        },
        {
            "text": "Funding is always there for small business, but whether it’s through Start Up Loans, crowdfunding or other sources, inspiring confidence in lenders through planning and forecasting will play in your favour. Read our guide on further ways to raise funds."
        },
        {
            "heading": 2,
            "text": "4. Build a team you can trust"
        },
        {
            "text": "No entrepreneur can do everything on their own, so it’s important to hire the best people possible and share responsibilities effectively."
        },
        {
            "text": "Hiring specialists, as well as business coaches, will add expertise and knowledge in areas you may not be as strong in and hold you accountable to the targets you set."
        },
        {
            "heading": 2,
            "text": "StartUp 2022"
        },
        {
            "text": "Enterprise Nation is among the UK's most active small business networks and on Friday January 21, we will be hosting StartUp 2022. During the online event, over 100 inspirational entrepreneurs and small business experts will present across 11 different virtual stages. It’s the perfect opportunity for entrepreneurs to hear from the brightest minds in UK business."
        }
    ]
}