{
    "url": "https://insideDIO.blog.gov.uk/2022/01/11/ammunition-loading-jetty-for-royal-navys-surface-fleet-completed/",
    "title": "Ammunition loading jetty for Royal Navy’s surface fleet completed",
    "authors": [
        "Craig MacDonald"
    ],
    "categories": [
        "Glen Mallan jetty",
        "Northern Ammunition Jetty",
        "Queen Elizabeth Class Aircraft Carriers",
        "Royal Navy",
        "VolkerStevin"
    ],
    "pub_date": "2022-01-11T16:12:17+00:00",
    "content": [
        {
            "text": "The Northern Ammunition Jetty at Glen Mallan following the completion of work. [Copyright VolkerStevin 2021]Shortly before Christmas I was happy to complete a major Defence project which has been occupying a lot of my time over the last few years. On 15th December we handed over the Northern Ammunition Jetty at Glen Mallan to our colleagues in Defence Equipment & Support, who will operate it."
        },
        {
            "text": "I’ve been DIO’s Project Manager for the work since it started in 2019, overseeing the refurbishment and upgrade of the jetty. It will be used to load and unload ammunition for the Royal Navy’s surface fleet, from nearby Defence Munitions Glen Douglas."
        },
        {
            "heading": 2,
            "text": "The Northern Ammunition Jetty"
        },
        {
            "text": "We awarded a £67m contract to VolkerStevin in 2019. Alongside them, we worked with managing agent Jacobs, which provided engineering and professional services, as well as designer Arch Henderson. In completing this major project, £20m was spent with local suppliers and small and medium enterprises in Scotland."
        },
        {
            "text": "The jetty was last upgraded in the 1970s and had reached the end of its economic life. The upgrade work has not only extended the life of the jetty by an estimated fifty years, but has also made the site accessible for the Royal Navy’s aircraft carriers, HMS Queen Elizabeth and HMS Prince of Wales. In fact, HMS Queen Elizabeth visited part way through the work, back in March 2021, in preparation for her first operational deployment. This was not originally planned but became necessary when the scale of the ship’s deployment increased, presenting the team with a challenge to make the jetty operational in time for her arrival. Everyone involved, from DIO, VolkerStevin, Jacobs and the various subcontractors worked closely together to enable HMS Queen Elizabeth to berth at the unfinished jetty, which she did successfully."
        },
        {
            "heading": 2,
            "text": "How we did it"
        },
        {
            "text": "This was a large and complicated project, as you might imagine from something built in the water. The previous jetty was demolished and replaced with a new 135m long jetty structure, requiring 127 steel piles to be driven into the loch bed to support a reinforced concrete deck. The works also included the installation of navigation aids and five mooring dolphins which are connected to the jetty by a pedestrian access bridge. Two modular fender spacer units have been placed in front of the new fender panels and move with the tide to prevent the overhanging flight decks of HMS Queen Elizabeth and HMS Prince of Wales from colliding with the jetty."
        },
        {
            "text": "In addition, the project included the installation of two modern pedestal cranes to load and unload ammunition and the erection of modular buildings for offices, power generation and stores. The perimeter fencing and CCTV system have also been upgraded to provide a complete modern facility."
        },
        {
            "heading": 2,
            "text": "Sustainability considerations"
        },
        {
            "text": "Sustainability and protecting the environment of Loch Long was an important consideration for me and the rest of the project team. we used capture blankets to prevent material from entering the water when the old jetty was demolished. All jetty demolition waste was transported on barges offsite to recycling facilities on the Clyde to minimise disruption to the public and is being reused for construction. To avoid the need to lay new electric cables through the water, the new navigation aids are solar powered."
        },
        {
            "text": "The jetty before work started. [Copyright VolkerStevin]There were concerns about the possible impact of noisy piling works on marine mammals, so two observers used underwater listening devices, along with visual inspections, to make sure no marine mammals were in the area before work began. If any were located, work was stopped to give them time to move away."
        },
        {
            "text": "The team have been recognised at three different construction industry awards for their work. We won ‘Best Infrastructure Project’ at the Scottish Civil Engineering Awards 2021 and for ‘Upgrade and Renewal Project’ at last year’s British Construction Industry Awards 2021. We were also finalists in Construction News Awards 2021 for ‘Best Large Project over £50 million’."
        },
        {
            "text": "The Glen Mallan Northern Ammunition Jetty is the third and final jetty refurbishment to support the nationally critical £7bn Queen Elizabeth Class (QEC) Aircraft Carrier programme. Professionally it’s been very satisfying to work on such an important project and it’s great to see this vital facility now in full operation."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}