{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/11/an-update-from-sir-patrick-vallance/",
    "title": "An Update From Sir Patrick Vallance",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Profession Updates"
    ],
    "pub_date": "2022-01-11T11:39:17+00:00",
    "content": [
        {
            "text": "When I reflect on the work of the Government Science and Engineering (GSE) Profession board in 2021, one of my most memorable moments was launching the Profession Strategy in July. It’s an ambitious plan that sets out our aim to increase STEM skills across government and place science and engineering at the heart of government capabilities and decision-making. It shows the commitment to embedding science and engineering in government and build truly diverse people-capability."
        },
        {
            "text": "In case you missed it, the strategy will deliver against six strands: expertise, interchange, inclusivity, learning and development, talent, and leadership.  The strands encompass recent success of the Profession, including the launch of our Diversity and Inclusion Strategy and our recognition offer, and provide direction for future work."
        },
        {
            "text": "Crucially, the GSE Profession Strategy aligns with the Declaration on Government Reform, where I, along with Sarah Healey, act as the senior sponsor of action 3: work with the Civil Service Commission to review how it can encourage entrants with specific, high-demand skills, particularly scientists and engineers. Science and engineering also appears across numerous Reform actions, many of which touch upon parts of the GSE Strategy."
        },
        {
            "text": "I’m looking forward to working with you all across the Profession to roll out the GSE Strategy and elements of the Government Reform agenda. We have a great spread of scientists and engineers within government: we have deep technical experts, those who work on science policy areas, and those scientists and engineers who bring a different way of thinking into broad policy areas. Each group is an integral part of our Civil Service, and we must champion ourselves and each other. We must look at each category carefully, understand how we can optimise the capability and capacity in each, and provide development opportunities that enable individuals to further their careers within and across these categories."
        },
        {
            "text": "Career-building is a critical area of the GSE Strategy and Declaration on Government Reform and fits in with the idea of “porosity”: helping scientists and engineers move more easily within the civil service and between academia, industry, the third sector, and government. This will help develop science capability on a large scale. Building secondments and exchange programmes, and championing the benefits of such schemes, will help harness science, engineering and technology in policymaking and services, as well as provide great development opportunities for individuals. It is our responsibility to develop and encourage these schemes and ensure they offer maximum benefit for all parties involved."
        },
        {
            "text": "Another of my objectives is driving change in the Fast Stream. It’s an amazing scheme that attracts some of the brightest and most talented graduates into the Civil Service. However, we need to increase the number of places on the Science and Engineering Fast Stream, as well as the proportion of participants on the Generalist scheme who have a STEM degree. We require the commitment from every department, agency and government body to address both of these challenges and ultimately increase STEM representation and expertise across the Civil Service."
        },
        {
            "text": "This year is a key time for us to pull this all together. As a result of the pandemic, where the importance of science has been thrust into the spotlight, there is strong understanding of how science can help in government. We need to build on this momentum to deliver the strategy and Declaration on Government Reform. Now is our opportunity to truly cement science and engineering in all aspects of government."
        }
    ]
}