{
    "url": "https://deframedia.blog.gov.uk/2022/01/11/coverage-of-the-biodiversity-net-gain-consultation-launch/",
    "title": "Coverage of the Biodiversity Net Gain consultation launch",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-11T10:40:47+00:00",
    "content": [
        {
            "text": "Environment Minister Rebecca Pow has announced plans to ensure wildlife can be better protected and enhanced in developments in the Biodiversity Net Gain consultation launched today. This has been covered positively in the Daily Express (p.2) and Yorkshire Post (p.11)."
        },
        {
            "text": "The proposals set out in the Biodiversity Net Gain consultation will help communities, planners, developers and Local Planning Authorities ensure new developments are “nature positive” – which means putting nature and biodiversity gain at the heart of all decision-making and design."
        },
        {
            "text": "As part of the launch, the Government has also announced a new funding pot of over £4 million to help Local Planning Authorities and other local authorities with planning oversight prepare for Biodiversity Net Gain which will become mandatory two years after Royal Assent of the Environment Act."
        },
        {
            "text": "The funding will help Local Planning Authorities expand ecologist resource and upskill ecologist teams, increasing their capacity to work with developers and communities to provide biodiversity gains by helping restore wildlife, plants and landscapes after building work has taken place."
        },
        {
            "text": "The Biodiversity Net Gain consultation closes on 5 April 2022 and can be found here."
        },
        {
            "text": "Environment Minister, Rebecca Pow, said:"
        },
        {
            "text": "“The pandemic has reinforced how much our homes, communities and outdoor spaces mean to us. Our commitment to protecting and enhancing our natural world can and must go hand in hand with our ambition to build more high quality homes."
        },
        {
            "text": "“Our plans to make sure new developments better protect and enhance wildlife and nature will create better places for people to live and work, and it will ensure we leave our environment in a better state for future generations.”"
        },
        {
            "text": "Tony Juniper, Chair of Natural England, said:"
        },
        {
            "text": "“Investing in Nature’s recovery is a vital national priority and biodiversity net gain is an ambitious and innovative mechanism to help do it. It has the potential to bring real-life benefits, including funding for Nature’s recovery, in the process ensuring we leave the natural environment in a measurably better state than it was before."
        },
        {
            "text": "“It is important to remember, however, that the starting point is to avoid harm in the first place, moving to net gain arrangements only in cases where developments meet all other planning requirements. I’m delighted that Natural England’s technical expertise was able to shape this policy and look forward to using it to secure better outcomes for Nature, while streamlining the planning process.”"
        },
        {
            "text": "Housing Minister Rt Hon Christopher Pincher MP said:"
        },
        {
            "text": "“By focussing on wildlife and nature in planning and development we can make sure that we protect and improve our cherished natural environment for future generations, as well as delivering the homes this country needs."
        },
        {
            "text": "This is all part of our plan to level up the country and transform our communities into places people want to live and work. I encourage all those in the housing industry to share their views in this important consultation.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}