{
    "url": "https://gott.blog.gov.uk/2022/01/11/government-publishes-the-rose-book-guidance-on-knowledge-asset-management-in-government/",
    "title": "Government publishes The Rose Book: guidance on knowledge asset management in government",
    "authors": [
        "Knowledge Assets Team"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2022-01-11T15:28:56+00:00",
    "content": [
        {
            "text": "The Knowledge Assets Team are pleased to announce that on 20 December, the Department for Business, Energy, and Industrial Strategy (BEIS) published The Rose Book (pictured below), which provides guidance on the effective management of public sector knowledge and innovation assets. The Rose Book is an updated version of the ‘Draft guidance on knowledge assets in government’ that was published in April 2021."
        },
        {
            "text": "The UK’s public sector continues to be a remarkable source of innovation, with recent innovations from the Royal Mint’s journey to manufacturing medical visors during the pandemic to the National Physical Laboratory’s pre-flight satellite calibration facility for underpinning climate missions which was presented during COP26 ."
        },
        {
            "text": "The Rose Book cover page"
        },
        {
            "text": "What are knowledge assets?"
        },
        {
            "text": "Frequent readers of our blog will be aware that knowledge assets are intangible assets such as research and development, Intellectual Property (IP), data sets and knowhow, and they are fast becoming the bedrock on which all successful modern business across the world are based. When successfully exploited, these assets can bring significant social, economic and financial benefits, making them fundamental to the effective delivery of government objectives."
        },
        {
            "text": "The government’s Knowledge Assets Programme is important for any public sector organisation holding intangible assets (including less obvious things like ideas, designs or other materials) that were developed inhouse. It will also be a contributing factor in helping to unleash a new wave of public sector innovation and cementing the UK’s reputation as a “science superpower”."
        },
        {
            "text": "The road to publishing The Rose Book"
        },
        {
            "text": "This newly published guidance is the culmination of extensive stakeholder engagement undertaken by the Knowledge Assets Team over the summer of 2021, to help further refine and improve the original draft guidance. This helped make the document easier to understand, more user-friendly, and useful for those across the public sector when implementing the knowledge assets work."
        },
        {
            "text": "To support public sector organisations with embedding the knowledge assets work and thinking about the best way to strategically manage them, a new chapter was created – a Quick Start Guide. This chapter provides additional useful tools for users such as a to do list, a worked example of how to initiate the work, an example knowledge asset management strategy, an example knowledge asset register, and a ‘triage process’ to help organisations prioritise which assets to protect or exploit."
        },
        {
            "text": "Alongside this, the document also explores the important concept of knowledge asset ownership. This is especially relevant if a public sector organisation were to engage with another third party in a contract agreement that would generate IP or knowledge assets. When IP rights or ownership are not set out, this could lead to issues around which party has the right to use the IP or knowledge asset at the end of the collaboration. To help guide public sector organisations in understanding this complicated landscape, a simplified model was developed with the key questions to consider, the different types of owners and types of rights available before organisations entered such contracts."
        },
        {
            "text": " What key changes will you find in The Rose Book?  "
        },
        {
            "text": "Your next steps"
        },
        {
            "text": " A number of public sector bodies have already begun to implement the recommendations of the guidance by appointing a Senior Responsible Owner (SRO) and beginning to draft a knowledge asset management strategy."
        },
        {
            "text": "The Knowledge Assets Team have built a network of SROs and knowledge asset champions from across government who meet regularly to discuss progress and share insight. But don’t worry if your public sector organisation is just getting started; the journey towards good knowledge asset management can sometimes be difficult to initiate. If you’d like any help or advice, please contact KAGuidance@beis.gov.uk and the team will be happy to support."
        }
    ]
}