{
    "url": "https://apprenticeships.blog.gov.uk/2022/01/11/greening-the-uk-economy-green-apprenticeship-advisory-panels-advice-to-trailblazers-begins/",
    "title": "Greening the UK economy - Green apprenticeship advisory panel’s advice to trailblazers begins",
    "authors": [
        "Jane Pierce"
    ],
    "categories": [
        "Apprenticeship standards"
    ],
    "pub_date": "2022-01-11T13:56:26+00:00",
    "content": [
        {
            "text": "The Institute has worked closely with the green apprenticeship advisory panel and the wider green community to review current apprenticeships against the National Green Jobs Taskforce Report and recommend to trailblazers where their products map to the needs of the green economy"
        },
        {
            "text": "Today (11 January 2022), the Institute has begun its programme of issuing emails to the first tranche of trailblazers letting them know the GAAPs recommendations. The email asks trailblazers for their commitment to help make any necessary changes or endorse the products as acceptable as they are."
        },
        {
            "text": "We have started with the trailblazers for occupations that support the green economy in the following themes."
        },
        {
            "text": "Throughout January, we will be emailing further trailblazers that align with the National Green Job Taskforce recommendations across the following key themes:"
        },
        {
            "text": "This is not the end of the conversation and once these themes have been covered we will continue to work closely with trailblazers and other stakeholders to support them to consider how other apprenticeships and technical qualifications can contribute to the government’s climate change targets and meet the needs of the green economy."
        },
        {
            "text": "We will be keeping you updated by a regular blog to let you know how we are getting on in securing commitments and taking the work forward into making relevant and necessary changes."
        }
    ]
}