{
    "url": "https://naturalengland.blog.gov.uk/2022/01/11/have-your-say-in-shaping-biodiversity-net-gain/",
    "title": "Have your say in shaping biodiversity net gain",
    "authors": [
        "Mel Hughes"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2022-01-11T15:21:36+00:00",
    "content": [
        {
            "text": "The passing of the Environment Act is a significant step in setting out clear targets and direction in environmental legislation for nature recovery. Key amongst these is the mandating of biodiversity net gain within the planning process. This will make it a requirement for all appropriate developments to deliver a minimum 10 per cent net gain in biodiversity; an important policy and a step in the right direction towards Government’s longer term ambitions for wider environmental net gains."
        },
        {
            "text": "The consultation on biodiversity net gain"
        },
        {
            "text": "The Defra led consultation on biodiversity net gain is crucial in the journey to becoming mandatory and Natural England is pleased to support Defra in this process."
        },
        {
            "text": "While the Environment Act 2021 sets out the core components (from the use of a metric, a system of national credits, a register of net gain and more), the details of how biodiversity net gain will work is still in development. Secondary legislation will help define how net gain will function day to day, covering areas from potential exemptions through to the reporting, evaluation, and monitoring of biodiversity net gain."
        },
        {
            "text": "Feedback from stakeholders, partners and interested parties alike is essential in the development of net gain policy and its delivery, which is why we would strongly encourage everyone to participate and engage where they can. The questions of the consultation have been designed to support the development of the secondary legislation and we cannot stress enough how important and valued your responses are in shaping net gain. It is your experiences and knowledge that can help make the implementation of mandatory biodiversity net gain a success."
        },
        {
            "text": "The public consultation is open now and will run until 5 April 2022. Whilst there will be future opportunities to get involved, this consultation is the turning point in defining the direction for the secondary legislation and guidance to come, so please use this opportunity to help steer net gain for you and your area of work."
        },
        {
            "text": "For those new to the concept, biodiversity net gain is an approach to terrestrial development and/or land management that aims to leave the natural environment in a measurably better state. For the principal of net gain to work in practice it requires many moving parts, frameworks, and tools to be in place."
        },
        {
            "text": "Natural England has been leading on developing a number of these frameworks and processes, working closely with Defra to support the delivery of biodiversity net gain as detailed in our previous blog post. The summer of 2021 saw Natural England introduce and publish the biodiversity metric 3, an updated calculation tool and supporting guidance for calculating biodiversity net gain linked to a project or development. Between now and biodiversity net gain becoming mandatory in winter 2023 we will continue to work closely with partners and stakeholders on all the core and component parts that make up biodiversity net gain."
        },
        {
            "text": "To leave you with a few final thoughts, not only is this an important opportunity to get involved, but it’s also a moment to reflect and think ahead. Take this time to think about how biodiversity net gain can and will be delivered within your local areas and its role in strategic plans or agendas being rolled out across England. How can we all work together, whether it’s a local partnership or through joint working, to achieve the best outcomes for both nature and people and what is it that you need to do so?\nTake part in the Defra consultation on biodiversity net gain here."
        },
        {
            "text": "Melanie Hughes\nNatural England Sustainable Development Programme Director"
        }
    ]
}