{
    "url": "https://educationhub.blog.gov.uk/2022/01/how-the-national-tutoring-programme-is-helping-young-people-catch-up-on-education-they-missed-because-of-covid-19/",
    "title": "How the National Tutoring Programme is helping young people catch up on education they missed because of Covid-19",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-01-11T09:47:12+00:00",
    "content": [
        {
            "text": "The National Tutoring Programme (NTP) is helping pupils across the country catch-up on missed time in school. It gives pupils access to one-to-one or small group teaching with specialist tutors. To date, over 300,000 tutoring courses began last term, on top of the 300,000 delivered in the previous academic year."
        },
        {
            "text": "Launched in November 2020, the NTP is proving essential in helping young people catch-up on lost learnings, with the evidence showing high quality courses of tutoring can help pupils make three to five months of progress."
        },
        {
            "text": "As schools manage the higher-than-expected absence among staff and pupils, the NTP will continue to offer access to tutoring through all three strands for the remainder of this academic year to ensure schools have greatest possible flexibility in offering pupils the support they need, including access to online tutoring."
        },
        {
            "heading": 3,
            "text": "So how does it work?"
        },
        {
            "text": "The National Tutoring Programme provides schools access to high quality subsidies tutoring through three separate routes - tuition partners, academic mentors, and school-led tutoring."
        },
        {
            "text": "These tutors – who have all been subject to robust high-quality training and safeguarding checks – can provide additional capacity to schools to support disadvantaged pupils who have been impacted by disruption to their education."
        },
        {
            "text": "There are three routes to tutoring - tuition partners, academic mentors, and school-led tutoring. Information on how the three routes operate can be accessed via the NTP website How to guide - NTP (nationaltutoring.org.uk)"
        },
        {
            "text": "While the three routes provide schools flexibility in selecting a tutor for their pupils, those schools looking to access high-quality tutors already chosen for them by the programme, they can do so through the selected group of Tuition Partners by visiting: Tuition Partners – NTP (nationaltutoring.org.uk). Schools can search for approved providers in their region and make an enquiry directly with their chosen provider."
        },
        {
            "heading": 3,
            "text": "Which pupils have access to the tutoring?"
        },
        {
            "text": "The NTP can only be accessed by schools for their pupils. The evidence shows this is the best way to make sure tutoring is effective, targeted and linked to what pupils are learning in school, as schools are best placed to decide which pupils will benefit the most."
        },
        {
            "text": "The NTP is open to all children and young people who need the most support catching up, including pupils with SEND. It has been developed to provide additional, targeted support to children and young people having lost time in education during the pandemic, with schools provided the flexibility to identify the pupils who will benefit the most."
        },
        {
            "text": "All state funded schools in England are able to access this additional resource to support disadvantaged pupils."
        },
        {
            "heading": 3,
            "text": "My child is already receiving tuition from their school. Can they access additional tuition?"
        },
        {
            "text": "Yes. If your child is already receiving one form of tuition through one of the three routes for example, school-led tutoring, they can access additional tuition through the others as long as their school identifies a need for them to do so."
        },
        {
            "text": "Parents are advised to inquire with their child's schools if they have any specific questions on tutoring available for their children."
        },
        {
            "heading": 3,
            "text": "And which subjects is tutoring available for?"
        },
        {
            "text": "The NTP provides tuition funding in six main areas:"
        },
        {
            "heading": 3,
            "text": "When is the tutoring delivered?"
        },
        {
            "text": "Tuition is very flexible and can happen in-school, either online or face-to-face, or during the school holidays. These arrangements will depend on individual circumstances such as suitability for schools and parents, and tutor availability."
        },
        {
            "text": "Tutoring sessions should be delivered at times convenient for both pupils and the school, for example, immediately before or after the school day. If tutoring is taking place during the holidays, it should happen broadly in line with school hours."
        },
        {
            "heading": 3,
            "text": "How do you know that tutoring works?"
        },
        {
            "text": "Evidence suggests that small group tuition can boost progress by an average of two months in secondary schools and four months in primary schools. By providing high-quality tuition to pupils through the NTP, we want to extend this catch-up opportunity to pupils whose education has been impacted the most by the COVID-19 pandemic."
        },
        {
            "heading": 3,
            "text": "How do I make sure my pupil’s school is getting involved?"
        },
        {
            "text": "For more information on tuition and any alternative additional support which may be available, please contact your child’s school."
        }
    ]
}