{
    "url": "https://dwpdigital.blog.gov.uk/2022/01/11/how-my-faith-helps-me-at-work-in-my-business-analyst-role/",
    "title": "How my faith helps me in my Business Analyst role",
    "authors": [
        "Mark Young – Business Analyst, DWP Digital"
    ],
    "categories": [
        "Business Analyst",
        "Diversity",
        "DWP Digital"
    ],
    "pub_date": "2022-01-11T12:34:12+00:00",
    "content": [
        {
            "text": "The third Sunday in January marks World Religion Day. It feels strange for me to be sharing something about faith as less than 10 years ago I confess to having no faith. Even earlier than that as a Philosophy student at university I was bewildered by those with faith.  "
        },
        {
            "text": "I work in DWP Digital as a Business Analyst, and much like my journey into Business Analysis, in my religious journey there are central people who inspired me to join the community, fed my passion and continue to support me to be better.  "
        },
        {
            "heading": 2,
            "text": "Taking the first step in faith "
        },
        {
            "text": "The turning point for me was a chance meeting with a vicar linked to my children’s school. We began talking at length about faith. He articulated what it was like to be a Christian and how he found and maintained his own faith. He openly and intelligently answered any questions I had. He then challenged me to take a first step of faith.  "
        },
        {
            "text": "I began to read about The Desert Fathers and re-read the philosophy of Soren Kierkegaard. I found a sudden hunger to read more and was introduced to a whole pantheon of Christian writers I had never heard of before. During this time, I was actively supported by others to understand and question what I was reading, while finding myself increasingly attending church. Christmas and especially Easter took on a whole new meaning. "
        },
        {
            "text": "Gradually over time I fell deeply in love with Christianity. I remember the exact moment I knew I had found faith for the first time. That love and joy has not left me once since and continues to grow. Faith doesn’t always make sense and prayer doesn’t always come easily but nothing I ever have loved makes sense in pure logical terms. Without that vicar and those who supported me I would not have the gift of faith. Chance plays its part and there is a real power to be found in communities.  "
        },
        {
            "text": "Faith calls you to action in all areas of life, to support those suffering or on the margins of life and to sacrifice your needs in service of others. For Christians it means adjusting your actions to be increasingly Christ-like.  "
        },
        {
            "heading": 2,
            "text": "Playing an active role "
        },
        {
            "text": "The more I learn, the more I take an active part in both my faith and work communities. For faith this is through home groups, visits to a local monastic community, being appointed to the church council, being appointed a school governor, studying theology and most enjoyably for me singing in the choir.  "
        },
        {
            "text": "At work I am part of several Christian groups who meet to share our faith. I have always had a natural ability to connect people to each other. I find people deeply interesting. I also love to solve problems. Faith calls you to use your talents in service and support of others. It’s a probable reason I became a Business Analyst and very likely why I take every opportunity to mentor or play a lead role in the Business Analyst community, for example, supporting the Learning and Development of other Business Analysts.  "
        },
        {
            "text": "Faith has also supported me through my BCS Business Analysis Diploma and now my Advanced Diploma journey (along with other certifications) and I’ve learned Maranatha, Lecto Divina, Taize and numerous forms of prayer.  "
        },
        {
            "text": "All of these have elements that enrich and strengthen each other. I see myself a work in progress and hope to never lose the passion to learn and continually challenge my biases. My daily prayer life affects everything I do, in every second of every day, taking the opportunity to reflect and adjust myself and my actions constantly. This all supports working hard with my team for the best outcomes, made using the best decisions, using the best analysis. Faith has a tangible power to transform, to re-frame and constantly heal and I try to bring this with me to my work each and every day. "
        },
        {
            "text": "Although an introvert I really enjoy social interactions where connectedness is at a deep level. The pandemic which started almost 2 years ago admittedly led to feelings of isolation, from friends, family and my faith community, which have had quite a profound effect on me. It feels in many ways like a grief for the loss of the life we had before. I found most of my strength on days of lockdown, trying to work while home-schooling my children and caring for my family and wider community, through my faith. "
        },
        {
            "text": " The Desert Fathers who I mentioned earlier were the forerunner of monastic communities and were based in the Scetes desert of Egypt. They served as a perfect example, a community kept alive during periods of active sustained isolation and affected by perpetual arguments, illness and attack, to focus on my faith and engagement and I drew great comfort from that ancient wisdom.  "
        },
        {
            "text": "With faith for me there is no work and home divide. For all the right reasons faith permeates everything. "
        },
        {
            "heading": 2,
            "text": " Join us"
        },
        {
            "text": " "
        }
    ]
}