{
    "url": "https://deframedia.blog.gov.uk/2022/01/11/how-the-environment-agency-responds-to-pollution-incidents/",
    "title": "How the Environment Agency responds to pollution incidents",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-11T16:10:16+00:00",
    "content": [
        {
            "text": "There are reports today on claims that the Environment Agency (EA) has told staff to “ignore” lower impact pollution events – known as Category 3 and 4 incidents – as part of a triage process."
        },
        {
            "text": "The EA receives over 100,000 incident reports a year, every one of which is recorded and assessed. Like every other public sector organisation with finite resources, the EA focuses its efforts on where they will have the most impact – so those which pose the greatest risk to the environment."
        },
        {
            "text": "This is something the EA has spoken about previously, including in a blog from its Chief Executive last year. This reiterates that across everything the EA does “we will always do the best we can with the money we have for the people and places we serve.”"
        },
        {
            "text": "The EA’s full statement is below."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "“We focus our incident response effort on those pollution incidents which pose the greatest risk to the environment."
        },
        {
            "text": "“Our Incident Triage Project is looking at how we can best use our resources and maximise benefits for the environment. While we continue to attend the most serious incidents we concentrate our efforts on our regulatory activities which prevent incidents from happening in the first place. Intelligence from incident reporting helps us to plan and prioritise our work to protect the environment ”"
        },
        {
            "text": "It is also worth noting that the figures quoted in media coverage represent the total number of incident reports the EA receives each year. That includes multiple and duplicate reports about the same cases, as well as unsubstantiated events, rather than distinct incidents. As stated above, every incident is logged and assessed so that officers can target interventions where they are most needed."
        },
        {
            "text": "If members of the public wish to report an environmental incident, they should do so by calling 0800 80 70 60."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}