{
    "url": "https://mojdigital.blog.gov.uk/2022/01/11/how-hmpps-cross-agency-collaboration-is-set-to-help-reduce-re-offending-rates/",
    "title": "How HMPPS cross-agency collaboration is set to help reduce re-offending rates",
    "authors": [
        "Jane Stead"
    ],
    "categories": [
        "collaboration",
        "Content",
        "Content Hub Team",
        "Our services"
    ],
    "pub_date": "2022-01-11T12:54:37+01:00",
    "content": [
        {
            "text": "In the Content Hub team's first blog, we talked about research we did into Young Offender Institutions (YOIs) that informed the very specific content created to launch the Hub into HMYOI Cookham Wood."
        },
        {
            "text": "In this second blog, we're talking about how we worked with that YOI and also across the rest of the youth estate and youth sector agencies to expand the impact of the Hub on reducing re-offending and improving re-settlement."
        },
        {
            "text": "Digital and Comms Managers inside are raising the game"
        },
        {
            "text": "As well as re-creating the Content Hub specifically for YOIs, another part of the Hub's success has been the recruitment of a local prison-based Digital and Comms Manager (Band 5)."
        },
        {
            "text": "Without 'people on the ground' that understand the value and potential of in-cell technology, as well as what is happening day-to-day in their establishment, the Hub could not stay fresh, current and 'alive'. If the content gets stale, the boys can soon think it's boring or a waste of their time. The Hub is a hungry beast. And we need staff at each Hub site to regularly feed it."
        },
        {
            "text": "This can be a video update from the Governor or Chaplain, or an interview about a new training course offered, exercise videos to do in-cell or a new audiobook about addiction. But the content must keep changing. For this to happen, Paul Philby joined to continue the process the Content Hub team had started."
        },
        {
            "text": "Before going LIVE into Cookham Wood, we wrote 'detailed guides' for the manager, so he could:"
        },
        {
            "text": "A huge part of the Digital and Comms Manager getting up to speed so quickly was down to the work of Sophie Dodds, the Content Designer who distilled two years' worth of 'joint team knowledge' about building and creating content for the Hub into a 60 page document. This began at what the Hub is and why it exists, how to use Drupal, the taxonomy of building content into the Hub, the various content 'types', to licensing and copyright and formatting, to 'authentic' tone of voice and writing style, accessibility, gender-neutral text, legal language, words and phrases to avoid, sourcing images, sizing photos, editing videos and creating audio. It's a 3 year media course condensed into a simple document. No mean feat."
        },
        {
            "text": "Guiding and training has meant we have built a strong relationship with our Digital and Comms Manager on the ground and get to talk with Paul regularly. Collaboration has led to a useful and professional piece of content - a 35 minute video of a boy transitioning from a Cookham Wood YOI to HMP Isis (an adult prison). This is a frightening time for boys so for them to be able to watch what happens before they go has been very well received."
        },
        {
            "text": "Strong links to the local manager Paul have proved vital in keeping the pilot running smoothly, discussing unusual feedback, researching how and why things are happening and to note lessons learned for the next pilot sites. It's a steep learning curve for all involved, at every pilot stage. So this Media Guide will be given to all future Digital and Comms Managers, as they gradually take over responsibility for the Hub in their establishment, freeing up the Content Hub team to move on to teaching and guiding managers in the next prison rollouts while enabling more national content."
        },
        {
            "text": "How cross-agency collaboration has doubled potential"
        },
        {
            "text": "Working with Kate Jones from the Youth Custody Service (YCS) reform team leading on Digital, we set up a working group with HMPPS experts from YCS in education, resettlement, safeguarding, psychology and comms making this a broad cross-agency collaboration."
        },
        {
            "text": "Investing time and expertise in the Hub working group we now have various functional leads across YOIs (including the lead for girls), experts in Diversity and Inclusion, the Business Change team at HMYOIs Feltham, Cookham Wood, Wetherby and Werrington, the YCS comms team, the YCS psychology team, Secure Schools and Estate managers, and representatives from the Youth Justice Board (YJB)."
        },
        {
            "text": "Many ideas are in planning:"
        },
        {
            "text": "This mix of Content Hub team, the national YOI estate, YCS and YJB experts as well as a Cookham Wood manager, all working together on a daily/weekly basis as part of a highly-integrated team means more meaningful, creative and accessible content, will eventually flood the Hub. This should increase its potential to deliver more effective and efficient services for young people in custody, as well as providing access to modern technology to improve children's digital capability rendering them more employable."
        },
        {
            "text": "Local benefits to staff and boys in Cookham Wood"
        },
        {
            "text": "From reaching out to the wider influences in the youth estate, we can also reflect on the day-to-day benefits to YOI staff and users."
        },
        {
            "text": "Staff can now use the Content Hub to:"
        },
        {
            "text": "Children in the YOIs can now:"
        },
        {
            "text": "Prison Leavers' project"
        },
        {
            "text": "We hope to use the Content Hub to directly engage residents about the new Prison Leavers project. With 88% of offenders not in work 6 months after release and high homelessness rates (increasing recidivism risk), we'll be focusing even more on authentically-voiced audio and video content about the issues found in the Prison Leavers discovery and what people need to avoid crime."
        },
        {
            "text": "Much of our content reflects this already, but we can do better if we link up access both inside and outside in the community to:"
        },
        {
            "text": "Where do you come in?"
        },
        {
            "text": "The Hub's continued success is down to so many people in HMPPS."
        },
        {
            "text": "As we carry on with national rollout, (we are now LIVE in 9 sites), the Content Hub team continues to expand and improve the Hub to nudge people toward rehabilitation and finding a better path."
        },
        {
            "text": "We've had interest from all around the world as people see it as a positive step to help children and adults get well, learn to trust others and keep trying to rebuild their lives. And to keep trying until that one time when it fits into place. Figures show that a life in crime can be as hard to kick as any addiction."
        },
        {
            "text": "But we believe the Hub will be pivotal in the future well-being, education, rehabilitation, and communication between all staff and all residents. Not only onsite staff, but those throughout the HMPPS and charities and relevant agencies."
        }
    ]
}