{
    "url": "https://insidehmcts.blog.gov.uk/2022/01/11/letter-of-thanks-from-kevin-sadler-acting-ceo-hmcts/",
    "title": "Letter of thanks from Kevin Sadler",
    "authors": [
        "Kevin Sadler"
    ],
    "categories": [
        "Court and tribunal reform",
        "General"
    ],
    "pub_date": "2022-01-11T12:00:50+00:00",
    "content": [
        {
            "text": "Dear Colleague,"
        },
        {
            "text": "Happy New Year. I hope you had a good festive break. I am delighted to write to you, at the start of the year, to reflect on what we’ve achieved together in 2021 and set out our focus for 2022 and beyond."
        },
        {
            "text": "Firstly, I want to thank all of you involved in the justice system for your continued dedication, professionalism and support for courts and tribunals and all those who use them.  Looking back at 2021, despite the challenges, we kept our courts and tribunals open and continue to keep users safe, increase capacity, and roll out technology to respond to, and recover from, the impact of COVID-19. This year, we’ll continue to focus on response, recovery, and reform to build a courts and tribunals system that is as resilient as it possibly can be in the future. I’m very grateful for your support and collaboration over the last two years. We have worked together, successfully, to develop and comply with evolving safety measures; operate from Nightingale courts and super courtrooms; progress our use of technology and adapt to remote hearings; and embed digital services from probate to divorce. Please pass on my gratitude to your colleagues."
        },
        {
            "text": "While MS Teams ensured I kept connected while COVID restrictions were in place, my in-person visits have been powerful reminders of the collective effort it takes to run – and the accumulative impact we have on – the justice system. Nothing compares to walking alongside my colleagues, seeing the cross-agency teamwork required to organise a hearing, listening to the experiences of ushers and court clerks, watching how systems are used, experiencing some of the impracticalities of our buildings, meeting judges and practitioners, observing parties in a case and feeling the intensity of the courtroom. In response to the current variant of COVID-19, we continue to follow Government and UK Health Security Agency (UKHSA, formerly Public Health England) guidance and are confident that we are continuing to embed existing control measures effectively."
        },
        {
            "text": "As always, I ask that you and your colleagues are mindful of your own safety and that of others, and that you follow all the arrangements in our buildings as well as wider Government advice as it continues to emerge."
        },
        {
            "text": "In the face of adversity, our collective hard work is making a difference whether that is in the criminal courts, tribunals, or the family and civil courts. There remain, of course, many challenges and there is still a long way to go to recover completely. But I cannot overstate my thanks to you for the role you played. For giving your time to meet regularly with us in HMCTS, providing invaluable insight and directly supporting the development of our plans across jurisdictions. I’m sure the road ahead will be far from easy. But whatever this year brings, I know we can overcome those challenges together."
        },
        {
            "text": "Yours sincerely,"
        },
        {
            "text": "Kevin Sadler CBE"
        },
        {
            "text": "Acting Chief Executive, HM Courts and Tribunals Service"
        }
    ]
}