{
    "url": "https://civilservice.blog.gov.uk/2022/01/11/money-matters/",
    "title": "Inside Policy: Money Matters   ",
    "authors": [
        "Tej Gor"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-01-11T09:32:14+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Since its launch in September 2018, 264,000 people have opened a Help to Save account giving them a money buffer to keep them going through tough times."
        },
        {
            "text": "Research by the Money Advice Service in 2016 revealed that four in 10 (16.8 million) working-age people across the nation had no savings buffer, with less than £100 in savings available at any time.  "
        },
        {
            "heading": 4,
            "text": "Collaboration across government"
        },
        {
            "text": "To tackle the problem, NS&I Government Payment Services (NS&I GPS) worked together with HM Revenue & Customs, HM Treasury and the Department for Work and Pensions to design and deliver the Help to Save (HTS) scheme in just two years."
        },
        {
            "text": "From the outset, Help to Save was designed as an innovative UK savings account to empower working people on low incomes to build their savings and encourage a regular saving habit to give them a buffer against financial shocks. "
        },
        {
            "heading": 4,
            "text": "Biggest challenge"
        },
        {
            "text": "Creating a flexible savings scheme not only presented a huge policy challenge - it was coupled with the added issue of how to make the savings scheme attractive to targeted savers in the first place. "
        },
        {
            "text": "What really fired up the team was the knowledge that the savings scheme would directly support financially vulnerable people in receipt of Universal Credit or Working Tax Credits - potentially helping up to 3.5 million working people. If we pulled it off, it would encourage thousands of people to put aside savings for the first time in their lives."
        },
        {
            "text": "The programme team adopted a highly collaborative approach and worked flexibly across all four organisations involving more than 100 colleagues across areas from Policy, IT, Finance, Legal and Operations, led by Dax Harkins from NS&I and Shimon Fhima from HMRC. "
        },
        {
            "heading": 4,
            "text": "Overcoming the challenges   "
        },
        {
            "text": "Help to Save was announced in January 2016 with a challenging target date for accounts being available by April 2018. "
        },
        {
            "text": "Following a public consultation, NS&I Government Payment Services was selected as the single Help to Save account provider. Key to this decision was NS&I GPS’s proven track record of delivering digital banking services in collaboration with other government departments such as the Ministry of Justice (Court Funds Office), HM Treasury (Equitable Life Payments Scheme) and HMRC (Tax-Free Childcare and 30 hours). HMT, HMRC and NS&I GPS teamed up to ensure the seamless transition from policy definition into programme delivery and target commencement of the public trial by January 2018.  "
        },
        {
            "text": "The success of this approach is evidenced by almost 100% of Help to Save transactions being conducted digitally end-to-end. This is testament to successful design and implementation of the digital service using our proven customer experience labs with individuals selected from the target population."
        },
        {
            "heading": 4,
            "text": "Unachievable"
        },
        {
            "text": "One of the toughest challenges in any project is knowing when to say no, and having the courage to do just that. We faced that challenge up front when we assessed that the original HTS service solution specification was unachievable within the budget constraints."
        },
        {
            "heading": 4,
            "text": "Redefining the service"
        },
        {
            "text": "Strong leadership, transparency and mutual trust enabled better coordination across departments to redefine the Help to Save service, so that the main policy objectives were achieved on time and at a lower cost to limited taxpayer funds.     "
        },
        {
            "text": "Digital-by-default, system interoperability and simplicity were at the core of the design and implementation of the HTS service from the outset. NS&I GPS worked collaboratively with HMRC, HMT and DWP to deliver the service and utilise, where possible, existing IT systems and data to deliver the project on time and budget. "
        },
        {
            "heading": 4,
            "text": "Public trial"
        },
        {
            "text": "The diverse departmental teams worked across government to ensure the end-to-end service was successfully designed, developed and tested as a single programme to deliver a seamless customer experience with the public trial starting as planned in January 2018.  "
        },
        {
            "text": "Key to this approach was learning and implementing key lessons learned from the earlier collaboration between NS&I GPS and HMRC in implementing the Tax-Free Childcare and 30 hours policies - the joined-up digital Childcare Choices Service. This ensured that the strengths of each department‘s capabilities were brought together in a collaborative and better coordinated project, to deliver a more joined-up service with clear focus on customer outcomes and keeping paper to the absolute minimum.  "
        },
        {
            "text": "The combined team also worked with external stakeholders, such as the Money Advice Service, and individuals from the eligible population, to ensure the service reflected user needs and met the policy aim of empowering more people to become regular long-term savers. "
        },
        {
            "text": "Launched in September 2018, the scheme was an early success, and within just seven months, more than 50,000 people signed up and opened a savings account. The Help to Save programme was even held up as an exemplar in an Office of Government Commerce Readiness for Service Review."
        },
        {
            "text": "MoneySavingExpert.com founder Martin Lewis praised HTS in September 2018 saying: “It's a very clever scheme and one that will work for many people.”"
        },
        {
            "heading": 4,
            "text": "And the verdicts?"
        },
        {
            "text": "“The Help to Save scheme encourages you to become a dedicated saver and that saving regularly pays off. And it’s such an easy system to use - it’s all online, you make the payment from your card. The first thing that surprised me was the amount of interest you get on the savings account. I thought it was fantastic. Now our goal is to get on the property ladder. Our dream is to own a house with a garden for the children.”  Kaye, Help to Save customer "
        },
        {
            "text": "“We have a close collaborative relationship with the NS&I Help to Save team and this is a really positive example of cross-departmental programme and service delivery. Excellent customer experience has been a priority from the start, and we have worked hard to provide a service which delivers this.”  Richard Forster, HMRC"
        },
        {
            "text": "“The Help to Save scheme demonstrated how a strong collaborative approach across multiple government departments can result in the effective delivery of a programme. It’s a clear example of delivering policy objectives for government successfully in partnership with other departments.” Dax Harkins, NS&I "
        },
        {
            "heading": 4,
            "text": "Scheme success "
        },
        {
            "text": "Within three years of launch, 264,000 UK citizens have opened savings accounts, and collectively saved more than £142 million. The scheme has demonstrated that it’s never too late to teach good money habits, set saving goals, provide a place to save and offer valuable incentives to encourage citizens to save money. "
        }
    ]
}