{
    "url": "https://educationhub.blog.gov.uk/2022/01/11/ventilating-classrooms-to-reduce-the-spread-of-covid-19-doesnt-mean-pupils-need-to-be-cold-heres-why/",
    "title": "Ventilating classrooms to reduce the spread of Covid 19 doesn’t mean pupils need to be cold – here’s why",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2022-01-11T10:01:02+00:00",
    "content": [
        {
            "text": "Good ventilation prevents the virus hanging in the air and infecting people. Many areas of schools are already well-ventilated with plenty of air movement but we want to help schools identify where and when ventilation can be improved."
        },
        {
            "text": "We took action in the autumn term by providing carbon dioxide (CO2) monitors to all state-funded education settings, including early years, schools and further education providers, backed by £25million in government funding. Across the education estate we’ve delivered over 353,000 monitors. The new monitors enable staff to identify areas where ventilation needs to be improved and provide reassurance that existing ventilation measures are working."
        },
        {
            "text": "In many cases the first step teachers can take is to open windows and doors to improve air flow. But that doesn’t mean classrooms have to be cold. Here’s why:"
        },
        {
            "heading": 3,
            "text": "Partially opening windows – or opening them for a short period - can still improve ventilation."
        },
        {
            "text": "The DfE-funded CO2 monitors are being used to help settings understand where and when they need to improve ventilation while balancing warmth."
        },
        {
            "text": "The Health and Safety Executive has said that “partially opening windows and doors can still provide adequate ventilation.”"
        },
        {
            "text": "Only opening windows for 10 minutes an hour can help reduce the risk from virus in the air – and where possible this can happen when the room is empty in the periods between lessons, for example."
        },
        {
            "text": "Where this isn’t an option opening higher up windows or vents causes fewer draughts, as does opening other windows by a small amount. Opening the doors to classrooms helps too."
        },
        {
            "text": "Cath Noakes, Professor in Environmental Engineering for Buildings at Leeds University is an expert in ventilation. Last year she used Twitter to explain how air flow in buildings changes in different weather and set out how it’s only necessary to open windows by a small amount in the winter to make a big difference."
        },
        {
            "heading": 3,
            "text": "Not all areas of schools will require additional ventilation"
        },
        {
            "text": "The CO2 monitors we’ve given schools help them find which areas need extra ventilation. The feedback we‘ve had from schools suggests they are finding the monitors helpful in the management of ventilation and that in the majority of cases existing measures are sufficient. In many cases schools are well ventilated – particularly newer builds, many of which have built in ventilation systems."
        },
        {
            "heading": 3,
            "text": "Free air cleaning units are available to those that need them most – those settings where adequate ventilation isn’t possible and other settings can buy suitable units at competitive rates through our online marketplace"
        },
        {
            "text": "The air cleaning units will make sure that in areas where ventilation isn’t possible, the spread of the virus in the air can still be reduced. But it’s important to say that air cleaning units aren’t an excuse to decrease a ventilation or close a window and therefore should be seen as a temporary fallback rather than an alternative to opening a window. Where settings are using air cleaning units, existing ventilation measures should be maintained."
        },
        {
            "heading": 3,
            "text": "Schools should let pupils dress accordingly if they are aware classrooms are cooler than usual. "
        },
        {
            "text": "Uniform rules should be reviewed to make sure all pupils can dress suitably at all times."
        }
    ]
}