{
    "url": "https://earlyyears.blog.gov.uk/2022/09/30/committee-run-childcare-what-you-need-to-know/",
    "title": "Committee-run childcare – what you need to know",
    "authors": [
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Committee-run childcare"
    ],
    "pub_date": "2022-09-30T09:03:35+01:00",
    "content": [
        {
            "text": "Alex discusses what committee-run childcare is and our role in checking the suitability of committee members, trustees and directors."
        },
        {
            "text": "What is committee-run childcare?"
        },
        {
            "text": "Some childcare providers operate through committees, trustees or directors. This means that providers may reach out to parents or members of the community to ask them to join a committee or become a trustee or director."
        },
        {
            "text": "When this happens, it is important to check if the provider is asking you to join a parent committee (to help with fundraising, for example) or if they are asking you to join the parent committee that has legal responsibility for the setting. These are different roles."
        },
        {
            "text": "How we check suitability"
        },
        {
            "text": "Ofsted must assess and decide that everyone who has a legal responsibility for running the childcare is suitable for that role."
        },
        {
            "text": "To do this, we carry out suitability checks using the information that a provider submits on completed EY2 and EY3 forms. This is the only way we know about any new committee members, trustees or directors, so it’s important that these forms are submitted to us online as soon as possible. It is a provider’s responsibility to ensure that we have received the information that we need to carry out the required suitability checks to add them to the registration."
        },
        {
            "text": "You and the provider will receive a suitability decision letter once we have completed all our checks. If you have not received this letter, it means that we are still determining your suitability. You can log on to your online account at any time to check the progress of your application. We will contact you through your online account if we need more information, so it is important to check it regularly until you receive your suitability letter. You can contact us if you are having trouble accessing your online account."
        },
        {
            "text": "Providers should remember that until they receive their suitability letter, the new committee member, trustee or director has not been fully checked."
        },
        {
            "text": "The usual suitability checks we will carry out are:"
        },
        {
            "text": "We may carry out other checks if we judge it necessary in order to determine whether a person is suitable."
        },
        {
            "text": "What does being a committee member, trustee or director mean?"
        },
        {
            "text": "When you are a committee member, trustee or director for a registered provider, this means that you are partly legally responsible for the setting. This includes:"
        },
        {
            "text": "We need to be sure that people in these roles are suitable and we will check we have the correct information during an inspection or whenever we visit the setting."
        },
        {
            "text": "It is an offence not to keep Ofsted informed of the correct information. The early years foundation stage (EYFS) states that all registered early years providers must notify us of any changes to any individuals who are directors, trustees, secretaries or other members of a provider’s governing body, such as committee members. We should be notified of a change within 14 days. This means that new committee members should obtain their DBS certificate and submit their EY2 form as soon as possible."
        },
        {
            "text": "When completing visits to a provider, we check the committee information. If we do not hold the correct information for the committee, the inspector will refer to this in the inspection report. This may then impact on the outcome of the inspection."
        },
        {
            "text": "Being legally responsible for a provider means that the committee, trustees or directors are the employers of the staff and are legally and financially responsible for the business. They are also responsible for making sure that the EYFS requirements are met. Each individual makes up the overall registered provider and is equally responsible and accountable for the provision. For example, if we find a provider is not meeting requirements, we will address any letters that we need to send to the registered provider. This will be the committee, trust or limited company and not an individual person."
        },
        {
            "text": "Please make sure that you have checked recently all the details of committee members, trustees or directors and that these are up to date."
        }
    ]
}