{
    "url": "https://deframedia.blog.gov.uk/2022/09/30/daily-mail-and-independent-coverage-on-government-tree-planting-targets/",
    "title": "Daily Mail and Independent coverage on Government tree planting targets",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-09-30T14:34:52+01:00",
    "content": [
        {
            "text": "There has  been coverage in the Daily Mail and Independent today on the Government’s tree planting targets and claims we missed targets by more than half last year."
        },
        {
            "text": "This is inaccurate as the manifesto commitment to reach 30,000ha of tree planting per year in the UK isn’t due to be met until May 2024."
        },
        {
            "text": "We are making good progress towards the target. We increased tree planting and woodland creation in England to c.2,700 hectares in 2021/22. Government funding directly supported the planting of 2,416 hectares of this new planting, which corresponds to about 4 million trees. Scotland and Wales also increased their tree planting rates."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "It is a stretching target and it is not as simple as just putting trees in the ground – it is about getting the right tree in the right place and supporting their growth."
        },
        {
            "text": "We know there is more work to do, but we have a strong pipeline of planting projects supported through the Nature for Climate fund. As we approach the start of the planting season, will be working closely with all our partners to ensure we get as many tree projects off the ground as possible."
        },
        {
            "text": "We have launched the England Woodland Creation Offer for farmers and landowners  and are supporting the planting of trees outside of woodlands through the Urban Trees Challenge Fund and Local Authority Treescapes ."
        },
        {
            "text": "In addition to this we are investing millions of pounds to boost the capacity of the trees & forestry sector, increasing the number of skilled foresters for the future, and ensuring we have the seed source and saplings we need to meet our targets."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}