{
    "url": "https://teaching.blog.gov.uk/2022/09/30/four-reasons-to-take-an-npq-this-year/",
    "title": "Four reasons to take an NPQ this year",
    "authors": [
        "Various authors"
    ],
    "categories": [
        "Professional Development",
        "School funding"
    ],
    "pub_date": "2022-09-30T11:37:58+01:00",
    "content": [
        {
            "text": "National Professional Qualifications (NPQs) are designed to provide training and support for teachers and school leaders at all levels and help deliver improved outcomes for young people. We invited participants to share why now is a good time to consider taking an NPQ. "
        },
        {
            "text": "1. NPQs are completely free to take "
        },
        {
            "text": "As a school leader – NPQs are such good value for money. Across my school and trust we recognise this cost effectiveness and have really responded to this, by finding the capacity and releasing staff to support them to do it. "
        },
        {
            "text": "Becky Austwick, principal at Bentley High Street Primary School  "
        },
        {
            "text": "The funding that is being put towards NPQs is brilliant as it means we can get more people than ever engaged in CPD without worrying about the cost. This scale means that we should see a system-wide impact on pupil outcomes.  "
        },
        {
            "text": "Dave Ellison-Lee, director of education at RISE multi-academy trust "
        },
        {
            "text": "Professionals in state-funded organisations across the sector can access fully funded training scholarships.  "
        },
        {
            "text": " 2. They're flexible, so you can fit them around your work and personal life."
        },
        {
            "text": "I arrange my online learning and face to face coaching sessions around my day-to-day schoolwork, at a time convenient to me and my responsibilities. I know in advance what work, study and application is required of me, so I can easily plan these and make time to complete them. "
        },
        {
            "text": "Sarah Jones, subject leader at Redborne Upper School and Community College, Senior Leadership participant "
        },
        {
            "text": "The mix of the online learning and face-to-face interactions is fantastic. The flexibility and communication around the deadlines and submission of work has been great and has had a minimal impact on my existing commitments. "
        },
        {
            "text": "Alex Roberts (pictured), head of year at Hitchin Boys School, Leading Teaching participant "
        },
        {
            "text": "NPQs were developed in collaboration with teachers and leaders to be  completed flexibly around a variety of responsibilities. Research shows that participants spend an average of 1 to 2 hours each week studying their chosen qualification.  "
        },
        {
            "text": " 3. The qualifications help you to expand your professional networks. "
        },
        {
            "text": "Normally I would gravitate to lots of other secondary heads, whereas now I’m also networking with primary heads, heads of special schools, heads of alternative provision etc., I feel my understanding of education in the current situation is a lot wider, so I’ve found that really useful. "
        },
        {
            "text": "Joanna Postlethwaite, headteacher at Somervale Secondary School, Somerset, Executive Leadership participant "
        },
        {
            "text": "Meeting people from lots of different locations and lots of different settings has been really valuable for my development and we get a real buzz from talking to each other. "
        },
        {
            "text": "Tiffany Pope, deputy headteacher at Penpol School, Headship participant "
        },
        {
            "text": "During your study, you’ll take part in a mixture of face-to-face sessions, online learning and self-directed study. This means you’ll be able to meet professionals in your local area to share your learning, experience, and best practice. "
        },
        {
            "text": " 4. The qualifications are designed to work in settings like yours. "
        },
        {
            "text": "My first module was challenging, interesting and it all seemed relevant. I liked the ability to cut information and save it as I have been able to refer back to it again and again."
        },
        {
            "text": "Joshua Levenson, Headteacher at St Andrew's Catholic Primary School,  "
        },
        {
            "text": "I have found this unit extremely helpful in reflecting on current practice and planning next steps in my role. "
        },
        {
            "text": "Julia Helen Eley, Head of School at St Cuthbert's Catholic Primary School, Chester-Le-Street "
        },
        {
            "text": "NPQs were developed alongside sector experts to ensure that the content of each qualification is rooted in the best available evidence and relevant to settings across the country. "
        },
        {
            "text": " "
        },
        {
            "text": " Want to receive blog posts in your inbox?\nSign up to receive blog updates"
        }
    ]
}