{
    "url": "https://grantscommunity.blog.gov.uk/2022/09/30/how-to-boost-your-grant-making-skills/",
    "title": "How to boost your grant-making skills",
    "authors": [
        "govtgrantscommunity",
        "alisonlong"
    ],
    "categories": [
        "Civil Service",
        "Government Grants Management Function",
        "Learning and development"
    ],
    "pub_date": "2022-09-30T16:20:54+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Are you making time for training and professional development?"
        },
        {
            "text": "It’s always the same. You are incredibly busy at work completing those urgent tasks before the dreaded ‘cop’ deadline - close of play - and something gives… and it's usually training. How many webinars, listen and learns and presentations have you booked on to with good intentions and then had to cancel at the last minute because of the screaming inbox?"
        },
        {
            "text": "And it's no different for grant practitioners who have been particularly busy during the pandemic, awarding funding quickly, efficiently and safely. Did you realise that grants represented 25% of government spend in 2021/22? "
        },
        {
            "text": "Now, more than ever, it is important that grant practitioners  make time to keep their skills up to date, embracing best practice and new technologies, to be able to work efficiently and effectively. "
        },
        {
            "text": "The Government Grants Management Function (GGMF) is here to help with a wide range of learning and development opportunities, from online webinars, best practice case studies, residential courses and in person training sessions. The training is tailored to your needs and your stage in your career. We follow the 70/20/10 training model - 70% on the job, 20% peer to peer and 10% classroom learning "
        },
        {
            "heading": 2,
            "text": "GGMF Licence to Practise programme"
        },
        {
            "text": "For those wanting to develop a thorough understanding of grant-making and achieve a government recognised accreditation, we have launched and continue to develop the Grants Licence to Practise programme. Aimed at officials in government departments and their agencies, it enables you to become a more competent and confident grant practitioner. "
        },
        {
            "text": "The pace of learning is set by you and, when you are ready, you submit a final portfolio for assessment. On successful completion of the development programme, you will be awarded the Grants Licence to Practise accreditation, in compliance with the Grants Functional Standard, to maximise policy outcomes and minimise risks. "
        },
        {
            "text": "We use a mix of theory and practical activities to support you to develop the essential knowledge and skills required to manage government grants. "
        },
        {
            "text": "And we’ve gone ‘old school’. The programme includes a 5-day grants residential to cover all aspects of grant management and enable learners to network with peers across government and share best practice and ask questions. "
        },
        {
            "heading": 2,
            "text": "Mudassar’s story - Home Office"
        },
        {
            "text": "But don’t take it from us - what do our learners think about the GGMF training options? Here are reasons why Mudassar registered on the Licence to Practise programme:"
        },
        {
            "text": "Head over to the Cabinet Office YouTube channel for the Licence to Practise video and meet Mudassar."
        },
        {
            "heading": 2,
            "text": "Call to action"
        },
        {
            "text": "Please contact ggmfcapabilityteam@cabinetoffice.gov.uk if you want more details on GGMF training courses and Licence to Practise Programme. "
        },
        {
            "text": "With your gov.uk email address, you can also access the Grants Centre of Excellence for training resources, guidance and templates. "
        },
        {
            "text": "We’d love to hear from you and your learning experiences. What’s worked for you? How did you keep up to date with the latest developments and best in class practices? "
        }
    ]
}