{
    "url": "https://insidedio.blog.gov.uk/2022/09/30/maintaining-and-protecting-woodlands-on-the-uk-defence-training-estate/",
    "title": "Maintaining and protecting woodlands on the UK Defence Training Estate",
    "authors": [
        "Judith Peachey"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Forestry",
        "Landmarc",
        "Sustainability",
        "Wildlife"
    ],
    "pub_date": "2022-09-30T10:44:08+00:00",
    "content": [
        {
            "text": "Woodland at Sennybridge [Copyright Finn Beales]"
        },
        {
            "text": "Did you know we're right in the middle of Forest Week, and that the UK Defence Training Estate is made up of  20,000 hectares of woodland? To help celebrate Forest Week, Judith Peachey, Forestry Harvesting & Arboricultural Manager at Landmarc, explains Landmarc and DIO’s role in maintaining and protecting the woodlands that play an essential role in supporting military training across the UK."
        },
        {
            "heading": 2,
            "text": "Forestry and harvesting on the Defence Training Estate"
        },
        {
            "text": "The Defence Training Estate sits on a vast rural estate, comprising some of the most valuable habitats and landscapes in the UK. This includes 20,000 hectares of woodland and more than 22 million trees. These forests and woodlands provide vital training environments for our troops, homes for a wide range of wildlife and a source of key wood products."
        },
        {
            "text": "Working with DIO’s foresters and Landmarc’s regional forestry teams, my primary objective is to provide a safe place for military training and create a woodland environment that troops can use to achieve their training objectives. However, we also have a strong focus on long term forestry management, biosecurity and plant health across the range of woodlands that we manage. With trees increasingly being a method of helping to meet climate goals, the importance of forestry on the training estate is ever increasing."
        },
        {
            "heading": 2,
            "text": "The effects of climate change"
        },
        {
            "text": "Climate change is one of the biggest threats to our forests. With more extreme weather, drought and wildfire, increasingly putting pressure on forests, our management plans are now heavily focused on protecting and future proofing our precious woodlands."
        },
        {
            "text": "Storm Arwen’s extreme winds at the end of 2021 caused a devastating loss of trees across several plantations on northern military training areas. The scale of work to clear windblown and fallen trees was considerable, covering an area of 6,000 hectares and more than 20,000 windblown trees."
        },
        {
            "text": "However, whilst the immediate impact of Storm Arwen was devastating, from a longer-term forestry perspective, it gave us an opportunity to re-structure the affected woodlands to make them more resilient; not only to climate change but also to pests and diseases, such as ash dieback, which are a real threat at present."
        },
        {
            "heading": 2,
            "text": "Meeting the requirements of the UK Woodland and Assurance Scheme"
        },
        {
            "text": "Restock site at Sennybridge, Wales [Copyright Landmarc]As well as the stringent processes in place for creating more resilient woodlands within our long term forest plans, the woodlands at Garelochhead Training Area in Scotland have also been certificated under the UK Woodland Assurance Scheme. This was set up as a certification standard by the Government through its UK Forestry Standard (UKFS) to ensure woodlands and forests meet specific criteria to ensure sustainability of operations and correct practice. It also provides certification for forest products to prevent the use of material logged through unlawful practices."
        },
        {
            "text": "We are audited annually through this scheme which covers compliance, harvesting, management works, such as restocking success, species used, cultivation techniques, use of herbicides, plant health, general maintenance and deer management. They also review how we manage designated sites and protected species."
        },
        {
            "heading": 2,
            "text": "Protecting plantations on ancient woodland sites"
        },
        {
            "text": "Rhododendron clearance at Garelochhead Training Area [Copyright Landmarc]One of the recent successes highlighted by the audit team was the clearance of invasive rhododendron across Plantations on Ancient Woodland Sites. Thick rhododendron cloaks large areas of the lower slopes of the site and is now causing issues for access, conservation and biodiversity. In order to comply with UKFS and promote better forestry practices, we have cleared a total of 25 hectares of rhododendron since 2018 through an annual cutting programme, racking arisings and spraying off cut stumps with a top-up spray of the regrowth in the following year."
        },
        {
            "heading": 2,
            "text": "Passionate about playing our part"
        },
        {
            "text": "Maintaining this wide variety of landscapes and terrains on the Defence Training Estate is essential for the preservation of UK woodland, as well as for effective military training."
        },
        {
            "text": "We are therefore all passionate about playing our part to ensure the forests are here and enjoyed for decades to come, and that they continue to thrive for both people and nature."
        }
    ]
}