{
    "url": "https://naturalengland.blog.gov.uk/2022/09/30/paludiculture-the-future-of-farming-on-peat-soils/",
    "title": "Paludiculture – the future of farming on peat soils?",
    "authors": [
        "Jim Milner"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Landscapes and access",
        "Natural England",
        "Peat"
    ],
    "pub_date": "2022-09-30T14:44:24+01:00",
    "content": [
        {
            "text": "On 27 August 2022, the Government announced a new £5m fund to promote the use of peatlands for sustainable farming [1] – the Paludiculture Exploration Fund (PEF), which seeks to unlock barriers to making commercial paludiculture a reality."
        },
        {
            "text": "In this blog post we will explore paludiculture in more depth: what it is, potential uses for paludicultural crops, and the current state of the market. Future blog posts on the PEF will share news of the programme’s progress, and in November we will provide more detail on what the PEF will fund and how to apply."
        },
        {
            "text": "Paludiculture, or farming on rewetted peat, is a system of agriculture for the profitable production of wetland crops under conditions that support the competitive advantage of these crops. In the context of lowland peat soils it is most usually achieved through raising of the water table to achieve wetland conditions."
        },
        {
            "text": "Paludiculture offers a potential solution for maintaining the profitable use of lowland peatland whilst significantly reducing the greenhouse gas emissions associated with their current (dryland) agricultural use. In 2020, emissions from drained agricultural peatlands in England were estimated at 8.5 million tonnes carbon dioxide equivalents. This is around 3% of England’s emissions."
        },
        {
            "text": "While the term “paludiculture” is a recent one, its practice in England goes back generations. In wetlands such as the Norfolk Broads, there are deep traditions of managing and harvesting reed to provide thatch for houses. However, did you know that we are currently importing 95% of the thatching reed we use?"
        },
        {
            "text": "Eighty-eight native UK wetland species have been identified with promising potential for energy, food, fodder, medicinal use, and raw material provision. Exploration of just a few species has begun, with most effort focused on Bulrush (Typha) and farmed Sphagnum."
        },
        {
            "text": "Typha has many potential uses: as a building material (fibreboard and light weight aggregates), as a bioenergy crop and in clothing, to name just a few."
        },
        {
            "text": "Farmed Sphagnum has the potential to replace peat in growing media but is also being explored for biomedical uses and as a source of industrial chemicals."
        },
        {
            "text": "With increasing concern about national food security, the need to develop paludicultural food crops is rising up the agenda. There are a range of potential food crops including bilberry, celery, cranberry, nettle, sedge grains, sweet grass grains, watercress, and water pepper."
        },
        {
            "text": "The opportunities are exciting and the potential environmental gains to be realised are large. However, the commercial growing of these crops in the UK is at a very early stage. There are many barriers to be overcome on how to sow, grow and harvest these crops as well as a need to develop the market for these products. This is where the PEF comes in. As well as offering grant funding we want to hear from the communities and stakeholders that might be thinking about Paludiculutre. Through workshops and events we will learn about the practicalities of adopting these crops.  In so doing we want to develop knowledge and understanding around these exciting new opportunities. Watch out for November’s blog with more details on the PEF."
        },
        {
            "text": "In the meantime, if you would like to read more about the potential for paludiculture in England you should have a look at this Defra funded research project: Defra-LP2-paludiculture-report-April-2020.pdf (ceh.ac.uk)"
        },
        {
            "text": " "
        },
        {
            "text": "____________"
        },
        {
            "text": "[1] Sale of horticultural peat to be banned in move to protect England’s precious peatlands - GOV.UK (www.gov.uk)"
        }
    ]
}