{
    "url": "https://earlyyears.blog.gov.uk/2022/09/30/registering-to-become-a-childminder-with-ofsted-what-to-expect/",
    "title": "Registering to become a childminder with Ofsted: what to expect",
    "authors": [
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Childminder registration",
        "Early years"
    ],
    "pub_date": "2022-09-30T09:01:02+01:00",
    "content": [
        {
            "text": "You’ve thought about it and made the decision – you want to become an early years childminder. But what does that actually mean and what do you need to do to make sure you’re ready to be registered?"
        },
        {
            "text": "You can choose to register with Ofsted or with a childminder agency. You can contact the agencies yourself to find out about their application process and if that route is right for you. Our recent blog on the difference between registering with a childminder agency and registering with Ofsted provides further information."
        },
        {
            "heading": 2,
            "text": "Registering with Ofsted – the application process"
        },
        {
            "text": "The application process can take up to 12 weeks for childminders on the early years register. You can find the full collection of guidance documents and application forms on our website."
        },
        {
            "text": "We carry out suitability checks on people who apply to be a childminder. We complete these checks to make sure that people who want to register are suitable to care for children – our priority is keeping children safe. We will also need to check the suitability of every person aged 16 and over living and working on the premises, such as assistants, co-childminders and household members."
        },
        {
            "text": "You and everyone connected to your application will need an enhanced check with barred lists from the Disclosure and Barring Service (DBS). You’ll also have to have completed specific training courses before applying. Please read our registration guidance carefully and make sure you’re ready before submitting the application form – everything you need to know is in there!"
        },
        {
            "text": "We will keep in contact with you throughout the application process to let you know what information we need and when – if we ask you for additional information, please try to get this to us as soon as possible."
        },
        {
            "text": "Sometimes getting information from other agencies takes longer than planned, but we work closely with them to process applications as quickly as we can. You do not have to chase anyone else for this information, we will do it all for you."
        },
        {
            "text": "We will contact you after we have accepted your application about what you need to do next. We are not able to arrange your registration visit until we have completed all the checks on you and everyone connected to your application."
        },
        {
            "heading": 2,
            "text": "Registration visit"
        },
        {
            "text": "We expect anyone applying to register as a childminder with Ofsted to know and fully understand the requirements set out in the ‘Statutory framework for the early years foundation stage (EYFS)’."
        },
        {
            "text": "At your registration visit, you must demonstrate to the inspector how you will meet these requirements. This is really key; you need to make sure when you submit your application that you are able to do this and are ready to start caring for children."
        },
        {
            "heading": 2,
            "text": "At the registration visit"
        },
        {
            "text": "The registration visit has 3 parts:"
        },
        {
            "text": "You need to be able to demonstrate to the inspector at the visit that you have read the requirements and know how you will meet them. If you are not able to demonstrate to the inspector that you have fully understood and can deliver the requirements of the EYFS, we will not be able to register you."
        },
        {
            "text": "Remember, this is your registration visit and your chance to show us that you are suitable to be a childminder – we want to hear all your ideas so please make sure you are prepared. Usually, we make the registration decision at the visit, so everything needs to be ready to go when we leave. You will have to wait to receive your certificate before you start operating and we try to get this to you as soon as possible."
        },
        {
            "text": "You can read more information about Ofsted’s registration process in our childcare manual. The Department for Education has also published guidance about childminder agencies if you think that is the better route for you."
        }
    ]
}