{
    "url": "https://vmd.blog.gov.uk/2022/09/30/safe-management-for-controlled-drugs/",
    "title": "Safe Management for Controlled Drugs",
    "authors": [
        "Tahira Kauser"
    ],
    "categories": [
        "Legislation"
    ],
    "pub_date": "2022-09-30T10:59:57+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Did you know?"
        },
        {
            "text": "Veterinary practice break-ins are more common than you might think. In many cases, controlled drugs (CDs) are stolen.  Drugs primarily intended for animal use can have significant and serious health effects on humans or can be fatal in the wrong hands; drugs such as ketamine, methadone and diazepam are often the target of these break-ins and can end up being sold on the street."
        },
        {
            "text": "Police forces across the country regularly report these incidents - there are no particular hotspots for this type of crime. So what can you do to make sure you don’t fall victim?"
        },
        {
            "heading": 2,
            "text": "A Safe Haven"
        },
        {
            "text": "To begin with, install a robust safe which is designed and constructed to British Standards, BS 2881:1989 which has three levels of security. The most appropriate cabinet should be carefully selected to suit your premises and the drugs you hold."
        },
        {
            "text": "Retailers of CD cabinets can confirm that they meet these requirements, and you can request formal confirmation when buying from them."
        },
        {
            "text": "Once you have a safe, make sure that it’s properly secured to the fabric of the building - either a solid wall or floor, to make it difficult for anyone attempting to remove it."
        },
        {
            "text": "When possible, the safe room should not be accessible to clients and be kept tidy to avoid drugs being misplaced. It’s a good idea to keep the safe room locked overnight too - the harder it is to access the safe the better!"
        },
        {
            "text": "Where placing the safe in a separate room isn’t possible, the safe should be situated in a secure place and away from public view."
        },
        {
            "text": "CD cabinets must only be accessed by a veterinary surgeon or a nominated responsible person at the practice. You should also apply the same level of security to the keys as to the safe itself, including spares, and it’s important that you don’t have obvious key hooks or lockers close to the safe."
        },
        {
            "text": "Think about what you else you want to put in a safe – for example if you keep large amounts of cash in the practice, you may want to make alternative arrangements for holding it, rather than putting anything else of value in the CD cabinet."
        },
        {
            "text": "And finally, never put labels or signs on a controlled drugs cabinet to indicate its contents."
        },
        {
            "heading": 2,
            "text": "Record books are your best witness – look after them!"
        },
        {
            "text": "It sounds obvious but know what drugs you hold. Keep accurate records of controlled drugs in your Controlled Drugs Register (CDR) so you can easily identify what has been taken should anything go missing."
        },
        {
            "text": "Keep your register in a separate location to the safe – and most definitely not in the safe itself!  In one recent case, a vet kept the records securely (or so he thought) in the safe with the drugs…but when the whole safe was taken, the register went too."
        },
        {
            "text": "In the event of a robbery the CDR will be vital in providing information to the police and authorities.  You can report exactly what has been stolen and how much"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}