{
    "url": "https://ace.blog.gov.uk/2022/09/30/tackling-covid-19-using-data-driven-insights-from-wastewater-analysis/",
    "title": "Tackling Covid-19 using data-driven insights from wastewater analysis",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Data",
        "Data science",
        "Healthcare",
        "Innovation"
    ],
    "pub_date": "2022-09-30T13:07:54+01:00",
    "content": [
        {
            "text": "The Accelerated Capability Environment (ACE) exists to tackle urgent operational challenges, and we were asked to bring our planning, technical and data expertise to bear as part of the national effort to tackle Covid-19. "
        },
        {
            "text": "Early in the pandemic we were approached by the Joint Biosecurity Centre (JBC), now part of the UK Health Security Agency, to help explore the potential of wastewater-based epidemiology (WBE) as an early warning system to help the UK stay ahead of new disease outbreaks. "
        },
        {
            "text": "Working with the JBC’s Environmental Monitoring for Health Protection team, we were tasked with developing and accelerating innovative solutions across the whole wastewater monitoring cycle.  "
        },
        {
            "text": "The aim was to help design an operating model for a scalable and sustainable national wastewater capability which makes effective use of data for environmental monitoring, health protection and national security purposes, forming part of the UK’s critical national infrastructure. "
        },
        {
            "text": "To achieve this, ACE lead an extensive and far-reaching body of work. This comprised of: "
        },
        {
            "text": "This work focused primarily on accelerating technology and research to increase the quality and range of collected data to provide actionable insights. By thinking differently, and approaching the problem with fresh thinking, we were ultimately able to deliver a proof of concept for end-to-end automation of the entire process. "
        },
        {
            "text": "Designing change "
        },
        {
            "text": "Working capabilities demonstrated included: "
        },
        {
            "text": " "
        },
        {
            "text": "ACE also conducted several practical trials to assess the ability to localise the source of an infection including at universities and at a city-wide level. A major success was a care homes trial, where Covid-19 was identified in wastewater outside routine testing, leading to the early identification and isolation of those infected, reducing the spread and protecting elderly and vulnerable residents.  "
        },
        {
            "text": "Overall, ACE’s work on the WBE commission delivered £18million of innovation and accelerated technology development for automating on-site detection by three to five years. "
        }
    ]
}