{
    "url": "https://foresightprojects.blog.gov.uk/2022/09/30/taking-futures-from-a-programme-to-an-integrated-function-in-central-government-departments/",
    "title": "Taking Futures from a programme to an integrated function in central government departments.",
    "authors": [
        "williammoody"
    ],
    "categories": [
        "Advice/Tips",
        "Futures Capability & Resource"
    ],
    "pub_date": "2022-09-30T08:33:45+01:00",
    "content": [
        {
            "text": "The DfE’s Central Analysis Division (CAD) and Strategy Unit (SU) built on a set piece Future Insights Programme, and upscaled and integrated futures-thinking into a central government department. This blog is drawn from Adam Martin and Patrick Lee’s June presentation to the cross-government Heads of Horizon Scanning network. "
        },
        {
            "text": "During the COVID-19 pandemic, the profile of futures-facing work produced by the DfE analysis and strategy teams rose significantly. Their new Permanent Secretary, Susan Acland-Hood, commissioned them to run a ‘Futures Insight Programme (FIP)’: a big-bang of futures-focused work and events. "
        },
        {
            "text": "The goal of the programme was to shift thinking from the reactive mindset (necessitated by COVID-19) to a longer-term vision for the education system, enhancing DfE’s overall strategic approach. "
        },
        {
            "text": "A team drawn across the Strategy Unit, Behavioural Insight Unit and Analysis Directorate delivered the programme over about six months. Nearly all were new to futures thinking, so needed some initial support in upskilling before producing a range of outputs. This required strong programme management using an Agile approach to deliver the multiple strands of development, commissioning, delivery and engagement simultaneously.  "
        },
        {
            "text": "Outputs were categorised using the following framework: "
        },
        {
            "text": "The team has several key lessons to share in setting up a futures-engagement programme. Firstly, diversity is critical. Diversity of sources for scanning, diversity of experts for seminars and diversity of professions bringing analytical and strategic backgrounds to futures. Secondly, senior buy-in was a jumpstart for the programme but making it clear “how this helps” is key for maintaining momentum. Finally, look beyond your department for support. FIP wouldn’t have succeeded without Go-Science, the Open Innovation Team and our external speakers. "
        },
        {
            "text": "Most critically, develop a plan such that an initial event can leave a legacy, leading to the embedding of futures-thinking into a department. For every event, “life after FIP” was considered, with outputs stored and added to a shared futures hub. Now scaled back, the joint team continues to deliver their long-term vision for how futures could help the department deliver on its priorities. They have tied their quarterly horizon-scan into departmental planning processes and worked with teams across the department to consider implications of cross cutting futures challenges. Other teams are already using the materials developed during FIP and they are building better links with futures teams across government to bring in more external expertise. "
        },
        {
            "text": "Key learnings in establishing an integrated futures function: "
        },
        {
            "text": " "
        }
    ]
}