{
    "url": "https://apprenticeships.blog.gov.uk/2022/09/30/the-importance-of-black-history-month-to-apprentices/",
    "title": "The Importance of Black History Month to Apprentices",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentice panel",
        "Apprentices",
        "Black History Month",
        "Insider insights",
        "The Institute"
    ],
    "pub_date": "2022-09-30T09:54:40+01:00",
    "content": [
        {
            "text": "October is Black History Month and this year’s theme is ‘Time for Change: Action not Words’. As an arms’-length body developing apprenticeships and technical qualification for talented people around England, we want to make sure that we are supporting and providing opportunities to all. At IfATE, we have panels of employers from different industries and apprentices completing an array of apprenticeships, who advise on the development of our quality apprenticeships. A few apprentices on the panel have shared their experience and thoughts on the importance of Black History Month."
        },
        {
            "heading": 2,
            "text": "Why is Black History Month important?"
        },
        {
            "text": "Saskia, Chair of the panel of apprentices, thinks that Black History Month"
        },
        {
            "text": "Tamzin sees this as a “month of reflection.” She said:"
        },
        {
            "text": "Napa expressed a similar sentiment:"
        },
        {
            "text": "She added:"
        },
        {
            "heading": 2,
            "text": "Why is diversity and representation important in apprenticeships?"
        },
        {
            "text": "Saskia said:"
        },
        {
            "text": "Amy, who is on a solicitor apprenticeship, believes"
        },
        {
            "text": "When it comes to apprenticeships specifically, Amy said:"
        },
        {
            "heading": 2,
            "text": "What changes would you like to see in the world?"
        },
        {
            "text": "Dilraj, whose apprenticeship is in sales, marketing and procurement, said:"
        },
        {
            "text": "He added:"
        },
        {
            "text": "For Black History Month, Napa’s workplace allocated chat messages for the cause to post relevant information on her company-wide communications channel.  She said:"
        },
        {
            "text": "Tamzin commented:"
        },
        {
            "text": "If you want to be part of these conversations, and have a positive impact on apprenticeships, consider joining the panel of apprentices – recruitment is open now."
        },
        {
            "text": "Next week our Black History Month blog will be what changes our staff and apprentice panel members have seen in their lifetimes."
        }
    ]
}