{
    "url": "https://earlyyears.blog.gov.uk/2022/09/30/welcome-to-ofsteds-early-years-blog/",
    "title": "Welcome to Ofsted's early years blog",
    "authors": [
        "Yvette Stanley, National Director Regulation and Social Care",
        "Lee Owston, Deputy Director, Schools and Early Education",
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2022-09-30T09:00:49+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director Regulation and Social Care, Gill Jones, our Deputy Director, Schools and Early Education, and Alex Magloire, our Deputy Director, Early Years Regulatory Practice, on launching a new early years blog and what we intend to focus on in the coming weeks."
        },
        {
            "text": "Welcome to our new early years blog. You’ll be able to read about developments specifically in the early years sector here. We will use this platform to raise awareness and promote a better understanding of education and care in children’s early years."
        },
        {
            "text": "We’re launching the blog at a time when we have placed early years education at the heart of our new 5-year strategy. Although many children do well in the early years, over a quarter are not where they should be in their learning and development by the age of 5, a situation that has been exacerbated by the COVID-19 pandemic."
        },
        {
            "text": "Amanda Spielman spoke at the Nursery World Business Summit 2022 and summed up the situation in the early years sector well:"
        },
        {
            "text": "‘It’s absolutely fair to say that early years doesn’t get the attention you’d expect given the size of the sector and the importance of your work.’"
        },
        {
            "text": "This new blog aims to shine a spotlight on early years and give it the attention that it deserves."
        },
        {
            "text": "So, what do we mean by ‘early years providers’?"
        },
        {
            "text": "One reason for a lack of attention is that people often don’t know what an early years provider is."
        },
        {
            "text": "Whereas a school or a college has a fixed and easily recognisable building, and therefore a fixed and easily recognisable idea of what it is, the early years sector is wide ranging in its types of providers. These include:"
        },
        {
            "text": "In terms of number of providers, the early years sector is by far the biggest of our remits. Around 70,000 providers deliver early years provision to children aged 0–5."
        },
        {
            "text": "We are both the regulator and inspectorate for early years providers. This means that we register and support continued registration for providers, and we also inspect providers against the relevant criteria in the education inspection framework (EIF)."
        },
        {
            "text": "With such a diverse group of practitioners, our guidance for registration and inspection is naturally diverse too. We aim to be as clear and accessible as possible with this, and have recently published ‘Ofsted EIF inspections and the EYFS’ to help answer some of the recurring questions that we hear from providers about inspections of early years providers under the EIF."
        },
        {
            "text": "Keeping in touch"
        },
        {
            "text": "You do an incredibly important job. As a result, we need to ensure that our channels for communication and the information we put on them are helpful and that we are  sharing information with you on the topics you want to hear more about. Particularly for those of you who are lone providers, it is important to foster a sense of community among early years practitioners and we hope to do our bit to help facilitate this."
        },
        {
            "text": "Over the coming weeks and months, we’ll discuss topics that are important to the sector, such as registering as a childminder and the difference between registering with us and with childminder agencies. However, we would love to hear from you about what you want to know. Please send your suggestions to contentteam@ofsted.gov.uk."
        },
        {
            "text": "To keep up to date, you can sign up for email alerts for this blog, follow us on Twitter and, if you’re a childminder, follow our Facebook page."
        },
        {
            "text": " "
        }
    ]
}