{
    "url": "https://ace.blog.gov.uk/2022/09/30/what-we-mean-when-we-talk-about-mission-led-innovation/",
    "title": "What we mean when we talk about ‘mission-led innovation’",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Innovation",
        "People and skills",
        "Ways of working"
    ],
    "pub_date": "2022-09-30T15:53:19+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "ACE was launched in 2017 as an experiment to find new ways to very quickly solve complex problems – originally those facing law enforcement and security agencies – in ways that delivered impact to what we call the mission front-line. "
        },
        {
            "text": "‘Mission-led innovation’ is our answer to the question ‘what does ACE do?’ "
        },
        {
            "text": "But lots of organisations describe themselves as being mission-oriented or mission-led. The word ‘mission’ can refer to what an organisation exists to do, or to things it sets out to achieve. In both private and public sectors, the mission statement is a declaration of intent or ambition. "
        },
        {
            "text": "GCHQ, for example, has ‘a mission to keep the UK safe’. The UK Government has set out 12 ‘levelling up’ missions with goals to achieve by 2030 that range from boosting employment and skills, to cutting crime and creating more housing. "
        },
        {
            "text": "And then there is perhaps the best-known example of a mission approach: the Apollo programme. In 1961, John F Kennedy set America the goal of putting a man on the moon by the end of the decade. A simple statement of ambition, not a detailed plan for achieving it. It sparked an explosion of innovation across multiple industries and sectors as different people and organisations played their parts in making it happen – all driven with that clear outcome in mind. "
        },
        {
            "text": " "
        },
        {
            "text": "Start at the end "
        },
        {
            "text": "For ACE, to be mission-led is to relentlessly focus on the outcome we want to achieve through a piece of work and use that to drive the behaviours and processes that will successfully deliver it. We tend to think of that in terms of delivering impact – making a difference to those whose problem, challenge or need brought them to ACE in the first place. "
        },
        {
            "text": "That might be a software tool that does something clever with data that a frontline police officer couldn’t do before, making their job easier and more efficient, helping them deliver on the wider mission of keeping the public safe. "
        },
        {
            "text": "It could be a complex AI algorithm that compares medical scan diagnostics more quickly and accurately than a human can, helping clinicians deliver better health outcomes. "
        },
        {
            "text": "Or it might be deep research into an emerging technology landscape that helps security services better prepare for new threats, or the development of a target operating model that enables a public sector body to respond to the demands of digital transformation.   "
        },
        {
            "text": "ACE delivers at pace, addressing challenges that tend to have a sense of urgency for those on the front line – the police officer or clinician, for example. By solving their problems and helping them be more effective, we contribute to wider missions, such as keeping the public safe or improving patient outcomes. "
        },
        {
            "text": " "
        },
        {
            "text": "A measure of impact "
        },
        {
            "text": "The OECD’s Observatory of Public Sector Innovation (OPSI) defines mission-oriented innovation in relation to addressing major societal ‘grand challenges’ such as climate change, clean oceans, sustainable economic growth and the future of work: "
        },
        {
            "text": "‘Mission-oriented innovation includes any new or improved technological, social and organisational solution (product, process or service) that aims to respond to one or several of the grand societal challenges (missions) and create public value to society.’ "
        },
        {
            "text": "https://oecd-opsi.org/projects/mission-oriented-innovation/ "
        },
        {
            "text": "Addressing the big challenges will usually involve solving smaller challenges that will together deliver the desired outcome. A mission such as ‘keep the public safe’ would be impossible for an organisation like ACE to deliver alone. So, you could think of us as one of the many ways to address the ‘missions within missions’ that deliver immediate real world impact that contributes to broader long-term outcomes. "
        },
        {
            "text": "And that is the common thread to all this, whether a grand ambition or an urgent need, we believe ‘mission-led’ is all about working towards impact. "
        },
        {
            "text": "There’s a famous story from the Apollo project, in which President Kennedy visits the NASA Space Center and meets a janitor. When he asks what the man does for NASA, the janitor replies: ‘I’m helping put a man on the moon’. "
        },
        {
            "text": "ACE has a diverse core team of people with skills ranging from project management, commercial contracting and tech wizardry. But whatever their role, they all share that mission mentality and play their part in delivering impact. "
        }
    ]
}