{
    "url": "https://nda.blog.gov.uk/our-tenth-nda-group-supply-chain-event/",
    "title": "Our tenth NDA group supply chain event",
    "authors": [
        "Emma Ferguson-Gould"
    ],
    "categories": [
        "Supply Chain"
    ],
    "pub_date": "2025-01-15T15:45:05+00:00",
    "content": [
        {
            "text": "On 16 January 2025, the NDA will be hosting its tenth supply chain event, which is recognised as the largest supply chain event in Europe. This event is being hosted in Telford."
        },
        {
            "text": "To mark its decennial, Emma Ferguson-Gould, NDA Group Commercial and Business Development Officer, discusses the history of the event, the successes borne out of it and the importance of the NDA group collaborating with its supply chain to advance its nationally important mission."
        },
        {
            "text": "The NDA is tasked with decommissioning the UK’s earliest nuclear sites safely, securely, and sustainably. It’s a mission delivered by over 17,000 people within the NDA group working in and on our 17 sites across the UK, covering over 900 different roles."
        },
        {
            "text": "Additionally, we have over 5,000 organisations in our supply chain, therefore it’s not just the economic contribution across the country that is vast, it’s the employment opportunities as well."
        },
        {
            "text": "An event like this is our chance to bring together the fantastic companies we collaborate with, showcase their success, how they support the NDA group, and attract new businesses to the nuclear decommissioning sector, particularly small-medium enterprises (SMEs)."
        },
        {
            "text": "The NDA are proud to develop and maintain a diverse, sustainable, ethical, and innovative supply chain. We work to maximise the value of our assets and capabilities to generate additional income and enhance our reputation as a global industry leader, ensuring government procurement, and supply chain policy and standards are fully delivered."
        },
        {
            "text": "Our supply chain event was initially launched in 2011 in Bolton with 700 people in attendance. Since then, the event has gone on to attract more than 10,000 visitors, representing thousands of companies at events in Manchester and Telford. It is thought to be Europe’s largest decommissioning-focused networking event."
        },
        {
            "text": "We see people from our site licence companies, their direct suppliers, SMEs, and even international nuclear industry colleagues come and offer potential innovative solutions to help overcome our challenges. It’s been a place to develop networks and explore collaborative opportunities to help us progress our mission and deliver increased value for taxpayers, and we’ve seen so many fantastic and diverse examples of these over the years."
        },
        {
            "text": "A classic example would be the “ACKtiv Nuclear” joint venture of Jacobs, Atkins, and other partners, which back in 2016 was seen as the longest-running joint venture at Sellafield, supporting the First-Generation Magnox Storage Pond (FGMSP), an open-air pond which dates back to the 1950's and was constructed to store, cool and prepare used Magnox nuclear fuel for recycling into new fuel. The first removals of radioactive sludge from this pond were made possible using equipment and systems researched, designed, installed, and commissioned by this joint venture. This venture was cited for the way it embraced innovation by utilising pioneering 3D design technology and for furthering the advances that were made in decommissioning a highly active, legacy facility, in areas such as the cleaning and preparation of the pond walls and installing pipe bridges and sludge-pumping platforms. This partnership has now evolved, with The Decommissioning Alliance (TDA), constituted by many of the same partners, still supporting FGMSP via the Decommissioning Delivery Partnership."
        },
        {
            "text": "If the NDA group is going to successfully deliver its decommissioning mission, a vibrant supply chain is critical to that success. The involvement, support and innovation that comes from our supply chain is hugely important to us. 95% of our suppliers are UK based and, more than a third of our spend with the supply chain last year was with small and medium enterprises."
        },
        {
            "text": "Since 2012, we’ve increased our spend with SME’s from 14% to 38%, exceeding the target, which was set to us by Government, covering a wide range of areas including site operations, ICT and technology, manufactured products and waste services, and capital projects and infrastructure. It’s examples such as these that really do reinforce our ongoing commitment and collaboration with our supply chain."
        },
        {
            "text": "A particular part of the event that is a highlight for me, is our supply chain awards. These awards not only demonstrate how important the supply chain is to our mission but showcase the variety of innovative work being delivered by businesses throughout the UK and beyond on the NDA’s behalf. We recently announced the winners for these on our social media channels, so I’d encourage you to visit those to find out more."
        },
        {
            "text": "I can’t wait to welcome those attending on 16 January to Telford and share the marvellous innovations from our mission critical supply chain."
        }
    ]
}