{
    "url": "https://environmentagency.blog.gov.uk/2025/01/15/prison-fines-and-disqualification-for-these-waste-criminals/",
    "title": "Prison, fines and disqualification for these waste criminals",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2025-01-15T11:46:44+00:00",
    "content": [
        {
            "text": "We are delighted with the court sentencing of three men found guilty of illegally dumping more than 26,000 tonnes of waste – the equivalent weight of around 2,170 double-decker buses - at 17 sites across the country. "
        },
        {
            "text": "They are estimated to have avoided landfill tax costs of more than £2.7 million.  "
        },
        {
            "text": "Conning owners of land, farms, industrial units and even an airfield, the trio entered into lease agreements under false pretences.  "
        },
        {
            "text": "Instead, they dumped bales of household and business waste, leaving the landowners’ facing the cost of clearing the waste - estimated to be more than £3.2 million.  "
        },
        {
            "text": "Marcus Hughes, already in prison, was given a further 30 months custodial sentence and disqualified from acting as a company director for 10 years.  "
        },
        {
            "text": "Robert McDonagh was also disqualified from acting as a company director for 10 years; ordered to pay £10,000 each to four victims; given 21 months custodial sentence suspended for two years; 30 days rehabilitation order and three months curfew order.   "
        },
        {
            "text": "Richard Hopkinson was ordered to pay £25,000 to one of the victims at £1,000 a month; given 20 months custodial sentence suspended for two years; 30-day rehabilitation order and 180 hours community order.  "
        },
        {
            "text": "Emma Viner, Environment Agency Enforcement and Investigations Manager, said: "
        },
        {
            "text": "“Operation Cesium was a complex investigation into large-scale waste dumping across the country by a callous gang who spared little thought for their victims and the environmental, financial and health impacts they caused. "
        },
        {
            "text": "“These sentences show that the court understood the seriousness and impact of the crimes in this case. Criminals like Hughes, Hopkinson and McDonagh have nowhere to hide. We will continue to find and shut down waste criminals, bringing the worst offenders before the courts to face justice for the damage they have caused.”"
        },
        {
            "text": "Help us shut down waste criminals by reporting any suspected illegal waste activity to our partner, Crimestoppers – 100% anonymous, always: Giving information anonymously | Crimestoppers or call: 0800 555 111"
        },
        {
            "text": "If you work in the waste industry make sure you are operating legally by checking you have the correct environmental permits: Waste: environmental permits - GOV.UK"
        },
        {
            "text": "Read more about Op Cesium"
        }
    ]
}