{
    "url": "https://defradigital.blog.gov.uk/2023/06/20/data-driven-success-celebrating-two-major-digital-export-milestones/",
    "title": "Data-driven success: celebrating two major digital export milestones",
    "authors": [
        "Neil Johnson"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "User research"
    ],
    "pub_date": "2023-06-20T10:30:38+01:00",
    "content": [
        {
            "text": "Programme Delivery Manager Neil Johnson shares his experiences of working closely with the Animal & Plant Health Agency to build and launch two digital services which are helping exporters of plant and animal goods."
        },
        {
            "text": "In Defra we are changing how we deliver our services to citizens and businesses. For the past couple of years we have been working with agri-food exporters to design digital services to provide necessary Export Health Certificates  and Plant Health (phytosanitary) Certificates. The focus on user needs didn’t stop once the services launched into public beta. We have continued to iterate and expand these services and this year we are pleased to have reached two major milestones:"
        },
        {
            "heading": 2,
            "text": "Using data to improve user experience"
        },
        {
            "text": "These milestones are useful to mark the usage of our digital services, but our job is to make lives easier for our users. This means looking beyond the headlines and working with our performance analyst to analyse data from Google Analytics and understand how users interact with our service."
        },
        {
            "text": "This includes gathering data on whether our users prefer to copy previous applications or start new ones each time, how they like to use the search function when finding applications, and whether they experience problems at any stage of their journey."
        },
        {
            "text": "We use data to help us make better decisions about the overall design of our service. For example, we can track how many applications end up being rejected because the necessary information hasn’t been provided – this tells us that we need to improve the forms we present to users, to make it easier for them to provide the right information."
        },
        {
            "text": "We use data to understand the times of day throughout the week that user tend to use the service, which helps us to conduct performance testing and ensure smooth running of the service."
        },
        {
            "heading": 2,
            "text": "Complementing data with user research"
        },
        {
            "text": "The data we gather from our service tells us whether it’s working well, how users interact with it and where users encounter problems. But data alone won’t tell us why users interact with the service in the way that they do."
        },
        {
            "text": "We complement our performance analysis with user research, to make sure we understand the context our users work within, and to identify where we need to join things up better to support their needs. I wrote about this topic last year, in particular how we communicate user research findings in order to help our broader service team and business leaders understand and empathise with users."
        },
        {
            "text": "For example, with our recent work we noticed through data analytics that some users encountered problems when uploading plant commodity details using spreadsheets. This told us that there was a problem, but it was only through interviews with users that we were able to understand why the problems were being encountered, and how best to resolve them. We were able to use this insight to redesign the content on this part of the service and make it easier to follow for both new and existing users."
        },
        {
            "heading": 2,
            "text": "What really matters"
        },
        {
            "text": "Major milestones offer a great opportunity to pause and reflect on the work that has been done but, as this work has demonstrated, data can be used for so much more than vanity metrics."
        },
        {
            "text": "That said, key milestones don’t come along very often, so we want to use the opportunity to celebrate and thank the team for all their hard work in helping to make life easier for our users over the last few years. No one person or activity makes a service successful - it can only happen when a good team works together to make it a success, and we’re fortunate to have a great one!"
        }
    ]
}