{
    "url": "https://naturalengland.blog.gov.uk/2025/03/20/a-new-era-for-englands-nature-celebrating-the-publication-of-the-second-local-nature-recovery-strategy/",
    "title": "A New Era for England's Nature: Celebrating the Publication of the second Local Nature Recovery Strategy",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Development",
        "Environment Act",
        "Environmental Improvement Plan",
        "Local Nature Recovery Strategy (LNRS)",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2025-03-20T15:51:40+00:00",
    "content": [
        {
            "text": "By Emily Butterwick – Northamptonshire LNRS Senior Officer"
        },
        {
            "text": "This month we celebrate the publication of North Northamptonshire Council’s Local Nature Recovery Strategy (LNRS). It marks a significant milestone towards our country’s efforts to tackle biodiversity loss, climate change and improving people’s access to nature as part of a growing national Nature Recovery Network. Out of a total of 48 Strategies in the pipeline, North Northamptonshire is the second to reach publication so far. It highlights what can be achieved when Local Authorities, NGOs and wide-ranging local partners work collaboratively towards a shared ambition for nature recovery."
        },
        {
            "heading": 3,
            "text": "What went well in North Northamptonshire?"
        },
        {
            "text": "Local Action, National Impact"
        },
        {
            "text": "Local Nature Recovery Strategies are part of the Government’s national policy on nature as set out in the 2021 Environment Act.  Taken together they form a nationwide strategy for improving, enlarging and connecting England’s natural habitat so that wildlife has the best chance to thrive. They aim to drive more co-ordinated, practical and focused action to recover nature. Selected Local Authorities, collectively covering the whole of England, have been tasked by Government with developing these plans for nature, biodiversity and wider environmental goals."
        },
        {
            "text": "North Northamptonshire’s LNRS brings together local actors to develop nature recovery projects, tailored to the region’s specific needs. North Northamptonshire Council lead the development of the Strategy as the Responsible Authority (RA) with input from partners including the public, the Wildlife Trust Bedfordshire, Cambridgeshire and Northamptonshire (BCN), Northamptonshire Biodiversity Records Centre (NBRC), Natural England (NE), Forestry Commission (FC) and the Environment Agency (EA). With their priorities reflected in the Strategy, these partners now have both a stake and agency to deliver on them. Delivery of the LNRS will contribute towards meeting the Government’s Environmental Improvement Plan targets, supporting our national objectives."
        },
        {
            "text": "The LNRS identifies priority areas through the production of a Local Habitat Map. The RA commissioned Natural Capital Solutions to undertake this key task. This consultancy had already shown its skill in analysing complex datasets to identify opportunities for nature recovery through an earlier Natural Capital and Habitat Opportunity project. The mapping was praised during the review process for the advanced analysis of multiple data sources, which resulted in clearly indicated priority locations where action for nature would be most effective. If all nature recovery actions presented on the Local Habitat Map are delivered, we could see an increase in land managed sympathetically for nature by 24.5%."
        },
        {
            "text": "Biodiversity and Ecosystem Restoration"
        },
        {
            "text": "At its core, the LNRS aims to restore habitats for wildlife, helping to secure biodiversity for future generations. The Upper Nene Valley Gravel Pits Special Protection Area (SPA) has seen reduction of wintering birds at a faster rate than the UK average (76% decline in Golden Plover, and 45% decline in Lapwing populations since 2011). The LNRS focuses on practical actions to reduce recreational pressure and increase the extent of supporting habitat for these declining species. It’s one of many areas where Natural England’s experts supported the Strategy. In this case, Natural England’s ornithologists gave their advice on measures to support the SPA and inform North Northamptonshire’s Local Plan development."
        },
        {
            "text": "Delivery of the Strategy will help to reverse the damaging effects of habitat fragmentation, providing corridors for wildlife to thrive. The Wildlife Trust BCN produced a Statement of Biodiversity. This ensured that the LNRS was informed by current records of the state of nature, as well as clearly describing the pressures and constraints on each habitat type over time and the action required to halt and reverse this."
        },
        {
            "text": "NBRC were commissioned with producing the priority species list, interrogating all relevant data on species in the area. The final species list was presented to local experts and wildlife recorders who were able to ground-truth the proposals, and ensure the list reflected the true state of nature in North Northamptonshire."
        },
        {
            "text": "Community Engagement and Partnerships"
        },
        {
            "text": "In developing their Strategy, the RA has placed a high value on community involvement. Its success will rely on everyone working together toward a common goal: to create thriving, wildlife rich landscapes. North Northamptonshire Council, as RA, recognised this and ensured that they engaged with groups and organisations that had a stake in the process at an early stage."
        },
        {
            "text": "The RA commissioned local charity, Nene Rivers Trust, to create and deliver a stakeholder engagement plan, utilising their expertise in communicating complex environmental topics to a variety of audiences. In addition, the RA visited schools and retirement homes, after noting that the voices of these age groups are typically missing when engaging with the public."
        },
        {
            "text": "The Strategy puts a strong emphasis on integrating nature recovery into land use and farming practices. It emphasises the need to work with farmers and landowners to adopt sustainable practices, and to adopt nature-based solutions that benefit both the environment and the economy. The farming community has been engaged throughout the process, ensuring that their opinions are reflected and the practical actions proposed on farmland are achievable."
        },
        {
            "text": "Alongside the LNRS, North Northamptonshire Council has produced a Delivery Mechanisms document, preparing partners for delivery of the Strategy."
        },
        {
            "text": "Resource and Capability"
        },
        {
            "text": "As a collaborative undertaking involving many partners, the way North Northamptonshire Council has resourced and coordinated the process has been key to their successful development of the Strategy.  Early on, the Council appointed a dedicated Nature Recovery and Biodiversity Lead officer, highly experienced in the planning system and able expertly to lead the process."
        },
        {
            "text": "They also established the governance structure for the process at the start to ensure that all key partners were included in task groups relevant to their area of work. And there were consistent lines of communication between the RA and key agencies, Natural England, Environment Agency and Forestry Commission."
        },
        {
            "text": "As we celebrate the publication of the second LNRS, it seems pertinent to share a few reflections from the Strategy’s launch event. Nene Rivers Trust CEO Kathryn Soares commended the “bold and brave” decision to have a bottom-up approach with the Strategy’s development, empowering local partners to play a key role in LNRS creation. The Wildlife Trust BCN Conservation Manager, Matt Johnson, commented on the recent success of their beaver reintroduction project (practical action number 100) – saying “if we’ve managed to achieve that action, the other 107 will be a breeze”. Hard work and dedication will achieve nature recovery, and all who attended left the event feeling inspired."
        },
        {
            "text": "As a national policy, Local Nature Recovery Strategies are a step change in the way we plan for nature so that it can thrive and function across the landscape. And that means nature will be there for us, for our health, wealth and security. Meeting that ambition is a long road ahead but North Northamptonshire’s LNRS takes us one significant step towards it."
        }
    ]
}