{
    "url": "https://mhclgmedia.blog.gov.uk/2025/03/20/council-tax-levels-publication/",
    "title": "Council tax levels publication",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2025-03-20T13:00:43+00:00",
    "content": [
        {
            "text": "The government has today published the Council Tax levels set by local authorities in England for 2025-26. This showed the national average council tax bill will increase by less than last year under the previous government. We know that families are struggling with the cost of living and that is why we are committed to keeping taxes on working people low by working hand in hand with the sector to fix the foundations and bring long-term financial stability."
        },
        {
            "text": "The average Band D council tax increase set by local authorities in England for 2025-26 will be 5.0% on the 2024-25 figure, the lowest increase in two years. The increase was 5.1% last year on 2023-24 and 5.1% on 2022-23. "
        },
        {
            "text": "Individual local authorities are responsible for setting their council tax and are free to keep council tax levels low. However, the government has kept the referendum threshold for council tax at 3%, with 2% for the adult social care precept, to protect local taxpayers from excessive increases.  "
        },
        {
            "text": "As with previous years, ministers considered requests for additional rises from councils that require exceptional financial support. This government took a stricter approach, putting working people at the forefront of decisions, and only agreed flexibilities for six local authorities in severe need, and where they have low existing levels of tax and plans to protect the lowest income residents. "
        },
        {
            "text": "For years, councils have suffered from short-term solutions and an outdated funding system, which is why we are working hand in hand with local leaders to reform the system and fix the foundations. The government has proposed changes to create a fairer funding system by adjusting for councils' differing ability to generate council tax income when allocating grant funding.  "
        },
        {
            "text": "We are also making available more than £69 billion, a 6.8% cash terms increase, of funding to councils across England and working with them to drive forward the government’s Plan for Change. Taken together, the additional funding announced by the Chancellor at the Autumn Budget and through the 2025-26 Local Government Finance Settlement will provide more than £5 billion of new funding for local services over and above what is raised through local council tax. "
        },
        {
            "text": "The government encourages anyone experiencing difficulty paying their council tax bill to contact their council, as a range discounts and exemptions are available. Councils are required to put in place council tax reduction schemes to support those on low incomes, and 3.7million households currently receive this support. In addition, support for pensioners is prescribed by government and provides a reduction of up to 100% for those on the lowest incomes.  "
        },
        {
            "text": "A Ministry of Housing, Communities and Local Government spokesperson said:  "
        },
        {
            "text": "“We are under no illusion about the scale of financial issues facing councils we inherited and our work is underway to fix the foundations and bring long-term stability to the sector."
        },
        {
            "text": "“And while councils are ultimately responsible for setting their own council tax levels, we have been clear that they should put taxpayers first and carefully consider the impact of their decisions.  "
        },
        {
            "text": "\"That’s why we are maintaining a referendum threshold on council tax rises, so taxpayers can have the final say and be protected from excessive increases.”  "
        }
    ]
}