{
    "url": "https://ipo.blog.gov.uk/2025/03/20/legocy-in-the-making-an-ip-story/",
    "title": "LEGOcy in the making: an IP story",
    "authors": [
        "Amber Ockenden",
        "Christina Watts"
    ],
    "categories": [
        "3D Shape Trade Mark",
        "Business",
        "International",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-03-20T10:00:00+00:00",
    "content": [
        {
            "text": "There's something magical about watching your children's imagination come alive through LEGO. I recently sat in amazement as my son engineered a car using nothing but LEGO bricks and elastic bands. His eyes lit up with pride as he demonstrated his creation, carefully explaining every technical detail of how he'd made it work. It wasn't something from an instruction manual - it was purely from his own creative mind. "
        },
        {
            "text": "These moments of inventive play are what LEGO is truly about. While the colourful sets with their detailed instructions are brilliant fun, it's when the bricks are scattered across the floor and my children are deep in concentration, bringing their wildest ideas to life, that I see the real value of these little plastic blocks. From spaceships with improbable engines to fantastical creatures that exist nowhere else, every creation tells a story and shows me how their minds work in wonderfully unexpected ways.  Our team mate Amber recently delved into the fascinating story behind these beloved bricks, exploring LEGO's remarkable journey from a small Danish woodworking shop to a global brand and the crucial role intellectual property has played in protecting their innovation along the way."
        },
        {
            "heading": 3,
            "text": "Ground-breaking innovation in toy design"
        },
        {
            "text": "LEGO was founded by Ole Kirk Christiansen in 1932 and, remarkably, the family still owns the company. The name LEGO comes from two Danish words, “leg” and “godt”, meaning “play well”, and the bricks were the first of their kind. Originally protected by patents like  GB908097, LEGO is now the world’s most valuable toy company, with a now estimated 86 LEGO bricks per person in the world. Although there are competitors, LEGO dominates the market thanks to its high quality. The plastic is dyed, not painted, and the mix of ingredients is precise enough to make each brick extremely durable.  "
        },
        {
            "text": "Since the Christiansen family filed their first patent back in 1958, LEGO's journey has come a long way. The late 1960s saw the arrival of Duplo, the larger brick designed for smaller hands and in 1979 the toy figure, now known as the mini figure, was patented. Suddenly LEGO sets could include people and police, fire and rescue sets started popping up on shelves. These, along with the accessories to compliment them, allowed  children to play within the world they had created. "
        },
        {
            "text": "By the mid 1970’s, LEGO’s original patents began to expire, forcing the company to think creatively about their IP protection. The company turned to copyright and trade marks to protect its brand, filing two applications for 3D shape trade marks in 1996. While LEGO were able to register the shape of their products as trade marks, they can be complex to obtain. If you’re interested in filing an application for a 3D shape trade mark, we recommend consulting a trade mark attorney [link]: CITMA - Find a Chartered Trade Mark Attorney.  "
        },
        {
            "heading": 3,
            "text": "The value of IP protection "
        },
        {
            "text": "IP is vital to LEGO and the toy industry, providing essential protection and incentives for manufacturers and creators. Patents safeguard its innovative technologies, while trade marks protect its brand identity, fostering consumer trust and recognition. Strong IP protection helps prevent counterfeiting, ensuring the integrity of genuine products and encourages investment in research and development, leading to a broader range of creative and engaging toys. "
        },
        {
            "heading": 3,
            "text": "Protecting the LEGO universe "
        },
        {
            "text": "The LEGO Group has extensive IP protection, but how does it maintain it all? Counterfeit bricks are notably different to the real thing - they vary in quality and can be faded, flimsy, and may not even slot together with others of its kind. LEGO Group does a great deal of work to help prevent further IP infringements , including seizing the fakes and educating future generations. "
        },
        {
            "heading": 3,
            "text": "Block to the Future: LEGO's Modern Evolution "
        },
        {
            "text": "As a global brand, LEGO has been at the forefront of innovation for decades. A distinctive part of its brand are lucrative partnerships such as those with Marvel and Star Wars. Diversity plays a key part in LEGO’s innovations. The company is striving to increase its representation of women, people of colour, people with disabilities and people in the LGBTQ community with their products. These include new LEGO Friends characters with limb differences and braille bricks that come with an online course to help children use them for both fun and education.  Ever inventive, for as long as Lego continues to reinvent itself, it’s clear that it has a bright future.   If you've enjoyed stacking up the facts about LEGO's remarkable IP journey, don't forget to subscribe to our blog for more fascinating stories about intellectual property [link]: https://ipo.blog.gov.uk/subscribe/"
        }
    ]
}