{
    "url": "https://rpc.blog.gov.uk/2025/03/20/rpc-offers-to-help-government-achieve-a-25-reduction-in-the-administrative-costs-of-regulation/",
    "title": "RPC offers to help Government achieve a 25% reduction in the administrative costs of regulation",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2025-03-20T19:43:53+00:00",
    "content": [
        {
            "text": "We welcome the announcement by the Chancellor of the Exchequer of a “Radical action plan to cut red tape and kickstart growth” including a pledge to cut the administrative cost of regulation on business by a quarter by the end of the Parliament."
        },
        {
            "text": "Of course, administrative costs are typically only a small part of the total costs of regulation, nonetheless there is a lot of work to do to deliver on this commitment. This will involve: defining exactly what is meant by ‘administrative costs’; estimating the baseline (that is the total administrative costs of all current regulations) against which the 25% reduction target will be set; and then tracking progress across government and regulators in delivering the cost reduction."
        },
        {
            "text": "The RPC has been working for more than 15 years to support the government in reducing the burdens of regulation on business and the wider economy. We have seen repeatedly the tension between reducing regulatory costs and other government priorities. Our experience has shown that reducing regulatory costs can only be delivered when Government and Government ministers prioritise and commit to making it happen. We are therefore keen to help government in developing this target, ensuring that it does not lead to perverse incentives and offering our expertise in independently verifying the cost reductions achieved."
        },
        {
            "text": "We hope that the Government will achieve its target to reduce administrative costs and look forward to working with them to deliver on this challenging commitment."
        }
    ]
}